[{"id": "b62e8dcecc1d6d92c0b24ca3f3c01e6b39674e1b", "text": "THE EXECUTION OF LOUIS RIEL.\n\nSPEECH OF THE\n\nHON. JOHN S. D. THOMPSON,\n\nMINISTER OF JUSTICE.\n\nDELIVERED MARCH 22, 1886.\n\nThe House resumed the adjourned debate on the proposed motion of Mr. Landry (Montmagny): That this House feels its duty to express its deep regret that the sentence of death passed upon Louis Riel, convicted of high treason, was allowed to be carried into execution; and the motion of Sir Hector Langevin: That this question be now put.\n\nMr. THOMPSON (Antigonish). Although so much has already been said in the course of this debate, as the hon. member for West Durham (Mr. Blake), on Friday evening, intimated that the time had come when the House should hear from the law officer of the Government, that he time had come when I should rise, if I intended to rise at all, it is becoming that I should accept the hon. member's challenge and make, at this stage of the debate, late though it may appear, and tedious though the debate has already been, such a statement of the facts immediately connected with the part that my Department has had in this transaction as it was proper to make before the debate should close. I regret, Sir, the more because I am a comparative stranger in this House, that my first duty in making such a statement is to express my regret at the manner in which this discussion has been carried on, and the way it has been brought before the House.\n\nSome hon. MEMBERS. Hear, hear.\n\nMr. THOMPSON (Antigonish). It has been said, Sir, and the cheer that comes from hon. gentlemen opposite means a reaffirmation, I presume, of the statement, that the Government have chosen the mode and the time in which this question should be discussed and, as the hon. member stated, had framed the indictment. Even if that were true—as it is not, Mr. Speaker—I ask the hon. members who have just given that cheer, how they are to escape the responsibility for the manner in which they have carried on the discussion down to this moment? Mr. Speaker, it has been said from time to time in the course of this debate—it was generously admitted by the hon. member for Brockville (Mr. Wood) the other day—for the purpose of argument only, I presume—but it was contended by the other side of the House most vehemently, that the right to discuss this matter at every step and every stage rested in Parliament precisely as if Parliament sat as a court of appeal.\n\nMr. MILLS. Hear, hear.\n\nMr. THOMPSON (Antigonish). I should like the hon. gentleman who says, \"hear, hear,\" and those who follow him, and any hon. gentleman who has engaged in this discussion or takes any interest in it, to point to a precedent which justifies the opposition. I should like them to point to a case in any Parliament in the British Empire, in which any man incurring the responsibility of a member of Parliament would say, \"hear, hear,\" to such a proposition as that. We have had, not only the contention that Parliament is to be the court of appeal before which the whole evidence is to be discussed, and before which the whole evidence is to be sifted by lawyers on both sides of the House, but we have been entertained day after day by speeches for the defence. We have not merely had such a discussion as would take place in a court of appeal, but gentlemen have been speaking with carefully prepared briefs, analyses of evidence, and authorities, upon all of which this House is to be expected to pass an opinion and decision. I have only to state the case as it is to bring the House to the consciousness that this is not a suitable tribunal, that the temper which prevails in a Legislature composed of two actively hostile parties is not a place in which the administration of justice in any particular case can suitably be discussed. We have not only been told that Parliament is a court of appeal to try a question like this, but that, if Parliament comes to a wrong conclusion, the people at the polls are to decide it. If we have heated controversy and partisan feeling in this House which prevent the House coming to a judicial conclusion such as a court of appeal would arrive at, I should like to ask hon. gentlemen opposite how will it be when we go to the polls? Is partisanship, for the first time in the history of the country, to be eradicated there? Is a calm and cool consideration of the merits of a particular case—of the fate of a particular convict—to be made\nby the people of this country at the polls; and if so, will hon. gentlemen opposite pledge themselves that when the case is submitted for the determination of the electors we shall not have passions and partisan feeling appealed to on other issues, the National Policy, the Canadian Pacific Railway, and all the questions which have divided parties in this country for the last ten years? I need no better confirmation of this protest which I make against such a discussion on a motion of this kind in Parliament, as has taken place, than the attempts which hon. gentlemen opposite have made to prevent our bringing to the case a calm and deliberate judgment. The member for West Durham himself, in the opening expressions of his speech on Friday, condemned anything like feeling. He deplored the introduction into the debate of bygone issues and political considerations, and the sound of his voice had hardly died away in the expressions of those sentiments, when he declared to the House, in tones that rang from end to end of this Chamber, that he intended to hold the Government responsible for every life that had been lost, for every pang that had been suffered, and for every dollar that had been expended.\n\nMr. BLAKE. Hear, hear.\n\nMr. THOMPSON (Antigonish). I should like the hon. gentleman to state how, after an assertion like that, how after the statement of the hon. member behind him who proclaimed three times in the course of this discussion that the men on the Treasury benches of this House are greater criminals than the man who died on the scaffold at Regina—I should like to ask him how, after expressions like that had been bandied about in this debate, he expects this House to come to a conclusion in the manner in which a court of appeal would decide on any particular case? Not only has that attempt been made to prejudice the discussion, but hon. gentlemen have complained bitterly at a step which has been taken to preclude the introduction of other issues by which the judgment of the House might be misled. The hon. member for West Durham (Mr. Blake), in addressing himself to an interlocutory resolution the other day, declared that it was contrary to sound policy and to fair play that the previous question should be moved. If this matter is to come before Parliament as before a court of appeal—if this House is to arrive at a just determination on this question, upon what ground should hon. members be allowed to introduce other issues? The hon. gentleman was so candid as to avow, before his speech on that motion was concluded, that he had no hope, even if such amendments were moved, of having them carried, because, he said, we must eventually come down to this resolution. Then he would simply have had the advantage of having the House come to a decision on this question with a clouded judgment and with partisan feelings, raised by the discussion of issues on which hon. gentlemen opposite seek to bring against the Government the charges which have been bandied across the House in this debate, of guilt in connection with other transactions altogether. I said, Sir, that I felt it my first duty to express this opinion to the House, and I am glad to know that some hon. gentlemen opposite feel as I do. The hon. member who addressed the House on Friday evening so long and so ably, has filled the office which I have the honor to hold at present. He is conscious of the great difficulties which beset a Minister of Justice in advising the dispensing of the clemency of the Crown, and within the last three months the hon. gentleman said, in a great public assembly:\n\n\"I know how much these difficulties are enhanced by heated partisan and popular discussion, in which distorted views and an imperfect appreciation of the facts are likely to prevail.\"\n\nAfter that frank admission I would suppose that if this question was to be argued in this House, as it has been argued by the other side, as a question of confidence, we should at least not have had those \"heated partisan and popular\" appeals made in order that the judgment of this House might not be taken upon the real question that is before it. Let me turn the attention of the House for a moment to the manner in which, in the country to which this Parliament looks for a model, questions of this kind are considered. I am not venturing to dispute the right of any hon. member, much less of the whole House, to challenge the conduct of any Minister of Justice for the time being as to the way he should have advised the Crown upon the case of any convict; but I am challenging the propriety of exercising that right to such an extent as it has been exercised here. On 20th July, 1877, Mr. Gathorne Hardy, who held the office of Home Secretary, said:\n\n\"He hoped the time would not come at which the House would fail to rely on the Executive, either to exercise the prerogative of mercy, or to carry out the law to its fullest extent.\"\n\nHe also said:\n\n\"Suppose the records to be produced, were they to re-trial the case upon them without seeing the witnesses? That would be a most unusual proceeding, only to be resorted to when there was some suspicion of corruption or partiality at the trial.\"\n\nMr. Gladstone, in the course of the same debate, said:\n\n\"It appears to me so desirable that in a matter of this kind the prerogative of mercy should be left in the hands of the Crown, to be exercised according to the advice the Crown may receive from those whose duty it is to give it, that only in the extreme cases should I wish to support a motion which strictly interposes the judgment of the House for the purpose of swaying the judgment of the Crown.\"\n\nAnd Mr. Gladstone abstained from voting upon the question which was then before the House. In another case, in 1870, in the course of a debate, part of which the hon. member for West Durham (Mr. Blake) read to the House, Mr. R. N. Fowler said:\n\n\"Such cases ought to be left entirely in the hands of right hon. gentlemen opposite. This House was, in the nature of things, one of the worst places where the question of the comparative guilt of a murderer could be properly considered, for it was a legislative assembly and not an executive body.\"\n\nOn the 3rd of July, 1884, Mr. Trevellyn said:\n\n\"I regret very much that that decision is come to\"—That is, the decision of the Executive not to commute the sentence.\n\"I regret very much that this decision has been come to, but we have felt ourselves bound to arrive at it and I do not consider that the House of Commons in a place where cases can be tried over again.\"\n\nSir William Harcourt, who, we were told the other day, is a great statesman, said:\n\n\"It is a very serious thing to reconsider, in a matter of this description, the deliberate decision of a judicial tribunal. Although, of course, I do not deny for a moment the right of any member of Parliament to bring forward a matter at any time, still I am sure that it is most inconvenient and almost impossible for this House, upon ex parte statements or even upon an argument of the case, to arrive at a proper decision of the matter. We cannot dispose of matters of this kind by a debate, even if it be most calmly and carefully conducted, in a popular assembly.\"\n\nMr. Trevellyn said again:\n\n\"The discussion has shown how inconvenient it is to try a case of that kind over again in the House of Commons, for the hon. member who has just spoken practically tried the case over again—\"\n\nI can repeat those words with emphasis, when I reflect upon the speech that we listened to last Friday.\n\n\"not from any new evidence he has brought forward in regard to the case itself, but upon an argument in connection with a case that occurred in Manchester some years ago in which it was shown that there was a case of mistaken identity—\"\n\nI think we should as far as possible recognize the principle that the question of dispensing the mercy of the Crown should not become a matter of debate in this House.\"\n\nIf this is to be done, if a political discussion is to follow the action of the Executive in every case in which clemency is given or refused, one can easily understand what confusion we shall introduce into the administration of criminal justice in this country. The greatest criminal who may be condemned by the tribunals will have some hope that if his case can only be thrown into the vortex of politics, to quote the language of Louis Riel on the day \"Batoche,\" \"politics will save me.\" He will point to the fact that, fifteen years ago, a political party in this country made a desperate effort to gain power by appealing to public passion about a great tragedy which took place, and that having failed in that enterprise, fifteen years afterwards they considered they could climb into power on the feeling provoked by another tragedy—first trying fortune upon the fate of the victim, and then trying it upon the fate of the murderer. It will result, Sir, that the Executive, especially if it be weakly supported in this House and in the country, must seek to do, not what is right merely, not what is justice merely, not what is a fulfilment of the law merely, but that which is most popular in the country, in view of the fact that the case is likely to be tried all over again in the House of Commons as a court of appeal, and in view of the fact that afterwards it will be tried all over again at the polls. More than this, we have had already indicated a still more serious result. It is not merely that the administration of justice is to be brought into disrepute, not merely that its just enforcement is to be endangered, but if the Executive shall attempt to carry out the law, then in relation not merely to the Executive itself, but in relation to the people who support its policy, and all people who believe that it was simply carrying out the law and discharging its duty, a cry of revenge, as my hon. friend from Kent (Mr. Landry) said, is to go up, and be kept up, by one section against the other. We shall have, then, not merely the administration of justice degraded, but we shall have, as indeed we had in the month of November last, the cries of civil war raised in our own streets, when they had died away on the banks of the Saskatchewan. We have heard, at each stage of the debate, the cry for more papers. I do not presume to discuss what was done in the House last Session, although I have had full access to its records, but I have noticed that this Session the cry became more urgent and more emphatic the more papers were brought down. We had first the cry that the record was not complete. We had issued to the public and laid on the Table of the House all that constitutes, technically, the record in criminal cases—all that would go before a court of appeal—all that should be asked for here if this Parliament is to be considered a court of appeal. There was even more than that in the blue book which we printed and circulated; but we had hardly met when we were told that we must have all the arguments upon the controversy about the postponement of the case, although that argument resulted in an agreement between the counsel which withdrew the matter from the consideration of the court altogether. Those papers were brought down, and the cry became louder and more urgent still for more papers. We were told there was a controversy on the trial as to whether Louis Riel should be allowed to defend himself, besides being defended by counsel—\"bring that down.\" We brought that down to this House, and the cry became more urgent still.\n\n\"We have not the judge's charge here,\" it was said, and one hon. member told the House that we were not even in a position to tell the House that the judge's charge was before the Court of Appeal in Manitoba, although the blue book which he held in his hand contained the judgment of that court, in which one of the judges said that he had great satisfaction in being able to say that he had read the whole charge and that he endorsed every word of it. Well, we brought down the judge's charge and the cry became more urgent still. One said all the papers that were asked for were not brought down, and another complained that we had brought down more than were asked for—simply for the reason that those which were brought down were not as satisfactory to them as some hon. gentlemen expected. Let me turn the attention of the House again to the practice which prevails in the British Parliament upon that question. I have looked, I think I may say, at every case which has come up for consideration in that Parliament for the last twenty-five years, and I have been unable to find a case in which the papers connected with a criminal case were laid before Parliament at all. The question has arisen there sometimes on the motion to go into Committee of Supply, sometimes on a question which the Home Secretary has to answer, but never upon a motion of want of confidence—never with the request that the papers should be brought down. But, while I have been unable to find a record produced to Parliament in such a case, I am able to find that it was refused, for, on the 17th of May, 1878, in the discussion of the case of George Bromfield, reports touching the insanity of the prisoner were asked for, and Mr. Ashton Cros, the Home Secretary, said that \"all the communications made to the Secretary of State in the matter wore of a confidential character, and therefore he did not consent to produce them.\" I think, Sir, that as soon as the papers which remain to be brought down are laid upon the Table of the...\nHouse, the desire of some of the hon. members for papers will be more urgent than ever. They will not like the papers which are yet to come down any more than they like those which have been brought already; and when they have seen them all, the hon. member for West Durham (Mr. Blake), will say: \"These are not the papers at all,\" and he will ask for the papers which he said were lying \"mouldering unopened\" in our offices. As an illustration of the unreasonable ness with which some of these demands have been made upon us, let me call the attention of the House to a single instance. On the 17th of March an hon. member moved:\n\n\"That an Address to His Excellency the Governor-General be presented for a full and complete report of the trial of Thomas Scott, charged with 'treason-felony' at Regina, giving the evidence for the Crown and defence, together with addresses of counsel and charge of the Stipendiary Magistrate. Report of the trial and sentence of the half-breed prisoners at Regina for 'treason-felony,' together with the evidence submitted to the Stipendiary Magistrate's Court in mitigation of sentence, and addresses of counsel for the prisoners.\"\n\nThese papers, connected with the trials that took place afterwards, had a very doubtful relevancy to the case; but the point I am making now is that when the Address of this House was asked for on the 17th of March for these papers, they had already been on the table 42 hours. We have not the advantage on this side, perhaps, of hearing all that goes on in this House, but we can imagine, in view of that illustration and of some facts we do know, how true and appropriate this comment by a bystander is upon this cry for papers:\n\n\"I was amused to-day at Mr. ———. He was tearing the Government to tatters for not having the papers down. Where is the diary of Louis Riel?\" he cried, and then aside to Laurier. \"Is that down?\" \"No,\" whispered back Laurier. Then Mr. ———became furious in his denunciations because it wasn't down.\n\nI think, Sir, that at an earlier stage of this discussion, the hon. member for Bellechasse (Mr. Amyot) saw the difficulty the House would meet in the discussion of a question of this kind, and in receiving and acting upon the doctrine that this House was to be a court of appeal; for the hon. member declared almost in so many words, that he and his friends were justified in treating this case as an exceptional case, because it came from the North-west Territories; and the hon. member read to the House a section of the Act which provided that the report of a capital case tried in the North-west Territories should come to the Executive.\n\nMr. MILLS. Hear, hear.\n\nMr. THOMPSON (Antigonish). I shall read—especially as an hon. member of my own profession on the other side of the House says \"hear, hear\"—two sections of the law—the section bearing on cases in the North-West Territories and the section bearing on cases in the various Provinces, and will ask what the difference is. The general law, taken from the Act of 1873, applying to every Province in this Dominion, is:\n\n\"The Judge before whom such prisoner has been convicted shall forthwith make a report of the case, through the Secretary of State for Canada, for the information of the Governor, and the day to be appointed for carrying the sentence into execution shall be such as in the opinion of the Judge will allow sufficient time for a signification of the Governor's pleasure—before such day.\"\n\nNow, the provision relating to the North-West is this:\n\n\"When any person is convicted of a capital offence, and is sentenced to death, the stipendiary magistrate shall forward to the Minister of Justice full notes of the evidence, with his report upon the case, and the execution shall be postponed from time to time by the stipendiary magistrate, if found necessary, until such report is received, and the pleasure of the Governor General thereon is communicated to the Lieutenant-Governor.\"\n\nNow, the only difference between the two sections is this: First, it is provided that the judge in a North-West case shall furnish full notes of the evidence—and the hon. member laid stress upon that point. I can only say to him that, full as the notes of the evidence are in this and in every capital case coming from the North-West, they are not one iota fuller than the reports of capital cases which we receive from the Provinces; and as regards the postponement of the day of the execution of the sentence, although the power is specially conferred upon the stipendiary magistrate in the North-West Territories, it is still fully competent to the judges in the other Provinces to respite until the pleasure of the Governor is made known. The provision making it mandatory upon the stipendiary magistrate to postpone in the case of North-West trials was inserted, I believe, in consequence of the remoteness of the country and the difficulties of communication; but in practical working the two provisions are identical, and a case coming from the North-West Territories has no more connection with the functions of this House or the politics of the country than a case coming from the Province of Quebec or the Province of Nova Scotia.\n\nBefore I refer to the criticisms which were passed upon the trial of the case, and as one of the preliminary observations I wish to make, I desire to reply to a remark which was made by the hon. member for Bouchelag (Mr. Desjardins) the other evening. Replying to a remark of the Minister of Public Works, he asked how the Minister of Inland Revenue, and how the Minister of Justice could reconcile with truth the statement which had been made in this House that there had been a change in public opinion in the Province of Quebec? He referred to the meetings which had taken place at St. Jerome and St. Colomb, at which I had the honor of assisting, and at the latter of which my hon. colleague, the Minister of Inland Revenue, was with me. The hon. gentleman wanted to know what we had to say, after those meetings, of the state of feeling in the Province of Quebec? I answer that if we are to judge from what we saw, there had been a great change of feeling in the Province of Quebec. The people were disposed to listen to reason, to argue out, and to truth, and there was no more passion evinced at those meetings than at any meetings of equal size called in any other part of the country, for the discussion of public questions. If I had to judge from the reports we saw in the press, I should have to give the hon. gentleman a different answer; but at present I shall testify from what I saw, not from what I read in the papers afterwards. I should think the hon. gentleman would have hesitated to ask me, in the presence of this House, what I thought of the change of public feeling in the Province of Quebec, when we have so many\nwitnesses to cite on the floor of this House. We know that a few days after the execution, in the city of Montreal, a set of resolutions were passed declaring that this execution was a base murder, and that the three Ministers representing that Province in the Cabinet were men who had degraded their race and were traitors to their country. Resolutions were passed declaring that this was a crime which should never be forgiven; and the hon. gentlemen in this House, some of whom have addressed it already and some of whom are to follow me, were the men who, in the presence of fifty thousand of their fellow-countrymen, secured the unanimous adoption of these resolutions. Yet those gentlemen, in the course of this debate, have risen and declared that the information before the House is not sufficient to enable them vote, not for a resolution that the execution was a murder, not for a resolution that we are traitors, not for a resolution declaring that we shall never be forgiven, but for a resolution expressing in the mildest terms a regret that the law was allowed to take its course. In fact so mildly was the resolution worded that it excited the suspicion of the hon. member for West Durham (Mr. Blake), and he declared that the Government must have drawn this indictment. I wish to make one other preliminary observation, an observation with regard to the hon. member for Bellechasse (Mr. Amyot) in respect of a matter in which, I think, he did me, unconsciously, an injustice. About ten minutes before this debate began, when the hon. member for Montmagny (Mr. Landry) was about to take the floor, the hon. member for Bellechasse (Mr. Amyot), without having given any notice of his question, rose and asked a question involving a number of details, as to whether the medical reports from Regina had been received by telegraph, and if so, at what date, and would they be brought before the House, and involving other particulars as well. I stated that I was unable from memory to answer the question on the spot, presuming the hon. gentleman would, as he subsequently did, put it in writing, and give me an opportunity to furnish the particulars asked for. I thought that it was somewhat ungenerous on the part of the hon. gentleman (but it probably was due to his misunderstanding my answer), when he said that members of the Government were so disposed to trifle with this great question and with the wishes of the House itself, that when they were asked a vital question the answer was that they could not remember. He forgot he was asking a question involving particulars which could not be stated without looking at the documents themselves, or the records of the Department, and of which he had not given any notice, and that therefore he could not expect the information to be at once supplied. The hon. gentleman had been in this House two weeks of the Session; he had already asked for papers of almost every description, and if it had occurred to him to put his question a little earlier than ten minutes before the debate began, I should have been in a position to say something more definite than that I was not able to answer from memory. We have had the point raised and pressed with great earnestness, that the trial was an unfair one, and we have heard it asserted by a member of the legal profession, that although it was a legal trial it was not a fair one. I confess, after having given that observation all the reflection I have since been able to give it, I am unable to understand it; I am unable to understand how the Executive can be condemned for not having given to the prisoner something more than the law gave him, as regards the procedure in this trial. We have generally understood, throughout this Empire, that a synonym for fair play as regards the administration of criminal justice was British law, and yet we are told now, for the first time, in a Parliament existing under British institutions, that the Government are to be condemned because their counsel conducted the trial in such a way, that although strictly in accordance with the law, it was an unfair trial. Now, let me ask the House to bear with me for a few moments while I address it upon those points in respect of which it was said the trial was unfair. We were told by the hon. member for West Durham (Mr. Blake) that the judges were inferior judges. I presume he meant, technically, that they were judges of an inferior court, and not that he meant to impugn their professional standing or abilities as members of the judicial bench. But that is an entirely irrelevant enquiry. The jurisdiction, whether the courts be superior or inferior, is plainly conferred upon them by law; the law of the country requires that, whether these be superior or inferior judges, they should take cognizance of cases like this. It has been said that the courts there were peculiar in their organisation. The criticism, pointing, as I suppose it did, to the conclusion that the trial was unfair and unsatisfactory, for otherwise it would be what the hon. gentleman distinctly said it was not, a purely theoretical objection, a purely theoretical criticism—his criticising pointing to such a conclusion, induced me to bring to the House the provisions of the law on that subject. In 1875, a case of this kind would not have been tried by the judges who, he says, are inferior. The provision of section 64 of the Act of 1875 gave the trial of capital cases to the Chief Justice or any Judge of the Court of Queen's Bench of the Province of Manitoba, and required the intervention of a jury not exceeding eight in number. In 1877, that Statute was altered; the jurisdiction of the Chief Justice and of the judges of Manitoba was taken away and given to stipendiary magistrates to be appointed in those Territories, and the number of jurors was reduced from eight to six. It is true the hon. member might have pressed upon us one other consideration, and that is, that then there would have been present, even under the Act of 1877, upon the bench, not merely the stipendiary magistrate but two justices of the peace as well. I take it that that is an objection which the hon. gentleman himself and his followers lay very little stress upon; because we have not had, from the beginning to the end of this discussion, the complaint that there have been too few justices of the peace to try this man, but we have had only the complaint that there were too few jurors. The Statute of 1877, creating this court, took away the jurisdiction of the judges who, in the Act of 1875, would have tried the case, and reduced the number of jurors, and that Act was introduced in this House by hon. gentlemen opposite, when the hon. member for West Durham (Mr. Blake) was himself Minister of Justice. I say this, not for the purpose merely of saying tu quoque, not for the purpose of making a political comparison between the legislation of one party and the legislation of another, but for the purpose of drawing, what I think is a legitimate conclusion from these facts, namely, that if both sides of the House had acquiesced in this legislation, confiding in the great abilities which the hon. member for West Durham was able to bring to the preparation of the Statute, the Government had no occasion to mistrust it, or to believe it was ill considered, and I had no.\noccasion to expect that the hon. member would have raised, as one of the criticisms by which he sought to make this House believe the trial was unsatisfactory, that the trial took place before one of the very men into whose hands, by his own Statute, he had put the issues of life and death. It is said, Sir, that these judges are to some extent political officers, inasmuch as they are, by virtue of their offices, members of the North-West Council. When I turn again to the legislation on that subject, I find that that provision was inserted not by the gentlemen who sit on this side of the House, but by the gentlemen who had in this case to administer the law, but was put by gentlemen opposite into the Act of 1876. It was said that these judges are, to a certain extent, dependent upon the Executive. I fail to see any very broadly marked distinction in these days between judicial officers who hold their office during good behaviour and judicial officers who hold their offices during pleasure, considering that the state of public sentiment in regard to officers of that kind, and the disposition of Parliament, in dealing with a Government that would dare to exercise its pleasure unfairly and without due cause, would be such as to make a judge, even if appointed during pleasure, practically irremovable except for cause. But the tenure of office was established by those gentlemen; those travelling fees, for which it is said they depend upon the Executive, were allowed by these gentlemen themselves, and year after year those travelling fees and those allowances, which it is said made fallible the judgment of the judges there, or might have made their judgment fallible, were introduced and voted by hon. gentlemen opposite, and, after they went out of office, were voted for by them without a murmur or complaint. It was said likewise that a grave mistake had been made in the selection of the judge. It was said that Judge Richardson stands in the position of Attorney-General in the North-West. I think that that is hardly a correct statement of his position there. He acts, it is true, as law clerk to the North-West Council, as legal adviser in reference to the legal business that comes before that Council, and as such he receives a paltry, almost a nominal, emolument, which is likewise voted to him, not by the Executive, but by the Parliament, and can only be paid to him by virtue of an Act of Parliament. The criticism was likewise made that Judge Richardson was a member of that Council when it undertook to pass an expression of opinion upon the conduct of the Executive in this very case. In justice to Mr. Richardson, I must say that, when those resolutions came before the North-West Council for deliberation, he withdrew from the Board. I think that the choice of Judge Richardson was as wise a choice as could have been made. He was no appointee of ours; it could not be said that for any political services he had rendered to this Government or this party in the past he had received his judicial office, because he received his appointment at the hands of hon. gentlemen opposite; and I presume he received it, as all judges are supposed to receive it, on account of qualifications for the duties he had to discharge, one of those duties being, by virtue of the very Statute which they passed themselves, the disposition of capital cases. Besides that, he was the senior judge in the North-West, and, in that respect, as well as in regard to his professional qualifications—as to which I will say little, because it would be invidious to make a comparison between him and his colleagues—he seemed to be at the head of the list of those who had to be entrusted with the execution of this very serious duty. But when we are told that there is danger of any of these tribunals being corrupted by the circumstance that this Parliament votes them moneys from time to time for their travelling expenses or allowances for the discharge of any other public duties incidental to their office, or otherwise, the hon. gentleman raised, in my mind at least, the recollection that, in the great Province which he represents, a large portion of the judiciary receive a considerable augmentation to their salaries, from the Provincial Government. I should like to ask at what stage in the parliamentary existence of this country partisan strife became so hot that any hon. gentleman degraded himself by aspersing the judiciary of Ontario, even in regard to the questions which arose between the Government of the Dominion and that of Ontario, by suggesting that the minds of the judges were warped by the additions to their salaries which they received from the Provincial Government? I ask then whether the hon. gentleman's criticisms were quite fair to the Government or to the officer more particularly mentioned? If it was not intended to asperse the mode of conducting the trial, as being unfair, on account of these considerations, I ask why these criticisms were introduced at all? I ask why the public confidence in relation to the administration of justice by these tribunals should be weakened by such criticisms, unless to show Parliament that the trial was unfair? The hon. gentleman said that these difficulties ought to have been removed. I understood him to intimate—it was the conclusion, I admit, which I drew from his language more than the language itself—that it would have been better if, last Session, in view of the difficulties which had arisen in the North-west, the Government had created special tribunals there for the trial of these offenders. At any rate, he did express plainly that it was the duty of the Government to have provided some special legislation in regard to those tribunals. I ask the House if, after the crime had been committed, after Louis Riel had come into this country and had stained his hands with the blood of our citizens, and after the rebellion had been suppressed, the Government had changed the law, had made new tribunals, and had put that criminal in a different position from that in which he stood when he came into the country, there would not have been a feeling from one end of Canada to the other that we had passed an ex post facto law, and had done an injustice which should not have been done to the vilest criminal in the land? That, sir, is my own opinion on that point, but I am able to cite an authority for it too. Within the last two or three months, a gentleman who discussed public questions very ably, in a portion of this country not very remote from this place, undertook to discuss the various phases of this trial. He was a gentleman able to bring to the discussion of these questions long experience and high abilities, which are known to every section of this country. He had this to commend him too—I shall not say it was the hon. member for West Durham (Mr. Blake), I can hardly think it was, when I heard his speech, but it was a namesake of his, and that gentleman said in reference to this very trial, in reference to this very criticism which had then gone abroad, in reference to this very suggestion that it would have been better if the Government had taken special legislation in reference to these tribunals:\n\n\"But I do not say that the Government is consenable for having tried the prisoner by the tribunal provided by the standing laws, though I may regret that those laws did not provide a more satisfactory tribunal.\"\nNow, sir, there is another point in which the fairness of the trial has been challenged. It was said that Louis Riel, being of the Roman Catholic faith, it was suspicious that the only Roman Catholic juror called was challenged by the Crown. I have only to say this, sir—and I say it upon the authority of the counsel who conducted this case on behalf of the Crown—that until that statement was made on the floor of this House the counsel for the Crown were not aware what that man's religion was. I am able to assure the House on their authority, which, I am sure, will not be impugned here, or anywhere else in this country, that there were other good reasons given why he should be challenged, and that the question of religion never entered into their consideration at all. The hon. member for West Durham thinks that that could hardly be so, because, he says, if it were so there would have been a challenge \"for cause.\" Every person practicing at the bar—and I appeal to all my professional brethren on both sides of the House to confirm the statement—knows that in the trial of causes there may be doubts as to the qualification, mental or otherwise, of jurors, doubts as to the soundness of the judgment which they may bring to the cause, doubts as to their partiality as jurors, which cannot be verified on a challenge \"for cause,\" because, perhaps, the witnesses are at a distance who could prove the objections, and it is better and safer in the public interest, safer in the interests of justice, to challenge peremptorily. Although there were a number of jurors challenged on that occasion by the defence, this is the single instance in which a juror was challenged on the part of the Crown, and he was challenged, as I said, for reasons which it might be indecorous for me to communicate to this House—reasons, however, which affected the minds of the counsel for the Crown with doubts as to the partiality and wisdom with which he might discharge his duties as a juror, but not in any way in relation to his sect, his creed or his race. Then the criticism was made that the trial was an unfair one because other prisoners were not tried for high treason. They were charged with the offence, equally grave, perhaps, but not so severely punishable, of treason-fealty. I fail to see how that could affect the regularity or the fairness of the trial, which took place before it was decided at all what these men should be brought to trial for. If the graver charge of high treason were not withdrawn then, as to these persons, how could any person, in the interest of Louis Riel, or of justice generally, say that the fairness of his trial was affected by something that took place afterwards? Then some criticism was made with regard to the non-trial of the so-called \"white settlers\" of Prince Albert. An investigation was then going on to ascertain which of the white settlers of Prince Albert, if any, should be brought to trial, and because they were not then brought to trial, I understand it is sought to draw the inference that Louis Riel's trial was an unfair one, or that some invalid distinctions were made with regard to it. Now, sir, I come to the next point which was pressed, not so much by the hon. member for West Durham as by other hon. members, and I think very sincerely as well as very ardently pressed by some of our friends from the Province of Quebec, that a month's delay was asked to enable this man to prepare for his trial. Let me assure the House upon the authority of the papers which were brought down to this House days ago, that no application for a month's postponement was submitted for the judgment of the court at Regina. This is what took place:—Counsel for the defence, after the disposal of the preliminary question of an objection to the indictment, submitted affidavits asking for a postponement. They intimated that they would ask for a month's postponement. They made application for a month's adjournment. That application, before it could be ruled upon by the judge, was taken into consideration by the counsel for the Crown, and those counsel made to the counsel for the defence this proposition: \"You are asking a month's delay; it is unreasonable, because in a week witnesses can be brought here from any part of Canada; we will consent to a week's delay, and as our own side of the case shall take three days more, you will thus have ten days, beyond all doubt.\" They said: \"That will be enough for you, because you shall not be put to the trouble of summoning witnesses in the ordinary way; we will join you in telegrams, as counsel for the Crown, telegraphing to those witnesses, wherever they are, not only asking them to come, but pledging ourselves for the Department of Justice to pay their expenses.\" The counsel for the Crown said: \"We will do more than that. The practice in the administration of justice in the North-West Territories is to use the mounted police for the purpose of serving the summons, and we will put our own officers at your disposal for the purpose of summoning your witnesses, as soon as possible.\" Now, Sir, let me take up the list and see who these witnesses were for whom this month's postponement was demanded, and let me see in what manner this application of the defence was treated. There were three witnesses in the territories of the United States adjoining the North-West Territory. Everybody knows that in the case of witnesses in a foreign country to whom no commission has been sent, and for whose attendance no process would be sufficient, no court of justice would grant an adjournment. But it was not an adjournment that was wanted with regard to those persons. Ten days would have been ample to bring them there. What the counsel for the defence asked in respect of Gabriel Dumont, Michel Dumas and Napoleon Nault, was not simply that they should have their expenses paid, which we would have assented to, not merely that they should have been summoned, which we would have assented to, but that we should pledge ourselves that if they came to testify, no proceedings would be taken against them in connection with the past. That was a pledge which counsel for the Crown were not authorised to give. It would never do, Sir, in the conduct of a trial for a rebellion of that kind, to give an amnesty for the worst actors in the rebellion, under the guise of a subpoena to attend court. There were three other witnesses, clergymen, \"whom,\" said the counsel for the defence, \"we require to have here—Father André, Father Fourmond, and Father Touse.\" The counsel for the prosecution said: \"We will summon them for you.\" Now, as regards the medical witnesses, counsel for the defence asked for Dr. Roy, Dr. Clarke, Dr. Valée and Dr. Howard, and every man of them was summoned by the Crown; every man of them received the assurance that his expenses would be paid by the Government. Then there were Mr. Vankoughnet and Mr. Burgess, who were wanted to bring the papers from the Department of the Interior. But everybody knows that papers to be produced for the purpose of showing that the half-breeds had grievances, or that there was delay in attending to their grievances, even if such papers were in existence, were absolutely inadmissible at that trial.\nI read not cite authorities for that. The hon. member for West Durham himself appreciated his position as a lawyer too well to urge that contention, and stated candidly to the House that evidence with regard to the grievances was properly rejected at the trial. No other decision could have been arrived at, and the expression of the law on the point could not have been better put than it was put by Mr. Richardson, who said:\n\n\"It is no justification, in the trial of a prisoner charged with an unconstitutional agitation, that he made a constitutional agitation at any other time.\"\n\nFor that reason only the Crown counsel declined to order the attendance of Mr. Vankougnet and Mr. Burgess, and we have the admission, which it was necessary for any professional man having a sense of honor to make to the House of the hon. member for West Durham (Mr. Blake), who stated that evidence like that was inadmissible at the trial. I have shown that, with the exception of the two witnesses from the Department to prove that which would not have been evidence, and with the exception of the three witnesses for whom an amnesty, and not a subpoena, was asked, Crown counsel pledged themselves to summon all the witnesses for the defence and pledged them selves to pay them. We shall now see how far they carried out that duty. For the purpose of showing the House that this matter, which is urged as an element of unfairness in relation to the trial, was never submitted to the tribunal at all, never came before Judge Richardson to pronounce judgment upon, I will read from the report in the Globe of July 30th what, as I have related, took place after counsel had arrived at that understanding. In regard to the proposed adjournment for a month, counsel for the Crown—Mr. Christopher Robinson, Q.C.—announced to the court the understanding that had been arrived at. He said:\n\n\"All those witnesses who are in this country can be got in week just as well as in a month, or a year. The Crown will do more. The Crown will join with my learned friend in telegraphing to those three gentlemen who are at Quebec and those three gentlemen who are at Prince Albert. I desire that to come from the Crown as well as from them and the Crown will pay their expenses.\"\n\n\"Mr. Fitzpatrick to the Justice.—I read the Order in Council as conferring very limited powers. However, that difficulty is all obviated by the offer made by the Crown.\"\n\nThe counsel for the defence withdrew this matter from the consideration of the Court, having arrived at an understanding with the counsel for the Crown; and I propose to state to the House what was done in the discharge of that agreement so arrived at, because the case, I admit, is all the worse if, after having withdrawn that application from the consideration of the court, they did not fairly and honorably fulfil the obligation they had undertaken. On the 21st July, 1885, the Deputy Minister of Justice sent this telegram from Regina to Drs. Clark and Howard:\n\n\"You are required here on Wednesday next as witnesses for the defence on Riel's trial. Expenses will be paid by Crown.\"\n\nMr. Lemieux and Mr. Burbidge sent the following telegram to Dr. Roy:\n\n\"Youself, Vallée and Charles Vincelotte required here Tuesday, 23rd, as witnesses for defence—Riel's trial. Accept this as a warning, and please warn Vallée and Vincelotte. Expenses paid by Crown.\"\n\nDr. Roy telegraphed back on 22nd July, thus:\n\n\"Dr. Vallée sick; unable to go. Dr. Clark, Medical Superintendent of Toronto Asylum, will replace him under same conditions and go if asked. Tell Lemieux and answer immediately.\"\n\nTo which answer was made as follows:\n\n\"Lemieux sorry that Vallée cannot come, but cannot help it. Clark has been summoned. Will expect yourself and Vincelotte as warned.\"\n\nOn the same day, 22nd July, Dr. Howard telegraphed to Sir John A. Macdonald for confirmation of the telegram, and said: \"If all right will go up at once.\" But Dr. Howard, in consequence, as it is stated by the hon. member for Montreal (Mr. Curran), of infirmity of health, felt unable to undertake long journey alone; and requested that a fee of $500 should be paid him. The member for West Durham (Mr. Blake), says he regrets that, in consequence of that, the Crown refused to procure his testimony. The hon. gentleman was not aware, of course, of the explanation which I am about to give him, but I am sure he will withdraw, at least, that condemnation of the Government, after I make him acquainted with what was actually done. Although Dr. Howard declined to go unless he was paid $500, and notified the Department of Justice, the Minister, instead of declining to pay that fee, placed the matter before the counsel for the defence. This was my predecessor's telegram:\n\n\"Dr. Howard declines to go for less than $500 cash down. Will prisoner's counsel be satisfied with anyone else, or shall I pay him the money and start him off.\"\n\nALEXANDER CAMPBELL.\n\nTo Sir Alexander's telegram the following telegram was sent to Ottawa for the purpose of giving Dr. Howard his reply. It was sent after consultation with the counsel for the defence and with their full concurrence:\n\n\"Defence do not ask Crown to pay any such fee. Please let Howard know that if he will not come for the fees allowed by law he need not come.\"\n\nSo the House now has the information with respect to that demand for $500—that we even offered to pay that fee, and start Dr. Howard off, if the counsel for the defence required him, and the answer was received that they did not desire the Crown to pay the fee. I shall not detain the House by reading a mass of correspondence for the purpose of showing what was done in relation to other witnesses. In regard to the witnesses in the North-West Territories, by a series of telegrams sent all over the country and summonses served by the mounted police, the attendance of all witnesses there, desired by the defence, was secured, and secured at the expense of the Crown; not merely were the expenses of the witnesses paid by the Crown, but the expense of having them summoned and telegraphed for, and every other expense in connection with the matter was defrayed by the Crown. All those witnesses, with the\nexception of Father Touse, who was unable to leave his parish for some reason, every witness in the North-West Territories desired by the counsel for the defence attended at the trial. If any person's attendance was not secured, it was not due to the slightest hesitation on the part of the Crown as regards expense or anything else. After making this statement I think we are not open to the imputation made by anyone, no matter how blinded he may be by prejudice, that the trial was unfairly conducted. I am glad to be able to say, with respect to the delay which was granted for procuring those witnesses, that Mr. Fitzpatrick, in court, after this misunderstanding was arrived at, made this statement:\n\n\"May it please your Honor—I, on behalf of the defence, assume the responsibility of accepting the delay which as stated by the Crown counsel, the Crown is prepared to offer us.\"\n\n\"Mr. Justice Richardson—I think it is reasonable.\"\n\n\"Mr. Fitzpatrick—I think it is a reasonable time. I might, perhaps, have stretched a day or so, but not beyond that, because the means of communication are very quick now compared with what they were, and a witness can be got from Quebec, &c.\"\n\nYet, Sir, after that statement appeared in the public prints, a motion of censure has been advocated on the ground that it was dishonourable to refuse the prisoner a fair delay for the preparation of his trial, and one member said it was so base an outrage that men like Mr. Robinson, Mr. Osler, Mr. Casgrain and Burbidge would not have descended to such a cruelty unless they had received special instructions from the Government. I was curious to know what his real estimate of his professional brethren was, for whom he professed so high a respect. He thought they were Christian gentlemen, he thought them professional men of high honor, he thought they would not descend to an act of tyranny, an act of outrage against an unfortunate man struggling for his life, unless, forsooth, they had been told to do it by the Government. If those gentlemen were willing to do at the bidding of the Government what would be so reprehensible, they could not deserve the high character which the hon. gentleman has given them. He must have entertained the opinion of his professional brethren which an English essayist did some time ago, when he said with regard to the tradition that counsel was bound, if he took a brief and was paid a fee, to do even dishonorable things for the benefit of his client, \"if it comes to this: that a man may do for a guinea what he would not do without it for the world.\" The next objection was that there was no sufficient interpretation of the testimony. I have only to say that the report of the trial shows, and the answers which have been given me upon that point by the counsel for the Crown, show, that at every stage of the case there was the best interpretation that could be got in the country. It was not for the Crown to provide an interpreter for the defendant's witnesses; it was enough for the Crown to pay the expenses, and the Crown did so. It was not for the Crown to select the interpreter; the choice was left to the prisoner's counsel. But such interpreters as the counsel produced were used, and when there was a complaint made that the interpretation was not strictly accurate, our counsel said: \"There is a gentleman retained on each side who speaks the French language; you interpret the evidence of our witnesses and we will interpret the evidence of yours.\" There could be no unfairness in the interpretation, because there was on both sides a gentleman speaking the French language, and the slightest inaccuracy of interpretation would have been checked. With the exception of one instance, there was not a complaint made about the interpreter, and then it was removed as well as was possible. Then we were told that it was unfair that the Batoche papers were kept back from the prisoner. Now, those papers were not kept back in the ordinary sense of the word. Any paper which was demanded by the counsel for the defence would have been produced, and none were asked for by either of them. The application which was made was for a mass of papers captured at Batoche—not Riel's papers alone, but papers affecting the interests of eighty prisoners who were then in custody on a charge of high treason, and the demand was: \"Give us at the trial of the first of those prisoners, all these papers; let us ransack all the evidence against the eighty others,\" and I think the House will readily understand that for other reasons than the one which was insinuated—that those papers might have developed something against some Minister of the Crown—they were withheld from an indiscriminate search on the part of gentlemen representing the defence, who were not in a position to call for any particular document or any particular set of documents, but simply wanted to search all through the papers in the possession of the Crown. I would ask those who have had experience in the prosecution of cases for the Crown, whether they even knew of such an application being granted at the instance of the counsel for the defence, who said to the prosecuting counsel: \"Give me before the trial begins an inspection of the whole of your brief, all your documents, every paper of every kind representing your side of all your cases for the term?\" Then, Sir, it was said—and I need hardly, after the observations of the hon. member for West Durham, have referred to this point, and will simply dwell on it for a moment—it was said that there was an unfair exclusion of testimony. It was said, when Judge Richardson remarked that the evidence of a constitutional agitation was no justification of an unconstitutional agitation, and when the question was decided in favor of the Government, the passage in the blue book was held up to observation and quoted loudly, that the objection of the counsel for the Crown was: \"Why, you are putting the Government on its trial.\" The hon. member for West Durham said: \"Why should not the Government be put on trial?\" Well, Sir, one at a time. The trial then going on was the trial of Louis Riel, and I should be ashamed to say a word or to cite a line of authority to show that evidence relating to the conduct of the Government in relation to the land grievances in the North-West would not be admissible evidence in the prisoner's favor. But the hon. gentleman, when he referred to page 110, and read the expression—(I see it was made by the judge)—\"it would be trying the Government,\" unfortunately forgot to read to the House what followed. It was unfortunate for the confidence which we would feel in his quotations hereafter in regard to this question, for if he had read further he would have shown that the counsel for the Crown disclaimed any mere attempt to shield the Government by that objection. Mr. Osler said:\n\n\"It is, as it were, a counte-claim against the Government, and that is not open to any person on a trial for high treason. We have no desire to unduly limit my learned friend, but I cannot consent to try such an issue, as that here.\"\n\"Mr. Lemieux—I do not want to justify the rebellion; I want to show the state of things in the country, so as to show that the prisoner was justified in coming into the country, and to show the circumstances under which he came.\n\n\"His Honor Mr. Justice Richardson.—Have you not done that already?\n\n\"Mr. Lemieux.—I have perhaps to the satisfaction of the Court, but perhaps others may not be so well satisfied.\n\n\"Mr. Osler.—If you do not go any further we will withdraw our objection.\n\n\"Mr. Lemieux.—I want to get further facts, not in justification of the rebellion, but to explain the circumstances under which the accused came into the country. If I had a right to prove what I have already proved a minute ago, I am entitled to prove other facts. If I was right a minute ago, I should be allowed to put similar questions now.\n\n\"His Honor Mr. Justice Richardson.—The objection is not urged until you had gone as far as the counsel for the Crown thought you ought to go.\n\n\"Mr. Lemieux.—It is rather late now to object.\n\n\"Mr. Osler.—I warned my learned friend quietly before.\n\n\"Mr. Lemieux.—Well, I will put the question and it can be objected to.\n\n\"Q.—Will you say if the state of things in the country, the actual state of things in the country, in 1832, 1833 and 1834, and if to-day the state of things is the same as in 1832, 1833 and 1834, if justice has been done to the Dominion and just rights of the people?\n\n\"Mr. Osler.—That question must be objected to; it could not have had anything to do with bringing the prisoner here. I object first as a matter of opinion; second, that it is a leading question, and third, that it is irrelevant to the issue.\n\n\"Mr. Lemieux.—The most important objection is that it is leading. As to the opinion of the witness, I should think his opinion is valuable; it is fact I want from the witness; I suppose he can give his opinion based on the facts. If he says no order, I shall ask him why and he will give me his reason why.\n\n\"His Honor Mr. Justice Richardson.—That will be a matter of opinion.\n\n\"Mr. Lemieux.—I will put the question and you can object to it.\n\n\"Q.—Do you know if at any time the Dominion Government agreed to accede to the demands made by the half-breed, and clergy, relative to the claims and rights you have spoken of in the preceding answer?\n\n\"Mr. Osler.—I do not object to the question, if confined to a date prior to the 1st July, 1834, the time he was asked to come into the country, although the question is really irregular. I am not going on strict lines, but I do object to the question being asked in regard to the state of things. I do not object if he confines his questions to the time prior to the prisoner's coming to the country.\n\n\"Mr. Lemieux.—My question will show that the prisoner had reason to come. If the people had confidence in him, he had a right to come and help them to try and persuade the Federal Government to grant what had been refused them so far.\n\n\"His Honor Mr. Justice Richardson.—Your question is what, Mr. Lemieux?\n\n\"Mr. Osler.—I am willing that the question should be allowed if limited to the time prior to July, 1834.\n\n\"His Honor Mr. Justice Richardson to Mr. Lemieux.—Is that the way to put it?\n\n\"Mr. Lemieux.—Yes.\n\n\"Mr. Osler.—Then we withdraw the objection.\"\n\nIn view of the confidence which we may fairly feel in the tribunals of this country until a case is established on the other side against any of them, I am glad to say, for the purpose of answering a charge directed against the fairness of this tribunal and on such slight grounds, that these grounds are totally annihilated by the very page from which the hon. gentleman read. Let me call the attention of the House to one other point with regard to the fairness of the trial, which strikes me as absolutely conclusive. That is, that if there had been an unfair ruling in that trial from beginning to end, either on the application to postpone, or on a question of evidence, or on any part of the judge's charge it would have been laid open by the prisoner's counsel on their appeal to the Court of Queen's Bench in Manitoba. The prisoner had an advantage which no man has who is tried in the older Provinces. He had a right to appeal to a bench of judges sitting in another Province, far removed from the agitation in his own country, an appeal on every question of law and fact involved. Every lawyer knows that a prisoner in the Provinces has only these chances of appeal: He has his chance of a writ of error, to bring up defects shown by the record, and as regards any objections to the evidence or to the rulings of the judge, the judge may himself decide whether he shall have an appeal or not. Louis Riel was not in that position. He had the right to bring before the bench in Manitoba every question of law or fact that arose on his trial, and when he took that appeal he was represented by the best counsel, I suppose, that this Dominion could have given him, and yet not a single exception was taken to the fairness of the trial or the rulings of the judge. The prisoner took this additional step, which is a very rare one in connection with criminal justice in this country—he applied to Her Majesty to exercise the prerogative by which Her Majesty, by the advice of Her Privy Council, is able to entertain an appeal in a case connected with criminal jurisprudence from any one of Her subjects in the Empire; and how is it that in the petition that was prepared to enable the prisoner to take the judgment of that high tribunal, which had to make its report to the fountain of justice itself in the British dominions—how is it that neither the prisoner's counsel, nor himself, nor his petition, nor anything said or written in his favor, urged a single objection to the fairness of the trial, the rulings of the judge at that trial, or the way in which the judge had directed the jury? I should suppose, Sir, that that was exceedingly significant. We were told, the other night, that the judgment of the Privy Council said nothing about the procedure of the trial—that it was silent on that point. The significance of that silence is all we want. When a man has a full opportunity to appeal, and takes his appeal, and makes no complaint about the fairness of a ruling, which would have given him his liberty if he could establish its error, I want to know if we need any more than his silence and the silence of the able counsel by whom he was advised and represented, to satisfy us that exceptions were not taken in the highest court of appeal in the Empire for the simple reason that they did not exist. I have another piece of testimony with regard to that, if that were not conclusive, as I should suppose it would be, and that is this: The Regina Leader of August 13 contained this statement of what took place immediately after the trial:\n\n\"The counsel for the defence, Messrs. Fitzpatrick, Lemieux and Greenshields, waited on Judge Richardson before they went east, and thanked him for the fairness and consideration which had characterized his rulings.\"\n\nNotwithstanding the statement which was made by an interviewer of a Montreal paper, and which was read to this House a few evenings ago, I hesitate to believe that Mr. Lemieux actually changed his mind\nwhen he got among his friends in the Province of Quebec, and did, either for the purpose of creating sympathy for his client or making capital against the Government, say anything that he would not have said at Regina about the fairness of the trial. Mr. Fitzpatrick has also spoken again. At a public meeting in Montreal, he said:\n\n\"It was unfair to arraign before the tribunal of public opinion the judge and jury who tried Riel. They were simply the outcome of the law as it was found in the Statute Book.\"\n\nAnd yet, Sir, because we administered, in the case of Louis Riel, the judgment which the law pronounced, the confidence of this House is asked to be withdrawn from the Government. I must read from the Winnipeg Free Press an extract which was read to the House once or twice before, and which I am, therefore, almost ashamed to repeat, but which I must repeat, because it applies distinctly to the point in hand, and comes from a newspaper as hostile to this Government as any newspaper in the Dominion. It was published on the 17th of December, immediately after the execution. Some papers have been accused of inconsistency in advocating Riel's execution beforehand and taking the opposite ground afterwards; but after his execution the Winnipeg Free Press said:\n\n\"Riel was fairly tried, honestly convicted, laudably condemned, and justly executed.\"\n\nBut, Sir, if our confidence in the tribunals themselves be not sufficient, if the fact that the courts of appeal before which the case was taken, ruled that the trial was fair and that justice had been done, be not sufficient, I ask hon. gentlemen opposite if, with any sense of candor or fair play, they can ask that this Government should be condemned for not changing the sentence on the ground that the trial had been unfair, when there has not been, down to this hour, a petition or request presented to the Government, either from Louis Riel, from his counsel, from his ecclesiastical superiors, or from any of the advisers and sympathisers he has had throughout this country, for the commutation of the sentence, on the ground that the trial was in any sense unfair. And yet, Sir, after the decision of the jury, after the decision of the judge, after the decision of the Court of Queen's Bench in Manitoba, where, as I have said, he had an extraordinary advantage; after the disposal of his case before the Judicial Committee of the Privy Council, and without a single utterance from anybody, either himself or any sympathiser, that anything was unfair, this House is asked to carry this resolution on the ground that his trial was unfair, and give what Riel never asked, redress on the ground that he had been unfairly tried. The condemnation of the prisoner having been arrived at, the duty of the Executive commenced. The first question we had to consider was the criminality of the prisoner, and with almost a certainty that I shall be exhausting your patience, I find it absolutely necessary to quote even extracts which have been read to the House before, for the purpose of showing what the criminality of this man was and how the Executive should have dealt with him, not only because it is in the regular course of my argument, but because this condemnation has been commented on by the other side for the purpose of drawing a very different conclusion from it. Dr. Willoughby, at page 12 of the report, referring to the prisoner, gave evidence as to what the latter told him:\n\n\"He said they had time and time again petitioned the Government for redress, and the only answer they received each time was an increase of police.\"\n\nQ. What do you mean by police?—A. He said, now I have my police, referring to men at the door.\n\nQ. Those 60 or 70 men?—A. Yes, he pointed to them and he said, \"You see now I have my police. In one little week that little Government police will be wiped out of existence.\"\n\nThis is the man who, we are told, was to be regarded as a loyal subject, because at some time he drank a glass of liquor to the health of the Queen. This is the man who, I understand, the hon. member for Quebec East (Mr. Laurier) to say the other night, must have come to this country for the purpose of pressing a constitutional agitation, although one of the first things he said was that the force that supports Her Majesty's Government, and represents there the law of the country and the rights of the settlers, was to be absolutely wiped out of existence:\n\nQ. That was the reason why he said the settlers of Saskatchewan had no right to protection?—A. He said: \"We will now show Saskatchewan or the people of Saskatchewan who will do the killing.\"\n\nQ. Anything else?—A. He said that the time had now come when he was to rule this country or perish in the attempt.\n\nShall it be said he came to this country under any mistake as to his position, under any idea that he was to be treated once again as a political offender, under any notion that he had a right to receive again the clemency of the Crown which, fifteen years before, he had trampled under foot and spat upon? No; he knew well the real issue.\n\nQ. You say he referred to the previous rebellion of 1870, what did he say in regard to that?—A. He referred to that and he said that that rebellion, the rebellion of fifteen years ago, would not be a patch upon this one.\n\nQ. Did he say anything further with regard to that?—A. He did; he spoke of the number that had been killed in that rebellion.\n\nQ. What did he say as to that?—A. I cannot state as to what he said, but it was to the effect that this rebellion was to be of far greater extent than the former.\n\nThis rebellion, carried on in the lines, hon. gentlemen opposite say, of a constitutional agitation, was to be of far greater extent than the former, with regard to the number killed. Thomas McKay, on page 18 of the report, gives this evidence:\n\nQ. Well?—A. He accused me of neglecting them. I told him it was simply a matter of opinion. That I had ever singly taken an interest in them, and that my interest in the country was the same as theirs, and that I had advised them time and again, and that I had not neglected them. I also said that he had neglected them a long time, if he took as deep an interest in them as he professed to. He became very excited, and got up and said,\n\n\"You don't know what we are after.\"\n\nConstitutional agitation, hon. gentlemen opposite say; petitions, these gentlemen say; a newspaper enterprise, these gentlemen say; but Louis Riel said:\n\n\"It is blood! blood! We want blood! It is a war of extermination! Everybody that is against us is to be driven out of the country.\"\n\nDriven out by a newspaper I suppose.\n\"Q. He used very violent language to you?—A. Yes; he finally said it was blood, and the first blood they wanted was mine.\"\n\nThen follows the passage about the witness having so little blood in his miserable body that they could put it in a spoon.\n\n\"He also said: This was Crozier's last opportunity of averting bloodshed, that unless he surrendered Fort Carlton an attack would be made at 12 o'clock.\"\n\nNow, what was the summons he sent to Fort Carlton? What was the summons he sent to the officer who was in charge of the portion of the forces, which alone protected the lives and property of the settlers, the force which alone protected that Territory for the Queen and Canada. The summons was:\n\n\"In the case of non-acceptance, we intend to attack you when to-morrow, the Lord's Day, is over, and to commence without delay a war of extermination upon all those who have shown themselves hostile to our rights.\"\n\nWhat was the feeling that went throughout this country then? What was the conviction that forced itself upon every man's mind when that piece of evidence got into print? Why, even those papers, and I am willing to assume the Toronto Globe was one of them, which were anxious to keep public judgment in abeyance until the result of the trial was arrived at, came to the conclusion that for Louis Riel all was over. On the 3rd August, 1885, the Globe said:\n\n\"The moment Riel's letter was put in evidence it became clear that the prisoner had been not only a participator in but the actual instigator and leading mind of the rebellion. No shadow of a doubt remained that he was guilty as charged in the indictment. The testimony that followed only deepened the certainty of his guilt. There never was made out a clearer case, and the only doubt that remained was as to the extent of the prisoner's responsibility. As to this the medical experts differed, and it would have been natural that the jury, too, should have differed. But the jury seem to have brushed aside all the medical evidence, and dealing with facts only, they returned a verdict of guilty. They could do no less.\"\n\nMr. J. W. Astley said:\n\n\"Q. Did he speak to you or his personal safety?—A. He had very little to say about the half-breeds; as far as regards himself he seemed the principal object.\"\n\nMr. Tompkins said:\n\n\"Q. Can you give us anything of importance he said to you as to his intentions?—A. On one occasion he said that he had three enemies, and enumerated them as the Government, the Hudson Bay Company, and the Police. He also stated to me he would give the police every opportunity to surrender, and if they did not do so there would be bloodshed; another occasion he told me he had heard the Lieutenant-Governor was on his way up and that he had given an order to capture him.\"\n\n\"Q. Was there anything said as to the length of time he had been considering these matters?—A. Yes; he told me he had been waiting fifteen years and at last his opportunity had come.\"\n\n\"Q. Who was in charge of the church?—A. Rev. Father Moulin.\"\n\n\"Q. Did you see him on that occasion?—A. When the crowd got to the church he came out and he wished to speak to the people. Mr. Riel said: No, we won't let him speak. Take him away, take him away; we will tie him.\"\n\nHe was to have no constitutional agitation this time. He did not want any message of peace or mercy. He had waited fifteen years; his time had come, and he was to rule or perish in the attempt.\n\n\"Q. Did he say anything about taking possession of the church at the same time?—A. Yes, Riel said: 'I will take possession of the church.' Father Moulin said: 'I protest against you touching the church.' Riel said: 'Look at him; he's a Protestant.'\"\n\nOur hon. friends oppose say that that allusion to the priest as being a Protestant shows insanity—I say it shows the acuteness of his wit. A Catholic priest, standing on the threshold of his own church, addresses a protest to these men, and Riel brings down the laughter and derision of his people by saying: \"He has protested, he is a protestant.\" Then we come to the evidence which I venture to say hon. gentlemen opposite would give a great deal to obliterate from this case, the evidence of his venality, the evidence that he offered to take $35,000 and make the cause of the half-breeds his own in a special sense, and that he was even willing to come to such moderate terms as to take $10,000. I venture to say that, when the excitement which exists in connection with this question is over, there will be no man, woman or child in this country who will accept the weak excuse that has been set up in this regard, that his object was to start a newspaper in the United States. I ask hon. gentlemen who wish to set up this excuse, how they consider the evidence which is given by Nolin, who says he was willing to take $10,000—he had come down in his terms—but he was willing to do more; he was willing to take that money and go and live anywhere that the Government wanted him to go to. He was not particular about country; he was a cosmopolitan. Siberia was good enough for him if he could have $10,000 of Canadian money in his pockets, and the half-breeds might suffer as long as they did before. It is in conversation with Nolin that he refers to the newspapers. Remark this, that although the same statement is made by Father André and by Jackson, to neither of these men did he set up this absurd pretence that he would use this money to start a newspaper. He knew that Father André, with whom he had a like conversation, and whom he expected to act as agent to procure this money for him, was not a man to be deceived by any humbug like that, and therefore he did not offer to him any such protest. It was only when talking to a half-breed, a man more ignorant than himself, but a man to whom, for his shameful venality, he had to give some excuse, even if it was only humbug and imposture, that he put over his conduct that thin pretence that he was to set up a newspaper in the American territory. When he undertakes to discuss the question of a bribe, or of selling out the half-breeds, with any man of critical faculties or any man of information, he does not set up that pretence at all, but says boldly: \"The cause of the half-breeds will be my cause, if I can get $35,000 or even $10,000, and I will go where you please.\" They tell us it must have been an indication of his madness when he proposed that we should give him $35,000 and that he was going to the United States territory and start a newspaper.\" No, Sir, it had not even that excuse; it was a thin disguise put on for the purpose of deceiving the ignorant, and a disguise which he did not attempt to use when he was discussing the same thing with men of greater\nintelligence, who would have laughed in his face had he propounded such a miserable imposture. This man had come into the country on the assumption that the whole North-West was like a barrel of gunpowder which only needed a spark to explode it; he said to the half-breeds: \"You have been petitioning long enough, petition no longer;\" and, with arms in his hand, and after he had declared that the day of petitioning was at an end, and the time was come for a war of extermination, he was willing to abandon the enterprise, was not only willing to abandon the petitions, because it was, he said, a time for blood and petitions had failed, it was a time to succeed or perish in the attempt, he was willing to start for the United States and set up a newspaper! I envy the charity of the gentlemen who believe that excuse which has been offered. The hon. member for West Durham (Mr. Blake) could not believe that it was offered as an excuse, as his colleague beside him believed (Mr. Laurier), but he supposed it was evidence of insanity. When he comes to read the evidence again, he will see that it was used for the purpose of deceiving one of his own comrades in arms, a man who would probably have had enough nerve and courage to tell him to earth if he had not used some such excuse to cover his baseness and venality. At page 94 I find this:\n\n\"He said: 'Before the grass is high in that country you will see foreign armies in that country. I will come by destroying Manitoba, and then I will come and destroy the North-West and take possession of it.'\"\n\nSome Hon. MEMBERS. Hear, hear.\n\nMr. THOMPSON (Antigonish). Some hon. gentlemen opposite say \"hear, hear\" in answer to that. The prospect at that time of foreigners being in arms in this country was not a subject of ridicule. If it was in this quarter of the country, it was regarded more gravely in ours, and I know that, when our own volunteers were leaving for the North-West, and the mind and heart of every man thrilled as he saw them go, there was a sense of pain and horror at the report which was heard that an armed force of Fenians had actually invaded the North-West for the purpose of co-operating against them; and yet, before twelve months are passed, hon. members of this House, who must have been informed of these reports and aware of the sensation they made in this country from end to end, and of the probability that existed of invaders coming again upon the territory of Canada to assist in this enterprise, think that this House and this country have so far forgotten the circumstance that they can say \"hear, hear\" in derision, and can read this report as simply an evidence of the man's insanity. There is a feature of the case which I shall have to come to now, and which, in my humble opinion, stains this man's character with the deepest dye with which the conduct of any convict in the country was ever stained, and that is the feature of his inciting the Indians of the country, not merely to be allies of his in the sense in which the Indians were allies in some of the cases cited by the hon. member for West Durham (Mr. Blake), not simply to co-operate with him, and to act under his command, but to rise and to attack peaceful settlements, to attack weak garrisons—\"rise, plunder, burn and destroy.\" We know that they obeyed his command, and we know that the lives of not only peaceful settlers but of Government officers, lives of missionaries precious in the sight of God and man, were laid down upon that prairie as the result of the behest he scattered to the Indians of the North-West. Well might the hon. gentleman have said, not in this Parliament, when surrounded by allies who will vote for them on this motion for the first time perhaps, not in this House where he can get sympathy by sounding another note, but in the great Province of Ontario, surrounded by his own party and his own followers, well might he then say:\n\n\"I have always held that both parties might be deeply guilty—Government for neglect, delay and mismanagement; and the insurgents for rising in rebellion—always a grave offence against the State, and in this case aggravated by the incitement to the Indians to revolt.\"\n\nBut when we come to Parliament what we hear is: \"We cannot hold our heads very high about the Indians. There was a time when Wolfe and Montcalm had Indians for allies; there was a time when Brant led our Indian allies, and Tecumseh was a very great man in the opinion of a great many people. Brant showed that Indian allies might be employed, and might be very successfully employed—barring the torture of course.\" I have read in times past some speeches of the hon. gentleman on the subject of the effect which the policy of the Government of this country would have upon prospective immigration into the North-West; I have read some speeches in which he made eloquent denunciations of the policy of the Government now in power on the ground that they were placing such burdens upon our people that intending European immigrants would be unwilling to share the fortunes of this country, were unwilling to become partners in the great enterprise which we had undertaken in the settlement of the North-West. If we adopt the hon. gentleman's view of Friday night about the Indians of the North-West Territories, I wonder what the immigrants will say before coming to Canada to enter into a co-partnership with us; I wonder what our agents would have to say in reply to intending immigrants who would tell them: \"You in Canada have 20,000 or 30,000 Indians, many of them in a savage state, many of them pagans; let us know what your laws are for the protection of settlers in the North-West, and let us know what the policy of your Government is as to the enforcement of those laws.\" I think our agents would have to tell them: \"Our laws are excellent, our laws make it murder, make it treason, to incite these Indians to revolt, but the policy of the Government, in view of what has been propounded on the floors of Parliament, must be that as regards the Indians we don't hold our heads very high; although we have some objections to torture.\" I think, Sir, that after a declaration of that kind immigration into the North-West will be very scanty indeed, notwithstanding the strong inducement that we would not permit the Indians to torture. I think, Sir, that the settlers in the North-West now, to whom the faith of this country is pledged that we will honestly enforce the laws would be very much jeopardised if we allowed the idea to go abroad that to incite the Indians to revolt could be treated as anything but a heinous crime, to be visited by the severest punishment of the law. I think, Sir, that it would be prejudicial to the safety of the people who are there now, with whom, as I have said, we have made a contract, if we do not hold our heads high on this question now. There may have been times in the past on which differences of opinion existed upon this\nquestion. The hon. gentleman knows that when Indian allies were co-operating with the forces of Great Britain over one hundred years ago—not co-operating as these men were, not set on the war path to kill, burn and destroy—the action was defended upon the ground that they were co-operating under command of British officers, and that it would be far safer to have them so employed than to leave them to make war in their own fashion. The hon. gentleman knows that the most eloquent statesman in Great Britain made the hall of Parliament ring with denunciation of such outrageous barbarism. He knew that when a noble Lord rose to defend such a practice in the House of Lords and to contend that it was even excusable, he was told in an eloquent reply that the picture of his ancestor frowned upon him at the disgrace which that night he had brought upon his country. And the hon. gentleman knows that since that time, and since Indian forces were employed even in Canada, the public sentiment of all civilised countries has brought about a change in public law, and that it is now not only against humanity, but against law to have Indian allies, whatever Brant may have thought to the contrary. But I am not speaking of Indian allies, I am speaking of the incitement of Indians in murder; and speaking for myself only, but speaking for myself as the Minister who is charged with the duty of advising, to some extent, in the dispensation of the clemency of the Crown, in such cases, I say that the man who undertakes, in the North-West, in the condition in which the Indians are now, to incite these Indians to rise and to commit war and depredation, either upon the garrisons or upon the white settlers of the North-West, takes his life in his hand, and when he appeals to me for mercy he shall get justice. Now, Sir, turning again to the Winnipeg Free Press of 17th November, 1885, only a day after the execution, we find this passage:\n\n\"Riel has expiated his crimes. He was fairly tried, honestly convicted, laudably condemned and justly executed. There is not one law for the French and one for the English in this country.\n\n\"Riel was a mercenary, cold-blooded, self-seeker, and we cannot understand how his compatriots in Quebec could have been so misguided as to espouse his cause, which was not the cause of the French more than it was the cause of other Canadians.\"\n\nAnd the same paper, on 18th November:\n\n\"It is evident, therefore, that the sympathy of the people of Quebec has been worked on, not by the wrongs of the half-breeds, but by the French blood which flowed in Riel's veins. They undertook to uphold the criminal because of his nationality, and have been shown that the laws of Canada are no respectors of persons.\"\n\nI cite that, not for the purpose of reflecting upon the sentiment which prevailed among our friends in Quebec, but for the purpose of showing what the sentiment on the spot or near the spot, so far as we can gather it from the press, was at the time immediately succeeding the execution, and the utterance comes from a portion of the press deadly hostile to the present Administration. But, Sir, upon this question of criminality we were not left to decide merely upon the evidence, bristling, as it is, with condemnation of the prisoner's conduct from beginning to end. We had remonstrances coming to the Government, representations coming to the Government with regard to the cases of the other State prisoners who were then in our hands. In the consideration of them we found representations with regard to the criminality of Louis Riel which could not be disregarded, representations favorable to the other State prisoners, and made favorable to them on the ground that they were victims in his tyrannical hands, and, Mr. Speaker, although these were not made for the purpose of injuring him, if we had disregarded them, if we had commuted this sentence and we had been obliged to bring these papers down, the Government would have been challenged in this House for having disregarded that evidence proceeding from the most disinterested sources, evidence directly condemnatory of the prisoner, and for having disregarded it under the miserable pretext that it was laid before them in connection with some other men's cases. What did Bishop Grandin say in a petition sent by him to the Government after the trial and condemnation of Riel, and after the sentence had been pronounced? and in reference to what he said, and in reference to what some of the other ecclesiastics in the North-West said, I must differ from a statement made on Friday evening by the hon. member for West Durham, as regards the feeling of those persons towards the convict. He intimated that if there was any chance of their judgment being swerved, it was probably swerved against the prisoner because he had acted in hostility to their faith, he had become an apostate from their religion. But anyone who has read the history of these troubles in the North-West knows that the conduct of these men was influenced by no such consideration. Everyone knows that from the first to the last when he became reconciled to them—I go further and am compelled in stating the mere truth to say that from the time he fell into the hands of the law and before he became reconciled at all to them—the conduct which those gentlemen exhibited towards him, the efforts which were put forward in his behalf, were characterised not merely by generosity, not merely by sympathy, not merely by mercy, but I might almost say, as regards some of them, by active partisanship on his behalf. I have been citing not the testimony of witnesses against Riel, but the testimony of men who in spite of every degradation, insult and outrage that could be heaped on them and their religion, struggled to the very last to save him. Bishop Grandin says:\n\n\"It is well known by all who closely studied this movement that a miscreant abusing a certain amount of knowledge, making use of a false and hypocritical piety, by menaces and threats of inevitable destruction, deceived the half-breeds and forced them to take up arms against the Government. The ascendancy which he had gained over them was such that the greater part could not and dared not resist him.\"\n\nFather Fourmond, after the trial and before the publication of the statement which was read to the House by the hon. member for Montreal Centre (Mr. Curran), said in a deposition:\n\n\"'Louis David' Riel in his strange and alarming folly fascinated our poor half-breeds as the snake is said to fascinate its victims, abusing, for his own ends, the great confidence that all the half-breeds reposed in him, a confidence founded upon his influence over their minds through his great and impassioned language, and above all by the appearance of his profound religious feeling and devotion, which he displayed in the most glaring and hypocritical manner, which was rendered so convincing to their minds by his public proclamation of his mission as an inspired prophet, which he forced upon their imagination in the most insidious and diabolical manner. To impress the people and keep them within the power this man Riel resorted to all kinds of trickery.\"\nFather Fourmond further states:\n\n\"Oh, my poor people, I could not restrain them, they were under the instigation of this arch traitor and trickster till he got them committed by the effusion of blood, then they were in his power, and he used that power without any feeling of mercy. I also declare that during the trouble I had conversations with several of the persons who were in the rebel camp, and I found a large number of them there against their will, and only remained there because of the fear of being shot down, did they try to escape or desert.\"\n\nHad we no right, in considering the appeals of this man's friends for clemency, to consider the statements which show that he did not come into this country with any willingness whatever to conduct or allow a constitutional agitation, but that from the very first this \"arch-traitor and trickster\" kept those men in his camp under peril of their lives.\n\nMr. MILLS. Will the hon. gentleman allow me to ask him one question. Under what circumstances was that paper prepared? We have not seen it.\n\nMr. THOMPSON (Antigonish). These papers were laid before the Government in connection with many others asking for commutation of the sentence on other half-breed prisoners and Indians. They were part of the materials which were before the Government, and which had been laid before them at a time subsequent to Riel's condemnation and before his execution. Father André, in his deposition in the case of Joseph Arcand, says:\n\n\"I most solemnly declare from my own personal knowledge, that with the exception of Gabriel Dumont, Napoleon Nault and Damase Carrière, now deceased, not one of the half-breeds had the least idea or suspicion that there was any probability of danger of rebellion until they were so completely involved in the toils of Riel, and he led them on until they were so compromised that there was no escape for them.\n\n\"They were made to religiously believe that they had no mercy to expect at the hands of the soldiers, police, or from the government of Canada; if they were taken prisoners, wounded, they were told nothing but death, with unyielding torture awaited them at the hands of the soldiers and police, and their daughters and sisters would be dishonored before their eyes, their children hacked to pieces, and all their earthly property utterly destroyed, and their whole nation exterminated by the brutal soldiery.\"\n\nReferring to Pierre Parenteau, Father André says:\n\n\"This good old man was misled by the wily Riel.\"\n\nFather André in his testimony referring to Emmanuel Champagne, says:\n\n\"By threats and force the old man was kept there\" (viz., in Riel's service).\n\nReferring to the case of Philip Garnot, he says:\n\n\"Riel ordered him to take up arms. He refused to do so. Day after day for four days Riel ordered him to arm and take part in the movement, and at last Riel ordered him to be dragged to the camp, where, overpowered by terror of his life and fear of loss of his property, he consented to act as secretary.\"\n\nAs to Baptiste Vandal, he says:\n\n\"He resisted for a long time before he could be forced to join Riel, and did so only from fear and compulsion.\"\n\nAs to Joseph Delorme, he says:\n\n\"It was only by force and threats he was compelled to take part with the rebels.\"\n\nAs to Alexandre Cadioux, he says:\n\n\"He was seized by Riel and forced into his service.\"\n\nAs to Joseph Pilon, he says:\n\n\"He was ordered by Riel to come into camp or he would force him to come. Pilon, when he was threatened by Riel, came to the priest and cried when telling what was wanted of him. Riel, by force and threats against his life, compelled him to serve his purpose.\"\n\nFather André thus refers to the case of the Tourond brothers:\n\n\"The crafty Riel tried every way to induce the boys to join him, but without success. Riel went day after day to their poor widowed mother and with devilish cunning played on her superstition and credulity. He told her of his holy visions, etc. * * * and the poor woman in her simple faith in his divine mission, prayed of her fine young sons to go forth and battle under the banner of heaven.\"\n\nReferring to the prisoners generally, he says:\n\n\"They were misled by one who thoroughly knew their weak minds and their hearts. They were called on in the name of God and of the Holy Saints, by one who declared himself ordained by God to do a great and good work. They were blinded by pretended visions and messages from the Holy Ghost; poor people, in their trusting confidence they were led on to desolation, misery and death.\"\n\nThese were the statements of persons who, as I have said, were not willing to give testimony against Riel, but they are statements which confirmed the evidence, which confirmed everything known as to his conduct; and although the question of the hon. member for Bothwell (Mr. Mills) seems to imply that statements of this kind should not have been used against Riel—for I can understand his interruption in no other way—would not this House have rung with denunciations if the Government, disregarding all these considerations, had exercised clemency to so unworthy an applicant; and had told the House that at the time they had this evidence of his conduct in their possession. I have still a few observations to make as to the weight of criminality which is disclosed in the evidence in this case and in the documents which were laid before the Government. I desire in the first place in dealing with the remainder of my arguments on that question to take up a branch of it upon which I think a very singular doctrine has been pronounced. I mean that branch of the argument with relation to this having been a second offence of this convict. The argument was used here that if the fact of his having committed an offence previously in any way affected the commutation of the sentence for the crime for which he eventually suffered, then he was executed for the first offence. I think every person who has had any legal training will admit on a moment's reflection that this is an unsound view to take of the consequences of a previous conviction as-\nto any criminal proceeding. I think that those who have not had the benefit of a legal training will admit, Sir, after the few words of explanation I have to make, that it is an unphilosophical and unreasonable view to take, even if it were not unsound in point of law. The policy of considering, not only when dealing with the subject of the commutation of the sentence, but in imposing sentence upon offenders—the policy of considering what the past history of the convict has been is one which is recognized, not only in the practice of every tribunal administering criminal justice, but is recognized by Parliament as well. We all know, Sir, that there are whole series of enactments intended to provide, in the case of a second or subsequent conviction, not only that the punishment may be heavier than it could have been in the first conviction, but in many of them that it must be heavier, and the discretion of the judge is to a large extent taken away, and he is prevented, in the case of the second and subsequent offences, from dealing out such a punishment as the law allows him to deal out with regard to a first offence. We all know with regard to the criminal legislation of the mother country, that not only are longer sentences imposed and heavier punishments inflicted upon those who have committed an offence the second time, but that a punishment different in kind is very often meted out; and that while a man who has been convicted of a first offence is allowed to go with a fine or an imprisonment or both, that in some cases flogging is provided on the second occasion, notwithstanding that on the first conviction the convict has either suffered the penalty or has been pardoned. It is quite true, as was stated by the hon. member for West Durham, that after a man has suffered a penalty for the first offence he is to be considered a new man, as if he had been pardoned or amnestied. But the moment he commits a second offence, whether he has suffered the penalty of the first or was exonerated by pardon or amnesty, it is not only legitimate but it is incumbent, according to the practice of the courts and according to the practice of the Executive in dealing with the prerogative of mercy, to consider the past history of the offender. So fully has that policy been recognised that, in respect of many offences and crimes, the prosecution is allowed to give in evidence the fact of the offender having been convicted before, with a view to increasing the weight or changing the kind of the punishment, notwithstanding that in relation to that previous offence there may have been a commutation or a pardon, or what has served the same purpose, an expiation of the full penalty for that first offence. On the 31st October, 1882, this question came up in the British House of Commons in relation to a sentence imposed upon a female—a very long sentence of imprisonment for a comparatively slight offence. The Home Secretary had declined to interfere with the sentence, and, so far from its being successfully contended on that occasion that the Executive was not justified in looking at the previous history of the criminal, Sir William Harcourt said:\n\n\"I would venture to submit to those who criticise sentences of this kind that the previous history of offenders should be inquired into, because a false impression is produced when it is supposed that a woman is sentenced to a severe punishment for what appears to be a slight offence, when the fact is that she is an incorrigible offender with whom it is impossible to deal without keeping her in prison.\"\n\nChanging the illustration from the kind of case in hand, let us suppose, in the case of a prisoner convicted of ordinary murder, that he has been sentenced to death but has prevailed on the Executive to exercise clemency, and has had his sentence commuted either to life servitude or a long term. Let us suppose that after the expiration of that term he has committed another murder, and again applies to the Executive for clemency. I address myself not only to members of the legal profession in the House, but to laymen as well, and I ask if there would be anything unreasonable or unjust in the Executive considering the fact that on a previous occasion this convict had committed the same offence and that the punishment which the Executive thought sufficient to deter him for all time to come from repeating it had utterly failed of its purpose? Whether the Executive would not be censurable, as we are asked to be censured now, if for the second time they treated that offender precisely as if he had never committed any such offence before? There can be no misunderstanding upon this subject as to the practice in the Department over which I have the honor to preside, because, when an application is made, as the hon. member for West Durham knows, for executive clemency, in relation to a prisoner undergoing imprisonment, before advice by the Minister of Justice is tendered to His Excellency, a report is presented, not only in relation to the trial upon which he has been convicted, but in relation to his conduct in prison, and particularly as to whether he has ever suffered conviction before. So that it is not only consistent with the policy of legislation, it is not only consistent with the ordinary practice of the tribunals which administer criminal justice, but it is consistent with the ordinary practice of the Department of Justice to consider in every case the previous history of the criminal, before clemency is exercised or before any advice is offered as to exercise of Executive clemency. Apart from the evidence we had in this case, there were upon the records of the country, in relation to this offender and his former career in this country, facts which the Executive could not have ignored if it had been necessary to take notice of them. I do not say for a moment that the Executive were influenced by those facts; but now that we are assured, and it is said that in the execution of this man a great wrong has been done to the administration of criminal justice, I have a right to avail myself of everything that may be serviceable to refute the charge. Upon the public records we might have found that the hon. member for West Durham (Mr. Blake), referring to an act committed by this man 15 years ago—an act which was subsequently covered by the clemency of the Crown—described it as \"a cold-blooded murder,\" as \"that barbarous event,\" as \"not a mere political offence,\" and he desired to put upon record, and did put upon record, in the annals of the Assembly of which he was a distinguished member, \"the people's stern resolve that that death should be avenged.\" We might have found upon the public records the statement by Lord Carnarvon, in a despatch from the Colonial Office—one of those despatches which were referred to as helping to make up the constitution—that he mourned over the fact that the Legislature of Canada \"had been disgraced by the election to the House of Commons and the presence within its walls of a criminal like Riel.\" We might have found upon the public records, if it had been necessary to look any further, the statement by Lord Lisgar in relation to what that man did 15 years ago, that he com-\nmitted \"a cruel, wicked and unnecessary crime.\" We might have found upon the records of this House, turning back to the 11th of February, 1875, a discussion of this kind which took place when my hon. friend the Minister of Customs was addressing this House:\n\n\"The hon. member for South Bruce certainly used this question in more places than one. He designated it in this House as a cold-blooded murder.\n\n\"Hon. Mr. Blake. Hear, hear\n\n\"Mr. Bowell. He designated Riel as one guilty of murder.\n\n\"Hon. Mr. Blake. Hear, hear.\n\n\"Mr. Bowell. The same hon. gentleman in this House remarked that the murder of Scott was an unprovoked and damnable murder.\n\n\"Hon. Mr. Blake. Hear, hear.\n\nThese statements, Mr. Speaker, were not the passionate enunciations of Orange lodges inflamed against this man on account of his race, his religion, his animosity towards one of their brethren, and they were evidence which the Executive could not have overlooked if it had been necessary for them to go beyond the evidence in the case, or the documents before them in relation to the recent outbreak, and to enquire what the previous history of this criminal was, as the British Home Secretary does, and as every man who has anything to do with the prerogative of clemency in this country is bound to do before advising the Crown to exercise that clemency. I propose now to pass for a few moments to that branch of the subject relating to General Middleton's negotiations with regard to Riel. The fact has been developed now, by the speech of the hon. Minister of Militia and Defence, that although Louis Riel had been invited to surrender by General Middleton's letter, that invitation was never accepted. It has been developed now, that Louis Riel was captured, and captured, not because he allowed himself to be captured, but because the district in which he was, being surrounded with troops, there was no chance of escape except to one mounted and skilled in the country, as Gabriel Dumont was. He did not, then, comply with that invitation; he was captured; and he had the art and cunning—not such as a lunatic would show, but the art and cunning he had exhibited all through his career—of producing the letter and claiming safe conduct under it. But every man who has read the history of this case knows that legal proceedings were not those that Louis Riel feared, and in relation to which he asked the protection of General Middleton. He knew perfectly well that General Middleton had not the power to pledge the Executive to anything, nor was Louis Riel looking so far ahead as that. On the day Mr. Astley procured the letter and invited him to surrender, the condition was that firing should cease, Riel was unable, even if willing, to stop the firing on his own side and he feared that if he should surrender the result might be the loss of his life or his being wounded while being brought into camp; and we all know that for that reason, as is shown by the evidence, the surrender was not accomplished; nor was it pretended that when, three days after, he was captured in afied, he was attempting to surrender, or attempting anything but flight. There was also in his mind, evidently, a sense of alarm at what might be the result of his being taken into a camp where the hostile soldiery of this Dominion were. And in relation to that I wish to refer to an observation which was made on Friday evening, and which seemed to cast some aspersion on the hon. Minister of Militia and Defence with regard to his observations. It was suggested that it would be a dreadful thing to have it go abroad; and I suppose it was not intended to be insinuated, but it was almost conveyed by the speech of the hon. member for West Durham that the impression intended to be made by the observation of the Minister of Militia and Defence was that there was danger of Louis Riel being lynched by the volunteers, and that we were putting forth that argument as an explanation of the letter and of his conduct. Everybody who heard the hon. Minister knows that the question in hand is not what was really necessary; everybody knows that the safe conduct of General Middleton was unnecessary to protect any man from the violence of our volunteers; the simple question was, what it was that Louis Riel feared—that the danger was that he asked to be protected against; and if he asked to be protected against the violence of the volunteers there certainly was no imputation against the honor and gallantry of that corps, as was attempted to be represented, in the criticism of what was said by my hon. colleague the other day. I propose to deal as briefly as possible with the contention that this crime should have been mercifully dealt with, in consequence of its being a political offence. It is true that the crime of treason, technically, and in a strictly legal view, may be always said to be a political crime in the same sense as that in which we speak of the \"political existence of the sovereign,\" and the \"political division of the country.\" But it is equally true that, although technically a political crime, it is not always of necessity such an offence as comes within the recognized rule of civilized countries, i.e., which clemency is extended to political offenders. We have in every case to consider, not what technically the crime is called, because, although it may have amounted to treason, the overt acts which constituted the treason may not themselves have been a political offence. If any one assassinated his sovereign from private malice or private revenge, or to gratify some motive of that kind, the offence in one sense would be political, because the crime of high treason had been committed, but nobody would contend that it came within that class of political offences, in respect of which it is said that clemency ought always to be exercised. The class of political offences in respect of which it is said that clemency is always exercised in civilized countries, consists of those offences which are committed by a people while the country is in a state of civil war. After civil war has prevailed, clemency is always extended to those persons who, either by the contagion received from their leaders or from the impulse of the enterprise itself, or from the patriotism with which they were inspired by the circumstances of the country, were induced to follow their leaders into acts of rebellion; but it may be that in the course of the rebellion offences were committed which were very different from political offences in the ordinary sense of the term. We must in all these cases look at each individual\ncase, and ascertain whether the overt acts which constitute the treason or treason-felony are themselves political offences in the ordinary sense of the rule I have mentioned; although, taking a strictly technical or legal view, they might all be classed in that category. To show you that this is no new or finely spun theory, I will refer you to the debate which took place in the British House of Commons, from which the hon. member from West Durham (Mr. Blake) made several quotations—the debate in connection with the Fenian prisoners who were concerned in the murder of constable Brett. In the first place the men were under conviction for treason-felony. In a strictly technical sense, that is as much a political offence as high treason, and if their case had to be looked at simply under the legal classification of the crime, undoubtedly it would be considered simply as a political offence. The prisoners were all members of the Fenian brotherhood, bound, as we all know, by a secret oath to aid one another and to enter upon every enterprise on which they were ordered, which would tend to the advancement of the national cause. In pursuance of that obligation, it became the duty of those men, in so far as the obligation which they had undertaken could be said to impose any duty, to attempt to rescue a prisoner, a member of the same organisation, concerned in the same treasonable enterprise. In the course of a successful attempt to rescue that man, they killed a police constable; they were arrested and tried and all suffered sentence for treason-felony, which, if we take the legal classification of the crime, was as much a political offence as the crime of high treason. Mr. Gladstone said:\n\n\"I contended when in an official position, and still contend, that the offence of the principal part of those prisoners does not fall purely within the category of political offences.\n\n\"What constitutes a political offence?\" It is quite clear that an act does not become a political offence because there was a political motive in the mind of the offender. The man who shot Mr. Percival and the man who intended to shoot Sir R. Peel did not become political offenders merely on this ground. By a political offence I at least understand an offence committed under circumstances approaching to the character of civil war.\"\n\nOn 25th July, 1873, in answer to a question as to amnesty to the Fenian prisoners, Mr. Gladstone said:\n\n\"I am sorry to say, Sir, that there is a strong and conclusive reason, one which over-rides every other reason, for not extending this amnesty to the men referred to, and leading, for us to conclude that these men are not political prisoners at all in the sense in which indulgence might be extended to prisoners of that character. It is a sound principle of modern administration that when there has been a convulsion in a country and a contagion of strong feelings has led men to join it—when it is put down by the arm of the law, the individuals who were parties to it should be dealt with very leniently. But, Sir, I know no reason why single individuals who without the apology of contagion have endeavoured to bring about bloodshed should be so dealt with.\"\n\nWe have the fact, in relation to Riel, that there was no influence of contagion in his case, except that he was the man who strove to spread the contagion. We have in his case the fact that he came to the North-West for the purpose of preventing constitutional agitation, for the purpose of explaining to the half-breeds—and the hon. gentleman will find this in one of the exhibits of the trial—that they never should petition the Ottawa Government for anything again; for the purpose of declaring to them, as was detailed in the evidence I read this afternoon, that it was blood they wanted, that it was a war of extermination they should enter upon; and I contend that in the overt acts which this man committed in the course of his treasonable career, he went far beyond the limits of a political offence. I contend that he put himself outside the rule which extends clemency to those who, on account of the excitement of the moment or the contagion which has already spread throughout the country, have been induced to follow leaders into evil courses. But I have an authority nearer home on that question. I have already cited to the House a speech of the hon. member for West Durham (Mr. Blake) in connection with the outbreak of 1869-70. I have shown that he was then urging that steps should be taken to have Riel extradited from the United States, and the hon. gentleman knew well that extradition could not be asked in relation to a political offender, and he stated, and stated properly, that the conduct of Riel has been something worse than mere political offence, and that we were justified therefore in asking his extradition; and he took this view on precisely the same grounds as those which I have pointed to this evening. But we do not need to go to the records of the Legislature of Ontario to find what the hon. gentleman said there, for in this House, on the 11th April, 1871, speaking of this question, the hon. gentleman said there:\n\n\"It might be possible that Riel's crime was not an extraditable offence, but he (Mr. Blake) denied that such trouble as that which took place in the North-West should be looked upon as a political movement.\"\n\nMr. Speaker, it would be an exceedingly dangerous doctrine for us to lay down that every offence which can be committed in the course of a political movement is an offence for which executive clemency is to be exercised. The law of this country, the law of the mother country, the law of every country in the world where capital punishment is retained, levels the threat of capital punishment against the heads of those who commit high treason, or what may be equivalent to high treason; and with such a law on the statute book as exists on our statute book and was passed no further back than 1869, is it possible that the Executive or that this House is to declare that we are never to carry it out? That is what it amounts to. If an amnesty is always to be given for what is in one sense a political offence—and it must be always given if it were given in this case—it would be equivalent to saying that the law is plain, but the Executive do not intend to carry that law out. Let us look for a moment to the report of the Commissioners on Capital Punishment from which the hon. member for West Durham (Mr. Blake) quoted so largely on Friday evening. Upon that commission were some of the ablest jurists of the mother country, and upon it were some of the ablest theorists of the mother country with regard to the question of capital punishment. Some gentlemen went on that commission because they were the advocates of the abolition of capital punishment, and notwithstanding that, we have the report of that commission plainly expressed; and I cite it with the more emphasis and the more confidence because the hon. member for West Durham (Mr. Blake) insisted, in a long and elaborate argument, that the Executive, in dealing with capital\nences, ought to be guided by the recommendations of those commissioners. The recommendation of the commissioners with regard to treasonable practices is this:\n\n\"We have, then, first to consider whether, assuming capital punishment to be retained, we should recommend any change in its present application to the crime of treason, and upon this point we have come to the conclusion that no alteration is required. The maxim 'punishment under the Treason-Felon Act is penal servitude for life, which seems sufficiently severe in cases of constructive treason unaccompanied by overt acts of rebellion, assassination or other violence. With respect to treason of the latter character, we are of opinion that the extreme penalty must remain.\"\n\nThe hon. gentleman told us, as I already intimated, that it was the duty of the Executive to be guided by the humane and enlightened views of this commission. More than that, it was urged in other quarters of the House that every civilized country, in practice, if not in law, had departed from the system of enforcing capital punishment in cases of high treason. I think no one will dispute that the Legislature of the mother country is as enlightened and as advanced in the principles of humanity, relating to the administration of the criminal law, as that of any country in the world, and we have the elite of that Legislature putting upon record that, in cases of treason, accompanied by overt acts of rebellion, assassination or other violence, the extreme penalty of the law must remain. From that decision not one dissented, except th.ee, who wanted capital punishment abolished altogether, even in the worst cases of murder. Lord Cranworth, then ex-Chancellor, stated under examination as follows:\n\n\"Q. Am I to understand your Lordship to concur in your view with regard to the application of capital punishment to cases of murder?—A. Yes, and treason. I think that treason certainly ought to be placed in the same category; because, although there may be some cases of treason which, as has been said, if successful, ceases to be crimes, yet you must treat treason as the highest crime known to the law; and if people are to be punished capitally for murder, I think that they should be punished capitally for high treason.\"\n\nLord Bramwell was next under examination, and this question was put to him:\n\n\"Would you deem it advisable to retain capital punishment in cases of treason and murder?—A. I certainly should think it advisable to retain capital punishment for murder. As to treason, I confess that it has never occurred to me to speculate on it. It perhaps is a worse offence in some respects than even murder, because it involves the taking of life and the alarming of the whole country, but still I can see that it may not be an expedient punishment in that case, because it is not a case in which the public feeling goes with the infliction of capital punishment as it does in cases of murder. It is in vain to have a law in the administration of which the public disposition will not fairly assist. As regards treason, I think that if it were limited to mere conspiracy, without an actual outbreak, it would then not be a desirable thing to inflict capital punishment upon it, but where there is an actual outbreak, it is different.\"\n\nThe case of Smith O'Brien was alluded to at an early part of this debate, and again on Friday evening, as an instance of clemency on the part of the Executive of Great Britain. This is what Lord Bramwell says about it:\n\n\"Take it even in the trumpery case of Smith O'Brien's treason in Ireland. That man was guilty not merely of treason, but he was guilty of acts which were very likely to take away human life, and he was in that happy situation in which traitors often are, that is to say, he had a great deal of public sympathy with him. If he had been as much as the common murderer, if he had been as much as the common thief, or as much as the common king of Ireland, a worse, or something of that sort, and when the commission of a crime is so profitable and advantageous as that, if you succeed, you get a great advantage, and, if you fail, you have an immense quantity of public sympathy, one would think it would be reasonable that this law should step in and say: We will endeavor to deter you from the commission of so tempting a crime; but still it is to be borne in mind that public opinion would not go with punishing a man for treason when his treason, however foolish, was what others might call honest. Then it is impossible to discriminate between honest and dishonest treason.\"\n\nMeaning, of course, by legislation, because that was the proposition before him.\n\n\"And the result is that I should think that in most cases, and perhaps in all cases of treason, capital punishment would be an inexpedient punishment.\n\n\"Q. Your opinion is that in every case of treason which is not accompanied with murder, the punishment should not be capital?—A. I think so.\"\n\nAnd nearly all the judges of the three kingdoms who were examined as witnesses before that commission gave it as their opinion, founded on experience and observation, that capital punishment should not be abolished in cases of treason. If we look at the condition of the country in which this crime was committed, we see peculiar reasons why we should hesitate to assert that the crime of high treason should never be punished with capital punishment there. The reason why, in some older countries, the Executive can afford to be liberal in extending clemency to what are called, in the widest acceptation of the term, political offences, is explained by the fact that the country is well settled, that the Government is established on a strong basis and supported by standing armies and by great bodies of police, as well as by tribunals which exist in every section of the country to administer and enforce the law. But the North-west is remote from the seat of Government, the law is weak; it has a population the most easily excited of any population in the world; it has an immense frontier, offering advantages to those who, from the vilest motives, from a desire to inflict a great injury upon Canada, can at any moment cross the border and commit acts of depredation on our territory and incite to rebellion, and go back to comparative immunity. All these reasons are reasons why the Government of that country should be a Government with a strong hand, and why it would be most unwise, in relation to the offence of high treason or any other offence known to the law, for the executive to declare in advance, as it is proposed to be declared now, that political offenders, in the widest acceptation of the term, shall never be refused Executive clemency. A good deal has been said with regard to the conduct of the authorities of the United States during the civil war. It seems to me that no comparison less parallel could possibly have been suggested.\nThere civil war had raged for years; the two sections had large standing armies, and the Federal authorities had from first to last extended the rights of belligerents to the rebels, and enforced their rights against them as belligerents, by the blockade, by the exchange of prisoners, by negotiations for truces, and by nearly everything that went on for a series of years. But, Mr. Speaker, to compare the incendiary outbreak which was committed in the North-west to the civil war in the United States, to compare the man who set fire to that magazine of powder, as it was described when he was asked to come to the North-west, with the patriot who laid down his arms to General Grant at the head of the chivalry of America, is to compare cases as wide apart as the poles. Besides that, Sir, in relation both to General Lee and to Jefferson Davis, there was a great constitutional question behind. It has never yet been decided in the United States that in a State under the federal system a man who, in obedience to the constitution of his own State—and these States had a right to change their constitution from time to time—the man who goes into the field, or by any other act conducts himself in accordance with the constitution of his own State, acts in co-operation with the armies of his own State, and opposes in that way and to that degree the Federal authority—it has never yet been decided, I say, although there are dicta to that effect, that it is high treason, in the sense in which high treason should be punished by the Federal Government of the United States. But, Sir, when we come to deal with other classes of political offences in the United States, when we come to look at offences, not in pursuance of a general outbreak, not with the excuse of enthusiasm inspired by leaders who have fallen into the hands of the law, and have suffered sufficient punishment, we know how those offences have been dealt with in the United States. We know that in the widest sense of the term the offence for which John Brown was executed was as much, and far more, a political offence than that which was committed by Louis Riel, and we know what his fate was; we know the punishment that was meted out to the murderer of President Lincoln, and we know the statements which were made in public by the highest authorities in the United States with regard to the wisdom of enforcing, in relation to those offenders, the penalties of the law against high treason.\n\nAn hon. MEMBER. Hear, hear.\n\nMr. THOMPSON.—An hon. gentleman on the other side of the House says: \"Hear, hear,\" and he will, no doubt, try to turn my argument by referring to the fact that excessive punishment was meted out to some of those offenders, and that in relation to some of them there have been misgivings ever since as to the justice of their condemnation. I am not referring to individual cases, I am referring simply to the fact that in that country, as in every other country in the world, although the crime was committed for a political motive, the offenders were held to be entirely outside the rule which claims Executive clemency for political offenders. The President of the United States stated upon a public occasion in relation to the question:\n\n\"The American people must be taught, if they do not already feel, that treason is a crime, and that it must be punished; that the Government will not bear with its enemies, and that it is strong not only to protect but to punish. When we turn to the criminal code and examine the catalogue of crime, we find arson laid down as a crime, with its appropriate penalty; we find there, too, theft, and robbery, and murder given as crimes; and there, too, we find the last and highest of all crimes—treason. With other and inferior offences our people are familiar. But in our peaceful history treason has been almost unknown.\"*\n\nThe people must understand that it is the blackest of crimes, and will surely be punished. I make this allusion, not to excite the already exasperated feelings of the public, but to point out the principle of public justice, which should guide our action at this particular juncture, and which accords with sound public morals. Let it be engraven on our every heart that treason is a crime and that traitors shall suffer the penalty.\"\n\nWhatever feelings of exasperation may have existed in that community in regard to those offenders, I think hon. gentlemen will agree with me that these sentiments were just, and might have been uttered in any country and at any time when the head of the state had been stricken down, even for a political purpose, by an assassin. I propose to refer for a few moments to the arguments which have been presented on the question of the insanity of this convict. I was struck, as most hon. members were for the moment, with the argument which fell from the hon. member for Rouville (Mr. Gigault) in the course of his exceedingly argumentative speech with reference to the case of Lord George Gordon. There seemed, at first glance, until one recalled the history of the case, to be something parallel in the two cases, only that that case seemed very much stronger than this. A moment's reflection, however, must have convinced the hon. gentleman himself that there was, at least, a slight difference between the two cases—the difference being that Louis Riel was convicted and Lord George Gordon was acquitted. It cannot be said, Sir, that the tribunal took a more merciful view of Lord George Gordon's case than the court took of the case of Louis Riel with regard to the question of insanity, because there is this difference likewise, Lord George Gordon was not defended upon the plea of insanity at all. Lord George Gordon was defended and acquitted on the ground that the only purpose proved against him was that of presenting, by a monster meeting, a petition to Parliament, and that there was nothing in his conduct, acts and words which would justify his condemnation for the acts of violence committed by that immense meeting after it had assembled. There was therefore no asseveration as to the doctrine of insanity and of Executive clemency in relation to his case. In 1864, Mr. Gathorne Hardy said, in relation to a particular case and in relation to the appeal for Executive clemency in that case:\n\n\"Here was an opportunity before trial, and at the trial, to enquire into the state of his mind. The verdict should, he thought, be conclusive as to the state of his mind up to the period of the verdict, and enquiries should only refer to the state of his mind after the verdict and up to the period of his proposed execution.\"\n\nOf course it must be conceded that there is a class of cases in which that rule could not hold, a class in relation to which it might be said that the haste of the trial, the poverty of the prisoner, or mischance,\nor accident at the trial prevented a full enquiry being made. But leaving out of consideration the mere question of mistake, the principle was laid down by the Home Secretary and has not been departed from since, that when a full opportunity has been given for enquiry on the trial into the state of the prisoner's mind, and that enquiry has taken place, the verdict is to be conclusive as to the condition of the prisoner's mind down to that time. The hon. member for Bellechasse (Mr. Amyot) said we were not in a position to tell the House that the jury were told to acquit the prisoner if the prisoner was insane. The hon. member of course made that statement by inadvertence, because the judgment of the Court of Queen's Bench in Manitoba shows that that was precisely the charge of the judge. But since then the charge of the judge has been laid on the Table of the House, and the hon. gentleman should certainly withdraw the objection when I read to him the words of the judge's charge. Judge Richardson said:\n\n\"It must be proved that at the time he committed the act he was laboring under such defective reasoning from a diseased mind as not to know the nature and quality of the act he was committing, or that if he did know it he did not know he was doing wrong. That I propound to you as the law. If the evidence convinces you, and convinces you conclusively, that such was the case, then your duty is to acquit the prisoner.\"\n\nI must repeat now in connection with this branch of the argument, that the prisoner had a peculiar advantage at Regina which does not apply to a prisoner convicted in the Provinces. He had an appeal on that very question as to whether the jury were right or wrong in their verdict, to the full Queen's Bench of Manitoba. In giving judgment on that subject chief justice Walbridge said:\n\n\"It is said the prisoner labored under the insane delusion that he was a prophet, and that he had a mission to fulfill. When did this mania first seize him, or when did it manifest itself? Shortly before he came to Saskatchewan he had been teaching school in Montana. It was not this mania that impelled him to commence the work which ended in the charge at Batoche.\"\n\nWe have heard a great deal said about delusions, delusions tending to the commission of political offences. The chief justice of Manitoba conclusively shows there was no association between delusions about being a prophet and the proceedings which terminated at Batoche.\n\n\"He was invited by a deputation, who went for him to Montana. The original idea was not his—did not originate with him. It is argued, however, that his demeanor changed in March, just before the outbreak. Before then he had been holding meetings, addressing audiences, and acting as a sane person. His correspondence with General (now Sir Frederick) Middleton shows no signs of either weakness of intellect or of delusions. Is this the definition of this disease, as given by the experts. And how does his conduct comport therewith? The maniac imagines his delusions real, they are fixed and determinate, the bare contradiction causes irritability.\"\n\nAnd then the chief justice cites a long passage from the evidence of Father André for the purpose of showing that his delusions were not irresponsible ones, but that Riel proposed to resist and control them at the price of $35,000. The Chief Justice said:\n\n\"A delusion must be fixed, acted upon, and believed in as real, overcome and dominate in the mind of the insane person. An insanity which can be put on or off at the will of the insane person, according to the medical testimony, is not insanity at all in the sense of mania.\"\n\nTaylor, J., says:\n\n\"After a critical examination of the evidence, I find it impossible to come to any other conclusion than that at which the jury arrived. The appellant is, beyond all doubt, a man of inordinate vanity, excitable, irritable and impatient of contradiction. He seems to have at times acted in an extraordinary manner, to have said many strange things, and to have acted, often, in a loud, loud, professedly arbitrary, arbitrary, arbitrary and political attitude. But it all stops far short of establishing such unsoundness of mind as would render him irresponsible, not accountable for his actions. His course of conduct indeed shows, in many ways, that the whole of his apparently extraordinary conduct, his claim to divine inspiration, and the prophetic character, was only a part of a cunningly devised scheme to gain, and hold, influence and power over the simple-minded people around him, and to secure personal immunity in the event of his ever being called to account for his actions.\"\n\nThese were not the judgments of inferior judges. These were not the judgments of judges dependent upon Executive bounty. These were not the judgments of judges appointed at the pleasure of the Crown. These were the judgments of the Court of Appeal in the Province of Manitoba:\n\n\"He seems to have had in view by professing to champion the interest of the Metis, the securing of pecuniary advantage for himself. This is evident from among other circumstances by the conversation detailed by the Rev. Mr. André.\"\n\nHe then proceeds to point out what the evidence of the Rev. Mr. André is, and the learned judge, in a passage which is too long for me to weary the House, with, shows that the plan of the campaign which Louis Riel prepared, and which he carried out with such adroitness, as far as his force would allow him, are all evidence not only to show that he was responsible in the eye of the law, but that there was no reason for assuming that the delusions under which it was admitted he sometimes labored, prevented the control of his actions. Mr. Justice Killam said:\n\n\"Mr. Lemieux laid great stress upon the fact that the jury accompanied their verdict with a recommendation to mercy as showing that they thought the prisoner insane. I cannot see that any importance can be attached to this. I have read very carefully the report of the charge of the magistrate, and it appears to have been so clearly put that the jury could have no doubt of their duty in case they thought the prisoner insane when he committed the acts in question. They could not have listened to evidence without understanding fully that to bring in a verdict of guilty was to pronounce emphatically their disapproval of the insanity of the prisoner. The recommendation may be accounted for in many ways not connected at all with the question of the insanity of the prisoner.\"\n\"The stipendiary magistrate adopts, in his charge to the jury, the test laid down in MacNaughten's case, 10 Cl. & F. 224. Although this rule was laid down by the leading judges of England, at the time, to the House of Lords, it was not so done in any particular case, which was before that tribunal for adjudication, and it could hardly be considered as a decision absolutely binding upon any court. I should consider the court fully justified in departing from it, if good ground were shown therefor, and even if such a departure of course against it happened to the effect, that the rule adopted was applied to the facts of a particular case. In the present instance, counsel for the prisoner do not attempt to impugn the propriety of the rule, and in my opinion they could not successfully do so. It has never, so far as I can find, been overruled, though it may to some extent have been questioned. This rule is, that notwithstanding the party did the act complained of with a view, under the influence of insane delusion, of redressing or revenging some supposed grievance or injury, or of producing some public benefit, he is nevertheless punishable according to the nature of the crime committed, if he knew at the time of committing such crime that he acted contrary to law.\"\n\nAfter some further development of that question, he says:\n\n\"I hesitate to add anything to the remarks of my brother Taylor upon the evidence on the question of insanity. I have read over very carefully all the evidence that was laid before the jury, and I could say nothing that would more fully express the opinions I have formed from its perusal than what is expressed by him. I agree with him also in saying that the prisoner has been ably and zealously defended, and that nothing that could assail his case appears to have been left undone to convince any reasonable mind that he was insane. The jury, whether from the evidence adduced, or otherwise, had decided against the weight of the evidence upon the prisoner's insanity. I should desire to find that the court could so interpret the statute as to be justified in causing the case to be laid before another jury for their consideration, as the only feelings we can have towards a fellow creature who has been deprived of the reason which places us above the brutes, are sincere pity and a desire to have some attempt made to restore him to the full enjoyment of a sound mind.\n\n\"The prisoner is evidently a man of more than ordinary intelligence, who could have been of great service to those who have been engaged in the work of civilization, and who could be rendered to the country would be, that he should, if possible, be restored to that condition of mind which would enable him to use his mental powers and his education to assist in promoting the interests of that important class in the community to which he belongs. It is with the deepest regret that I recognize that the acts charged were committed without any such justification, and that this court cannot in any way be justified in interfering.\"\n\nThe case, as I have already reminded the House, went to the Judicial Committee of the Privy Council, and their comment upon the rulings of this tribunal was that these points:\n\n\"Have been dealt with by the judgments of the Court of Appeal in Manitoba with a patience, learning and ability that leaves very little to be said about them.\"\n\nAfter the finding of this tribunal, after that thorough sifting of all the facts and the law bearing on the case, this House has been actually told time and again that there was not evidence enough there to hang a dog. I do not propose to weary the House by going over the series of points which were taken up by our friends opposite—\n\nSome hon. MEMBERS. Go on, go on.\n\nMr. THOMPSON (Antigonish). I shall, then, with the indulgence of the House, continue a little further on the question of the prisoner's insanity. Father André and other witnesses, including the bishop and the clergymen who signed the depositions from which I read extracts a short time ago, showed that the people of that district were so simple, confiding, religious and almost superstitious that there was no way in which he could attain so much control over them as by pretending that he was a prophet and had a divine mission. In a country whose population was differently situated and differently educated, that would be a strong proof of madness. In that country it was a strong proof of design, and the success which the pretension of being a prophet and having a divine mission met with, the effect of inducing these men, who shed tears as they were going away, to take up arms and go into the field, shows that there was anything but insanity in the conception of that scheme. The hon. member for West Durham thinks that when the Orders of the Council were brought down it will appear that Riel was proclaimed by Order in Council to be a prophet. The mastery which he had acquired over these simple half-breeds is shown by that fact. It was not the act of Louis Riel himself alone, but his whole council were willing to declare that he was a prophet. With regard to this pretension of having a divine mission, let me ask hon. members of this House were all the half-breeds insane too? If they were not insane, this was not necessarily an insane act, because it convinced them and induced them to follow him. If they were insane, what becomes of the pretence made by hon. gentlemen opposite that this outbreak was forced upon them by the criminal conduct of the Government and that the rebellion was justified? My hon. friend beside me asks, were all his council insane? The Order in Council, as I said before, which admits his gift of prophecy, bears the signatures of those people, and not Louis Riel at all; and I think I am justified in asking the House to consider whether the people upon whom he imposed his rule, his leadership, and his tyranny, by the pretence that he was a prophet and had a divine mission, were all insane. If not, then the fact that he adopted a device of that kind, and that it succeeded, was evidence certainly that it was not such an insane thing to do in that country and among that population after all. The statements which were given in evidence by Nolin with regard to his claim to have the gift of prophecy, the bodily symptoms, which exhibited themselves sometimes in his person, were commented on by the hon. member for West Durham. The refutation of all that is contained in Louis Riel's speech at the trial, in which he says there was nothing so insane about that conversation after all, \"because,\" he said, \"it is a little saying we have in that country; it is a little popular superstition; and sitting at the fireside in ordinary conversation, a man says, partly in humor and partly in earnest\"—I am only paraphrasing his words but stating them in substance—\"A man says, now I can prophesy.\" I shall be told presently, as I was told before, that the fact of his having made such a speech itself indicated insanity. It might have been so if he had not announced and declared that he had another and better hope than that—that he had little reason to believe that.\nthose who understood him so well and had such experience of him as the Government of Canada had, would tolerate his plea of insanity if the jury should find against him, as they were likely to do; and he relied on the political harangue he made there, according to the statement he made to Nolin at Batoche, that he looked for his safety to politics rather than to any plea of insanity. Then, we had the singular argument from the hon. member for Quebec East (Mr. Laurier) that he was insane because he appointed Jackson his secretary, and Jackson was a madman. Yet the hon. member for West Durham (Mr. Blake) said he was insane because he shut Jackson up as a madman. These two arguments surely cannot both be good. It cannot be that he was mad to appoint a madman as his secretary, and that he was mad to treat him as a madman afterwards. I think there is considerable evidence against the argument of his insanity as derived from the appointment of Jackson as his secretary. Jackson has proved himself, even if as thoroughly mad as the hon. member for Quebec East declared him to be, to be a man having occasional lucid intervals, during which he is a man of considerable talent and force, and Jackson may have been appointed secretary when not under the influence of his madness at all. But one of the best proofs that Riel was not a madman was that when Jackson developed insanity, he took very good care to lock him up. It was said likewise that when the papers taken at Batoche were brought down, it would appear that Louis Riel was totally mad because he had a scheme for changing the names of the days of the week. It is true that partly in carrying out the scheme of his new religion, as he called it, he did propose to change the names of the days of the week, and to abjure the heathenish names by which we are pleased to call them. Now, judged by our standard, our civilization and our time, that would seem to be a very extraordinary act. But all that was transpiring there was in the fervid glow of superstition, cunningly excited at every step to delude and entangle that people, and this was a clumsy imitation of the great revolution which took place a century ago on another continent; but I never heard it imputed to insanity in those who carried out the French revolution, that they changed the names of the months, and I do not see why Louis Riel should be considered mad because he wished to leave his influence and his trace on the North-West in that way. But it is said that his partition of the North-West into different nationalities was evidence of madness. If you believe Louis Riel in his speech at the trial, that argument is dissipated to the winds. He said that for the purpose of securing co-operation in his design to conquer that country or to rule it, he desired to tempt into the country the nationalities living along the border in the United States; and he, who knew that country and its population, knew that the nationalities for whom he promised to sub-divide the North-West were those who lived across the border and from whom he was expecting assistance when he said: \"Before the grass is so high, I shall have foreign forces in this country.\" Charles Nolin, with reference to the question of insanity, says:\n\n\"Witness is asked if prisoner had separated from the clergy, and he says completely. He says the half-breeds are a people who need religion. Religion has a great influence on their mind. The witness is asked if without religion the prisoner could have succeeded in bringing the half-breeds with him, and the witness answers no. It would never have succeeded. If the prisoner had not made himself appear as a prophet, he would never have succeeded in bringing the half-breeds with him.\n\n\"By Mr. Lemieux, recross-examination.\n\n\"The witness is asked if the prisoner did not lose a great deal of his influence in that way by the fact that he lost the influence of the clergy, and he says that at the time he gained influence by working against the clergy and by making himself out as a prophet. The witness is asked if he means that the people did not have confidence in their clergy, and he says no, but he says they were ignorant and he was taking advantage of their ignorance and their simplicity.\"\n\nThis is from Father André's examination:\n\n\"Q. Is it not true that religion has a great influence upon them?—A. Yes.\n\n\"Q. Is it not true that a man who tried to govern them by inducing them to completely change their religion or to do away with it, would have no influence with them at all?—A. Exactly; it was just because he was so religious and appeared so devout that he exercised such a great influence upon them. I wish to explain this point, because it is a great point. With half-breeds he never was contradicted, and consequently, he was never excited with them, and he appeared in his natural state with them. He did not admit his strange views at first, it was only after a time that he proclaimed them, and especially after the provincial government had been proclaimed.\"\n\nMr. MILLS. Hear, hear.\n\nMr. THOMPSON (Antigonish). The hon. gentleman who says \"hear, hear\" really fancies, I suppose, that this is an explanation why the half-breeds did not observe his insanity, but we are told by the hon. member for West Durham that these half-breeds joined him in an act of insanity when they proclaimed him a prophet. True, the speech at the trial is to be taken to some extent as some slight evidence of derangement of mind because he thought to dispel then the impression that he was insane; but, as I have said, he had definitely formed plans before that with relation to his line of defence and with relation to his appeal to the Executive for clemency. He had conceived the idea in expressing the phrase that \"politics would save him,\" that the term \"political offence\" was large enough to cover all the crimes he had committed, as well as it did the deliberate and shocking murder he had committed in 1869-70, and would also cover his criminal and openly avowed intention of bringing foreign troops into the country. He thought that the clemency which was large enough to cover the crime of 1869-70, which the hon. member for West Durham (Mr. Blake) had declared \"a damnable murder,\" would surely be large enough to cover the criminal offence of exciting half-breeds and tempting foreign forces into the country. It is said that the evidence produced at the trial proves conclusively that this man had delusions. So he had. So have many persons who have committed crimes, and it is the opinion of some medical writers that all persons who commit crimes, against the moral law at any rate, are more or less under the influence of\ndelusions; but we shall have to go further than that before we make up our minds that this man was either irresponsible on the ground of these delusions, or that the moral guilt of his offence was lessened by these delusions. A man may have strong political delusions, but it does not at all follow that the acts he commits, such as incendiarism, murder, or inciting others to commit murder, are at all the consequence of these delusions, or that his delusions have so mastered him that he is unable to resist the impulse to commit crime. Stephens, in his History, from which the hon. member for West Durham cited so largely the other night, and in regard to which I endorse all he said as to the weight of the authority, says:\n\n\"Parts of the conduct of mad people are not affected by their madness, and if such parts of their conduct are criminal they ought to be punished for it.\"\n\nI admit that when a man has political delusions, there may be a connection between his delusions and his crimes, but that is a question to be submitted to the jury. In this case it was submitted to the jury with the most liberal instructions by the judge, and the finding of that jury, sustained by two judgments in appeal, was that he was undoubtedly the subject of political delusions, but that his conduct was not so connected with them as to lessen his culpability. I admit that a jury ought to be careful in such cases to ascertain that there is no connection between the delusion and the crime, but in this case the great patience exercised by the jury in sifting the fact, and the careful scrutiny this case received on appeal, show that the jury discharged their duty carefully and conscientiously. Upon that subject I might cite at some length, but I refrain from doing so, the celebrated case which was tried in the United States a few years ago, and in relation to which the man who was condemned, if the evidence is to be believed, had a ten-fold stronger case on which to base a plea of insanity than Louis Riel. I refer to the case of Guiteau. The treatment which he received at the hands of the law and of the Executive, notwithstanding his strong political and religious delusions, is well known, and met with very slight, if any condemnation, either in the United States or here. On 24th January, 1882, a journal which exercises a large influence in this country, and speaks, or professes to speak, for a political party in this country—the journal which, I heard an hon. member declare, the other night, penetrated to the utmost recesses of the earth, used this language with regard to the case of Guiteau, and I cite it because it is peculiarly applicable to the case of Riel, although the conductors of that journal do not seem to think so now. Speaking of the comments which an observer might make in Guiteau's case they said, and hon. gentlemen will see the parallel as I progress:\n\n\"If sufficiently credulous to accept the murderer's assertions as anything more than a piece of blatant hypocrisy, an article of his cunning little mind to save his neck from the gallows, if he could bring himself to credit the words with sincerity, he could not resist the inference that the inspiration was from beneath and not from above, and that having done the bidding of the great adversary on earth he had better be sent as speedily as a due regard for the forms of human justice would permit to continue the congenial service in other spheres.\"\n\nI presume a great and responsible paper like the Toronto Globe would not make these observations against a man in Guiteau's situation because he was condemned in another country, and treat Riel on a different principle because he lived here, and might be a factor in the politics of this country:\n\n\"Men as men and as judges and jurors have no means of determining the motives of other men but by their actions. If such a thing as inspiration were possible, or even of every day occurrence it could never be proved. To admit such a plea for a moment as a palliation for crime, would be to open the door of all kinds of abuse.\"\n\nPassing from the question as to Riel's insanity, as established at the trial, I call the attention of the House to the duty which devolved on the Executive in relation to the subsequent investigation. This duty is well laid down in the common law. In Blackstone's Commentary by Stephen's it is thus defined:\n\n\"If a man in his sound memory commits a capital offence and, before arraignment for it, becomes mad, he ought not to be arraigned for it because he is not able to plead to it with that advice and caution which he ought, and if, after he has pleaded, the prisoner becomes mad, he shall not be tried, for how can he make his defence? If after he be tried and found guilty he loses his senses before judgment, judgment shall not be pronounced, and if it be afterwards, except in case of non sane memory, execution shall be stayed. For, peradventure, says the humanity of the English law, had the prisoner been of sound memory he might have alleged something in stay of judgment or execution.\"\n\nOn the trial of Bateman, 2nd Vol. State Trials, it was said by the Solicitor-General:\n\n\"It would be inconsistent with humanity and inconsistent with religion to make examples of such persons as being against Christian charity to send a great offender 'quick,' as it is styled, into another world, when he is not of a capacity to fit himself for it.\"\n\nThese are the two positions the common law takes upon that subject: That a man who develops madness after trial and judgment is not to be executed, because he has not the opportunity of moving; in arrest of judgment to stay the execution, and because it would be inhuman to send a person into eternity who is too insane to be conscious of his approaching end. Our attention was called by the memorial of Father André to the conviction which appeared to have impressed his mind that since the trial this man was in an absolutely mad condition, a condition such as that described in the two passages I have cited, in which it would be against human charity to send him to another world unconscious of the destiny that awaited him, and in that state of mind in which he could not make an application if any were open to him in relation to his case. The investigations which were made by three doctors, whose reports are on the Table, shows that there was no material change in his condition from the time of the trial down, and as regards the condition in which he was said to have been then, with regard to the political delusions, with regard to the hallucinations, admitting all they said, the jury had passed upon that, after the fullest investigation and the clearest instructions; and they had said that, notwithstanding that he\nhad hallucinations upon the subject of religion and occasionally upon the subject of politics, these hallucinations were not connected with the crimes of which he was convicted. The reports then showed that the condition of the man's mind had not changed, and it was fully apparent, even from the memorials submitted in his behalf, that he knew in what condition his case was and understood that his end was approaching. He received all the preparation for that end which his spiritual ministrant could bestow upon him, he was able to receive the sacraments of the church, and he was in a condition of mind not less sound than that in which he had appeared before the jury. A statement was made by the hon. member for West Durham (Mr. Blake) the other night which seemed to impugn the reliability of one of the doctors who joined in that report. It is not necessary for me to say anything with regard to the experience of those men. They had extensive experience with regard to this particular case, and I think it is most unfair to say that, because one of them was present at the trial, he was prejudiced against the prisoner. But it is said that Dr. Lavell's report must be viewed with great suspicion, because, in the case of Michael Lee he had testified that he was perfectly sound in mind when he was convicted at Napanee, while Michael Lee had afterwards been found to be undoubtedly insane, and that commutation was granted because Dr. Lavell was entirely wrong. That statement, I observed, created an impression upon the House. The hon. gentleman had not asked for the papers in that case of Michael Lee, excepting to state in his speech: \"I ask for them now.\" The hon. gentleman can have them, and any hon. member can have them if he desires, but I say now that the rebuke which the hon. member passed upon the hon. member for Ottawa (Mr. Mackintosh) for not stating the case of Michael Lee in the list which he gave, was so far from being a just one that, instead of Dr. Lavell having testified that that man was sane when he was perfectly insane, I find, after having read the case, that Dr. Lavell was never examined at the trial at all.\n\nMr. BLAKE. I never said so.\n\nMr. THOMPSON (Antigonish). It is quite true that at a subsequent stage of the case—\n\nSome hon. MEMBERS. Hear, hear.\n\nMr. THOMPSON (Antigonish). Hon. gentlemen shall have all the satisfaction they can derive from that.\n\nMr. BLAKE. That is what I said.\n\nMr. THOMPSON (Antiganoish). The hon. gentleman said, if I remember correctly, that at the trial—\n\nMr. BLAKE. No; I did not.\n\nMr. THOMPSON (Antigonish),—that, at the trial, Dr. Lavell pronounced him perfectly sane, and he was found to be perfectly insane.\n\nMr. BLAKE. No; I did not.\n\nMr. THOMPSON (Antigonish). If he did not—and, of course, I accept the statement of the hon. gentleman—I withdraw the contradiction I made as to what he said of Dr. Lavell's statement at the trial, but I will quote, for the benefit of those hon. gentlemen who cheered so lustily just now, what the report was which Dr. Lavell afterwards made, in order to show that it was no such report as the hon. member for West Durham supposed it to be. Dr. Lavell was called to examine Lee, and was called in conjunction with another physician. The other physician differed from him so far as to think that Lee was insane and irresponsible, and what Dr. Lavell said in his report was not that he was perfectly sane, but:\n\n\"In view of his weakness of intellect, moral obtuseness and ignorance, it is not an easy matter to arrive at a positive conclusion. It is a kind of case that I think requires a more lengthened expert observation. The gravity of the case I have considered in all its bearings, and, if pressed for an immediate opinion, my conclusion are that Michael Lee, though a man of low intellect, having no proper moral sense and deplorably ignorant, is nevertheless in a condition to distinguish between right from wrong, and that any peculiarities manifested, leading to the suspicion of insanity, may be attributed to his few habits of life.\"\n\nNow, hon. gentlemen who cheered me so loudly a few moments ago, will see that Dr. Lavell did not pronounce Michael Lee to be perfectly sane, but declined without further investigation to pronounce upon the question whether he was insane or not, but, if pressed for an immediate opinion, he said he would go so far as to say that he knew right from wrong; and the physician who examined the case with him did not deny that, although he thought his conduct was such as to throw some doubt upon it. I think the House, however, will agree with me that his report, guarded as it was—\"I will only report him as knowing right from wrong if pressed for an immediate opinion, and before going further I must have a further investigation\"—is not sufficient to justify the imputation passed by the hon. gentleman upon the reliability of Dr. Lavell as one of the officers who made the investigation. The hon. member for West Durham contradicted me a few moments ago, when I said that, in the case of Michael Lee, he intimated that Dr. Lavell reported him at the trial as being perfectly sane. The hon. gentleman will allow me to quote from Hansard the words which I was sure fell from his lips at that time:\n\n\"When the trial of Michael Lee for murder took place at Napanee some time ago, Dr. Metcalfe, of Rockwood, Dr. Clark, of Toronto, Dr. Lavell, of Kingston, examined him. Drs. Metcalfe and Clark pronounced him insane; Dr. Lavell pronounced him perfectly sane.\"\nIt may be that the hon. gentleman meant to refer to the subsequent investigation, and not to that which took place at the trial, but I think that he will agree with me that these words justified me in forming the impression I did. If the hon. gentleman intimates, as I suppose he desires to intimate, that he did not mean that Dr. Lavell was a witness at the trial, I do not desire to assert that he meant to say, what I suppose from Hanard he did intend to say; but the whole point of my argument is not to show that the hon. gentleman deceived the House, but to show that he was entirely mistaken in casting upon Dr. Lavell an imputation which might affect the judgment of this House upon the report of the doctors who made this investigation. Now, Mr. Speaker, the duty of the Home Secretary was enlarged upon at great length on Friday. It was stated that although a criminal may be pronounced responsible it was the duty of the Executive to interfere if his moral guilt was lessened by the influence of his delusion. Let me read to the House, as a supplement to the passages which the hon. member read—and I shall read principally from the same authorities which he quoted—some further passages in elucidation of the views which I entertain, and which I humbly think are fully recognised as sound rules upon that question. Mr. Walpole, who was twice Home Secretary, says:\n\n\"Upon all the matters brought before the Secretary of State he is in a position not in the least degree to rehearse the case, but simply to advise the Crown whether there were any circumstances which would justify the exercise of mercy, either in an absolute or in a qualified sense, that is to say, either by pardon or commutation.\n\nI do not believe that a person simply wishes to discharge his duty you can have a better mode of arriving at the truth, not as to whether on appeal you are to decide the question de novo, but as to whether there are any circumstances brought before you to justify you in recommending the Crown to exercise the prerogative of mercy.\n\nThe Secretary of State assumes that the trial having been conducted before a competent tribunal a right conclusion has been arrived at, unless it can be pointed out to him that there was something on which that tribunal erred.\"\n\nNow, Sir, as the hon. member said practically the penalty of capital punishment is only applied in the worst cases, because, in accordance with the report of the Commissioners on Capital Punishment, which I referred to a few moments ago, it was stated that a large number of the crimes which technically came within the description of murder did not involve the full moral culpability of murder; as, for instance, the crime of infanticide, in respect of which it is of late years the rule always to commute the sentence, with respect also to those murders which are committed under strong provocation which does not amount to an excuse in law; and with respect to those murders which are committed without any actual intention to commit murder, but in the attempt to commit some other felony, as in the familiar and often quoted case of the man who shoots a tame fowl for the purpose of stealing it and in so doing kills a human being.\n\nIn all those cases it is abundantly recognised that the Home Secretary interferes for the purpose of a commutation, and it is because, as Sir Fitzjames Stephen says, in the passage which the hon. gentleman quoted, the crime of murder is one with very many shades and variations, that the statistics referred to by the hon. member show that so many commutations take place. But those statistics do not prove, that report does not prove, the conduct of the Home Secretary from time to time in pursuance of that report, does not sustain, I think, the hon. gentleman's position that it is the Executive which pronounces the capital sentence and not the law. It is simply that in a well recognised class of cases the Executive will interfere, while in all others it will leave the offender to the law which he himself deliberately violates, and it does so in all cases where the crime has been deliberate and willful in intention, as every step of this crime was. I think the hon. gentleman will be puzzled to find such a case in which the Executive clemency was successfully claimed. Mr. Walpole also said:\n\n\"I think it right to state specifically what were the recommendations of the royal commissions, which I have endeavored humbly and faithfully to act upon. Those recommendations were three:\n\n\"(1). That the punishment of death be retained for all murders deliberately committed with express malice aforethought, such malice to be found as a fact by the jury;\n\n\"(2). That the punishment of death be also retained for all murders committed in or with a view to the perpetration, or escape after the perpetration, or attempt at perpetration of any of the following felonies: Murder, arson, rape, burglary, robbery or piracy;\n\n\"(3). That in all other cases of murder the punishment be penal servitude for life, or for any period not less than seven years, at the discretion of the court.\"\n\nThese recommendations were unanimously adopted by the committee. Mr. Bruce, Home Secretary, said, on the 28th July, 1869:\n\n\"His hon. friend had referred to the recommendations of the royal commission; but many of those recommendations had been attacked by some of the ablest writers on criminal law, and his own opinion was that, if legislation were possible, as he believed it to be, they must not follow too closely the recommendation of the royal commissioners.\"\n\nSo that instead of a departure from the recommendations of the royal commission being made a matter which would justify a vote of want of confidence, it was stated on the authority of the Home Secretary, that although he generally followed those recommendations, their wisdom had been disapproved by some of the best writers on criminal law, and that if legislation were invited, it would not do for legislation to follow them very closely. Sir George Campbell, too, speaking as an Indian official said, on 10th May, 1882:\n\n\"Speaking as an Indian official, who has had, perhaps, more experience in regard to questions of life and death than any other member of the House, he thought there was a universal concurrence of opinion that nothing could be more objectionable than the present system, under which the Home Secretary could decide on cases of capital punishment out of court, after the verdict and sentence had been passed.\"\n\"In India the practice had been to throw on the judges the onus of what should be done in particular cases. He was aware that in England such a system would not be very palatable to the judges; and he was told that the Irish judges had protested in advance against any system of trial in which the responsibility should be thrown on the judges, and not on the jury. That responsibility should not be thrown on the Home Secretary, who was appointed to discharge other than judicial functions.\"\n\nAnd on 29th April, 1870, in a passage, a part of which was cited on Friday, Mr. Bruce, Home Secretary, said:\n\n\"For myself, I may say that in no single case have I ever overruled the decision of the judge without the fullest approbation on the part of the judge himself.\n\n\"Attempts are often made to induce me to remit the punishment in cases when evidence has been held back in order that it may afterwards be alleged that if the witnesses had been heard the result of the trial would have been very different. I pay no sort of attention to allegations of that description.\"\n\nBut the hon. gentleman who pressed with such vehemence the argument drawn from those statistics, forgot, I think, for the moment, that one reason why the Executive of Great Britain is called upon in so many cases to exercise the power of commutation, is that in that country there is no court of criminal appeal. When, therefore, there has been error committed in the course of a trial, error in point of fact, error in the finding on a point of fact, error in the charge of a judge, errors in the ruling at a trial, which the judge has not chosen to reserve, from a mistaken view of the law, there is no remedy but an appeal to the Home Secretary. If the verdict is against the weight of evidence, there is no appeal except to the Home Secretary. If the evidence can be shown to be erroneous, if new evidence can be discovered, it is the Home Secretary alone who can exercise the power of review. But there is no reason why the argument drawn from those statistics should apply with the entire force which the hon. gentleman gave to them, to the case in question, or to the cases coming up in the North-West Territory; because, as I said before, there is in that country what there is not in the Provinces, or in the older countries even, a court of criminal appeal, to which the prisoner can go to have every question of fact or law reviewed. As to the rule upon which Executive interference can take place in cases of insanity, and the rule in which the guilt of the prisoner is held to be diminished by the existence of delusions, I humbly beg to say that in my opinion the hon. gentleman was unsound in the rule which he laid down. It is quite true that in explaining the rule as laid down in MacNaughton's case, Judge Stephen goes so far as to say that the existence of delusions, even though they be not shown to cause irresponsibility, should be allowed to be given in evidence for the purpose of enabling the jury to find yes or nay upon the question whether responsibility existed or not. That is the utmost length to which he goes in stating the law, but in stating how it would be desirable to amend the law he takes a step further and proposes that the law should be so amended that the jurors should be instructed not only to find the prisoner guilty, if they find him to be responsible as far as sanity is concerned, but that they should then be asked whether the delusions under which he was laboring affected his capability of resistance. The hon. gentleman should not, however, press upon the House that suggestion of Mr. Justice Stephen, because it is a suggestion to amend the law, and until the law is amended an Executive surely cannot be charged with violating any principle in not acting upon it. But so far from laying down the principle that until the law is changed in that respect, that rule should be followed out by the Executive, Judge Stephen lays down a very different proposition, which I shall presently read. Even if that rule were in force, the matter was so put to the jury by the course which the evidence took, inasmuch as it was clearly proved that Riel's criminal acts were not the results of his delusions, but that he had abundant self-control over and above the force of those delusions to enable him to govern his own conduct, to carry out the campaign, to entice others into the rebellion and to guide his conduct in a very different way if he should receive a recompense for doing so. In view of the evidence then submitted, in view of the ground on which the Court of Appeal sustained that verdict, we can come to no other conclusion than if that rule which Justice Stephen thinks should be adopted, but has not yet been adopted, should be applied by the Executive, and it was our duty to enquire whether Riel was under such delusions as weakened his self-control, anyone must come to the conclusion, not only that he was responsible, but that he was capable of so controlling himself as to be beyond the reach of his delusions. If we come to that conclusion, the case of Louis Riel is not at all within the hon. gentleman's rule, the rule which he says ought to be followed by the Executive, but which is not recognised as a rule binding the Executive, and the Executive in the case of Louis Riel gave him the full benefit of all the evidence given in his favor, and were justified in coming to the conclusion not only that he was responsible, but that his delusions did not affect his criminality and that his self-control was not in any material degree affected by his delusions. But the hon. gentleman himself has supplied me with the strongest evidence on that point. Down to that period of the debate it had been urged by hon. members who had spoken on that side of the question that the jury must have come to the conclusion that Riel's self-control was lessened by his delusions or they would not have recommended him to mercy. But it now transpires out of the mouth of the hon. gentleman himself, and by a piece of testimony which he adduced for the purpose of attacking the Government on a very different question, that the jury entertained no doubt whatever on that subject, and that when they went to their room, every man of them voted not only that the prisoner was guilty of the charge in the indictment, but that he was perfectly sane. The hon. gentleman read that letter because at its close it stated that the jury made the recommendation to mercy on account of the mismanagement by the Government of the North-West. Very little weight can be attached to that, as there was not a tittle of evidence produced on that subject at the trial; and when the hon. member for West Durham admits it could not have legally been produced, no one will say on the other side of the House, that although it was not proved at the trial, they could act on public rumour, or a public impression which may have prevailed in that country that grievances existed. The man who wrote that letter was sufficiently intelligent, if we can judge by his...\"\ncomposition as read to this House, to know that he took an oath that he would try the case according to the evidence, and if he undertakes to state to the hon. gentleman, and through him to the House, that the recommendation of the jury was based upon an impression that the Government had been culpable and that the prisoner should on that ground receive the clemency of the Crown, I take the liberty of declining to believe the statement of a man who declares that he has so little regard for his oath. Stephen, who is regarded as such a high authority by the hon. member for West Durham (Mr. Blake), deals with this very subject of the treatment of persons under delusions:\n\n\"It undoubtedly is, and I think it is equally clear that it ought to be the law that the mere existence of an insane delusion which does not in fact influence particular parts of the conduct of the person affected by it has no effect upon their legal character.\"\n\nI have already addressed myself to the hon. gentleman's statistics and shown they were not applicable in this case and this country, because we had in the North-West a Court of Appeal for reviewing questions of fact, while in England they have only the Home Secretary for doing that work. But when the hon. gentleman pressed upon us the great weight of authority of Mr. Justice Stephen, for the purpose of convincing this House that a man subject to religious delusions or political delusions ought to be a subject for Executive clemency, it flashed upon my mind at once that there was a passage very near where the hon. gentleman was reading, but which is printed in a foot note and perhaps did not catch the hon. gentleman's eye. On page 160 he says:\n\n\"My own opinion, however, is that if a special diving order were given to a man to commit murder, I should certainly hang him for it unless I got a special divine order not to hang him. What the effect of getting such an order would be is a question difficult for any one to answer until he gets it.\"\n\nThere is another passage from the same author at page 176 which I shall quote. I use it to show that the doctrines which are laid down by this high authority, and most recent authority, are inconsistent with the doctrines which have been laid down in some works on medical jurisprudence and insanity, and that even some who hold the most advanced views with respect to humanity and philosophy in legislation are unwilling at this day to go the length which hon. gentlemen say we should be censured for not going:\n\n\"Dr. Maudsley's illustration does not come up to his principle, because he supposes the madman to act under a delusion which would weaken his power of self-control. Suppose a case in which there is no delusion at all, and the conclusion at once between the madman and the crime. For instance, there are two brothers, A. and B., A. is the owner of a large estate, B. is his heir-law. B. suffers from some insanity, and is under care at a private lunatic asylum where his disease is going off and there is every prospect that he will come to see him; and B., who knew of his intention to do so, and who apart from his madness is extremely wicked, contrives to poison him with every circumstance of premeditation and deliberation, managing artfully to throw the blame on another person who is hanged. B. completely recovers and inherits the estate. Why, when the truth comes to light, should not B. be hanged? His act, by the supposition, was in every respect sane one, though done under a delusion. The fact that he was mad ought to be allowed to be relevant to his guilt, and to be left to the jury as evidence as far as it goes in favor of a verdict of not guilty on the ground of insanity, or if such a verdict were permitted by law guilty, but the prisoner's power of self-control was weakened by insanity; but if the jury chose to find such a man guilty simply, I think they would be well warranted in doing so, and if they did I think he ought to be hanged.\"\n\nThe hon. gentleman says that the Executive should be turned out of office if they hang him and his authority says: \"If they did, I think he ought to be hanged.\"\n\n\"The case which I have suggested is of course so stated as to afford the strongest imaginable illustration of the principle which it illustrates, but in reality it does not go further than Dr. Maudsley's own statement that the inmates of lunatic asylums constitute victims of all kinds and degrees under the influence of the ordinary bad passions of human nature. If a lunatic was proved to have committed a rape and to have accomplished his purpose by an attempt to strangle, would there then be any cruelty in sentencing him to serve his time? Would the execution of such a sentence have no effect on other lunatics in the asylum? I assume of course a finding of the jury of guilty simply, after a direction that they might qualify their verdict if they thought that in fact the lunatic's power of self control was diminished by his disease and if evidence on the subject were submitted to them.\"\n\n\"It is to be recollected in connection with this subject that though madness is a disease, it is one which to a great extent and in many cases is the author of our misdeeds. In medical works the connection between insanity and every sort of repulsive vice is made so clear, that it seems not worth while to ask whether in many cases insanity is not rather a crime in itself than an excuse for the crimes which it causes. A man cannot help an accidental blow on the head; but he can avoid habitual indulgence in disgusting vices, and these are a common cause of madness than accidents. He cannot avoid the misfortune of being descended from insane or dissipated parents; but even if he has that misfortune, he ought to be aware of it, and take proper precautions against the effects which it may be expected to produce. We do not recognise the grossest ignorance, the most wretched condition, the most abominable involuntary association with criminals, as an excuse for crime; though in many a case—I think in a smaller proportion of cases than is generally supposed—they explain the fact that crimes are committed. This should lead to strictness in admitting insanity as being in doubtful cases any excuse at all for crime, or any reason for mitigating the punishment due to it.\"\n\nNow, I think the House will agree with me that, at any rate the hon. gentleman's own authority does not condemn us. As I said before, the very evidence which was allowed to go to the jury in this case was evidence of his delusions, the evidence that his self control might have been weakened by these delusions, and when the jury found against that they found against all, and they did find against that when they came to the conclusion to find a verdict of guilty, leaving out of question altogether the evidence produced by the hon. gentleman himself, who says they not only believed him to be guilty, but to be perfectly sane as well. A few words before I close with regard to what was pressed upon us with more force in the earlier stages of this debate than in its later stages, and that is the contention that the Executive were bound to exercise clemency because the jury recommended it. Now, it is true, as the hon. gentleman from West Durham stated, that the law of France gives to juries in that country the right to mitigate the sentence themselves, by pronouncing that the criminal is guilty, but that there are\nextenuating circumstances. The hon. gentleman, I think, will remember that it was developed in the investigation of the Royal Commission on Capital Punishment that some of the best writers on French jurisprudence have insisted that that right should be restricted so far as to compel the jury to find what the extenuating circumstances are, because the mercy which is involved in the verdict of extenuating circumstances is so liberally bestowed, that the force and authority of the law are impaired in that country. For these reasons it has always been recognized by those who have administered criminal law in England, that the authorities, the tribunals, the Executive, are not bound, even when a reason is assigned, by the recommendation to mercy. Lord Cranworth said in his testimony before that commission on the 29th of November, 1864:\n\n\"The jury now practically recommend to mercy on the ground of great provocation, or from whatever cause they may think proper to make that recommendation, which, of course, is always conveyed to the Crown, but it still rests with the Crown to act on it or not.\"\n\nNow, the hon. member for Rouville (Mr. Gigault) the other day made a citation from the English Hansard which impressed the House as being of great force, and which fell upon my ear as somewhat novel doctrine. He cited a passage from a speech of Sir William Harcourt to the effect that when there was a recommendation to mercy, the extreme penalty was never enforced. Now, for the satisfaction of that hon. gentleman I beg that he will refer to the context again, because he will see that the subject of discussion then was the propriety of changing the law with regard to murder, for the purpose of exempting from the extreme penalty those cases in which there is provocation, and it was in relation to those cases that Sir William Harcourt said that the jury had it in their power to extend clemency by recommending mercy, and that when they did recommend mercy the extreme penalty was never carried out—the hon. gentleman will find if he looks up the speech that it is only in relation to those cases of murder in which there has been provocation that any Home Secretary has ever laid down the rule that recommendation to mercy must be regarded by the Executive. Sir Wm. Harcourt, speaking of the attempt made before the commission of 1866 to distinguish between deliberate murders and those under provocation said:\n\n\"The Home Office did distinguish between the murders which were those which ought to be treated as murders with malice aforethought from those which, according to the commission, should be put in the second category.\"\n\nHow?\n\n\"The jury had power to recommend mercy in cases where there was provocation, and which did not, in the law of England, convert the crime into manslaughter. In the practice of the Home Office, where the jury recommended mercy the capital sentence was never executed.\"\n\nThese were the words the hon. gentleman relied on, but they were qualified by what went before:\n\n\"And in point of fact they had there the second category given effect to.\"\n\nAnd he shows that it meant that, and that only, when he goes on to say:\n\n\"There was the case of difficulty, however, where the jury recommended mercy, and the judge did not second the recommendation.\"\n\nThe hon. member read this passage, but he did not seem to see the force of it as qualifying what went before, and limiting its meaning:\n\n\"And in that case it remained for the Secretary of State to form his own judgment on the subject. He must form it on his own responsibility, and with all the assistance he might receive from the sources he had access to.\"\n\nSir George Grey, who had been Home Secretary three times in fifteen years, in his evidence before the commission, said, in reference to the recommendation to mercy:\n\n\"I have no means of knowing what passes in a jury-box, but that may possibly be in some cases (we can hardly account for it in any other way than upon that supposition), because there has been some difference of opinion among the jury, and unanimity has been obtained by a verdict of guilty, accompanied by a recommendation to mercy, where there were really no grounds for that recommendation. Judges frequently ask for the grounds of the recommendation, and the jury frequently give some, or some which have no bearing on the case. In those cases I think that that may account for the belief that there has been indisposition to find a verdict which would necessarily consign the prisoner to death. I have no doubt that there are numbers of cases in which the situation is similar to this country in which extenuating circumstances would have been found by juries in France, and to allow them to do so would lead to great uncertainty. If it was controlled by the discretion of the judge, it would really amount to nothing but what takes place now in a recommendation to mercy by the jury. If the judge is satisfied that the grounds of their recommendation are reasonable, he reports it to the Secretary of State and the sentence is generally commuted.\"\n\nBut the hon. member will find, if he cares to make sure, that recommendations are not necessarily acted upon. He will find, in the evidence given by Judge Hill and by Mr. Peggs, before the Royal Commission, in 1866, many cases in which juries made recommendation to mercy, which were not acted upon by the Executive. Now something was said to the House on Friday last, for the purpose of showing that another claim for Executive clemency might be put forward on the ground of the reprieves that took place in this case. The House has been put in possession of the facts which enable it to see why those reprieves were granted. In the first place, an appeal to Manitoba was being prosecuted; in the next place, an appeal to England was being prosecuted; and, in the third place, an application was made by the counsel for the prisoner for a medical examination. The time consumed by these appeals made...\nreprieves necessary; and the time consumed by the medical examination made another reprieve necessary; and if we have to arrive at the conclusion, in relation to capital offences in any part of this country, that because an appeal is being prosecuted, a reprieve becomes necessary, or because a medical examination is asked by the counsel for the defence, and a reprieve becomes necessary, therefore, we are not to execute the sentence of the law, then the administration of the law will be in the hands of the criminal and his own counsel; for they have merely to appeal and ask for a medical examination which no Executive would refuse, and there is an end of the capital penalty. If we exercised the right of reprieve on the ground that a grave error had been committed by the officers of the Crown in a prisoner's first trial, it would be unfair, perhaps, to refuse clemency; if the reprieve is made necessary by any act of the Executive itself, or by any mistake of its officers. In these cases it is considered not expedient to exact the extreme penalty, because it is supposed that the great lapse of time has lessened the deterrent effect of the punishment, and has weakened the effect of the sentence on the prisoner himself. But in this case no such result followed, and I think it is entirely in a different category as regards cases of reprieves. It has been said outside of the House, and repeated in this House, that the Executive, although they had a right to do what they did, although it was just and necessary to do what they did, acted under the dictation of a certain body of gentlemen holding peculiar views in this country. All I have to say, as a member of the Executive, is that if dictation was exercised in regard to that question it was never attempted upon me. It is true that some lodges and some individuals within that organization did express an opinion as to how our duty should be discharged. We cannot prevent any persons from holding and expressing freely opinions on questions of great public interest. In this country it is recognized that a larger latitude is allowed both to the press and to individuals than is allowed in England; and although it may be a misfortune that the fate of a man condemned, and appealing to the Executive, should be made a matter of public discussion, we can no more prevent such expressions of opinion by that organization than we can prevent the Globe, the Winnipeg Free Press, or any paper which represented their side of the question, from expressing their views in the same way. All I can say is, if that dictation existed and was attempted, it had not a feather's weight in the scale in determining what should be done in this case by the Executive. If any body of people in this country choose to demand that the Executive shall exercise justice, that is no reason why we should refuse to exercise justice. We were bound to do justice, no matter what the opinion or the clamours of any section of the country may be; and if the case was so clear that Orange lodges and the Toronto Globe and other papers clamoured for the execution of the law, unwise and to be deprecated as that may have been, it was no reason why we should not do our duty or arrive at our decision with that sense of responsibility which was required. With regard to what might have been done in this case, I would like to invite the reflection of the House for a moment as to what must have followed if Executive clemency had been exercised.\n\nOne section of hon. gentlemen opposite say this man ought to have been condemned to imprisonment as a criminal, a great criminal, although not so great as to be outside the Executive clemency; another class on that side say no, he was totally mad, and he simply should have been put into an asylum. Had either course been taken, how long would his confinement have lasted? If the Executive ought to have acted on the broad principle that this was only a political offence, and that therefore the Executive clemency should have been extended to it, it would have been inconsistent with that view that Riel should have been long detained in prison. If he were confined in a lunatic asylum, how long, I ask, with the power the evidence showed he had during the outbreak of controlling his own conduct and of getting possession of his senses when he wanted them—with the power of controlling his action and recovering his balance when he wanted it—how long would it have been deemed just by the humane sentiment of the country to keep him in confinement? He would have been set at liberty, under the report that he was cured and no longer mad, and he could have established a cure whenever he chose; and what then would have been the security for life and property in the North-West? I think that Louis Riel's next exclamation would have been, not that the rebellion of 1869-70 was not a patch upon that of 1885, but that both together would not be a patch on the rebellion he would raise the next time. I think that to have exercised the Executive clemency in a case like that, would have been in the words I have quoted from Mr. Justice Stephen, \"not benevolence, but cowardice.\" But let me ask attention to another point connected with this branch of the subject. Let me call attention to the fact that the Indians, who this man incited to rise, perpetrated some very cruel murders at Frog Lake, which called, in every sense of the word, loudly for the execution of the supreme penalty of the law against the Indians concerned in that massacre, not only because they committed great crimes, but on other grounds on which it is deemed proper to inflict capital punishment, namely, that it is absolutely necessary, by making a great example through the infliction of such punishment, to deter people disposed to crime from committing it. How could the perpetrators of the Frog Lake massacre have been punished, if the man who incited them to rebel—and the massacre was to them the natural result of rebellion—had escaped? How could the punishment of the law have been meted out to them, or any deterrent effect have been achieved; if \"the arch-conspirator,\" the \"arch-traitor\" if the \"trickster,\" as he has been called by men who did him their best service, was allowed to go free or kept in a lunatic asylum until he chose to get rid of his temporary delusions? It was absolutely necessary, as I have said, to show to those people, to those Indians, and to every section of the country, and to every class of the population there, that the power of the Government in the North-West was strong, not only to protect but to punish. In the administration of justice with regard to those territories in particular, it was absolutely necessary that the deterrent effect of capital punishment should be called into play. Remote as that territory is, strong as the necessity is for vigorous government there and for the enforcement of every branch of the law, I am not disposed to be\ninhumane or unmerciful in the enforcement of the penalties which the law pronounces; but in relation to men of this class, who, time and again, have been candidates for the extreme penalty of the law; who have despised mercy when it was given them before, I would give the answer to appeals for mercy which was given those who proposed to abolish capital punishment in France: \"Very well, but let the assassins begin.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001552.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 31, "total-input-tokens": 42904, "total-output-tokens": 43849, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4389, 1], [4389, 10760, 2], [10760, 17950, 3], [17950, 24787, 4], [24787, 32138, 5], [32138, 39580, 6], [39580, 46840, 7], [46840, 53041, 8], [53041, 60158, 9], [60158, 67402, 10], [67402, 74053, 11], [74053, 80779, 12], [80779, 87743, 13], [87743, 94936, 14], [94936, 101025, 15], [101025, 108279, 16], [108279, 114888, 17], [114888, 122004, 18], [122004, 128937, 19], [128937, 135786, 20], [135786, 142301, 21], [142301, 149480, 22], [149480, 156174, 23], [156174, 162928, 24], [162928, 168443, 25], [168443, 174940, 26], [174940, 182007, 27], [182007, 189450, 28], [189450, 195429, 29], [195429, 202392, 30], [202392, 202810, 31]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]