[{"id": "ff8535fe3f020c4681bee0e9ec350d61e1eb7a4d", "text": "Mr. ROYAL. When I moved the adjournment of the debate last night it was not my intention to answer the speech and the arguments of the hon. member for Bellechase (Mr. Amyot), nor is it my intention to answer them now. I propose to leave the hon. gentleman to the tender mercies of the Minister of Militia, his old friend, his admired friend, his quondam chief of the past. However, I cannot allow this occasion to pass without referring to certain facts the hon. gentleman who preceded me, stated yesterday, in the declaration read as made by Mr. Lemieux, to sustain certain accusations brought against the Government, of having refused to give him all the allowances he wished to have in the trial that took place at Regina, during last summer. That declaration was not taken before a commissioner for taking affidavits; it was devoid of all authenticity; and, moreover, it was signed by only one of the counsel who undertook the defence of the prisoner. In regard to that document, which has certainly not the same weight nor the same authenticity as a sworn declaration, I will read from the report which has been distributed, and which gives the proceedings that took place on the trial at Regina between the Queen and Riel. At page 9 there is an affidavit given by Mr. Lemieux in support of a motion asking for a certain delay in the proceedings.\n\"Canada, North-West Territories.} THE QUEEN vs. LOUIS RIEL.\n\n\"FRANCOIS XAVIER LEMIEUX, Barrister, one of the counsel of Louis Riel, the accused, being duly sworn, deposeth and says:\n\n\"That in the course of June, towards the end of the month, he was retained by persons interested on behalf of the accused to undertake his defense.\n\n\"That persons were instructed to cause to be brought to Regina, essential and necessary witnesses in the defense of Louis Riel, and believed to be such by the deponent.\n\n\"That the witnesses above referred to are Doctor Francois Roy, of Quebec, Doctor Clark, of Toronto, and Doctor Vallée, of Quebec.\n\n\"That the deponent verily believes that the said witnesses would have reached Regina by this time, but by reason of misapprehension and circumstances beyond control, the said witnesses have failed or have not been able to be present in order to give their evidence.\n\n\"That, from his experience as a counsel and advocate, he swears that the said Drs. Roy, Vallée and Clark are necessary, material and indispensable witnesses for the defense of the accused, and, moreover, are the sole witnesses capable of proving certain important facts relating to the said defense.\n\n\"That the deponent verily believes that if a delay of one month is granted he can procure the said witnesses by going himself to Quebec and Toronto, and that, at the expiration of the said delay, the above named witnesses will be present at the Court to give evidence in favor of the accused.\n\n\"And the deponent has signed.\n\n(Signed), \"F. X. LEMIEUX.\"\n\n\"Sworn before me, at Regina, this 21st day of July, 1886.\n\n\"(Signed), DIXIE WATSON, Clerk.\"\n\nThis affidavit is fortified by another one signed by Mr. O. Fitzpatrick, corroborating in the main the statements of his brother counsel. The only object I have in referring to this part of the speech made by the hon. member (Mr. Amyot) last night, is to show that, if the other statements and arguments adduced by him are as wanting in weight and authenticity, they all have little weight indeed, and I can only say that I feel sorry for him. When, during last Session, I had the honor to address you, Mr. Speaker, and this honorable House, on the subject of the administration of affairs in the North-West, I endeavored to give a brief history of the Metis population. I then attempted to show that a distinct nationality had been formed in the North-West Territories before Canada had ever thought of the existence of the population in that part of British North America. I showed also that those people had a title to the soil which had been granted and given to them by the Hudson Bay Company, their rulers, or by Lord Selkirk, who purchased the said territories from the Hudson Bay Company. Apart from the title they had to that soil, they, as descendants of the aborigines of that country, had as much right, or, at least, had a share in the right to the soil as the Indians of those...\nterritories. During the period that elapsed between the time when the existence of this distinct population was first noticed, and 1870, when Canada cut out of the North-West Territories the Province of Manitoba, I said—and I said it with a great deal of pleasure, because it was an unknown fact to most of my hearers—that this population was distinguished for its honesty, mild manners, patriotism, attachment to the soil, and a spirit of independence and proudness that were certainly to be envied by other people. No doubt, with those features they have retained some of the characteristics of their Indian relations. But I had only to recite facts to show that it was due to them that if Canada was able today to take possession of those vast tracts of country and open them to our civilisation as well as to the colonisation of Canadians and Europeans, it was owing to the bravery and courage of the Metis who kept the country from the Indians. When the formation of Manitoba took place those people had been accustomed, under a rude form of Government, it is true, but a paternal Government, to exercise political privileges, which, to our great surprise, contained the very elements of representative institutions. The council then existing was formed of representatives of the various portions of the population then existing on the shores of Red River and the Assiniboine. My object in referring today to what I stated last year is to show that those people had an undoubted right to be treated by the Canadian Government and by ourselves as a distinct nationality, in the same way as the Indian population had a right to expect to be thus treated by the Canadian Government. In 1870 those rights were acknowledged by the Canadian Government, and embraced in the Act known as the Manitoba Act. This Act was passed after a movement inaugurated by the population, headed by Louis Riel, and the acknowledgment of those rights excited the wonder of the people in this part of Canada. And if the unfortunate execution of Scott had not taken place, there was enough in the movement of the Metis, headed by Riel, in order to save their liberties and obtain their rights from the Canadian Government, to show that those people were worthy of the privileges and rights that the Canadian Parliament were granting them. I have named Louis Riel. I suppose it is not out of place for me to state that the Riel family is one of the most prominent among the half-breed population of the North-West. Riel himself has some Indian blood in his veins from his father, his mother being of French Canadian origin. Now, Sir, the high intellectual gifts, as well as a certain amount of exaltation, seem to be hereditary in the family; and, Sir, we have only to recall\nthe writings and speeches made now and then, and certain of the acts of that unfortunate man, to know how gifted he was intellectually. My French-speaking colleagues in this House have wondered more than once who could be the writer of those letters which were sent to the newspapers in Canada, and which bore the name \"Marguerite Riel.\" To us in the Province of Manitoba, it was no wonder this woman wrote those letters, and they were marked by elegance of language as well as purity of expression and sentiment. Now, Sir, in that family, devotion also seemed to be hereditary. In the winter of 1871, when the Canadian troops were in the barracks of Fort Garry, the hospital there contained some of the sick soldiers. The Sisters of Charity of St. Boniface had obtained from the military authorities the privilege of visiting those sick soldiers. One morning two nuns crossed to the hospital on the ice, and those two sisters were seen a few minutes afterwards going through the hospital from one bed to another, offering consolation to the soldiers, and otherwise kindly attending to them. One of them was the sister of Louis Riel. She was a Sister of Charity, and there was in her heart enough of devotion and Christianity—she herself being the sister of the doomed man—to go and offer her services to the sick soldiers who were sent to Fort Garry in 1870. Having said so much as to the population I have the honor of representing in this House, I will say that, most unfortunately, these people have been treated with a certain amount of neglect. In fact, Sir, if at this moment we remember how the Indians are treated, I believe I may say, with a certain amount of propriety, that the half-breeds have been treated worse than the Indians, although the Manitoba Act was, in the eyes of those people, a treaty to the same intent and purpose as the Indians look on their treaties with this Government. Now, Sir, when I state that they have been treated with neglect, I must add forsooth that they never were treated with more neglect than by the Administration which preceded this one. It is a fact in history that, to use the words uttered by the right hon. leader of the Government, there was a blank in the history of the Metis between 1873 and 1878. They were ignored; their nationality and their distinct rights were perfectly denied and set aside as having no right to exist. They were to be treated either as white men or as Indians. The object of what I have stated so far is to show that these men had certain rights by themselves, due to their origin and their condition of existence in those territories. The Manitoba Act only acknowledged the rights of the half-breeds who\nwere living in the Province of Manitoba. I believe it was the duty of the Government as soon as this was shown to them, to acknowledge the same rights with respect to the half-breeds who were living in the North-West Territories, as with respect to those of Manitoba, because they were of the same family and nationality, they came from the same source, and they were entitled to the same rights. So, Sir, during the years of the Administration of the hon. gentleman opposite—\n\nMr. LANDERKIN. How many rebellions had you in that period?\n\nMr. ROYAL. I shall answer the hon. gentleman in a few moments; but I will state now that the rebellion was caused by white settlers who certainly were not friendly to this Government.\n\nMr. LANDERKIN. Why didn't they hang them?\n\nMr. ROYAL. I can show the hon. gentleman that if the meaning of the word rebellion was taught among the Metis it was taught to them by the Globe, and I can show the hon. gentleman that if revolt against legitimate authority was ever inculcated in the North-West, it was through the Farmers' Union of Manitoba. In 1880 Sir John Macdonald took the first opportunity he had, in order to bring in a Bill in this House—he himself, the leader of the Conservative party, introduced a Bill in Parliament to extend the same privileges and rights to the half-breeds in the territories as those enjoyed under the Manitoba Act by the half-breeds in the Province of Manitoba. Now, Sir, by that we can ascertain in what party and on what side of the House there existed a feeling of friendship towards the half-breed population, and an acknowledgment of the justice of their cause. As I have stated, from many causes, some under the control of the Government and some beyond their control, the acknowledgment and settlement of the rights of the half-breeds were deferred for a certain number of years. However, I believe that the Government lost no time in extending the surveys as rapidly as they could. I think, also, that we can see whether there was any attempt made, on the part of the preceding Government, to make haste in order to do justice to that population. When the half-breed population, or a certain portion of them, saw that their rights were too tardily acknowledged they communicated with the Government, and at last they wanted to have from the United States a man whose name they thought would be a warning to the Government and\nwould certainly hurry up the settlement of their claims. Riel went into the settlements, I think, in the month of July, 1884. The agitation then commenced; it was an agitation limited within constitutional bounds; but the fact was disclosed during the trial at Regina, as well as by correspondence, that the agitators were chiefly white settlers, influenced whether by certain personal objects or certain political objects, it is difficult for me state. The half-breeds themselves, by their nature and their own happy simplicity, desired to confine the agitation within constitutional limits. They had everything to lose otherwise. Everybody knows what has been said and written about the Prince Albert settlements. Several flourishing parishes had sprung up there within a few years. The farmers were in a happy condition, and most of them having emigrated from the Province of Manitoba, had carried with them money which they had realised from the sale of their property. These people could understand perfectly well what was likely to take place if the standard of rebellion should be raised. But, unfortunately, some further delays took place which aggravated the public feeling in that quarter, and led to events the character of which is known by every hon. member in this House.\n\nNow, on the 4th of March, 1885, Father André received a telegram from the Government informing him that the question was settled, that the half-breeds were to receive their scrip, and that their patents should issue as soon as they should comply with certain regulations. Everybody feels that this should have been sufficient to stop all agitation, if it had not been that the white settlers poisoned the minds of the half-breeds by stating to them that there was no authority in a telegram—that a telegram could easily be fabricated—if an old chief factor of the Hudson Bay Company, a man of great reputation and standing in that part of the country, Lawrence Clark, had not very imprudently asserted to Father André and several others that he knew very well what would be the answer to the last petition that was sent to Ottawa, and that the Metis, instead of receiving scrip would receive bullets, and instead of receiving patents would receive 500 soldiers. Well, these things must not be attributed to half-breeds, but to white men whose mission seemed to excite rebellion, and who would gain by it, and who did their best to poison the minds of these people and to prevent them giving any credence to that telegram. The rebellion took place a few days afterwards. It is not for me to refer to the fearful events that took place during the six weeks that elapsed between the 24th of March and the 13th of May. I can only say that nothing justified\nthat rebellion, which was a crime against God and society. The chief of the rebellion, Louis Riel, gave himself up as a prisoner, and had to stand his trial at Regina. We know something of the trial that took place. Everybody will agree that it was conducted according to law; but owing to the prejudices of the Crown counsel or some of them, that amount of fairness that the Government, that the population in the territories, that we, had a right to expect from them, was not displayed.\n\nSome hon. MEMBERS. Hear, hear.\n\nMr. ROYAL. I will only cite an instance, and I may remind the hon. gentlemen who say \"hear, hear,\" that one of the counsel, Mr. Osler, was a friend of their own. There was a Catholic juror who presented himself. He was the only Catholic; and Mr. Osler challenged him. That want of fairness must not be attributed to the Government. Another incident which we must regret very much is the incident of Jackson, for which I throw the whole responsibility on the Crown prosecutors, who might have acted with more wisdom, more liberality and perhaps more justice and less discrimination. Now I come down to the 16th of November, the day on which the unfortunate man had to suffer the extreme penalty of the law. If I refer to it, it is to say that it was the signal of an agitation, of an outburst of sympathy that extended not only to all the Provinces of Canada, but also to the adjoining Republic and to Europe. Much has been said of the agitation which took place in the Province of Quebec, where I was born; and, Sir, I am not the one to fail to acknowledge very highly the proverbial generosity and chivalry with which the Province of Quebec, a minority herself, espouses the causes of suffering minorities in the other Provinces. French-speaking Canadians are a Latin race, and it is quite possible that to that ethnological feature may be attributed that exuberance of generosity for which we are distinguished, sometimes at our own expense. But I admire the spontaneous movement with which public opinion adopted the cause of a man who constituted himself the chief of a population, neglected perhaps, but certainly not tyrannised over, a population which has some of our blood and which has the same faith as we. I do not condemn the movement, because I believe it was only the exaggeration of a noble sentiment; and representing, as I have the honor to do, the French-speaking and Catholic population of the Province of Manitoba, I have often felt, and shall always recognise the great advantages I have derived from the generosity of my compatriots in this House. But I submit that the attempt which was made to make\nthis movement serve political purposes, without considering the fearful consequences that would thereby result to the interests of the minority, is deserving of severe censure. If that movement, as directed by some of its chiefs, had succeeded, the French-speaking population of today would stand perfectly isolated from the rest of the population in Canada, would lose its privileges forever, and thus lose the constitutional advantages given to it by 40 years at least of efforts and loyalty to its political friends. In this connection, I cannot express too highly the gratitude I feel at the conduct of the three French-speaking Ministers in the Cabinet who had patriotism, soul and heart enough to resist the onslaught of public opinion excited at the moment and calling on them to resign. When the ship is in danger, and the storm raging, it is not the time for the pilot to desert her.\n\nIn connection with this movement, which was nothing else but an exaggeration of a noble and chivalric feeling, a sentiment of humanity, I must say the minority should acknowledge the fair treatment which has been and is being extended to us by the majority of the population of Canada. It is true that we, the minority, have not always been able to obtain all we wanted; and in matters of opinion, we have had in many instances to submit to the rule of the majority; but who can say that the majority has not loyally admitted the minority to share with them the sum of the advantages which result from our constitutional liberties? In what country in the world will you find a French minority, will you find a Catholic minority, as free, untrammelled, and as respected as we are in Canada, although the majority has not with us, in common, either language, aspirations or national genius; and I am sure that our friends of the majority will agree with us, that justice, tolerance and respect for vested rights are the only basis of the greatness of a nation. It becomes the majority to respect the sentiments of the minority, and if this minority is very sensitive, you must not forget that its sensitiveness is due to the fact that it feels that it is a minority. The agitation that took place last fall, the threats uttered every day in some of the leading Ontario newspapers, caused, to the population in Manitoba and the North-West Territories, the most grievous anxiety. You must remember, Sir, that this population are living 1,500 miles from here, and they were alarmed lest the policy of a national coalition would prevail, and the rights, privileges, and even the existence of the minorities in Manitoba and the North-West Territories be attacked; we saw, on the other hand, that the agitation in Quebec was being worked to the advantage of party, and threatened to cause essential interests\nto be lost sight of entirely. The object of this apparently harmless motion is nothing else: it is but a pretext to make the condition of affairs worse. Its object is to draw us away from our allegiance to a certain platform, to certain principles, and to throw us into the arms of another party with which we have nothing in common. Should the motion of the hon. member from Montmagny (Mr. Landry) be carried, the consequence would be a change of Government, a change of principle, and an entire change of programme. Well, if you compare the programme of the party in power with that of the party in opposition in the past, if you can foretell the future by the experience of the past, I ask what should any man do who has at heart the interests of his country? We know there is a lack of sincerity on the part of the hon. members of the Opposition, which is not very astonishing, for we have found the same thing in every grave question that has arisen in our political atmosphere. We know that before the 16th November the Globe was all for execution, and we know what a wonderful turnabout was made after that fatal day. The Globe had not epithets enough to heap upon the heads of Cabinet Ministers for the execution of Riel. Riel, who, according to the fiery language of that paper, before the 16th November, was a high-handed and blood-thirsty rebel, had become nearly a lamb after the 16th November. It is a pity the same amount of sympathy exhibited after that date by hon. gentlemen opposite and their organs was not shown before that date. If it had, perhaps a different condition of affairs would exist. Now, however, as my words in that respect must be supported by some evidence, I will, with your permission, read a few extracts taken from the Globe before the 16th November and after the 16th November:\n\nOn July 6th the Globe said:\n\n\"Nothing can justify rebellion that does not become revolution.\"\n\nOn August 5th:\n\n\"There was certainly no legal justification—that there could not be. We have always contended that there was no moral justification, because the grievances must be very great indeed, nay, intolerable, that can morally justify the taking up of arms for their redress.\"\n\nOn the same day:\n\n\"No shadow of a doubt remained that he was guilty as charged in the indictment. The testimony that followed only deepened the certainty of his guilt.\"\n\nOn July 25th:\n\n\"It is now alleged on behalf of Riel that he never advised the half-breeds to resort to violence, that when he found the constitutional modes\nof seeking redress unavailing; he wished to leave the country and was prevented, and that at the last he did all in his power to dissuade the half-breeds from taking up arms. This is not believed; and indeed it seems inconsistent with much that has been stated upon authority apparently good.\"\n\nOn March 30th:\n\n\"While Superintendent Crozier and Riel were parleying, fire was opened with the rebels, and some of the civilians accompanying Crozier were actually shot in the wagons in which they travelled to the scene of the combat. Such an outrage as this will stir the blood of every man in the country.\"\n\nOn 15th July:\n\n\"Now his (Riel's) diary may suggest something like a cross ray from Bedlam in Riel's eye, such as genius or roguery may occasionally affect. But at the same time it must be added it gives not the slightest ground for suspecting absolute madness or for hinting that the writer's place is in a lunatic asylum. If there is madness going it is of a kind in which there is quite a large amount of method. If all who are mentally astray only as these jottings indicate that Riel is, were shut up in our asylums, we should have to increase the capacity of those establishments considerably.\"\n\nOn 22nd October:\n\n\"Nor as to his sanity has there been any doubt since the jury, having heard the experts' evidence, decided that Riel was responsible.\"\n\nOn 14th July:\n\n\"The public believe Riel and his associates guilty of the highest crime known to the law; and public indignation would be excited did any of them escape punishment.\"\n\nOn 3rd August:\n\n\"No shadow of a doubt remained that he was guilty, as charged in the indictment.\"\n\nOn 8th June:\n\n\"We want Riel and the other ringleaders brought to immediate justice.\"\n\nOn 25th May:\n\n\"They (the people) were never more in earnest, never more determined that justice shall be done, and that the doing of it shall not be unduly delayed. Calm, but stern and determined, they demand that justice be done.\"\n\nNow, Sir, what are the utterances of the same paper immediately, that is to say, a little time after the execution that took place on the 16th November. Certainly if these articles were not headed by the same title \"The Globe,\" you would think that they belonged to two different papers altogether. On the 5th February the Globe said:\n\"With those grievances in view; with that recommendation in view; with the fact in view that the agitation under Riel was perfectly constitutional for about eight months; in view of the almost accidental beginning of hostilities; in view of the doubts of Riel's sanity; in view of the rarity with which the death penalty is exacted by modern Governments from men technically guilty of treason; in view of the many humble petitions favoring commutation of his sentence to life imprisonment, there was a *prima facie* case of immense strength on behalf of clemency.\"\n\nSo much for the sincerity of the party, or at least of the paper which claims to be its organ, and which very recently my hon. friend across the floor has praised so highly as being the best, the leading, the most complete, the most intellectual newspaper on the continent of America. Now I have done. It remains for me to say that I shall vote for the amendment to have the previous question put, and that on the main motion I shall vote with the Government against the resolution which has been proposed.\n\nPrinted by MacLean, Roger & Co., Parliamentary Printers, Ottawa.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001537.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 15270, "total-output-tokens": 5888, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1352, 1], [1352, 4293, 2], [4293, 7047, 3], [7047, 9734, 4], [9734, 12135, 5], [12135, 14875, 6], [14875, 17520, 7], [17520, 20315, 8], [20315, 22841, 9], [22841, 25137, 10], [25137, 26275, 11]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]