[{"id": "0129367d98ae46c63fcd025da23f6c137882fa23", "text": "SPEECH\n\nOF\n\nMR. GIROUARD, M.P.\n\nON THE\n\nDISTURBANCE IN THE NORTH-WEST.\n\nOTTAWA, JULY 7TH, 1885.\n\nMr. GIROUARD. Some two or three months ago, at the beginning of the rising of the North-West, I felt it my duty to look into the facts which were alleged to have been the cause of the uprising. Like the hon. gentleman who has just taken his seat, and like every French Canadian, my sympathies were with the so-called rebels. I thought these rebels, the half-breeds of the North-West, had grievances, as the French Canadians had in 1837. Not being familiar with the facts, I had to make a special study of the political history of Manitoba and the North-West. I admit I was ignorant of the facts then. Like a great many others, I thought that my fellow countrymen of that far country were ill-used. But what has been the result of my study, and I have studied the question, not for the purpose of preparing a plea to defend the Government; I have done so as an independent member of the House.\n\nSome hon. MEMBERS. Hear, hear.\n\nMr. GIROUARD. Yes; I think there are very few members on the other side who have shown as much independence as I have in the past. I commenced that study for the sole purpose of getting information, as a representative of the people, who cares more for the sake of the country than for the sake of power, and I came to the conclusion that the half-breeds had grievances, undoubtedly, but not grievances of such magnitude as to warrant their resorting to arms. The whole speech of the hon. gentleman who has just sat down can be resumed in two points. He says, in the first place, the policy of the present Government was not to extinguish the Indian title in favor of the half-breeds, and in the second place, he charges this Government with being guilty of gross mismanagement in not dividing the river lots\naccording to the old custom which prevailed on the Red River. It seems to me very astonishing that, in order to find fault with the present Government, the hon. gentleman should be obliged to repudiate the policy of the Government of which he was a member. He tried ineffectually to show that the policy of the late Government was the reverse of what it really was. Its policy was, so far as the treatment of the half-breeds was concerned, not to give them a particle of the Indian title, but to treat them as white settlers. The leader of the Opposition had ample time to make a close examination of all the documents that have been produced, documents which he had, but which a great many other members had not, for this reason, that the moment the return containing these papers was laid on the Table, the papers disappeared without having even been endorsed in the Sessional Papers Office. I applied for them several times, but was unable to get them or any clue to where they were. I do not want to accuse any one; it was undoubtedly the right of the hon. gentleman to take possession of the papers, but I deny his right to exclusive possession. I had the right to see them. It was my good fortune, however, to peruse within the last twenty four hours a second copy, which was prepared for the Senate. I was greatly surprised when I heard the leader of the Opposition the other evening, after quoting document after document, after quoting the petition of the half-breeds of St. Albert and St. Laurent to the Government of the hon. member for East York (Mr. Mackenzie) in 1878—I was surprised, I say, that he quoted those petitions without quoting the replies, trying thereby to impress upon the House and upon the country that these were representations made to the present Government which had remained unanswered. I could hardly credit it. I had read enough of those papers to know that the quotations made by the leader of the Opposition were not complete. What is the answer which the hon. member for Bothwell (Mr. Mills), the Minister of Interior at that time, gave? And there is no man in this House, or out of it, who can be convinced that the answer of the hon. gentleman had some other bearing than upon the application for assistance for seed grain or agricultural implements; it is an expression of the Government's unwillingness to consider the demands of the half-breeds to the Indian title. What is the answer?\n\n\"The half-breeds, who have, in some respects, the advantage over new settlers in the Territories, should be impressed with the necessity of settling down in fixed localities and directing their energies to agricultural pursuits, in which case land would no doubt (not a sure thing it appears) be assigned to them in the same way as to the white settlers.\"\nI am willing to leave it to any independent man to tell me if this means the half-breeds shall have greater rights than the settlers, but this is not all. In order that no doubt should remain in the minds of the half-breeds, the hon. gentleman added: \"But beyond this they must not look to the Government for any special assistance in their farming operations.\" It is really surprising that, in order to obtain a party triumph, the speaker who has just taken his seat should be obliged to repudiate his party, but he has done more, he has been obliged to mis-state the policy of the present Government. He has made special mention of the speech of the Premier in March last, when he said that, according to his own opinion, the half-breeds were not entitled to more consideration than the white settlers, taking the same opinion as was expressed by the Minister of the Interior of the late Administration; but what the Premier did not say on that occasion he said last night, and his policy is there to say that, from 1870 to the present time, sacrificing his own opinion, he has taken the policy of his colleagues and has given to the half-breeds a right to what we call the Indian title. The policy of the Government in this respect was sanctioned in the Manitoba Act of 1870. Hon. gentlemen opposite who pretend that their adversaries are like the Bourbons, that they cannot learn anything, came to power in 1873, and were there for five years, and what have they learned? They even forgot the principle of treating these half-breeds which had been laid down by the present Administration and the present party; and, in 1879, in order to give encouragement to that class of the population of the North-West which had been so grossly ignored by the late Administration, the present Government laid down again its policy to give the half-breed the right to the Indian title in the soil. I think this is about a resume of the first part of the argument of the hon. member. Allow me to say one word en passant—I intend to refer to it more fully later on—in reference to the second portion of his plea, or his speech. He says: You have grossly ill-used these half-breeds in not giving them river lots at St. Laurent. Is the hon. member aware that these surveys were made by the late Administration? Is he aware of it? Are you aware that the surveys of the land on the Saskatchewan for the parish of St. Laurent were made in 1878, under the direction of the late Administration? I would like to have an answer.\n\nMr. MILLS. Mr. Speaker—\n\nMr. GIROUARD. If the last speaker will not answer, I will put the question to the hon. member for Bothwell (Mr. Mills).\nSome hon. MEMBERS. Order.\n\nMr. MILLS. Mr Speaker——\n\nSome hon. MEMBERS. Order.\n\nMr. MILLS. The reservation was surveyed out so as to exactly suit the river lot system, so as to grant lots 10 chains in width and 2 miles in depth, and I have the map here, and I can show the hon. gentleman that it has been since changed.\n\nMr. GIROUARD. I will ask the hon. gentleman to show it immediately. Show it.\n\nMr. MILLS. There it is.\n\nMr. GIROUARD. Do you pretend that this map shows that the surveys made in 1878 were re-surveyed? There is no such proof, and you cannot produce any.\n\nSir RICHARD CARTWRIGHT. Look at it again.\n\nMr. GIROUARD. You may look at it again. This map shows, as it showed at all times, that they took the rectangular system of survey at St. Laurent, more or less.\n\nSome hon. MEMBERS. Oh.\n\nMr. GIROUARD. Yes, I say more or less. I am referring to the surveys made in 1878. They were made at Prince Albert 10 chains by 2 miles, but as to St. Laurent, the surveys were 20 chains or more and 1 mile as they are today. These surveys have never been remade, and I am going to show immediately that these surveys were made in 1878 under the late Administration and not under the present Administration; and, if all the anathemas and maledictions of the last speaker ought to fall upon anybody, they ought to fall upon the late Administration. In the report of the Minister of the Interior for 1878, this reference is made to the surveys of the settlements of Prince Albert and St. Laurent, and, as the present Government came to office only in October, 1878, you cannot possibly imagine that these surveys were made under the direction of the present Government.\n\n\"Surveys of the settlements of Prince Albert and St. Laurent on the Saskatchewan, in the North-West Territories, were made; also a small survey involving the alteration of certain lines in the settlement belt in the Parish of Ste. Agathe, in Manitoba.\" (Sessional papers, 1879.)\n\nThere is another reference to the same survey made by Mr Lindsay Russell, in his report dated 31st December, 1878. It says:\n\n\"Owing to their remoteness, and the comparatively late date at which their survey was commenced, the full returns and reports for\nthem have not yet been received. They are all in the vicinity of Prince Albert settlement, and in the country included between the north and south branches of the Saskatchewan, near their junction. The survey of the river frontage lots in that settlement, and also of the similar lots for half the settlement of St. Laurent on the south branch, was effected.\"\n\nI think I have disposed of nearly the whole argument of the last speaker. But suppose, as the late Minister of the Interior said, that these surveys, although made as river lots in the beginning, had been resurveyed according to the rectangular system; suppose more than that, that these half-breeds had been treated purely and simply like white settlers, are we going to be told that these were grievances grave enough to justify an appeal to arms? Are you going to compare these grievances with the grievances of the French Canadians of 1837? Are you going to compare the present state of the French population in the North-West, where they number about 5,900 or 6,000 with the state of the French population in Lower Canada in 1837, when they were about half a million? Look at the grievances of the French Canadians in 1837, having a large majority in the Assembly, but being taxed by the Legislative Council and the Governor not responsible to the people. Is there any comparison between the two cases? There is nothing of the kind, and I repeat that, supposing the half-breeds had all the grievances which the hon. gentleman has mentioned—which they have not—they had no ground, no reason for a rebellion. If we were going to maintain the principle that the population under those circumstances would be justified in appealing to arms, I would like to know if the whole of this country would not have been justified in resorting to arms during the five years of the Administration of hon. gentlemen opposite from 1873 to 1878 not only a portion of the country, but from one end of it to the other. The last speaker says that the doings of the Mackenzie Administration had nothing to do with the question. Sir, that is not the way I intend to consider this question. I intend to examine the policy, the conduct, and the acts of the last Administration as well as of this one. What is the motion before the House? The motion is that the people have no confidence in the present Government, and they should give their confidence to the hon. gentlemen opposite; therefore I am bound to examine wherein the hon. gentlemen opposite would do better than this Government, and in order to ascertain that I must examine what they did when they were in power. In order to understand the bearings of this whole question it would be necessary to examine, first, the position of the country when the Canadian Government came in possession of it\nin 1869; in the second place to examine the treatment of the Indians who were to be found in large numbers in that territory; and, in the third place, to glance at the so-called grievances of the half-breeds. As soon as Confederation was formed the Canadian Government took the initiatory steps to secure that vast country lying west of Ontario then known as Rupert's Land and North-Western Territory. During the Session of 1867-68 an address to Her Majesty was voted by Parliament, asking that that vast territory should be added to the Dominion, and in the following year it was acquired for £300,000 from the Hudson Bay Company, the then proprietors, by the Canadian Government, acting through Sir George Cartier and the Hon. Wm. Macdougall. When moving that address before this House, Mr. Macdougall said:\n\n\"The great idea of the Confederation Act was, that we should form one people from east to west, a new nationality side by side, with the Republic, which was our only safe and true policy. All the relations between Great Britain and these colonies had been changed by the great war in the United States, and it was the opinion of the statesmen of the Mother Country, that we must reconstruct and in so doing, we must bear some burdens to provide an increase of population, with our own instincts, and to whom we could offer the rights and privileges enjoyed in the Mother Country. With this idea the Government had resolved to ask Great Britain to hand over to us the sovereignty of the North-West Territory.\"\n\nIn 1873 a large addition was made to this country by a concession from the Imperial Government of the balance of the British possessions in North America, and thus Canada became the largest country in the world, Russia and China alone excepted.\n\nMr. MACKENZIE. When did that event happen?\n\nMr. GIROUARD. This happened in 1873.\n\nMr. MACKENZIE. I think you had better consult your authorities.\n\nMr. GIROUARD. The territory was acquired in 1873.\n\nMr. MACKENZIE. But the hon. gentleman said the balance of the continent was acquired in 1873.\n\nMr. GIROUARD. That is the date, I think.\n\nMr. MACKENZIE. There is some mistake.\n\nMr. GIROUARD. I do not think it is material to the debate. My impression is that it was in 1873.\n\nMr. MACKENZIE. It was four years after.\n\nMr. GIROUARD. My impression is that it was in 1873; but as I say, it is not material to the debate whether this territory was acquired in 1873 or 1877; and really hon.\ngentlemen opposite must be very fond of interruptions to make one like this. Now, it will not be out of place, in order to understand what the Government has done for that territory to mention exactly its area. I do not refer to the changes which have been made by the last decision of the Privy Council on the boundary question; I do not think it will affect the result very much. I have here a table of the areas of the North-West Territories and the several Provinces of the Dominion, together with the areas of some of the nations of the world, showing the comparative extent of our own domain:\n\n| Square miles |\n|--------------|\n| Manitoba | 123,200 |\n| Territories— |\n| (1876) Keewatin | 450,000 |\n| \" Assiniboina | 95,000 |\n| \" Saskatchewan | 114,000 |\n| \" Alberta | 100,000 |\n| \" Athabasca | 122,000 |\n| Territories undivided | 1,784,252 |\n| **Total** | **2,665,252** |\n| Prince Edward Island | 2,133 |\n| Nova Scotia | 20,907 |\n| New Brunswick | 27,174 |\n| Quebec | 188,688 |\n| Ontario | 101,733 |\n| British Columbia | 341,305 |\n| **Total** | **681,940** |\n| Russia, ½ of terrestrial part of the world | 8,387,816 |\n| China, ¼ of land of globe | 4,419,150 |\n| Brazil | 3,275,328 |\n| United States | 3,095,245 |\n| British India | 868,244 |\n| Austria | 240,942 |\n| German Empire | 212,933 |\n| France | 204,177 |\n| United Kingdom | 120,832 |\n| Italy | 114,298 |\n\nTherefore the Territory which we acquired in 1869, with the addition which was made to it in 1873, or, if the hon. gentlemen opposite prefer, 1877, Canada contains one twenty-eighth of all the land in the world, and is fourteen times larger than France, and twenty-three times larger than the United Kingdom. This valuable country was very little known even at the time of its purchase by the Canadian Government. In fact Hon. Joseph Howe who had paid a flying visit to it during the winter of 1869 conceived such a poor opinion of its value that he returned determined to advise his colleagues to have nothing to do with it. Although it was visited for nearly 150 years by Montreal fur traders\nand Canadian voyageurs, no one but Catholic missionaries and the officials of the Hudson Bay Company had the slightest idea of its importance for agricultural purposes. The buffalo robes and furs collected by the North-West fur traders were always on hand in the markets of Montreal and London, but no one could have the slightest suspicion that the buffalo would so soon disappear before railways and civilisation. The population of the whole North-West then consisted of 1,000 white men, 33,000 or 34,000 Indians and a few settlements of half-breeds, numbering 12,000 or 13,000. There were no means of communication except the canoe, cart, trineaux, or snow shoes. There was only one steamer, the International, which plied between Lake Winnipeg and a town I believe called Georgetown in Minnesota. In 1869-70, Hon. William Macdonald took 14 days to travel from St. Paul to St. Vincent, a distance travelled today in less than eighteen hours. In 1871, Bishop Grandin took fifty-two days to proceed to St. Albert from St. Boniface, which, as hon. members know, is opposite Winnipeg. Mail service was almost unknown. There was a monthly mail service to the outside world; but as to inland service it was almost unknown. I need not say that the laws were very simple. Property could, of course, be transferred by deeds in writing, which were recorded in the office of the Hudson Bay Company, in just about the same way as transfers of property were recorded in the Province of Quebec in the office of the seigneur, but it could also be transformed by verbal agreements. There was no registry office. There was a court of justice at Fort Garry; but so far as courts of justice in remote districts were concerned, they were unknown. I need not talk of jails; there was no necessity for them. The whole of the district was governed in a paternal manner by a Governor and council, assisted by some sub-council as at remote points, and also by the officials of the company. Most of the trade consisted of exchanging the furs of the half-breeds and of the Indians for other commodities of life which were to be found in the stores of the Hudson Bay Company. In fact the Hudson Bay Company had a monopoly of the trade up to about 1858. In all the remote settlements or posts, it could hardly be said that there was any organised Government. Major Butler, speaking of the very district where the recent rebellion took place, wrote to Governor Archibald in 1871:\n\n\"The institutions of law and order, as understood in civilised communities, are wholly unknown in the regions of the Saskatchewan, inasmuch as the country is without any executive organisation, and destitute of any means to enforce the authority of the law.\"\n\nThis want of authority was also felt in the most central\npost, Fort Garry. About five weeks ago I was reading in one of the Manitoba papers that about 1858, Louis Riel, father of the present Louis Riel, went to the Court House, and there found the judge sitting. One of his countrymen had been arrested for having traded outside of the stores of the Hudson Bay Company,—and that was his crime. He went to the judge and told him: Your Honor, I am not willing that my brother should remain in jail (there was a jail at Fort Garry) forever; I give you till one o'clock to try him. The judge commenced the trial at once. At the hour fixed, the trial was not over. Riel advanced in court and said: May it please the court, I declare the prisoner acquitted. Vive la liberté. A very remarkable fact is this, that Louis Riel and his followers who set the prisoner at large were not molested for fear of more serious trouble ensuing. I give you, Mr. Speaker, this incident to show that even in the very central post of the Hudson Bay Company, Fort Garry, it was sometimes impossible to enforce the authority of the law. Such was the state of the country when the Canadian Government took possession of it in 1869. To save expense the intention appears to have been for a time at least to govern it as it had been governed for more than a century by a Governor and council. The hon. gentleman who has last spoken said that when we took possession in 1869 we considered the population of the country as a portion of the territory. Was it not to be governed as it had been for years and for almost a century before that time? That population had been governed by a Governor and council; and is it not worthy of admiration that instead of displaying any contempt for that government, Canada wished to continue the government and institutions which had prevailed in the Territory for almost centuries. As early as 1869 a temporary Act was passed, for the government of the North-West. It provided for the appointment of a Governor and a council not exceeding fifteen nor less than seven members to administer the affairs of the country, with such powers as might be from time to time conferred on them by the Governor in Council. It is not necessary to enter at length into the events that followed; but allow me to say, in answer to a remark which fell from the lips of the last speaker, that the rebellion of 1870, if you want to call it so, was very different from the present rebellion. In 1870 when the Canadian Government sent their surveyors and Mr. Macdonald, as the Canadian Governor, to take possession of the country, the transfer from the Hudson Bay Company to the Government had not even been signed. So the Canadian Government had at that time no title to the\ncountry. But it is very different in this case. Not only have we our title but we have been in possession for nearly 15 years, and therefore the two situations cannot be compared. Although it is not necessary to enter at any length into the events which caused the rebellion or the troubles of 1870, I would say that the Hon. Mr. Macdougall who was appointed Lieutenant Governor in 1869 proceeded to exercise the functions of his office, but was forcibly refused admission to the country. The population, and more especially the French half-breeds of Manitoba, were resisting the new state of things. A Provisional Government was formed, with Louis Riel as President, and only surrendered on condition of an amnesty, the recognition of certain land claims and the granting of responsible government. The portion of the Territory adjoining the Province of Ontario was constituted a Province by the name of Manitoba. Representation was given to the Province in the Senate and the House of Commons. A Legislature was created, consisting of a Legislative Assembly, and of a Legislative Council which has since been abolished. Clause 30 of the Act provides:\n\n\"All ungranted or waste lands in the Province shall be, from and after the date of the said transfer, vested in the Crown, and administered by the Government of Canada for the purposes of the Government of the Dominion, subject to, and except and so far as the same may be affected by, the conditions and stipulations contained in the agreement for the surrender of Rupert's Land by the Hudson Bay Company to Her Majesty.\"\n\nThen as to Indian titles, it was provided:\n\n\"And whereas, it is expedient towards the extinguishment of the Indian title to the lands in the Province, to appropriate a portion of such ungranted land, to the extent of 1,400,000 acres thereof, for the benefit of the families of the half-breed residents;\n\n\"It is hereby enacted, that under regulations to be from time to time made, by the Governor General in Council, the Lieutenant Governor shall select such lots or tracts in such parts of the Province as he may deem expedient, to the extent aforesaid, and divide the same among the children of the half-breed heads of families residing in the Province at the time of the said transfer to Canada, and the same shall be granted to the said children respectively, in such mode and on such conditions as to settlement and otherwise as the Governor General in Council may from time to time determine.\"\n\nThen there are clauses providing for the quieting of title, and section 35 is as follows:\n\n\"And with respect to such portion of Rupert's Land and the North-West Territory as is not included in the Province of Manitoba, it is hereby enacted that the Lieutenant Governor of the said Province shall be appointed by commission, under the great seal of Canada, to be Lieutenant Governor of the same under the name of the North-West Territories, and subject to the provisions of the Act in the next section mentioned.\"\n\nThat is the Act of 1869. The Manitoba Act also provided that both French and English should be the official languages be-\nfore the Legislature, and in the courts of justice. The principle of separate schools was freely recognised. The privilege of a mixed jury was granted as in the Province of Quebec. Provision was made for the extinction of the Indian title, and free grants of land were made to the half-breeds and their children, which in 1873 by the Land Act were extended to the old white settlers and their children. All these concessions were granted by the Manitoba Act of 1870, Vic. 33, cap. 3. Whatever may be the diversity of opinion as to the causes, pretexts or circumstances of these troubles of 1869-70, there cannot be any doubt that without the French half-breeds, Manitoba would not have been granted the liberties and privileges of popular government, and this important reform bears testimony to the intelligence and patriotism of the French half-breeds. This has been admitted by many eye witnesses of the events of these days, and quite recently by Mr. Alexander McArthur, of Winnipeg, an old official of the Hudson Bay Company, a prisoner of Riel, when lecturing before the Historical and Scientific Society of Winnipeg, on the 4th October, 1882, and in fact the language he used shows his impartiality in the matter. He says:\n\n\"While the leaders of the half-breeds brought ignominy on themselves by imbuing their hands in blood, it cannot be denied that they obtained rights and privileges for themselves and their fellow countrymen, which but for the stand they took would never have been granted, and the boons so secured they have the satisfaction of knowing were equally participated in by those nations and residents of the country, who not only took part in the rising, but were many of them opposed to it and disposed to aid the other side.\"\n\nThe Manitoba Act also provided for a temporary government in that portion of Rupert's Land, and North-Western Territory not included in the Province of Manitoba. It enacted that until the end of the Session of 1871, it was to be left to the management of the Lieutenant Governor of Manitoba with the aid of the council provided for by the Act of 1869. Considering the state of the country, its small population, this provisional Government was perhaps the only practicable one. Its services were fully acknowledged by the Minister of the Interior (Hon. Mr. Mills) in his report of 1876. He said:\n\n\"It is due to that council to record the fact that their legislation and valuable practical suggestions submitted to Your Excellency from time to time through their official head, Lieutenant Governor Morris, aided the Government not a little in the good work of laying the foundations of law and order in the North-West, in securing the good will of the Indian tribes, and in establishing the prestige of the Dominion Government throughout the vast territory.\"\n\nDuring the Sessions of 1871 and 1873 the appointment of a special Lieutenant Governor and Council for the North-\nWest was provided for, but notwithstanding this provision and others which were adopted in 1873, the affairs of the Territories continued to be administered from Winnipeg. By an Order in Council of the 12th February, 1873, the Council was authorised to make provision for the administration of justice in the Territories and generally to make and establish such ordinances (not to exceed the jurisdiction of any Provincial Legislature) as may be necessary for the peace, order and good government of the said North-West Territories subject to the approbation of the Governor in Council. The council was to meet at least every six months in Winnipeg, and except in special cases public notice by advertisement of such meeting was to be required for at least 40 days. An annual meeting was held on the first Monday in June in each year.\n\nI will now give the names of the members of the first Legislative Council. Hon. Alexander Morris was appointed Lieutenant Governor of the North-West Territories on the 2nd day of December, 1872, and on the 28th day of the same month the following gentlemen were appointed members of the Council: Hon. Chas. A. Girard, Hon. Donald A. Smith, Hon. Henry J. Clarke, Hon. Paschal Breland, Hon. Alfred Boyd, John Schultz, Joseph Dubuc, Andrew G. B. Bannatyne, Wm. Fraser, Robert Hamilton, Wm. J. Christie. On the 30th October, 1873, Messrs. James MacKay, a half-breed, and William N. Kennedy were appointed. On the 1st January, 1874, Mr. Christie resigned and John H. McLaird married to a half-breed, was nominated in his place and Messrs. William Tait, married to half-breed, and Robert Cunningham, were also added to the list of the councillors by hon. gentlemen opposite. One of the last ordinances of the North-West Council was the passing of \"An Act for the prevention of Prairie and Forest Fires in the North-West Territories,\" which in due time was transmitted to Ottawa for approbation with representation that it was of \"urgent importance\"; but up to 1876, when the papers connected with this measure were brought before the House, it had not been yet approved. The Conservative party in power soon after left office (1873). It was not, however, till two years after (1875) that the Administration of hon. gentlemen opposite thought of providing for the removal of the seat of Government of the North-West, and it took another year to put this Act into operation; so three years were required to accomplish this important reform, recommended as most necessary and urgent by the great organ of the Liberal party. The Toronto Globe, of the 25th February, 1876, said:\n\"Heretofore the North-West Territory east and west of Manitoba has been governed by the Lieutenant Governor of Manitoba and a species of half advisory, half legislative council of gentlemen chosen from among the residents in Winnipeg and its vicinity. They are themselves not slow to admit that their constitution is a farce, and it requires no effort of imagination in those even who have never been in the North-West to understand the impossibility of merchants and others in Winnipeg acting as a Legislature for the settlements on the Saskatchewan, and nearly a thousand miles away in the neighborhood of the Rocky Mountains. At one of the last sittings of this Winnipeg Council of which the former editor of the Nouveau Monde is a prominent member it was proposed to incorporate the clergy of the missionary dioceses of the North-West with land holding powers. The object of this was so apparent to those in Winnipeg who have seen the effect of the system there, that it was strenuously opposed by some of the English members, but in spite of their efforts it was carried, and would have come to Ottawa with such force as this nondescript council have been able to give to their legislation, had not Lieutenant Governor Morris refused to assent to the Bill.\"\n\nWe have several times in this Parliament incorporated ecclesiastical communities without objection from hon. gentlemen opposite, and have given them the right to hold real estate in the North-West; and this is the crime which is charged on the North-West Council, and which is put forth as the principal reason why it should be abolished. Under the new constitution the seat of the Government was removed to Fort Pelly, in the Territories. The council was composed of five members nominated by the Crown, including the two stipendiary magistrates, ex officio. The jurisdiction of the council extended over taxation for local and municipal purposes, property and civil rights, the administration of justice, including the organisation and maintenance of the courts of justice; education, with separate schools if desired by any minority; public health, licensing of inns, landmarks and boundaries, game and wild animals, and the care and protection thereof; roads and highways, the protection of timber, gaols, &c., and generally all matters of a merely local or private nature. Nearly all the powers of Local Legislatures of the old Provinces were thus given to this North-West Council; and to give a representative character to this body the Act provides that any district not exceeding an area of one thousand square miles is entitled to be erected into an electoral district, and to elect a member to the council for its first one thousand inhabitants of adult age, exclusive of aliens and Indians, and to two members for two thousand inhabitants. When the number of elected members shall reach twenty-one, the Act provides that the council shall become ipso facto the Legislative Assembly of the North-West Territories, having not only all the powers of the council, but also all the powers of a Legislative Assembly of the old Provinces, which the Governor in Council in Ottawa might\nconfer upon it. The French language was ignored in the Act, but this grave error was corrected two years after, in 1877. A jury of six was granted in criminal cases, but the grand jury and the mixed jury system which prevails in Quebec and Manitoba was refused. With the hon. gentlemen opposite lies, therefore, the responsibility of the position of Louis Riel, who, as matter of right, is not entitled to a trial by his peers. He is entitled to have only six jurors, and among these he is not entitled to have three of his own countrymen. In 1877 new powers were given to the North-West Council by Order in Council:\n\n\"And whereas, by the third section of the said Act, it is further enacted that 'the Lieutenant-Governor, by and with the advice of the Legislative Assembly, as the case may be, shall have such powers to make ordinances for the government of the North-West Territories as the Governor in Council may, from time to time, confer upon him: Provided always, that such powers shall not at any time be in excess of those conferred by the ninety-second section of The British North America Act, 1867,' upon the Legislatures of the several Provinces of the Dominion;\n\n\"Now, in pursuance of the powers by the said statute conferred, His Excellency, by and with the advice of the Privy Council, has been pleased further to order, and it is hereby ordered, that the Lieutenant-Governor in Council shall be and be hereby empowered to make ordinances in relation to the following subjects, that is to say:—\n\n\"1. The establishment and tenure of territorial offices, and the appointment and payment of territorial officers;\n\"2. The establishment, maintenance and management of prisons in and for the North-West Territories;\n\"3. The establishment of municipal institutions in the Territories, in accordance with the provisions of the 'North-West Territories Acts, 1875 and 1877';\n\"4. The issue of shop, auctioneer and other licenses, in order to the raising of a revenue for territorial or municipal purposes;\n\"5. The solemnisation of marriage in the Territories;\n\"6. The administration of justice, including the constitution, organisation and maintenance of territorial courts of civil jurisdiction;\n\"7. The imposition of punishment by fine, penalty or imprisonment for enforcing any territorial ordinance;\n\"8. Property and civil rights in the Territories, subject to any legislation by the Parliament of Canada upon these subjects, and—\n\"9. Generally on matters of a merely local or private nature in the Territories.\"\n\nI have heard it stated that hon. gentlemen opposite did nothing for the North-West during the time of their administration. I will not go so far; I am too much of an independent member to go that far. I will admit that the late Administration conferred upon the population of the North-West a constitution which is certainly worthy of admiration; but this is the only thing they did. That constitution is similar to the constitution of the old Provinces. To-day the Crown is represented in the North-West council very much in the same way as it is represented in this Parliament or in the Legislature of Quebec. There are two or\nthree Stipendiary Magistrates and other nominees of the Crown numbering six altogether; and at the same time that constitution provides that the people of that country, the moment there is a certain population spread over a certain extent of territory, have a right to send a representative there to deal with what matters? Upon the local taxation, upon the municipal taxation, upon the administration of justice, upon in fact all the matters which are conferred by the constitution of 1867 on the old Provinces, and that is why I am willing to give credit to the late Administration for having done something toward the settlement of the North-West. Later on, I will say, in answer to those settlers who want to have those Territories divided into different Provinces and enjoy all the expense and luxury of the legislatures of the old Province, that in the constitution of the North-West they have all the privileges and liberties of a free people, without having, at the same time, the burden of local legislatures. It is a pity, indeed, that the late Administration did not go further when they were considering the constitution of the country. They nominated to hold office in that Territory people who were strangers to the population. You cannot find even a stipendiary magistrate, you cannot find a nominee, from the Governor down, with the exception of Mr. Forget—a very good nomination—who was clerk of the council and private secretary to the Governor, to represent the people of that country, selected from the people of that country. I am not surprised at this, because, in the opinion of the hon. gentleman (Mr. Mills), the French half-breeds were like Indians; though, later on, on another policy, they were to be treated as white settlers, I am not surprised that the hon. gentleman, as Minister of the Interior, did not wish that the half-breeds should be represented in the North-West, because he considered half-breeds were like Indians; but why did he not take some of the new white settlers? Are you going to tell me you have provided a council of a representative character, without being able to find in the population of the place a single representative?\n\nMr. MILLS. We appointed a French half-breed, a member of the council.\n\nMr. GIROUARD. He was appointed in 1878; your council was appointed in 1876.\n\nMr. MILLS. The hon. gentleman is mistaken, because it was organised on my advice.\n\nMr. GIROUARD. I will give you the date of Mr. erland's nomination. He was in the old council which\nwas nominated in the constitution of 1869, and which remained in office until 1876, but you did not renominate him, or Mr. Royal, or Mr. Delorme, a half-breed.\n\nMr. MILLS. They were residents of Manitoba.\n\nMr. GIROUARD. Why did not you nominate Mr. Breland who is not resident of Manitoba?\n\nMr. MILLS. We did.\n\nMr. GIROUARD. Not at that time. I will give you the date later on. I say this treatment of the people of the North-West was the subject of a great deal of complaint. The French population expected some attention from the Government. The old settlements of Qu'Appelle and St. Albert were important centres; the English settlement at Battleford and Prince Albert had considerably increased; the surrounding rural districts had been taken up by white settlers, who also thought they were entitled to some consideration. Affairs in the North-West attracted the attention of public men, and during the Session of 1878 they were the subject of a very interesting debate. It will be interesting to hear what were the opinions of the hon. member for Bothwell then.\n\nMr. MILLS. The hon. gentleman went last week to New Brunswick to find a member for that council.\n\nMr. GIROUARD. One member only. But I am going to show you that you took all the members for that council from Ontario, and its Governor from Prince Edward Island. The Hon. Mr. Langevin, now Sir Hector, called attention to this point. The debate took place on the 8th May, 1878:\n\n\"Mr. LANGEVIN said he wished to call the attention of hon. gentlemen opposite to the action of the Government in the North-West Territories. When the organisation of government took place in Manitoba, the hon. gentlemen opposite found fault with the Government of the right hon. member for Kingston, for the manner in which that was organised. They accused the late Government of having acted without proper consideration of the wants of the Provinces, without having consulted its people, and of having sent up a ready-made government. The hon. the First Minister said, in his speech at Kingston, of the 27th June, speaking of the right hon. member for Kingston:\n\n\"He sent out Mr. Wm. Macdonald with a ready-made Cabinet to take possession, as if they had been the conquerors of the land, without asking the people what their opinions were as to the mode or nature of the authority under which they were to be placed.\"\n\nThis was the opinion of the hon. the First Minister, and also of the hon. the Minister of the Interior. Before going further, he would state he did not admit the justice of this criticism. The late Government did not send a ready-made Government to the North-West. They sent a Governor and two officers, who were, in connection with other gentlemen, taken from that region, and who had the confidence of the people to form a Cabinet. It was natural that the hon. gentleman, in order to make\na strong case before the electors of Ontario should have used the words already quoted; but, at all events, the hon. gentleman, after having found fault with the action of the late Government, should have done better. Let us see how the hon. gentleman and his Government acted towards that country. They appointed, as Lieutenant Governor, the Hon. Mr. Laird, one of their friends, who had been formerly Minister of the Interior, and had dealt with matters connected with the North-West, and whom they had a right, therefore, to send there. But whom did they select as members of the Executive Council of that Territory? Colonel Macleod was appointed at the head of the police and also Stipendiary Magistrate. Colonel Macleod did not possess the confidence of the people.\n\n\"Mr. MILLS. Who were they? Indians?\"\n\n\"Mr. LANGEVIN. Indians and half-breeds were people. He wondered would the hon. gentleman feel as he did, were he in Manitoba amongst those people. They were not to be despised although they were Indians. Mr. Mathew Ryan, lawyer from Montreal, was also appointed Stipendiary Magistrate, and was made also a member of the Executive Council; the next was Mr. Richardson. How were the officers selected for this territory? Mr. Scott, a gentleman from this part of the country, was appointed registrar; hon. Mr. St. John of Toronto was appointed sheriff; Mr. Dickson was sent there as an accountant and inspector; Captains McDonald was sent as Indian agent. This was the Government which had sent there, to use the language of the hon. the First Minister, \"a ready-made cabinet to take possession, as if they had been conquerors of the land.\" The people not very unnaturally, objected to being presented with this ready-made cabinet. The hon. gentleman could not say that in the Territories or in Manitoba, they could not find a few members of the people who could help in governing that country and who would have the confidence of the half-breeds. But what people had they to govern? Indians? There were Indians and a great many half-breeds and white men as well. These people had been cast aside. The Government said: We will send a ready made cabinet; we despise those people and will govern them as we choose. His Excellency the Governor General formed a very different opinion of these people, and he would refer the hon. the Premier and his colleagues to the remarks of His Excellency concerning these half-breeds. They were a sensitive, proud race, and should not have been deprived of their share in the government of the country. He remembered the time when his race was excluded from the government of the country, when none but people imported from the old country had a right to sit in the councils of the Province, and he could imagine the feelings of those half-breeds of the North-West when they saw that none but people from Ontario or Montreal or the Lower Provinces were to have office in their Government. These people had no representative in this House, and it was left to some one to see whether they should be left in that position, or whether they should have their share in the offices and in the Government in that Territory. A deputation of half-breeds had lately called on the Lieutenant Governor of the Province to claim representation in the councils of their country, and he hoped, since the attention of the Government had been called to this matter openly before Parliament, that they would recognise the justice of the claims.\n\n\"Mr. MILLS said the hon. gentleman had made somewhat extraordinary speech. The hon. gentleman might not have considered the effect which his speech would have on the minds of the people of the North-West.\"\n\nThey are very careful indeed to direct properly the mind of the people of the North-West.\n\n\"The circumstances were wholly different which govern the action of the late Government and of the present one. The country which Mr.\nLaird and the other gentlemen were sent to govern had very few inhabitants except Indians. But the right hon. member for Kingston sent his Government to a country in which there were several thousand white people, a people from whom rulers had already been chosen, and who had formerly a Council and Government of their own. What was the position in the North-West? Did the hon. gentlemen pretend to say that the half-breeds were an educated population, who appointed their chief the same as the Indians did, who followed the buffalo from place to place, and had no fixed habitation? That was the impression the hon. gentleman seemed to wish to create. Yet he must know, if he gave any attention to the condition of things in that country, that the half-breed population, with the single exception of the few who resided in the vicinity of Prince Albert, were, in no respect, different in their modes and conditions of life from the Indians.\"\n\nThe hon. gentleman interrupted me a moment ago to say that, at the time he constituted the North-West Council, he appointed a half-breed.\n\nMr. MILLS. Mr. Breland, and he is named in that speech.\n\nMr. GIROUARD. I say you did not; you appointed him in 1878.\n\nMr. MILLS. Yes.\n\nMr. GIROUARD. Then do not contradict me when I say you did not appoint any half-breed before 1878.\n\nMr. MILLS. That is what I said.\n\nMr. GIROUARD. I was going to give you the reason why you appointed one then.\n\nMr. MILLS. You said we did not appoint any.\n\nMr. GIROUARD. You did not in 1876, when you organised the council. It was constituted under Act of Parliament of 1875, but you waited one year before you would put that new constitution into operation, and yet, when you came to make the nominations to that council, not only was there not one half-breed in it or one in office under it, but there was not on it one single white-man living in that country; they were all taken from Ontario and even from around Ottawa here, like Mr. Scott, who was placed in the registry office there, and was a brother of one of the colleagues of the hon. gentleman. I have mentioned that there was a complaint. It was not only made in the House but also outside of it. Take the petition which was sent at the beginning of 1878, the petition of the half-breeds of St. Albert and also of the half-breeds of St. Laurent. One of their first grievances is that they have no representative in the institutions of their country.\n\n\"The humble petition of the undersigned French Canadians and half-breeds of St. Albert in the North-West Territories.—Information having\nbeen given to them that a petition had been signed by the half-breeds of St. Laurent on the 1st February last, they also respectfully show.\n\n\"That the population of the North-West Territories is mostly composed of French half-breeds without any stipendiary magistrate understanding or speaking their language.\"\n\nAnd later on, there was a public meeting of indignation against the ruling of stipendiary magistrate Richardson who refused to allow the attendance of French half-breeds who had come from long distances to attend the criminal courts, on the ground that they did not understand English and he did not understand French and that he would simplify the matter very easily by telling them to go back home. There was immediately an indignation meeting held, and the people complained: That is the kind of magistrates they give; they are not only taken from outside the country, but they are men who do not even understand the language of the majority of the people. The petitioners continue to allege:\n\n\"Without any stipendiary magistrate understanding their language, and without any person of their own origin to represent them in the deliberations of the council of the North-West Territories, it is therefore resolved that a humble petition be addressed to his Excellency the Governor General praying that the two members of the council remaining still to be appointed under the authority of the Act of 1875 and its amendments be selected from the old residents of French origin, and, in order to give full and entire justice to the nationality of your petitioners, that the nomination of a stipendiary magistrate equally of French origin be proceeded with.\"\n\nYou would perhaps imagine that the reason why these half-breeds were not represented in the council was because the number was complete. No, there were six members to be appointed—I am sure of five—and they could easily have appointed one or two French half-breeds; but no, they did not do it. What was the answer of the Minister of the Interior, of date the 18th March, 1878? It is addressed to the Governor of the North-West Territories, through whom the petition of the people of St. Laurent and St. Albert had been sent to Ottawa.\n\n\"You are requested to inform the petitioners that I shall have much pleasure in submitting their petition for the consideration of His Excellency the Governor General in Council.\n\n\"In the meantime you may intimate to the petitioners that should it be thought desirable to appoint additional members to the council of the North West, I shall be prepared to recommend to His Excellency's consideration their application that such members should be selected from the old residents in the Territories and that if possible one of them should be of French Canadian origin.\"\n\nNow, Mr. Speaker, as I have said, the late Administration did nothing with the exception of creating this new constitution for the North-West, and appointing this half-breed in 1878; they did nothing to give to the population of the North-West any representation or any part in the government of\nthat country, either legislative or judiciary. Other important matters came to their attention, but they had a very simple policy—they told the half-breeds that they were to be considered as white settlers. I will not refer again to that statement made by the Minister of the Interior. It is made in such clear language that no ambiguity is possible. The principle is laid down that the half-breeds must be treated like white settlers, and so they have been treated. Nothing was done towards the extinguishment of the Indian title; and if hon. gentlemen opposite are so anxious of benefiting from the experience of past Administrations, why did they not take the principle of the Administration which left office in 1873? Why did they not say to the half-breeds of the North West: You shall be treated in the same way as the half-breeds of Manitoba? When they constituted their council in 1875 was the proper time, rather than in 1879, to declare what their policy was to be with reference to the half-breeds. When they sent their Governor up to the North-West and made four new treaties with the Indians, they ought to have laid down their policy in regard to the treatment of the half-breeds. But nothing was done concerning the half-breed claims and the Indian title; nothing was done concerning the surveys which affected not only the half-breeds but the white population as well. My hon. friend from Quebec East stated that he did not think that any complaints came from the half-breeds of the North-West previous to 1877 or 1878. Perhaps he was like myself, and did not have occasion to look over all the papers which were brought down four or five weeks ago, and which were inaccessible to certain members of the House—at least to myself. But I will call his attention to the resolutions, which were in effect petitions, of the half-breeds, not only of Qu'Appelle but of the whole North-West, dated the 5th May, 1873 and which were transmitted on the 5th June following by Governor Morris. All the half-breeds of the North-West joined in that petition, their votes having been taken at a council as was then customary; and they say:\n\n\"We also ask of you, the Lieutenant Governor, to give us lands in compensation of our rights.\"\n\nThey received an answer from Governor Morris to the effect that their request would be transmitted to the Government. But the Government then in office left to make room for the hon. gentlemen opposite, and up to the present time there has been no answer given to that petition.\n\nMr. MILLS. Hear, hear.\nMr. GIROUARD. I mean up to 1878—when they left office. On the 1st of October, 1874, I find a letter from Father Decorby to the Honorable Mr. Laird on the same subject; in this he says:\n\n\"As the Government has entrusted the conduct of the affairs of the North-West to you, I take the liberty of addressing you a few explanations concerning Lake Qu'Appelle and the half-breed population settled there. The spirit of justice which animates you and the desire you have shown to contribute to the welfare of those whose interests have been confided to you, lead me to hope that you will kindly take them into consideration and bring them to the attention of the Government in order that it may treat the half-breeds of Lake Qu'Appelle with justice and generosity, according to the kind words of His Excellency, our Governor, Alexander Morris. I may remark at once that the half-breeds have a right to some privileges in this place. It was they who made a kind of conquest of it by obliging the Indian nations who formerly warred here to keep the peace. It is they who still keep them off, and it is to their presence that is due the honor of peace and the security which is enjoyed all around.\n\n\"I cannot state the exact period when the half-breeds began to winter at the Lake Qu'Appelle, but having explained to his Lordship the Bishop of St. Boniface, the wish to have a Catholic priest among them, my Lord Taché, now Archbishop of St. Boniface, went there himself in 1865 and chose the present site of the mission, gave orders for the erection of a chapel, and took for the requirements of the mission all the points comprised between the two streams called the Mission Streams, that is to say, of the extent of about a mile in front. The half-breeds then established there promised to respect the land reserved by His Lordship.\n\n\"Now, the half-breeds desire and ask the Government to leave their lands as they took them, that is, that they will not force them to exact lines.\"\n\nNow take the petitions of the half-breeds of St. Laurent and St. Albert, transmitted by Mr. Laird on the 13th February, 1878, to which reference has so often been made:\n\n\"It is of immediate necessity that the Government cause to be surveyed within the shortest possible delay those lands occupied and cultivated by the half-breeds or former residents upon those lands.\n\n\"That the sudden change from a prairie life to an agricultural life brought about by the rapid disappearance of the buffalo and the hunting regulations of the council of the North West Territories have reduced your petitioners to a state of want and obliges them to address the Federal Government in order to obtain assistance in seed, grain and in agricultural implements. The same as has been given to certain foreign immigrants in the Province of Manitoba. The implements of agriculture always extremely rare are sold at so high a price that your petitioners are unable to purchase them.\"\n\nGovernor Laird accompanied the transmission of the two petitions with a recommendation or a report, which was sent on 13th February, 1878, as follows:\n\n\"It is important that the land policy of the Government towards old settlers and others living for many years in the Territories should be declared. It appears to me that they have a claim to some more speedy means of acquiring a title for settlement purposes than the homestead provisions of the Dominion Lands Act.\n\n\"To prevent disputes between neighbors, it is highly desirable that the survey of lands settled upon along the principal rivers should be prosecuted with all convenient speed.\"\n\"With respect to the prayer for assistance in procuring seeds and implements to commence farming operations, it is similar to the request made to me by the half-breeds of Bow River during the Blackfeet treaty negotiations, and which I forwarded to you and commended to the favorable consideration to the Government.\"\n\nIt seems to me, therefore, that the hon. member for Quebec East (Mr. Laurier) was in error when he made the statement that very few petitions had reached the late Administration prior to 1878. We find that almost at the last moment, before the Conservative Government left office, in the fall of 1873, the first complaint came in. Of course the Administration had not time to do it justice. We find from 1874, and subsequently, repeated representations were made to the late Administration, and they took five years to consider them, and did not even then declare a policy. The hon. member for Quebec East (Mr. Laurier) complains that the present Administration has done nothing. We shall see what they have done. In the first place, they passed the statute of 1879. The following powers were given to the Governor in Council.\n\n\"To satisfy any claims existing in connection with the extinguishment of the Indian title preferred by half-breeds resident in the North-West Territories, outside of the limits of Manitoba, on the 15th day of July, 1870, by granting land to such persons to such extent and on such terms and conditions as may be deemed expedient;\n\n\"To investigate and adjust claims preferred to Dominion lands situate outside of the Province of Manitoba, alleged to have been taken up and settled on previous to 15th July, 1870, and to grant to persons satisfactorily establishing undisturbed occupation of any such lands, prior to and being by themselves or their servants, tenants or agents, or those through whom they claim in actual, peaceable possession thereof, at the said date, so much land in connection with and in satisfaction of such claims as may be considered fair and reasonable.\"\n\nEvidently the Government acted upon the recommendation of Governor Laird. Governor Laird, in his despatch accompanying the petition of the half-breeds of St. Laurent recommended the Government to adopt some policy. They did not do so. But, immediately on the present Government obtaining power, they adopted a policy, which was to recommend the claim of the half-breeds to the Indian title. It will be remembered also, that the half-breeds complained that they did not have a magistrate who spoke and understood French. In the fall of 1872, Mr Rouleau, stipendiary magistrate residing at Aylmer, Province of Quebec, was appointed stipendiary magistrate for the district of Saskatchewan, where the French Canadian and French half-breed population was mainly to be found, and this officer became a member of the council, making two French members altogether, Mr. Breland and Mr. Rouleau, out of six appointed by the Government. About the same time, the construction of the Canadian Pacific had opened\nnew fields to immigration. Towns and villages were erected along its line from Brandon westward. A large number of people flew into the towns and rural districts, and form today a white population of about 40,000 or 50,000, some say 100,000 or more, who became entitled to representation in the council. Electoral districts have been constituted under the Act of 1875, and have been represented in the council, where they are today in majority over the nominees of the Crown. Eight districts have representation in the new council: Edmonton, Broadview, Qu'Appelle, Regina, Moose Jaw, Lorne, Calgary and Moose Mountain, and with the three stipendiary magistrates, and these nominated by the Government, form 14 members. This fact induced the Edmonton Bulletin, of the 30th January, 1885, to say:\n\n\"Every paper in the North-West gave a kick to the Council, but it is the fault of the people, who elect the majority of them.\"\n\nOne of the first duties of the Government under the terms of the Manitoba Act of 1870, was to extinguish the Indian title to the Territory of the North-West. The policy of the country has been to do this by a treaty, whereby the Indians cede their rights to the land in consideration of a certain indemnity which the Government agrees to pay to them. The Indians under treaty in Manitoba and the North-West represent a population of 33,959. The treaties are seven in number, and contain about the same agreements and stipulations:\n\n| Date               | Treaty No. | Description                                      | Population |\n|--------------------|------------|--------------------------------------------------|------------|\n| 3rd August, 1871   | 1          | Chippewas and Crees, Treaty No. 1                | 3,395      |\n| 21st \"             |            |                                                  | 895        |\n| 3rd October, 1873  | 3          | Sauteux                                          | 2,605      |\n| 16th September, 1874| 4          | and Crees (Qu'Appelle) Treaty No. 4              | 7,079      |\n| 20th \"             |            |                                                  | 5,315      |\n| 23rd August, 1876  | 6          | Plain and Wood Crees (Fort Carlton and Pitt)     | 8,157      |\n| 22nd May, 1877     | 7          | Blackfeet, Treaty No. 7                          | 8,673      |\n\nAs an example, let us look at Treaty No. 7. It contains a cession from the Indians to the Crown of territory which is described, and \"all their rights, titles and privileges whatsoever to the lands\" of said Territory. The Indians reserve to themselves the right of hunting throughout the tract surrendered, subject to such regulations as the Government of the country may make from time to time, and saving such tracts of land as may be required or taken up from time to time for settlement, mining, trading or other purposes, by the Government of Canada or by any citizen duly authorised therefor by said Government. The treaty provides for a reserve of land, which is also described, and is sufficiently large to allow one square mile for each family of\nfive. In settlement of past claims the treaty provides for the payment of a sum of $12 to each man, woman and child. The price of the Indian title payable to the Indians at suitable places and dates, and annually to each chief $25, each minor chief or councillor $15, and to every Indian, of whatever age, $5. A sum of $2,000 is to be expended every year in the purchase of ammunition or some other purpose, as the Indians and Government may determine. Every head chief, minor chief, chief and councillor, is entitled every three years to a suitable suit of clothing. Each head and minor chief is to receive, for the use of their bands, once for all, ten axes, five handsaws, five angers, one grindstone and the necessary files and whetstones. Every family of five persons and under is to receive the following cattle for raising stock, two cows; family of more than five and less than ten persons, three cows; family over ten persons, four cows; every head and minor chief, for his band, one bull. If any band desire to cultivate the soil as well as raise stock, each family of such band shall receive one cow less; and in lieu thereof, when settled on their reserves and prepared to break up the soil, two hoes, one spade, one scythe, and two hay forks; and for every three families, one plough and one harrow; and for each band, enough potatoes, barley, oats and wheat to place other land actually broken up. All the said articles to be given once for all for the encouragement of the practice of agriculture among the Indians. Each head chief and minor chief and Stony chief is to receive a Winchester rifle. And finally, the Indians undertake to conduct and behave themselves as good and loyal subjects of Her Majesty. These are the stipulations generally inserted in treaties with Indians. Treat No. 7, however, signed in 1877 with the Blackfeet, is the only one which provides for the supply of Winchester rifles, a provision greatly to be regretted, introduced by hon. gentlemen opposite, which did its work of destruction among our troops during the recent battles. Treaty No. 6 and other treaties with the Plain and Woods Crees contains the undertaking, on the part of the Government, to grant, during the three years after two or more of the reserves shall be set apart to the Indians, a sum of one thousand dollars yearly, to be employed in the purchase of provisions for the use of the Indians as are actually engaged in cultivating the soil, and to assist them in such cultivation. A medicine chest is also to be kept by the Indian agent for the use of the Indians, the necessity of which is fully demonstrated by the report of the Mounted Police for 1884. It will be conceded that these Indian treaties are most liberal, and they do not comprise the numerous presents which had to be made as preliminaries before even\ntalking of the terms of the treaties. *Le Metis*, of the 24th July, 1872, speaking of one of the treaties with the Sauteux, says:\n\n\"Mr. Simpson, at Fort Francis, spent $4,000 or $5,000 in presents to the Sauteux, who, before even speaking of treaty, had already laid down most exorbitant pretentions.\n\nOn rapporte que s'ils n'ont pas demandé chacun un carrosse, c'est uniquement parce qu'ils n'en ont pas encore l'idée.\"\n\nNotwithstanding the liberality of the treaties towards the Indians, experience soon proved that they were insufficient. For some years it was supposed that it would be at least 25 years before the decrease of the buffalo would be seriously felt. It was then to be seen nearly over the whole North-West Territory. A correspondent of the *New York Sun*, writing from Mile's city, Montana, on the 24th of April 1885, says: \"In 1815 the buffalo ranges extended as far east as Illinois, Minnesota and Iowa; in short, the Mississippi River marked the eastern boundary of their grazing grounds. On the west the main Rocky Mountain ridge was the limit of their pastures; and between these two natural boundaries the buffalo roamed over the vast plains of the west, migrating with the seasons north and south, from the shores of the Arctic to the Gulf of Mexico. They were at the mercy of various Indian tribes, but the Indians were merciful. From this one animal the red men drew the main necessaries of life. The hides furnished clothing, beds and lodge coverings. The horns were used as ornaments, and also furnished various kitchen utensils. The flesh was their staple food, and their sinews became arrow cords. The Indians used the animal but did not abuse it. The herds in those days south of the present international boundary line strictly in the United States must have contained not less than 5,000,000 animals. In what is now Manitoba, Assiniboia, Alberta and Saskatchewan, there must have been fully 5,000,000 more, as the Hudson Bay trappers who came south to trade with the Snake, Shoshone and Mode Indians always reported vast herds of bison in the neighborhood of Great Slave and Great Bear Lakes. The buffalo were all right, until about seven years ago, when the Indians were conquered, which opened up the country and let the hide hunters in. It took almost seven years, beginning with 1870, to exterminate the buffalo along the line of the Northern Pacific Railway, which, in the good old times, could have been seen blackening the Platte River bottom for miles. These poor silly beasts were so easily killed, and from their abundance, offered so rich a reward to the hide hunter, that every idle fellow in that part of the country could make good wages by butcher-\ning them. The Union Pacific railroad split the herds in half, and left a moiety to the north and a moiety to the south. Those in Texas were soon used up by sportsmen and professional hunters; but the great northern herd fled to Wyoming and Montana, where Sitting Bull and his followers took charge of and protected them, until Uncle Sam's soldiers began chasing him around the country, as well as the bison. From 1875 to 1880 fully 1,000,000 of these brutes were killed by soldiers and other white men. I heard of one enterprising pot-hunter on the Yellowstone who actually had a Gatling gun to help the slaughter along. He employed no less than thirty skinners to tear the hides from the poor animals as soon as they dropped, and each skinner received $1 for every hide he brought in at night. The skinned carcases, as well as numberless unskinned, were left to rot where they fell. In short, the manipulator of the artillery kept ahead of his employés and provided them with more than they could attend to.\" As early as 1875 a missionary wrote to Le Métis, on the 15th September, from the Saskatchewan district:\n\n\"Il est vraiment inquiétant de voir les buffalos diminuer à vue d'œil! Encore quelques années et le gouvernement aura sur les bras ces différentes tribus du Nord-Ouest, qui lui demanderont de quoi les empêcher de mourir de faim.\"\n\nThe slaughter of the buffalo was so great that the Indians and half-breeds became alarmed. They could not understand the inaction on the part of the Government. If we are to believe the Globe, the Mail and the Free Press of Winnipeg, a Provisional Government which these papers called a republic, was proclaimed at St. Laurent, in 1875, with Gabriel Dumont as president, for the avowed purpose of protecting the buffalo, and obtaining a large tract of land for hunting purposes. Major General Smith and Col. French were sent with 55 Mounted Police to subdue the rebels, who, on learning of the arrival of the force, sent two emissaries to Fort Carlton to offer their surrender on condition of being pardoned, and they were pardoned. A correspondent of the Globe, of July, 1876, says during the winter of 1876 about 120,000 of these animals were killed. Mr. Schultz directed the attention of the Government to this important question during the Session of 1876.\" I believe that if the late Administration had made the slightest effort to protect the buffalo the recent troubles would never have happened. During the years 1874, 1875 and 1876 representations were made to them on all hands that the buffalo would soon disappear unless some protective measures were adopted by the Government; but nothing was done. If we have to feed the Indians for\ngenerations it will be because no action was taken by the late Government to preserve, for the Indians and half-breeds, who were living something like them, the buffalo, their main means of support. On the 20th of March, 1876, Mr. Schultz said:\n\n\"Among the papers which he hoped to have brought down by this motion would be found valuable suggestions as to the preservation of the buffalo. He (Mr. Schultz) would urge the importance of this matter upon the Government. So long as the buffalo were numerous there was little danger of difficulty with the plain tribes of Indians, with whom we were now being brought into contact. When these were extinct we must expect to deal with a race of paupers, rendered dangerous by want of food.\" The Rev. Father Lascombe, a high authority on all such matters, believes, in common with many others, that if the present rate of destruction goes on the race of buffalo will be extinct in 10 years. It is true that since the completion of the Union Pacific Railroad and the establishment of military and other settlements in the Missouri, Father Lescombe estimates the number killed yearly during the winter at 80,000, and about the same number in summer. Their present feeding ground comprises a length of, say, about 600 miles by about 150, and is bounded on the west by the Rocky Mountains, on the east by the Qu'Appelle Lakes, on the south by the Missouri, and on the north by the north branch of the Saskatchewan; and this limit is ever decreasing, by the destruction caused by the hunters of the Saskatchewan on the north, those from the Missouri on the south, and the red River Hunters on the east, to an extent and rapidity so alarming that it is estimated by the Reverend Father and others that in 10 years they will be extinct. Such a result is not at all improbable, since it is only a few years since the buffalo ranged east of the Red River, and since the last of the wood buffalo, an animal of the same species, but of larger size, which ranged between the Saskatchewan and the Slave Lakes, was killed, and the whole of the race is extinct.\n\nThe use of the revolving pistol and the repeating rifle, instead of the ordinary loading gun, has helped to bring this about, aided by the destruction caused by wolves, sickness, accidents of various sorts and the wasteful destruction of the buffalo pound. Unfortunately, too, it is the robe of the female Buffalo which is the most valuable, and when killed for it she is always with calf. It is her flesh which makes the best meat, and being more easily hunted down than the bulls, it has caused a destruction which has resulted in many of the bands met with last summer being composed of a proportion of six or seven males to one female. The district where buffalo are found has narrowed with startling rapidity during the last 10 years, buffalo having about that time been seen by him (Mr. Schultz) east of Red River. These facts point strongly to the necessity of preventive measures, and the facts spoken of are so well known to the Indians and half-breeds that they are anxious the Government should take action in the matter, if it were not for the fact that it would be impossible to prevent the killing of cows. At the same time there would be no objection to the killing of buffalo bulls at any season of the year; but since this is impossible, a stringent law is demanded, which will practically leave these animals undisturbed from the 1st November to 1st May, and an enactment to prevent the killing of calves at any season. If such a law were passed it is believed that in five years the buffalo would have so increased that these restrictions might be removed. He (Mr. Schultz) hoped that this matter would receive the consideration at the hands of the Government which its importance demanded, and that the papers bearing on this matter would be printed for the general information they would afford.\"\n\n\"Hon. Mr. Mackenzie said the matter to which the hon. member had particularly alluded—the preservation of the buffalo in the western...\"\nprairies—had occupied a large share of the attention of the Government for a considerable time.\"\n\nNothing more; nothing whatever was done to protect this most important food of the Indians.\n\nMr. MILLS. Yes, there was.\n\nMr. GIROUARD. I am coming to that. True, the council of the North-West, at its first session, 1877, passed an ordinance for the protection of the buffalo; but for reasons which do not appear, was repealed the next session. Perhaps it did conflict with treaty obligations with Indians. The measure was, however, too important to be left to the local council. It was a question of death or life for the large number of Indians which were under the special care of the Dominion, and should have been dealt with by the Dominion Government. It is greatly to be regretted that the Administration of hon. gentlemen opposite did not adopt the protective measures which had been suggested to the Government by Father Lacombe and other experienced residents. The Premier of the Administration of those days admitted, in March, 1876, that the matter occupied a large share of the attention of his Government for a considerable time, but nothing was done. Again, during the Session of 1877, this important matter was brought before the House and discussed at considerable length. New revelations were made and the policy of the Government announced. Mr Schultz addressed the House on the subject. I will not repeat every speech made, but merely quote a few extracts:\n\n\"Several years ago, in speaking of the condition of the Indians of the North-West, he (Mr. Schultz) had pointed out the results likely to be occasioned by the entire destruction of the buffalo. The animal was invaluable to the Indians, because its flesh was his food, the hide his house and clothing, while the sale of its robe furnished him with all that he needed of European manufacture. Without this source of supply the Indian would become a pauper, and, by an easy transition, a marauder. To avert these results, it was obvious that the buffalo must be protected, at least, till a time arrived when the Indians who now inhabited these hunting grounds could be weaned from the chase and taught to depend wholly or in part upon agriculture. From one of the Government sources of information he was glad to see their attention directed towards this matter, and hon. gentlemen would find, in page 34 of the Minister of the Interior's report, the following statement of Mr. Dickinson, of that Department.\n\n\"The subject which at present takes precedence of all others in connection with the Indian question in the North-West Territories is the preservation of the buffalo. The rapid decrease in the numbers of the buffalo has become a matter of alarm to the Indians, who see that, unless steps are speedily taken to arrest it, their future condition will be one of extreme hardship. That the buffalo are decreasing in number in a rapidly increasing ratio is a fact admitted on all sides.\n\n\"I am aware that this question has already received some consideration on the part of the Government, and that representations have been made by parties better informed than I claim to be, as to the necessity of some action in regard to it. For this reason, I will not enter into the matter as fully as I would otherwise have done.\"\n\"While at the Qu'Appelle Lake the Cree chiefs, accompanied by their principle head men, waited upon me, and represented that they were becoming alarmed, on account of their means of subsistence failing, and begged me to report what they said to the Government, and to convey their request that something should be done to prevent the entire extermination of the buffalo. To show the importance they attached to this question, I may remark that each chief and his head men separately made the same request. In all my previous intercourse with the Indians I have never seen this course adopted. In discussing other matters, a spokesman is generally chosen, who speaks for all; the others merely signify their assent; but in this case it was evident they considered something more was necessary, and adopted this method to impress the gravity of their position upon me. In my opinion, the buffalo must be protected, or in a few years, not more than ten at the furthest, the whole number of Indians in the North-West, who now rely upon these animals for subsistence, will require to be fed and maintained principally at the expense of the Dominion Government. I can see no other alternative, as it is an impossibility to teach them in a short time to forsake their present mode of life and adopt that of civilised men. The subject is one which demands and should receive the early consideration of the Government, for the peace and consequent prosperity of the North-West Territories depend in a great measure upon it. Should the buffalo become exterminated, it is not to be expected that the starving Indians will refrain from helping themselves to the supplies to be found in the stores of the Hudson's Bay Company and other traders; compelled by hunger, outrages might be committed by them which would result in an Indian war. These are the views of every one who is well informed regarding the state of the country, and while I admit that the Indians at present are peaceable, well disposed, and have every confidence in the Government, I think there can be no doubt that they are correct.\"\n\nThese were the warnings made in 1876 by one of the officials of the late Administration. Let us see what has been their policy on receiving such strong remonstrances.\n\nMr. MILLS. Since 1879.\n\nMr. GIROUARD. I will let you know very soon. This report of Mr. Dickinson was made in 1876 and published in the Sessional Papers of 1877, and quoted by Mr. Schultz during the debate of 1877. Other hon. gentlemen spoke on the subject. Let us see what Mr. Donald Smith said:\n\n\"The Hon. Donald A. Smith (Selkirk) said he was happy to be able to concur entirely with the hon. member for Lisgar (Mr. Schultz). It was very necessary that some steps should be taken to prevent the entire destruction of the buffalo in the North-West. This was a matter in which there might be reciprocity with the United States. We should give them the same measure which they gave us. They did not permit any except American citizens to go to their territories and trade and hunt, and even their own citizens were forced to get licenses. The slaughter and disappearance of the buffalo was owing in a large measure to the inducements held out to American traders. A large number of the robes went to the other side, and, while the Canadian trader lost profit so far as this was concerned, the buffalo were also rapidly decreasing, or rather, gradually but surely being killed out. He hoped that the Government would be able to devise some means to exclude, to some extent, the ingress of American traders, and also, as far as possible, to give protection to the buffalo.\"\n\nIt being six o'clock, the Speaker left the Chair.\nAfter Recess.\n\nMr. GIROUARD. When we rose at six o'clock. I was referring to the discussion which took place in the House of Commons in 1876 and in 1877, concerning the sudden disappearance of the buffalo. I also referred to the report of Mr. Dickinson, an officer of the late Administration, upon the subject, where he said that the most important question affecting the Indians was the preservation of the buffalo. I quoted the opinion of Mr. Schultz and of Mr. Smith. I will now continue to read extracts of the continuation of that debate. Mr. Mills, on behalf of the Government, rose and said:\n\n\"This subject had received the serious consideration of the Government. So far as he has been able to look into the matter, he was of the opinion that it had better be dealt with by the Government of the North-West, rather than by the Parliament here. From the information in the possession of the Government, there could be no doubt that the buffalo were rapidly diminishing, and this diminution had sensibly increased since American traders had come across. Ever since the settlement of Manitoba, also, the buffalo had retreated farther and farther to the west. The half-breeds, in their pursuits, had invaded the country of the Blackfeet and Blood Indians, and much complaint had arisen therefrom. The Government had some information which they could supply, such as a report by the North-West council and a communication from one or two missionaries. He saw one of the missionaries a short time ago, and obtained from him all the information possible. He had come to the conclusion that it would be a very formidable undertaking. The missionary spoke of said it would be necessary to induce the Indians to obey the law, as at present they had not sufficient respect for each other to observe any regulation. The result was, that those who would be disposed to refrain from destroying the buffalo were prevented from acting upon such a principle by the fact that others would not act in the same way. His informant's opinion further was, that it would be necessary to get the Indians to abandon the plains and live along the borders of some of the lakes for a period of four or five years. They could subsist by fishing and agriculture during that time, although the Government would also be obliged to contribute very considerably to their support. The Local Government of the North-West could probably devise a cheaper and better plan than this Parliament, it being on the spot and more familiar with the matter.\"\n\n\"Mr. Trow (I believe now the whip of the Opposition) said buffalo were very prolific, and if a law were passed to protect them for a few years, he had no doubt that they would soon increase. Although he frequently saw the bones of the buffalo bleaching in the sun in Manitoba, not a live buffalo could be seen, until four or five hundred miles west was reached. The buffalo must be protected, or else it would soon become extinct.\n\n\"Mr. Schultz (in reply to Mr. Mills) said: Father Lacombe suggested that no Buffalo should be killed from 1st November to 1st May in each year, and no calf at any time—this restriction to continue for five years. But the full-grown animal might be killed all the summer; hence the fear of his hon. friend, that the Government would have to support the Indians during the five years of enforcement of a preservation law, would be without foundation. The statement made by the hon. the Minister of the Interior, on the same point, he must criticise somewhat. The hon. the Minister seemed to fear that if a protective statute were enacted great expense would be caused to the Government in supplying the Indians with the means of subsistence during the interval.\"\nbetween 1st November and 1st May, when they were not allowed to kill the buffalo. Now he (Mr. Schultz) believed that no such great expense would be caused. Much of the food in the shape of dried meat and pemmican used by the Indians in the winter was made by them in the summer months, and if it was once understood that no buffalo were to be killed during the winter months, the Indians would lay in an extra supply of the dried meat, and the expenditure by the Government of a few thousand dollars for twine for nets would be all the aid the Indians would require. On the score of expense, he must take issue on other grounds as well with the Minister of the Interior. Every hon. gentleman who has spoken seemed impressed with the belief that we were likely to have difficulty with the Indians if the buffalo supply speedily cut off. Now, the history of Indian difficulties in the United States taught us that, under any circumstances, it was far cheaper to feed the Indians than to fight them. He had every confidence in the good intentions of his hon. friend the Minister of the Interior, but as the Government of the North-West was an appointed one, and not responsible in any way to the people of that region, it would be necessary for the Government here, as they were responsible for the actions of the North-West Government, to see that important measures, like the one under consideration, receive prompt attention.\n\n\"Mr. Mills said that the hon. gentleman had misapprehended what he had stated. He had not said that it was necessary to prevent the Indians from destroying the buffalo for several years in succession, but for the period of each year extending from November to May. This was the statement made to him by Father Lacombe. He believed that the hon. gentleman was himself a member of the North-West council, and it had had power to deal with this question, but he was not aware that anything had been done.\n\n\"Mr. Schultz said that the hon. Minister had evidently not lately read the correspondence of the late North-West Council, for if he had he would find, among the papers which he hoped to have brought down by this motion, that the old North-West council had brought up the matter in the strongest form possible, and urged the necessity for a protective law of this kind.\"\n\nSo we have the policy expressed by the late Government, that they would do nothing to preserve the buffalo. At this time, in 1877, they did not say that the matter will continue to receive an important share of the consideration of the Government. They express that their policy is to do nothing; and when they left office, in 1878, the buffalo was almost—I might say altogether—extinct. It was too late for the present Administration to do anything to preserve it. The buffalo was destroyed for want of protection, and for this blunder of the late Administration, the country is forced to-day to feed, and not only to feed, but to fight the Indians, and will likely be obliged to do so until the grown-up generations are gone. At the time the present Administration came into power, the preservation of the buffalo was out of question. The Indian problem was how to take care of the Indians, irrespective of treaties, and how to civilise them.\n\nLe Métis said:\n\n\"Le Canada a une grosse difficulté à résoudre, celle des sauvages du Nord-Ouest. Ces pauvres gens meurent de faim. Le gouvernement fait tout ce qu'il peut pour soulager leur misère actuelle, mais il semble en oublier la cause!\"\nThe Métis then states that the principal cause of the destitution of the Indian is their nomadic life, and asked the Government to settle them down somewhere. Immediately upon coming to power, the right hon. Premier of this Government announces its Indian policy for the future. In his report, dated 10th April, 1879, he says:\n\n\"The rapid disappearance of the buffalo, which is the staple article of food of the Indians and half-breeds of the North-West Territories, induces the belief that these people must, in a few years, be fed at the expense of the country, unless they, in the meantime, acquire some other means of subsistence than the buffalo hunt now affords. In order to enable them to become self-supporting as soon as possible, facilities must be provided by which they may acquire some practical knowledge of agriculture and of the care of stock.\n\n\"They will probably require some small supply of provisions each year while they are engaged in tilling and sowing their lands. Such assistance, however, should only be extended to those Indians who prove to be in earnest in endeavoring to become self-subsisting.\n\n\"The bands in the vicinity of the Rocky Mountains appear to prefer stock raising to agriculture, and they will be encouraged to become owners of herds of cattle.\"\n\nOn the 13th of the same month, 1880, Father Hugonard, speaking of the distress prevailing among the Indians and half-breeds in the North-West, gives this advice to the half-breeds of Manitoba, who had left their settled Province for the prairie life:\n\n\"Pauvres gens de Manitoba qui cherchez à vendre vos terres pour aller reprendre la vie de chasse et de traité, réfléchissez donc un peu au tort que vous préparez à vos familles. Ne comptez plus sur les chances de vivre dans les prairies de l'ouest. Les sauvages eux-mêmes n'y trouveront pas de quoi subsister, et s'ils veulent éviter la mort, ils seront obligés sous peu de se livrer à l'agriculture. Tandis que vous possédez de riches terres, gardez-les avec soin et n'allez pas les vendre au premier venu.\"\n\nIn the Speech from the Throne for the Session of 1880 the situation of the Indians is thus referred to:\n\n\"In consequence of the entire failure in the food supply of the Indians in the North-West, a large expenditure has been necessarily incurred to save them from starvation. It is hoped that the efforts which are now being made to settle the several bands on the reserves and to induce them to betake themselves to the cultivation of the soil may prevent the necessity of similar calls for relief in the future.\"\n\nOn the contrary, the distress, instead of decreasing, has been ever since increasing. Le Métis, of the 10th April, 1878, says:\n\n\"The news from Battleford is to the effect that the greatest dissatisfaction prevails among the Indians.\"\n\nIn 1881 the Marquis of Lorne visited the North-West, and thus referred to the Indians in the Speech from the Throne, in the Session of 1882:\n\n\"During my journey I was met by numerous Indian tribes, all expressing confidence in the continuance of the traditional policy of\nkindness and justice which has hitherto marked the relations between the Government and the aborigines.\n\n\"I regret, however, that the necessity of supplementing the food supply to the Indians still exists, and is likely to continue for some years.\"\n\nReferring to the year 1884, the Minister of the Interior, in his report, dated 1st January, 1885, says:\n\n\"Upon being advised of this fact, I directed that measures should be taken to prevent consequent suffering among the Indians. Supplementary contracts have accordingly been made with inhabitants of the Territories for the supply of additional quantities of flour, as they may be required at the various points. I also authorised the purchase of an additional quantity of ammunition and twine, in order that the Indians might be able to supply themselves and families with fish and game during the winter.\"\n\nMr. Speaker, it will be necessary to feed the Indians, not only for a year, but until the present grown up generations are gone. It can hardly be expected that a man who has been brought up in hunting and war can immediately settle down to the civilised life of agriculture. We will have to feed him, or he will steal and fight for his life. Our only hope is with the children. Monseigneur Grandin said, in 1878:\n\n\"On ne parviendra jamais à civiliser les sauvages suffisamment pour en faire de bons citoyens, qu'en les prenant tout petits enfants.\"\n\nThe present Government acted upon this recommendation. The first Government aid towards schools was made by hon. gentlemen opposite, in 1876, but it amounted only to $2,000. In 1877 only three schools were receiving Government aid, St. Albert, Lac la Biche and White Fish Lake. In 1878 ten Indian schools were in operation in Manitoba and four in the North-West. Mr. McCaul, Indian Superintendent for Manitoba, says, in his report, dated Winnipeg, 31st December, 1878:\n\n\"There are comparatively few Government schools in operation in this superintendency, and I regret to say that the majority of them are of a very inferior grade, on account of the incompetency of many of the teachers in charge. In numerous instances, where no schools have been established, the chiefs and councillors expressed the desire that their children might be educated, and requested me to ask the Government not only to send them teachers, but also to build them school houses. I attribute the low standard of the schools to the small amount allowed by the Government for the salary of teachers in each reserve; for only the most inefficient ones can be obtained at such a consideration. I would, therefore, beg leave to suggest that a larger allowance be granted for that purpose, and that only efficient teachers be engaged.\"\n\nAs to the yet \"unorganised superintendency\" of the North-West, as Hon. Mr. Laird was pleased to call it, in his report of the 5th December, 1878, speaking of the schools, he says:\n\"Only a few schools in this superintendency as yet received aid from the Government. All of these are mission schools. The schools connected with the Roman Catholic mission at St. Albert, Lac la Biche and Isle à la Crosse reserve receive aid for the Indian children instructed there. I have not been able to visit any of these institutions, but I hear them highly spoken of. The Church of England mission school at Touchwood Hills, near Chief Gordon's reserve, also received aid, and an application has been made on behalf of a similar school at Assissippi, on Ahtahacoope's reserve, near Carlton, and of one at Eagle Hills reserve, near Battleford, which I trust will receive favorable consideration. The Canadian Methodists have also some good Indian schools, but if they are now in receipt of Government aid it is not forwarded through this office.\"\n\nI may say, however, that it is was not without due representation coming from very high authorities in the North-West, if the late Administration paid so little attention to teaching the Indians. Amongst the papers which came into my hands only yesterday, I find a letter from His Lordship the Bishop of St. Albert, Monseigneur Grandin, to Lieutenant Governor Laird, dated 5th April, 1875. I will not quote the whole letter, but only extracts of it. His Lordship, in the course of his remarks, says:\n\n\"BISHOPRIC, ST. ALBERT,\n\"5th April, 1875.\n\n\"Sir,—You will perhaps be surprised, that without having the advantage of knowing you, or of being known by you, I venture to address Your Honor personally.\n\n\"I would not have ventured on this boldness if the worthy Colonel Jarvis had not apprised me of your indulgence, and your great desire to render any service.\n\n\"Assured of your goodness, I will write to you at length, hoping you will have the patience to read and take into consideration what I shall tell you.\n\n\"The little news we receive from Manitoba had made us suppose that the Government at Ottawa was a good deal occupied about our country. However, until the arrival of the troops, we had not received the slightest mark of interest from that Government.\n\n\"Permit me, Sir, to tell you frankly that it appears to me, while encouraging emigration into the North-West Territories, the Government should consider the benefit of the present inhabitants of the North-West. Apart from the sending of the soldiers nothing has been done, at least, of which we are aware, and this single benefit is far from being known and appreciated by all.\n\n\"But they will say, 'the Métis are good for nothing—a people idle and without economy.'\n\n\"If they were a hundredfold worse, if you will, those who have such advantages over them should not forget that the Métis are generally descended from the servants of the Hudson Bay Company; that these servants, almost exclusively engaged in voyaging, did nothing, or nearly nothing, during their long winters, and could not consequently give their children a liking for work—not seeing its utility. Who was there to teach them notions of order and economy? The mothers had not the faintest idea. Besides, receiving each day the food necessary for the whole family, what was the good of managing? 'The company profits, and the company is rich,' says a proverb well-known in the country.\n\n\"If they left the service the buffaloes, then very numerous, supplied them with abundance of food with little labor. The surplus of provi-\nsions and the furs and skins, also very abundant, procured them the necessary clothing.\n\n\"But they do not even manage their money. How can they? Many of them never saw money, and have not the least idea of its value. Why deprive themselves of anything during the year? The only advantage they will acquire will be to learn, on the return of the courier (postman), that the books of York Factory contain many Louis to their credit.\n\n\"Others who have spent all their wages in fine clothes for themselves and their families have a pile of pleasant and useful little things. In this they behold a fortune. Money nor an account book is of any consideration.\n\n\"I ask Your Honor's pardon for such details; but I do not consider them altogether useless.\n\n\"Whatever draws attention to the chain of circumstances in which the Métis are born, is important, and which, being multiplied, cannot but excuse them for faults with which they are reproached nor be surprised that they are even as they are.\n\n\"I could cite more than one tourist who, by their writings, have contributed to make them be regarded in Canada and other places as a barbarous and savage people, incapable of culture or civilisation, and who have left among the Métis and the Indians themselves a very sad idea of the morality of civilised people.\n\n\"No, Sir, the Métis are not such as they would wish to make them appear—a barbarous people, incapable of culture. I think, on the contrary, that they merit all the sympathy of a good Government. Let it give them some encouragement and it will see if there is nothing to hope from them.\n\n\"I therefore venture, Sir, to pray you to take in hand the cause of these poor Métis, and that the Government will be good enough to do something to encourage farming among them, at least, to those who exhibit such a willingness. Everything is scarce and so difficult to get in this country that not only the Métis, but strangers themselves can only vegetate.\n\n\"We have boasted of our Territory being called the garden of the north, and the fertile belt. This does not prevent those who inhabit it from suffering, and those who will come from suffering still more.\n\n\"To encourage agriculture, it is not only necessary to procure farming implements at a low rate, but as soon as possible to have easy ways of transport for the actual necessaries of life.\n\n\"In June, 1873, taking advantage of a trip to Europe, I passed through Ottawa, and had the honor of an interview with the right hon. John Macdonald and H. Langevin on the affairs of our country. In the month of September following I addressed a letter directly to His Excellency the Governor General of Canada. On my return from Europe I found at St. Albert a letter, which his Excellency the Lieutenant Governor, of Manitoba had caused to be written to me. According to that letter I had every reason to hope that my requests would be complied with.\n\n\"To advance civilisation of our population, all Métis and Indians, everyone is aware that schools are of the last importance. I was convinced that, under the Government of Canada, the encouragement of schools would be one of its first boons—till now I have hoped in vain.\n\n\"Besides the schools, we have also orphan asylums. I have the advantage of having three in my diocese, where fifty children have been brought up, both Métis and Indian.\n\n\"They speak of civilising the Indians by making them cultivate. It may arise that the missionaries, by working with them, ploughing and making them plough their lands, may, in the course of time, reach some results; but they will be slow and unappreciable. Fifteen years' experience does not allow me doubt that we can succeed in bringing up the little children. Many, doubtless, will not be able to receive a thorough education; but at least they can speak their Indian tongue;\nand getting accustomed to work, their savage life will be no longer possible. They can rank and mix with the Métis, with whom we marry them without much difficulty; and they will end, I doubt not, in forming good families, who will have no traces of the Indian but the blood. If, then, instead of three asylums for orphans, I had a certain number wherein I could admit all the little Indians they would give me, we would advance civilisation.\n\n\"As regards those who are Indians, if the Government will make reserves in their favor, I venture to beg that Your Honor will ensure that these reserves be composed of cultivable lands and situated near fishing lakes. In this way, besides cultivation, which will not amount to much, they will have two other means of living—hunting and fishing.\n\n\"I ask pardon, Sir, for abusing your patience so long, but I still rest on what the brave Col. Jarvis told me of your indulgence.\n\n\"I have shown you my mode of procedure to elevate the position of the inhabitants of this country. More than twenty years of experience among them makes me believe that my plans are not bad.\n\n\"I venture then, Sir, to reiterate my requests, and to earnestly pray Your Honor to use all your influence to procure them for me:\n\n\"1st. Before all, I ask some encouragement for the settlers. The Catholic missionaries have done almost impossible things in this direction. They have at different places three mills. For the third time we have tried to erect one in the colony of St. Albert—behold more than £900 stg. which we have sacrificed for it; and we are still uncertain whether we shall succeed. That the Government may, on their part, deign to do something to encourage agriculture.\n\n\"2nd. Aid for a hospital—at least to construct it, and put it in a condition to receive the sick.\n\n\"3rd. Aid for schools. The Government makes large outlay for education in all Canada. Is our North-West to be alone withheld assistance? It cannot be said that we require help less than other parts of the country.\n\n\"4th. Aid for our orphan asylums, that we may increase these establishments, so as to be able to take in a greater number of little savages.\n\n\"5th. Concession of land for each orphan asylum or model farm.\n\n\"6th. Reserve, of land for the children thus brought up, and aid to help them on to a little farm once they are married.\n\n\"7th. And lastly, that the reserves to be made over to the Indians be of arable land, and situated near fishing lakes.\n\n\"I am really ashamed, Sir, of the length of my letter, which I have been obliged to write in haste, because I was sure of the opportunity which offered of its reaching you.\n\n\"I wrote the lines close, and tried to economise my paper, so as to conceal my prattling.\n\n\"I have only succeeded in making it more apparent.\n\n\"Your Honor knows what babblers the Indians are—it is not surprising if I should resemble them, after living twenty-one years amongst them.\n\n\"This letter, coming to you, as it were, from a poor Indian, will, such as it is, be received and read by you indulgently. You will also, I am sure, take it into consideration, and constitute yourself our advocate.\n\n\"Receive, in advance, the assurance of my consideration, and be good enough to believe me,\n\n\"Sir, Your Honor's humble and respectful servant,\n\n\"(Signed) + VITAL, J.,\n\n\"Bishop of St. Albert, O.M.I.\n\n\"To His Honor\n\n\"The Very Honorable D. LAIRD,\n\n\"Minister of the Interior, Ottawa.\"\nHere is the answer of the Minister of Interior:\n\n\"To the Right Reverend J. Vital Grandin,\nBishop of St. Albert, North-West Territory.\n\nOTTAWA, 31st July, 1875.\n\n\"My Lord,—I have the honor, by the desire of the Superintendent General, to acknowledge the receipt of Your Lordship's letter of the 5th of April last, calling his attention to the condition of the settlers in your diocese in the North-West.\n\n\"2. The Superintendent General desires me to say that he has read with much interest your valuable communication, which reached him some days ago.\n\n\"3. He wishes me to assure Your Lordship that he and his colleagues in the Government have the most earnest desire to promote the well-being of all the inhabitants of the North-West, whether Indians or half-breeds, and that it will afford the Government sincere pleasure to cooperate, so far as is in his power, in your praiseworthy efforts to elevate their condition.\n\n\"4. The Superintendent General is gratified to receive from Your Lordship the assurance of the great benefits to the cause of law and order in the Territories which have already resulted from the action of the Government in sending the Mounted Police into the country. He regrets to learn, however, from your letter, that a large number of the Métis has contemplated abandoning the Province and settling in the United States, but is gratified to find that through Your Lordship's judicious intervention they were induced to remain in Canada.\n\n\"5. The Superintendent General is surprised and grieved at the statement in your letter that the Métis in your diocese regard the Dominion Government with feelings of uneasiness and distrust, and point to the occurrences in connection with the troubles at Red River as an evidence of the want of friendly feeling of the Government towards them.\n\n\"6. The Superintendent General thinks that a calm review of all the facts connected with those unhappy occurrences ought to convince any candid and thoughtful person that the Government has acted throughout towards the Métis who were compromised therein in a spirit of kindness; and Your Lordship can assure the settlers in your diocese who continue peaceable and law-abiding that the Government will be prepared to deal with them in a spirit of generous consideration. The Superintendent General hopes, therefore, that Your Lordship will be able to disabuse the minds of the Métis of the Saskatchewan of the erroneous impressions they would seem to labor under with regard to the feelings entertained toward them by the Dominion Government.\n\n\"7. The Superintendent General has read with especial interest your remarks upon the subject of schools for the Indians and Métis, believing, as he does, that it is to the education of the rising generation of Indians we must look for any permanent elevation of the red man.\n\n\"8. I shall now proceed to notice seriatum the several heads under which you ask the Government to aid the settlers in the North-West. You ask for:\n\n\"1. Encouragement for the settlers in agriculture.\n\"2. Aid for hospitals.\n\"3. Aid for schools.\n\"4. Aid for orphan asylums.\n\"5. Concessions of land for orphan asylums and model farms.\n\"6. Reserves of land for the children, and aid to help them in farming; and\n\"7. And lastly; reserves for the Indians of arable land situate near fishing lakes.\n\n\"As to the first, namely the encouragement of agriculture among the settlers, the Superintendent General cannot but congratulate Your Lordship upon the efforts made by the mission, especially by the establish-\nment of mills to enable the settlers to utilise the grain raised in your diocese.\n\n\"The Superintendent General wishes to remind you that this is a subject which will properly come within the province of the Local Government soon to be inaugurated in the North-West. He thinks, however, that it is obvious that the measures now being taken by the Dominion Government to carry a railroad and telegraph line through the Territories must have the effect of opening up the country and of facilitating transfer through it, and in this way cannot fail to give an impetus to the agricultural interest of the Territory.\n\n\"The 2nd, 3rd and 4th heads referred to by you, are all matters which come especially within the province of the Local Legislature.\n\n\"With regard to the third head, I may remark that the Dominion Lands Act makes provision by a liberal land grant to aid general educational purposes in the Territories, and so far as the Indians are concerned, the Dominion Government will, no doubt, be prepared, when the Territory is surrendered, to make the same provisions there as elsewhere by treaty for Indian schools. In the meantime, I am directed by the Minister to transmit to Your Lordship an official cheque for the sum of $300 in aid of the school at St. Albert, authorised by Order in Council of the 22nd October, 1873. As is assumed from Your Lordship's report, that the average attendance of Indian children at this school is not less than the number required by the Order in Council, viz. 25, any one of the other schools which Your Lordship may think proper to select will be entitled to a similar one for the current year, provided, of course, the average attendance of Indian children throughout the year is not less than 25.\n\n\"As to the fifth head, namely, concessions of land for orphan asylums and model farms, the Superintendent General is not prepared at present to make any definite pledge on behalf of the Government. On this point the Superintendent General will be able to speak more definitely after a treaty has been made, and when the question of the extent of land asked for for the purposes above mentioned is more accurately known.\n\n\"The sixth head refers to large question of public policy, on what it would be manifestly too premature at present to pronounce an opinion. The settlers of the North-West have good grounds for believing that the Dominion Government will deal liberally with them. There is a sufficiency of land in the Territory for all of them and their children, and it is earnestly to be hoped that they will cultivate as much of it as possible, and secure for themselves comfortable homes in the country to which they belong.\n\n\"As regards the seventh head, namely, the reserves for the Indians. This matter has hitherto been fully provided for, and all treaties made with the Indians, by which assistance in money and agricultural implements has always been secured to them, and there can be no reason to doubt that these matters will be dealt with in a similar spirit of liberality in future treaties.\n\n\"The reservation secured to the Indians will, no doubt, have a fair proportion of arable land, and will include, when it is practicable, any fishing lakes which the Indians may desire to avail themselves of.\n\n\"In this connection, Your Lordship will bear in mind that in all cases Indian reserves are selected after conference with the tribes interested, and in this way every reasonable precaution to guard the interest and meet the wishes of the Indians.\n\n\"I have the honor to be, Your Lordship's most obedient servant,\n\n\"(Signed.) David Laird.\"\n\nIt will be noticed that when this answer to Bishop Grandin was sent, on 31st July, 1875, the North-West council was not organized. Here is the opinion of a very high authority, perhaps the best in that country, in regard to the habits,\ncharacters and qualities of the Indians. Bishop Grandin recommends to the Government that Indian children should be educated; and what is the answer he received? In the month of July, 1875, His Lordship is sent to the North West council. And it must be remarked that at that time the council was not in existence. There was a provision passed during the Session, a few months before that letter was written, in 1875, providing for the creation of a North-West council as it exists to-day, and undoubtedly giving the members of that council jurisdiction over school matters; but that council was not really organised until the month of October, 1876. The law was not put in operation, and that is the answer which the late Government gave to Bishop Grandin, to go to the North-West council, which was not then in existence.\n\nWe may well imagine the difference between the policy of the present Government and that of the last one, when we are informed (as we are, in the report of Indian Affairs for last year) that the Government now maintains or subsidised 53 schools among the Indians of Manitoba and the North-West, at an expense of $12,241.74, or about $240 per annum for each school. Among these teachers, 10 are French, or French Canadians: Sisters Lemay, Paquette, Langelier and Blanchet, and Fathers Dupont, Allard, Marchand, Paquette, Fafard, Méraire, Lestance and Mr. Tabouret. The Government having seriously undertaken to settle the Indians to civilised life, went further than establishing elementary schools among them. In 1883 they asked for a vote of $44,000 to establish industrial schools, with a view of forming one on the High River, near Calgary, for the benefit of the Blackfeet under Father Lacombe; one at Battleford, under the direction of the Rev. Thomas Clarke, of the Church of England, for the benefit of the Crees and other Indians of the Saskatchewan district; one at Fort Qu'Appelle, under Father Huguenard. These schools cost about $12,000 each, and are large enough to receive 30 boys and the High River and Qu'Appelle schools can also accommodate 10 or 12 girls, which are placed under the care of the nuns. Besides these establishments entirely maintained by the Government, the Government granted, in 1883, $1,500 to the Indian School of Bishop Grandin at St. Albert. The Minister of Indian Affairs, in his last official report, thus speaks of the working of these schools so far:\n\n\"Adverting to the improvement, intellectually, of the Indians of the North-West Territories, I am pleased to be able to inform your Excellency that the industrial schools at Battleford, Qu'Appelle and High River, which were referred to in my report of last year, as then in contemplation, have been since established, and are now in operation. That\nat Battleford commenced its work quite early in the year, under the Rev. Thos. Clarke as principal; and the institutions at Qu'Appelle and High River at a later date, under the control, the former of the Rev. Mr. Huguenard, and the latter of the Rev. Mr. Lacombe. Trades have not as yet been introduced among the attainments to be required by the pupils; but it is hoped that during the ensuing year the progress of the children will admit of the same being done. The original proposal was that these institutions should be devoted exclusively to the education of Indian boys, but it would be a proper subject for the consideration of Parliament at its ensuing Session, whether a sufficient amount should not be voted to admit of the buildings being enlarged, and a staff of female teachers employed for the education and industrial training of Indian girls; the same being, in my opinion, of as much importance as a factor in the civilisation and advancement of the Indian race as the education of the male portion of the community. The appreciation in which the Indians hold this effort of the Government to improve their intellectual and industrial condition is shown by the fact that at the institution at Battleford little or no difficulty was experienced in obtaining pupils; and for that at High River, more boys were offered than could be accommodated. It would, in my opinion, be advisable to establish two industrial institutions in the Manitoba superintendency, in order to afford the rising generation of Saulteaux, Swampy Cree, and Cree Indians of the districts embraced in that superintendency, similar advantages to those granted the Cree and Blackfoot Indians of the North-West Territories.\n\n\"Before leaving the district embraced in the Edmonton agency, I feel it to be incumbent upon me, as well as a pleasure, to refer to the excellent industrial institution which is conducted under the direction of His Lordship the Bishop of St. Albert at that place. The Indian pupils at this establishment, besides being instructed in the ordinary branches of education, have imparted to them, so far as the boys are concerned, a knowledge of farm work; and the girls are taught sewing, knitting and other household duties. The value of the service rendered to the Indian race by such institutions as the school at St. Albert, and that at Morleyville, which is of a similar type, is incalculable, and His Lordship, the energetic patron of the former establishment, and his able assistants, and the Rev. John McDougall, the able principal of the latter institution, are deserving of every praise for the efforts put forth by them for the elevation of these poor children of the prairie and of the forest.\"\n\nWe may fairly assume that the scheme is a move in the right direction from the fact that Bishop Grandin had already and successfully made the experiment and that His Grace Archbishop Taché went to Montreal, in 1884, for the purpose of providing for more industrial schools among the Indians throughout Manitoba and the North-West. Le Manitoba, of the 10th July, 1884, thus refers to the policy of industrial schools among Indians:\n\n\"L'établissement d'écoles industrielles pour les enfants sauvages que vient de décréter le gouvernement est une mesure de la plus grande prévoyance et qui est appelée à rendre des services les plus signalés. Le but est de recueillir l'enfant sauvage, de l'instruire, de le briser à une discipline et de l'accoutumer au travail suivant le progrès de ses forces.\n\nThe Government has adopted not only the system of industrial schools, but has also introduced practical farming among the Indians. That nothing was done by the late Government in this respect clearly results from the following extract of a letter of the 11th November, 1878, from Mr. Laird, published with the Sessional Papers of 1879:—\n\"In regard to your enquiries respecting the method of teaching the Indians farming, I am decidedly of opinion that the best plan is to have a permanent agricultural instructor with the bands. Where reserves are grouped together one instructor might take charge of, say, three or four bands. The number which would be necessary might be, for Treaty No. 4, five instructors; for Treaty No. 6, eight; Treaty No. 7, two. Each instructor, for salary and perquisites, would cost at least $1,000, or $1,500 in all, per annum, for say, ten years. If such instructors were appointed, I would advise dispensing with ordinary Indian sub-agents. Agents to go round and make the annual payments, and oversee the instructors to some extent, would still be required, as, in my opinion, it is injudicious to let money get into many hands. If the Indians were instructed in farming I think most of the bands would soon save their seed from their own crops. But, for a few years it would be of little avail to give them instructions unless they were allowed seed and provisions for two or three weeks while planting. In the spring they are generally absolutely destitute of food, and can do but little at farming, unless provisions are supplied to them.\"\n\nActing upon this report, the Conservative Government, as early as 1880, asked for an appropriation for the purpose of establishing farms on Indian reserves. Seventeen were established during that year, and there are now twenty-six in operation, and more particularly among the Indians of the Saskatchewan district. The total cost of the maintenance of these farms was $44,023. To give you an instance of the results of these farms, let us look at the return from the Indian agency of Carlton for 1884:\n\n\"The returns received show the number of Indians resident upon the reserves, and the area of land ploughed, and the quantities of produce raised last season on the reserves belonging to these Indians, to have been as follows:—\n\nResident Indians ........................................... 1,791 souls.\nLand broken .................................................. 5,625 acres.\nRoots grown .................................................. 8,960 bushels.\nGrain do ....................................................... 4,910 do\nHay cut .......................................................... 705 tons.\n\nBattleford Agency—(Report for 1884).\n\n\"The ten bands and six reserves, last described, are under the superintendence of an Indian agent, who is stationed at Battleford. The following is a statement of the number of resident Indians, and the quantity of land ploughed, and of the quantities of produce gathered on these reserves last season:—\n\nResident Indians ........................................... 2,423 souls.\nLand ploughed and fenced................................. 5,153 acres.\nRoots grown .................................................. 2,881 bushels.\nGrain do ....................................................... 1,100 do\nHay saved ..................................................... 804 tons.\n\nIt will not be without interest to show the treatment by the Government of Poundmaker, who had connection with the recent rebellion. Poundmaker belongs to this agency, and last summer had a farm on his reserve, under the direction of Mr. Jefferson, as instructor; and here is the report of Mr. Dewdney, for 1884:\"\n\"It is estimated that this band had in crop this year two hundred acres, viz.:—twenty-five of wheat, five of oats, one hundred and fifty of barley, eight of potatoes, seven of turnips, three of carrots and two acres in gardens. The grain will yield scarcely anything, on account of the drought and the frost. The computed yield of potatoes is three hundred bushels, and two hundred and fifty bushels of turnips. They have twenty-five dwellings and eight stables. They put up this year two hundred waggon loads of hay. The band has quite a herd of cattle, consisting of nineteen oxen, twelve cows, seven bulls, three steers, four heifers, six bull and six heifer calves; total fifty seven head and, for Northern Crees, they are rich in horses, having fifty-eight head. I did not observe much fall ploughing. They have plastered, repaired and banked up their houses for the winter. Upon enquiring what became of the crop of 1883, I was informed that a threshing machine was sent to the reserve shortly after the harvest, but the Indians, influenced by the chief, would not render the labor required to work it; consequently, no threshing was done with the machine. During the winter they threshed a little from day to day by hand, and were so careless that more than half the grain was wasted. I find it, therefore, impossible to give you any further particulars.\"\n\nAmong the papers which have recently been returned, I find a report of Mr. Jefferson, the instructor of Poundmaker, dated February, 1885, in which he says:\n\n\"All seem to look forward to spring work eagerly, the fact of their getting cash for produce having given a great impulse to the cultivation of the soil.\"\n\nThe Government was so anxious to help Poundmaker and to induce him to farm, that it appears it had the intention of moving the Battleford agency to his reserve, which caused a strong protest from the Saskatchewan Herald, the local paper published at Battleford. In an article of the 27th of February, 1885, it said:\n\n\"We heard a long time ago that the Indian Department had decided to build the agency, storehouse and several other buildings on Poundmaker's reserve, about 40 miles above Battleford, but the thing seemed to us so preposterous that we did not take any notice of it at that time, thinking that it was only a rumor. It appears, however, that we have been mistaken; that it is well and finally decided that the patriotic Poundmaker will have all these public buildings at his own door, as reward for his rebellion last summer. If we knew the evil genius that suggested such a mad step to the Department, we should certainly present him with a leather medal and exhibit him through this part of the country as a great curiosity. We defy him, whoever he may be, to give a single reasonable argument in favor of such a move to any man acquainted with the locality and the situation of the different Indian reserves around Battleford.\"\n\nNow, let us look at the report for last year of the Frog Lake agency, to which Big Bear belongs:\n\n| Description                          | Quantity |\n|--------------------------------------|----------|\n| Indians resident on reserves         | 1,190 souls |\n| Land ploughed and fenced             | 1,260 acres |\n| Roots grown                          | 4,050 bushels |\n| Grain do                             | 4,670 do |\n| Hay saved                            | 485 tons |\n\nThis is what the Indian agent, A. Macdonald, said of him, on the 9th December, 1882:\n\"Sir,—I have the honor to enclose Big Bear's adhesion to Treaty No. 6.\n\n\"This chief is a Cree, from the vicinity of Fort Pitt, and was present at the signing of the treaty there by the other chiefs, but on account of having but a few followers with him (the other members of his band being on the plains), and also owing to his great objection to hangings, as a punishment for murder, he withheld from the signing of the treaty. From the fall of 1876 to the present time he and his followers have made Fort Walsh their headquarters, from time to time following the buffalo, south, even across the Missouri River.\"\n\nThis is the report for 1884:\n\n\"Big Bear, who is now getting old, and who is ruled by the bad spirits in his band, has made repeated promises that he would go to a reserve, and as often broken them. He has been lately joined by an old follower of his, named 'Little Poplar,' who, a few years ago, married into the Cree band of Indians. It is difficult to say what the result of his influence might lead to; he has already made several threats, but he will be closely watched, and any attempt to create a disturbance will at once be met with firm action.\"\n\nKnowing the character of Big Bear, and knowing also that Poundmaker was not exactly very well situated on the reserve, during the Session of 1884 the Government asked Parliament to vote $6,500 to assist in the erection of grist mills at Battleford, Carlton and Frog Lake. In fact, in January last, Messrs. Gowanlock & Laurie were building one at Frog Lake, with the aid of a portion of that bonus. The Government thought that the mill would induce the Indians to farm and support themselves more quickly. Concerning Big Bear, the Saskatchewan Herald, of 3rd July, 1884, says:\n\n\"This chief, whose name has for a long time occupied an undue prominence in the annals of the day, has entered on a new career, and one which is likely to prove more useful to all concerned than the unsettled one he has so long followed. At an interview with Major Crozier and Indian Agent Rae a few days ago, he announced it as his intention to select his reserve at once and to move on to it. He pleaded in extenuation of his former course that he was laboring under a false impression, and did not understand things as they really were, and had consequently allowed himself to be too much influenced by his young men. He could now see that the Government had done more for them that they were required to do by the treaty. He was ready to go on to a reserve with such of his people as would follow him. He said they were all very ignorant of farming and the modes of settled life, and begged that the Government would send a man to teach them, who would have some patience with their ignorance, and not get angry and abuse them because they could not do things at once. He spoke most reasonably and with apparent candor throughout, and concluded by asking for provisions to keep him while he gathered his men together and went to Pitt. If he went there, as he agreed, the agent would know that he was in earnest, and then he would ask for something else when he had got to work. He got what he asked, in the way of provisions, and left town, and there is every reason to believe he is in earnest, and that with his settlement on his reserve one of the few disturbing elements in the Indian question will be quieted.\"\n\nBut instead of going to his reserve he went down to the\neast, on the 23rd of July, after he had that interview with Major Crozier and the Indian Agent Ray, to confer with Riel; and there is no doubt that must be the principal cause of Big Bear taking arms against the authorities of the North-West. Finally, Big Bear moved to Frog Lake on the 8th November, 1884. I find among the papers which have been recently brought down, a letter from Governor Dewdney, dated 31st of December, 1884, concerning Big Bear:\n\n\"I have the honor to state that after receiving Mr. Ballandine's report on the condition of the Indians in the Carlton district, I thought it advisable to instruct Mr. Agent Rae to visit the reserves and make arrangements to relieve the distress which existed principally on the reserve north of the river, occupied by Meetowasis and Ahtahkekoop.\n\n\"The visit of Mr. Rae, as appears from his report, a copy of which is herewith enclosed, has satisfied the Indians, and I am in hopes it will be found, when spring opens, that these Indians, instead of listening to the discontented and obstructive, will be found anxious to go to work, and that we shall thus be enabled to counteract the movement which was intended, viz., of having a large gathering in the Carlton neighborhood next summer.\n\n\"As you are aware, Mr. Rae wanted 800 sacks of flour and 12,000 pounds bacon as a further supply of provisions to be sent in; but as 200 sacks are due under contract at the end of this month, I thought that by authorising the purchase of 150 sacks he could get along until the delivery was made. In addition to this 50 sacks, flour had already been purchased, under the circumstances stated in Voucher No. 10111.\n\n\"With regard to the bacon, as you know, 8,000 pounds were ordered from the Hudson Bay Company some little time ago, and on receipt of Mr. Rae's letter I requested that it might be sent in immediately, which has been done. It may be that some further supply may be necessary, but if so you shall be at once advised.\"\n\nOn the 12th January, 1885, Mr. Francis Dickens, the inspector at Fort Pitt, wrote:\n\n\"I have the honor to report that Big Bear Indians are working, being engaged in drawing logs, cutting wood, etc. As long as they work they will receive rations. All quiet at present.\"\n\nThis letter shows that on the 12th January Big Bear was employed by the Indian agent of the Government at Frog Lake, and that he was receiving rations. On the 20th February, 1885, I find a letter from John Delaney, farm instructor, Frog Lake. He writes as follows:\n\n\"I beg to acknowledge the receipt of your letter, No. 832, dated the 27th ult., and to inform you that I am sure that Big Bear and band will take their reserve this spring. I have had the chief here to-day, and he took my hand saying: 'Believe me I am going to take my reserve this spring; do not doubt me; I cannot see anything else to make a living, only to go on a reserve.' Ever since I offered to let Indians from his band join other bands in the district, they are stirring themselves about a reserve. The chief asked me not to try and break up his band by allowing them to join other bands, because I will go on a reserve, so I have told those who wish to leave him to wait.\n\n\"Monthly report of farm 15, for February, 1885.—The Indians around here have done very well this month; they have made and have drawn out a lot of timber for building, also a quantity of rails for the different...\"\nreserves. Big Bear's band have cut 390 cords of wood, and are still cutting. The Long Lake Indians are doing well; they have taken out timber for several buildings; also, the old chief has been very sick the most part of the winter, but he is getting all right again.\n\n\"I think the Indians on all the reserves around here are well contented.\"\n\nMr. Quinn writes, on the 13th March, 1885, from the Indian office, Frog Lake:\n\n\"I beg to inform you that Mr. Peter Ballendine arrived here on the 7th inst., and immediately upon his arrival we called Big Bear's band together, to impress upon them the importance of taking their reserve, but the chief being away on a hunt, we could not come to any understanding; therefore, I advised Mr. Ballendine to go and find Big Bear and bring him in; which he did on the 10th, and we called them together daily, with no results, until to-day, when he picked upon a spot at the mouth of Dog Rump Creek, on the eastern side. Their reserve, therefore, will be some 30 miles from here.\n\nI must not omit to mention Big Bear's son 'I-am-e-sees' who stood by me and helped me to impress upon his father the importance of selecting a reserve. In fact, seeing his father hesitating, he called all the young men of the band together, and they informed the chief that if he did not take his reserve he and most of the young men would leave the band, as they were tired of waiting and starving, and I think this made the chief give in at last, as the chief was for holding out till spring. Mr. Ballendine gave them a few pounds of tea and some beef which I beg to recommend to be paid by voucher.\"\n\nBig Bear seemed to be so anxious to go on his reserve that he requested Mr. Ballendine to write to Mr. Dewdney to give him an instructor in the spring, and he even informed him that he wished to have Mr. Delaney as the instructor. He asked that as late as the 14th March, 1885, a few days only, in fact, before Mr. Delaney was massacred by Big Bear's band. This kind treatment of the Indians brought these remarks from the Saskatchewan Herald, of the 23rd April last. I may be excused for quoting this paper. So far, I have always refrained to quote any paper which has been published since the commencement of this rebellion. I have done so intentionally. I do not wish to form my opinion from articles which have been written and printed under the influence of the events that were taking place. I do not wish to take my information from articles in newspapers which have been written under the strong influence either of sympathy or antipathy. I take all my information from the reports of the Department, from the Debates of the House of Commons, from newspaper articles also, but only those published before the rebellion. I may be excused, however, for making a quotation from this article, from the mere fact that we can hardly believe that, upon a question of this kind, this paper will be influenced by a feeling either of sympathy or antipathy. The Saskatchewan Herald, of the 23rd April, 1885, says:\n\n\"The petted Indians are the bad ones. The Stonies have been treated as being of a superior race, and are the first to shed the blood of their...\"\nbenefactors. Poundmaker has been petted and pampered, and stands in the front rank as a raider. Little Pine, bribed to come north and kept in comfort, hastens to the carnage. Big Bear, who has for years enjoyed the privilege of eating of the bread of idleness, shows his gratitude by killing his priests and his best friends in cold blood. Little Poplar, a non-treaty Indian, has been liberally supplied with provisions and other necessaries, and thus enabled to spend all his time in travelling up and down the land, plotting mischief and preparing for this season's carnival of ruin. The petted Indians have proved the bad ones, and this gives weight to the old adage, \"that the only good Indians are the dead ones.\"\n\nSuch has been the treatment of the Indians by the Administration, and it must be admitted that they have no reason to complain. The policy of the Government has been most liberal to them, outside of treaty obligations. They have been supplied with the necessaries of life; they have been given the means of educating themselves to civilised life, for the sole purpose of enabling the Indians to make their living out of the soil, when they could no longer make it out of hunting. In every manner possible they have been aided, in schools, industrial schools and in farming. The wisdom of this policy has been recognised by many, and among others, by the Saskatchewan Herald, of the 26th July, 1884, which, in an article headed \"Our Indian Policy,\" says:\n\n\"That there have been mistakes in the past is well enough known, and by no one better than by the heads of the Department, for changes have been made from year to year as experience dictated, until the system has been brought to combine the maximum of efficiency with the minimum of expense. It is now practically the plan inaugurated by Hon. David Laird, when he was commissioner at Coté's reserve, Fort Pelly, and which would at that time have been made general but for the crankiness and penuriousness of Hon. Mr. Mills, then head of the Indian Department. He thought he knew all about the management of Indians, when he really knew nothing, and refused to take advice. 'There is no appropriation for it,' was his curt way of dismissing suggestions offered by the practical men of the Department.\"\n\nThe following figures will better illustrate the policy of the Government than all the speeches that can be made. Here is the Indian expenditure from the beginning:\n\n| Year | Expenditure |\n|------|-------------|\n| 1873 | $25,834     |\n| 1874 | $57,455     |\n| 1875 | $92,040     |\n| 1876 | $134,339    |\n| 1877 | $203,295    |\n| 1878 | $253,036    |\n| 1879 | $377,144    |\n| 1880 | $694,512    |\n| 1881 | $805,097    |\n| 1882 | $1,083,411   |\n| 1883 | $1,106,961   |\n| 1884 | $1,099,798   |\n|      | $1,026,675   |\n### Detailed expenditure:\n\n| Item                                      | 1884       | 1882       |\n|-------------------------------------------|------------|------------|\n| By Annuities                              | $170,749   | $222,007   |\n| Agricultural implements                   | 22,172     | 8,572      |\n| Tools                                     | 3,589      | 2,506      |\n| Cattle                                    | 15,469     | 19,210     |\n| Seed grain                                | 10,786     | 22,957     |\n| Ammunition and twine                      | 7,770      | 7,280      |\n| Provisions for use during annuity payments | 48,269     | 44,083     |\n| Provisions for destitute Indians           | 499,325    | 563,451    |\n| Clothing                                  | 4,908      | 2,507      |\n| Schools                                   | 12,133     | 5,992      |\n| Surveys                                   | 19,443     | 20,624     |\n| Farm wages                                | 44,023     | 47,786     |\n| Farm maintenance                          | 27,107     | 37,288     |\n| Sioux                                     | 459        | 2,741      |\n| General expenses                          | 117,314    | 89,921     |\n| Commissioner's house and office           | 10,135     |            |\n| Industrial schools                        | 12,018     |            |\n| Grist Mills                               |            | 3,293      |\n\nTotal expenditure: 1,025,675 00 1,099,796 90\n\n### In Manitoba Superintendentcy.\n\n| Item                                      | 1878       | 1877       |\n|-------------------------------------------|------------|------------|\n| For Annuities—Treaties Nos. 1, 2, 3 and 5 | $54,308    | $55,725    |\n| Agricultural Implements, Cattle, &c.—     |            |            |\n| Treaties Nos. 1 and 2                    | 4,986 34   | 5,243 52   |\n| do Treaty No. 3                           | 5,127 38   | 5,874 02   |\n| do do No. 5                              | 1,528 30   | 942 35     |\n| Sioux                                    |            | 2,799 54   |\n| Provisions                                | 7,955 62   | 25,157 02  |\n| General expenses of the Superintendentcy  | 33,038 32  | 29,759 38  |\n\nTotal: 106,943 96 126,501 38\n\n### In North-West Superintendency.\n\n| Item                                      | 1878       | 1877       |\n|-------------------------------------------|------------|------------|\n| For Annuities—Treaties Nos. 4 and 6       | 95,402     | 31,253     |\n| Agricultural Implements, Cattle, &c.—     |            |            |\n| Treaty No. 4                              | 3,942 81   | 4,806 02   |\n| do No. 6                                 | 15,682     |            |\n| Provisions                                | 40,633 47  | 8,952 92   |\n| Probable cost of new Treaties             | 72,916 65  | 74,317 12  |\n| Sioux at Qu'Appelle                       | 388 88     |            |\n| General expenses of the Superintendency   | 18,657 28  | 8,205 61   |\n\nTotal: 247,633 09 127,534 61\n\n### In both Superintendencies.\n\n| Item                                      | 1878       | 1877       |\n|-------------------------------------------|------------|------------|\n| For Surveys                               | 21,938 81  |            |\n| Transfer of this amount to the credit of \"Indian Fund\" having been received for cordwood sold | 39 00     |            |\n\nTotal: 377,144 86 253,036 05\n\nThe Indians have, therefore, received in money and provisions:\nor a total of $2,162,796, for three years, divided among the population of about 34,000, it will give $21 per head per annum or $105 per annum for a family of five, which the Indians receive from the Government in money and provisions, without talking of cattle, seed, grain, clothing, etc. Before going any further, it may not be out of place here to say a word or two about certain reports which have been circulated of late, that the Indians did not get what the Government paid for; in other words, that the supplies were deficient both in quality and quantity. It is very remarkable indeed that in all the local papers that I have read I did not find a single complaint about this; and can it be doubted that if deception and fraud had been practised on a large scale, and had been the system followed by the contractors and the officials, it would have reached the local press in one shape or another. As to the reports of the Indian agents for 1884, they all admit that the Indians have no reason to complain, and, in fact, no complaint is mentioned. Mr. Pether, Indian agent for Keewatin, in his report of August, 1884, says:\n\n\"The supplies for the various bands on this agency were delivered in good condition and according to samples.\"\n\nMr. McIntyre, in his report of the same month:\n\n\"The supplies were up to the samples and were quite satisfactory to the Indians.\"\n\nMr. Wadsworth, Inspector of Indian Agencies, in his report of the 25th October, 1884, speaking of the Piegan reserve:\n\n\"The flour and other supplies were of good quality, and put up according to the terms of the contract. I took an accurate inventory of the flour, bacon, tea, beef, agricultural implements, tools, live stock, etc., and audited the books.\"\n\nMr. Wadsworth, same report, from the Blood reserve—\n\n\"The flour and other supplies were of good quality. I audited the books, and found them well kept. The receipts shown therein agreed with the quantities charged against the reserve of the agency. I took an inventory of all departmental property upon the reserve.\"\n\n\"Indian Office, Fort McLeod.\n\n\"I audited the books, took an inventory of the supplies, agricultural implements, tools, etc., on hand, and examined into their quality and condition. I found everything generally satisfactory, and the books have been well and regularly kept since Mr. Lash was appointed clerk, in December last.\"\n\"I found the issue of flour here somewhat less per head than at the Blood reserve, and there was some discontent regarding it. The chief, Crowfoot, wished also that those of his men who assisted in issuing the rations should be paid the same wages ($13 per month) as those who perform similar duty upon the Blood reserve.\"\n\n\"Battleford District.\n\n\"I took stock of the flour and bacon, which proved satisfactory.\"\n\n\"Battleford Industrial School.\n\n\"The food supplies, cloth, blankets, linen, etc., sent here this year, are fully equal to contract samples, excepting the flour, which is dark; it, however, appears to be very wholesome.\"\n\n\"Qu'Appelle Industrial School.\n\n\"20th Nov. 1884.—A correspondant of Le Manitoba says that the supplies are 'de première qualité.'\n\n\"Poundmaker's Band,\n\n\"I took an inventory of the flour, bacon and other supplies on hand. The flour was of inferior quality, and weighed only ninety-eight pounds per sack. Upon enquiry the agent informed me that, running short of flour, he was obliged to borrow some from Mahaffy & Clinkskill, Battleford, and this was the only kind they had. Amongst the bacon I found five hundred and seventeen pounds \"long clear.\"\n\nSome discussion took place during last Session (1884) as to some delay or deficiency in the delivery of seed grain and agricultural implements, but not only did they not apply to the provisions, but were explained to have been due to difficulties of transportation. The only report of any consequence I have been able to find, in which mention is made of bad supplies, has reference to the last year of the Administration of hon. gentlemen opposite. It is signed by Mr. Vankoughnet, and is dated 31st December, 1878, and applies to the whole of Manitoba and the North-West:\n\n\"The payment of the annuities to the Indians within the North-West Indian superintendency were, I am happy to say, made at the dates previously fixed upon at the several points of meeting, and the supplies of food, implements and cattle were delivered for the most part on time.\n\n\"I regret to report, however, that complaints have been made of the bad quality of the flour and beef furnished at some of the points of payment, and also that the cattle purchased for these Indians were too wild to be handled.\"\n\nI have also heard complaints that the Government had given contracts to foreigners for supplies. Especially some complaint has been made with regard to the contracts given to the firm of I. G. Baker & Co., of Benton, Montana. There was a debate, in 1883, upon this point, and it will be seen that if I. G. Baker & Co. are employed today to furnish the greatest portions of the supplies in the North-West, the initiative came from hon. gentlemen opposite. I will read an extract from that debate:\n\"Mr. CHARLTON. I notice, amongst the expenditures in the Public Accounts for the year ending 30th June last, that one firm, Baker & Co., obtained a very large sum. Where is that firm located?\"\n\n\"Sir JOHN A. MACDONALD. At Fort Benton, Montana.\"\n\n\"Mr. CHARLTON. I believe they are Americans?\"\n\n\"Sir JOHN A. MACDONALD. Yes.\"\n\n\"Mr. CHARLTON. The other night, when I referred to the system of surveys in the North-West, I asked why the hon. gentleman had not adopted the American system in its entirety, and it was said, in reply, that I drew all my inspirations from Washington. Where does the hon. gentleman draw his inspiration from, in permitting a Yankee firm to obtain $462,000 for supplies, which could have been obtained from our own dealers?\"\n\n\"Sir JOHN A. MACDONALD. The inspiration from which I drew those supplies, through Baker & Co., was the greatest of all monarchs, the monarch of necessity. There was nobody else to supply the food on the eastern slope of the Rocky Mountains for the Blackfeet and the Bloods. There were no means of getting supplies, except from Montana. I may say, though the members of the firm are Americans, they are most satisfactory contractors—fair, honest, liberal and trustworthy. They have fairly competed with other traders, because these contracts have always been put up to public competition, but nobody could tender for the supplies in the extreme west. The Hudson Bay Company tendered for a good deal. Other parties, Capt. Howard, who is known, perhaps, to Mr. Watson, tendered, and is the lowest for some contracts this year.\"\n\nIt will be noticed that in 1884 that contracts were given to Baker & Co.; but they were given after public tenders being asked. Did hon. gentlemen opposite pursue the same course? Hon. gentlemen opposite first gave contracts to Baker & Co., in 1876, and they did so without calling for public tenders. They asked Baker & Co., to supply the Indians in the North-West, and they even sent an agent to Chicago to obtain a portion of those supplies. Mr. Schultz attacked the Government in this House on the question. Here is the explanation given by Mr. Blake:\n\n\"The first detachment of police (about 150) was sent to Manitoba upon very short notice, in September, 1873, and during the winter of 1873-74, was supplied from the Hudson Bay Company's stores, I believe, at rates similar to those charged the militia. When the force was recruited to its full extent for the journey to the Rocky Mountains (May, 1874), an agent was sent to Chicago to St. Paul to purchase such articles of provision as was considered be purchaseable in the States at cheaper rates than in Canada. The bacon required was obtained at St. Paul, Min., at 12½ cents per pound, American currency. Twenty-five barrels of pork were also purchased there, at $19.50 per barrel, American currency. The pork (bacon) required for the force on its return from the expedition, in 1874, was obtained in Winnipeg, Manitoba—tenders were called for by public advertisement. On 16th April, 1875, Mr. Nixon was instructed to communicate with the commissioners and purchase, amongst other things, sufficient bacon for two divisions (100 men) for six months. He had represented that he could purchase them cheaper than at a later date. The bacon for 1876-77 was included with other articles for which tenders were called, but owing to complaints as to the quality of the pork purchased in Manitoba, a supply was obtained in Ontario—Ingersoll; with the addition of re-freight charges to Manitoba, this bacon cost about 2 cents per pound more than the tenders for supply at Winnipeg. Small quantities have, at various times, been pur...\"\nchased from storekeepers in Manitoba, but the above mentioned include all large quantities. The bacon required for the force, in the southern parts of the Territories, has been supplied by Baker & Co., of Fort Benton, Montana, either under contract or at prices certified by the assistant commissioner of the force. It will require some time to obtain a statement of all the prices and quantities.\"\n\nYou can hardly imagine that this liberal policy of the Administration met with the approbation of hon. gentlemen opposite. Every year after they left office, it became more necessary to come to the assistance of the Indians, and the Indian expenditure increased, and hon. gentlemen opposite complained of this. Mr. Mills, in 1882, said:\n\n\"Mr. MILLS. I called the attention of the hon. Minister last year to the largeness of the sum for annuities, and to the fact that when you collected the payments made of the annuities due for different years it was pretty clear, from the Public Accounts, that we had not an accurate return of the number of Indians of the various bands, and that through Indian dishonesty a considerable number were paid twice, or even a third time. The sums paid last year and this year are very much larger than four or five years ago.\"\n\nDuring the debate, in 1883, on Indian supplies, Mr. Casgrain said:\n\n\"I lay down, as a principle which cannot be controverted, that this race is becoming rapidly extinct, and we are wasting an enormous expenditure to attain an object which will never be attained—that is, to civilise these Indians. I have seen myself, at Garden River, the experiment tried by Catholic and Protestant missionaries. A small plot had been cultivated and set out in garden lots, and small houses had been built near them for the Indians, but instead of living in these houses, they built themselves, in front of the houses, small bark wigwams, and there they lived.\n\n\"Sir JOHN A. MACDONALD. Those were their country houses.\n\n\"Mr. CASGRAIN. As to their plots, there was not a root to be found in any of them.\n\n\"Sir JOHN A. MACDONALD. You might find some briar roots.\n\n\"Mr. CASGRAIN. I give this as an instance of the incapitude of the Indians to enter into civilised life. Now, Sir, I will make an exception in favor of the British Columbia Indians. They are a self-sustaining race, because they have not had large fields in which to hunt buffalo, and have been obliged to resort to fishing, in order to supply themselves with the necessaries of life. This gave them sedentary habits and led them to cultivate the soil. But as to Indians of the North-West Territories, they are a doomed race, and it is only a question of how soon they will disappear. This race is extremely jealous, and they do not look to the Government employees, that are bound to aid them, but, as they say, they look to the Great Mother on the other side to protect them.\"\n\nEven if this race is going to become extinct some day, but I doubt that the prediction of the hon. member for L'Islet will be realised, it becomes important to consider what we are going to do with them in the meantime. Even if they are going to become extinct, Poundmaker and Big Bear are\nnot dead today. Something must be done for them, in order to keep them quiet; otherwise they will plunder and murder. The policy of hon. gentlemen opposite seems to be very different from that which was plainly advocated by the Winnipeg Free Press, one of their organs, on 8th September, 1884. It said:\n\n\"It must be apparent to both the American and Canadian Government that their present methods of dealing with the Indians are doomed to failure. They should either make up their mind to provide sufficient food for them; or else, in earnest, set to the work of making them self-supporting.\"\n\nNotwithstanding the opinion of the hon. member for L'Islet, there can be no doubt that the policy of the Government was the correct one. I will quote the authority of one who is very familiar with the Indian question. I refer to Hon. Mr. Laird. In an interview with a reporter of the Montreal Daily Witness the following appears in the issue of that paper on 19th June. Mr. Laird says:\n\n\"It is hardly my place to give the Government an Indian policy; but the only course, in my opinion, that can be adopted, is to patiently go on instructing and encouraging them to be farmers. In ten years many of them have made greater progress towards civilisation than any of the Indians on the reserves in Ontario have in a hundred; and in 1882, when I retired from office, the settled bands were, by their crops, reducing the cost of supporting them at least one-half. If in one generation, or even in two, you raise men from the level of savages to civilisation, you are doing more than has ever been done in any other country. Many of the older men can never, I fear, be taught to work steadily or make provision for future needs, but the young men, who have never been on the war path or on the buffalo hunt, soon learn to look to their crops and take care of them. To the old Indians it is almost an impossibility to wait three months for a crop to grow. For instance, we had a good deal of difficulty in preventing them from digging up the potatoes as soon as the young plants show above the ground. On the whole, they made wonderful progress, from 1878 onward—well worth all the labor it cost.\"\n\nNow, Mr. Speaker, I have closed with the Indian question. I believe I have said enough to show that the policy of the Government in the treatment of the Indians in the North-West, and Manitoba has been most liberal, and has produced good results. Now, let us see where are the complaints of the half-breeds, of which so much has been said by hon. gentlemen opposite. I do not intend to enter into that question at very great length. I will take them exactly as they appear from the last meetings of the half-breeds and the white settlers in the North-West. Let us take in the first place the grievances of the half-breeds as laid down in the Bill of Rights, which was adopted at the meeting at Prince Albert, on the 5th of September, 1884. I have not been able to obtain an English copy of it, but I find the original published in Le Manitoba. The first demand which they asked for is \"the inauguration of responsible government,\"\nNow, I ask if the members for the other Provinces today are willing to create new Provinces in the North-West. I say that under the constitution of the North-west council they enjoy virtually all the liberties and privileges of responsible government. In 1870—I am speaking as a member from the Province of Quebec—we had a great deal to do with the establishment of the Province of Manitoba. Then the question was only one of paying $43,600, to give the population of that country the privileges of popular government. Well, where are we now? The subsidy to the Province of Manitoba amounts to something like $440,000, and if we are going to give Provinces to the North-West, then we must make up our minds to allow those new Provinces a few hundred thousand dollars more each. Sir, I do not believe that the people of the old Provinces are willing that they should be taxed to that extent, especially when no good result can be obtained. I ask, if you give them Provinces, will they be in any better position than they will be when a North-West council will be established for the different districts? I say no. A Legislature sitting in Regina will not be in any better position to know the wants of that Territory than the North-West council sitting today. When the time will come when a change in the constitution in the North-West will be necessary, when the council will have twenty-one members, when they will be entitled to become ipso facto Provinces, with an Assembly, then will be the time to consider the constitution of the whole North-West, and instead of giving them the expensive machinery of a Legislature, give them a council, for each district, such as they have today, which will be more beneficial to that country and more satisfactory to the older Provinces. I say that the desire for responsible government and a Legislature, as enjoyed by the older Provinces, is not shared in by all the people of the North-West. The Saskatchewan Herald, of the 23rd of August, 1884, says:\n\n\"It cannot be long before Assiniboia will have the population necessary to set it up as a Province, and then the opportunity will be afforded of modernising the constitution of the remaining Territories.\"\n\nThe next grievance of the half-breeds is, that they want \"the same guarantees to be allowed to the old settlers of the Territories as were allowed in 1870 to the settlers of Manitoba; that a certain area of land, today in the possession of the half-breeds, should be left to them, and that on application patents should be granted to them; that the half-breeds of the North-West shall receive each 240 acres of the land, as the half-breeds of Manitoba received; that 2,000,000 acres of land should be set aside by the Govern-\nment for the benefit of half-breeds, Protestants and Catholics; that the Government should sell these lands, deposit the money in the bank, and that the interest of that money should be used for the maintenance of schools of instruction, industrial schools and hospitals, and for the purpose of procuring ploughs for the half-breeds, at least every spring, to enable them to sow their lands; that about 100 townships be taken, of the swamp lands of the North-West, which do not appear to be open for settlement for a long time; that these lands be set apart by the Government, and that they be distributed by the Government, every 18 years, among the children of the half-breed population. They say that the Province of Manitoba has been enlarged since 1870, and that the rights of the Métis to the titles of these lands have not been recognised. They, therefore, ask that these titles should be extinguished in favor of the half-breed children at the time of the transfer, and of such children as may be born for four generations.\"\n\nWith regard to these lands and the grievances of the half-breeds, there is one point worthy of remark. A great deal has been said by the member for Quebec East (Mr. Laurier) about the lots at St. Laurent, on the river, not being divided into river lots of 10 chains by 2 miles. It is strange, indeed, that at this meeting, which took place on the 5th of September, 1884, there is not a single complaint about that—no complaint that the lands of the half-breeds have been badly surveyed or divided; that anyone has been evicted, or that even an attempt at eviction has been made.\n\nThere are some items in these resolutions which are most unreasonable—some things which have not been demanded even by the half-breeds of Manitoba. There are some, however, which require a little explanation. As to the demand that lands should be set apart for educational purposes, it is well known that by the Dominion Lands Act two sections in each township are set apart to provide for the education of children; and, indeed, the half-breed and white population of the North-West have no reason to complain of being neglected by the present Government so far as schools are concerned. The number of schools in the North-West receiving Government aid was 19 in 1883 and 28 in 1884—17 Protestant and 11 Roman Catholic. With regard to the half-breed claims to the Indian title, I have already shown what the late Government have done. The Minister of the Interior said the half-breeds were not entitled to anything more than the white settlers, that is to say, a free homestead. The present Government, as I have also mentioned, immediately after they came into office, in 1879, changed that policy, and went back to their policy of 1870,\nwith regard to the half-breeds of Manitoba, and asked this Parliament to give them power to deal with the half-breed claims as they might deem expedient. But it is said: Although you declared your policy, although you intended, evidently, to satisfy the claims of the half-breeds to the Indian title, you have done nothing since 1879. Well, as the hon. Premier explained last night, the Government had to face a great many difficulties. In the first place, on the one hand, Archbishop Taché, no doubt, having before him the experience of 1870, and following years, in Manitoba, had made representations that he wished these new free grants to extinguish the Indian title in the North-West to be entailed for three generations. There were, besides, representations of the Anglican Bishop, who also wished them to be entailed, but only for ten years. Then there were the representations of the Premier of Manitoba, who had also a great deal of experience in these matters, and who also desired these lands to be entailed, but for a shorter period. On the other hand, the North-West council recommended that free grants should be given to the half-breeds, just as they were given to the half-breeds of Manitoba in 1870. Those grants were made without any condition—160 acres to the heads of families and 240 acres to the children. What was the consequence? The scrip were sold immediately, almost before they reached the hands of the half-breeds; and no doubt Archbishop Taché, Mr. Norquay and the bishop of the Church of England had very good reasons for recommending the Government to change their policy towards the half-breeds. But matters were pressing. The half-breeds, no doubt, pushed by speculators, were asking, not that their lands should be entailed, but they were asking for a title which could be disposed of immediately. At the meeting which took place in September, 1884, at Prince Albert, the half-breeds expressed their wish for such a title to those lands as they might dispose of as they chose. There was a little delay, no doubt. From 1879 to to-day those claims have not all been settled; their settlement only commenced within the last few months; but you will admit, and the public will admit, that the Government have labored under serious difficulties, having, on the one hand, to contend with the representations—in my opinion, the very reasonable representations—of Archbishop Taché and the other gentlemen of experience in the North-West, and, on the other hand, with the demands of the half-breeds, supported by the North-West council. In the issuing of patents for lands there was another difficulty—the difficulty of finding lands which were surveyed. When hon. gentlemen opposite left office, in 1878, they had hardly done\nanything in this respect in the North-West. I will give you a complete table of the surveys, as they were made, from the beginning until to-day both in Manitoba and the North-West:\n\n| Year       | Acres     | Farms of 160 acres each |\n|------------|-----------|-------------------------|\n| Previous to June, 1873 | 4,792,292 | 29,953                  |\n| In 1874    | 4,237,864 | 26,487                  |\n| 1875       | 665,000   | 4,156                   |\n| 1876       | 420,607   | 2,628                   |\n| 1877       | 231,691   | 1,448                   |\n| 1878, N.W. | 306,936   | 1,918                   |\n| 1879       | 1,130,482 | 7,066                   |\n| 1880       | 4,472,000 | 27,950                  |\n| 1881       | 9,147,000 | 50,919                  |\n| 1882       | 9,460,000 | 55,125                  |\n| 1883       | 27,000,000| 168,750                 |\n| 1884       | 6,400,000 | 40,000                  |\n| Totals     | 67,255,770| 420,399                 |\n\nThe agricultural population these lands would sustain, on the basis of three souls to a homestead, would be 1,261,197. The land surveyed up to 1873 were 9,999,000; from 1874 to 1875, 1,797,120; from 1884, 55,618,500. The survey, in the vicinity of Prince Albert and also in the vicinity of St. Laurent were made in 1878. Surveys were made subsequently in the old settlements on the North Saskatchewan, Edmonton and St. Albert. The lands between Carlton and Fort Pitt, and between Edmonton and Calgary, were surveyed in 1884. During the season of 1883, 120 land surveyors were employed, 35 among them French Canadians. In 1884, 61 surveyors were employed, of whom 22 were French Canadians. The surveys in 1883, alone, cost $750,000. With the surveys, land offices were opened. The first was opened at Prince Albert in 1878, Mr. Duck, agent, appointed by the late administration, the very same officer who was nominated long before the office was opened and ready. The second office was in Regina (Troy, for a short time). In 1884, four land offices were opened at Calgary, Edmonton, Touchwood and Coteau, and finally this spring at Swift Current. The first registry office was opened in 1876 at Battleford and three more later, Prince Albert, Regina and Calgary. In 1883, during the debate which took place in this House on a motion of Mr. Blake, in moving for copies of all correspondence and memorials relating to the claims of the inhabitants of Prince Albert and the neighboring districts in the North-West, with respect to the lands which they occupy, and other matters affecting their condition, I find the following statement made by Mr. Royal, the hon. member for Provencher:—\n\"I suppose you are aware that delegates have been sent here by a certain portion of the population of the North-West Territories, respecting the subject which is just now engaging the attention of this House, and is more especially under the notice of the Government. These delegates have laid their grievances—it grievances they are—before some of the hon. Ministers. Their object is to have the title to the lands occupied, owned and improved by some of these people for over 20 years recognised and confirmed by the Government. Their claims are nothing but just. These lands belong mostly to half-breed people and pioneers from Ontario, who went west from the Province of Manitoba some five, ten or fifteen years ago. These pioneers or Canadian civilisation have formed groups throughout the Territories, which will, no doubt, be the nucleus of a large population. There is a very important group at Duck Lake, Prince Albert, another at Edmonton, another at St. Albert, and so on. Last year surveyors were sent out to carry on the surveys of the Dominion in that part of the country. These surveyors had no instructions to stop wherever they would meet any of the old settlements, and their continuing the lines aroused, of course, the suspicion of the old settlers, who held a meeting, and represented to the Government the justice of respecting their property in farm improvements. Their claims have been fully recognised, and orders have been sent to the surveyors to respect those settlements. The object of this delegation is to have the Government cause the lines of the Dominion surveys to front on the limits of their settlements. The delegates have already had an interview with some members of the Government, and were assured, in every case, the rights of ownership of those old settlers would be fully recognised. These settlers are not to be classed with squatters. The squatter is, generally speaking, a man who goes off the survey and squats on the piece of land he thinks best suited for farming. In some cases, unfortunately, he is sent there by somebody else, or goes on his own impulse, to select the best spot, on which he will make a slight improvement, in order that he may be able to sell it to some company or individual. The settlers to whom I refer went as far as Prince Albert, some few miles west of Edmonton, and lived there on their farms for over thirty years. Of course, it was quite natural they should suspect something was wrong when they saw the surveyors continuing their lines of survey; but there is no more reason for fear on that ground. The delegates have also another object in view, namely, to have the Government recognise and confirm the titles of these settlers. No doubt, to a certain extent, they have been squatters, but their rights are clear, and of course they are anxious the Government should confirm them and issue Crown patents to them, in order that their property should be classed the same as any other in the Dominion. In that respect, also, I am happy to state their wants have been fully met with, and they have been assured the Government will fully recognise their titles, and issue, in due time, the letters patent. They have also demanded from the Government that a land agent should be appointed in their own district. The nearest land agent is about 300 or 400 miles distant from Prince Albert, and the hon. Minister has assured them that as soon as the plans of survey would be recognised and confirmed by the Government a Dominion land office would be opened there, and everything made ready for the interests of the new settlers. It is well known, I believe, in Manitoba and the rest of the Dominion, that that part of the North-West Territories which lies on the North Saskatchewan, and extends from Prince Albert to Edmonton, will certainly, before many years, contain a very large population. That district is composed of the most fertile lands in that part of the country, where running waters, forests and vast arable lands are to be found in large quantities. Already the pioneers have gone in advance of the surveys, and formed groups of population, which are now among the most important groups in the North-West. On behalf of these delegates I must recognise the fact that the Government have dealt with them in a most open and liberal manner.\"\nI know, as a fact, that a land office has been opened at Edmonton last year, and that Mr. Gauvreau was transferred from Prince Albert to Edmonton, in order to give more facilities to the French half-breeds of that district. At the same time, last year Louis Schmidt, French half-breed, was appointed assistant to the land office of Prince Albert for the same purpose. In 1883 I believe the Government, with a view of giving greater facilities to white settlers and claimants in the North-West, and also in Manitoba, to make out their claims and have them investigated established a land board in Winnipeg, with more extensive powers than the ordinary powers of a land office, with Mr. Walsh as commissioner. Mr. Walsh has investigated many of these claims. It will be noticed that the policy of the present and the last Government is very different in this respect. What was the reply of the late Government? Representations were made by Mr. Matthew Ryan, that the half-breeds were very pressing for the recognition of their rights—I refer to the half-breeds who were entitled to scrip in consequence of being residents in Manitoba at the time of the transfer, and who emigrated afterwards to the North-West. Mr. Ryan made strong representations to the late Administration that he should be empowered to examine the claims of those half-breeds who were entitled to scrips in Manitoba, but who happened then to be in the North-West Territories. On the 24th June, 1878, Mr. Laird wrote from Battleford to Col. Dennis, as follows:\n\n\"Observe Mr. Ryan's authority; time to investigate half-breed claims under Order 14th June, 1876 lapsed; recommend time be extended one year. He is now here. Applicants waiting answer.\"\n\nMr. Denis replied:\n\n\"Will consult Minister on his return; expected this week in re half-breed claims, and advise you forthwith.\"\n\nNow, what is the answer of the Minister of the Interior? We find on a margin of a report made by Mr. Codd, dated 16th March, 1877, the following note:\n\n\"It is not necessary to look up parties who have claims. If they care for their interests they will themselves come forward and establish their claims.\"\n\nThe present Government did not act upon the same principle. They thought that these half-breeds in the North-West and Manitoba should have some easy means of establishing their claims, and that is the reason why the land bureau was established in Winnipeg, and Mr. Walsh appointed as commissioner. This land bureau of Manitoba went to work, and, from the report of 1884, it will be seen that they have done a great deal of work. The Government land board reported on 711 claims of squatters in 1884, including those\nof old settlers. Here is the report of the Minister of the Interior for that year:\n\n\"At the time the offices of Deputy Head and Surveyor General were separated, and Mr. Lindsay Russell was charged with the duties appertaining to the latter position, it was provided that he should also investigate and settle the claims to land by virtue of long occupation advanced by the old settlers along the North Saskatchewan. When it was found that Mr. Russell's health did not admit of his visiting the settlements, an Order in Council was passed, remitting this portion of his work to the land board. Accordingly, early in the year, Mr. Pearce went to Prince Albert, and from thence to Battleford, Edmonton and St. Albert, and made a careful personal enquiry into all the claims of this class at those places, with the result that all, with one or two exceptions, at Battleford and Edmonton, have been finally and satisfactorily disposed of. The only claims of old settlers remaining unsettled are at Lac la Biche, Victoria and Battle River. The necessary investigation at the two latter places will be made early next spring, but the claims at Lac la Biche cannot be properly adjusted until the surveys reach that point.\"\n\nMr. Pearce was sent to the Saskatchewan at the beginning of last year, and here is his report:\n\n\"The question of the claims of the old settlers on the Saskatchewan is one of long standing; but, with the exception of the claims in the immediate vicinity of Prince Albert, nothing could be done in the matter until the surveys were completed. These surveys were not finished until this summer, and could not have been completed at an earlier date; for, had these been prosecuted in any other way than the one adopted, it would have been at a great sacrifice of both accuracy and economy.\n\n\"Very full reports accompanied the evidence forwarded to the Minister so soon as the investigations were completed. The claims of Prince Albert have been finally disposed of. Those at the other points may reasonably be expected to be settled within a few weeks.\n\n\"The most liberal construction possible under the circumstances was put upon all the claims; and, judging by the result at Prince Albert, it is confidently anticipated that the percentage of claimants who will be dissatisfied therewith will be very small—probably not 5 per cent.—and of these more than one-half will be only on the grounds that their claims have not had as liberal treatment as the claims of others. It may be said of these claimants—upwards of seven hundred in number—that, as a class, the 'land shark' formed a very small number.\n\n\"The difficulty of obtaining explicit evidence has been referred to in the special reports; and in this it need only be mentioned that this difficulty did not arise from unwillingness, but from inability.\n\n\"It is somewhat remarkable that, out of the large number of cases investigated, but few were advanced through a residence on and peaceable possession of the land on the 16th July, 1870; the only points at which such were preferred being Prince Albert and St. Albert—some half dozen at the former, and about forty at the latter. This would go to demonstrate that it has been only within the past few years that any idea of making a livelihood by husbandry has occurred to the inhabitants of the district; and when this fact is considered, the progress they have made is really wonderful. Such facts encourage the hope of a fairly successful fruition of the policy adopted in teaching the rising generation of Indians habits of industry, with a view to make them a self-sustaining people.\n\n\"The claims at St. Laurent, on the south branch of the Saskatchewan, were not personally investigated by me, as the greater portion of the claimants spoke only French, and I would have required an interpreter.\"\n\"With the approval of the Minister, Mr. Duck, Dominion land agent, who speaks the French language, was instructed to obtain the evidence of these claimants. This was revised by me, and recommendations made in each case by the land board.\n\n\"I would particularly wish to refer to the aid extended to me by the Rev. Père Le Duc, when investigating the claims at St. Albert.\n\n\"Most of the claimants could only speak Cree, and the Rev. Father acted as interpreter, and did all he could to make the investigation run smoothly and pleasantly.\n\n\"The only claims now remaining are at Lac la Biche, Victoria and Battle River. Those at the latter two points can be disposed of so soon as the surveys are adjusted; probably early next spring. At the former point some delay, probably a year, must ensue, in getting the surveys carried to that point, owing to its isolated position; also the survey on the ground of an Indian reserve.\n\n\"There are a few other isolated cases remaining, chiefly in the vicinity of Fort McLeod; and they can be readily dealt with when the townships in which they are situated are open for entry.\"\n\nThe Saskatchewan Herald, of the 23rd August, 1884, speaks in very favorable terms of Mr. Pearce's investigation:\n\n\"But, of course (this paper adds) it is not likely that he has acquired the art of pleasing everybody, or of giving to each of two or three claimants the whole of the parcel of land in dispute.\"\n\nWhen Mr. Pearce was making this investigation, or a short time after that, Mr. Riel came to the country, and, on the 26th July, the Saskatchewan Herald says:\n\n\"Louis Riel is visiting all the settlements at Prince Albert and the south branch, but, so far, has given no public utterances of his intentions. Rumor, however, has his work cut and dried for him, and telegrams from Prince Albert to the east give as one ground for the agitation, that the Government refuses to recognize the claims of the early settlers to the land taken up by them long ago, and that, in surveying the country, all their rights have been ignored. So far from this being the case, the Government has put a blot on the general system of survey, by laying out their claims in narrow frontages, as the settlers desired.\"\n\nThis shows that the Government has not been inactive. They proceeded last year with the examination of the claims of the old settlers; they sent someone to investigate the claims; a report was made, and, more than that, they commenced to examine the claims of the half-breeds to scrips; and on the 28th January, 1885, an Order in Council was passed, which has been read before. Whether that Order in Council has been cancelled later on or not, it shows that, at that period, nearly two months before the commencement of the rebellion, the Government was in earnest, with a view to meet the claims of the half-breeds. Now, in presence of all these facts, how can it be pretended that the Government has done nothing within the last few years for the half-breeds? The country has been surveyed to the extent of several millions of acres. Land offices and registry offices have been opened; agents have been appointed, and in most districts where the French population is to be found, an agent has been named who speaks French. We can\neasily imagine the difficulties the Department must have met with in dealing with this matter. Let us see what the late Administration has done towards the settlement of the half-breed claims in Manitoba. The rights of the half-breeds were declared by an Act of 1870, and 1,400,000 acres of land were given by the Manitoba Act. Commissions were appointed by the Government for the purpose of finding out the number of half-breeds entitled to that free grant. When they left office, in 1878, the work was far from being done. Hon. gentlemen opposite went to work and appointed commission after commission. I do not want to blame them for it. I think it would be hardly fair to blame an Administration when they have to deal with such a vast territory as this. I would like to know, however, if hon. gentlemen opposite will tell me whether in 1878, eight years after the rights of the half-breeds had been declared by Act of Parliament—not seven years, as the hon. member for Quebec East stated, with respect to the half-breeds in the North-West Territories—but after eight years of investigation on the part of hon. gentlemen opposite and their predecessors, they had left half-breed claims in Manitoba unsettled, and how many claims did they leave unsettled? I do not wish to be hard with them, but at the same time they ought to know the difficulties of the situation; that really it is not an easy task for any Administration to deal with the half-breed question in the North-West. I say that notwithstanding all these commissions the present Government, after coming into office in 1881, had to appoint another commission, composed, Judges Miller and Dubuc, of the Superior Court, for the sole purpose of making a new enumeration and completing the list of claims which had to be examined in Manitoba; but notwithstanding this commission, another Order in Council had to be passed, with a view of giving full justice to the half-breeds who had no other title to their land but occupation, and on the 25th February, 1881, an Order in Council was passed by this Government, with a view of coming to the relief of those half-breeds of Manitoba who had not obtained justice. Yet the hon. gentleman had five years to do that after all the work which had been done by their predecessors. But, as I said at the beginning of my remarks, even if these half-breeds had some complaints, even if the scrip came too late, even if the patents to their lands also came too late, I say that was no reasons why they should resort to arms. They should have done like the rest of the population in this country. Are hon. gentlemen going to tell me that during the whole of their administration the people of this Dominion were satisfied? There was a cry from one end of the country\nto the other that the National Policy should be introduced into this country. But they would not do it; and the consequence was, that poverty was becoming general, from one end of the Dominion to the other, but still the people did not resort to arms. They appealed to the Government, and when an election came around they took the remedy into their own hands. Mr. Speaker, I do not intend to allude to the commission of Messrs Street, Goulet and Forget, which was appointed a few days after the uprising in the North-West, and which, if we are to judge from the account of Le Manitoba, is giving so much satisfaction. The leader of the Opposition the other day quoted the conclusion of that article of Le Manitoba, stating that it was a great pity that this commission was not appointed a long time ago. Well, I will not take my authority from a newspaper article written since the rebellion began, but I take my authority from public documents, which show that the Government have really acted for the best. Now, I pass to the other articles of the Bill of Rights of the half-breeds, at their meeting at Prince Albert, in September last. Article 8 says:\n\n\"Contracts for Government works should be, as far as possible, given to the people in the Territory, in order to encourage them and to increase the circulation of money among them.\"\n\nWhat just complaints can they have in this respect? The contracts for work are given in the North-West Territories, as everywhere else in the Dominion, by public tenders, and there is no reason why the Government should change its policy in that respect. If the people residing in a locality cannot tender successfully with the residents of the older Provinces, the Government cannot be blamed for that.\n\n\"Article 9. That the Canadian Government should feed the Indians, and not offer to the christian world the spectacle of a people dying of starvation. If the civilisation of our century does permit it, and if the Province wishes it, the Government should make the Indians work about as much as Pharaoh did the Jews; but, at all events, they should not leave them a victim of hallucination and in the delirium of starvation. They do not wish the people to talk with the Indians, but the Indians are all the time around the half-breed establishments. The half-breeds and other settlers spend more for the Indians than the Government does, and the people are going to be prevented from mentioning this state of things. It is not just that the Federal Government should administer Indian affairs.\"\n\nIt is perfectly plain, after the exposure I have made of the policy of the Government towards the Indians, after everything the Government has done for them, after the millions of money we have spent to feed them and instruct them, it is plain that whoever framed this article of the Bill of Rights did not know what the Government had done for the Indians. It must be remembered there is no complaint\nin this article of the Bill of Rights that the Indians have not received their supplies, that the quality was bad and that they were hardly used by the officials. The 10th article of the Bill of Rights contains a demand for educational institutions. The answer to this is, that to-day there is a complete organisation in the North-West for the education of the youth. At the time Bishop Grandin applied to Minister of Interior for a grant there was no such organisation. But since 1876 there has been a board of education, comprised of six Protestants and six Roman Catholics, and the Government, on their representation, have granted such aid as in their opinion might be necessary. Therefore, the matter referred to in this article will be dealt with as it is in the older Provinces, under the constitution of the North-West. Article 12th of the Bill of Rights demands the erection of the districts in the North-West into so many Provinces. They claim that they should become Provinces when they obtain the same population as Manitoba possessed at the time of its entry into Confederation, and besides that this erection of districts into Provinces should be accompanied by all the advantages of responsible government and the administration of the Crown lands. I have already alluded to this matter while dealing with other portions of the Bill of Rights. That is a portion of the articles of the Bill of Rights which is most unreasonable. Not only do they want the North-West to be erected into Provinces, but the half-breeds want to have as many Provinces as there are districts. We have to-day five districts, Keewatin, Alberta, Assiniboia, Athabaska and Saskatchewan. Therefore, there would be five new Provinces to be established. We are, therefore, asked to increase the burden of taxation on the older Provinces to the extent of $400,000 or $500,000. And, what is more, the half-breeds want to keep all the lands in the North-West to themselves. We have constructed a Canadian Pacific Railway round Lake Superior to the Pacific Ocean, with a view to opening up that immense Territory, embracing a couple of billion acres of lands, and now that the railway is practically built, the people of the North-West, and among others, the French half-breeds, say: \"We want all the districts to be turned into Provinces; we want subsidies from the old Provinces; we have got railways and land offices, and you are going to take care of the Indians, and we are going to take the last possible assets which the country can possess, and that is the land.\" A pretention of that kind is simply absurd. I have passed over every article of the Bill of Rights as adopted by the half-breeds at a meeting at Prince Albert in September last, and hon. gentlemen opposite will notice\nthat it does not contain a complaint about surveys, in regard to which subject so much capital has been made. There is not a complaint in regard to surveys from the half-breeds along the river, where it is said great tyranny has been committed by the present Administration, so much so, that the half-breeds at that time had sufficient reason to resort to arms. Is it not astonishing that during their last protests, their last declaration of rights, detailing their list of grievances, there is nothing said about the surveys of the river lots? I might perhaps stop at this stage of the discussion; but it will be as well to consider what the white settlers were demanding. Meetings were held, not only at Prince Albert, but all over the North-West Territory. There was a meeting of the inhabitants of the Province of Alberta. I find the resolutions published in *Le Manitoba*. I have not been able to get an English copy, so I will translate them. It will be sufficient to mention the pretended grievances, the articles of the Bill of Rights of the white settlers of Alberta, to show that most of them are unfounded:\n\n\"The undersigned have the honor to represent that questions of the greatest importance, and worthy of the special attention of the Government, arise from that portion of the North-West, and more particularly from the district of Alberta. The undersigned hope that the Government will give all these questions the most serious consideration:\n\n\"1. There is not sufficient police stipendiary magistrates in the North-West; the judicial districts are too large, and, consequently, do not provide sufficient tribunals. This evil has been increased by the fact that under the Act respecting the North-West Territories cases appealed must be laid before the sitting judge, and decided by the same judge.\"\n\nSuppose there were not enough stipendiary magistrates, the Government have this Session introduced a Bill to give an additional magistrate to the North-West.\n\n\"2. The people are of the opinion that you must remove from the officers of the Mounted Police every judicial power, and that resident judges shall be named for all the principal towns and cities in the North-West.\"\n\nThat is more as regards the administration of justice than is provided for the older Provinces—a judge resident in every principal centre of the North-West Territory. I do not believe that the people of the older Provinces would be willing that we should tax ourselves in order to concede this extraordinary demand, and have a judge resident in every principal centre of the North-West Territory.\n\n\"3. We know that it has been decided that the stipendiary magistrates have no power to issue a writ of *habeas corpus*, and, therefore, in this district we are deprived of one of the greatest safeguards of British liberty.\"\n\nI am sure that whoever drew up this Bill of Rights of the population of the Province of Alberta was not a lawyer.\nWhether there is a statute declaring that a writ of habeas corpus may be issued in the North-West Territories or not—I believe there is one, but suppose there is not—by the common law of England every British subject deprived of his liberty on British soil has a right to a writ of habeas corpus. That is too elementary a principle of law to be open to any doubt.\n\n\"4. In cases of intoxicating liquors, the fact of one half of the penalty being given to the informer has a bad effect. A man may be imprisoned on the oath of that sole informant, and this state of things has been the cause of numerous and grave acts of injustice. There have been many perjuries committed in this respect. This abuse exists among the constables of the Mounted Police, as one of them had made two hundred dollars in a day as informer—one-half of the penalty imposed on two persons. However, the defence denied to the accusation brought against them by the informer, and the two were condemned, although respectable.\n\n\"5. The police have abused their right to make inquisition as to the use of liquor; and no police officer should have the right to enter a private house for the purpose of ascertaining whether there are intoxicating liquors in it or not, unless there has been a sworn information previously made to that effect.\"\n\nWell, this law is based upon the principle of penalty laws in the old Provinces. In all the old Provinces the policy of this Government, sanctioned for years and years, has been that one-half of the penalty, even in cases brought for the infraction of the liquor laws, should go to the informer, and the other half should go to the Crown.\n\n\"6. The stealing of horses is very common here, and there is very little effort made to pursue the guilty parties. The thieves go south by McLeod's road, and there the police cannot reach them before they go to the United States. A telegraphic line, as far as Fort McLeod, would prevent a good deal of the stealing of horses, and would also be of great use to the Mounted Police.\"\n\nThe telegraph line has been built since that time.\n\n\"7. The settlers of the neighboring districts are asking for their patents, and they complain when they would make their homestead entries for townships 23 and 24, range 1, west of the 5th principal meridian, and in these districts there are a large number of settlers. The natural consequence is that the neighboring country is in statu quo, and will remain in that condition as long as these townships are not open to settlers.\"\n\nThese lands were surveyed only last year, and, necessarily, a few months must elapse before the land office is ready for entry, but I believe it is ready now.\n\n\"8. We believe that a court of appeal should be established in the North-West Territories, and that an extension of the powers of the court of first resort, held by the stipendiary magistrates, should be made, and more facility given for appeals from the magistrate's to the court of appeals in all cases where the contract exceeds $200.\"\n\nNow, here is another demand which is unreasonable.\nUnder the constitution of the North-West, passed in 1875, a court of appeals was established for the North-West Territories, not sitting in the North-West Territories, but sitting in Winnipeg. There is a court of appeal for Manitoba, and with a view of saving expense, considering the large amount which the country had to spend in developing that vast country, this Parliament thought proper to give the right of appeal, in cases in the North-West Territories, to the court of appeals of Manitoba; and in every case where there is a question affecting real estate, or in any case for damages or torts for $500, or in all cases in which there is $1,000 in dispute, there is appeal to the court at Winnipeg. Considering that the means of communication are so easy today, from every portion of the North-West Territories, and especially from Calgary, from which this complaint comes, it seems to me that this complaint is without foundation.\n\n\"In the interests of justice, we believe that a prison and court house ought to be erected in Calgary. The building now used as a prison is altogether unfit for that purpose, and there is no place for the detention of criminals. Furthermore, we have been informed that the North-West council has refused to pass ordinances to arrest any one about to leave the country, and that because there is no jail, in order to detain the fleeing debtor or criminal. Last year the building which served as a prison was almost constantly full of prisoners, and as Calgary is the centre of the district, and near the Rockies, where the works of the Canadian Pacific Railway are proceeding, and where mining is being pursued with activity, the construction of a prison is an immediate want. In Calgary, also, there is need for a court house building, wherein to hold the sittings of the court.\"\n\nThere is also a jail and court house built by the Government at Regina, the capital of the North-West Territories. Under the constitution of the North-West council, the council has the right to order the erection of any prison which may be required in any portion of any district; and if the people of Calgary wants a jail they should build one themselves, and ask the council for the proper authority.\n\n\"We also demand that the settlers should have the right to cut hay upon the lands which they occupy, and unoccupied lands, without being subject to pay $1 a ton. The cutting can only improve the quality; and if it is not cut it will be entirely lost. This payment of $1 per ton, although a small payment, has been a burden for the poor settlers, and is the source of a very small revenue for the Government.\"\n\nNow, if we look at the regulations of the Department regarding the cutting of hay, it is very plain that this charge or due cannot be a burden for the poor settler. This article of the bill of grievances is altogether untrue; the Government do not charge $1 a ton for cutting hay. According to the regulations, they charge, for any amount up to 20 tons, 10 cents per ton; for from 20 to 50 tons, 25 cents per ton; for from 50 to 100 tons, 50 cents per ton; and for 100 tons and over, $1 per ton. Besides that, every settler\nis allowed to take all the hay he wants for his own use free. To show that this grievance has really no foundation whatever, let us look at the report for 1884. The amount collected by the Department for all the hay permits in the North-West during the year, amounted to the large sum of $120.20.\n\n\"We demand the liberty to cut large quantities of wood, because today we cannot get enough in order to build even a good stable, and a settler who has no considerable resources is unable to procure one.\"\n\nThese are the regulations of the Department for cutting wood:\n\n\"Any occupant of a homestead quarter section having no timber of his own, may, upon application, obtain a permit to cut such quantity of building timber, fencing timber or fuel, as he may require for use on his homestead, not exceeding the following:—1,800 lineal feet of house timber, no log to be over 12 inches at the small end; 400 roof rails, 30 cords of dry wood, 2,000 fence rails.\"\n\nThen, there are permits subject to dues, in order to preserve the forests. The rates are as follows:\n\n| Item                                      | Rate     |\n|-------------------------------------------|----------|\n| Cordwood, per cord                        | 25 cents |\n| Fence posts, 8 ft. 6 in. long each         | 1 cent   |\n| Telegraph poles, 22 ft. long each          | 5 cents  |\n| Each lineal foot over 22 feet long         | 1 cent   |\n| Railroad ties, 8 ft. long                  | 3 cents  |\n| Rails, 12 ft. long                        | $2.00 per M. |\n| Stakes, 8 ft. long                         | $2.00 per M. |\n| Shingles                                   | 0.60 per M. |\n| Square timber and saw logs of oak, elm, ash or maple | $3.00 per M., B.M. |\n| Pine, spruce, tamarack, cedar, and all other woods, with the exception of poplar | $2.50 per M., B.M. |\n| Poplar                                     | $2.00 per M., B.M. |\n| All other products of the forest, not enumerated | 10 p. c. ad valorem |\n\nThe timber dues collected by the Government last year amounted to $193,196.86; and we may almost say that, with the exception of the revenues collected by the Department from the sale of lands and Customs Dues, this constitutes about the whole of the assets. Finally, the last article of the bill of grievances says:\n\n\"We demand that the territories of the North-West be represented in Parliament before the erection of the Provinces, as is the case with regard to the territories of the United States.\"\n\nIt has been observed that the half-breeds do not demand representation in this Parliament. But I believe it has been recognised for some time that this demand is reasonable, and that steps have already been taken by the Government—in fact, were taken before the rebellion broke out—with the view of giving the North-West Territories\nrepresentation in the Dominion Parliament. A bill was introduced, providing for the taking of the census of the North-West Territories; and, of course, we must wait till that census is made, in order to learn the exact number of members to which the North-West Territories are entitled. There is also another difficulty. We know that in 1871 doubts were expressed as to the power of the Government of the Parliament of Canada to erect territories similar to those in the United States, and an Act was introduced into the Imperial Parliament to give that power in expressed terms. That Imperial statute also gives the Dominion Parliament power to give representation to the Provinces which may be erected out of the territories in the North-West; but there is no power given by it to the Dominion Parliament to grant representation to the Territories so long as they remain Territories. Therefore, some steps must be taken to have the constitution amended by the Imperial Parliament in that respect; and I hope that between now and the next Session of the Imperial Parliament, while our officers will be proceeding with the census of the North-West, this Government will take initiatory steps towards having our constitution amended, so as to permit us to give the North-West Territories representation in this Parliament, according to their population. Now, I have mentioned the grievances of the half-breeds and of the white population of the district of Alberta. Now, let us see what are the grievances of the district of Assiniboia. A meeting took place at Moosomin, at which the following resolutions were adopted, which I find reported in the Saskatchewan Herald of the 9th of January, 1885:\n\n\"That large tracts of land have been allotted to colonisation companies, subject to certain duties and conditions, and which would be of advantage to the country if carried out in good faith. This meeting is of opinion that the principle of allowing individuals or companies to control large tracts of public land is prejudicial; they would therefore urge strongly that where such conditions and duties are not being carried out faithfully the grants should be promptly cancelled.\"\n\nThe principle of colonisation companies in good faith is here admitted, and the Government has taken steps, a few years ago, to see that these companies were kept within their obligations, and I believe an inspector, Mr. Stephenson, a former member of this House, was appointed for that purpose. I know, of course, in consequence of the hard times several colonisation companies could not comply with the terms, and have been forced to give up their charter. If any cannot comply with the terms of their agreement they should be forced to do so.\n\n\"That the policy of the Government in building the Canadian Pacific Railway as a national work, and assisting it to an early completion,\"\nmeets with our hearty approval, and will, we believe, be of incalculable benefit to the Dominion; that the policy of making free grants of land to branch lines is in the interests of the North-West; but as these assisted lines run mainly east and west, this meeting strongly urges upon the Government the absolute necessity, in the interests of the various large settlements north and south of the Canadian Pacific, that the same liberal policy should be adopted towards lines judiciously located running north and south.\n\n\"That this meeting recognises the fact that the practicability of the navigation of Hudson's Bay and Straits has been amply proved. That the construction of a railway to some point on the shores of Hudson's Bay, to meet the ocean traffic there, would give an outlet and inlet for exports and imports between this country and the European markets, which would not only enable the settlers here to procure a better price for their products and obtain their necessaries at a cheaper rate, but which is an absolute necessity, to enable this country to take her place in the first rank of wheat-producing countries in the markets of the world.\n\n\"That this meeting urges upon Parliament the justice and necessity of giving representation in the Parliament and Senate of Canada to the people of the North-West Territories; that we believe there are not less than 125,000 people in the North-West Territories, 95,000 of which are in the provisional district of Assiniboia; that in order to an effectual and just representation, four members should be given to Assiniboia and at least two members each to Alberta and Saskatchewan, and that provision for such representation should be made at the coming Session of Parliament.\n\n\"That we are not in favor, in the meantime, of a division of the Territories into Provinces, for purposes of Government, but one Local Government for the whole of the North-West Territories will, in our opinion, best suit the requirements of the people; and that no alteration should be made in the eastern boundary of Assiniboia.\n\n\"That the timber regulations should be amended, so as to give homesteaders absolute control of all dead and dry timber upon their homesteads, and the people generally free permission to use the dead and dry wood found on Dominion lands.\n\n\"That the Government should promptly recognise the claims of half-breeds, as was done in the Province of Manitoba, and thus determine a question calculated to disturb the present development of the country.\"\n\nThese are the grievances that were complained of by the whole population of the North-West, half-breeds as well as white. I have read in the newspapers of other complaints. I have read of railway monopolies, complaints against land regulations. On the 24th November, 1833, the Globe thus commented on a letter which appeared in it the day previous:\n\n\"Our correspondent, whose letter we published yesterday, states once more the grievances of which the settlers in the North-West complain. They are burdened with monopolies, burdened with enormous taxation, harassed and worried by land regulations which are as absurd, in some respects, as they are unjust in others, and rendered almost desperate by misgovernment. From some districts it is almost impossible to get the wheat to a market. Those who do reach a market find that, owing to railway monopoly and to an elevator monopoly which has lately been added to all the other grievances, they can get no more than 60 cents, instead of the 90 cents which it should now be worth. The complaints of settlers, while they came from individuals, were unheeded at Ottawa.\"\nAll these grievances which have been repeated for week after week and day after day in the Globe and the Grit press of Ontario, are not to be found expressed at the meetings which took place, either at Alberta or the Assiniboia or Saskatchewan districts, and the reason is, that they have no foundation whatever. I wish to be sure upon this point, and I hope it will be sufficient for me to quote the Minneapolis Canadian American:\n\n\"Canadians, who are in such a dreadful stew over the rates charged by the Canadian Pacific Railway, would perhaps be a little more moderate in their criticisms if they were aware of the freight charges of the Northern Pacific. It is a fact that Union Pacific rates for the same distances are 15 to 30 per cent. higher than those of the Canadian line.\n\n\"In charging extortion upon the north-western railways, a great deal of recklessness is displayed by the public. The operating expenses of such roads as the Union Pacific, Canadian Pacific Railway, and St. Paul, Minneapolis and Minnesota, are at least 75 per cent. higher than those of eastern lines.\n\n\"They have not a concentrated traffic, such as the Grand Trunk or roads between Minneapolis and Chicago have, to command, and, moreover, their traffic may be said to be all one way, as the cars which carry their wheat east return to them empty, a fact that increases the cost of transportation.\"\n\nNow, as to the land regulations, perhaps it would not be necessary I should say anything on this point, because really there were no complaints at all these meetings. To show how affairs of the land regulations are managed across the line. I may, however, quote from Senator Plumb's speech of the 7th April, 1884, in the Senate. He said:\n\n\"Mr. Macfarland, the United States commissioner of the land office, published his report in October last. He stated that one of the well-grounded complaints made against their management of land affairs was that patents are not issued promptly, and the evil had grown to such enormous magnitude in the United States that he was obliged to ask Congress to give him a hundred extra clerks to bring up the arrears.\n\n\"A comparison between the homestead policy of Canada and the United States will show which is most favorable to settlers:\n\n**CANADA**\n\n\"The head of the family, or any male person not less than 18 years of age, is entitled to a homestead entry.\n\n\"Such entry may be for any quantity not exceeding 160 acres in any land open therefor, on about eighty millions of the most fertile lands, being free for selection until the first of January, 1886. The settler will have the right of pre-emption of an adjoining tract of the same extent as his homestead, which he can purchase at the end of three years at Government prices. He obtains a patent at the end of three\n\n**UNITED STATES**\n\n\"Any male person not less than 21 years is entitled to a homestead entry. Such entry may be for any quantity not exceeding 80 acres in the first or $450 class, or 160 acres in the second or $150 class of lands open therefor. The homestead settler has not the right of pre-emption. He obtains a patent at the end of five years' residence and cultivation. He cannot have a second homestead entry. He may commute, by purchase, after one year's residence, but it is recommended that this privilege be modified and restricted.\"\nyears' residence and cultivation. He may have a second homestead entry, and a third and fourth. He may commute, by purchase, after one year's residence.\"\n\nNow, I will close these quotations as to the land regulations of our Canadian Government in our North-West by an extract of a recent interview which a well-known gentleman, occupying at one time a high office in the United States, had with a reporter of the Montreal Herald. This gentleman is the hon. N. G. Ordway, of Concord, N. H., ex-Governor of Dakota. Here is the report of the interview, and, as this opinion is expressed by an American, I think it will not be without interest to quote it in full:\n\n\"I left Boston six weeks ago, on business connected with the New Hampshire Land Company, who have in view the purchase of a large tract of land in the North-West for cattle raising and breeding. The company are already large owners in Nebraska and Dakota of lands purchased by myself three years ago. To say that I was astonished at the fertility of the country I visited in Manitoba would be putting it mildly. In common with many Americans, I had always entertained the opinion that the lands were situated too far to the north to be of very much use to the agriculturist. I find myself very much mistaken. The wheat belt of the North-West is in every respect equal to that of Minnesota, Dakota or Iowa. There is one advantage which the Dominion possesses over the United States, and that is in respect to their homestead laws. Another cause which contributes to the advantage of the Dominion, and tends to injure the United States in the eyes of intending emigrants, is the Alien Land Law, passed at the last session of Congress. The passage of this law was, to my mind, a grievous error, as it will tend more than any other dozen causes to retard emigration to the States. No one can question the fact that the Canadian North-West is a great country, both in extent and as regards its possibilities. It has a glorious future before it. With its great through line—the Canadian Pacific Railway—racking from ocean to ocean, an extent of country and trade has been opened up which will be almost without limit. This great railway is one of which all Canadians should be proud. Certainly no other country can claim an enterprise of equal magnitude. I found the road much better built than I anticipated it could have been, when one considers the disadvantages the company is said to have labored under. The roadbed is admirable and the construction throughout excellent. As an American, I, as is perfectly natural, think that within the borders of my own country is to be found the finest land the sun ever shone upon, but I am not blind to the fact that in the opening up of the Canadian North-West an area of country has been presented to the intending emigrant and settler which is equal to anything I have ever yet seen, and which possesses many advantages to the settler which we, south of the border, can no longer offer.\"\n\nThis opinion was expressed only a few days ago. I have said, in the course of my remarks, that I would quote the opinion of the local press, as expressed before the rebellion, to show that the Government had no reason to expect anything like the uprising which took place in the month of March. Le Manitoba, of the 22nd June, 1884, speaking of the arrival of Father Lacombe with the nuns in his charge en route for the High River Mission, said:\n\"Whatever the sensational press may say, the most perfect security reigns in the prairies, and nothing could disturb it. The settler has more security there than in any station of the American railway.\"\n\nOn the 10th of July, 1884, a correspondent from St. Laurent to Le Manitoba says:\n\n\"All is quiet here, and the large clouds which appeared on the political horizon have about disappeared. It is the result of the meeting held at Batoche, in the month of May last, by the Hon. Lieutenant Governor Dewdney.\"\n\nLe Manitoba, of the 19th March, 1885—a few days before the rebellion took place—I think the first news we had of the uprising, was on the 23rd March—said:\n\nMR. RIEL AND THE HALF-BREEDS.\n\n\"Despatches transmitted from Prince Albert to the newspapers of Manitoba bring us the sensational news that Mr. Riel, at the head of the half-breeds of that district, is preparing for an uprising, in which, it is said, the Indians would take part. The English population, it is said, asks arms for its defence, in case of an attack.\n\n\"If this news were not of a nature to cause an immense damage to our country, in leading to believe that we are in a constant state of rebellion, we would not give it any attention; but as the foreign newspapers, always eager for sensational news, will hasten to reproduce the above, we believe it to be our duty to say: That no trouble is to be apprehended from the half-breeds in the North-West. It is true that discontent exists among them, which are in most cases based on legitimate reasons, but the cause of their grievances is seriously engaging the attention of the Government, and they promise to remedy them as soon as possible.\n\n\"Now, that there is some agitation, some meetings, even too violent, speeches, it is possible. Certain individuals think that justice cannot be obtained without grumbling, complaining or lamenting. It is their way of acting. But from that to a rebellion there is a great distance. The thing, moreover, would be so ridiculous that it is impossible for us to believe that our friends from that district would have the least idea to compromise themselves to that extent, even if they were so advised by those who ought to know better.\"\n\nThe Saskatchewan Herald of the 12th July, 1884, says:\n\n\"That Riel has come in, on the invitation of his friends, to be their leader, is freely admitted; but no declaration has lately been made as to what they want. It is a suspicious circumstance, however, that immediately following his arrival in the country threats of armed rebellion should be indulged in, and that stories of the co-operation of Indians should be put in circulation, as they now are. We do not believe these rumors will lead to anything. The people are under no disabilities that cannot be redressed by constitutional means. To incite the Indians to acts of violence for purposes of revenge for real or fancied wrongs is a thing that will not be permitted by the Government or the settlers.\"\n\nNow, let us take the representation of the North-West council at its sitting of the 2st of July, 1884. Mr. Dewdney, in his opening speech said:\n\n\"As we now have members from almost every district in the Territories who must be thoroughly conversant with the feeling on this most important question, I shall ask you to assist me with your advice and experience, in making representations to the Federal Government. I should not have touched on this question, which is one solely within the\nprovince of the Dominion Government, had I not felt it was one of paramount importance. From what I have seen myself, during my travels in the spring, and from what I gather from the correspondence which reached me as Indian commissioner, I can confidently say that our Indians generally are more contented than they were since the treaty was made, and the progress they are making in agriculture is most gratifying. It cannot be expected that with a population of some twenty thousand Indians scattered on reserves, in bands all over the Territories, we can escape without a little trouble, and, at times, excitement; and this is inevitable when Indians fresh from the plains are first brought on their reserves and come in contact with white settlers. It has been so with those who are now comparatively well off, and will be so until the new arrivals recognise the facts that they must settle down and work and make a living; but that there is any cause of alarm, I deny. I am sure the general feeling is one of security, and the exaggerated reports which have been circulated are to be regretted.\n\n\"You will have learned that the representations made by you to the Dominion Government have received attention, and many of the requests made acted upon, while others are under consideration. I am quite sure that should you feel the necessity of making further representations during the present Session, they will receive the same consideration at the hands of the Dominion Government.\"\n\nNow, if grievances had existed of such a magnitude as to create a rebellion, would not some of the distinguished visitors to the North-West last summer have made some mention of it? In the first place, Manitoba and the North-West were visited by the Minister of Public Works. The Free Press, of Winnipeg, and Le Manitoba, of the 11th September of the same year, contain a statement that:\n\n\"The Minister of Public Works had come, with the sanction of the Government, to know the wants and feelings of the people and their grievances, if grievances they had. They might be sure that their grievances would be well weighed at Ottawa and that justice would be done.\"\n\nOnly one interview was mentioned by the leader of the Opposition, which some of the half-breeds had with the Minister of Public Works, and what answer did they get? Did they get an answer that they would be treated like white settlers? The Minister of Public Works answered that their claims would receive favorable consideration as soon as he will reach Ottawa. Now, Mr. Speaker, upon this invitation of the Minister of Public Works, the Free Press made some remarks. It pointed out to the Minister some grievances, and asked him to visit south-western Manitoba, where he would hear of some complaints. But no allusion is made to the grievances which existed, if any existed, in the North-West Territory. Manitoba and the North-West were also visited by Sir Richard Cartwright, the member for South Huron, and by the hon. Mr. Mackenzie, the member for East York, at the same time. A banquet was offered to Mr. Mackenzie, at Winnipeg, and an address was read to him by the Liberals of that part of\nthe country. This address is dated on the 2nd of September, 1884; and says, among other things:\n\n\"We have a country unsurpassed in climate, fertility of soil and other natural advantages, but its development is retarded by a fiscal policy unjust to this portion of the Dominion. We feel that in this matter, and in the policy of the Dominion, with regard to our public lands and our provincial railway legislation, we have been treated without a fair regard to our peculiar position and our rights to an equality with the other Provinces of Canada. We wish to draw attention to the necessity for such assistance to our railway enterprises as will promptly develop this great country, and for such an increase in the representation of Manitoba and the North-West in the Parliament of Canada as will insure greater consideration for our interests.\"\n\nNow, Mr. Speaker, these Reformers of Manitoba and the North-West complain of the National Policy, but the half-breeds of St. Laurent and the white settlers of the North-West did not make any such complaints. Do we hear anything of the grievances of the half-breeds, or even of the white settlers, which have been mentioned at their meetings? Not a word. The Hon. Mr. McDougall also visited Winnipeg about the same time. Some of his admirers also gave him a banquet. The whole subject of the conversation and the speeches turned upon Manitoba and the North-West. I have seen the reports of the speeches which were delivered on that occasion, and not a single reference is made to the grievances of the white settlers, or of the half-breeds of the North-West, laid down by the meetings which I have mentioned. But there is more. Mr. Dewdney visited St. Albert on the 16th October, 1884. The report of his visit is given in *Le Manitoba*, of the 7th of November of that year: Several addresses were presented to him by the citizens, and Monseigneur Grandin, in the name of the clergy, containing sentiments of loyalty to the Canadian Government and Canadian institutions. A banquet was even tendered to him at the Bishop's Palace. A committee of citizens, with Mr. E. Maloney at their head, met the Lieutenant Governor, in order to make certain requests of him in the public interest. They asked, first, the purchase of a bridge on the Red River, and to make it a free bridge. They also ask that those portions of the supplies intended for the Indians should be bought in the district, where they could be supplied more advantageously than in any other place. They said His Honor promised to take into consideration their demands, and do everything he could to satisfy them. Not a word was said during that meeting, held only a few months before the rebellion, against the Government; nothing but praise and admiration for the policy of the Government. Something was said last night by the leader of the Government of the action which the white settlers in\nthe North-West have taken in this rebellion. I believe that the white settlers, I do not say the whole of them, but some of them, and they include parties acting on behalf of American colonisation companies, had more to do with this rebellion, of the spring of 1885, than the half-breeds and Indians. Let me read to you an article from the Globe, of 21st November, I will not say 1884, but 1883, and this article is only a sample of numerous inflammatory articles which, from time to time, have been published by that newspaper. It is as follows:\n\n\"The American press is already holding out to our distressed brethren active sympathy and promise of help. In one day's exchanges we find nearly a dozen of the most influential papers of the Union telling the people of Manitoba they must break with the Dominion, which is treating them scandalously. Let there be no more of ostrich-like tucking of the head in the sand and refusing to see what is patent to every body. The organisation movement of Manitoba means business. It means that justice must be done. Ottawa methods must be revolutionized, and that quickly.\"\n\nA letter from a special correspondent of the Globe at Winnipeg is headed \"Manitoba troubles. Discontent coming to a head in the prairie Province. Result of a series of blunders. The farmers will have their rights by some means. Down with monopoly. Threatening to burn elevators and tear up railways. The situation very serious.\" The correspondent says:\n\n\"All through the controversy which has been raging in regard to the Government of this country no newspaper has displayed a fuller knowledge of the requirements of this country than the Globe, nor has it gone beyond the mark in predicting that, unless good government be at once vouchsafed to us, our position in Confederation will every day become more a matter of form, and that finally we will shake ourselves loose from the monotonous burden and seek some more congenial government. There is no doubt that the Canadians are a loyal people; they love their institutions and their traditions, but they are common-sense people as well, and will not allow their generous sentiments to be used against them, to compel them to sit still while other loyal people are steadily accomplishing their ruin.\n\n\"The day has gone by when, by a peculiar perversion, forms of government were worshipped for themselves, and every Canadian, at any rate, has learned that Governments are made for the conveniences of men, and not men for the glory of Governments. The day has come when the lumbering blue mould appendages of Government must be scattered to the four winds, and when a system of government is chosen like a particular kind of reaping machine—because it is the best for the purposes for which it is required, and for no mysterious or awful reason whatever. This is especially the case in Manitoba and the North-West. The country is young; the population is made up of all nationalities; people have come here to make money. We are independent of the eastern Provinces. We are not independent of the United States.\"\n\nI shall now close these very long remarks, which have been much longer than I should have liked to have made them. I am not in the habit, as every member knows, of making long speeches. In fact, I very seldom trouble the House\nwith speeches or remarks. I have been long on this occasion, it is true, but everyone will admit that the subject is important, everyone will admit, moreover, that is new. I have not been as long as the leader of the Opposition, who spent seven hours, and did not touch the Indian question, an important element in the examination of the whole case. I cannot close these remarks without making an appeal to the Government, which, I hope, will receive their favorable consideration: it is to exercise its clemency in favor of the prisoners now confined at Regina. I have just pointed out that those poor half-breeds and Indians are not, after all, so much to blame as the great organ of the Liberal party in this Dominion. I do not want to make any reference to any special case. I have carefully refrained from making any remarks with respect to Riel which might injure his position. I do not make any special appeal, but on behalf of all those prisoners I ask that the Government should exercise clemency. We have a good example of clemency in a Government which has not so well treated the Indians as has the Canadian Government or the British Government. Some few years ago, when Sitting Bull was induced to return with his warriors to his reserve in the United States territory, what was done? A Métis—Jean Louis Légaré—for it is always known that half-breeds have great influence over all Indians—was charged by the United States Government to bring back the Sioux Indians who had committed so many depredations, murders, assassinations and massacres; and not only were the members of Sitting Bull’s band pardoned, but Sitting Bull himself was pardoned, without any condition. And today he is on his reserve in American territory, an Indian just as peaceful as any citizen in the American Union. To sum up the facts of this case: We are asked to vote non-confidence in this Government in regard to its policy in the North West. We are asked to vote that hon. gentlemen opposite shall come to this side of the House and manage the affairs of the country. In other words, we are asked to condemn the policy of the Government in its treatment of the Indians. We are also asked to condemn the Government and its policy with regard to the half-breeds and the white settlers. Mr. Speaker, I cannot give my vote in favor of that motion. I believe the Government deserves great praise for having established law and order in such a large Territory, which only fifteen years ago was almost a wilderness. They deserve the thanks of the country for having achieved such a great result without shedding a drop of blood. The events of the last few months, which we all\ndeplore, should not alarm us. The rebellion has been confined to a small portion of the French half-breeds and of the Indians; it has been limited to a small area, some 20 or 25 square miles. The rebels have been subdued after great loss of property and life, it is true, but law and order have been re-established, and I would say to the Government: Continue your policy of instructing the Indians of the North-West; continue to give them farm instructors, common schools and industrial schools. But I would venture, in that respect, to make one suggestion. I think it is of the greatest importance that all those instructors should have something in common with the Indians who are confided to their charge, and therefore I would say, if it is at all possible to find farm instructors or school teachers who speak the language of the Indians who are placed under them, preference should be given to them. I would go further. I would take the advice given by the First Minister in 1883, when he said:\n\n\"Well, I think I may almost ask the hon. gentleman to look into the report on these schools, where he will find their success more or less alluded to. I believe, however, that these schools are fairly successful, especially those under the charge of religious bodies, Catholic or Protestant. These are, I believe, more successful than the merely secular schools, where the schoolmasters, who are honest men and who do their duty, are actuated, of course, by a desire to support themselves and their families. The moral restraints of the clergy, both Catholic and Protestant, are greater. They are actuated by higher motives than any secular instructor can pretend to. Secular education is a good thing among white men, but among Indians the first object is to make them better men, and, if possible, good christian men, by applying proper moral restraints, and appealing to the instinct for worship which is to be found in all nations, whether civilised or uncivilised.\"\n\nI hope that the commission which is just now sitting in the North-West, entrusted with the work of satisfying the half-breed claims as to land, will not only satisfy these claims, but will also examine into the amount of indemnity which is to be paid to the settlers who have suffered in consequence of the rebellion, and ascertain the amount of damages which has been sustained by the white population, so that it may be known next Session, and a vote of Parliament given next Session. Further, I would say that I do not quite agree with the view that the half-breed must be considered either as an Indian or a white man. I believe that he should be considered as he is, as the connecting link between the Indian and the white; and therefore I hope the Government will see fit to give to these half-breeds some of the advantages which have been given to the Indians—some of the grain and seeds and agricultural implements which they require, in order to become familiar with agriculture. Now, I have\nonly one more remark to make. It may be said that the half-breed families in the distressed districts are not worthy of consideration. Mr. Speaker, I believe there are many half-breeds in that district who were loyal to the Dominion Government and to Dominion institutions; but I say, whether they were or not, I hope the Government will not forget the women and children who are homeless in that district, but will do something to save them from actual starvation. A letter has just been published in the Mail, by Father André, who says:\n\n\"What a sad sight met my eyes the other day, when I visited this same parish of St. Antoine! The cottages which I had admired so much last year were most of them burned down to the ground; those standing were nothing but a wreck, with windows and doors broken. The fields and gardens lay waste and uncultivated; cattle and horses were gone; a few only remained, as the taking of them away was not worth the trouble. Everywhere I went I met with fearful evidence of wretchedness and poverty. It was a hard trial for me to bear. A good many houses were tenantless; the owners were dead or gone away; and as I saw all the ruins about me, I could not stop my tears, so heavy was my heart with grief. Who could help not to be moved with compassion in seeing those poor and unfortunate women, surrounded by their children, coming to meet me and to shake hands with me? They formed a perfect picture of squalor and desolation, in tatters, and broken hearted. The little children did not present a less pitiable appearance. They were there standing before me, crying to their full heart, and telling me all the sad misfortunes which had befell them. They had lost all their clothes at the sack of Batoche's, and when they came back home they found all their furniture smashed in pieces and their dwellings left with the bare walls. There they were, destitute, and starvation staring them in the face, unless help be near at hand.\" Add to this that these poor women were most of them mourning for their dead sons or husbands, or for husbands and sons lying in prison at Regina, waiting for trial, and you can conceive how much these unfortunate people deserve our compassion.\"\n\nNow, I have only to state what appears to me to be a necessity in the North-West. The Mounted Police force have shown its usefulness; no doubt a guard of some kind is necessary for the protection of the white settlers against the attacks of the Indians; but I question whether we could not really form a better body of men than the Mounted Police force, composed of picked men from the Mounted Police, the militia of the country, and, I would also add, from the half-breeds. In a recent correspondence to the Mail newspaper from St. Boniface, I read:\n\n\"What a pity it is that the Dominion Government cannot see its way to forming a corps of Métis for service as police on the plains! General Middleton can bear testimony to their valor and endurance; and I am sure the gallant troops also will give them a just measure of praise. At Edmonton a small force of loyal half-breeds, organised under the direction of Bishop Grandin, is doing splendid work, the men being unequalled as scouts. A division or two of Métis would greatly strengthen the North-West Mounted Police, and help to restore the prestige of that body among the Indians. The question is certainly worth the consideration...\"\nof the Government. Father Dugast, of this archdiocese, has collected, in book form, many admirable stories about the Métis, which the Ottawa officials in charge of the police should read. They would convince them, if, after recent experience, they need convincing, that there is no better raw material for a mounted infantry man than the half-breed.\"\n\nNow, I would ask the white settlers to have a little patience. They should not forget all the sacrifices the old Provinces have been making for them; they should not forget that for the last ten years all the resources of the country have been devoted to the development of that country; they should not forget that we have spent millions and millions for the purpose of building the Pacific Railway, for carrying on surveys throughout that vast territory, and for opening up registry offices and land offices; they should not forget that we have suspended the great public works of the old Provinces on this account, for instance, the enlargement of our canals. No doubt they have some grievances, we have some in the old Provinces; but before long they will enjoy all the luxuries of civilisation, and with a little patience and forbearance, this country will be so developed as to be a happy home for everybody, not only in the old Provinces, but also in Manitoba and the North-West.\n\nOTTAWA:—Printed by MacLean, Roger & Co., Wellington Street.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001456.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 80, "total-input-tokens": 108972, "total-output-tokens": 55564, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1832, 2], [1832, 4620, 3], [4620, 7274, 4], [7274, 9479, 5], [9479, 12277, 6], [12277, 14725, 7], [14725, 16788, 8], [16788, 19559, 9], [19559, 22262, 10], [22262, 25376, 11], [25376, 28302, 12], [28302, 30906, 13], [30906, 34059, 14], [34059, 37211, 15], [37211, 39722, 16], [39722, 42580, 17], [42580, 46480, 18], [46480, 49048, 19], [49048, 52119, 20], [52119, 54659, 21], [54659, 58246, 22], [58246, 61271, 23], [61271, 64385, 24], [64385, 67218, 25], [67218, 69916, 26], [69916, 72609, 27], [72609, 76657, 28], [76657, 79954, 29], [79954, 83637, 30], [83637, 87350, 31], [87350, 90841, 32], [90841, 93916, 33], [93916, 96815, 34], [96815, 100229, 35], [100229, 104051, 36], [104051, 107472, 37], [107472, 111005, 38], [111005, 114842, 39], [114842, 117610, 40], [117610, 121453, 41], [121453, 124831, 42], [124831, 128313, 43], [128313, 131737, 44], [131737, 135146, 45], [135146, 138325, 46], [138325, 141117, 47], [141117, 144667, 48], [144667, 147048, 49], [147048, 149813, 50], [149813, 153473, 51], [153473, 156649, 52], [156649, 159766, 53], [159766, 162496, 54], [162496, 165250, 55], [165250, 168003, 56], [168003, 170677, 57], [170677, 175006, 58], [175006, 177674, 59], [177674, 181495, 60], [181495, 184748, 61], [184748, 187514, 62], [187514, 190455, 63], [190455, 193226, 64], [193226, 196158, 65], [196158, 199227, 66], [199227, 202387, 67], [202387, 205199, 68], [205199, 208065, 69], [208065, 211702, 70], [211702, 215040, 71], [215040, 218477, 72], [218477, 221935, 73], [221935, 225088, 74], [225088, 227990, 75], [227990, 231300, 76], [231300, 233961, 77], [233961, 236937, 78], [236937, 240335, 79], [240335, 241734, 80]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]