[{"id": "7e233b544159671d79db8fddd24609305a93ab94", "text": "FARMING AND RANCHING IN WESTERN CANADA\n\nManitoba,\nAssiniboia,\nAlberta,\nSaskatchewan.\nHOW TO PURCHASE RAILWAY LANDS.\n\nRegulations for the Sale of Lands of the Canadian Pacific Railway Company.\n\nREDUCED PRICES.\n\nThe Company have decided to make a general reduction in the price of all lands listed at $1 per acre and upwards, excepting only such as are particularly valuable owing to their proximity to Stations, or to other special causes. This reduction will, in most cases, range from 25 to 33 per cent.\n\nDETAILED PRICES OF LANDS CAN BE OBTAINED FROM THE LAND COMMISSIONER AT WINNIPEG.\n\n(These Regulations are substituted for and cancel those hitherto in force.)\n\nTERMS OF PAYMENT.\n\nIf paid in full at time of purchase a Deed of Conveyance of the land will be given; but the purchaser may pay one-tenth in cash, and the balance in payments spread over nine years, with interest at six per cent. per annum, payable at the end of the year with each instalment.\n\nGENERAL CONDITIONS.\n\nAll sales are subject to the following general conditions:\n\n1. All improvements placed upon lands to be maintained until final payment.\n2. All taxes and assessments lawfully imposed upon the land or improvements to be paid by the purchaser.\n3. The Company reserves from sale, under these regulations, all mineral and coal lands, and land containing timber in quantities, stone, slate and marble quarries, lands with water power thereon, and tracts for town sites and railway purposes.\n4. Mineral, coal and timber lands and quarries, and lands controlling water power, will be disposed of on very moderate terms to persons giving satisfactory evidence of their intention and ability to utilize the same.\n\nThe Canadian Government contemplates granting bonuses to Bona Fide settlers from Europe, on lands in the Province of Manitoba and Western Territories of Canada and British Columbia, and it is recommended that Booking Agents be asked for particulars in regard to this matter.\n\nLiberal rates for settlers and their effects will be granted by the Company over its Railway.\n\nFor further particulars apply to,\n\nL. A. HAMILTON, Land Commissioner,\nCanadian Pacific Railway Co., Winnipeg.\n\nSOUTHERN MANITOBA LANDS.\n\nFor those desirous of purchasing, the LAND GRANT of the MANITOBA SOUTH-WESTERN COLONIZATION RAILWAY, recently placed on the market, offers special attractions. It consists of over 1,000,000 acres of the choicest land in America, well adapted for grain growing and mixed farming, in a belt 91 miles wide, immediately north of the International Boundary, and from Range 13 westward. That portion of this grant lying between Range 13 and the western limit of Manitoba is well settled, the homesteads having been long taken up. Purchasers will at once have all the advantages of this early settlement, such as schools, churches and municipal organization. The fertility of the soil has been amply demonstrated by the splendid crops that have been raised from year to year in that district. The country is well watered by lakes and streams, the principal of which are Rock Lake, Pelican Lake, Whitewater Lake, and the Souris River and its tributaries, while never-failing spring creeks take their rise in the Turtle Mountain. Wood is plentiful, and lumber suitable for building purposes is manufactured at Desford, Deloraine and Wakopa, and may be purchased at reasonable prices. At the two latter points grist mills are also in operation.\n\nThe terms of purchase of the Manitoba, South-Western Colonization Railway Company are the same as those of the Canadian Pacific Railway Company.\nWESTERN CANADA\n\nINCLUDING...\n\nMANITOBA,\n\nASSINIBOIA,\n\nALBERTA AND\n\nSASKATCHEWAN\n\nHow to Get There.\nHow to Select Land.\nHow to Begin.\nHow to Make Money.\n\nTHE ILLUSTRATIONS IN THIS PAMPHLET ARE REPRODUCTIONS FROM PHOTOGRAPHS.\nWESTERN CANADA\n\nINCLUDING\n\n... MANITOBA ...\n\nASSINIBOIA, ALBERTA AND SASKATCHEWAN\n\nThe Country to Settle in.\n\nTHOSE who honestly doubted, and those who wished the public to disbelieve, the reports concerning the fertility of the Canadian North-West have ceased to be heard; the first have been converted into warm advocates of the country's merits, the others are silent for very shame sake, and because no one will now believe them.\n\nThe superior quality of the wheat and other cereals grown upon these lands and the greater yield per acre, when compared with any other portions of the continent, is now universally acknowledged, and, while the crops obtained are greater, the amount of labor required to produce them owing to the nature of the soil is less than in any other country. The climate and natural pasturage are both highly favorable to stock-raising, and as a result no finer cattle are to-day shipped across the Atlantic to the English market, than those which have matured upon the plains of Manitoba and the North-West territories.\n\nIt is no longer a question whether it is a good thing to go to the Canadian North-West, but simply in what part of that great country it will be best to make a home.\n\nThe following extract is from an article published in August, 1891, in the New York Sun, one of the principal papers of America, and a journal that does not often say complimentary things of Canada:\n\nA Land of Wheat.\n\nTHE Pacific express on the Canadian Pacific Railroad went west one day recently in four sections with 1,500 harvest hands on board, all bound for the great grain fields of Manitoba. A slight tinge of yellow is stealing over the sea of waving green, and in a fortnight thousands of reapers will make music the livelong day as they are urged through the almost illimitable fields. We have great blessings on this side of our favoured continent, and can cheerfully yield the palm in grain culture to the great belt midway between our coasts which for ages was fitted by the slow processes of nature to give bread to the world. It is almost inconceivable to those who\ntravel for days over the plains between Winnipeg and the Rocky Mountains that here the giants of the forest once reared their lofty heads, shielding with their dense foliage the earth that is now exposed to the full blaze of the summer sun. The lake deposits, the forest growths, were among the elements that helped produce the almost inexhaustible wheat-bearing soil of Manitoba; and today her farmers are happy in the prospect of the greatest harvest they ever reaped. It is believed that the wheat of Manitoba will average forty bushels to the acre. Many farmers say that it will average forty-five bushels. Men who have seen many seasons of Minnesota wheat-raising said in Manitoba last week that they had never looked upon such wheat fields before. Those great fields stretching for scores of miles around Brandon, Portage la Prairie and Deloraine are worth crossing the continent to see. The waving expanse of dark-green verdure is most pleasing to the eye. The stalks stand as thick as they can grow, are unusually high, and the ears are proportionately long and well filled with the plumpest of grain. Our own wheat-growers will be glad that their Manitoba brethren are fully to share the blessings of this bounteous year. The Sun goes on to say, that tourists fresh from the plains of the North-West smile as they gaze on the fields of stunted grain in the Eastern States, but that many eastern farm hands will share the blessings that the west is bringing, and instances the fact that one labour agency in Winnipeg has had demands for 4,800 harvest hands, at wages of from $30 to $10 (£6 to £5) a month and board.\n\nHow to Reach the West.\n\nColonists from Europe, having arrived in Canada, are able to travel to new homes in Ontario, Manitoba, the North-West, or British Columbia in nearly as great comfort as first-class passengers. The cars devoted to the use of colonists are taken upon the same fast trains with the first-class cars. They are convertible into sleeping cars at night, having upper and lower berths constructed on the same principle as those of the first-class sleeping cars, and equally comfortable as to ventilation, etc. They are taken through, without change, all the way from Montreal to Manitoba. No other railway in America can do this. No extra charge is made for the sleeping accommodation. Second-class passengers, however, must provide their own bedding. If they do not bring it with them, a complete outfit of matrass, pillow, blanket and curtains will be supplied by the agent of the Company at the point of starting, at a cost of $2.50—ten shillings. The curtains may be hung around a berth, turning it into a little private room. In addition to this, men travelling alone are cut off from families by a partition across the car near the middle; and smoking is not permitted in that part of the car where the women and children are.\n\nAt short intervals, the train stops at stations where meals are served in refreshment rooms, and where hot coffee and tea, and well-\ncooked food may be bought at very reasonable prices. The cars are not allowed to become over-crowded, and the safety and welfare of colonists or second-class passengers are carefully attended to. The baggage arrangements are the same as for first-class passengers, and every possible care is taken that the colonist does not go astray, lose his property or suffer imposition. Where a large number of colonists are going to the west together, special fast trains of colonist sleeping cars are dispatched.\n\nNo other railway in America offers such good accommodation to second-class, or colonist passengers, as does the Canadian Pacific.\n\nThe train is met upon its arrival at Winnipeg by the agents of the Government and of the Canadian Pacific Railway Company, who take charge of colonists and give them all the assistance and advice they require in regard to their new home.\n\nIn cases where they have already fixed upon some locality for settlement, where friends are awaiting them, they are shown how to proceed directly to that point. If they have not decided upon such a locality, but intend to seek a home somewhere further west, every information can be obtained at the Land Office in Winnipeg.\n\nMost men wish to examine for themselves the section which seems to them most suitable, and this is strongly recommended in every case. They are assisted in doing this by officials appointed by the Government for the purpose. Only a very few days need elapse between the arrival of an immigrant in Winnipeg and his settlement upon the land of his choice.\n\nMeanwhile, his family and baggage can remain at the immigrant house in safety and comfort. Providing themselves with food in the city markets, they can cook their own meals upon the stoves in the house; and, with the bedding which has served them during their journey, they can sleep in comfort in the bunk-bedsteads with which the rooms are fitted. Should they prefer, however, to stop at an hotel, they will find in Winnipeg public houses of all grades, where the total cost for each person varies from $1 (4s.) to $3 (12s.) a day, according to circumstances.\n\nIt sometimes happens that the immigrant has not much more than sufficient money to carry him as far as Winnipeg. In that case he will be anxious to begin immediately to earn some money. The Dominion Government has an agency in Winnipeg whose business it is to be informed where labour is needed. Societies representing almost all the nationalities of Europe have been formed in Winnipeg, and will welcome and see to the welfare of their respective countrymen.\n\nThe arrival of a party of immigrants is always announced in advance, so that contractors who are employing men in building, railway construction, or in some other work in the city of Winnipeg or neighbourhood, may take as many of the newcomers as choose to go to work with them. Farmers are generally on the lookout for able men and pay good wages. The average wages paid are $20 (£5) per month and board. The girls of a family can always find employment in Winnipeg and other towns.\n\nCapital Required.\n\nThe question \"How much is necessary?\" is a difficult one to answer. It depends upon circumstances. Very many men have gone into the North-West without any capital and have prospered.\nA little capital, however, makes the start easier and saves valuable time. Some statements of what can be done upon a certain capital, say 500 dollars (£100) or 1,000 dollars (£200) or 3,000 dollars (£600) may, nevertheless be advantageous.\n\nThis information has been given by many writers, in tables of various kinds and for various localities; but all amount to about the same conclusion, namely:\n\nThat 500 dollars (£100) will set a man down upon some western quarter-section, either a free homestead or one chosen among the cheaper lands belonging to the Railway Company, and enable him to build a house and stay there until his farm becomes productive and self-supporting. With this capital, however, the purchase of land is not usually advisable if a suitable free grant can be obtained.\n\nIn this connection a practical farmer of some years residence in Manitoba speaks as follows:\n\n\"Land can be purchased cheaply here, or it can be had for nothing by homesteading. A single man can start on an outlay of $985, made up as follows: One yoko of oxen and harness, $115; plow, harrow, etc., $10; stove and kitchen furnishings, $10; bedding, etc., $20; lumber, doors, windows, etc., for log house, $50; provisions, $90; seed, $80. A farmer with a family of five would have to lay out $240 more, bringing his outlay up to $625.\n\nA farmer can come in about the middle of March, select his land and build his shanty; he can commence to plough about the fifth of April; he can break ten acres and put it under crop on the sod; he can continue breaking for two months after he puts the ten acres under crop, and can break thirty acres, and backset the forty acres in the fall ready for crop in the spring. He can raise enough on the ten acres to give him a start; he can cut hay enough for his oxen and a cow in July, and it will cost him about $60 additional to seed the forty acres in the spring.\n\nSuppose he puts in 30 acres of wheat, and raises only 25 bushels to the acre, at 80 cents per bushel, it will be worth $600; say 5 acres of oats at 40 bushels per acre at 35 cents per bushel, $70; say 1 acre of potatoes, 200 bushels, at 40 cents, $80; 3 acres of barley, 40 bushels per acre, worth 40 cents, $18; and 1 acre of garden stuff at $120; total $918. After deducting expenses of harvesting and the whole original outlay the farmer will still have something to the good to start with next year.\"\n\nIt must not be forgotten, however, that hundreds have arrived in Winnipeg without any money, and by first working on wages have prospered and become substantial farmers.\nMANITOBA\n\nGeneral Information concerning that Province.\n\nMANITOBA is naturally divided into four general districts: (1) the valley of the Red River; (2) the southern portion drained by the Souris and Pembina Rivers and including the Souris Plain, (3) the valley of the Assiniboine and Little Saskatchewan Rivers, or western middle portion traversed by the main line of the Canadian Pacific, and (4) the low, marshy district surrounding Lakes Manitoba and Winnipeg, and timber lands of the northern part of the Province.\n\nThe Red River Valley.\n\nTHE fertility of this district is too well known to require description. Actual farming was until recently confined chiefly to the lands along the banks of the Assiniboine and Red River, but is now extending over the province except in certain localities better adapted for cattle. These exceptional places owe their chief value to the nutritious native grasses, which furnish at once most valuable pasturage and an unlimited quantity of choice hay to supply the City of Winnipeg and adjacent towns, and surrounding farms. But the richness of the soil has latterly been attracting the attention of incoming farmers anxious to locate near an important centre like Winnipeg, and as a result neat farm buildings are dotted all over what was only a short time ago an unbroken meadow.\n\nSouthern Manitoba.\n\nTHIS district is penetrated by two railways. The Manitoba South-western runs from Winnipeg up the Assiniboine Valley, through several towns or villages, into the Souris district and the coal fields. The Pembina Mountain branch, after crossing the Assiniboine, diverges at Rosenfeld from the railway constructed from Winnipeg to Morris, and runs westward through the Pembina Valley towards the boundary of the province. Excepting the wooded hills and hollows of the broken and picturesque plateau called the Pembina Mountain, through which the river has cut a deep and winding ravine which the railway crosses, and some other limited spots, the whole of this vast region is undulating prairie covered with luxurious grass. There are many living streams, and in the southern part several large lakes; one of which, Pelican, is the largest of a chain of half-a-dozen or more strung together. This lake is thirteen miles long, and bordered by steep and lofty cliffs, which are densely wooded, and the resort of deer and game birds, while the water abounds in fine fish and flocks of wild fowl. These lakes are bordered by a line of elevations called the Tiger Hills, which furnish wood in abundance and attract countless flocks of geese, swan, crane, wild duck, etc., etc. Many lesser lakes dot the landscape. In many spots, dry during all the summer months, moisture enough gathers to promote a plentiful growth of forage, so that the sowing of hay or other fodder is never thought of. Two tons of this wild hay per acre is not\nan unusual amount to cut. The Souris Valley is well occupied, and good roads traverse the country in every direction; though, for that matter, one can drive across the prairie anywhere. Along the lower Souris are many villages, where a post office, stores, blacksmith shop, school and church, form the centre of a farming community.\n\nThe climate of this part, which has been appropriately called \"the garden of Manitoba,\" is not greatly different from that of the west, except that its southerly latitude gives an advantage in respect to earlier springs and later autumns.\n\nGovernment lands in this part of Manitoba are almost all taken, but much desirable land remains to be bought from the Railway Company at very moderate rates. Improved property can be bought near the railway at from $5 to $15 (£1 to £3) an acre. The soil is deep and of almost inexhaustible richness. Wells strike excellent water at a moderate depth. Every crop belonging to western Canada or the northern United States can be grown there to advantage, while for wheat, of course, it is equalled only by other parts of the Canadian west.\n\nOn the Pembina Mountain Branch Railway is a long line of flourishing villages—Morden, Manitou, Pilot Mound, Cartwright, Killarney (by the picturesque lake of that name), Boissevain and Deloraine, with lesser intermediate stations.\n\nMorden has a population of over 1,000.\n\nManitou is the next important village and has some thirty stores, shops, implement agencies, etc., and two elevators and a flour mill.\n\nPilot Mound, Killarney, Boissevain and Deloraine are flourishing centres. The last two are the shipping and supplying points for Turtle Mountain, the vicinity of Whitewater and Pelican Lakes, and the upper Souris Valley.\n\nTo form an unbiased opinion concerning the country, a party of some 200 representative farmers from eastern Canada, went to Winnipeg, and thence scattered through the country on tours of inspection. About seventy went into southern Manitoba, to Deloraine and back.\n\nOn the return of the party, many of the principal members gave their opinion of what they had seen in the following brief way:\n\nA. T. Barnett, Guelph, Ont.—\"The country is certainly better than I anticipated; and I find the farmers have made greater advancement than they could possibly have done in a country like Ontario, in the same length of time.\"\n\nHenry Jarvis, Brantford, Ont.—\"The country far surpassed my most sanguine expectations; I have seen nothing, so far, in the natural features objectionable. As to roots, and I may say crops in general, I never saw their equal.\"\n\nDavid Lamkin, Brantford, Ont—\"It is the best district he has ever seen. In fact,\" he says, \"I do not think one could find a finer country. The produce I have seen on this trip could not be beaten.\"\n\nDavid Nichol, Farquhar, Ont—\"I like the appearance of the country very much; and am of the opinion that the settler has good chances of success.\"\n\nJohn Lamkin, Brantford, Ont.—\"Look at those stacks of grain; we have nothing to touch them in Ontario.\"\n\nThomas Prior, Exeter, Ont.—\"Any man who has fair health and is at all industrious, is pretty sure to make a success. I think the soil the blackest and richest I have ever seen.\"\n\nThomas Shaw, Cainsville, Ont.—\"My impressions are very favorable; and do not think I could speak too highly of the country. The improvement since I last visited the province, seven years ago, is wonderful.\"\nWILLIAM CONNELL, Poole, Ont.—\"I may begin by saying that I am a native of Scotland, but have lived in Ontario for forty-four years, and could I have begun in such a country as Manitoba, I am certain I should be in a far better financial condition today.\"\n\nGEORGE PERDUE, Fenelon Falls, Ont.—\"I would advise any of my friends, who contemplated moving, to move to southern Manitoba, as I consider the land very suitable for agricultural purposes.\"\n\nF. E. AVYS, Sunforth, Ont.—\"I really think the country we have visited is as fine as any part I have seen. I have travelled through the principal portions of Dakota, but, in my estimation, Manitoba beats it.\"\n\nMR. KELLY, Reeve of Blyth, Ont.—\"Taking southern Manitoba as a whole, I do not think it can be excelled for farming purposes, and I have travelled over a large portion of the North-West.\"\n\nJAMES MARTIN, Bruce Agricultural Works, Teeswater, Ont.—\"I think a great deal of the country. I found all the farmers greatly pleased with the change they have made in settling in Manitoba.\"\n\nARCHIBALD JOHNSON, Eramosa, Ont.—\"The appearance of the country struck me at once. The ease with which the land can be brought under cultivation is surprising. The small percentage unfit for plow is remarkable; and the excellent condition of the cattle, as seen from the train, gives unmistakable evidence of the strength of Manitoba's grasses. I was surprised at the growth of roots and vegetables.\"\n\nWhat promises to be an additional attraction to this district is the recent discovery of coal on the western slope of the Turtle Mountains, which will assure cheap fuel to the farmers of the entire district.\n\nThe Central Prairie Region.\n\nTHE central prairie region, or \"second steppe,\" extends from Carberry, on the Canadian Pacific, westward to Moose Jaw, a distance of nearly 300 miles, and includes the most thickly settled part of the prairie region. The principal towns along the main line of the railway are Carberry, Brandon, Griswold, Oak Lake, Virden, Elkhorn, Moosomin, Broadview, Grenfell, Qu'Appelle, Regina and Moose Jaw.\n\nIn general—it may be said that this region has a lighter soil than that of the Red River Valley and southern Manitoba. It is less sticky, not so black, as a rule, dryer, but none the less fertile. There are some tracts of sandhills, but these are utilized for grazing, and form but a small percentage out of the vast area of suitable surface.\n\nCarberry is a village of over 800 people, and forms the market town and shipping point for the great level tract known as Beautiful Plains, which is almost entirely under cultivation. It has five large elevators, a flour mill, churches, schools, etc., etc. In one year no less than 1,050,000 bushels of grain were marketed at this point.\n\nBrandon is the next in size to Winnipeg, and numbers about five thousand people. It is growing rapidly, and is one of the most thriving of western towns. It is located at the crossing of the Assiniboine River, 132 miles west of Winnipeg. The many fine farms and handsome dwellings, and neat school-houses and churches give the country around the city a long settled appearance.\n\nThe city possesses a large grain storage capacity, the different mills, elevators, and warehouses affording storage for over two\nhundred thousand bushels. There being a herd law in this district settlers are relieved from the necessity of fencing their fields.\n\nThe place of next importance west of Brandon, on the Canadian Pacific Railway, is Moosomin, which is close to the western boundary of Manitoba; but Griswold, Oak Lake, Elkhorn and Virden, are all railway stations and market centres, approaching it in consequence.\n\nIt is probable that no region of the prairie offers greater inducements at the present time to agricultural immigrants than that tributary to the villages between Brandon and Broadview. Well improved farms are rarely in the market, but usually bring about $12 an acre. These will have from 30 to 60 acres under crop, with dwellings and stables sufficient for ordinary purposes.\n\nThe valley of the Pipestone bears a great resemblance to that of the upper Souris, and is largely occupied by Scotch and English people, who have churches and schools, and among whom are scattered many families of large means. Moosomin and Grenfell are the stations for these settlements. The former is the most convenient for Moose Mountain, sixty miles southward, at the foot of which lie English settlements numbering several hundred people, who have devoted themselves successfully not only to farming but to the raising of cattle. They have postal facilities, stores, mills for grinding flour and sawing lumber, and form the nucleus of what will quickly develop into a populous and wealthy district. Much Government land is still free for homesteading in that neighborhood, and other lands can be purchased at very cheap rates. The soil is unusually fertile, and the character of the country makes cattle raising and mixed farming peculiarly advantageous there.\n\nAt Indian Head, some distance beyond Moosomin, which is just west of the boundary line of Manitoba, is the great Bell farm, concerning which so much has been written. This farm has harvested enormous crops during the past two seasons.\n\nThe next station beyond Indian Head is Qu'Appelle. This place is peculiarly pleasant on account of the great number of trees standing in the village and diversifying the surrounding landscape. The village is provided with excellent churches, schools and shops. This is the station for stages to Fort Qu'Appelle, eighteen miles northward, where, around the old Hudson Bay post, on the banks of the Fishing Lakes, has grown up a village of some 500 people, the centre of a stock-raising and farming district. The banks of the Qu'Appelle are peculiarly adapted to sheep pasturage and cattle breeding, and the country northward and westward is an exceedingly fertile one, where settlement is progressing rapidly. A new branch line has recently been put in operation through this district, via Long Lake, to Prince Albert, on the North Saskatchewan.\n\nAround Regina and Moose Jaw there is much less tree growth than on the prairies eastward. The soil, however, is marvellously rich, and is especially adapted to the raising of wheat, of which a great quantity has been produced the present year. Beyond Moose Jaw, except in the neighborhood of Calgary, agriculture has not been tried to any great extent. But this section of country is particularly favorable for stock-raising in all its branches, and for dairy-farming. The new line between Edmonton, on the North Saskatchewan, and McLeod, passes through Calgary and the territory north and south of it.\nThe Western Metropolis.\n\nTHE City of Winnipeg is the capital of Manitoba, and the principal city of Canada west of Toronto. A recent issue of The American Land and Title Register, published in St. Paul, the chief city of the rival State of Minnesota, says:\n\n\"Within the memory of men now in middle life a lonely trading post of the Hudson Bay Company called Fort Garry alone marked the site of Winnipeg. This gigantic trading company occupied Fort Garry as its most important post and for this purpose they chose it well—probably better than they knew.\n\nAt this spot where the waters of the noble Red and the more rapid Assiniboine Rivers mingle, and around which the romantic traditions of the early days still cluster, even in those early days the shrewd officers of this company, as if with prophetic vision, located their chief trading post, on account of the many points of vantage it possessed as a possible commercialemporium. Easy of access both by river and trail, it was the natural trade centre of a vast country whose bounds were imperial in extent.\n\nThe commercial supremacy of Fort Garry from its earliest infancy, reaching back almost to the days of La Veran,rye, down through the long years of semi-civilised life through the dark times of rebellion, through company rule and Canadian government, has never been disputed; and the proud and commanding position occupied by the Fort Garry of the past is maintained by its more civilized off-spring, the Winnipeg of today. It is the great mart of a country of nearly 2,000,000 acres of rich territory; the seat of government of the keystone province of the Dominion of Canada; the centre of the political, social, literary, monetary and manufacturing world of the Dominion of the Canadian West, with its suburb, St. Boniface, the fountain head of the educational institutions of not only Manitoba, but the whole North-West.\n\nIts positive pre-eminence is yearly becoming more pronounced and commanding. Twenty years ago a small isolated settlement, then a struggling village then a town; when, on the advent of the first railway, it rose, within a few years, to the proud position of one of the leading trade centres of the continent. Ten railways, branching like spokes in a wheel in all directions, gather the wealth of an inland empire to empty it at her feet. Three out of four of the great transcontinental railroads now centre here; and while we recognize the ability of the railways to make or unmake cities, Winnipeg is now so phenomenally a railroad centre that no railroad in the country can afford to leave it out of its calculations.\n\nThe navigation of the Red River, Lakes Winnipeg and Manitoba, the great Saskatchewan and other navigable streams, make tributary to its thousands of miles of important coast line. Seventy-five per cent. of the wheat land of North America is directly tributary to it, while untold wealth of iron, coal, salt, petroleum, gold, silver, lumber, fish, timber, furs, horses, cattle, sheep, hogs, etc., go to swell resources and backing more vast and varied than are possessed by any other city in the world.\n\nAlthough the facile pens of gifted writers have often described its marvellous progress, its prosperity, the enterprise of its citizens, the advantages of its location, and artists have portrayed its bustling streets and costly and substantial structures, there is much yet to tell of this rising wonder of the West, which, like an adolescent giant, sits on the rim of the great prairie—the future granary of the world—and with beckoning fingers invites the home hungering people of the congested East to its hospitable and rich domain. To-day no other city in America is attracting so much the attention of capitalists, and no other city can offer such inducements to investors. The most competent judges pronounce its real estate the cheapest on the continent, while we look in vain elsewhere for a city of such natural advantages or such a bright and dazzling future.\n\nA leading real estate firm in the city of Winnipeg gives the following figures as\n### THE GROWTH OF TWO DECADES\n\n| WINNIPEG | 1870 | 1880 | 1890 |\n|----------|------|------|------|\n| Value of City Property | $200,000 | $4,500,000 | $23,000,000 |\n| Volume Commercial business | 150,000 | 2,000,000 | 40,000,000 |\n| Bank Capital | 0 | 10,000,000 | 40,000,000 |\n| Bricks Manufactured | 0 | 1,000,000 | 25,000,000 |\n| P.O. Collection and Delivery | 90,000 | 900,000 | 8,000,000 |\n| Value of Public Improvements | 0 | 100,000 | 2,000,000 |\n| Tons Coal Handled | 0 | 5,000 | 100,000 |\n| Population | 225 | 6,500 | 27,000 |\n| Number of Buildings | 40 | 1,000 | 6,000 |\n| Business Houses | 10 | 65 | 400 |\n| Factories | 2 | 16 | 45 |\n| Churches | 1 | 8 | 29 |\n| Schools | 1 | 5 | 10 |\n| Miles of Streets | 0 | 20 | 120 |\n| Paved Streets | 0 | 0 | 10 |\n| Sewers | 0 | 2 | 21 |\n| Water Mains | 0 | 0 | 20 |\n| Gas Mains | 0 | 6 | 11 |\n| Number of Banks | 0 | 4 | 10 |\n\n**Tributary Territory**\n\n- Wheat yield (bushels): 8,000, 350,000, 20,000,000\n- Other crops: 10,000, 370,000, 28,000,000\n- Acres under Crop: 2,000, 40,000, 1,300,000\n- White Population: 3,000, 32,000, 240,000\n- Number of Farmers: 210, 2,250, 30,000\n- Elevator Capacity: 0, 0, 8,000,000\n- Number of Elevators: 0, 0, 9\n- Railway Mileage: 0, 15, 3,500\n- Number of Post Offices: 0, 153, 580\n- Number of Schools: 0, 85, 720\n\nThe above figures are the best guarantee for the future.\n\nThis Table does not include the country's great wealth in Horses, Cattle and Sheep.\n\n### System of Survey\n\nThe Provinces of the North-West have now been accurately surveyed by the Dominion Government, and parcelled out into square and uniform lots on the following plan:—The land is divided into “townships” six miles square. Each township contains thirty-six “sections” of 640 acres, or one square mile each, which are again subdivided into quarter-sections of 160 acres. A road allowance, one chain wide, is provided for between each section running north and south, and between every alternate section east and west. It will thus be seen that the section in each township are apportioned as follows:\n\n**Open for Homestead and Pre-Emptions.**—Nos. 2, 4, 6, 10, 12, 14, 16, 18, 20, 22, 24, 28, 30, 32, 34, 36.\n\n**Canadian Pacific Railway Sections.**—Nos. 1, 3, 5, 7, 9, 13, 15, 17, 19, 21, 23, 25, 27, 31, 33, 35.\n\nNos. 1, 9, 13, 21, 25, 33, along the main line, Winnipeg to Moose Jaw, Canada North-West Land Company, with some additional sections throughout Manitoba to make up their purchase of 2,200,000 acres.\n\n**School Sections.**—Nos. 11, 29, (reserved by Government solely for school purposes.\nHudson's Bay Sections.—Nos. 8 and 26.\n\nTOWNSHIP DIAGRAM.\n\n| 1 MILE SQUARE | N. |\n|---------------|----|\n| 31 C.P.R.     | Gov. |\n| 32 Gov.       | C.N.W. or C.P.R. |\n| 33 Gov.       | C.P.R. |\n| 34 Gov.       | H.B. |\n| 35 Gov.       | C.N.W. or C.P.R. |\n| 36 Gov.       |    |\n\n| W.            |    |\n|---------------|----|\n| 19 C.P.R.     | Gov. |\n| 20 Gov.       | C.N.W. or C.P.R. |\n| 21 Gov.       | C.P.R. |\n| 22 Gov.       | Gov. |\n| 23 Gov.       | C.P.R. |\n| 24 Gov.       |    |\n\n| S.            |    |\n|---------------|----|\n| 7 C.P.R.      | H.B. |\n| 8 Gov.        | C.N.W. or C.P.R. |\n| 9 Gov.        | Schools. |\n| 10 Gov.       | C.P.R. |\n| 11 Gov.       | Gov. |\n| 12 Gov.       | C.N.W. or C.P.R. |\n| 13 Gov.       |    |\n\nC. P. R.: Canadian Pacific Railway Company's Lands. Gov.: Government Homestead and Pre-emption Lands. Schools: Sections reserved for support of Schools. H. B.: Hudson Bay Company's Lands. C. N. W.: Canada North-West Land Company's Lands for as far west from Winnipeg as Moose Jaw only. Sections 1, 9, 13, 21, 25 and 33, from Moose Jaw westward, still belong to the Canadian Pacific Railway Company.\n\nThe whole plains region is furthermore divided by five \"meridians,\" which serve as base-lines for accurate surveying. The first of these is the true meridian of 97° 30', about 12 miles west of Winnipeg; the second is a short distance west of the western boundary of Manitoba, in longitude 102°; the third crosses Assiniboia near Moose Jaw, in longitude 106°; the fourth passes through the Cypress Hills (long. 110°); and the fifth is the longitude of Calgary, 114° west of Greenwich. Between the meridians, the ranges are numbered consecutively from east to west; while the tiers of townships are numbered continuously from the United States boundary northward.\n\nTo designate one's exact locality it is only necessary to say, for example, that he is in section 23, township 10, range 19, west of the first meridian, which is the site of Brandon.\nFor disposal of the public lands under this system, by free-grant, pre-emption or sale, the Dominion has established the following agencies, at which all the business in relation to lands within the district of each must be transacted:\n\nDOMINION LANDS OFFICES.\n\n(FIGURES ARE INCLUSIVE).\n\nWinnipeg and Dufferin Districts combined.—Includes all surveyed townships, Nos. 1 to 25 north; ranges—all east of 1st meridian, and ranges 1 to 8 west; also townships 1 to 4, ranges 9 to 14, and townships 5 to 7, ranges 9 to 12 west. Agent, Winnipeg.\n\nSouris District.—Township 5, ranges 13 to 18, townships 6 and 7, ranges 13 to 2nd meridian, townships 8 to 12, ranges 9 to 2nd meridian. Agent, Brandon.\n\nTurtle Mountain District.—Townships 1 to 4, ranges 15 to 2nd meridian, township 5, ranges 19 to 2nd meridian. Agent, Deloraine.\n\nLittle Saskatchewan District.—Townships north of and including 13, ranges 9 to 22 west. Agent, Minnedosa.\n\nBirtle District.—Townships north of and including 13, ranges 23 to 2nd meridian. Agent, Birtle.\n\nCoteau District.—Townships 1 to 9, ranges 1 to 30 west 2nd meridian. Agent, Cunningham.\n\nQu'Appelle District.—Townships 10 to 23, ranges 1 to 30 west 2nd meridian. Agent, Regina.\n\nTouchwood District.—Townships 24 to 31, ranges 1 to 30 west 2nd meridian, townships 32 to 36, range 1 west 2nd meridian to range 6 west 3rd meridian, townships 37 and 38, 2nd meridian, to range 5 west 3rd meridian. Agent, Saltcoats.\n\nSwift Current District.—Townships 1 to 30, ranges 1 to 30 west 3rd meridian, township 31, ranges 1 to 8 west 3rd meridian. All business transacted at Regina.\n\nCalgary District.—Townships 13 to 18, range 24 west 4th to B. C., and townships 19 to 30, range 1 west 4th; townships 31 to 42, range 8 west 4th meridian to B. C. Agent, Calgary.\n\nEdmonton District.—Township north and including 43, range 8 west 4th to B. C. Agent, Edmonton.\n\nBattleford District.—Townships 31 to 38, range 7 west 3rd meridian to 7 west 4th meridian; townships 37 to 38, range 6 west 3rd meridian to range 7 west 4th meridian; township 34 northwards, range 11 west 3rd meridian to 7 west 4th meridian. Agent, Battleford.\n\nPrince Albert District.—Township 39 northwards, range 13 west 2nd meridian to 10 west 3rd meridian. Agent, Prince Albert.\n\nLethbridge District.—Townships 1 to 18, ranges 1 to 24 west 4th meridian, and townships 1 to 12 between westerly limit of range 24 and boundary B. C. Agent, Lethbridge, N. W. T.\n\nFrom time to time the boundaries of the different agencies are liable to alteration as the progress of settlement renders advisable and as the increasing railway facilities makes it possible to place the land offices in more central positions relatively to the boundaries of each district. In every case, however, ample notice is given to the public of any changes made in the land districts, and in the case of immi-\ngrants newly arriving in Manitoba they can obtain the fullest possible information in regard to all land matters by inquiring at the office of the Commissioner of Dominion Lands in Winnipeg, or at the Dominion Lands Intelligence Office, which is on the platform at the Winnipeg station, and is kept open during the immigration season for the express purpose of supplying information to incoming settlers. There are also intelligence offices stationed at Whitewood and Medicine Hat for the same purpose.\n\nAt the offices in the districts, detailed maps will be found, showing the exact homestead and pre-emption lands vacant. The agents are always ready to give every assistance and information in their power. Settlers arriving in Winnipeg can obtain all information required before going west. For the convenience of applicants, information as to prices and terms of purchase of Railway lands may also be obtained from all stations agents along the Company's main line and branches. In no case is an agent entitled to receive money in payment for lands. All payments must be remitted directly to the Land Commissioner at Winnipeg.\n\nClimate.\n\nThe seasons in the North-West are well marked. The summer months have bright, clear, and often very warm weather; but the nights are cool. The days are very long on account of the high latitude, and grain has some hours more each day for ripening than in southerly latitudes, thus making up for the comparatively shorter season. Harvesting begins about the middle of August and ends early in September, all the grain coming pretty well together. The autumn months are considered the finest of the year. The atmosphere is serene and free from moisture, frequently for periods of several weeks.\n\nThat the winter is cold, there is no doubt, but the atmosphere is buoyant, the sun shines almost every day, and when it is very cold there is seldom any wind; the air is extremely bracing and health-giving. \"Blizzards\" are scarcely known, and cyclones, which periodically sweep over the Western and North-Western States and Territories of the United States, leaving destruction and desolation in their path, have never visited this portion of Canada.\n\nThis dryness of the air is the secret of the degree of comfort experienced even when the mercury is very low, for that sensation of penetrating chill which makes the cold weather of coast regions so severe, is rarely felt. Snow never falls to a great depth, and the railway trains across the plains have never been seriously impeded by it. As this snow is perfectly dry, a person never has wet feet or soaked clothing by it. Men travel with teams everywhere, taking their grain to market, hauling fuel, building and fencing material, and doing all their work. Stock thrive well out of doors, so far as the cold is concerned, and along the base of the Rockies, where warm dry Chinook winds from the west absorb the snow rapidly, herds of horses and cattle have hitherto been left out all winter to shift for themselves. Calves and lambs are born on the open prairie in January and February, and not only live but grow fat. Everyone unites in testifying to the healthfulness of the country. Ploughing can often be commenced about the end of March, but generally not before April 5. The snow disappears rapidly, and the ground dries quickly. Winter closes promptly and decisively. Sowing is done during almost the whole of April, and is finished early in May.\nFuel.\n\nThere is a more or less generous supply of wood throughout the farming districts. In addition to this, practically inexhaustible deposits of coal have been found at many points so conveniently situated as to appear almost as though specially designed by nature for distributing centres.\n\nAGRICULTURAL CAPABILITIES\n\nWheat Raising.\n\nThe soil, the climate and other natural conditions of Manitoba are peculiarly adapted to wheat raising. That wheat is grown hundreds of miles north of the northern boundary of Manitoba is undoubtedly the fact; this means that in the magnificent areas of Western Canada, the wheat fields of America are in the near future to be found. Up to the present the West is without a rival in the soil and other conditions it enjoys for wheat culture. The figures compiled from the report of the United States Department of Agricultural and other sources clearly demonstrate that Manitoba and the Territories beyond it yield the largest percentage on the continent of America, the average for 1891 in Manitoba, according to returns up to date, being about 35 bush. per acre. The berry is a moderate size, of a fine amber color and possesses those qualities that render it most profitable for flour making. The straw is strong and stiff, often exceeding five feet in height, while the heads are long and plump. It will be easily inferred that a field of 500 or 600 acres of growing wheat is a beautiful sight, and when it promises an average of 30 bushels to the acre (that has often been exceeded) it is to the owner in reality a golden prospect.\n\nAs an evidence of the advance the province is making in the production of grain, official figures may be quoted as follows: The total acreage under crop in 1887 was 663,764, while in 1891 it had increased to 1,350,678 acres, a difference of 207,879 acres.\n\nOther Grains, etc.\n\nIn addition to wheat, which is the standard and most largely cultivated grain (Manitoba red Fyfe wheat brings a higher price in Liverpool than that of any other place on the globe) the soil of the North-West yields bountifully of barley, oats, rye, millet, timothy-grass, lucerne, peas, beans, flax, hops, every sort of root-crop, and all kinds of garden produce; while the women and children are delighted to find themselves able to cultivate flowers to any extent. Mushrooms are plentiful and often of gigantic size. Barley and rye give a magnificent yield, often forty bushels to the acre. Oats are very generally cultivated and often form the first planting of the new settler. They incline to shorter straw and heavier heads than in the east, and produce fifty to seventy bushels per acre. Millet and similar small grains grow excellently; as, also, do the fodder plants, though these have been little cultivated, because there has been little need to supplement the natural hay-grasses. Hempen plants are indigenous\nall over the plains, so that it is not surprising to find that flax does exceedingly well in the North-West, requiring ninety days to mature. For this there is always a good home market, linseed-oil mills having been built in Winnipeg.\n\nWild hops, pronounced by brewers to be of excellent quality, attain a luxuriant growth in many localities. Cultivated vines of this wild stock give as fine large hops as the vines of Kent.\n\nIn respect to root-crops, it probably is not too much to say that no part of the world produces potatoes, turnips, onions and every kind of garden vegetables belonging to the cooler half of the temperate zone with so great a luxuriance, and of so fine a quality, as the Canadian West.\n\nThe Department of Agriculture has published a statement respecting the suitability of Manitoba as a place for settlement, based upon the answers of 100 farmers, whose names and addresses are given, and to whom reference may at any time be made. These farmers testify, among other things, to the amazing yield of root-crops, ninety-two of them reporting an average crop of 318 bushels to the acre. W. H. Swain, of Morris, has produced 800 to 1,000 bushels of turnips to the acre, and sixty bushels of beans have also been raised by him per acre; S. C. Higginson, of Oakland, has produced cabbages weighing 174 lbs. each; Allan Bell, of Portage la Prairie, has had cabbages 45 inches round, and turnips weighing 25 lbs. each; Thos. F. Patterson has realized forty tons of turnips to the acre, some of them weighing as much as 20 lbs. each; Robt. E. Mitchell, of Cook's Creek, raised a squash of six weeks' growth, measuring 5 feet 6 inches around the centre; Wm. Moss, of High Bluff, has produced carrots weighing 11 pounds each, and turnips measuring 36 inches in circumference; James Airth, of Stonewall, states that the common weight of turnips is twelve pounds each, and some of them have gone as high as thirty-two and a half pounds; Isaac Casson, of Green Ridge, has raised 270 bushels of onions to the acre; John Geddes, of Kildonan, states that he has raised 300 bushels of carrots and 800 bushels of turnips per acre; John Kelley, of Morris, has produced from 800 to 1,000 bushels of turnips to the acre; Joshua Appleyard, of Stonewall, also states his crops of turnips to have been 1,000 bushels per acre, the common weight being twelve pounds each; Ed. Scott, of Portage la Prairie, raised 400 bushels of turnips from half an acre of land, and in similar strain a long list of farmers speak of their personal experience.\n\nEven the less hardy kinds succeed well. You will see tomatoes growing out of doors and ripening well all over the prairies. Farmers of Edmonton and Qu'Appelle grow them as well as they do at Winnipeg or Emerson. Asparagus, tobacco, maize, melons of all kinds, and everything ordinarily in a garden; can be seen wherever a careful attempt has been made to make these more tender plants grow.\n\nWild fruits attain to great perfection in Manitoba, Assiniboia and Alberta. Wild plums, raspberries, cherries, cranberries and other berries abound, and are of luscious quality.\n\nApiculture is successfully carried on in the North-West, of course as bees require just such a clear, dry atmosphere and wealth of flowers as they find on the prairies. The honey secreted solidifies and becomes ready for sealing sooner than in a warm, moist climate, and is consequently sweeter.\n\nIn connection with the farm, the raising of cattle, horses, swine and poultry, can be carried on most advantageously, as all the land\nnot under cultivation is pasture, and there are few quarter-sections unsupplied with good drinking water. Pairs of working oxen weighing 3,500 pounds or more can be seen almost anywhere. The rare occurrence of any disease is a point which should not be forgotten; and every care is taken by the local government to prevent their introduction and to encourage live stock breeding generally.\n\nDairy Farming.\n\nONE special resource which deserves every farmer's attention, is dairying. Cheese factories have been established at several points and are doing very well. The butter of Manitoba is famous for its excellence, and is sent not only to all parts of the prairie region, but shipped east in large quantities, and even to Japan. At a recent Dominion Exhibition in Toronto, the butter of Manitoba took the first prize, in competition with all Canada. Items like the following, from a newspaper of Winnipeg, are everyday occurrences, and show what butter-making amounts to there:\n\n\"James Kelly, of Arnaud, Man., sold 2,119 pounds of butter to the Hudson's Bay Company, which they pronounced to be the best butter bought by them this season, and for which he got the highest price in the market. He has been in Manitoba twelve years, and commenced farming here in 1889, with only one yoke of cattle, one log chain, a plow and $1 capital. He has now twenty-two milch cows, and has in all eighty-three head of stock, and has no debts and no encumbrances on his property. He advises all his countrymen to come and farm in Manitoba.\"\n\nSettler's Testimony.\n\nIN 1891 a number of letters from settlers in Manitoba and the Territories were published in which the greatest satisfaction was expressed with their experience of the West, and giving glowing accounts of the harvest of 1890. The following letters and extracts refer to the crop of 1891:\n\nReport on farming operations of Samuel Hanna, of Griswold, 1881 to 1890, inclusive:\n\nMade entry in 1881, on E 1/4 12-10-23, built small house and put up some hay. Had capital at commencement, $5,000. Homestead and pre-emption 320 acres. Purchased 610 acres at $2.50 per acre.\n\n1882. Broke and backset 150 acres.\n\n1883. Sowed 92 acres in wheat, 60 in oats, broke and backset 150 acres. Threshed 3,600 bushels wheat, averaging 91 bushels per acre, sold at 81 cents per bushel, oats yielded 5,100 bushels, averaging 90 bushels per acre.\n\n1884. Put 300 acres in crop; 200 in wheat, 100 oats and barley. Wheat yielded 5,600 bushels, averaging 28 bushels per acre, sold at 71 cents per bushel. 60 acres in oats yielded 4,200 bushels, averaging 70 bushels per acre. 40 acres in barley yielded 1,800 bushels, averaging 45 bushels per acre. Broke and backset 150 acres.\n\n1885. 450 acres under cultivation. 300 acres in wheat yielded 9,000 bushels, averaging 30 bushels per acre, shipped to Toronto. Crop was somewhat frozen, realized 45 cents per bushel. Put 50 acres in oats, 25 in barley. Oats yielded 3,500 bushels, average 70 bushels per acre, barley 1,000 bushels, average 40 bushels per acre. Broke and backset 80 acres. Summer fallowed 75 acres.\n\n1886. 530 acres under cultivation. Put 300 acres in wheat, yield 5,700 bushels, average 19 bushels per acre, (dry season,) 60 acres in oats, 1,500 bushels, average 25 bushels per acre, barley 20 acres, yield 500 bushels, averaging 25 bushels per acre.\nWheat all No. 1 hard, sold at 65 cents per bushel. Broke and backset 75 acres, summer fallowed 150 acres.\n\n1887. 605 acres under cultivation. 375 acres in wheat, yield on 150 acres 6,900 bushels, averaging 46 bushels per acre; yield on 225 acres 5,175 bushels, averaging 23 bushels per acre. Sold 10,300 bushels at 50 cents per bushel. 50 acres in oats yield 3,500 bushels, averaging 70 bushels per acre; barley 25 acres 1,250 bushels, averaging 50 bushels per acre. Summer fallowed 150 acres.\n\n1888. 755 acres under cultivation. 400 in wheat, yield 26 bushels per acre, damaged slightly by frost. The Ladoga wheat was untouched by frost, averaged 39 bushels, and sold it at $1.02 per bushel. Oats was a poor crop, averaging only 25 bushels per acre. Summer fallowed 150 acres.\n\n1889. 400 acres in wheat, yield 4,000 bushel, average 10 bushels per acres, sold at 65 cents. All No. 1 hard. Oats and barley 100 acres, light crop.\n\n1890. 440 acres in wheat, yield 13,200 bushels, averaging 30 bushels per acre. Sold 8,500 at 81 cents. Oats 80 acres, yield 3,840 bushels, averaging 48 bushels per acre; barley 33 acres, yield 1,260 averaging 42 bushels per acre.\n\nMr. Hanna has now 20 head of horses, 6 oxen, 4 cows, 4 pairs of steers and 10 head of young stock that value:\n\n| Item                  | Value     |\n|-----------------------|-----------|\n| Stock valued          | $4,000.00 |\n| Implements            | 1,500.00  |\n| Grain unsold          | 4,000.00  |\n| Hay                   | 200.00    |\n| Buildings             | 4,000.00  |\n| Land, 1270 acres      | 15,250.00 |\n\nTotal: $28,950.00\n\nCapital at Commencement of Farming Operations: $5,000.00\n\nMr. Charles Dodd, of Broadview, Assiniboine, said on Oct. 20th, 1890:\n\n\"I came from County Durham, England, in 1882. When I reached Winnipeg I had just $200 in my pocket. Today I am worth $3,000. This year I had forty acres under oats and got a fine crop of extra good grain, which averaged 45 bushels to the acre. I had ten acres of wheat which yielded 22 bushels per acre of first-class grain. I consider the chances as most promising. I have done well myself, much better than I could ever have done in England, and anyone willing to work can do the same.\"\n\n\"Charles Dodd\"\n\nAsked concerning this letter Mr. Dodd replied Nov. 13th, 1891:\n\n\"Say I arrived in Winnipeg with $2 instead of $200 and you will be nearer the right thing. Our crops this year are beyond our highest expectation. Wheat to 45 bush. per acre, oats to 75 bush. per acre and other yields in proportion. The wheat in this district will go No. 1 or No. 2 hard and has figured very prominently even at Regina. Our district is especially adapted to mixed farming having plenty of good hay land, wood and water, the only thing we lack being settlers.\"\n\nMr. James Kelly, Arnaud, Manitoba, wrote under date of August 23rd, to Mr. A. J. McMillan, Manitoba Government Agent at Liverpool:\n\n\"I have spent forty years of my life farming in different parts of America from the Atlantic to the Pacific Ocean, and also in California. I have also seen a little farming in Ireland, England and Scotland, and have never seen any soil to equal Manitoba. Therefore I would recommend anyone who wishes to make a living at farming to come to this country, also farm laborers of both sexes. I am now seventy years of age, and I can say it is the best land I ever saw after all my travels. I wish you could send me a couple of laboring hands as quickly as possible. They are very scarce in this part of the country. A thousand farm laborers would get work here at present.\"\nat wages from $50 to $60 and board per month. Is it not a shame that we cannot procure help? Arise up, boys, and come to the country where they can live free and where they will be equal to their masters. I have lived in this country 15 years, and ought to know something about it now.\"\n\nMr. Condie, who farms south of Deloraine, obtained 3,300 bush. from 67 acres, (49½ bush. per acre.) He writes:\n\n\"This crop was raised on summer fallow, the land or summer fallow as it is called consists of one shallow plowing, (about 4 inches,) and one harrowing in the fall. I sowed 1½ bush. per acre with an ordinary Press Drill, commenced seeding the 16th of April and finished the 27th.\n\nYours etc.,\n\nAlex. Condie.\"\n\nMr. M. B. Wilson and sons:\n\nRaised off 100 acres of land 11,150 bush. of No. 1 wheat, and off 75 acres of land 1,250 bushels of oats, and off 12 acres of land 184 bush of barley, making in all 19,570 bush of grain off 197 acres of land this year.\n\nM. B. Wilson,\n\nDeloraine, Nov. 9th, 1891.\n\nAvenell Farm, Grinnell, Assin., N.W.T., Nov. 16th, 1891.\n\nOur wheat, (White Fyfe threshed by measure, 30 bushels to the acre—full plough land, sown wheat also in 1890, and would probably have returned at least another five bushels to the acre but for the exceptional ravages of wild geese and sandhill crane. This is the lightest crop of wheat I have heard of as yet in our district; our nearest neighbor (D W. Metcalf) averaged 12 bushels to the acre.\n\nWe tried an experiment of White Fyfe and Ladoga, a two bushel bag of each sown on the same day, side by side, on last year's turnip land. The tally of the threshing machine registered 57 of White Fyfe and 14 of Ladoga.\n\nOur wheat on summer-fallowed land would have given quite phenomenal returns, but for a rain storm badly laid as it was, we realised 915 bushels off 17 acres. We also had 35 acres of oats on last year's wheat land, ploughed in the spring, sown broadcast randal and drag harrowed, which yielded 11 bushels to the acre. Here we found the crop did not run so much to straw as on the summer fallow, and the oats are a more equal sample, and the straw more valuable.\n\nStill it is advisable year in and year out to have at least one-third of one's crop on summer fallowed land.\n\nWe had great success with Carter's two-rowed malting barley, (prize prolific) and can boast a carload of 60 bushels today, the result of one two-bushel bag purchased from the Experimental Farm at Ootowa in the spring of 1890.\n\nThese are unvarnished facts, which I understand its your good purpose to collect, and without any comment, I beg to submit myself.\n\nFaithfully yours,\n\nR. H. Hay Chapman,\n\nRegina, Nov. 15th.\n\nThe Smith boys, brothers of J. W. Smith, of Smith & Ferguson, report a phenomenal wheat yield from a ten-acre field on a farm six miles north of the town. This patch took 65 pounds of twine to bind it. It was threshed Friday and yielded 550 bushels, 55 bushels to the acre.\n\nA Manitoba paper says: In our local matter this week are several notable yields of wheat, ranging from 31 to 50 bushels per acre. Taking Mr. Condie's crop of 49½ bushels per acre thresher's measure at 5½ bushels per weight, while it is more likely to make 51 or 52 bushels at 75 cents per bushel, we have $37.50 as the product in dollars and cents per acre, and this not from a small garden patch, but from large field of 67 acres. Similar land to this can be readily taken from the prairie and prepared for crop at a cost less than $5 per acre, while the land itself can be bought at from $6 to $15 per acre. There is also the yield on Mr. Wright's farm of 11 bushels to the acre, from a 60 acre block, and 10 bushels from another; in each case No. 1 hard.\"\nA telegram from Grénsfell to a Winnipeg Journal says, Oct. 24th:—“Results far beyond former expectation reach us from the threshing machines. Thirty bushels to the acre of wheat is probably the lowest we shall hear of, while as the grain is turning out 35 to 40 bushels will be no exaggerated average, and 75 per cent. will grade No. 1 hard or better, for without doubt much wheat will be marketed here this year, considerably superior to the highest government grade.\n\n“Quite phenomenal crops of oats are heard of. Messrs. Rowley & Chapman report 45 to the acre, and also from one bag of White Fyfe sown on turnip land, 57 bushels, and 44 bushels from 2 bushels of Ladoga.”\n\nAnother journal says:—“From all parts of the province and the eastern territories comes the news of great crop yields. At Sheppardville 51 acres yielded 7,766 bushels and in another case 27 acres yielded 968 bushels and other similar yields are reported. At Pilot Mound stacking will be in progress until the snow falls, and it is thought that owing to the scarcity of threshing outfits much of the threshing will have to stand over until spring. The yield is frequently from 30 to 40 bushels to the acre. The same state of affairs is reported at Neepawa. As high as 78 cents has been paid at Minnedosa for No. 1 hard, and 80 cents was offered for more, but the price has since fallen to 75 cents. At Springhill the wheat is of a fine quality, and is yielding from 26 to 33 bushels to the acre.”\n\nA Regina paper says:—“We said a week or two ago when writing about the phenomenal crops in this district that we should not be surprised when the threshers got to work to hear of yields of 40 and more bushels to the acre. Mr. W. C. Culham, of Regina, has just threshed out forty-eight and half bushel to the acre. He will have some thousands of bushels of the same stuff, which is Regina No. 1 hard.”\n\nA telegram from Miami, Oct. 19th, to the Winnipeg Free Press says:—“The weather is delightful, and the farmers are through stacking, and several of them are busy threshing. The crop is as large as was anticipated; in some instances more. John G. Blair who farms one mile south of here in tp. 4 r. 6, on twenty-one acres, No. 1 hard, and had a crop of oats which averaged 125 bushels to the acre.\n\nIn a letter to the Hon. Mr. Greenway, Minister of Agriculture and Immigration, Mr. H. C. Simpson, a farmer in the vicinity of Virden, says:\n\n“I will give the results of a venture I made in growing wheat, which I think you will agree was very successful. I bought a quarter section of land, sandy-soil, seven miles from Virden, during the spring of 1889; and broke and backset 120 acres of it. It is very smooth and level, so it was as easy to break as ploughing ordinary stubble. I sowed it with Eureka wheat, and started cutting on the 7th of August last year. I threshed 2,375 bushels off it. I have sold it now at 95 cents per bushel, which comes to $2,256. I paid $3.50 per acre for the land, or say $560; my expenses, including seeding, threshing, etc., amounted to $485; so that I have the land for nothing, and a net profit of $1,290. These figures are correct, because I have taken great care to keep an accurate account of my expenses.”\n\nA western journal says:—“Some of the results of threshing on the Blood Reserve will no doubt be of interest. At the Home Farm, off of 15 acres, they threshed out 1,111 bushels of fine sound oats. They measured 5 feet, 6 inches in height. Off of 1½ acres of wheat, 58 bushels were threshed, of first-class quality.”\n\nA Logoch correspondent writes:—“Wheat is turning out on an average 30 bushels to the acre and bringing the highest market price.”\n\nThe Morden Monitor says:—The yield of grain in the Miami district promises to be larger than anticipated. Mr. Thos. Gosney has six acres of wheat which turned out 47½ bushels to the acre.”\n\nThe Qu’Appello Vidette says:—“Mr. Arthur Webster threshed a portion of his grain last week, and is highly pleased with the yield. His Red Fyfe wheat yielded over 45 bushels per acre, two rowed barley 37, oats from 70 to 80.”\nThe Pilot Mound Sentinel says: \"Some of the finest rows of potatoes we have noticed this season were in the garden of Mr. A. McDougall. Three selected from a pile weighed nine pounds. One weighed three and a half pounds.\"\n\nA Miami correspondent writes: \"The weather is delightful, farmers are through stacking, and several of them are busy threshing. The crops are as large as was anticipated; in some instances more. John G. Blair, who farms one mile south of here, averaged 56 bushels to the acre of No. 1 hard wheat on 21 acres and had a crop of oats which averaged 125 bushels to the acre.\n\nThe largest yield of wheat per acre over a good sized field is reported by Councillor A. Condie, who from 67 acres, about five miles out of Deloraine, Man., obtained 3,300 bushels, threshers measure, of No. 1 hard wheat, threshed from the stook. This is over 49 bushels per acre, and from the way threshers' measure has turned out this fall there is no reason to doubt it will weigh out at least 50 bushels to the acre.\n\nA Portage la Prairie telegram says: \"The continued fine weather for the past week has caused the grain to move in large quantities. There has been delivered at the elevators from 12,000 to 15,000 bushels per day. The prices paid have been 75c. to 78c.\n\nIt is an imposing sight to see the long string of wagons freighted with the fruits of the soil in the shape of wheat, each farmer awaiting his turn to be unloaded. The shipments from this point including that received from the M. & N. W. R., are very large at present. On Saturday no less than 92 cars of wheat were in the C. P. R. yard for shipment.\n\nROOM IN MR. WALKER'S LOG FARM-HOUSE ON THE ASSINIBOINE, MANITOBA, 1891\nASSINIBOIA\n\nThe District of Assiniboia lies between the Province of Manitoba and the District of Alberta, and extends north from the International boundary to the 52nd parallel of latitude, and contains an area of thirty-four million acres. It is divided into two great areas. Each of these divisions has its own peculiar characteristics; the eastern portion being essentially a wheat-growing country, and the western better fitted for mixed farming and ranching. The great plain lying south of the Qu'Appelle river and stretching south to the International boundary, is considered to have the largest acreage of wheat land, possessing a uniform character of soil, found in any one tract of fertile prairie land in the North-West. The eastern part of the District is known as the Park Country of the Canadian North-West. Both are traversed by the Canadian Pacific Railway and its branches.\n\nIn the western District is the celebrated\n\n*Cypress Hills*\n\ncountry, extending west to Medicine Hat. It is everywhere thickly covered with a good growth of nutritious grasses,—the grass is usually the short, crisp variety, known as \"Buffalo Grass,\" which becomes to all appearance dry about midsummer, but is still green and growing at the roots and forms excellent pasture both in winter and summer. A heavy growth of grass suitable for hay is found in many of the river bottoms and surrounding the numerous lakes and sloughs. The snow fall is light, the climate is tempered by the Chinook winds, and water and shelter are everywhere abundant. Professor Macoun, in his exploration of these hills, found that the grasses of the Plateau were of the real pasturage species, and produced abundance of leaves, and were so tall that for miles at a time he had great difficulty in forcing his way through them. Although their seeds were all ripe, August 14th, their leaves were quite green. It is amazing the rapidity with which poor emaciated animals brought from the East get sleek and fat on the buffalo grass of the plains.\n\nThe supply of timber on the hills is considerable. There is also an abundance of fuel of a different kind in the coal seams that are exposed in many of the valleys.\n\nSettlers in this section of the Company's lands have thus at hand an abundant supply of timber suitable for house logs and fencing, and both coal and wood for fuel.\n\n*Settlements.*\n\nThe principal settlements are in the district south of Maple Creek, Dunmore and Medicine Hat. Parties in search of land, either for mixed farming or stock-raising, are advised to examine the country south-west of Swift Current station, along the Swift Current Creek, south and west of Gull Lake, south of Maple Creek, the valley of Mackay Creek that flows north from the hills crossing the track at Walsh, and south of Irvine and Dunmore.\nALBERTA\n\nThe Territorial District of Alberta, the great ranching, dairy farming and mineral county of the Canadian North-West, embraces an area larger than that of England and Wales together. Lying on the eastern slope of the Rocky Mountains, and bounded on the north by the Provisional District of Athabasca, lat. 55°, on the south by the International boundary line, on the east by the Provisional District of Assiniboia, and on the west by the eastern boundary of the Province of British Columbia, a length of some 300 miles from east to west, and 500 from north to south, it includes in its 107,700 square miles every variety of forest and stream land, grazing and agricultural land, mineral and oil districts. In it are comprised 45 millions of acres of the most fertile soil on the continent, and some of North America's best deposits of coal and metals.\n\nAlberta may be described as having three distinct surface features, viz.: prairie lands on the east, which are thickly timbered in the northern part of the province; then come the rolling lands or foothills, extending some 40 miles from the base of the mountains, mostly heavily timbered, and lastly the majestic mountains, the great backbone of this continent, walling its western boundary. It offers a valuable choice of locality to the intending settler. It is divided into Northern and Southern Alberta. Of\n\nNorthern Alberta\n\nMr. Leonard Gaetz, a resident of the Saskatchewan country, said on his examination before a Parliamentary Committee:—“A country pre-eminently suited to mixed farming. It has some peculiar features in this respect, that it is a well-wooded and well-watered country. It is a country where a settler going with little means does not need to expend his capital altogether to provide shelter for himself and his stock, but where, if he has not timber on his own land, he can get a permit from the Government and get 1,800 lineal feet of building timber, 100 roof poles, 2,000 fence rails and 30 cords of dry wood for 50 cents, and put up his buildings. He can husband his resources to expend in fitting himself out with stock and implements to carry on his work. I have seen wheat and oat straw that grew to the height of 5½ and 6 feet, and yet well headed and filled with plump grain.”\n\nHorses and Cattle.\n\nQUESTIONED by the Committee, Mr. Gaetz said of animals:—“A great many of them we do not house at all. Our young stock or yearlings simply go in the shed in the night, and around the straw stack in the day. Our breeding cows we house. My young horses were out this winter until the last week in January, though one of the coldest winters since I have been in the country. They were in perfectly good condition and healthy. Horses accustomed to it will get into one of those big sloughs and will stay there week after week, live well and come home fat. Speaking of last winter, our young\nhorses did not come home till Spring. We never fed them a pound of hay, but I do not want to see the recurrence of a winter like that again. I think a snowfall and cold are better than these mild winters.\n\nIt does not take any very great skill to raise cattle, which at twenty-eight or thirty months old will dress without an ounce of grain, 650 and 700 pounds of beef, or a three-year-old that will dress 800 to 850 pounds. I am speaking of what I have seen, and am testifying to what I know by personal experience. Then, Sir, it does not take a very great deal of skill in farming. Even a novice like myself in average years can grow crops of grain—oats from 50 to 75 bushels to the acre, and weighing 46 to 50 pounds to the bushel; barley from 45 to 55 bushels to the acre, and weighing from 51 to 57 pounds to the bushel; wheat from 35 to 40 bushels to the acre, and weighing from 62 to 64 pounds per bushel.\"\n\nVegetables and Fruits.\n\n\"Last year,\" said Mr. Gaetz, \"I have grown potatoes at the rate of 720 bushels to the acre. That is a phenomenal yield, but we can grow from 300 to 400 bushels of potatoes per acre, without any extra attention, skill or manure. We can also grow carrots, cabbage and cauliflower. I have frequently seen cauliflower at Calgary Fair that were a yard in circumference. In reference to small fruits I may say that this is another matter that has to be experimented upon. I have grown red currants, black currants and strawberries with considerable success, but not what would satisfy me.\"\n\nTHE SASKATCHEWAN VALLEY\n\nThe Edmonton District.\n\nROUND the old and important post of Edmonton and the mission in the neighborhood, thriving but not very extensive settlements have been established for some years. Heavy crops are harvested and a considerable quantity of gold has been taken from the river bars in the neighborhood. Edmonton has hitherto been reached only by carts across the prairies, or boats up the Saskatchewan, navigation being difficult except in the summer owing to shifting sand bars. It has now\n\nDirect Rail Communication\n\nwith the Canadian Pacific Railway, the coal mines in Southern Alberta and the markets of British Columbia as well as those in the east. The climate differs from that of Southern Alberta in that the\nrain and snowfall is heavier, and is comparatively speaking free from wind storms. It is therefore more favorable to the growth of cereals. The following instances are a few out of many showing the agricultural qualities of the district. The returns for 1891 were (at date of writing) not yet received, but the crop is reported as being to all appearances above the average.\n\nHarvest of 1890.\n\nW. NICOLSON, of Sturgeon settlement, had \"eight large stacks of oats from six and a half acres of land. At the threshing recently seven of the stacks yielded 700 bushels of oats. The remaining stack—not threshed because the machine broke down—contains about 100 bushels. This would bring the yield up to 123 bushels per acre, the heaviest on record in this district. The grain was badly lodged and was cut with the scythe, so that a large part must have been lost in harvesting.\"\n\nR. McKernan, of the south side, had thirty-five acres of crop yielding 2,394 bushels of grain. One and a half acres of wheat yielding 75 bushels, 10 acres of barley yielding 478 bushels, over 40 bushels per acre, and 23½ acres of oats yielding 1,901 bushels, over 80 bushels per acre.\n\nThere are two steam threshers at work in the Sturgeon settlement at present.\n\nD. B. Wilson threshed 282 bushels of wheat from seven acres.\nD. Craig threshed 900 bushels of wheat from 20 acres.\nGeo. Sutherland's wheat yielded 45 bushels to the acre.\n\nGood Wages\n\nare paid to those who desire to accumulate a little money before commencing work on their own homesteads, and those possessing a team of their own can find ready employment for it. In the North-West many men now own large and profitable farms who began a few years ago by hiring out to work on other peoples land. Those who have a little money can\n\nBegin at Once.\n\non their own account. Settlers with families have the advantage of being within reach of a well established community in and about the town of Edmonton, where there are schools, churches, etc., and at the present time there is a\n\nLarge Choice of Land\n\nopen to those who early take advantage of the opening of the railway.\n\nThere is no more beautiful country for mixed farming than in the neighborhood of Edmonton, and generally in the valley of the North Saskatchewan. It has the markets of both east and west open to it and there is a large quantity of excellent mixed prairie and timber land in proximity to the railway.\nTHE BATTLEFORD DISTRICT\n\nMr. S. A. MacFarlane, who has been in the North-West for many years, says: \"There is no finer country in the world than the Battle River and North Saskatchewan Valleys and no better crops are raised in any section on the continent than in that part of the North-West, of which Battleford is the centre.\" He knew people who had gone there without a dollar and in a short time had become very well off indeed, entirely through mixed farming. The whole secret of success in that country was possessed by any practical farmer.\n\nSpeaking of the fertility of the soil, he said, \"he knew farmers there who for five successive years had an average of over fifty bushels of oats to the acre. Last fall wheat averaged about thirty, and oats fifty to sixty. Roots and vegetables were always a good crop. As to the beef-producing capabilities of the country, it was only necessary to say that two-year old steers, fed altogether on the native grasses, dressed eight hundred pounds right along.\"\n\nThere seemed to be an impression that settlers going to the Saskatchewan district would of necessity require to take their stock with them at great expense and trouble. This was a mistake. Cattle had been raised around Battleford for fifteen years, and domesticated animals of an excellent class could be obtained at reasonable prices by new settlers coming in. Horses for farm or other purposes can be purchased right there. In fact the most extensive horse-raising establishment on the Saskatchewan is within twenty-five miles of Battleford, where animals of a most superior and suitable class are bred, and are to be obtained at a moderate cost.\n\nThe country is park-like, with alternate patches of grove and prairie. Lakes and running streams of excellent water are in abundance. The town of Battleford has the name of being one of the most beautifully situated places to be found anywhere. Lying, as it does, at the junction of two fine rivers, it would be hard to equal its attractiveness. The town is well provided with schools and churches. As the bulls-eye of one of the most fertile and productive sections of the continent, the future of the town is most promising.\n\n\"If you have any friends,\" said Mr. Macfarlane, in concluding, \"who know how to farm, and with free lands in a district possessing the best advantage that nature can bestow, you can't do them a better turn than direct their attention to the North Saskatchewan and Battle River country.\"\n\nThe country, though a very rich one has been closed for want of easy means of communication. The crossing at Saskatoon is now\n\nOnly One Day From the Capital.\n\nThere is abundant land to choose from, the even numbered sections being the property of the Government and open to free homesteading.\n\nPrince Albert District.\n\nNumerous settlers in the Prince Albert district who have removed from other parts of the country testify to the fertility of the soil.\nWm. Miller came from Huron County, Ont., and moved to the Saskatchewan in 1873, and took up land quite close to where Prince Albert now stands. Likes the Saskatchewan country better than Ontario or Manitoba. Mr. Miller has kept a diary since he came to the country, so that his statements are not made from memory. He states that his oat crop has varied from 40 to 80 bushels per acre in different years, except 1889, when it was about 20 bushels per acre. Horses, cattle, sheep and hogs have all done well with him.\n\nChas. Mair, for sixteen years a resident, has farmed for ten years on quite a large scale. He has never had what could be called a failure in wheat. There has always been abundance of hay, even during the driest years, and vast quantities of the natural prairie hay goes to waste annually.\n\nJames McArthur, banker, Prince Albert, is interested in a large sheep ranch. He says it costs less to keep sheep over the winter than during the summer. The region is a great hay country, and hay can be put up for the winter at a cost of about $1 per ton. Sheep can be kept through the winter at a cost of about 25 cents per head when handled on a large scale. They are free from disease. Hay has never been scarce. The growth of the natural prairie grass is luxuriant. Water is readily obtained everywhere. Where there is not good surface or running water, it can be obtained in wells at a depth of 10 to 14 feet. Mr. McArthur also believes the country is remarkably well adapted to raising horses, and grain and root crops are phenomenally successful.\n\nSOUTHERN ALBERTA\n\nTO-DAY Southern Alberta stands unequalled among the cattle countries of the world; and the unknown land of a few years ago is now looked to as one of the greatest future supply depots of the British markets.\n\nGreat herds of range cattle roam at will over these seemingly boundless pastures. The profits to the stockmen are large as can be readily imagined when it is shown that $42.00 per head was paid for steers on the ranges this year, animals that cost their owners only the interest on the original investment incurred in stocking the ranches, and their share in the cost of the annual round ups. Yearlings are now being sent into this country all the way from Ontario to fatten on the nutritious grasses of these western plains, and it is reckoned that after paying cost of calf and freight for 2,000 miles, the profit will be greater than if these cattle had been fattened by stall feeding in Ontario.\nThere are now on the ranges of Alberta hundreds of herds of fat cattle, which at any season are neither fed nor sheltered; cattle, too, which in point of breeding, size and general condition, are equal, if not superior, to any range cattle in the world. Shorthorns, Hereford and Angus bulls have been imported at great expense; but the interest on the outlay has been both satisfactory and encouraging, and the young cattle of the Alberta ranges would compare favorably with the barnyard cattle of Great Britain. The local market annually consumes from eighteen to twenty thousand beefes, with a growing demand, while the great market of the world is within easy access. The number shipped for England is annually increasing.\n\nSheep.\n\nAlberta to-day offers what the Australian colonies had to offer thirty years ago; millions of acres of rich grass lands, well watered and adapted in every respect for first-class mutton and fine wool, where cold rains and dust storms, so injurious to the fleeces, are almost unknown. It also has a railway running through the centre of the grazing lands and markets for mutton and wool within easy reach. The clear, dry bracing air of the country suits sheep, which suffer from little or no disease. Sheep mature early owing to the fine quality of the grass. To winter them safely, good, warm roomy sheds, plenty of hay (10 tons to the 100 head) and attention is all that is wanted.\n\nHorse Raising.\n\nAs a horse breeding country, Alberta will be to Canada what Kentucky is to the United States. A country where the horse attains the very height of perfection. Its high altitude, its invigorating and dry atmosphere, short winters, with luxuriant grasses and plentiful supply of purest water combine to make it eminently adapted for breeding horses. Although the industry is still very young, the Alberta horse has become noted for endurance, lung power and freedom from hereditary or other diseases.\n\nThere are at present in Alberta several grades of horses, varying in point of quality from the hardy (Cayuse) Indian Pony, to the beautiful, well formed thoroughbred. Thoroughbreds from Great Britain and Kentucky, Clydesdales from Scotland, Percherons from France, and trotting stock from the United States, have been imported at great expense, and the result is that the young horse of Alberta will compare with any in Canada.\n\nAs an investment, horse ranching in Alberta offers strong inducements, and the farmer or capitalist coming to this country and wishing to engage in this business, will find millions of acres of unoccupied meadow lands, possessing every attraction and advantage, from which to choose a location; will find, too, a country where the cost of raising horses is unusually low.\n\nDuring the last five years many thousand cattle, sheep and horses have been raised in the southern half of Alberta on the rich grass without any feeding or shelter other than the shelter found along the hill sides or in clumps of trees. The cattle and sheep when taken off the pasture are fat and fit for any butcher's shop in the world, and the horses are rolling fat.\n\nWhile the south is so well adapted for cattle and horse ranching, it is also an excellent country for mixed farming. But the northern\ncountry is not so well adapted for raising live stock altogether out of doors—there being more snow; it is, however, equally good, if not better, than the south in most respects for general farming. It is eminently suited for mixed farming, and as a butter and cheese producing district, should win for itself an enviable name.\n\nHow to Obtain a Ranch?\n\nIf it is the intention to embark in the business of raising cattle, horses or sheep on a large scale, an extent of ground equal to the rancher's requirements can be obtained under lease from the Dominion Government on the following easy terms:\n\nSettlers can obtain leases of public lands not exceeding four sections (2,650 acres) in the vicinity of the settler's residence. The lease shall be for a period not exceeding twenty-one years. The lessee shall pay an annual rental of two cents an acre. The lessee shall within three years place one head of cattle for every twenty acres of land covered by his lease; at least one-third of the number of cattle stipulated for shall be placed on the range within each of the three years from the date of the order-in-council granting the lease. Whether he be a lessor or not, no person shall be allowed to place sheep upon lands in Manitoba and the North-West without permission from the Minister of the Interior. Leases of grazing lands, to other than settlers, or in larger quantities than that specified above, are granted only after public competition. Full particulars can be obtained on application to the Minister of the Interior, Ottawa.\n\nMaps showing the lands now under lease can be seen at the Land Commissioner's Office in Winnipeg.\n\nMaps can be secured there free of cost showing the lands open for sale in the ranching districts, and their prices.\n\nThe Cost of Starting a Ranch.\n\nFor the benefit of intending settlers an account of the cost of starting a ranch is herewith given:—Take as example a person bringing in a band of 500 head of good grade two-year old heifers, at say $35 (£5) also 20 bulls at $50 (£10). In the first place, he must locate a suitable site for buildings, etc., in the vicinity of good water; a running stream is of course preferable. Then comes the erection of his buildings—a log house which will cost about $150 (£30); a horse stable to accommodate eight horses, $50 (£10); a shed 100x20 feet for weak cows and calves during winter, say $75 (£15), and a pole corral for branding calves, etc., about $15 (£3). These buildings will be sufficient for the first year, and can be added to as his band increases. Next comes the purchasing of say fifteen saddle horses at about $60 (£12) per head; one team of work horses at $250 (£50); mower and rake $125 (£25), and a wagon and harness $125 (£25). This will be the principal outlay; in addition there are the smaller tools, furniture, provisions, etc.\n\nA practical man gives the following figures in regard to the cost of raising stock and the average profits.\n\nI would estimate the cost of raising a steer to marketable age of say four years old, as follows, viz.:—Take one hundred cows with an increase of at least seventy-five per cent. and estimating the cost of keep for each cow for\nOne year to be $301.00\nAnd keep each calf for 1st year $375.00\n2nd $225.00\n3rd $225.00\n4th $225.00\n\nTotal costs of 75 steers at 1 year old $1,350.00\n\nOr $18 per head which will readily sell at $40 per head, leaving a profit of $22 each. I consider the above a fair estimate of the cost. As I am now feeding my stock at less than three cents a head per day on feed bought in the stack and reckoning drawing one and one-half miles at one dollar per load.\n\nYours respectfully,\n\nJ. E. Kennedy.\n\nDayisburg, Alta., 22nd January, 1890.\n\nConsidering a man established with his stock in the country, buildings erected, stock branded and turned loose on the range and two men hired, who will want about $25 per month for the year, we will now take up the life of a cow-man from this time. His cattle will want but little attention until fall, so his work is to provide for them in case of a hard winter in the way of hay which can be cut on the prairie. He should provide himself with say 100 tons which would be stacked at his buildings if possible. After having he will be employed in fixing up generally and his men in riding the range and keeping an eye on the cattle until the fall roundup which takes place the latter part of September.\n\nButter Making in Alberta.\n\nA PRACTICAL man in Alberta makes the following statement about butter making in Alberta:\n\nA settler arrives here having means to put up a small house on his 160-acre homestead, and has also means to get a span of horses, a plough and harrow, with enough of seed to plant a few acres. Then, if he has a wife, and $100 left, let him buy two cows; if more money still, more cows—say five cows the first year. From these he will be able to make five pounds of butter daily during five months, worth in our market 25 cents a pound (1s.). This will support himself and wife. The milk will also feed three calves and a couple of pigs. Now, it must be remembered that the care of these need not prevent him from cultivating a good garden and attending to a good number of acres of crops besides. And it must also be remembered, in connection with all this, that no matter how favorably the season, or how great the return from the cultivated acres may be, the profit to be derived from properly attended milch cows is sure and well worth consideration.\n\nOf course, the above applies to individual beginnings of an industry that will unavoidably merge into a co-operative dairy farming, when the creamery will be established in the centre of the township where the individual, or company, will gather the cream from the surrounding farmers, and employ a practical and trained butter-maker, who will produce from the uniform and unequalled cream of Alberta, the gilt-edged creamery butter of commerce, unsurpassed, if equalled, by any in the world.\n\nThe leading features that mark out this section of Canada, as the country par excellence, for the manufacture of cheese and butter, are: 1st. The rich natural grasses on which the cows can graze the\nwhole year around, doing away with the necessity of artificial feeding. 2nd. The entire absence of highly flavored noxious weeds, the consumption of which taints the product of the dairy. 3rd. The summer temperature cooled by the mountain breezes, with the sparkling springs of cold mountain water with which the country abounds.\n\nMinerals.\n\nTHAT Alberta, like British Columbia, possesses untold wealth in her immense mineral deposits, is no longer a matter of speculation. For years past gold in small but paying quantities has been found on the banks and bars of the North Saskatchewan River. Gold color is found in many of the streams and rivers of Alberta, and as the country is thoroughly prospected there is every reason to suppose that rich finds will be discovered. Large veins of galena have been located which are pronounced by experts to contain a large percentage of silver. Capital alone is wanting to make them treasuries of wealth to the country. Copper ore in enormous quantities has also been found, said to contain 60 per cent of pure copper. Iron ore has been discovered in various parts of Alberta. A forty foot seam of hematite iron containing a very large percentage of iron, exists at the base of Storm Mountain, quite close to the Canadian Pacific Railway line, and other large seams are known to exist in the McLeod District in the vicinity of Crow's Nest Pass.\n\nAs to the quantity of the coal deposit of Alberta, it is impossible to form any estimate. The coal mines already discovered are of sufficient extent to supply Canada with fuel for centuries. At Lethbridge one and a half million dollars have been already expended in developing the coal mines of one company. At Anthracite over one hundred thousand dollars have been expended in opening up the hard-coal deposits of the vicinity. Hard coal has recently been discovered at Edmonton, semi-anthracite at Rosebud, anthracite near Canmore, and vast deposits in Crow's Nest Pass in the southern district.\n\nSoft coal is so plentiful that the certainty of a cheap fuel supply is well assured. There is hardly a district of this vast country without a deposit of coal.\n\nThe great mineral industries are still in their infancy. Immense fortunes are hidden in the earth awaiting the hand of prospector and capitalist.\n\nClimate of Alberta.\n\nTHERE is no place on this western hemisphere that enjoys more bright sunlight, during the year around than Alberta, and it enjoys at least fifty per cent more than the average.\n\nThe spring is the most trying; not because it is particularly wet or severe, or long, but because with a mild winter, one expects to see a correspondingly early spring. In Alberta one is usually disappointed on that score, because the spring there is very rarely any earlier than in Manitoba or Ontario. The winter is shortened mostly by its often being nearly New Year before there is any winter weather to speak of.\n\nThe summer once entered upon, the weather is superb; between the days of bright, life-producing sunshine, copious warm showers fall bathing the rich soil like a bathed and forcing vegetation forward in rapid and rank profusion.\nThe autumn weather of Alberta is perfect. A well known writer says of it: \"Towards the end of September the air gets chilly at night, with frost enough to make the roads crisp in the morning; the sun rises in matchless splendor, the blue vault of Heaven is unmarked with even the shadow of a cloud, the atmosphere clear and light, bright and invigorating, thrilling every pulsation of feeling, sharpening the intellect, and infusing ruddy energy into every part of the body.\"\n\nThe winter differs very much from that of the eastern part of the Territory. There are bright, keen days, with low readings of the thermometer, alternating with very much warmer weather. The thermometer may be several degrees below zero in the forenoon, and in the afternoon a south wind (Chinook) may spring up, and in a few hours the temperature will be 40 or 60 degrees above zero, and for days, often weeks, in the winter season, Albertans enjoy summer weather, consequent on these south-west warm winds. Usually cold weather sets in about the first of January and continues with intervals of Chinook weather, until the beginning of March, when the real cold weather is past. After that time there are occasional cold snaps, generally of but a few days' duration.\n\nThe Capabilities of a Township.\n\nLet us get down to figures and see the practical possibilities of a single township of Alberta pasture land. A township is six miles square, and contains 36 sections of 610 acres each. Let us suppose this divided into 72 farms of 320 acres, each farm capable of sustaining, both summer and winter 20 cows; this makes 1,440 cows in the township. It will be admitted that a fair average cow will yield sufficient milk and cream to make 1 lb. of butter a day for five months in each year. Now 1,440 lbs. of butter produced daily at, say, 20 cents per pound (10c.), will amount in a season to the handsome sum of $12,000 (£8,400). Just think of this sum coming into a single township every season; and remembering all the while that after the farmer milks his cows in the morning, he can then, until the milking of evening, attend to all the demands and duties of his profitable mixed farming besides.\n\nMarkets.\n\nBut it may be asked; where will you find a market for all this butter? Well, the question of a market need give little trouble. It is certain that if there were a hundred creameries in Alberta, each making a greater output than the above, there would be twenty commission merchants in active competition to purchase the productions. Butter being a prime necessity of civilization, must not only be of good quality, but must be produced in large quantities to make the handling of it profitable. It is the most concentrated form of agricultural production, shrinking less in value by transportation than any other when properly prepared for export. And it is perfectly safe to predict that the time is coming when train-loads of Alberta butter will be shipped to both the eastern and western seaboads, finding a most ready market in Europe, when its excellence and reputation is once established.\n\nAn experienced man says: \"Foreseeing the future and the demand for our productions is why, I would earnestly encourage the...\"\nincoming settler to the inviting lands of Alberta to make dairy-farming his principal vocation, the most practical contributions towards which are common sense and a good wife.\n\nAvailable Lands.\n\nOUT of the lands so far surveyed by the Government, it is estimated that at least twenty million acres are open for free entry. Two million acres of this lies within the Province of Manitoba. It is difficult now to obtain Free Grant Lands in the Province of Manitoba within easy distance of a railway. An odd quarter of a section is to be picked up here and there in well settled parts of the province, but practically speaking, the settler must go twenty to thirty miles from a railway before he can expect to find free land that will suit him. There is considerable land to be had south-west of Oak Lake, in the Brandon agency, within the boundaries of the Railway Grant. Eastern Assiniboia is fairly well settled, but no difficulty is experienced in getting a homestead close to the track after the second principal meridian is crossed. In Western Assiniboia and Alberta, with the exception of the Calgary District, homesteads can be had in every township. Valuable locations can be secured within a mile of the railway stations. Then for the wanderer there are untold acres to select from in the District of Saskatchewan and Northern Alberta, at Prince Albert, Battleford, Edmonton, and other points in the valley of the Great Saskatchewan. These districts are now being opened up by the construction of railways from Regina and Calgary into the very heart of the Saskatchewan country.\n\nRailway Lands.\n\nIt is a mistake for those who have capital to be tempted by the offers of a free homestead, into going far away from a railway. To such we would say, examine well the lands offered for sale by the Railway Company. The facilities offered for your doing this will save a great deal of expense and valuable time necessarily lost in selecting a free homestead.\n\nThe Company's lands are of every description; meadow, bush, level or rolling prairie, heavy clay lands, and light loamy soils. The individual likings of every settler can be met with both as regards quality and price.\n\nAdvice to Settlers.\n\nTHE newcomer need not fear that when he reaches Winnipeg he will fall into the hand of thieves, imposters or unfriendly people. The train is met upon its arrival by the agents of the Government and of the Canadian Pacific Railway Company, who take charge of immigrants and give them all the assistance and advice they need in a strange land.\n\nChoosing a Location.\n\nIN cases where they have already fixed upon some locality for settlement, where friends are awaiting them they are shown how to proceed directly to that point. If they have not decided upon such a locality, but intend to seek a home somewhere further west, they can obtain every particular at the Land Office in Winnipeg.\nTheir nearness to a railway station or market, the amount of settlement, the nationality of people in the neighborhood, and the exact character of the soil can be learned at this office. Every quarter section of the whole vast area owned by the Railway Company has been gone over by official inspectors and reported upon in detail.\n\nAll this information is open to the intending settler. If the land of a certain section is sandy, or rocky, or marshy, or alkaline or otherwise unsuitable for farming, he is told so; if it is good land for grazing, but poor for farming, he learns that; if it is thoroughly fertile and desirable, this will be pointed out. In short, the whole truth, whether it is favorable or unfavorable, can be learned from the maps and surveyor's notes shown in the office.\n\nWhere Should I Go?\n\nIf you want to confine your farming purely to grain growing, select your land in\n\nManitoba or Eastern Assiniboia\n\ngetting as near to a railway station as possible. If for cattle, horse or sheep raising,\n\nWestern Assiniboia or Alberta.\n\nMixed farming can be carried on to advantage in any of these provinces.\n\nMunicipal Matters.\n\nMANITOBA has a Provincial Government elected by the people. The people of Assiniboia, Alberta, Saskatchewan and Athabasca manage public affairs through a small representative body, elected by the people. The Assembly meets once a year at Regina, the capital of the Territories, and is presided over by a Lieutenant-Governor appointed and paid by the Dominion.\n\nSchools.\n\nThere are most liberal provisions made by the Government for schools. Two sections, making 1,280 acres in each township, are set apart by the Dominion Government, the proceeds of which, when sold, are applied to the support of schools.\n\nThere is a superintendent in each district, and teachers are required to pass a rigid examination. The result is that public schools throughout the West are highly creditable and effective. Academies and colleges are found in Winnipeg and several of the larger towns, some of them under the control of religious bodies, others in the form of private enterprise. Thus a thorough practical education is placed within the reach of all.\n\nTaxation.\n\nThe matter of taxes is another most important point of difference in favor of the Canadian settler. By the very simple municipal organization of communities (as fast as settlements require any government at all), local affairs are managed at home with but little expense. A reeve and council are elected each year by the people, and\nthis organization takes charge of all local matters, the most important item of which is road building and repairing. There being no turnpike trust, each landholder works out his road-tax by his own labor, or the labor of his teams. Government aid has hitherto been given towards the few expensive bridges or other public works called for by the people. Courts and police are also provided by the Government. These circumstances result in taxation being very light.\n\nReligious Matters.\n\nChurches are supported by the voluntary contributions of the people. Every man is free to worship according to the teachings of his own creed, for places of worship of every denomination are abundant. In fact the number of these bears eloquent testimony to the high regard in which religion is held in this new country.\n\nSocial Surroundings.\n\nNo matter from what part of the world the colonist may come; he will have no difficulty in finding and locating among fellow-countrymen. Every nationality of Europe is represented among the citizens of the larger centres, but the population is principally composed of English speaking people.\n\nThe toils of these people are not so severe as to compel them to forego all or any of the little social pleasantries which add so greatly to the enjoyment of life. Game of many varieties is so plentiful that a holiday with the gun will furnish pleasure and a most acceptable addition to the farmer's larder. The ease with which really good sport may be obtained is frequently a powerful inducement to young Englishmen to make their homes in this country.\n\nIn any case where an intending colonist desires more particular information about a certain locality, he is further advised to write to one or other of the residents whose names are mentioned in this pamphlet.\n\nCost of Railway Tickets Refunded.\n\nSpecial round-trip explorer's tickets can be obtained at the Company's Land Office, the full price of which will be refunded if the holder purchases 160 acres or more. In this way, land hunters are enabled to make a personal inspection of the land free of cost to themselves.\n\nFor the convenience of investors, every station agent in the west is supplied with price lists of the lands in his respective district, and is instructed to give land seekers every possible assistance in enabling them to see the lands.\n\nSouthern Manitoba Lands.\n\nSpecial attention is called to the lands of the Manitoba South-Western Railway Company, administered by the same department as that charged with the lands of the Canadian Pacific.\n\nOwing to certain difficulties, which have now passed away, the railway lands in Southern Manitoba were for a long time locked up from sale or settlement. In the meantime, all the available Government lands were occupied and farmed, so that at the time the railway lands were thrown open for sale, they were in immediate demand.\nTHE CANADIAN PACIFIC RAILWAY\n\nIs the Only Rail Route to the Fertile Farm Lands and the Broad Pastures of\n\n... Manitoba ...\n\nThe North-West Territories\n\nAnd the Mining, Lumbering and Farming Regions of\n\n... British Columbia ...\n\nAnd is also the best Route to WASHINGTON TERRITORY and points on Puget Sound and the Pacific Coast.\n\nNO RAILWAY in America offers so many accommodations to SECOND CLASS, or COLONIST, Passengers at so Little Expense as does the CANADIAN PACIFIC. Colonists are able to travel to NEW HOMES in MANITOBA, the NORTH-WEST, or BRITISH COLUMBIA, with nearly as great comfort as First Class Passengers.\n\nCOLONIST SLEEPING CARS.\n\nTHE CARS devoted to the use of Colonists are taken upon the same fast trains with the first class cars, and every one is a Sleeping Car, going through WITHOUT CHANGE to the PACIFIC OCEAN. These cars are similar in size, warmth and ventilation to the first class cars, but are not upholstered. The seats are arranged in pairs facing one another on each side of the car, are of comfortable shape and so made that they can be joined into a berth ready for the spreading of a mattress and bedclothes. Every passenger has a single berth and a ticket is furnished for it EXACTLY the SAME as in FIRST CLASS SLEEPER. Over each pair of seats a broad upper berth, hinged against the wall of the car, can be let down and form an additional sleeping place. NO EXTRA CHARGE IS MADE FOR THESE SLEEPING ACCOMMODATIONS; THEY ARE A PART OF THE REGULAR CAR. Second Class Passengers, however, must provide their own bedding. If they do not bring it with them, a complete outfit of mattress, pillow, blanket and curtains may be bought of the Agent of the Company at the point of starting at a cost of $2.50 (10s). (These articles become the property of the purchaser.) The curtains may be hung around the berth, turning it into a little private room. SMOKING IS NOT PERMITTED in any part of this car, a regular smoking-car forming part of every train.\nThe Highway to the Pacific Coast\n\nThe BEST, CHEAPEST and QUICKEST WAY TO Manitoba, Assiniboia, Alberta, Saskatchewan and British Columbia\n\nIS BY THE Canadian Pacific Railway.\n\nFor freight or passage, hand books of information, Around the World Folder, or Trans-Pacific and Japanese Guide, apply to:\n\nC. E. McPHERSON, Assistant Gen. Pass. Agent,\nE. V. SKINNER, General Eastern Agent,\nG. SHEEHY, District Passenger Agent,\nJ. F. LEE, District Passenger Agent,\nM. M. STERN, District Passenger Agent,\nW. R. CALLAWAY, District Passenger Agent,\nW. F. EGG, District Passenger Agent,\nD. E. BROWN, Assistant General Passenger Agent,\nROBERT KERR, General Passenger Agent,\nC. E. E. USSHER, Assistant General Passenger Agent\n\nED. HOLLOWAY,\nGeneral Agent China and Japan,\nHong Kong, Shanghai and Yokohama.\n\nD. McNICOLL, General Passenger Agent, Montreal.\n\nGEORGE OLDs,\nGeneral Traffic Manager,\nMontreal.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001867.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 56, "total-input-tokens": 78976, "total-output-tokens": 27353, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 85, 1], [85, 3575, 2], [3575, 3575, 3], [3575, 3575, 4], [3575, 3575, 5], [3575, 3575, 6], [3575, 3799, 7], [3799, 3799, 8], [3799, 5897, 9], [5897, 8905, 10], [8905, 12171, 11], [12171, 12171, 12], [12171, 14742, 13], [14742, 17612, 14], [17612, 21039, 15], [21039, 21039, 16], [21039, 24306, 17], [24306, 27736, 18], [27736, 27736, 19], [27736, 31802, 20], [31802, 34357, 21], [34357, 34357, 22], [34357, 36343, 23], [36343, 39201, 24], [39201, 42646, 25], [42646, 42646, 26], [42646, 45521, 27], [45521, 49067, 28], [49067, 52404, 29], [52404, 52404, 30], [52404, 55978, 31], [55978, 59676, 32], [59676, 63757, 33], [63757, 65449, 34], [65449, 68250, 35], [68250, 68250, 36], [68250, 71131, 37], [71131, 73400, 38], [73400, 73400, 39], [73400, 75811, 40], [75811, 78740, 41], [78740, 81231, 42], [81231, 81231, 43], [81231, 84473, 44], [84473, 87646, 45], [87646, 90646, 46], [90646, 90646, 47], [90646, 93787, 48], [93787, 96999, 49], [96999, 96999, 50], [96999, 99887, 51], [99887, 102416, 52], [102416, 102416, 53], [102416, 105291, 54], [105291, 107270, 55], [107270, 108159, 56]], "primary_language": ["en", "en", "None", "None", "None", "None", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "None", "en", "en", "None", "en", "en", "en", "None", "en", "en", "en", "None", "en", "en", "None", "en", "en", "None", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, true, true, false, true, false, false, false, true, false, false, false, true, false, false, true, false, false, true, true, false, false, true, false, false, false, true, false, false, false, false, false, true, false, false, true, false, false, false, true, false, false, false, true, false, false, true, false, false, true, false, false, true]}}]