[{"id": "2b20845bad560537601dc847252198dc96efb7b6", "text": "RETURN\n\n(45c)\n\nTo an ADDRESS of the HOUSE OF COMMONS, dated 14th April, 1886;—For copies of all the depositions or other evidence submitted in favor of Half-breeds or Metis sentenced to imprisonment in the Gaol at Regina, and in the Provincial Penitentiary of Manitoba; and also all depositions submitted in behalf of André Nault and Abraham Monteur, Metis prisoners confined at Regina and Battleford.\n\nBy Command.\n\nJ. A. CHAPLEAU,\n\nDepartment of the Secretary of State,\nSecretary of State.\n\nTHE QUEEN vs. JOSEPH ARCAD, ET AL.\n\nNorth-West Territories,\n\nTo wit:\n\nI, Alexis André, of Prince Albert, Priest, Superior of the Catholic Mission of Carlton, being duly sworn, depose and say:\n\n1. I have lived twenty-five years among the half-breeds in Dakota and Manitoba, and fifteen years among them at that part of the Saskatchewan where the late rebellion broke out. I personally know almost every one of the half-breeds, and am thoroughly well aware of the various ways and means by which Louis Riel secured the adhesion of these people.\n\n2. I most solemnly declare from my own personal knowledge that with the exception of Gabriel Dumont, Napoléon Neault and Damase Carrière, now deceased, not one of the other half-breeds had the least idea or suspicion that there was any probability or danger of rebellion, until they were so completely involved in the toils of Riel, and he had led them on until they were so compromised, that there was no escape for them. On the one side were most glowing promises of peace and plenty for them if they would follow him as their leader; on the other they were made to religiously believe that they had no mercy to expect at the hands of the soldiers, police, or from the Government of Canada; if taken prisoners or wounded, they were told nothing but death with unpitying torture awaited them at the hands of the soldiers and police, and their wives, daughters and sisters would be dishonored before their eyes, their children hacked to pieces, and all their earthly property utterly destroyed, and their whole nation exterminated by the brutal soldiery. But if anything were wanting to complete the terror of those poor, deluded people, it was supplied when pointing out the fate of Charles Nolin, who had been sentenced to death by Riel for desertion, and ordered to be shot on view as a deserter, was imprisoned by the police. The treatment of Charles Nolin by the authorities gave great force to Riel's threats, and above all to a great extent gave an appearance of truth to the assertion of Riel when he so often named his unfortunate dupes, that there was no mercy to be expected for them if they were taken prisoners or surrendered to the police or Government.\nIt will be remembered that a proclamation was issued by Major Crozier at my suggestion, knowing that a great many of the half-breeds were kept by force, and had been brought by force into camp. The proclamation of which a copy is herewith produced offered protection to all those who were forced to take part in the rebellion, on their surrendering themselves to the commanding officer at Carlton or Prince Albert. Now, on this proclamation, Charles Nolin, when he made his escape, at once went to Prince Albert with the proclamation in his pocket, confident in his loyalty, and in the promise given in Her Majesty's name, applied to the officer in command for protection. He was rewarded for his loyalty and confidence by being ironed and cast into prison, where he was kept for two months, without any charge or accusation being made against him, and without any explanation being given to him, and was at length liberated without any explanation or excuse.\n\nThis most illegal and ill-judged proceeding gave fearful weight to Riel's assertions. \"See,\" cried he, \"what you have to expect if you desert as Nolin did, see the mercy that will be shown to you, and think of your wives and families. Nolin is a deserter, he will be shot if I can catch him, and the police have him chained in prison, from which he will be brought out only to be hanged like a dog, &c. Now you know that death is the certain portion of any traitor or deserter from our sacred cause, or of those who attempt to escape from our camp when the lives of their friends and families depend on all being true to our holy cause.\" The poor people were also terrorized into submission by their cunning leader pointing out to them anyone deserting now in the hour of danger, in the face of the enemy, would live a life of shame, abandoned by all honest and brave men, would go down to the grave dishonored with the name of coward, and would leave behind them a memory loaded with disgrace, which would be carried on his brow by every one of his descendants to future generations.\n\nPierre Parentean I have known since I met him in the Red River Settlement, now Manitoba, since 1862. He is a man of 72 years of age, and has eleven children, and since I first knew him has been a man of peace, and who was remarkable for the good influence he exerted over the people of his race and kindred, who, when on the plains in days now passed, a leader of his people he prevented many a bloody deed between the Indian tribes and half-breeds, and always was on the side of peace and order. This good old man was misled by the wily Riel telling him that the younger men of his race required the soothing and pacifying influence of the old friend and counsellor of their forefathers; that it was his duty to become a leader or counsellor among the people in their peaceful efforts to secure their rights. That it was by such assistance as his that he depended upon avoiding all approach to violence, and to succeed in keeping union and peace among the half-breed people. This poor old man was borne on by the appeal to his heart and conscientiously did what he thought was right. He was not in conscience or in fact guilty of any disloyal thought or action, and stands before God and man to-day, although in a felon's cell, an honest man. To keep such an aged and respectable man as this any longer in prison must be to strike at the heart of justice and render law a thing of scorn. His house has been burned down, and all his horses and some of his cattle are lost or stolen.\n\nEmmanuel Champagne I have known since 1861. He was then a resident of Dakota, and was doing a considerable business at Pembina during the horrors of the Sioux massacre in 1862, and has a wife and seven children. Champagne saved the lives of many white men and women at the risk of his own life and property, and is gratefully remembered by many of the white people of Dakota to this day. After living in Red River Settlement and Manitoba, respected for many years, he came to the Saskatchewan about six years ago, and lived at Batoche, where he had a very fine place and a large business. I believe he was north at the time of the breaking out of the rebellion. He was worth at least twenty-five thousand dollars—to-day he is a ruined man. When Riel proposed to the old man to join the movement of the half-breed rights he promptly refused to do so. Persuasion of all kinds failed to induce him to go in with Riel. When Riel and his followers came to Batoche, Champagne was again solicited to join the movement, and, on positively refusing to do so,\nthreats were used instead of sweet words. Unless you consent to become a member of the council your whole property will be pillaged, your life will not be safe, you will be at the mercy of those who wish to abuse you, and by threats and force the old man was kept there, but he acted as he always had done, defended those who were in danger. To him Tom McKay owes his liberty, if not his life, and to McKay's being at liberty the Government of Canada owes the fact, to a great extent, of the speedy suppression of the rebellion. I have no hesitation in declaring that Champagne, instead of being in prison as a malefactor, ought to be distinguished by the Government as one who was loyal and true to his Queen and country in a time of trying danger. One thing is certain—a very short time longer in prison, and death will deliver him, as he is sick, old and failing fast. He is between sixty and seventy years old.\n\nMaxime Lopine I know well. He was a leading man in Manitoba before he came to the Saskatchewan. He was in favor of constitutional agitation to secure the rights of the half-breeds, but was positively opposed to violence of any kind, and it was only by compulsion he was kept among the Riel people. He opposed himself to Riel in every way he could, and prevented a great deal of violence and mischief by his determination. He was always very moderate and peaceful in his conduct. He has a wife and six children, and is about fifty years of age.\n\nPierre Gariépie is an old man of fifty-five years of age, and has a wife and seven children, and has been all his life nearly on the plains as a hunter. He has a large family, and is ignorant of the ways of political tricksters and civilized agitators. He is just one or two degrees above the Indian, but was a leader among the plain hunters. Riel made him believe there would be no trouble or violence, and when the wounded at Duck Lake were about to be brutally massacred by the Indians it was this old man in particular who saved them.\n\nAlbert Monkman I have known for two years past. He is a man who has been very much, and I think unfairly, abused and misrepresented. I always found him kind and good, and he always took the part of the weak and defenceless against Riel, to his own very great danger and risk. The opinion I get of him from my brother priests is most favorable. He prevented the burning at Duck Lake and St. Laurent of the Catholic churches, although not a Catholic himself, and was imprisoned by Riel because he opposed him in every way he could and wanted to escape from the rebel camp. I sincerely believe that Monkman was a good, true and loyal man, who was placed in most difficult circumstances, and acted amid danger and difficulty as few men would dare to do for the best interests of the country, even at the imminent risk of his life.\n\nPhilip Gariépie, forty-eight years of age, I have known for twenty-five years. He has been married for twenty years, and has a large family of six children. All the settlers know this man and respect him. He is one of the most respectable and peaceable men in the whole country, kind-hearted and gentle as a woman. I am informed that he is accused with having abused a wounded man—Newett. From my personal and intimate knowledge of this man's character and disposition, I do not hesitate to pronounce this accusation to be false and unfounded. It is repugnant to every feeling of the heart of a man like Gariépie. It is the act of a savage and brutal and wolfish nature and disposition. He is quite the contrary—kind, amiable and charitable, while his accuser, who is, if I am rightly informed, one Lovèque, is totally unworthy of belief. He came to the Saskatchewan poor and miserable, and was treated kindly by Gariépie, whom he now tries to ruin.\n\nJoseph Arcand is a poor, harmless kind of individual, about fifty years of age, with a wife and six children living. He was plunged in misfortune at the time of the rebellion. He lost two children by death during that time, and was almost in despair. He took no part in any fight, and was sent away to protect the prisoners in Poundmaker's camp, where his conduct was kind and considerate. The poor man is still keenly suffering from the sad loss of his children, and is an object of pity more than vengeance.\nAlexis Labombarde is a poor, old, almost blind man. He has a wife but no children, eighty-two years of age. I have known him for twenty-five years past. I was sent by the Government as a commission to the Sioux in 1862, during the massacre, and this old man was my interpreter at the time. I found him honest and reliable. He has been acting as an interpreter the greater part of his life, and he is now accused of acting in that capacity between Riel and the Sioux. He did so without any evil intent, and without any idea that he was doing wrong. I know myself that he told the Sioux to be moderate and not to kill; this I know from the Sioux themselves who told me. Now, to punish this old man for acting as an interpreter would be just about as just as to punish a telephone for carrying sound. I do not think the Government of Canada will advance their own glory or the interests of the Dominion by going to the cradle to find criminals, or on the verge of the grave to find victims.\n\nPhilip Garnot I have known for about four or five years. He is a very nervous and timid creature, with very little courage or decision of character. Riel ordered him to take up arms; he refused to do so, and continued keeping his little boarding house and attending to his business. Day after day for four days Riel ordered him to come and take part in the movement, at last Riel ordered him to be dragged to the camp, where overpowered by terror for his life and fear of loss of his property, he consented to act as secretary, but refused to fight, or to resort to the use of arms. It must be remembered that having a gun in one's hand in Riel's camp was no proof of disloyalty or of being a fighting rebel. Many had to carry a gun to protect themselves or their property from the savages who were not at all particular whose property they took when the desire possessed them. I have reason to know that Garnot was invariably kind and considerate to the prisoners and to all those whom he could assist in his peculiar position.\n\nAlexander P. Fisher I have known for twenty-five years, part in Manitoba and in the Saskatchewan. He is an innocent, flighty kind of fellow, who is always ready and anxious to create a laugh. He was the owner of the ferry and it was all he had to support his family. He was compelled to remain to try and save his ferry and wire cable as it was his all. He was always opposed to the Riel movement, and it was only abject fear of death that caused him to remain in the camp in addition to the fact that his three little daughters were in the convent school, and he feared if he escaped they would suffer for him. I am told that a great deal of importance is attached to a paper signed by him as Governor of the Saskatchewan, or of some other silly joke of that kind. Surely no one can be mistaken in seeing that the poor creature was joking. He is of so volatile a disposition that he will do any kind of silly folly to make people laugh. Again he is I believe accused of signing a declaration of neutrality. Well, it may be a crime to do so and it may make a man disloyal, and guilty of high treason to do so. The poor half-breeds are not very deeply versed in the noble science of law, and they may be perhaps pardoned for doing that which their priests were obliged to do under a superior force, to save their lives and to be able to assist the tardy authorities whose neglect had left them at the mercy of a lunatic or a tyrant. Fisher never took up arms. He has lost all his property, he is guilty of being obliged to do the best he could to save his life and that is all his guilt. In all other respects he is perfectly innocent. He has three children whose mother is dead.\n\nPie-re Henri is known to me for twenty-years. The last two or three years in Saskatchewan. He is a very quiet, silent man. Riel used him as a counsel because he never has anything to say and is a profoundly ignorant man. I solemnly declare that I know of no act of his that was bad. He did no harm of any kind to anyone, and was more a cat's-paw than anything else. He has a very large and helpless family of a wife and seven children. One of his sons being a confirmed invalid, God knows what will become of them if he is kept in prison, they will become a charge on the public. He has lost all his property.\n\nMoise Ouellette I know for twenty-five years. He is not a man of much intelligence. He has a very large family of eleven children and his wife and is their only support. He assisted Lepine and Ross; and Ouellette, from the beginning, opposed Riel.\nin every way possible, and they did all they could to prevent rebellion and any resort to arms. This may be seen in Riel's prayers, when he prays to God to change Ouellette and others. Ouellette was the man who carried General Middleton's letter to Riel for which he was promised considerations. He is about fifty-five years of age.\n\nIgnace Poitras, senior and junior. I have known the old man for fifteen years, since he came and settled on the Saskatchewan. He is one of the most simple, honest and peaceable men in the whole settlement, never mixing in any agitation or trouble; I am very intimately acquainted with him. I have often been his guest, and always found a welcome at his hospitable house. His industry and economy made him a comfortable and well-off man. He was, fortunately for the prisoners in Riel's camp, one of their guards, and I was told by several of them that he was kind and good to them always. He is about sixty years of age and has a wife and ten children, and has lost everything. The young man was with his father and is a harmless youth. The old man is old and feeble, and has suffered very greatly in health and property. The best interests of justice would, I think, be satisfied by sending him home to his poor family.\n\nBaptiste Vandal is the near neighbor of Poitras, and I can say the same about him that I do of Poitras. He resisted for a long time before he could be forced to join Riel, and did so only from fear and compulsion. He has a large family of a wife and eight children, and is a very poor man, and is an old man of about fifty years of age. Riel wanted to name him a captain but he refused positively to act, and hence was appointed one of the guards over the prisoners, and they all agree that he was most kind to them, and gave them any little comfort in his power, such as tobacco, &c.\n\nBaptiste Rocheleau, who is generally known as Old Man Rocheleau, is nearly seventy years old. He was always a hard working, peaceable man. Has a family of a wife and four children and was entirely opposed to Riel's proceedings. He refused to fight or do anything wrong, and was like the last two named placed over the prisoners and compelled, through fear, to remain in camp. He speaks the English a little and proved useful and a friend to the prisoners. He is a humane and good old man.\n\nJoseph Delorme I knew in Manitoba and during the three years that he has been in the Saskatchewan. He was always a very respectable, hard working man, very honest and well thought of. He, for a long time, refused to have anything to do with Riel, and induced his neighbors to refuse to do the same. It was only by force and threats that he was compelled to take part with the rebel party. He has been very severely wounded, is a cripple for life, and his home and family utterly ruined. If he offended he has been very heavily punished, and the hand of justice might, in mercy, deal lightly with him. He has a wife and four children and has lost everything.\n\nMaxime Dubois I have known since he was a boy. He has a family of seven children. He was in my service for some time, and proved honest, faithful and reliable, and has been greatly trusted by his employers, and always proved very worthy of being trusted. This poor old man was induced to surrender himself by the advice of Father Végreville, and is now a prisoner for the reason above. He is about thirty-six years of age, and his wife is a cripple.\n\nPierre Vandale I have known for fifteen years. He has seven children, young, and unable to provide for themselves. He is thirty-six years of age. The poor man was sick and unable to do anything; being useless, Riel sent him off to Battleford along with the others to protect the prisoners in Ponadmaker's camp. He neither had arms nor did anything for which he should suffer the punishment he has suffered since he foolishly surrendered himself to the authorities.\n\nAlexander Caidieux, or Kitwayo, is a pure Indian but has lived with the half-breeds. I have known him for seventeen years, he is a hunter and has a great deal of influence with the Indian tribes. He has a very large family of ten children and their mother.—of the children are cripples, and he is an old man nearly sixty years of age. He spent the winter hunting away two hundred miles at Turkey Lake, and only arrived about the end of April when he was seized by Riel and forced into\nhis service. He was not present at any battle and rendered very signal service in saving the lives of the teamsters when the Indians were about to massacre them, after taking them prisoners. He has lost everything.\n\nJames Short was always a good, honest man. He was a buffalo hunter, ignorant and easily led away; Riel made him believe anything he wished. Although an ignorant man, he is a noble fellow, and incapable of a mean or unmanly action. He was present above Lepine's Crossing when flat boats were in the river with a large quantity of arms and so forth belonging to the Government, and Captain Gagnon, of the North-West Mounted Police, at Prince Albert, told me saved a large quantity of rifles and other property for the Government by diving down in twelve feet of water. I beg leave earnestly to recommend this man to the clemency and mercy of the court, as he has a large and helpless family of a wife and ten children depending on him for support, and refused to run away or escape when told to do so, but went to work to make a living for his family and was made prisoner while freighting.\n\nJoseph Pilon is a farmer, and has a family of ten children, and is about fifty years of age. He lived half a mile from Batoche, he was always an industrious and hard working man. When the trouble broke out this man was ordered by Riel to come into camp or he would force him to come, as he had protested against Riel's movements, and had refused to attend any of his meetings, and never contributed one cent towards Riel's support last winter. Pilon, when he was threatened by Riel, came to the priests, and cried when telling what was wanted of him. Riel by force and threats against his life compelled him to serve his purpose. Poor man, he deserves pity rather than punishment.\n\nFrançois and Patrice Tourond are brothers. I have known them for a long time. They are unmarried. They are among the most respectable families of the North-West. They were seven sons and a widowed mother. These young men were the admiration of all the neighborhood; they were so quiet and hard working; their farm was the nicest kept in the settlement. They were opposed to Riel in all his movements. The crafty Riel tried every means to induce the boys to join him, but without success. They were well off, had a fine farm, plenty of cattle and horses, and were worth a good deal of money. Riel went day after day to the poor widow, and with his devilish cunning played on her superstition and credulity. He told her of his holy visions, how he saw himself surrounded by seven glorious stars of extraordinary brightness crowning him with glory. These bright stars, he cried, are your seven glorious sons, who are to achieve the glory of the half-breed nation, and the poor woman, in her simple faith of his divine mission, prayed of her five young sons to go forth and battle under the banner of heaven. Alas, with what terrible results? That once happy home is now desolate, the wealth produced by industry and sobriety is swept away like snow before the wind; the grand young sons, their mother's pride and strength, where are they? Three of them, shot on the field of battle, lie in hurried graves on the banks of the Saskatchewan, and another of a broken heart at the sudden shock of the terrible death of his brothers, another wounded and crippled for life, and two, the two above named, prisoners awaiting sentence at the hands of outraged majesty of the law of their country. Oh, spirit of mercy, enter the heart of their judge in pity and compassion, for the poor heart-broken widow now almost childless; deal mercifully with these poor deluded young men, and in mercy send them home to console the desolate heart of their mother. It must be remembered to the credit of Patrice that when Riel ordered the prisoners to be given up to the savages to be brutally murdered he cried out: \"Riel, these prisoners you shall not kill until you kill me first.\" These two young men are the only support of their mother and two young sisters. They have lost all their property.\n\nIn conclusion I would earnestly pray for mercy for these poor people, ignorant, innocent, confiding; they were misled by one who thoroughly knew their weak minds and their heart. They were called on in the name of God and of the holy saints, by one who declared himself ordained by God to do a great and good work. They were blinded by pretended visions and messages from the Holy Ghost;\npoor people, in their trusting confidence they were led on to desolation, misery and death. Over the grave of the silent dead, rise up the shrieks of despair of the franc-tin living, to a God for consolation and succour and to majesty of the offended laws of their country for mercy.\n\nThat gallant soldier, Captain H. S. Moore, said to Bishop Grandin: \"Although I am one of the greatest sufferers by this terrible rebellion, and will limp through life on one leg, yet I say from my soul, hang Riel and Dumont, but forgive all the others. They are innocent of intentional crime, and were misled by that soulless rascal Riel. I forgive them from my heart.\" This is the spirit in which I humbly beg of the court to consider the sentence of my poor half-breed people; show that their priests, who always tried to lead them to act as loyal and good subjects, should have some little influence to temper the sword of justice and direct the hand of mercy.\n\nA. ANDRÉ, O.M.I.\n\nSworn before me at Regina, in the said Territories, this thirteenth day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. EMMANUEL CHAMPAGNE.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Thomas McKay, of Prince Albert, in the North-West Territories, Esquire, make oath and say: That I am well acquainted with Emmanuel Champagne, who has always borne a good character up to the time of the rebellion, and who interposed to save my life, as I have already deposed in the case of the Queen vs. Louis Riel.\n\nTHOMAS MCKAY.\n\nSworn before me at Regina, in the said Territories, this 7th day of August, A.D. 1885.\n\nHY. LEJEUNE, A Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. IGNACE POITRAS, THE ELDER, BAPTISTE VANDAL, PHILIP GARIEPIE, PIERRE GARIEPIE, ALEXANDER P. FISHER, MAXIME LEPINE, MOISE OUDELETTE AND EMMANUEL CHAMPAGNE.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Thomas McKay, of Prince Albert, in the North-West Territories, Esquire, make oath and say:\n\n1. I have been for some time personally with each and every of the above named, Ignace Poitras, the elder, and others, and have, during a long time past, been a magistrate in and for the said Territories.\n\n2. From my personal knowledge of the above named parties I have no hesitation in saying that they have always enjoyed the reputation of being honest and peaceable inhabitants, and I had ever recognized them as law-abiding and loyal citizens of Her Majesty the Queen at the time of the late rebellion.\n\nTHOMAS MCKAY.\n\nSworn before me at Regina, in the said Territories, this 7th day of August, A.D., 1885.\n\nHILLYARD MITCHELL, A Justice of the Peace in and for the said Territories.\nTHE QUEEN vs. EMMANUEL CHAMPAGNE, ALEXANDER P. FISHER, PHILIP GARIEPIE, PIERRE GARIEPIE, PIERRE HENRI, MAXIME LEPINE, PIERRE PARENTEAU, MOISE PARENTEAU, JOSEPH PILON, BAPTISTE ROCHELIEU, FRANCIS TOUROND, PATRICE TOUROND, BAPTISTE VANDAL, PIERRE VANDAL AND JOSEPH ARCAD.\n\nCanada:\nNorth-West Territories.\n\nTo wit:\n\nI, Hillyard Mitchell, of Duck Lake, in the North-West Territories, Esquire, make oath and say:\n\n1. I have for some time been personally acquainted with each and every of the above named, Emmanuel Champagne and others, and have for several years been one of Her Majesty's justices of the peace in and for the said Territories.\n\n2. From my personal knowledge of the above named, Emmanuel Champagne and others, I have no hesitation in stating that they had always been honest and peaceable inhabitants and law-abiding and loyal subjects of Her Majesty the Queen to the time of the late rebellion.\n\nHILLYARD MITCHELL.\n\nSworn before me at Regina, in the North-West Territories, this 7th day of August, A.D. 1885.\n\nCHAS. NOLIN, A Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. ALEXANDER P. FISHER.\n\nCanada:\nNorth-West Territories.\n\nTo wit:\n\nI, Hillyard Mitchell, of Duck Lake, in the North-West Territories, merchant, make oath and say:\n\n1. I have well known Fisher during the last nine years, and he is a faithful, honest man, and I have never heard him utter a sentiment of disloyalty.\n\n2. On or about 20th day of March last past he informed me he was a prisoner at large of Louis Riel's at Batoche, taking no part in the rebellion, and said he would leave but wanted to stay to care for his family and property, and to the best of my knowledge, information and belief he was a bitter enemy of the said Riel from the time the said Riel came to the country on and until the breaking out of the rebellion, and never was by his own free will a rebel, and only allowed himself to be used in the movement from a natural weakness for absurdity and being laughed at, and not from any evil or cruel intention.\n\nL LYARD MITCHELL.\n\nSworn before me at Regina, in the said Territories, this 7th day of August, 1885.\n\nHY. LEJEUNE, A Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. ALBERT MONKMAN.\n\nCanada:\nNorth-West Territories.\n\nTo wit:\n\nI, Charles Nolin, of St. Laurent Parish, in the North-West Territories, contractor, make oath and say:\n\n1. On the nineteenth day of March last past, Louis Riel caused my arrest and trial before himself and associates, and the said Albert Monkman spoke in English.\nto said Riel very strongly against the course he had taken in causing my arrest, and against any further steps or any trial taking place, and afterwards, when Riel and Gabriel Dumont urged the people to condemn me to death, said Monkman, both at that time, and after such trial, opposed Riel with all his might.\n\n2. The said Monkman, when afterwards sent with me and a guard of twenty men to ask the English half-breeds to join the rebels, did not advise them to go, but, on the contrary, advised them to remain at home, as he was anxious to hinder and prevent any attack upon Fort Carlton and thereby prevent bloodshed.\n\n3. The said Monkman was most anxious to escape at that time, but wished to release the prisoners first, which he stated he was able to do or expected to be able to do.\n\n4. On the twenty-sixth day of March last past, before the Battle of Duck Lake, he, the said Monkman, tried to allow the prisoners then at Duck Lake to escape, and nearly succeeded in doing so.\n\nCHAS. NOLIN.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nHY. LE JEUNE, A Justice of the Peace for the said Territories.\n\nTHE QUEEN vs. ALEXANDER P. FISHER.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Charles Nolin, of St. Laurent Parish, in the North-West Territories, contractor, make oath and say:\n\n1. That Alexander P. Fisher, above mentioned, was sent for by Louis Riel on or about the twenty-first day of March last past, who directed four or five armed men to go and bring him; the said Fisher, to the Council, and the said four or five men whose names are not known to me brought said Fisher by force, to the place where said council held its meetings at that time, from, as I believe, his own house.\n\n2. The said Fisher was then a widower, and his three children were at the Sisters' school at said St. Laurent, and the said Fisher had a valuable cable and ferry boat at Batoche.\n\n3. On the twenty-fifth day of March, Albert Monkman, Baptiste Boyer, William Boyer, George Fisher, the younger, and said Alexander P. Fisher and myself, made a secret compact at the house of said Baptiste Boyer, that each and every of us would escape, and thereafter could not escape for want of a horse, and for other reasons which prevented his escape.\n\n4. The said Alexander P. Fisher was, to my certain and personal knowledge, always opposed to the rebellion, and that every act done by him up to that time (25th March, 1885), in the rebellion, was done when forced by Riel to do the same, and that his refusal would have endangered his life.\n\nCHAS. NOLIN.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nHY. LEJEUNE, A Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. EMMANUEL CHAMPAGNE (NOT A PRISONER).\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Charles Nolin, of St. Laurent Parish, in the North-West Territories, contractor, make oath and say:\n1. That Emmanuel Champagne above named returned to his home at Batoche, in said Territories, on or about the twenty-first day of March last past, and that during his absence he had been made a councillor in Riel's provisional government.\n\n2. He directed his name to be erased from the list of said councillors at once on hearing of same, which was not, however, done and said to me that he was against having anything to do with the rebellion, and that his age should have prevented his being forced to take part in same.\n\n3. He was not a participant in the battle at Duck Lake, nor in the robberies, which, up to that time, had taken place, nor had he up to that time taken any part in the illegal measures of said council.\n\n4. He resided only about one-half of a mile from the place where said council then held its sittings, and was at home except when sent for and compelled to go to said sittings by Riel's agents.\n\nSworn before me at Regina, this 7th day of August, A.D. 1885.\n\nCHAS. NOLIN.\n\nHY. LEJEUNE, a Justice of the Peace in and for said Territories.\n\nTHE QUEEN vs. MAXIME LEPINE.\n\nCANADA.\nNorth-West Territories,\n\nTo wit:\n\nI, Charles Nolin, of St. Laurent Parish, in the North-West Territories, contractor, make oath and say:\n\n1. When the rebellion began said Lepine was off on a freighting trip from Troy to Prince Albert, and on the 19th of March last past, by threatening and opposing Louis Riel, at the imminent risk of his, the said Lepine's own life, saved nine, and afterwards, on the 21st day of March and other days, prevented, in the same manner, the massacre of other persons whom the said Riel had made prisoners and wished to take the lives of.\n\n2. On the night that said Lepine and myself were sent to demand the surrender of Fort Carlton by Major Crozier, said Riel in a speech incited the people saying, \"Now is the time, let us go and take Carlton; let us go and avenge the death of Goulet (meaning the Goulet who lost his life in the year 1870, after the arrival of the troops at Fort Garry), and the said Maxime Lepine and Moise Ouellette (now awaiting sentence for treason-felony) were the men who, at the imminent risk of their own lives, interposed between the said Riel and the excited people, and prevented a midnight attack on Fort Carlton, which might have resulted in a fearful massacre.\n\n3. I heard said Lepine often say that the rebellion would not have begun had he been at home.\n\n4. On the Sunday before the battle of Duck Lake, Riel ordered Lepine to go with a party to take Lieutenant-Governor Dewdney prisoner (it having been reported that the Governor was on his way north with Colonel Irvine), and Lepine positively refused to go, or to be a party to such an outrage, whereupon Dumont said, \"I will go and take him prisoner, and if necessary will wash my hands in his blood.\"\n\n5. Two hours before the fight at Duck Lake I had a very serious conversation with said Lepine, in the course of which I said to him that from the appearance of things I feared that there would be bloodshed before many hours, and that I was determined to escape as I would not under any circumstances be present at any act of blood. Lepine replied: \"I also from my soul condemn the very thought of any blood being spilled, Riel has most solemnly pledged himself to me that no blood will be spilled. I have confidence in his promises in that respect, and I believe it to be my duty, even at personal risk and danger, to remain here and prevent bloodshed.\"\nshould Riel prove false in his pledges to me.\" And I thus depose, and am fully convinced that Lepine was actuated by the humane motive of preventing bloodshed by remaining in the rebel camp.\n\n6. When I escaped he solemnly declared that he would not fight nor countenance any fighting, nor would he ever take up arms.\n\nCHAS. NOLIN:\n\nSworn before me at Regina in the said Territories, this 7th day of August, A.D. 1885.\n\nHY. LEJEUNE, a Justice of the Peace in and for the North-West Territories.\n\nTHE QUEEN vs. JOSEPH ARCAUD ET AL. (RELEASED).\n\nCANADA:\nNorth-West Territories.\n\nTo wit:\n\nCharles Nolin, of the Parish of St. Laurent, District of Saskatchewan, in the North-West Territories, being duly sworn, doth depose and say:\n\n1. I had opportunity of being thoroughly acquainted with most of the persons connected with the late rebellion, having been detained by force and threats within the rebel camp up to the 26th day of March last, when I succeeded in making my escape from the camp.\n\n2. I knew Louis Riel, the leader and promoter of the rebellion. He is a man who worked a most wonderful influence over the uneducated, credulous and ignorant half-breed population, so much so, that he did successfully lead them astray, against the remonstrances and advice of their priests, who have always been looked up to by them as their true friends, protectors and guides, in all their concerns from the cradle to the grave.\n\n3. I was myself by force and threats detained in the rebel camp, and I know the means used to compel others to come there and to remain against their will and judgment, when it is a question of life and death, when from hour to hour one's life is in danger; if he tries to escape, it is very hard to do so; spies and sentries were posted at every point, at the doors of the houses where suspected persons were lodged, and any attempt to escape was, by order of Riel, to be treated as a crime punishable with death, and any person found attempting to escape was to be at once shot down, by order of Riel.\n\n4. Riel resorted to the most unusual means to secure an overpowering influence over the minds of the half-breed people, for instance to excite a feeling of awe in their minds, and no doubt with a view to making them believe that he was acting under Divine instructions. Early in the beginning of winter, he ordered all persons who had occasion to butcher or kill cattle, to save the blood for him, and from the first day of January he fed exclusively on blood instead of flesh meat, the blood being cooked in milk. This conduct made a deep impression on his superstitious dupes, and when combined with his continual praying and his daily relation of the visions he had the preceding night, and the visits of saints and the repeated conversations he had with the Holy Ghost, the poor half-breeds were convinced in their souls that Riel was God's envoy and that it would be a mortal sin to refuse to obey and follow him as the chief appointed by God to lead them; They had no guilty knowledge that they were breaking the law. They believed that they could not do wrong when God himself and the Holy Ghost and the Virgin Mary had sent a chosen servant and representative to lead and guide them; no feeling or connection less powerful could have induced them to spurn the advice and prayers of the good priests who had been the guides of themselves and their forefathers for generations.\n\nRiel had a book which he read or pretended to read from to convince the people of the holy character of his mission. He called it the \"Prophecies of St. Bridget,\" a great Irish saint, who he said had foretold hundreds of years ago all the things.\nthat were to occur during the years 1885 and 1886. He said that she foretold that\nthe wickedness of the world would have become so great that, from the head of Rome\ndown, the powers of the world would be destroyed, even the Government of Canada,\nthe world's rulers would be destroyed and swallowed up in a general whirlpool of\ndestruction. St. Bridget had foretold that God had appointed a second saviour to\nredeem mankind amid the final destruction and restore peace, morality and pros-\nperity to the nations; that man must be a descendant of St. Louis; then he went on\nto prove that he was descended from St. Louis and that the Holy Ghost and the Vir-\ngin Mary had visited him and told him that he was the chosen man who was\nappointed so many hundred years ago, and whose coming was predicted by St.\nBridget, the great Irish saint, to redeem mankind, and that his dear brother\nhalf-breeds were the first he would redeem.\n\nFrom Riel's arrival in the country he had been unceasingly going among the\nhalf-breed people telling them of the injustice done them by the Government, that\nonly by meetings and petitions and agitating, could they ever hope to recover their\nrights. He declared himself their leader; and that if they would only follow him,\nhe would secure for them all their rights and privileges from the Government at\nOttawa without bloodshed.\n\nRiel to get all the people together has recourse to a ruse. He told them that they\nmust all assemble at Batoche on the 18th day of March, for the purpose of going all\ntogether to St. Laurent on the 9th to celebrate the festival of St. Joseph, who is the\npatron saint of the half-breed people, as St. George is to the English, St. Patrick of\nthe Irish, and St. Andrew of the Scotch, and to make the occasion the more interest-\ning it was announced by Riel that his friend and Secretary Jackson, who became a\nconvert would be publicly baptised on St. Joseph's day. When the people assembled\nfrom all parts as they were ordered to do at Batoche on the 18th day of March, Riel\nand his friends at once circulated a report that the mounted police were coming\ndown on the people, and they would all be killed if they did not stand together and\nfollow his inspired instructions. Riel further announced that God had kindly caused\nthem to be assembled together and had the supplies within their reach, meaning and\npointing out the various stores in the vicinity, and arms in their hands, through him\nRiel, he having told them all to bring their guns with them to the celebration, so\nthat they might pay more honor to their patron saint by firing a \"feu-de-joie\" after\nmass in his honor, &c. I give this outline of his proceedings to show how thoroughly\nhe had matured his plans to get the people together, and to make them more blindly\nplace themselves in his power by getting them to break the law. Riel next sent out\narmed parties to bring in all those who had not already come, and they were ordered\nto bring them by force if they did not come voluntarily. When Riel had once got\nthe people to commit themselves by pillaging the stores, &c., he next told them that\n500 mounted police under Major Crozier were on the way to slaughter them all, and\nthat they must stand together and act under his instructions, and obey him without\nquestion, for God had commissioned him to lead and direct them, promising them that\nthere would be no bloodshed, which they firmly believed, or I am certain they would\nnot have consented to remain and meet the police force.\n\nOnce Riel had got the unfortunate half-breeds into his power he made them believe\nthat their only chance for life was to stay with him, as there would be no mercy\nshown them by the Government or by the mounted police, and that his intention was\nto so conduct matters that without any bloodshed he would secure them the full\nrecognition of their rights; by such promises as these and by resorting to every\npossible trick of language and action, by pretending to be specially commissioned by\nGod and the Virgin Mary and St. John the Baptist to lead the half-breed people\nthrough all their difficulties to a glorious success without shedding any blood, and\nwithout any danger; by kneeling and with his arms spread out like the arms of a\ncross, his eyes cast up to heaven and his voice raised aloud to God in prayer, and\nsometimes by throwing himself on the ground shouting to God for directions, and to\nprotect the half-breeds; it was in this way that he kept the poor, ignorant people\nsubject to his power and influence. I heard him harangue the poor people often and\nsay to them, \"you know that all power and authority is given to the Holy Father the Pope of Rome, you well know that the Holy Ghost dwells in the heart of the Holy Father, you know that where that Holy Spirit is there must be all power and authority. Well, the Holy Ghost left Rome in the interest of the poor half-breeds of America and took up his residence in the heart of the greatest living saint of the world, the Holy Bishop Bourget, of Montreal. Now, dear half-breeds, here is a letter, he cried, holding a paper up towards heaven, from that great saint, Bishop Bourget, written to me, who am to be the saviour of my people, acting under the influence of the Holy Ghost, and that saint tells me in this letter that I have a mission to fulfil, that grand mission is to liberate the whole world, but first I have to liberate the half-breed people whom I love so much, who are my own flesh and blood, who live in my heart.\"\n\nBy such means as these he fascinated a large number of his poor credulous followers, and by terrorizing over and making prisoners of those who, like myself, could not be deceived by his pretended divine mission, Riel kept under his authority numbers of good, honest and loyal men who longingly wished for the means of being freed from their disagreeable and false and dangerous position, but who were powerless in his hands, or, under his influence, believing that he was commissioned by God. Among those who, to my personal knowledge, were detained and kept in subjection, either through fascination and superstition, or through being kept in hourly fear of personal danger to themselves and to their wives and children or friends, were: Joseph Arcand, Alexander Cadieux, Emmanuel Champagne, Joseph Délorne, Maxime Dubois, Phillip Gariépie, Pierre Gariépie, Pierre Henri, Alexis Labombard, Maxime Lepine, Albert Monkman, Moïse Ouellette, Moïse Parenteau, Pierre Parenteau, Daniel Parenteau, Ignace Poitras, Ignace Poitras, jun., Baptiste Rochelleau, James Short, Francis Tourond, Patrice Tourond, Baptiste Vandal, Pierre Vandal, and many others.\n\nTo show how unreliable are the reports or minutes of the Council which were kept of meetings and proceedings, I may state that Riel, to plunge his followers, whether they were willing ones or not, as deeply as possible into danger, so as to keep them in his power, passed a motion of Council that every proceeding before the Council should be considered to be passed unanimously, and that all the names were to be entered as being present at every meeting, whether the persons were present or not, so that by this novel means he succeeded in implicating men who were innocent, being forced into compliance by him, and made them, as far as he could, responsible for his acts; for I declare that the whole Council was Riel. The so-called members of his Council were mere cat's-paws in his hands. He ordered and passed and did whatever he pleased, and threatened death to all who dared to oppose him. Here I may explain the presence of names to a very important document now in the hands of the Government. Riel ordered Maxime Lepine and myself to go to Major Crozier to demand his surrender, handed me the letter which was to be given to the Major. Lepine and myself were obliged to go, we dare not refuse, but what was our astonishment to discover, on examining the letter, to find our own names signed to it along with others. We saw at once it was a plan of Riel's to compromise us beyond hope of justification. We determined not to deliver the letter. I gave it to Lepine, who I suppose returned it to Riel, for it was found among the other papers, no doubt placed there for the intended purpose of compromising all those whose names were signed to it. I am fully satisfied that the minute book of Riel's so-called council was, from the beginning, cooked regularly to compromise the people, so as to compel them to sink or swim with Riel, and I do not hesitate to say that they were left where they would fall into the hands of the Government for the same purpose.\n\nOn that same night, when Maxime Lepine and myself were sent to demand the surrender of the mounted police, Riel, in a most violent speech, incited the people to take Fort Carlton. \"Now,\" cried he, \"is your time, let us go and revenge the death of Goulet\" (meaning Goulet who lost his life by being drowned in the Red River, at Winnipeg, in trying to escape from the Canadian volunteers, who were chasing\nhim, soon after the arrival of the force at Fort Garry, in 1870. The whole people were very much incited under his harangue. Maxime Lepine and Moise Ouellette interfered between Riel and the excited people, and, at the imminent danger of their own lives, prevented him from carrying out his object, a midnight attack on the fort, which might have resulted in a fearful massacre of innocent and unoffending people. To show how the half-breeds were led on by Riel, I declare that up to the last moment many English half-breeds were staunch supporters and followers of Riel, and it was only their superior education and want of belief in Riel's Divine mission that prevented them from being to-day as much in the power of the law as the French half-breeds are. Many English half-breeds and whites also encouraged the poor French half-breeds up to the culminating point and then cautiously left them to their fate, and to the infamous and blasphemous leadership of Louis Riel, who has plunged them into distraction, despair, starvation and death.\n\nI declare and depose that this deposition has been written at my dictation; that it has been read over to me in English and French, but it contains the truth and I have signed.\n\nCHAS. NOLIN.\n\nSworn to and acknowledged before me, at Regina, in the North-West Territories, this 7th day of August, A.D. 1885.\n\nHY. LEJEUNE, Justice of the Peace in and for the North-West Territories.\n\nTHE QUEEN vs. FRANCIS TOUROND AND PATRICE TOUROND.\n\nCANADA:\nNorth-West Territories.\n\nTo wit:\n\nI, Roger Goulet, of Batoche, in the North-West Territories, farmer, make oath and say:\n\n1. From the twentieth day of March last past to the thirteenth day of April last past, Francis Tourond, above mentioned, was not at Batoche in said Territories, but was at his mother's house, near Fish Creek, and never went to said Batoche until the time of the battle of Fish Creek.\n\n2. About the twenty-third day of March last past, Louis Riel came to the church where the people were assembled and told them: \"You will go to Garnot's and get the prisoners and give them over to the Indians to kill them to-night; also the two prisoners at Solomon Venn's, but you will see that the Indians do not torture them.\" Then Patrice Tourond stepped forward and said: \"If you kill those men you must kill me first.\" Riel then said in a kind of huff: \"Tout Tourond\" meaning your name is all round and you will remain all round.\"\n\n3. I have known both of said Touronds over seven years and they have always been sober, honest men and were of the best men in the North-West.\n\nROGER GOULET.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nCHAS. NOLIN, J. P., a Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. EMMANUEL CHAMPAGNE, ALEXANDER P. FISHER, PHILIP GARNOT, PHILIP GARIÉPIE, MAXIME LEPINE, ALBERT MONKMAN, MOISE OUELLETTE, AND OTHERS.\n\nCANADA:\nNorth-West Territories.\n\nTo wit:\n\nI, Thomas Eastwood Jackson, of Prince Albert, in the North-West Territories, druggist, make oath and say:\n1. That I was made a prisoner and detained as such, on the eighth day of April, or thereabouts, last past, and was not released from such imprisonment until the twelfth day of May last past, and I have a personal knowledge of the matter hereinafter mentioned and referred to.\n\n2. That Emmanuel Champagne, above named, I frequently saw at Batoche during that time, but he took no part in the doings of the Council while I was a prisoner, as far as I could see, and that he was not at the battle of Fish Creek, nor at any time, as far as I know, did he fight in battle.\n\n3. That Alexander P. Fisher, above named, was not armed at any time, so far as I know, and that he had only taken any part for fear of violence to his children by the Indians, and on condition that he should not be called on to take up arms, and should be left to run his ferry as usual.\n\n4. That Philip Garnot informed me, when first I saw him alone, that he had been compelled at the risk of his life to take part in the rebellion, and then began to act as secretary and had no interest in their object.\n\n5. That Philip Gariépie, above named, took no active part in the rebellion, as far as I could see; and that after Charles Newitt was brought wounded from the battle of Duck Lake, but at said Duck Lake and on the road to Prince Albert, the said Charles Newitt stated in my presence that it was an Indian who struck him at the said battle and not Philip Gariépie; and from my personal knowledge of the character of the said Philip Gariépie, and his treatment of all the other prisoners, I really believe he did not strike said Newitt.\n\n6. That Maxime Lepine and Moïse Ouellette opposed Riel in the Council very frequently to my personal knowledge and were for peace, and they only had the courage to do so of all in the Council; that the only ones in the Council that Riel could depend on were Gabriel Dumont, Damas Carrière and Napoléon Nault, and Riel distrusted and watched everyone else. That Riel was chary of everyone else, and they, Riel, Dumont, Carrière and Nault, controlled and managed everything.\n\n7. That Albert Monkman was absent at the north when Riel was preparing for the rebellion. Riel frequently showed dislike for him and distrust of him, setting Napoléon Nault and an old man named Swain to watch Monkman. I heard Riel say that he had sent him (Monkman) to bring up the English half-breeds by force, but that Monkman had not done so, but had proved to be unfaithful to his (Riel's) cause. At the time of the Fish Creek fight Riel ordered him to proceed up the river to attack Middleton on the west side, but Riel's spies discovered that Monkman had laid a plan to escape on horseback, when across the river, and thereafter Monkman was tried in the Council and then after made a prisoner of Riel's and chained to the floor of an upper room in Baptiste Boyer's house, in Batoche; in the room next the room I was afterwards confined in, and he was kept until the ninth day of May, when he was transferred to the cellar with myself and others, where we were kept until released by the troops on the twelfth day of May last past, with the others and myself.\n\n8. I am satisfied from what I saw, and I verily believe that Riel made Monkman a member of the Council, and gave him the command at Carlton with the double purpose of implicating him in the rebellion as he was an English half-breed and inducing the other English half-breeds to join the rebels.\n\n9. That Riel had me detained a prisoner in spite of the Council that I should be released, and of this I was informed by Riel himself as well as English speaking members of the Council.\n\nTHOS. E. JACKSON.\n\nSworn before me at Regina, in the said Territories, this 10th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\nTHE QUEEN vs. ALEXANDER P. FISHER AND OTHERS.\n\nCANADA:\nNorth-West Territories.\n\nTo wit:\n\nI, Harry Walters, of Prince Albert, in the North-West Territories, merchant, make oath and say:\n\n1. That Alexander P. Fisher, above named, was, during the time I was a prisoner of Riel's from the 18th to the 21st day of March last past, a prisoner at large of said Riel's and informed me that he only wished to protect his property there, and I believe that he tried to prevent some of the rebels from getting any property stored in his house.\n\n2. During that time he never carried arms of any kind.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nH. WALTERS.\n\nJustice of the Peace in and for North-West Territories.\n\nTHE QUEEN vs. JOSEPH ARCAD, ALBERT MONKMAN AND OTHERS.\n\nCANADA:\nNorth-West Territories.\n\nTo wit:\n\nI, Baptiste Arcand, of Stobart, in the North-West Territories, farmer, make oath and say:\n\n1. That one of the children of Joseph Arcand, above named, died just before the rebellion of 1885, in the said Territories, and another child was then at the point of death and has since died.\n\n2. The last named child being very ill about the 20th day of March last past, I went to Louis Riel, who had taken said Joseph Arcand from Stobart to Batoche, and told him that Joseph Arcand was not right in his head on account of the death of his child, and that the other child was very ill, and I urged said Riel to let him go home, and afterwards with myself Joseph Arcand begged said Riel to allow him to go to his home, but said Riel on both occasions refused to let him go.\n\n3. When the Council were chosen said Joseph Arcand being there present was chosen, but persistently refused to allow his name to be used, as far as lay in his power, and his name was omitted from the Council, and he at the same time was proposed for captain by the said Riel, but objected to being such, and he did not become a captain.\n\n4. Afterwards he succeeded in getting home, and remained home a few days, when he was sent for by Riel, and two men both armed again took him to Batoche on the 25th of March last past, and he returned home the same day.\n\n5. The morning of the battle of Duck Lake he went to Duck Lake to get some cotton for a shroud for his dead child, and was returning home when the battle of Duck Lake was in progress.\n\n6. He was not at the battle of Fish Creek, but was on the west side of the river, near Alexander Fisher's house, where he remained for a week with his family until a man came from Battleford with complaints that the Indians were threatening the priest there and the half-breeds and they wanted help, and he went with others by order of Riel to Battleford, from which place he did not return until after Batoche was taken by General Middleton.\n\n7. Said Joseph has a wife and six children now living.\n\n8. When I first saw Albert Monkman at Batoche he advised my brothers and myself strongly to go home and have nothing to do with the rebellion; he was not armed himself, and I heard him say to Riel at the time of the trial of Nolin and...\nBoyer, the following: \"Curse you, you are after another Scott affair, and you shall not do it if I can help it.\"\n\n9. Said Monkman never incited nor advised the Indians near Duck Lake to take part in the rebellion, but, on the contrary, spoke against their doing so.\n\n10. When said Monkman was at Fort Carlton thereafter I saw him there, and he told me privately that he intended to arrange matters there so that the prisoners could all escape, but very soon afterwards he was removed from there, as I was informed, by Riel's orders.\n\nBAPTISTE + ARCAD.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885, having been first explained by me to the deponent, who seemed perfectly to understand the same, and made his mark thereto in my presence.\n\nCHAS. NOLIN, Justice of the Peace in and for said Territories.\n\nTHE QUEEN vs. ALBERT MONKMAN, MAXIME LEPINE AND BAPTISTE VANDAL AND ALEXANDER P. FISHER AND PHILIP GARNOT.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Thomas Sanderson, of Camel River Settlement, in the North-West Territories, farmer, make oath and say:\n\n1. The night of the twenty-first day of March last past, when I was arrested and made a prisoner, Albert Monkman came to me evincing a friendly feeling, asked me my name and where I lived, he then asked me what I intended to say to Louis Riel, when I would be brought before him. I answered that I was determined to give my mind fully to Riel, to condemn him and his actions strongly and to tell him that the man who was accused of being the murderer of Scott in former days, was not one who should attempt to plunge the half-breeds into revolution, which would lead to disaster and death. Monkman said, \"for God's sake if you value your own life don't do that, temporize with him rather than irritate him, which may lead to the loss of your life, as I know that you stand in very great danger, because of the feeling against the Camel River settlers generally, and against you in particular.\" He cautioned me not to speak to him or appear friendly in the presence of Riel, for, said he, \"I am already suspected by Riel, but be assured that I will do everything in my power for you.\" Next when the release of the prisoners, Peter Tomkins, William Tomkins, McKenna Wooderick, John Mantly and Newitt was under consideration Monkman advocated and pleaded for their release before Riel and the council at Duck Lake; and in consequence of Monkman's advocacy strongly expressed, and the strongly expressed advice of Maxime Lepine and Baptiste Vandal, who sided with and supported Monkman on behalf of the prisoners, it was carried that the prisoners should be liberated, but Dumont opposed it, whereupon Riel ordered Monkman to saddle a horse and go to Canton, as I firmly believe, for the purpose of getting him away, and the consequence was, the prisoners were not released. In consequence of the conduct of Monkman, Lepine and Vandal, on behalf of the prisoners, I feel it a duty to strongly recommend them to the most favorable consideration and mercy of the court. I further state that Monkman declared to me, and he appeared to be sincere, that he would do anything in his power to prevent Riel from bringing the Indians into the rising, as he said if they were brought into it, bloodshed would follow. I believe that he did do all that he could in that respect, but I knew that he appeared to be suspected and watched by Riel, and he was kept as much as possible out of the way by being...\nsent or ordered off from one place to another, and never appeared to have much opportunity of making himself heard in the Council. While I was a prisoner, Philip Garnot evinced a friendly feeling towards the other prisoners and myself, bringing us tobacco and books both at Duck Lake and Batoche. At Batoche we were in his hands, as he stated by his request of Riel in our behalf, and we were all well fed and attended to by him while there.\n\nTHOMAS SANDERSON.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. JOSEPH PILON, FRANCIS TOUROND, PATRICE TOUROND, ET AL. (NOT PRISONERS).\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, George Albert Kerr, of Batoche, in North-West Territories, merchant, make oath and say:\n\n1. That Joseph Pilon, above named, came to my store, near Batoche, and had a conversation with me in which he expressed his disapprobation of the rebellion. This was on the morning after the rebellion had broken out, and he stayed away from Batoche as much as possible.\n\n2. He had two sons, one of whom is a married man, and the both of them are full grown men, said married man has a wife and family and has been forced to take part in the rebellion.\n\n3. He was kept at Batoche by terror and only stayed because he wished to get off his son who had been taken there as aforesaid, and was almost overcome by consternation, and the said Joseph Pilon went home as often as he could, and stayed there till brought again.\n\n4. That up to the time of the battle of Fish Creek, Francis Tourond, above named, was at home and did not go to Batoche at all after the battle in which, I believe, he took no part. I, with my brother John Kerr, were hid for days in the Touronds' granary by said Francis Tourond, where he and his mother fed us. He took us to the house of the McIntosh's who lived near there.\n\n5. From my own personal knowledge of the character of the Touronds', above named, I can conscientiously say that they would never have been connected in any way with the rebellion had they not been coerced or misled into it through religious deception, which I was personally in a position to know, and I do know and feel called upon to state in fairness, was actually the case with them in the late rebellion of 1885.\n\nGEO. A. KERR.\n\nSworn before me at Regina, in said Territories, this 11th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. ALBERT MONKMAN AND OTHERS.\n\nCANADA:\nNorth-West Territories,\n\nTo wit;\n\nI, Charles Newitt, of Prince Albert, in the North-West Territories, merchant's clerk, make oath and say:\n1. I was wounded and left on the field of the battle of Duck Lake, and shortly after the said Albert Monkman came to me and said he was sorry the battle had taken place and that I had been wounded, and he offered to do all that he could for my comfort, and afterwards came to me every day. I was in the rebel camp from the twenty-sixth to the thirtieth day of March last past, he offering me the same assistance.\n\nHe said, after the battle, that he would go to the Council and try to get the other prisoners as well as myself off, and a while afterwards he returned to me saying that he had got the consent of the Council to my being let off, and thought he had succeeded in getting their consent to letting all the others off, except Lash and Ross, whom the other members of the Council would not let off because they were officers of the Government; he appeared to be the best of the whole lot while I was there. After I was taken up stairs at Duck Lake he came to us and told us (the prisoners) to keep away from the windows for fear that the Indians would shoot us.\n\nSworn before me at Regina this 12th day of August, A.D. 1885.\n\nOwen Hughes, a Justice of the Peace in and for the North-West Territories.\n\nTHE QUEEN vs. JOSEPH ARCAD, ALEXANDER CADIEUX AND OTHERS.\n\nCanada:\nNorth-West Territories,\nTo wit:\n\nI, Robert Jefferson, of Battleford, in the North-West Territories, farm instructor, make oath and say:\n\n1. That Arcand and Cadieux, above mentioned, were at Battleford during the latter part of the rebellion for the purpose of standing between the Indians on one side and the half-breeds and teamsters and other white people on the other, and they did nothing else during their stay in the camp.\n\n2. I saw Alexander Cadieux, above mentioned, alias \"Kitty-way-hoe,\" standing at the door of the tent of the scout Fontaine a prisoner about the sixth day of May last past, and keeping the Indians away from the said tent.\n\n3. That the said Arcand and Cadieux, while in said camp, did nothing criminal or disloyal, on the contrary their actions were all on the side of humanity and order.\n\nSworn before me at Regina in said Territories, this 11th day of August, A.D. 1885.\n\nHy. LeJeune, a Justice of the Peace in and for the North-West Territories.\n\nTHE QUEEN vs. ALEXANDER P. FISHER AND PHILIP GARNOT.\n\nCanada:\nNorth-West Territories,\nTo wit:\n\nI, Louis Marion, of Duck Lake, in the North-West Territories, freighter, make oath and say:\n\n1. That Alexander P. Fisher, above mentioned, was a prisoner at large, and not under arms from eighteenth to twentieth March last past, staying at home, except when sent for by Louis Riel and brought by force to Batoche, in said Territories, across the river from his home.\n\n2. That Philip Garnot, above mentioned, had no connection with the rebellion until the twentieth day of March last past, or thereabout, when he was brought by\nforce from his boarding house to the church, both at Batoche and in said Territories, and he began to act as secretary, taking no personal or individual part in the doings of the Council, but merely acting as a scribe to the Council.\n\nLOUIS MARION.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nCHARLES NOLIN, a Justice of the Peace in and for the said Territories.\n\nTHE QUEEN vs. ALBERT MONKMAN AND OTHERS,\n\nCANADA:\nNorth West Territories,\nTo wit:\n\nI, Vital Fourmond, of St. Laurent, in the North-West Territories, priest, make oath and say:\n\n1. That said Albert Monkman during the rebellion tried to escape from Batoche and to desert from the camp of Riel, but was discovered in the act of doing so and was thereafter made a prisoner by the rebels, and was thereafter until the end of the rebellion a prisoner of Riel's.\n\nV. FOURMOND.\n\nSworn before me at Regina, in the North-West Territories, this 7th day of August, A.D. 1885.\n\nCHAR. NOLIN, a Justice of the Peace in and for said Territories.\n\nCANADA:\nNorth-West Territories,\nTo wit:\n\nI, Vital Fourmond, of St. Laurent, Director of Catholic Missions, being duly sworn, doth depose and say:\n\n1. That I am perfectly aware of the uprising of the half-breeds and of the causes which led thereto, and I am compelled to declare that the poor half-breeds were coaxed and forced into that disastrous rising through orders and insane instigation of Louis Riel.\n\n2. From what I personally witnessed and heard from, before, during and after the establishment of Riel's so-called Provisional Government, whether at St. Laurent or at Batoche, the evidence of this my deposition is so certain and manifest, that it does not admit of any doubt.\n\n3. Louis \"David\" Riel, in his strange and alarming folly, fascinated our poor half-breeds, as the snake is said to fascinate its victim, abusing, for his own ends, the great confidence that all the half-breeds reposed in him, a confidence founded upon his influence over their minds through his great and impassioned language, and above all the appearance of his profound religious feeling and devotion, which he displayed in the most glaring and hypocritical manner, which was rendered so convincing to their minds by his public proclamation of his injuries, as an inspired prophet, which he forced upon their imagination in the most insidious and diabolical manner; he proclaimed himself a new Moses, who had come to deliver his people from bondage and to place them in a new land of promise, where they would enjoy the greatest liberty and happiness and soon become masters of the world, as he would soon march them on Winnipeg by way of Portage la Prairie, and thence to subjugate Canada, and afterwards the whole of the States of the whole world, until he, their inspired leader, would be crowned king of the world, and sit in the chair of St. Peter at Rome as the Pope, in proclaiming which he did the inimical authority of the Tyrants of Europe, is and ought to be deprived of\nall his temporal and divine powers and privileges. The Spirit of God has left the Pope of Rome, and has taken up its abode in the holy person of that great saint: Archbishop Bourget of Montreal, from whose soul the spirit of God has passed into the soul of your leader Louis Riel, thus, said Riel, I have received my divine mission conveyed to me in this letter from that saint and bishop, hear the words, \"You have a grand mission to fulfil, you must accomplish it at all points.\" Now, cried he to his poor superstitious listeners, this is a proof of my commission from heaven, and I have been confirmed in it through the Holy Ghost, who has come to me and taken up his abode in my soul and through me is now beginning on the great work of modern times, that to carry out a grand and most necessary reform of the whole world; to finish the complete influence over the poor half-breeds he next after strongly insisted on his sacred mission, insisted on the gravity and legitimate nature of their claims against the Ottawa Government, the indifference of the Government to their humbly petitions and demands and the consequent misery and distress into which they were plunged, and out of which he alone, as God's agent, could lift them up and make them happy, notwithstanding the power of the Dominion of Canada, and of their other heartless tyrants, the Hudson's Bay Company, and notwithstanding the power and evil influence of the priests, who were traitors to their sacred calling and were using their influence on the side of tyranny and the oppression of the poor half-breed people.\n\n4. The Sunday before the outbreak, Riel, after mass, came to my house and spoke to me as follows:—\"You have turned the pulpit of truth into one of falsehood, politics and discord; in daring to refuse the Holy Sacrament to all those who would take up arms in defence of their sacred rights,\" Another time, at the store of Walter & Baker, at Batoche, in a public meeting of the people, seeing that he was losing ground in consequence of the influence of the religious feeling of the poor people, he jumped up, his eyes flaming like the eyes of a veritable maniac, which gave him such a striking appearance that it forcibly impressed the people, he cried: \"How can these poor people, whom you try to deceive and mislead as to the truth of my divine mission, for one moment believe you when they have the proof before them that you are a traitor to them, and you are unworthy of their confidence? How dare you say that it is a crime to take up arms against the tyrant in defence of their rights?\" I replied to him: \"Yes; I said often before, and I repeat it here to your face, and in the face of these poor misguided people whom you are leading to destruction, despair and death, it is a crime to take up arms against the constituted authorities; it is a crime to raise the standard of rebellion. God proclaims it the duty of all Christian people to render to Caesar the things that are Caesar's, and to God the things that are God's.\" He, Riel, replied: \"Yes, render to God glory, honor and adoration, but to the tyrants of the world render that which is due to them; sling back their authority, which they have usurped, in their teeth; tumble them down from power, that is what God orders.\" \"Listen\", cried he, \"to this priest who dares to tell you that it is a crime you are committing, under my direction, in fulfilment of my sacred mission, who dares to call rebellion your taking up arms in a sacred cause, a cause ordained and directed by God, the cause of your native land which is bleeding and prostrated at the feet of tyrants, the sacred cause of the rights, the liberties, the lives of your wives and children for all time to come.\n\n5. To impress the people and keep them within his power, this man, Riel, resorted to all kinds of trickery. Often have I seen him praying aloud, prostrating himself in prayer and ordering all the others to do so. Thus he made a deep impression on his poor ignorant dupes and so convinced them of his divine mission that it was impossible to convince them that he was a trickster and would lead them to destruction. Riel so played on their ignorance that he made them believe in his power to work miracles; they firmly believed this. I have heard them say that Riel could make it thunder and could cure disease without medicines. Riel himself declared that he was once the victim of an incurable disease of the heart, but that on the 21st of May he had cured the disease by his divine power. He also declared that should he be killed it did not matter, he would be with them again alive and that would\nprove to them his divine mission. He cried, \"it is the Holy Ghost that speaks, who shall dare disbelieve me?\"\n\n6. When Riel had completely fascinated these people, and held them body and soul at his will, he next, to complete his object and plunge them into rebellion beyond recall, he announced that 500 mounted police were on the way to slaughter them men, women and children, to the last one. \"Oh, my friends, look at those devils murdering your whole nation, see your wives and daughters ravished before your streaming eyes, see your wives and children tortured, dishonored, disembowelled, cut in pieces by those savage soldiers, who are paid and kept by tyrants to kill, slaughter and dishonor the half-breed nation.\" \"To arms, to arms, or will you crouch and submit? God tells you to follow me. The Holy Ghost is with you in my person; courage, we will conquer.\" Oh, my poor people, I could not restrain them; they were under the infatuation of this arch actor and trickster till he got them committed by the effusion of blood; then they were in his power, and he used that power without any feeling of mercy. I heard him say and proclaim, \"Death, death, death, to anyone who tries to desert,\" and many of the poor people had guns pointed at their hearts, by Riel's orders, because he suspected them of wishing to get away, and to complete his terrorism over the poor people he declared it to be his determination to put me thus, deponent, in the front of the battle.\n\nI knew Phillip Garnot, I saw him among the people in the rebel camp, but I am certain he did not take any part with Riel until the 21st or thoresbouts. I spoke to him and expostulated with him on being among the misguided people. \"What can I do?\" said he, \"I am forced to be here, my life would be taken, did I refuse to appear to act at least, and now I must do all I can to save the lives of the poor people who are shut up in Battleford, that is what consoles me in this dreadful affair; I may prevent the attack or give timely warning to save the lives of the Canadians.\" And I sincerely believe that Garnot was acting under compulsion and in fear of his own life; also, I know that he was always good and kind to the prisoners while they were in his power or within his reach or succor, and he was always kind and considerate and polite to myself, unlike Dumont, Riel and others, who were threatening, brutal and insulting towards us.\n\n7. I also declare that during the trouble I had conversations with several of the persons who were in the rebel camp with Riel, and I found a large number of them there against their will, and only remained there because of the fear of being shot down did they try to escape or desert, as sentence of death had been proclaimed against all persons who would try and get away. I wish to particularly mention Maxime Lepine, Moise Ouellette, Pierre Parenteau, S. Emmanuel Champagne, and as I before mentioned, Philip Garnot, all of whom I firmly believe were kept in the rebel camp through terror of their own lives and for fear of their families being punished, should they attempt to escape.\n\n8. Alexander Fisher, I can positively say, would have escaped while at St. Laurent, but for the fact that he had his two little daughters in the convent school there, but feared the vengeance of Riel should he escape. I saw Fisher from day to day. He never had arms or did he take any interest or part in Riel's acts or proceedings except when forced to do so, and I knew that in simple derision he once signed a paper as Lieutenant-Governor of the North-West Territories, and told me the next time he met me, and I laughed with him at the joke, for it was nothing else. Riel always compelled lukewarm persons to commit themselves if possible in writing, Fisher knew this, and in derision and to mark his contempt for which he was compelled to sign, wrote himself Lieutenant-Governor of the North-West.\n\n9. In conclusion, as an humble and old servant of God, and as one who has been seventeen years among the half-breeds of this country, who knows their simplicity, how easily they are led away by designing and cautionless people, such as this man Riel, who being one of themselves, who was looked upon as their born and natural leader, one who knows well that the poor ignorant half-breeds were encouraged on from step to step in the late uprising till their false white pretended friends and their English fellow half-breeds left them on the very verge of rebellion and blood.\nshed, in the name of God, I, His most humble servant, in the agony of my aged and suffering heart, cry aloud to the judge before whom these poor deluded half-breeds have to appear for justice, mercy! Oh, earthly judge, in Heaven from whose sacred lips the proclamation of mercy as He expired on the cross of salvation was given to the world—in His name, mercy.\n\nV. FOURMOND.\n\nSworn and acknowledged before me at Regina, in the North-West Territories, this 7th day of August, A.D. 1885.\n\nCHAS. NOLIN, Justice of the Peace in and for the North-West Territories.\n\nTHE QUEEN vs. MAXIME DUBOIS.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, George Ness, of Batoche, in the North-West Territories, contractor, make oath and say:\n\nThat Maxime Dubois, above named, frequently told me during the rebellion that he was desirous of escaping and would do so were it not for his wife and family of five or six children, and to the best of my knowledge, information and belief, he took a very minor part in the rebellion and would not have done anything at all had he not been forced to do so on peril of his life.\n\nGEORGE NESS.\n\nSworn before me at Regina, in the said Territories, this 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nTHE QUEEN vs. MOISE PARENTEAU AND BAPTISTE VANDAL (RELEASED).\n\nI, George Ness, of Batoche, in the North-West Territories, farmer, make oath and say:\n\nThat Moise Parenteau, above named, and Baptiste Vandal, above named, were very kind to the prisoners, on or about the twenty-first day of March last past, and, I believe, took a very minor part in the rebellion and not of their own free will.\n\nGEORGE NESS.\n\nSworn before me at Regina, in the said Territories, the 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. ALEXANDER P. FISHER.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, George Ness, of Batoche, in the North-West Territories, farmer, make oath and say:\n\n1. That the said Alexander P. Fisher, on or about the 27th day of March last past, informed me that he was against the rebellion, and had tried to escape, but failed to do so, and that he would not be there at all had it not been for his children.\n2. To the best of my knowledge, information and belief, he did not, of his free will during the whole rebellion, commit any rebellious or treasonable act, but at the risk of his life and in the presence of and under superior force.\n\nGEORGE NESS.\n\nSworn before me at Regina, in the said Territories, this 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. JOSEPH PILON (NOT A PRISONER).\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, George Ness, of Batoche, in the North-West Territories, farmer, make oath and say: That I have good reason to believe and do verily believe that Joseph Pilon, above named, tried to avoid being connected with the rebellion of 1885 by hiding and in other divers ways, and that had it not been for his wife and family of eleven children, would have succeeded in so doing, and would not be in prison today. The said Pilon resided for several years near where my residence then was, and I had the best opportunity for arriving at the whole belief.\n\nThe said Pilon took a very minor part in said rebellion, and that on peril of his life and against his will.\n\nGEORGE NESS.\n\nSworn before me at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. JOSEPH ARCAD (RELEASED), ALEXANDRE CADIEUX, EMMANUEL CHAMPAGNE (NOT A PRISONER), MAXIME DUBOIS, ALEXANDER P. FISHER, PHILIP GARIEPIE, PIERRE GARIEPIE, PIERRE HENRI, MAXIME LEPINE, MOISE OUELLETTE, PIERRE PARENTEAU, MOISE PARENTEAU (RELEASED), IGNACE POITRAS (RELEASED), IGNACE POITRAS, THE YOUNGER JOSEPH PILON (NOT A PRISONER), BAPTISTE ROCHELEAU (NOT A PRISONER), JAMES SHORT, FRANCIS TOUROUN (NOT A PRISONER), PATRICE TOUROUN (NOT A PRISONER), BAPTISTE VANDAL (NOT A PRISONER), PIERRE VANDAL (RELEASED), AND OTHERS.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, George Ness, of Batoche, in the North-West Territories, Esquire, make oath and say:\n\n1. I have for some time past been personally acquainted with each and every of the above named, Joseph Arcand and others named thereafter, and I have been one of Her Majesty's justices of the peace, in and for the North-West Territories, for some time past.\n\n2. The said persons above named had each and every of them always been honest and peaceable inhabitants, and law-abiding and loyal subjects of Her Majesty the Queen up to the time of the late rebellion in the said Territories.\n\nSworn before me at Regina, in the said North-West Territories, this 7th day of August, A.D. 1885.\n\nGEORGE NESS.\n\nDIXIE WATSON, Clerk of the Court.\nTHE QUEEN vs. PHILIP GARIEPIE AND OTHERS.\n\nCANADA:\nNorth-West Territories,\nTo wit:\n\nI, Eleazer Swain, of Batoche, in the North-West Territories of Canada, farmer, make oath and say:\n\n1. That immediately after the fight at Duck Lake I arrived upon the ground, and there saw Philip Gariepie and a number of others near to where Charles Newitt was then sitting.\n\n2. Newitt appeared to have been mounted, and exhibited signs of having been struck upon the forehead and hand, and a conversation was going on among those about as to the cause. I heard it stated by several of these people, who were half-breeds and Indians, that the said Newitt had been struck in the manner above mentioned by an Indian.\n\nSworn before me at Regina, in said Territories, this 6th day of August, A.D. 1835, after having been first read and then explained to the deponent, who made his mark direct in my presence.\n\nHugh Richardson, Stipendiary Magistrate for the North-West Territories.\n\nTHE QUEEN vs. JOSEPH ARCAUD, IGNACE POITRAS (THE ELDER RELEASED), IGNACE POITRAS (THE YOUNGER), PIERRE PARENT-EAU, MOISE PARENTEAU (RELEASED), JOSEPH PILON (NOT A PRISONER), BAPTISTE VANDAL (RELEASED), BAPTISTE ROCHELEAU (NOT A PRISONER), PIERRE VANDAL (RELEASED), MOISE OUELLETTE, MAXIME LEPINE, ALBERT MONKMAN, EMANUEL CHAMPAGNE, MAXIME DUBOIS, ALEXANDER P. FISHER, PATRICE TOUROND AND FRANCIS TOUROND, ET AL.\n\nCANADA:\nNorth-West Territories,\nTo wit:\n\nWe, Harold Edward Ross, Peter Tomkins, William Tomkins and Thomas Eastwood Jackson, all of Prince Albert District, in the said Territories, severally make, oath and say:\n\n1. That during the time of our imprisonment in the rebel camp at Batoche and vicinity we received considerate treatment and kindness from the above named defendants, Joseph Arcand and others, some of them supplying us with food, others of them protecting us as much as in their power lay from attacks of the Indians, cautioning us to keep away from the windows and doors for fear of being shot at by Indians and others, and generally exhibited a spirit of kindness and friendly feeling towards us. They also, many of them, stood between us and threatened death at the hands of Louis Riel to the best of our information. We, therefore, feel it a duty, as Christian men, to recommend them in turn to the mercy of the court. We especially recommend Baptiste Vandal, Ignace Poitras, Joseph Pilon, Baptiste Rocheleau, Albert Monkman, Alexander P. Fisher, Emmanuel Champagne and Patrice Tourond to the mercy of the court for their marked humanity and kindness to us while in prison. And this declaration on our part is not a new-born feeling. Whilst we were prisoners we mutually determined, should we escape with our lives, that, should these men, in turn, be arrested and imprisoned, and put upon their trial, that we, in gratitude for their kindness, would not fail to come forward.\nand give evidence on their behalf, which we now do, and we earnestly recommend them to the consideration and mercy of their judge.\n\nSworn before me and acknowledged by the deponents, Harold Edward Ross, Peter Tomkins, William Tomkins and Thos. Eastwood Jackson, at Regina, in said Territories, this 7th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n\nTHE QUEEN vs. JOSEPH ARCAD, EMMANUEL CHAMPAGNE, ALEXANDER P. FISHER, PIERRE GARIBPIE, PIERRE HENRI MAXIME LEPINE, ALBERT MONKMAN, MOISE OUELETTIE, PIERRE PARENTEAU, JOSEPH PILON, IGNACE POITRAS, THE ELDER, IGNACE POITRAS, THE YOUNGER, BAPTISTE ROCHELEAU, FRANCIS TOUROND, PATRICE TOUROND, BAPTISTE VANDAL, ET AL.\n\nI, John W. Astley, of Prince Albert, in the North-West Territories, civil engineer, make oath and say:\n\nI was in the rebel camp from the twenty-sixth of March, until the twelfth of May last, after the battle of Fish Creek. The half-breeds were notified by Louis Riel that they had better fight now to the last man, as no mercy would be shown them whether they surrendered or were taken prisoners, that they would be every man hung or shot, by the mounted police, or by the Canadian Government, and it was by thus terrifying them that the half-breeds were kept together.\n\nOn the twelfth of May I talked to Louis Riel for a long time about the rebellion and its results to himself. I said to him, \"God knows you escaped from the consequences of your first rebellion through politics.\" He replied that he had, but said he, \"I have three chances or means of escape this time; first, through politics; secondly, through the papers of the Council. You must know that I have so arranged all the papers of the Council in such a way that everything will show that the Council did everything, and my name will not appear as doing anything; and should we arrange to do as you wish, the papers will all be found properly fixed in the Council chambers. My third chance will be on the question of my being the head of this new religion. If you will mention that to the general (meaning General Middleton) it will give me the greatest chance, as it will show that I wish that.\" I said to him, \"What will I say to the general about the French half-breeds' claim?\" \"Oh,\" said Riel, \"that is a very secondary consideration; I think of myself first.\" Again I said, \"if there are any claims of the half-breeds a word now might be of great advantage to them, as the general will not forget to report it.\" Again he replied, \"I assure you their chances are of a very secondary importance, my own safety is of the first importance.\" After this conversation I returned to General Middleton to try and get the troops to cease firing, and then came back to Riel, when I said to him, \"Now, there is no time to lose; call your Council together and let us have an understanding, I will address them.\" Riel said, \"that is quite unnecessary, I can do as I wish.\" Then I said, \"you admit that you act without any Council,\" and he said, \"yes, I do just as I wish.\" As I left Riel I said to him, \"should I not be able to return you know what to do; come in all of you and surrender; if I can I will come back. The old man Ross and Ouellette actually did await my return till they were shot dead.\n\nI know Alexander P. Fisher, he was in the rebel camp. I always looked upon him as a kind of a soft-headed fellow who had no harm in him, he had no arms and did not do any harm to anyone. He is a kind of small wit, and would do almost any\nkind of foolish thing to make the people laugh. I considered him a harmless nonentity.\n\nPierre Gariepie was a kind old fellow to the prisoners; Pierre Henri was about the same as the last. Maxime Lepine seemed to be anxious to end the matter, he did not seem to me to be heart and soul in it. Albert Monkman did all he could for the prisoners. I several times heard Riel scolding Monkman for not bringing in Scotch and English half-breeds as he had been ordered to do. Moise Ouellette carried a letter to Louis Riel from General Middleton, which letter was the cause of Riel's surrender. I gave the letter to the priest at Batoche. Pierre Parenteau was an ordinary man among the half-breeds. Ignace Poitras, senr., Baptiste Rochelean and Baptiste Vandal were three great friends to the Canadian prisoners, and, indeed, had it not been for these three good old fellows we would have almost starved. Many a time they took all the care they could of us, and had it not been for them we would have been a terrible sight worse off.\n\nThe two Tourolons and Ignace Poitras, the younger, I know little about, and never saw them take any active part in the rebellion. The other persons named were made prisoners more with a view to the corroboration, if necessary, evidence for the certain conviction of Riel by General Middleton, to my personal knowledge. I had given to the general a list of the leaders to be detained, which he lost, and some of the principal men are still at large.\n\nJOHN W. ASTLEY.\n\nSworn before me at Regina; in said Territories, this 11th day of August, A.D. 1885.\n\nHENRY DODD, Justice of the Peace for the North-West Territories.\n\nTHE QUEEN vs. JOSEPH ARCAN, ALEXANDER CADIEUX, AND OTHERS.\n\nCANADA:\nNorth-West Territories,\n\nTo wit:\n\nI, Leonis Cochin, of Battleford, in the North-West Territories, priest, being duly sworn, depose and say:\n\n1. I was a prisoner in the camp of Poundmaker from about the twelfth of April till about the sixteenth of May, or to the time of Riel's surrender, the news of which reached us four days later.\n\n2. I saw Joseph Arcand, who is well known to me, for the first time among those in the camp on the third of May; it was Sunday, about seven o'clock in the evening. The said Arcand had, I understood, just arrived with others from Batoche, whence they had been sent by Riel to protect the prisoners from the savages.\n\n3. Joseph Arcand was one of the most ardent of the half-breeds in protecting the prisoners from being killed, maltreated or robbed by the savages; he was always on the watch to guard the prisoners from danger, and I was indebted to him for his devoted protection of myself from danger and annoyance. I passed nearly half the time with him and he never used one solitary expression of disloyalty towards the Government, nor did he ever commit any hostile act; he occupied himself in attending to the safety of the prisoners, white and half-breed, in the camp.\n\n4. It was Joseph Arcand who was specially active and successful in saving the life of the white prisoner, a teamster, who is I believe at present in Regina. Arcand also protected a scout named Fontaine from threatened death at the hands of the Assiniboines, that same scout Fontaine who so ungratefully accused his protectors on his return to Battleford. This fellow Fontaine, to my personal knowledge, is totally unworthy of belief; he is well known as a gaol bird, and in fact was liberated from gaol to become a scout. Joseph Arcand had left Poundmaker's camp three days before we heard of the battle at Batoche.\n5. Pierre Vandal came to Poundmaker's camp at the same time with Arcand. This young fellow seemed to be a follower of the others simply through curiosity as a companion as some of the other half-breeds, and when he mounted guard with the others it was for the sole and only purpose of protecting the prisoners from the savages, who were only prevented from falling upon the prisoners by the most devoted and active efforts of the half-breed guards. I often passed hours with this young man Vandal and conversed with him and spoke to him in condemnation of Riel, and in favor of the Government, to which he assented and often condemned the rebellion. Gariepie all the time he was in the camp positively did nothing but protect the enemy to the best of his power, the prisoners white and half-breeds, from the savages, to which he devoted his whole attention, his conduct was immensely praiseworthy and kind. I am bound in conscience and gratitude to accord to him my best thanks and strong recommendation.\n\nAlexander Cadieux, alias \"Kitty-way-hoe,\" came to the camp with the others above mentioned. He is a fine savage, but has lived among the half-breeds, and is very ignorant. He has a great deal of influence with the savages, and through that influence he was enabled to save the lives of the teamster prisoners who were on the point of being killed by the Indians, who were very furious and determined. As one whose life was saved by the combined exertions and devotion of these poor men, when life was every moment in danger, I cannot sufficiently express my thanks to God and my gratitude to these poor men, and pray at the hands of the judge who is to pass the sentence of the law upon them, a merciful view of any fault they may have ignorantly committed, in view of the fact that they risked their own lives to save the lives of Her Majesty's subjects—men, women and children—from the fury of the savages.\n\nL. COCHIN.\n\nSworn to and acknowledged before me at Regina, in the North-West Territories aforesaid, this 13th day of August, A.D. 1885.\n\nDIXIE WATSON, Clerk of the Court.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001374.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 43222, "total-output-tokens": 23673, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2704, 2], [2704, 7285, 3], [7285, 11575, 4], [11575, 16133, 5], [16133, 20525, 6], [20525, 24977, 7], [24977, 27638, 8], [27638, 30181, 9], [30181, 33111, 10], [33111, 36591, 11], [36591, 40250, 12], [40250, 44818, 13], [44818, 49267, 14], [49267, 52312, 15], [52312, 56087, 16], [56087, 59177, 17], [59177, 62664, 18], [62664, 65306, 19], [65306, 68183, 20], [68183, 71191, 21], [71191, 75821, 22], [75821, 80308, 23], [80308, 82532, 24], [82532, 85078, 25], [85078, 87946, 26], [87946, 91425, 27], [91425, 94966, 28], [94966, 97053, 29], [97053, 97053, 30]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]