[{"id": "8a241b2948c45b8643f3f0633ef45254f7ffe0e5", "text": "DEBATE ON LOUIS REIL.\n\nSPEECH BY MR. J. J. CURRAN, M.P.,\nIN THE\nHOUSE OF COMMONS, OTTAWA, ON MONDAY, THE 15TH OF MARCH, 1886.\n\n(Hansard Report).\n\nThe following is a full report of the speech delivered in the House of Commons, Ottawa, on Monday, the 15th March, 1886, by Mr. J. J. Curran, M.P., for Montreal Centre:\n\nMr. Curran—Mr. Speaker, I deem it proper, in rising to address the House today on this most important question, to say one or two words with respect to the position I occupy in connection with this debate. It has been my duty upon former occasions to address this House upon questions involving very great feeling, and I may say here, in presence of all my friends, that whatever I have said on former occasions upon any question affecting the interests of the country, or affecting the interests of any class in the country, I adhere to today. It is my painful duty on this occasion to differ with a certain number with whom I have been in the habit of working in the past, and I regret to see them separating themselves from me and the friends that surround me; but whilst I do regret that, whilst I regret to be obliged to raise my voice in opposition to their views, I feel I should be unworthy of the position I occupy if I did not come out boldly and manfully and state what I believe to be for the true interests of the country in this great agitation that has been brought about by men who, I think, have acted with precipitation and without duly considering the results of their action. Not only in one section of this country, where I have had an opportunity of denying the statements made, but even in my own division, slanders have been circulated with regard to myself. All I have to say, and I take this opportunity of saying it, in the presence of this House and the country is that my ambition has been to represent my fellow citizens of Montreal Centre, that they have sent me here by an overwhelming majority, and having placed their confidence in me I shall not desert them so long as they stand by me in this Parliament, and I trust with their confidence and still greater assent, if possible, more emphatically given, to have the honor of representing them in the next Parliament. (Cheers.) It becomes my duty to follow one of the speakers on the other side of the House who made a most violent address on last Friday night. Some portions of that speech I will refer to very briefly indeed. The gist of nettlesome the hon. gentleman said he chose to address an exceedingly low level, and if I am obliged to follow him upon that ground he cannot complain; if I am obliged to fight him on the ground he has chosen himself he cannot complain; and he cannot complain if I am obliged to show that while in the political parties in this country, as in the political parties of every country, there is on both sides bigotry to be found, yet in the Conservative party the brains are ahead of the bigotry, whilst in the Reform party the bigotry is ahead of the brains. (Loud cheers.) The hon. gentleman spoke in the first instance with respect to the legality of the trial. He agrees with the hon. member for Rouville (Mr. Gigault) that the trial was a legal trial, that it had all the elements of legality about it, but he said that the trial was not a fair one.\n\nWAS THE TRIAL FAIR?\n\nI say on this occasion that I am surprised to find a gentleman calling himself a lawyer who pretends to say that a trial can be legal without being fair. What is the test of fairness? The only test of fairness is that which is established by law; you cannot go beyond that; the judge can-\nnot go beyond the law, and if a man has had the full benefit of the law—for the law as it stands on the statute book is the test of fairness—he has had a fair trial. But I find in this respect the honorable gentleman is absolutely and positively in contradiction with his own chief. The leader of the Opposition made a speech some time ago in the city of London, where a banquet was given him on his return from England, and, speaking on this very subject, he said:\n\n\"I think it right to say that, in my opinion, the Government acted in a very proper spirit in providing for the attendance of the prisoner's witnesses, and, from what I know of the leading counsel, I should think it impossible that in their management of the case there was anything unfair to the prisoner or derogatory to the high character they deservedly enjoy in the responsible duties they undertook to perform.\"\n\n(Loud cheers.) The honorable gentleman, however, said that there was one great element of unfairness in the trial—that his trial had taken place before a jury composed exclusively of Protestants. Would the honorable gentleman have wished that Biel upon that occasion should have been tried by a jury composed exclusively of Catholics? What a howl would have gone throughout the length and breadth of the country if at that time Louis Riel, who was an apostate from his Church, was at variance with the authorities, who had committed many acts of cruelty, of sacrilege and other acts which it will be my duty to mention in the course of this speech, had been put upon trial before men whose faith he had trampled on, whose Church he had desecrated, and whose most cherished convictions he had despised and spurned. (Cheers.) What was the statement of that unfortunate man in the course of the speech that he addressed to the jury upon that occasion? I hold in my hand the official report of that trial, and at page 150 I find the infamous language that that unfortunate man used to the venerable Archbishop who had brought him up, clothed him, fed him and educated him. He spoke of him, and in reference to one of the witnesses, a Mr. Nees, he said:\n\n\"One of the witnesses here, George Nees, I think, said that I spoke of Archbishop Tache and told him that he was a thief. If I had had the opportunity I proposed I would have questioned him as to what I said so that you would understand me. I have known Archbishop Tache as a great benefactor, I have seen him surrounded by his great property, the property of a widow whose road was passing near; he bought the land around and took that way to try and get her property at a cheap price. I read in the gospel: 'Ye Pharisees with your long prayers devour the widows.' And as Archbishop Tache is my great benefactor, and as he is my father I would say, because he has done me an immense deal of good, and because there was no one who had the courage to tell him, I did, because I love him, because I acknowledge all he has done for me. As to Bishop Grandin, it was on the same grounds. I have other instances of Bishop Tache, and the witness could have said as the Rev. Father Moulin—When you speak of such persons as Archbishop Tache, do not say it is made a mistake, for that he committed robbery? I say that—we have been patient a long time, and when we see that mild words only serve as covers for great ones to do wrong, it is time when we are justified in saying that robbery is robbery everywhere, and the guilty ones are bound by the force of public opinion to take notice of it. The one who has the courage to speak out in that way, instead of being an outrageous man, becomes, in fact, a benefactor to those men themselves and to society.\"\n\nWe have also heard from the last speaker that the recommendation to mercy had been entirely ignored. Before I get through with my observations I may refer to some other cases, in which a much stronger recommendation has also been overlooked; and I can say, having had considerable experience myself in matters of that kind, and from what I have read, that this recommendation to mercy is in a great measure just, as the hon. Minister of Public Works has expressed it—a desire on the part of the jury to relieve themselves to some extent of the responsibility for the verdict which they gave, and throw that responsibility through that means on the shoulders of the Executive. But we have also heard from the hon. gentleman that this unfortunate man Biel had given himself up to General Middleton, and that therefore he should be free—that therefore he should never have experienced the sad fate which befell him. Why, sir, do we not all know, have not we all lived through these troubles, have not we all seen what took place, and is it not in the memory of every man that Riel was not on that occasion afraid of the trial that was to come, on the part of the Dominion Government, but was afraid that he would be murdered on the spot by the indignant volunteers—was afraid not only of the whites who were there, but was afraid, and perhaps still more afraid, of the dire vengeance of the half-breeds whom he had deceived? (Loud cheers.) The last point to which the hon. gentleman has referred, and referred at very great length, was with reference to the in-\nsanity of the prisoner, and as that question has been raised by other speakers as well, I shall endeavor to deal with his arguments and those of the other speakers at the same time. However, he wound up his speech, sir, by an appeal to the feelings of the Catholics of this country. He sought to arouse in their minds the idea that this man had been sacrificed to Orange fanaticism, and with that point I shall endeavor to deal in the course of my remarks. But before proceeding to do so, allow me not only on general grounds, but more particularly from the debate which has taken place this afternoon upon the question of proceeding with the motion of the hon. member for Montmagny (Mr. Landry)—let me refer to the importance on this question and in this Parliament, the hon. member for Quebec East (Mr. Laurier) was there when the resolution was passed declaring these hon. gentlemen traitors to their country, their nationality and their creed. Did he hesitate? Did he want documents then, when he stood up and said that if he had been on the borders of the Saskatchewan he would have had his musket on his shoulder? (Cheers.) Did he stop there? Why, no, Sir, he was on the point of carrying out a steady march away off to the city of Toronto, there to exhibit the Saskatchewan musket. True, he changed his mind. (Laughter.) And later on, Queen's hall in Montreal was engaged for the hon. gentleman and his friends to speak once more as he had spoken on the Champ de Mars. He was to have gone there with his musket and show them the drill, but the only drill he performed was, right about face, and march home again. (Great laughter.) There is still more than that in the picture presented to us, when members' counties were invaded, and when as honest and upright men they said: Let us have time; we in the province of Quebec have followed our leaders for years; we have had confidence in them; we have believed them to be honest and conscientious men; give us time to read the documents and we will then pronounce. Was time allowed? No; they were denounced as traitors, and a whole army of spouters invaded every county; they were taken by the throat and forced to give expression to an opinion whether they liked it or not. We have had the magnificent spectacle to-day just as we had one on each of the occasions I have referred to. On both those occasions we have had three different lines adopted with regard to this unfortunate man Riel. We had him paraded before the public as\n\nA HERO, A MARTYR, AND A FOOL;\n\nthose were the three contentions upon which they spoke with such tremendous force. Now, sir, why was this agitation confined to the province of Quebec? Why was this hero, this martyr, this unfortunate and insane man merely made a martyr, a hero and a fool of in the province of Quebec alone? We have been told here by the able and eloquent representative of the Metis in this house, and we have all read in the admirable speech of the Hon. Senator Girard in the Senate, that the Metis are a distinct people, that they have their own genius and their own customs, that they are no more\nFrench-Canadians than they are Irish Canadians, that although they have some French blood in their veins, they are a distinct people by themselves. Louis Riel was at one time the leader of that people. Why have we not seen in the heart of the settlements of the Metis in Manitoba or in the Northwest Territories a single meeting called by any of the Metis people whom he was supposed to represent, to protest against his execution, or to say that it was either an act of cruelty or one for which the Government should be condemned? (Cheers.) More than that, we have had an appeal made to the Irish Catholics of the Dominion to join in this Quebec national movement. What would have been the result if a warning voice had not gone over the land, if it had been possible for those who were stirring up this agitation to join together in one, all the French-Canadians and Irish Catholics of this Dominion? Why, sir, we should not only have had the war of races these gentlemen threaten us with, but we should have had a war of religions as well; and looking at the state of the population, I ask my Irish Canadian friends and my French Canadian friends as well, what must have been the inevitable result of the contest these men were seeking to force upon us. (Cheers.) Have we been told when these gentlemen who now complain first protested? Have we been told that they took any action in regard to the matter with the Irish representatives of the house, of whom six are on this side of the house, and not one on the other side, which is in itself a pretty strong mark of where the bigotry lies. (Cheers.) Neither myself nor any of the other five Irish Catholic representatives in this house was ever approached by any of the French Canadian representatives and asked to take part in the agitation for a reprieve for Riel. But, living as I do in the city of Montreal—having been born and brought up there—amongst my French Canadian fellow citizens, and having among them as many sincere and warm hearted friends as among any other section of the community, I took upon myself when I heard that a report was going about, in spite of the agitation made by the newspapers, that certain parties had told the French ministers that the people of Quebec would not be excited if this man was executed—I took the trouble myself to come and tell the hon. ministers that any man who said the French Canadian people would not be excited was speaking either on a subject he did not know anything about, or else in a manner that he thought would suit his own purposes. I told the Ministers that it must be understood that, through the agitation of the Bourge party in the Province of Quebec, there would be a powerful attempt made to excite the people there, and they must adopt the course that was best calculated to serve the interests of the country; that if it were possible with safety to the interest of the country to extend mercy to the unfortunate Metis to do so. I felt it my duty to inform them what the state of the public mind was at the time. That I did without any solicitation on the part of any member of this House of the French nationality, and I take this opportunity of saying so publicly. (Hear, hear.) Well, sir, at a later period I was called upon to express myself against the action of the Government. It had probably never been thought worth while by the gentlemen taking part in the agitation to call upon me until it was all over with this unfortunate man. Then I was called upon to sign a telegram to the Premier of this Government to tell them that their act was an act of cruelty. I was called upon to do this by men who to-day say that they cannot decide, that they are in the dark, that the documents have all been concealed, that there is nothing before this House. (Cheers.) Why, sir, what do these gentlemen mean? Have we not the information before this House? Have we not the indictment? Have we not the evidence? Have we not the verdict? Have we not the charge to the jury? Have we not the documents of the appeal from one court to the other? Yet these hon. gentlemen tell us we have no documents. To those who sought to coerce and who did threaten me, I replied, gentlemen, if I never give another vote in the House of Commons, I will stand up for what I conceive to be right. (Cheers.) During the twenty-five years that I have been working hand-in-hand with the French Canadian Conservatives in the province of Quebec—during all those years—in which I have sacrificed time and labor to help to return many of those gentlemen to this house as they have returned the compliment to me, I have never yet backed down from doing what I thought the French Canadian people were entitled to; and come what may, I never shall. I admire and love that people for their great virtues and noble chivalry and the many marks of resemblance between them and the nationality to which I belong; and on an occasion of that kind, when the country, I conceived, was imperilled by the action of those men,\nno consideration could induce me to fail in performing that which I felt to be a duty in conscience, in honor, and in patriotism. (Cheers.) Now, sir, as regards the position of this unfortunate man and his first rebellion I do not intend to speak myself; but I do intend to give this house, at a later stage, the evidence of a witness, who spoke not merely as a private citizen of the Dominion, but as the leader of the Opposition in the province of Ontario. If we take the\n\nHISTORY OF THE SECOND REBELLION,\n\nwe find, put before the country, a document signed by six reverend gentlemen at Prince Albert. That document has been published and circulated and quoted upon the platform, and I have heard men who actually have had the audacity to say that it had been prepared by Government officials, and that these six clergymen were so lost to all sense of shame and consideration for their holy office that they had signed it and sent it forth to the country, although it did not contain the truth. I do not propose for one moment to use that document again; I have other and more important papers to which to refer, and my reference shall not be made to any speech of the leader of the Opposition, or to any quotations from statements of his, or to any documents formulated or issued by the Government in any of the departments of the Government. I hold in my hand a work that, at all events, every Catholic throughout the length and breadth of the Dominion will believe, namely, the\n\nANNALS OF THE PROPAGATION OF THE FAITH.\n\nThese volumes are published in London, and the one I refer to is the November number of 1885, number 276. These annals are published with reference to Catholic missions all over the world, and are under the special patronage of His Holiness Pope Leo XIII. and the cardinals and archbishops of the church. I find here not merely what regards this trial itself, but, in fact, all the information those hon. gentlemen are so anxious to have before they will undertake to pronounce their verdict. (Cheers.) An article in the September number says:\n\n\"We publish a touching letter on the civil war which ravaged Canada and caused the deaths of two missionaries, the Rev. Fathers Fafard and Marchand.\"\n\nI shall not read the whole of the document, but will begin at the point where the insurrection itself is spoken of. It says on page 333:\n\n\"The following narrative, forwarded to us by the Rev. Father Pourmond, completes the account given by the venerable Bishop, points out the causes of the different phases of the insurrection, and records several episodes illustrating the admirable faith of the Christians of the diocese of St. Albert:\n\n\"About a year ago, some thirty agitators, under pretence that the Government violated their most sacred rights, frequently assembled secretly by the woods, and beneath the shadow of the gigantic elm hatches their plots and bound themselves by oath not to divulge to any one the subject that they had in view. Of course we disapproved highly of these secret proceedings, and the consequence was a sudden irritation excited against the clergy; the populace accusing us of no longer favoring their interests as we used to do. One of the first acts of these assemblies was to send to the shores of the Missouri, across the Canadian border, in search of the too famous Riel, the great chief of the Metis movement in 1870, who had since that event become an American citizen, and discharged the humble duties of teacher, under the direction of the Rev. Fathers of the Society of Jesus at Montana.\"\n\nIt goes on to state how this man was received in triumph by the people. He made a long prayer, professed the most loyal sentiments, and, says the good missionary, \"I congratulated him on his good qualities; he caused great edification, and was looked upon as a saint.\" On the 4th September, however, Monseigneur Grandin came to the settlement. Monseigneur, who knew Mr. Riel well, could not share in the general feeling of confidence. He said:\n\n\"I cannot help feeling a great fear or dread of that man's influence, and a heavy fear for the future that awaits us. These fears were only too well justified. During the six months that followed Riel continued to deceive the public and clergy by his persuasive words and apparent piety, and played the true wolf in sheep's clothing—the angel of darkness disguised as an angel of light. He chose the beautiful feast of St. Joseph, the patron given by Monseigneur to the half-caste nation, and the pretext of solemnizing the occasion, and also doing honor to the basilica of an English neophyte, he assembled the most depraved of his friends and put them under arms the day before. On the evening of the same day, in order to bring the people together, and to have a pretext for making a general appeal to the nation, he spread a false report everywhere of the arrival of five hundred police to massacre the fanatics, burn the houses and seize the lands. 'We must march out to meet them,' he said. 'If we are united they will not be able to stand against us.' A large number, unwilling to believe the news, as they had no other proof of it, refused to revolt, but were soon forced to take up arms, as they were threatened with being shot themselves and having their farms pillaged. They almost all yielded to force; only some of them standing firm and braving death. On St. Joseph's eve amidst the darkness of night, a provisional Government was proclaimed, and its first ac\nwas a sacrificial one, the seizure of the Church of St. Anthony at Batoche, in spite of the earnest protestations of the Rev. Father Moulin. On Sunday, the 22nd March, a ferocious and pious half-caste, one of the authors of the movement, seeing the bad turn affairs had taken, refused to take part in the revolt. On St. Joseph's day he had proffered to submit to be taken prisoner rather than to participate in all the crimes which inaugurated it, and which must forever brand this terrible revolution with disgrace.\"\n\n(Cheers).\n\nHe proceeds then to speak of the various acts done by the noble Metis, who thought to resist this man's authority. He speaks of the terrible influence this man had over the Metis, and how he carried out his nefarious designs through that influence. He says that the Metis assembled together for the purpose of prayer and the carrying out of a counter movement, but Riel and his followers discovered this.\n\n\"They were bent on revenge and their vengeance was frightful, terrible, truly diabolical. I will tell you some of its principal workings. On the 25th March Riel, in his turn, assembled his warmest partisans in the profaned church of St. Anthony and there, in the midst of scenes rivalling each other in absurdity, folly and impiety, he publicly renounced the Holy Church of God, which was henceforth to be contemptuously to be called by him 'the old woman of Rome.' Having proclaimed his intended mission as a prophet sent from God to reform religion, the reformer proceeded to name the Exovide, and his council the Exovidat. Orders were given for the persecution of the faithful, and especially the clergy, and they tore us from our dwellings, us and our pious, faithful companions of Jesus; and placed us in a place of siege and exposed us to the greatest dangers in the new presbytery of St. Anthony at Batoche. We were indicted several times before the Exovidat, where, listening to the impieties and blasphemies of the Exovidat, Rev. Fathers Moulin, Vegreville and myself had to confess and defend our insulted faith, thereby drawing upon ourselves a deluge of outrages and threats, and exposing us to the fire of the enemy if we remain obstinate in refusing to submit to the will of the tyrant.\n\n\"Meanwhile—\"\n\nAnd here is a point which has been contested upon the public hustings by the friends of Riel—\n\n\"Meanwhile messengers had been sent to the poor savages of the prairie, for the most part obstinate Indians, always discontent with the domination of the white man, and asking nothing better than to see the hour of deliverance, if not of vengeance, arrive. Barbarism has returned to the bloody ferocity of its worst days, and in some places, particularly at Frog Lake, the whites have been massacred, and with them the missionaries who tried to save them and prevent the revolt. The latter were the Rev. Fathers Fafard and Marchand. Their mission has been burned as well as all the dwellings of the whites.\"\n\nHe goes on to speak of how this man assembled the families of the St. Laurent district under the pretext of protecting them, and how he maltreated them when he secured them in his power. What does he say about other instances of this man's conduct, about other persecutions?\n\n\"The most admirable of all is our dear Baptiste Hamelin, the father of a large family reared in piety and the fear of the Lord. He also, like our good M. Melin, has received in his home a special favor from the Blessed Virgin, his wife having been also miraculously cured. He was one of those who resisted all provocations, and who, in answer to my appeal in the midst of the camp and in presence of the judges, raised loud and triumphant cry of 'Long live the old woman of Rome! May live our holy father the Pope!' Persecuted more and more, condemned to be shot, he saw himself surrounded on all sides by fanatics of the Exovide. The martyr's crown hung suspended over his noble head, and by his side were his poor wife and large family of children, trembling for his fate, but standing firm like himself. A superhuman courage animated him, his looks, usually so gentle, became suddenly terrible. 'Well,' cried he, 'since you must have the sacrifice of either my faith or my life, my choice was made long ago, and the good God will give me strength enough to brave your threats and your rifles. If one of my brothers here present has the heart to do so, let him strike. You can shoot me, of course, but make me renounce my religion—never!' The vanquished apostates retired abashed, not daring to imbue their hands in their brother's blood, and once more the tyrant's rage was baffled by the firmness of one just man.\"\n\nAfter giving other accounts of the horrible treatment to which many people were subjected, how does the Rev. Father Fourmond wind up his letter:\n\n\"What evils have the folly and hypocrisy of one man heaped upon our poor little population? About twenty killed, as many wounded, fires, sackings—a dark and gloomy picture we have now before our eyes. All is not over yet, either, for about thirty of our unfortunate Christians are prisoners of war and await their trial at Regina, the capital of the Northwest Territory. Riel, the Exovide, is among the number, and is the one, it is generally believed, who will suffer death in expiation of the crimes he has committed and the blood he has caused to be shed. Mr. Grandin has just left us, having shed abundant tears over our condition, but what a blessing his paternal charity has been to us, the weak have been strengthened by his presence, and we have great confidence that this trial will in the end serve for us the greater glory of God, who has permitted it. This will be the fruits of the mercy won by the prayers of everyone here, for we have indeed prayed night and day among the apostates. I am thoroughly convinced that it is a marvelous effect of this incessant prayer that we have not been all annihilated.\n\nFOURMOND, O.M.I.,\n\"Missioner Apostolic.\"\n\nI will merely ask on the point, reading this\nchurch record of this man's proceedings, this one question, though I do not intend to deal with that branch of the subject at this moment—is there one hint of insanity throughout the whole of that letter?\n\nMr. Mills—He swears insanity later.\n\nMr. Curran—Well, I will try to convince the hon. gentleman who, upon the floor of the house, casts an asperation upon the Rev. Mr. Fourmond for what he spoke and swore to, that he spoke with Christian charity of that man, that he said he would be \"too great a criminal unless they put the charitable construction upon it that he was insane.\" Those were the words. (Hear, hear.) Now, I do not think that very many people in this country, that very many of those who have been excited by the terrible harangues that have been made throughout the province of Quebec by the writings of those who have not studied this question. I do not think that many of the Catholic people of the Dominion of Canada will consider Riel either a hero or a martyr. Now the next question comes,\n\nWAS HE INSANE?\n\nWe have had a medical commission which has been spoken of here to-day as one concocted for the occasion; we have had three respectable medical gentlemen slandered, I may say, on the floor of this house. We have had them held up as men who were willing to sign their names to a document which in their consciences they could not acquiesce in. We have had all this, not from a man insignificant in position, but from the leader of the Opposition himself. What right has the hon. the leader of the Opposition to make this assertion? What has been the past character of those three gentlemen? Do they stand high in this community or are they miserable characterless physicians who would lend themselves to an outrage such as he accuses them of having performed; and are we to be told that not only have these men been guilty of an act of this kind, but that the ministers of the Crown, men of every creed and every race, men who have served their country well and have enjoyed the confidence of the vast majority of the people of Canada, were a lot of reprobates who, in order to justify their act of having steeped their hands in the blood of an insane man, would turn round and make three respectable physicians perjure themselves—for it is nothing less—in producing a document in the manner in which he has accused them of having produced it? (Cheers.) Now, does not every lawyer know what constitutes insanity in law? It is not necessary to go into that point, because every man knows what has been the ruling of the highest tribunal in the Empire; but, if we are not satisfied with the testimony that has been adduced here to-day from that commission, if we are not satisfied with the documents which have been laid before us, if we think that Dr. Jukes and Dr. Valade and Dr. Lavell are three scoundrels, let us ask what has been the testimony of those who, without being medical experts in insanity, are people of common sense, are men who have watched the doings and the sayings of this unfortunate man Riel. And the first witness to whom I shall refer, one who has written over his own hand, is the Rev. Mr. Piquet, writing from Batoche in June last:\n\n\"Who is the author of the Northwest troubles? It is Louis Riel, and as he is the author of them, it is he alone who deserves to be punished. If, like me, you had followed the steps and studied the hypocrisy, the cunning and the secret arts that Riel has used to deceive and induce these people and draw them into rebellion, whether they would or not, you would, as I do, cast upon that cruel and tyrannical man all the blame of that revolt. Riel made use of their religiousness, made use of their ignorance, of their simplicity, touching every sensitive cord to make them the dupes of his ambition.\n\n\"There are persons who say that Riel is mad, but the more his conduct is examined the stronger must be the conviction that that nefarious man, under the appearance of his madness, preserves the plenitude of his reason. All his plans have a sequence and a directness which show a fixed purpose to attain his end, and at the same time to escape the gallows if his criminal undertakings should fail. Riel must bear all the responsibility of this rebellion. He alone is to blame for all the calamities that have happened or are still to happen, the necessary consequences of those troubles which have caused us all so much suffering.\"\n\nThis is the testimony of another member of the Order of Oblates. Now, Sir, as I was interrupted a moment ago by the hon. member for Bothwell (Mr. Mills), let us see what Rev. Father Fourmond really did say:\n\n\"Q. Have you made up your mind about the prisoner being sane as far as religious matters are concerned? A. We were very much embarrassed first, because sometimes he looked reasonable and sometimes he looked like a man who really did not know what he was saying. Q. Finally? A. We made up our minds that there was no way to explain his conduct but that he was insane; otherwise he would have to be too big a criminal.\"\n\nNow, sir, a great point has been sought to be made from the fact that Dr. Howard, a distinguished alienist in this country, and one who has made a name for himself abroad, was\nnot procured for the defence, that he had been asked for, but that, owing to the doctor having required the sum of $500 to go there, his evidence had to be dispensed with. Now, Sir, it is a well known fact that the lawyers for the defence in that case really chose to take Dr. Clarke in his stead; but I deem it only right and due to Dr. Howard to say that the fact that he is a man of 70 years and over, and that he could not travel alone, was the reason of his apparent unwillingness to go up there without having money enough to take with him a person to assist him in his advanced years. In the correspondence which took place then he said, writing to the solicitors of the Government, in the city of Montreal, to whom this matter had been referred:\n\n\"MONTREAL, 36 University street,\n\"29th July, 1885.\n\n\"GENTLEMEN.—I beg leave to acknowledge the receipt of yours of this morning, informing me that the Hon. Sir Alexander Campbell refuses to pay me $500 to pay my expenses to appear before the committee in Ottawa, as for the defence. I asked that amount because, in my delicate state of health, I cannot go alone, I must have one of my family to accompany me. I wish, however, to have a record of the fact that I don't refuse to go.\"\n\nHe would not have refused to go. I had the pleasure of meeting Dr. Howard yesterday, and in the course of conversation, going home from church, he said to me that he wished to give me a document to show that he could not possibly have done Riel any good, even if he had gone to Regina? that he had had this man for nine months under his care, and the certificate he must have given was the one which I will now read:\n\n\"MONTREAL, 14th March, 1886.\n\n\"My Dear Mr. Curran,—I notice by the papers that you are going to speak on the Riel question in the Dominion Parliament to-morrow. My name having been mentioned as one of the witnesses who should have given testimony for the defence at the trial of the unfortunate man, I enclose you a copy of a memorandum forwarded by me to the Government solicitors in this city.\n\n\"I think it well to say, however, that, in my opinion, my presence at the trial could not possibly have done Riel any good. You know my views on the question of responsibility, but when it came to the legal test, I should have been obliged to say that Riel was as responsible for his acts as any other criminal man.\n\n\"Yours sincerely,\n\n\"HENRY HOWARD,\n\"Medical Superintendent Asylum St. Jean de Dieu.\"\n\nI may say that Dr. Howard informed me that he had been solicited time and again to write something different from this by the friends of this man, and that he was desirous to have his opinions upon record. Now, Mr. Speaker, I think we have shown from the annals of the Propagation of the Faith, and from the documents which I have just read, that this man was neither a hero nor a martyr, and that he was not insane. No doubt he was devoured by an insatiable ambition, but, like Mahomet, he wished to establish a new religion as well as a new nationality. But sir, the idea of comparing this man to Emmet, the idea of comparing this man to the brilliant Meagher, or to any of the noble patriots of Ireland, as has been done upon the hustings and in this House, is the greatest insult that could be offered to the Irish race, because I consider him unworthy of being compared to the humblest Fenian that ever died for his country. Why do I say so? Not that I have any antipathy for the unfortunate man, whom I have never seen. No, sir; but I am obliged to take account of the evidence of men, not the evidence of people who were opposed to him in religion or politics, but those who had done him good service in the past, those who had always stood by him, those who had welcomed him there amongst them, and who wished him to succeed in doing what was right.\n\nWHAT WAS HIS PRICE?\n\nI speak now of the evidence of Father Andre, given at the trial; and what does he say about this man who has been represented to us as a hero, a martyr and a patriot? This is what he says:\n\n\"Q. Will you please state what the prisoner asked of the Federal Government? A. I had two interviews with the prisoner on that subject.\n\n\"Q. The prisoner claimed a certain indemnity from the Federal Government, didn't he? A. When the prisoner made his claim I was there with another gentleman, and he asked from the Government $100,000. We thought that was exorbitant, and the prisoner said: 'Well, a little, I will take at once $35,000.'\n\n\"Q. And on that condition the prisoner was to leave the country if the Government gave him $35,000. A. Yes, that was the condition he put.\n\n\"Q. When was this? A. This was on the 23rd December, 1884.\n\n\"Q. There was also another interview between you and the prisoner? A. There has been about twenty interviews between us.\n\n\"Q. He was always after you to ask you to use your influence with the Federal Government to obtain an indemnity? A. The first time he spoke of it was on the 12th December; he had never spoken a word of it before, and on the 23rd December he spoke about it again.\n\n\"Q. He talked about it very frequently? A. On these two occasions only.\"\n\"Q. That was his great occupation? A. Yes, at those times.\n\n\"Q. Is it not true that the prisoner told you that he himself was the half-breed question? A. He did not say so in express terms, but he conveyed that idea; he said, 'if I am satisfied the half-breeds will be.' I must explain this. This objection was made to him that even if the Government granted him $35,000, the half-breed question would remain the same, and he said in answer to that 'if I am satisfied the half-breeds will be.'\n\n\"Q. Is it a fact he told you he would even accept a less sum than $35,000? A. Yes, he said, 'use all the influence you can, you may not get all that but get all you can, and if you get less we will see.'\"\n\nThis testimony of the Oblate father, which will be found on page 113 of the official report, is supported by the evidence of a half-breed, Charles Nolin. On page 94 of the same report we read:\n\n\"Q. Did the prisoner tell you what he would do if they paid him, if the Government paid him the indemnity in question? A. Yes.\n\n\"Q. What did he tell you? A. He said if he got the money he wanted from the Government he would go wherever the Government wished to send him.\n\n\"Q. When did you finally differ from the prisoner in opinion? A. About twenty days before they took up arms, I broke with the prisoner and made open war upon him.\n\n\"Q. What happened on the 19th? A. On the 19th of March I and the prisoner were to meet to explain the situation. I was taken prisoner by four armed men.\n\n\"Q. Who were the armed men? A. Phillip Garoupy, David Tourond, Francis Vermette and Joseph Lemoin. I was taken to the Church of St. Antoine. I saw some Indians and half-breeds armed in the church.\n\n\"Q. Do you have occasion to go to the council after that? A. During the night I was brought before the council.\n\n\"Q. Was the prisoner there? A. Yes.\n\n\"Q. What did he say? A. I was brought before the council at 10 o'clock at night; the prisoner made the accusation against me.\n\n\"Q. What did you do? A. I defended myself.\n\n\"Q. What did you say, in a few words? A. I proved to the council that the prisoner had made use of the movement to claim the indemnity for his own pocket.\"\n\nI think, Mr. Speaker, we may well say that we have disposed of the patriotism of this man. (Cheers).\n\nTHE REFORM PRESS.\n\nDuring all this time there was an agitation going on in the country. There was an agitation by the Reform party in one direction in the province of Ontario, and there was an agitation of a similar kind, but in a different direction, going on in the province of Quebec. We have had from the hon. member for Provencher (Mr. Royal) several extracts from the writings of the Globe newspaper, which was trying to influence the minds of the people of Ontario at the time; and I propose, if the house will allow me, in view of the importance of the debate now going on, to make a few quotations from the Globe during that time. The first quotation to which I shall refer is dated 24th July, 1885, in which the Globe says:\n\n\"The trial programme points all in this one direction: Hurry through the case; hurry through the case. Remember that every moment the court is open there is danger that something may be blotted out that will damage the Government. Let the judge somewhat brusquely set aside all objections, though every one of them may hold large material for an appeal. Let what many think are reasonable facilities for securing evidence for the defence be refused, and everything be proceeded with as if conviction were a foregone conclusion. Then what follows? A good case is made out, on which Riel's friends and copatriots can say that the criminal has not had a fair trial. The Imperial Government can be worked upon to bring its influences to bear on Sir John A. Macdonald. Lord Salisbury will never face the country without having first tried all he can to avoid in British territory the shedding of a surrendered rebel's blood. There will be sent to Sir John A. Macdonald a communication to the effect that, inasmuch as a large number of Her Majesty's subjects are of opinion that Riel's trial was unfairly conducted, therefore it is Her Majesty's earnest wish that the criminal's life should be spared. Sir John will shelter himself behind Her Majesty, Sir John will reprieve Riel, will wish to God he could catch him, will point to the Globe to prove that he tried very hard to convict Riel, and every Tory politician in the land will be satisfied.\"\n\n(Cheers.)\n\nThey kept it up. They kept up the old cry and continued to set province against province and man against man. On the 12th August the following appeared:\n\n\"La Patrie is afraid that after all Riel will be hanged, as Sir John needs to surrender some victim to satisfy Upper Canada. And it adds very naively: 'It is understood that when the English of Upper Canada have spoken nothing remains for us (the French) but to obey.' The impression up here is that Room No. 8 has still the advantage and uses it to this day as ingeniously and as successfully as when the well-known place was first used. Sir John would no more think of resisting what his Quebec followers insist upon than he would of dying—whether they ask millions for a rally-way, amnesty for a rebel, $560 each extra pay for themselves, it is all the same, he cannot choose but yield.\"\n\n(Cheers.)\n\nBut we were told that the Orangemen were being aroused and were excited. Who was exciting them? At that time we had the election in Cardwell going on, the hon. member for Cardwell having been made a Minister of the crown; and who excited the Orangemen on that occasion? Take the Globe and\nsee how anxious it was to put down party bickering, sectional bitterness and all those unfortunate feelings that crop up in election matters, and which tend to set man against man. The Globe on 25th August had the following:\n\n\"The campaign in Cardwell is almost over and still the electors do not know whether Mr. White favors the execution or reprieve of Riel. Does Mr. White propose to compel the Orangemen of Cardwell to go to the polls blindfolded.\"\n\n(Prolonged cheers.)\n\nOn September 18 the Globe published the following:\n\n\"On the 15th September La Presse got the length of saying: 'All the English papers which don't wish to be fanatical or absurd not only believe but suggest that Riel is not going to be hanged on Friday; such hanging would be at once an iniquity and an inconvenience.' English papers in general have not suggested that Riel should not be hanged; but it took a very unusual amount, not of second sight, but of ordinary intelligence, to foresee that he would not. Sir John knows better than to offend his masters, especially masters who know so many of his discreditable tricks and to whom he has yielded so often before. The first bell rang to say nothing of the second.\"\n\nNow, sir, about this time an outbreak of indignation went up through the land from the Independent papers at the course pursued by the Globe. Even the Daily Witness, a paper unfavorable to this Government, denounced the conduct of the Globe, and that paper felt bound to say something in reply. It said:\n\n\"As to the statement that the Globe expects to make political capital out of Riel's case, the Globe is not so wholly ignorant of latter-day toryism as not to know that whatever is done to Riel, not one of those voters which Sir John calls his own will be lost to him. Riel's plans for raising the Indians succeeded, had his second rebellion deluged the Northwest with blood, and there have been two thousand instead of two hundred slaughtered at one time seemed possible, had the whole country been laid desolate, we know enough of an unprincipled gang which supports Sir John A. Macdonald to know that he would not have lost one vote in Parliament.\"\n\nNow, sir, I would ask what the Rouge press were doing during all this time? Were they following up the same track? Were they denouncing the Government and agreeing with the Globe, or were not they and these acting for them—the Riel committee—not only stating that they would not be satisfied even with the reprieve of Riel, but when that was granted they would go further, and thus, sir, this country was to be threatened with another amnesty agitation on behalf of this man who had already been the subject, after his first rebellion, of an amnesty agitation that disturbed the country for several years. (Prolonged cheering.)\n\nIt being six o'clock the Speaker left the chair.\n\nAFTER RECESS.\n\nMr. CURRAN—Up to the present time in the course of the remarks I have addressed to this honorable house, I have not used my own words, I have not given my own ideas. I have given the words, the written language of missionaries, who, with a devotion almost unparalleled, have sacrificed their lives to convert the heathen in our Northwest territories. But, sir, if I must proceed now with another branch of my subject, I can assure you that I do so with feelings of pain and sorrow. I have always sought, ever since I have been in public life, to cultivate as far as lay within my power, a feeling of good fellowship among all classes of Canadians. That has been my aim. If I have had on one occasion on the floor of this house to speak up for those principles in which I have been educated, which I entertain now, and which I intend to die still entertaining and that the feelings of some of my fellow members were hurt at what I stated, I did so, not to create strife, but because a solemn duty made it imperative that I should stand up for a principle on which no compromise is possible. (Hear, hear.) If we look at the history of the world we find that nations generally have been consolidated by the shedding of blood in defense of the fatherland and in the maintenance of its integrity. We believed, every good citizen, cherishing a hope for the future of this great country, when the alarm sounded, when our volunteers were called from every section of this great country to go and defend the integrity of Canadian soil, we believed that the day had come when this confederation, based on an act of Parliament only, would be consolidated by the blood of our young men, shed upon a common field in the defense of our common country. But unfortunately, that belief has been shattered through the machinations of those who have sought to make this unfortunate question one of a sectional character. We find that instead of our country being consolidated we have province arrayed against province, people against people, section against section, and creed against creed; and we find on the floor of this house an hon. gentleman standing up here and endeavoring in connection with it, to revive over this man's sad end—to revive in the hearts of the Irish people of this Dominion the old fight of\nOrange and Green. We find him endeavoring to rekindle the hatred of days gone by, and undoing the good work that has been progressing for so many years when we found Orangemen and Irish Catholics, in so far as the material interests of this country were concerned, standing shoulder to shoulder and working together for the fiscal policy and for the railway policy, that will ensure the prosperity of this country—laboring together in every great national enterprise. And, sir, if there is a man in this Dominion who has taken the sting out of the bigoted associations of the past, that man is the Right Hon. Sir John A. Macdonald. It was under his guidance and management, it was with the admirable skill he has always displayed, that we have been enabled up to the present time to see our people working harmoniously together. And if we want to know where the bigotry and sectionalism, where the spirit of animosity against the race to which I belong are to be found, I say, look at the benches on the other side of the house. Look there and you will not see one Irish Catholic returned to Parliament by the Reformers. The party which he leads has too great a hatred of our race and our creed to return even one man, whilst the party which has been denounced as the Orange party, the bigoted party, the party without principle, the corrupt party, the party which has sought to crush out a noble and generous patriotism—this party has combined not only Englishmen, Scotchmen and Frenchmen, but it includes Scotch Catholics, Irish Catholics and French Catholics, who are all working together harmoniously for the development of the great material interests of the country. Now, Sir, was it generous or patriotic in the hon. gentleman who preceded me to try to revive the animosities of the past, to send it broadcast throughout every land where the English and French languages are spoken, that in this country any one sect could trample on the necks of their fellow citizens? Can any attempt at justification be made for sending it abroad that the Dominion of Canada is ground down beneath the heel of the Orange association? If we look at the past history of the question we are now discussing, if it has become a Provincial question, a question of Protestantism or Catholicism, if this question has been embittered; there is one man in the country who is responsible for it, and who cannot avoid the responsibility; there is one man whose responsibility is down in black and white and will remain so long as the records of this country last; and that man is the leader of the Opposition. (Loud cheers.)\n\nHON. MR. BLAKE AND KILL.\n\nWe had from that hon. gentleman some time ago a speech in which he spoke about the noble and generous efforts he had made all through his career to cement the union of the different sections of the country. Why, sir, I was surprised that he could have uttered such language. After having made a tedious argument to arrive at his point, he endeavored to express his views in a metaphor, by saying that he was not going to construct a political platform out of the scaffold of Regina. No, sir, he was not; but I tell this House and this country that if he did not wish to construct a political platform out of that material, there was one thing he did, which I will prove beyond contradiction; he constructed a political banner out of the blood-stained garments of Thomas Scott and with his own hand he wrote the device upon it, \"$5,000 reward for the rope that hangs Louis Riel.\" (Prolonged cheers.) What did he say on that memorable occasion? The following is the Toronto Globe's report of the proceedings in the Ontario Legislature on the 3rd of February, 1871:\n\n\"Mr. Blake moved the following resolution: 'That the cold-blooded murder (for his outspoken loyalty to the Queen) of Thomas Scott, lately a resident of this province, and an immigrant thence to the Northwest, has impressed this house with a feeling of sorrow and indignation, and in the opinion of this house every effort should be made to bring to trial the perpetrators of this great crime, who as yet go unwhipt of justice.'\n\n\"After tracing the progress of the rebellion of 1870, Mr. Blake said: While I am disposed to treat legally anything which may properly be called a political offence, I cannot treat this murder as a political offence, if it were to be so treated. The trouble is that there is no crime in which the political offenses of the victim were treated by Riel. What I ask, was his crime? It was loyalty to his Queen, loyalty to the constitution, loyalty to the country. For this he was done to death in a way which I shall presently lay before the house. I am not going to trust myself to a statement of that barbarous event. It is better I should read to you the official report of the Hon. Donald A. Smith, who was on the spot at the time.\"\n\nThen the hon. gentleman proceeds to read that harrowing account, and continues:\n\n\"Now, sir, we have also before us the evidence which, on a motion of mine, was brought before the house and was printed—the evidences of eye-witnesses of that barbarous crime. At that time justice could have been done on Riel here in Ontario and, perhaps, also in England. He fled to the United States...\"\nbut there was no demand made for his extradition. But, Sir, it is a son of ours that he has murdered. It is our justice that he has violated; it is our duty to see, as necessary, that this justice is vindicated. This person, Riel, is living a little way outside the boundaries of the Northwest, in the United States. He is receiving deputations from the people of that country asking him to stand as a candidate for the local legislature and for the Parliament of Canada—yes, for the Parliament of Canada. We find a declining love of the good of the country and from patriotic motives to allow himself to be nominated. But, Sir, say that unless this province speaks out it will not be long that he will act thus, and we may yet undergo the humiliation and disgrace of seeing the murderer of one of our people elected to the Parliament of Canada, and representatives from Ottawa sitting in council on the affairs of the country with one guilty of murder. I warn the house and this province that unless we act in this matter the murderers will go unpunished. This, Sir, is no ordinary murder. It was no murder for revenge, for money or for any of the causes that generally provoke that crime. This is no casual, hurried, passionate transaction in which the excuse of want of time or deliberation, or of passionate emotion may be pleaded. Even in the presence of the delegate sent by the Canadian Government to treat with these people, and while he was engaged in his mission, this deed was done, and its enormity was enhanced by the solemn mockery of a pretended court-martial and a so-called condemnation of death. The victim died because he was a loyal man; he died because he would not aid rebels; he died because he resisted rebellion—he died, in fact, for loyalty to Queen and country.\n\nThat this is not an ordinary murder is proved by the fact that it provoked an universal fever of indignation throughout this province. If the indignation has subsided, it does not blaze so high after this interval, still that indignation burns deeply, and is not to be soothed by anything less than the meting out of justice to the perpetrators of the crime. We have been told that we have nothing to do with this matter. We Canadians, we men of Ontario—we, the representatives of the people of Ontario, assembled here to express the feelings of the province of Ontario, have nothing to do with any of our sons. (Cheers.) We are told that it is our duty, our right, our pleasure to express to the Governor-General our joy at the occasion of his blood being cleansed. We were asked to discharge that duty, and we did it with pleasure and decent warmth. But, sir, am I to compare for an instant the feeling of the people of the country on the ennoblement of the Governor-General's blood with the feeling that was evoked by the spilling of the blood of one of our sons? No, sir; we have learned here to value the lives of the people. We recognize the truth of the poet's words:\n\n'The king may make a belted knight,\nA marquis, duke, and a' that;\nBut an honest man's aboon his might,\nGild faith he mauna fa' that.'\n\n'It is true that we have solemnly recorded our satisfaction because the blood of the Governor-General has been ennobled, and as the blood of one of our sons has been spilled. It is our duty, it is our privilege, it is our right, to express our sorrow and indignation at that event.\n\nI hope that we shall show that we are bound to one another by a tie as men of Ontario, bound by the tie of kinship; that we shall show that our province is dear to us, that our people are dear to us, and that the men of Ontario have but one feeling on this subject. Let us join our sorrow to the sorrow of his kinsfolk. To them has been denied the poor consolation of giving a decent sepulchre to his ashes, and of mourning over the place where they await the great day. That spot is unknown, the case of a monument is placed over his remains. Let his country write his epitaph in the records of her assembly, and express a people's sorrow for his untimely death, and a people's stern resolve that that death shall be avenged.'\n\nTo be avenged—under what circumstances? Does the hon. gentleman pretend that when his leader (Hon. Mr. Blake) was doing this in spite of protestations of the Conservative party in the Assembly of Ontario, who stood up and said: This crime has been committed outside our jurisdiction, outside the boundaries of Ontario, and asked that this proposition, which would leave a standing barrier between the people of the two provinces, be not committed—does the hon. gentleman pretend that he was then acting in the interests of harmony and peace? Did he seek on that occasion to do otherwise than to sink deeper and deeper into the hearts of the people of Ontario those feelings of hatred, which he and his men say are the cause of the death of Riel to-day? (Loud cheers.) Does he pretend to tell any hon. member of this House that he was blind to what was going on in Quebec all that time? Does he pretend that he did not know the people of Quebec were up in arms and clamoring, in a state of feverish excitement, for the protection of Riel, just as he was clamoring for his blood? (Cheers.) Was that the way to cement the provinces together, to cement the different races together? Or was it the way to divide our people into hostile camps to wage war against one another for years afterwards? I say, if we have the state of affairs which the hon. gentleman who preceded me has depicted, it is due mainly to the unpatriotic and fiery denunciations, which were made on that occasion by the leader of the Opposition. We have been told by the hon. gentleman who spoke last (Mr. Cameron, Huron) that some of the Orange lodges of Ontario passed resolutions asking for the execution of Riel. Now, sir, I do not say that those resolutions were not passed, but I have it on the best authority, and it has been shown here by other hon. gentlemen, that the men whose names are mentioned in connection with these resolutions are not Con-\nservatives but are Grit Orangemen, who passed those resolutions and published them for the purpose of embarrassing the Government and exciting feud between Quebec and Ontario. These resolutions were passed for the special purpose of driving from the ranks of Sir John the French Conservatives who supported him for so many years. I will not refer much longer to this point, but will say that upon that particular section of this subject my words never had any uncertain sound. I felt, when this unfortunate excitement broke out and I saw the turn things were taking—the excitement in Quebec and the counter excitement in Ontario, an anti-Riel meeting having been publicly called in Toronto, as an offset to the meetings held in his favor in Quebec—that it was the duty of every man who felt he had any influence, no matter how little, to exert it as an honest man in the endeavor to stem the tide of the terrible excitement which was then rushing madly forward. I undertook to write to a friend of mine—not a political friend, but, at all events, a friend in whom I had confidence (the editor of the Catholic Record—and asked him to publish in his paper my views. I knew that in doing so I was cutting ties that had bound me to many with whom I had been associated for years; but when I sent my words abroad, through the press, did I then seek more than I do now to propitiate the Orange body? No, sir. In that letter, referring to the Orange lodge which had passed those resolutions, I said, also referring to the allegation that Riel was hanged because the decree went forth from the Orange lodges, \"that any resolution calling for his execution, whether it came from a Conservative or a Grit Orange lodge, was a disgrace to them and to the country.\" I consider that allegation utterly unfounded and capable of working incalculable injury to our Dominion. I further wrote, \"Granted that certain lodges did go so far as to pass such resolutions, as certain preachers, in platform outpourings, thought fit to call on the Government to hang Riel; I say all this was cruel and disgraceful. At almost any moment in any civilized community, you will get men to sign a paper asking the Government to exercise clemency, but it remains for the Black lodge at Peterboro and a minister of the Gospel, Oversorth, to clamor for a man's blood.\" Was I seeking the favor of Orangeism in such language? When the hon. member for York (Mr. Wallace), who is an Orangeman, I believe, spoke the other night, he had not one word to say in the defense of the action of those who called on the Executive to see that the sentence of death was carried out. Quite the reverse. The duty that devolved on the shoulders of the ministers of the Crown to meet in council to decide upon the fate of a human being, was a most painful one; but for men to sit down where they have no responsibility, and in cold blood to clamor for the life of any man is something I cannot conceive; yet we are told that the Orange body, as a body, had made these representations. I say there is no proof of anything of this kind; there is no evidence to support such statement. Whilst all the public meetings were going on in Quebec, whilst all the outpourings of excited feeling appeared in the press of Quebec, not one public meeting was held in Ontario to force the Government to carry out the sentence. But we are told that this case turns on Orangeism, that we ourselves are Orange Catholics. I ask any hon. gentleman in this house—\n\nMr. Langelier—Hear, hear.\n\nMr. Curran—The hon. member for Megantic (Mr. Langelier) says \"hear, hear?\" Who sent him to this house to oppose the Government? Who voted for him to oppose the leader of the Government? The Orangemen of Megantic, the men who, he says, clamored for the blood of this man. (Cheers.) These are the men who voted for him and sent him here to oppose the leader of the Government. Who have sent other representatives from the Province of Quebec? Why, surely the hon. member, for Huntingdon (Mr. Scrivener), will not deny that he sits in this house to oppose the right hon. gentleman, the leader of the Government, by virtue of the Orange votes of Huntingdon, and throughout Lower Canada every Orange lodge has been arrayed, on all occasions, against the Conservative party in every election. (Cheers.) When the Conservative party were driven out of office, in 1874, did the Reform party forget the good services they had received from the Orange body? Why, the only Orange procession we have had in the city of Montreal within my recollection, under the guise of a funeral, with bands playing and banners flying, was carried out under Grit bayonets furnished by the Reform Government (hear, hear), and, sir, when the Reform Government arrived in power, who was the man whose services were the first to be recognized in the city of Montreal, who first received the favors...\nof the Government, if it was not Dunbar Browne, who had published The Altar and the Throne, who had established that paper in the interest of the Reform party, had devoted all his time and all his energy to the promotion of Reformers? He was rewarded by being made collector of inland revenue of the city of Montreal. And that was not all. There was the ex-grand master to be provided for. He too had labored day and night for the Reform party. He had never taken any rest until he succeeded in placing his great Reform leaders in office; and, when I tell you that the past grand master, George Smith, had an office—not an ordinary office, but a brand new office, an office created for him—that he was made shipping master of the port of Montreal, an office that had always been filled before by the collector of customs, there is the best proof that upon all occasions these people, although now they raise the Orange cry in order to revive the old feud between the Irish Catholic and the Irish Orangemen on an issue absolutely foreign to their differences, have always sought to curry the favor of Orangemen wherever they could manage to do it. It is not merely with regard to those times, not merely in years gone by that this has been going on, that we have seen and heard and read how great the love of these hon. gentlemen has been for Irish Catholics, how great their love has been for Ireland, how greatly that love has been manifested in their public press whenever an Irish Catholic candidate came forward. On those occasions how did they manifest it? I will not go back to days gone by. I will not go back to 1863, when the late Hon. D'Arcy McGee was opposed by the late Hon. John Young, and the principal grounds taken against him was that he had been connected with the '48 movement. Though he had given the Reformers the benefit of his great talents and had been connected with them for some years, when he parted from them they revived the credit that he had been connected with the movement of '48. I remember hearing the great outburst of the Hon. Thomas D'Arcy McGee on the Haymarket square in Montreal, when he spoke in reply to that charge, and told what had transpired before his own eyes in Ireland when a young boy of 18 or 19, how he saw the unfortunate people dying by the thousand from famine and from fever, how he saw them evicted from their houses into the ditch by heartless landlords. He said that his heart revolted at the sight, and he had rushed into rebellion; and \"Great God,\" said he, \"older as I am today, if I saw the same thing happening now, I feel that my heart would lead me to take the same stand over again as I did on that occasion.\" And yet it is these people, even after the six hours' speech of the hon. leader of the Opposition had been delivered here in reference to the sufferings of the half-breeds, whom we find stating in one of their papers that:\n\n\"They had farms provided with agricultural machinery and comfortable homesteads, which the correspondent of the St. Paul, Minn., Pioneer Press said might have been put alongside the average farm of Minnesota without fearing comparison. These were in jeopardy through the neglect of the Government to grant them titles to their land. They feared that they were about to be driven off them, and they took up arms in the defense of their hearths.\"\n\nThey justify the half-breed rebellion on the ground that the Government had not sent patents to them. As the leader of the Government said, not one man, woman or child was disturbed; not one man, woman or child was put into the streets; not one man lost his property; and yet they were justified in the rebellion, they were justified in taking up arms against the Dominion of Canada; but the downtrodden Irishman, who saw his people dying of famine and sickness, who saw his roof torn down, was not so justified. The Grit party said the half-breeds had a right, but the Irishman in his own land had no right. But I need not refer to ancient history. It is only in 1881 that my young friend, Mr. C. J. Doherty, was a candidate for the city of Montreal in the Conservative interest. The Montreal Gazette took up his case, and laid before the people of Montreal the fact that he was the first prize scholar of the St. Mary's college, that he was the gold medalist of McGill university, that he possessed all the talents and educational requirements to make him a first class representative. Well, what was the result? I may tell this House that since that time when the alarm sounded that this country was in danger, Mr. Doherty left his bed of sickness and went with his regiment, the 65th Battalion of Montreal, and fought like a man with his French-Canadian friends in the Northwest. But what was that man said to be by the Reformers when he came out as a candidate? Take the Montreal Herald of that time, then the recognized organ of the Liberal party. What did it say on the 29th November, 1881?\n\n\"What will be the effect in the business...\"\ncircles of England should the tidings be cabled over that the largest, and in fact the only strictly commercial electoral district in Canada should find no more fitting representative than a pronounced Land league? We may well ask, what has Montreal West done to be branded with such an odious stigma as this?\"\n\nThen on the 30th November, 1881, it said:\n\n\"If Mr. Doherty should be lucky enough to get elected for Montreal West it would be an enlivening piece of news to send to the old country to say that the greatest city in British America had returned the president of the Land league as a member of Parliament. The Land leaguers in Ireland would be greatly encouraged and all the more, as Mr. Doherty is to go in if he can on the Conservative ticket. They say the Conservatives and Liberals are getting to be good friends at home, and so it would be all right. But the society for preventing cruelty to animals here would have to look sharp, as after the election some of the Liberal cows might find themselves without their tails.\"\n\nAnd, again, the evening organ of the Reform party said:\n\n\"What would be the effect if it were cabled over to Parnell in Kilmainham that the president of the Land league has been elected as a member of Parliament for the city of Montreal.\n\nThese are a few specimens of what has been done in the past by the great Reform party, and they show the great love which they bear to the people whose votes they now seek to obtain. We have been speaking here about an execution, about one unfortunate man having been hanged under a Conservative administration, when that man was recommended to mercy by the jury which tried him. One would imagine from the outpourings on the other side that no man or woman had ever been executed in this country under similar circumstances before. But, sir, I find recorded in the True Witness, of 23rd January, 1863, when the Reform party was in power, a case against that party—not of the execution of one man, but of the execution of an unfortunate man and his wife, who had been strongly recommended to the mercy of the court; and that man and his wife were both hanged, despite the strong recommendation of the jury and despite the most urgent appeals made from all parties in their favor. Let us read, sir, a brief extract from the paper I have just mentioned. This man was named Aylward, and he had settled with his wife in a township in the rear of the county of Hastings. Their neighbor was a man named Munro. The parties lived in good fellowship until, unfortunately, some hens belonging to Munro had caused depredations in a wheat field belonging to Aylward.\n\nOne thing brought on another, and three or four days after this had taken place, one of the hens belonging to Munro was shot by Aylward; Munro and his son went to Aylward's house to see him about it, they spoke about the hen, and were told, it might be found upon the land where it had committed the depredation. They went out together, Aylward taking his gun; a scuffle took place between Aylward and Munro and his son; during its progress the wife of Aylward came to the assistance of her husband, a wound was inflicted upon Munro which produced death sometime after. This is how the True Witness narrated some of the facts:\n\n\"The husband and wife were Irish Catholics, both young and much attached to each other. The man was 26 years of age, of medium size, but strong and robust, of intelligent cast of feature, and, like the generality of his countrymen, capable of displaying strong friendship, but easily estranged by unkindness or acts of selfishness. Mrs. Aylward had a very youthful appearance, and did not look to be more than 18 or 19 years of age, although some two or three years older. She was considered to possess more than the ordinary share of beauty, and was of light and elastic figure. Any person who visited their home could not but be struck with the neatness and cleanliness with which everything about it was kept, and which gave an air of comfort and cheerfulness to their humble home. At the time of her death she was the mother of three small children, girls, the youngest an infant at the breast...\"\n\nChief Justice Draper presided at the trial; the jury found a verdict of guilty, accompanied with a strong recommendation to mercy, and says the paper:\n\n\"And now comes the application to the Executive for a commutation of the sentence. The petition was prepared by Mr. Finn, the prisoner's attorney, and was signed by all the leading inhabitants of the county of Hastings, by high and low, rich and poor. There was no distinction of rank or class or creed, the arrangement of the petition being the foremost on the petition. In fact, everyone felt, with the exception of the Grit M.P.E., that their lives ought to be spared. The Grit Government refused the petition. Everyone thought they should not be executed, and a respite of one month was asked. All of no avail, they were hanged by the neck until dead, on the morning of the feast of the Immaculate Conception.\"\n\nThat, sir, is a statement of the facts as they happened under a Reform Government. And the Reform party now appeals to the people of the country—to the French Canadians and Irish Catholics—and says that the execution of Riel was an outrage, that it was a brutal murder—that it was a judicial murder. But what did they say when this poor unfortunate Aylward and his young wife were both\nlaunched into eternity? Because no appeals that they made would be listened to, although the petition was signed by all classes and creeds in the community, with the exception of the Reform member of the Legislature of that county. (Hear, hear). Mr. Speaker, in this matter what was the position in which I found myself placed? I have read here, from the annals of the Propagation of the Faith, what had been the career of the unfortunate man whose fate we are discussing. I was asked to do what? To stand up for him in the name of the French-Canadian race—to stand up for him and do what? To roll in the gutter, to disgrace and degrade, and denounce as traitors, the three French-Canadian gentlemen in the Ministry who have stood by the French-Canadian people for years and years. (Loud cheers.) Was I doing more honor to the French-Canadian people by believing in the integrity of the hon. Minister of Public Works in this house, the chosen friend of the late lamented Sir George E. Cartier, his chosen lieutenant, his chosen successor in this house and country, who had labored for thirty years and never once betrayed the interests that were confided to him by his people? Was I to sacrifice him? Was I to degrade and disgrace him for the sake of Louis Riel, because detested people clamoured against him and called him a traitor? (Cheers.) Was I to see my hon. friend the Minister of Militia treated in the same manner, whom I have known, respected and admired for his pluck, and for the manner in which he stood up for his countrymen upon all occasions? Was I to sacrifice that hon. gentleman for the sake of the clamor about Louis Riel? (Cheers.) Was I doing more honor and more credit to the French-Canadian people by believing that these men were instigated by honest, and high and pure motives, than by espousing the cause of the wretched man, Louis Riel? Was I, sir, to sacrifice the friend of my youth, the man with whom I have grown up side by side, whom I have seen raised to the highest position in his own province, the idol of the French-Canadian people for his noble, generous qualities and especially his brilliant eloquence—was I to sacrifice my hon. friend Mr. Chapleau, the secretary of state?\n\nWas I doing more honor to the French-Canadian people by believing that these three hon. gentlemen remained true to their people, and was I to be justified in preferring Louis Riel to them? And, sir, more than all that, I was asked to sacrifice the right hon. the leader of this Government, and to believe that he was capable—he and his colleagues—for the satisfaction of any organization in this country whatever, of stepping their hands in the blood of a fellow-creature? And I was asked, sir, to sacrifice the man in this Government who belongs to my own race and creed—all for the sake of Louis Riel. I was asked to sacrifice the hon. Minister of Inland Revenue, the man who had carried the Irish resolutions in this House, which had caused joy and gladness to my fellow-countrymen on the other side of the Atlantic. (Great cheering.) I was asked to sacrifice him. I was asked to sacrifice everything that is near and dear to me! Could I do it? Could I do it in face of my experience in the past? Could I do it after what I knew had transpired in the Northwest? In the face of the history of this unfortunate rebellion, and all for the sake of a man whose character has been described by the missionaries whose evidence I have quoted? No, sir, I could not do it. I felt that I should be unworthy of the position I hold, if, standing here, speaking in behalf of the people I have the honor to represent, I allowed myself, under those circumstances, to be carried away by this irrational and mischievous agitation. I acted, sir, knowing and feeling fully how painful my duty was; but in performing that duty, I have acted as a man who feels the responsibility of his position, as a man who loves the race who has taken this unfortunate man for a time to their hearts, but who will find out their mistake before very long, and I am convinced, sir, that the future will justify my conduct, and the verdict of my constituents will be that I have acted as a man of honor, as a man of conscience, as a man who loves his country dearly, and who hopes to see that country great and glorious in the future. Mr. Curran resumed his seat amidst prolonged cheering.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001420.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 24214, "total-output-tokens": 18144, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3603, 1], [3603, 8846, 2], [8846, 11950, 3], [11950, 16958, 4], [16958, 22431, 5], [22431, 28436, 6], [28436, 33661, 7], [33661, 38786, 8], [38786, 44386, 9], [44386, 49533, 10], [49533, 54781, 11], [54781, 60818, 12], [60818, 65702, 13], [65702, 70696, 14], [70696, 76115, 15], [76115, 80486, 16]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]