[{"id": "54aff3e9c648005abc9126478bc8688c37540c31", "text": "LA QUESTION RIEL\n\nDISCOURS DE M. TASSÉ, M. P.\n\nPRONONCÉ DEVANT LE \"CERCLE LAFONTAINE\" D'OTTAWA,\nLE 19 FÉVRIER 1886.\n\nBIBLIOTHÈQUE\nSAINT-SULPICE\nLA QUESTION RIEL\n\nDISCOURS DE M. TASSÉ, M.P.\n\nPRONONCÉ DEVANT LE \"CERCLE LAFONTAINE\" D'OTTAWA,\nLE 19 FÉVRIER 1886.\n\nM. le Président,\n\nMessieurs,\n\nJ'ai regretté de n'avoir pu assister à votre séance d'inauguration. Des circonstances plus fortes que ma volonté m'obligeaient d'être ailleurs, mais le cœur était près de vous, au milieu de vous. Le soldat ne choisit ni l'heure ni le lieu du combat : il est là où le devoir l'appelle. J'étais sur la brèche ce jour-là. C'est mon excuse. Je crois qu'elle vous suffira. Depuis, la maladie m'a empêché de tenir parole ; mais je crois que vous devez plutôt être heureux de vous avoir fourni l'occasion d'entendre l'homme le plus éloquent de notre race. Si tous les conscrits avaient de pareils substituts, il serait facile de remporter des victoires.\n\nLe Cercle Lafontaine\n\nJe vous félicite d'avoir fondé le Cercle Lafontaine. Ce sera notre école, l'infanterie et au même temps l'artillerie. Ici l'on formera de jeunes et vaillants soldats ; cette ville en est toute remplie ; ici l'on formera de jeunes et braves officiers—déjà j'en suis entouré—et au besoin de futurs généraux : j'espère que leurs épaulettes ne seront pas trop lentes à pousser. Seulement, apprenons à servir avant de commander. Napoléon disait que le bâton de maréchal se trouve dans la giberne de chaque soldat français. Au Canada, sur cette terre libre, la terre la plus libre du monde, le plus haut poste peut être convoité par le plus humble sujet de Sa Majesté. M. Mackenzie a prouvé que de la truelle de maçon au portefeuille du premier ministre la distance n'est pas infranchissable. Dans la guerre franco-allemande, on attribuait le succès des Tourettes à leur discipline, à leur forte organi-\n\nsation, et au fait qu'ils connaissaient la topographie française mieux que les Français eux-mêmes. On dit même qu'ils connaissaient d'avance l'endroit où se trouvaient les plus belles pendules qui, hélas ! marquaient des heures sidélointures pour nous. Soyez un peu Allemands, ou plutôt imitez-les. Étudiez non seulement l'histoire, les institutions, les lois, mais identifiez les grands actes de votre parti ; mais étudiez aussi l'ennemi, qu'il soit rouge ou clair-ruit. Étudiez son passé, étudiez ses principes ou plutôt son absence de principes, et tâchez de découvrir son défaut de cuirasse. Achille n'était vulnérable qu'au talon. Le parti libéral est vulnérable de la tête à la plante des pieds.\n\nJe vous félicite aussi d'avoir choisi Lafontaine pour drapeau. There is much in a name, a dit Shakespeare. Pareil nom oblige. C'est un titre de noblesse. Lafontaine est l'un des plus beaux, l'un des plus grands hommes de notre histoire. Il symbolise à la fois l'union des Canadiens-Français et leur union avec les autres races du pays. Nous lui devons cet œuvre insigne, cette œuvre glorieuse, œuvre de salut, l'établissement du gouvernement responsable. Nous lui devons pour une large part les libertés politiques dont nous jouissons. Qui, ce nom seul est un drapeau. Et ce drapeau est tellement pur, tellement noble, que nos adversaires voudraient bien nous le dérober.\n\nNon contents de s'approprier Lafontaine, ils voudraient aussi nous enlever Morin—le grand patriote, le grand politique, le grand journaliste, le fondateur de la Société Saint-Jean-Baptiste, le premier rédacteur de la vieille Minerve. Eh bien, si nos adversaires sont de force à faire de la Minerve un journal radical, je leur concède Morin comme l'un de leurs chefs. Mais ne soyez pas étonnés de leur appétit\nAtttaques personnelles\n\nMais laissant là ces grands morts dont la mémoire est encore si vivante ; laissant le passé — second qu'il soit en enseignements — pour nous occuper du présent. Depuis que j'ai eu l'honneur de porter la parole en cette ville, un grand événement est survenu. Une tourmente a passé sur notre pays, menaçant de tout balayer, de tout renverser. J'étais, alors en France réparant ma santé épuisée par un travail ardu, car le journaliste doublé du député peut, je crois, se réclamer d'être un ouvrier dans toute la force du terme. L'ouvrier se plaint parfois de dix heures de travail. Le journaliste, lui, travaille souvent jusqu'au chant du coq. Sa vie est une épée continue. Quant au député, il veut savoir qu'on nous avoue siège à la chambre sans désespoir, sans épuisement, sans heurts durant. Je ne connais pas de dévouement pareil dans l'histoire du monde, sauf ces sénateurs romains qui moururent dans la chaise curule (On rit). En France, je me suis aussi occupé à faire connaître mon pays, à en rafraîchir le souvenir à cette grande patrie d'autrefois qui nous a si longtemps oubliés. Avec bien d'autres j'ai voulu lui montrer que nous pouvions nous écrier avec tout autant d'orgueil qu'en pleine terre normande :\n\nNon, elle n'est pas engourdie\nLa race des gars Normands.\n\nOn a écrit que j'avais déserté le champ de bataille, que je me cachais à New-York pour éviter les colères populaires. Évidemment, mes accusateurs me mesurent à leur aune. Je puis avoir mon gros lot d'imperfections, mais jamais depuis mon entrée dans la vie publique je ne me suis dérobé aux devoirs et aux responsabilités qu'elle impose. Je ne crains pas le peuple. Je suis l'un des siens. J'attends tout de lui et ce tout est sa confiance. Je respecte le peuple, même dans ses emportements, même dans ses injustices. Mais je me sens le courage nécessaire pour lui dire la vérité même lorsqu'elle est froide et flâche pas ses passions ou ses préjugés. Thémistocle disait : \"Mes concitoyens : Frappe, mais écoute ! On m'a brûlé en effigie pendant mon absence. Ce n'était ni digne ni courageux. L'épiscopat vous a dit ce qu'il pensait de ce reste de barbarie. Mais ce n'est pas le peuple d'Ottawa, le vrai peuple, le peuple honnête, le peuple industrieux, le peuple qui fait et défait les députés, qui a allumé le bûcher. C'est une voyoucratie irresponsable qui a exécuté cette mascarade. Cette voyoucratie je l'ai déjà fait rentrer dans ses repaires, et avec votre concours je l'y ferai encore rentrer. Je ne la confonds pas avec le parti libéral. Elle se nomme écume et fange.\n\nCeux qui me reprochent mon absence oublient que le chef du parti libéral, l'honorable M. Blake, était allé lui aussi chercher sous d'autres cieux de la santé et du repos. Il était à Londres, j'étais à Paris. Eh bien, s'est-il trouvé un seul de ses amis politiques pour l'accuser de fuir le combat pour des raisons dites diplomatiques ? Je n'en connais pas. Pourquoi deux poids et deux mesures ?\n\nLa situation\n\nSur la question du Nord-Ouest comme sur les autres questions, je suis prêt à exposer mes vues avec le calme, la franchise, l'esprit réfléchi que vous avez le droit d'attendre de votre représentant. Ces vues peuvent n'être pas du goût de tout le monde — tout le monde est un être complexe, parfois très bizarre, fort difficile à satisfaire — mais j'ai confiance qu'elles seront pesées attentivement par mes amis politiques, même par mes adversaires. Vous êtes le jury, c'est vous qui aurez à rendre le verdict ; mais si nous, représentants du peuple, avons des devoirs à remplir, il vous incombe de prendre connaissance de toutes les pièces du dossier, il vous incombe de ne prononcer votre jugement qu'après une soigneuse et mûre délibération.\n\nIl est bien d'autres sujets que je pourrais traiter ce soir et qui devront influer sur votre verdict. Je pourrais vous parler de la protection et de ses bienfaisantes influences — protection que le parti libéral paraît disposer de combattre avec tout autant de violence que le parti conservateur compare le régime libéral de 1874-1876 aux années qui ont suivi et établi l'immense majorité de l'administration conservatrice. Je pourrais vous parler de la construction, de l'heureux achèvement du chemin de fer du Pacifique, qui va faire de nous une nation, et qui est l'une des merveilles de notre siècle. Je pourrais vous parler de la nouvelle loi électorale qui élargit si considérablement le suffrage, qui donne le droit de vote à quiconque possède un pouce de terre ou gagne un salaire honnête, qui nous donne tous les avantages du suffrage universel sans ses inconvénients, et qui montre que les vrais réformateurs, les vrais émancipateurs du peuple, ne sont pas les libéraux, mais les conservateurs. Mais je crois répondre à vos demandes en m'arrêtant à la question la plus delicate, la plus balance, celle qui passionne le plus les esprits, celle qui a causé une si grande commotion, presque une révolution.\nLes griefs des Métis du Nord-Ouest : leur révolte, l'exécution de leur chef ; tels sont les trois points que nous allons d'abord aborder. Je n'ai pas la prétention de les traiter à fond. S'il a fallu six heures à M. Blake et à M. Girard, le premier pour faire le procès du gouvernement sur le premier point seulement, et le second pour réfuter son réquisitoire, il vous sera facile de comprendre que je ne puis discuter, ce soir, sous tous ses aspects et dans tous ses détails une question aussi complexe, aussi controversée, qui a fait couler et qui fera encore couler bien des flots d'encre et d'éloquence. Attendez que les catéchistes parlementaires s'ouvriront de nouveau, et vous m'en donnerez des nouvelles !\n\nQue voulaient surtout les Métis ? Recevoir le plus possible du gouvernement. Vous voyez qu'ils ne ressemblent guère aux électeurs de la capitale (On rit). Les Métis tout comme les Sauvages sont convaincus que le Nord-Ouest leur appartient et que les blancs ont bien eu tort d'aller leur en disputer la possession. À leurs yeux nous ne sommes que des intrus. Ils vivaient si libres, si heureux, dans ces vastes espaces, où la chasse leur donnait de faciles, d'abondants moyens d'existence ! Ils étaient les rois du désert, elle sceptre leur échappait de toutes parts. Aussi ne nous avons jamais été obligés de céder avec la Compagnie de la baie d'Hudson et de lui avoir accordé 500,000 livres sterling pour éteindre ses droits de propriété outre des concessions énormes de terrains. C'est à eux que nous aurions dû donner ces millions de dollars, réservé toutes ces terres et plus encore. Le soulèvement de 1869-70 qui fut si prompt si réussi sous la conduite de Louis Riel, ne peut pas s'expliquer autrement.\n\nPar une loi passée en 1870, il fut résolu de reconnaître le droit des Métis dans la propriété du sol et d'étendre le droit au même titre à la concession de terres de 140,000 acres, ce qui donnait à chaque métis et enfant de métis environ 240 acres. Cette loi fut combattue, par le parti libéral, parce qu'elle ne pouvait être faite, avec si peu de titres, pour le champ de la cause métisse. Cette loi ne s'appliquait qu'aux Métis du Manitoba. Aussi, dans ces dernières années les Métis des territoires commencèrent à s'agiter pour être traités de la même façon. Le bison était, à peu près disparu — voilà l'animal qui est la cause première de la révolte — il leur fallut songer à abandonner le fusil pour la charrue. Transformation, je dois le dire, difficile à opérer. Le gouvernement Macdonald était alors au pouvoir. Les Métis demandaient des instruments aratoires. Cette demande fut refusée. Les Métis demandaient des grains de semence. Cette demande fut refusée. Les Métis demandaient des concessions de terres tout comme en avaient obtenues leurs frères du Manitoba. Cette demande fut encore refusée. Au reste, voici le texte même de la réponse de l'honorable M. Mills, ministre de l'Intérieur, à la requête des Métis :\n\nLa demande des pétitionnaires que le gouvernement les aidât à acheter des instruments aratoires, des grains, etc., je dois le dire, ne me semble pas devoir être accordée. Je ne comprends pas comment les Métis peuvent réclamer des terres autrement que les colons blancs des territoires.\n\nLes Métis qui, sous certains rapports, ont l'avantage sur les colons blancs, devraient comprendre la nécessité pour eux de se fixer dans quelque localité et d'employer toute leur énergie à l'agriculture. Nous savons qu'ils ont et dans ce cas leur assignerait des terres comme les colons blancs. Mais au-delà de ce point, ils ne doivent point s'attendre que le gouvernement leur donne des pétitions en satis- tendant que le gouvernement leur fournit des instruments aratoires ou des grains sont dans l'erreur. On a avancé de l'urgent à certains col- lors à la condition expresse que cet argent serait remis au gouvernement par ceux auxquels il était prêté. Je peux ajouter que le ré- sultat de cette démarche n'a pas engagé le gou- vernement à recommencer.\n\nSi la révolte n'a pas éclaté plus tôt, c'est pas la faute de l'administration MacKenzie. Elle a tout fait pour aigrir, exciter les Métis. Aussi, Louis Riel dont on invoque si souvent le témoignage, a-t-il pu dire dans son dernier manifeste... \"Le même état de choses dura jusqu'en 1876, quand le lieutenant-gouverneur Laird conseilla au gouvernement de rendre justice aux Mé- tis. Mais cela n'arriva pas. Durant les années 1876, 1877 et 1878, la seule réponse obtenue était : le gouvernement s'occupe de la chose.\"\n\nCe n'est qu'en 1879, que le droit des métis du Nord-Ouest fut reconnu. Les conservateurs avaient alors repris le pouvoir. Pourquoi cette concession n'a-t-elle pas été octroyée de suite ? allez-vous me dire. La raison principale du retard est que les amis des Métis ne s'entendaient pas sur ce qu'il y avait de mieux à faire. Les uns voulaient que les titres des Métis fussent immobiliers pendant trois générations. C'était l'avis de Mgr Taché d'Amours pendant dix ans, elle fut l'opinion exprimée par le Conseil du Nord-Ouest. Quant aux Métis eux-mêmes, ils demandaient tout simplement d'être traités comme ceux de Manitoba. De guerre lasse, le gouvernement se décida et, malgré lui, à accéder à cette demande. L'expérience a prouvé que cette politique n'était pas avantageuse aux Métis. En 1885, comme après 1870, la plupart des Métis ont vendu leurs titres à vil prix, for a song, comme disent les Anglais. Alors comme aujourd'hui, sont les spéculators qui ont profité de cette concession de terres. Aussi ce sont ceux-là qui s'agitent toujours avec le plus d'ardeur, avec le plus de véhémence pour la cause métisse.\n\nUn autre grief des Métis était que le gouvernement avait établi le système rectangulaire pour la division de la propriété, tandis qu'eux avaient adopté le bornage en vigueur dans la Rivière-Rouge et dans la province de Québec. Ce bornage veut que la terre soit aussi étroite et aussi longue que possible. Le Métis, tout comme le canadien-français, aime à voisiner et pour\ncela il faut que le voisin, même la voisine, ne soit pas très éloigné (On rit). Le système rectangulaire a été inauguré par les conservateurs et ratifié par les libéraux. C'est le système adopté dans tous les États de l'Ouest. Les représentations des Métis n'ont pas été sans effet, car toutes les paroisses qu'ils ont fondées dans la Saskatchewan ont la délimitation qu'ils ont réclamée. Il y a eu des retards. On ne peut guère se plaindre d'autre chose.\n\nOn s'est plaint des lenteurs dans l'émission des patentes aux terres des Métis. Pas de titres possibles sans arpentage. Or, on ne pouvait improviser l'arpentage de ces vastes espaces. Il fallait et beaucoup de temps et beaucoup d'argent. Malgré tout l'intérêt que nous portons à nos compatriotes de l'Ouest, il est impossible que nous ne puissions faire quelque chose. Nous voulons bien traiter leurs habitants avec largeur, avec munificence, mais les anciennes provinces sont aussi un peu obligées de s'occuper d'elles-mêmes. A ceux qui veulent critiquer quand même, je leur dirai que le parti conservateur avait fait arpenter neuf millions d'acres de terres dans le Nord-Ouest quand il quitta le pouvoir en 1873. Tandis que le parti libéral fit arpenter moins de deux millions d'acres, dans les cinq années qui suivirent. Et de 1879-1884 il a été arpenté 55,618,500 acres de terre ; dans la seule année 1883, il a été arpenté 27,500,000 acres, employant 120 arpenteurs, dont 35 Canadiens-français, moyennant une somme de $725,000 pour cette année seulement. Est-ce la preuve que le ministère se croit au bras ? Il nous faut parfois des années pour obtenir des arpentages dans la province de Québec. J'en sais quelque chose, car la compagnie qui se charge de coloniser le township de La Minerve a dû attendre trois ans avant que les arpentages fussent terminés. Et cependant personne ne songe à prendre les armes pour cela.\n\nOn doit maintenir aussi que plusieurs des officiers du gouvernement aient molesté les Métis et les sauvages : on dit même qu'il en est qui sont prévaricateurs. Il est probable, certain même, que plus d'un officier n'a pas répondu à la confiance des autorités, et que c'est l'une des causes du mécontentement. Aussi le ministère doit-il agir à leur égard avec la plus grande sévérité. Les employés malhonnêtes ou incapables doivent être congédiés sans merci. À la distance où ils se trouvaient, loin de leurs chefs, loin de tout contrôle, exposés à beaucoup de tentations, on convient qu'il se serait passé des abus dans l'administration. Mais aujourd'hui que l'éveil est donné, il faut redoubler de vigilance et faire la chasse aux abus. Le salut public l'exige.\n\nLes griefs réglés avant la révolte\n\nQuoiqu'il en soit de ces griefs, le gouvernement avait résolu d'y remédier plusieurs mois avant la révolte. Il est faux, il est injuste de prétendre que les ministres n'ont agi que lorsque les fusils sont partis. Le combat du Lac des Canards — la première rencontre et la seule entre les Métis et la police à cheval — a eu lieu le 26 mars 1885. Or, dès le commencement de février — c'est-à-dire environ sept semaines avant ce combat — sir John Macdonald télégraphiait à M. Charles Nolin, l'un des chefs métis, que le gouvernement allait sans tarder faire droit aux demandes des Métis. C'est ce que M. Charles Nolin dans ses procès de Riel, d'un autre côté, le Père André a juré, dans le même procès, le 26 mars 1885, une autre dépêche a été reçue annonçant que le gouvernement allait mettre les Métis du Nord-Ouest sur le même pied que ceux de Manitoba. Bien plus, le P. André a juré que toutes les réclamations des métis étaient réglées avant la révolte, sauf la taxe de la coupe sur le bois.\n\nOn a beaucoup parlé des lettres du P. André, dont les premières sont si accablantes, si écrasantes pour Riel ; on en a publié d'autres, écrites évidemment sous le coup des sympathies que la fin tragique du pauvre métis lui avait inspirées. On sait, en effet, que le P. André fut son conseiller, qu'il passa à ses côtés, ses derniers moments, qu'il laida à franchir le seuil terrible du temps à l'éternité, et qu'il eut la consolation de le ramener à la religion de ses pères, religion qu'il avait apostasiée et qu'il avait fait apostasier par les Métis. Eh bien, laissions de côté les lettres du P. André, puisqu'elles sont contradictoires sur quelques points ; et citons un document inattaquable, dégagé de toute passion, son témoignage sous serment lors du procès de Regina. Ce que je vais reproduire contre toute la question des griefs des Métis :\n\nQ. Quelles étaient les réclamations des Métis ?\nR. Depuis quand ? Il faut que vous précisiez.\nQ. De 1881 au temps de l'insurrection ?\nR. Depuis l'arrivée du prisonnier dans le pays ?\nQ. Oui.\nR. Il serait difficile de répondre à cette question. Elles se sont modifiées de temps à autre, depuis l'arrivée du prisonnier.\nQ. Avant son arrivée ?\nR. Avant les demandes des titres pour leurs terres, qu'elles fussent bornées en front à la rivière ainsi que l'abolition des taxes sur le bois, et ils réclamaient les droits de ceux qui n'avaient pas eu de temps à Manitoba.\nQ. Veut-on dire après l'arrivée du prisonnier dans le pays au temps de la rébellion, le gouvernement a répondu dans un sens favorable aux demandes et réclamations des Métis ?\nR. Oui, je sais qu'il a fait droit à certaines réclamations, mais avant cela, il n'avait pas eu de lettre à Manitoba. Le 4 mars dernier, un télégramme a été transmis accordant les serments.\nQ. Avant cette époque ?\nR. Oui. Quant au changement dans le mode d'arpentage des terres de la rivière, le gouvernement a répondu qu'il accorderait cela, et c'était là une question importante.\nQ. Quelle était donc la question qui restait à régler ?\nR. La question des lettres-patentes. Cela a aussi été réglé d'une manière, parce que l'on a envoyé M. Duck, que j'ai accompagné comme interprète.\nPourquoi Riel s'est révolté\n\nComment donc explique-t-on cette levée de boucliers ? La raison nous en a été donnée au cours du procès de Régina. En même temps que les Métis réclamaient du gouvernement certains droits, Riel, lui, négociait plus ou moins secrètement pour obtenir une forte indemnité pour couvrir, disait-il, les pertes résultant de sa première révolte. Le P. André a été l'un de ses intermédiaires. M. McDowall, membre du conseil du Nord-Ouest, en fut un autre. Riel réclama d'abord $100,000. On lui fit comprendre que c'était exorbitant. Il se rabattit sur $35,000. On lui dit encore qu'il serait difficile sinon impossible d'obtenir cette somme. — En bien dit, ait le P. André, je ne peux pas faire une proposition qui ne soit pas possible et nous aviserons pour le reste. Dès le début le P. André ayant fait observer à Riel que quand bien même il recevrait une forte somme d'argent, cela ne réglerait pas la question métisse, il répondit : \"Si je suis satisfait, les Métis le seront.\" Ainsi toute la question métisse se réduisait à sa seule personne, suivant Riel. \"Quand Auguste avait bu, toute la Pologne était ivre.\" Pour établir ce fait d'une façon irréfutable, laissez-moi encore vous citer le témoignage du Père André :\n\nQuestion—Je crois qu'en mois de décembre 1881 vous avez eu une entrevue avec Riel et Nolin, sujet de certaine somme que le prisonnier réclamait du gouvernement ?\n\nRéponse—Non pas avec Nolin. Nolin n'était pas présent à l'entrevue.\n\nQuestion—Le prisonnier y était ?\n\nRéponse—Oui.\n\nQuestion—Voulez-vous déclarer ce que le prisonnier (Riel) voulait avoir du gouvernement fédéral ?\n\nRéponse—J'ai eu deux entrevues avec le prisonnier à ce sujet.\n\nQuestion—Le prisonnier réclamait une certaine indemnité du gouvernement fédéral ?\n\nRéponse—Lorsque le prisonnier fit sa réclamation, j'étais là avec une autre personne et il voulait une somme de gouvernement. Nous fûmes d'accord que cette somme devait être importante et le prisonnier répondit : Attends un peu, je prendrai tout de suite $35,000 complémentaire.\n\nQuestion—Et à cette condition le prisonnier devait quitter le pays, et le gouvernement lui donnait $35,000 ?\n\nRéponse—Oui, c'est la condition que Riel mit.\n\nQuestion—Quand cela se passera-t-il ?\n\nRéponse—Le 23 décembre 1881.\n\nQuestion—Il y eut une autre entrevue entre vous et le prisonnier, n'est-ce pas ?\n\nRéponse—Nous eûmes une vingtaine d'entrevues.\n\nQuestion—N'était-il pas toujours à vous demander de vous servir de votre influence auprès du gouvernement pour lui obtenir cette indemnité ?\n\nRéponse—Il m'a parlé de cette affaire pour la première fois le 12 décembre. Il n'en avait jamais été question entre nous avant cela, et le 23 décembre il m'en parla de nouveau.\n\nQuestion—Il en a parlé souvent ?\n\nRéponse—En ces deux occasions seulement.\n\nQuestion—N'était-ce pas une grave préoccupation ?\n\nRéponse—Oui, dans ces deux entrevues.\n\nQuestion—N'est-il pas vrai que le prisonnier Riel vous a déclaré qu'il était lui-même la question métisse ?\n\nRéponse—Il ne dit pas que lui a dit en termes précis mais c'était bien la pensée qui ressortait de ses paroles. Il me disait : \"Si je ne satisfais, les Métis le seront.\" Je dois expliquer ceci. On lui objecta que si le gouvernement lui accordait les $35,000, la question métisse resterait la même. Il répondit : \"Si je suis satisfait les Métis le seront.\"\n\nQuestion—N'est-il pas vrai qu'il vous a dit qu'il accepterait même une somme moindre de $35,000 ?\n\nRéponse—Il ne dit : Faites valoir toute l'influence que vous pouvez avoir ; si vous ne pouvez pas tout cela, mais obtenez tout ce qu'il est possible d'avoir ; si vous obtenez moins, nous terroirs.\n\nSi le gouvernement eût voulu fournir cette somme, Louis Riel promettait de se réfugier partout où il le voudrait. Un jour il déclara à Charles Nolin qu'avec ses $100,000 il irait fonder un journal aux États-Unis, et que là il souleverait toutes les autres nationalités pour s'emparer du Nord-Ouest. Nouveau Coriolan, il aurait voulu une fois encore tourner ses armes contre sa patrie.\n\nEst-ce bien là un patriote, un champion, un défenseur de sa race ? Qu'est-ce qu'un patriote ? C'est un homme qui subordonne les intérêts particuliers à l'intérêt général. Sans doute qu'il est légitime de concilier les intérêts personnels avec l'intérêt général, mais il faut que ceux-ci ne soient pas incompatible. Qu'est-ce encore qu'un patriote ? C'est un homme qui se dévoue à son pays, à ses concitoyens, leur donnant le bénéfice de ses lumières, de sa sagesse. C'est un homme qui risque tout pour eux, tout, sa vie même, tout, pour l'honneur.\n\nOn compare Louis Riel aux patriotes de 1837. N'allons pas insulter à leurs mânes. Est-il un seul de ces patriotes qui ait jamais offert de se vendre aux autorités ? Est-il un seul parmi les Duquet, les de Lorimier, les Cardinal, dont les têtes ont rouli sur le châtaud, qui ait jamais dit au gouvernement : \"Donnez-moi $100,000 ou $35,000, et si je ne suis pas content, tous les Canadiens le seront.\" S'il en était un seul, son nom serait à jamais honni, à jamais exécré.\n\nRiel soulève les Sauvages\n\nOr, du jour où Riel acquit la certitude qu'il ne recevrait ni $100,000, ni $35,000, ni\n$10,000 du gouvernement, il résolut de se venger. Il résolut de plonger le pays dans toutes les horreurs de la guerre civile. Dès décembre 1884, il avait confié à Charles Nolin son projet de recourir à la violence sous le prétexte que les Anglais violaient le pays depuis assez longtemps. Oui, sous le plus spécieux prétexte, Riel fait prendre les armes à ses gens, prodiguant les promesses aux uns, les menaces aux autres ; il s'empara des magasins, saisit les commandants de la gendarmerie à cheval de livrer leurs forts, envoya des émissaires chez les Métis et les sauvages de Qu'Appelle, du Fort Battle et autres postes, pour les gagner à sa cause et annonce une guerre d'extermination contre les blancs. Que les soldats de Crozier aient fait feu les premiers à la rencontre du Lac-des-Canards, c'est possible. Mais c'est Riel qui avait déclaré la guerre en sommant Crozier d'avoir à lui rendre les forts de Carlton et de Battleford. C'est le 26 mars qu'il s'est engagé le combat du lac des Canards. Or, cinq jours auparavant, Riel envoyait à Crozier la sommation suivante, qui a été produite lors du procès de Regina :\n\nSaint-Antoine, 21 mars 1885\n\nAu major Crozier, commandant la Force de Police à Carlton et Battleford.\n\nMAJOR,\n\nLes conseillers du gouvernement provisoire de la Saskatchewan ont l'honneur de vous communiquer les conditions suivantes :\nVous devez abandonner complètement la situation dans laquelle vous avez placé le gouvernement à Carlton et Battleford, ainsi que tout ce qu'il possède le gouvernement. Si vous acceptez, vous et vos hommes seront libérés sur votre parole d'honneur de garder le lac des Canards, qui désignent le territoire du pays. Il leur sera fourni des voitures et des provisions pour se rendre à Qu'Appelle. Si vous n'acceptez pas nous avons l'intention de vous attaquer demain après le jour du marché et de commencer une guerre d'extermination contre tous ceux qui seront montres hostiles à nos droits. MM. Charles Nolin et Maxime Lepine sont les hommes avec lesquels vous aurez à traiter ...........\n\nLOUIS RIEL.\n\nNon content de cette sommation qui équivaut à une déclaration de guerre, Riel invita ses \"parents\" à attaquer et de détruire la police à cheval partout où ils la rencontreraient. Voici l'un de ces appels, lancé trois jours avant le combat du Lac-des-Canards :\n\nSaint-Antoine, 23 mars 1885.\n\nÀ nos parents—Merci des bonnes nouvelles que vous avez pris la peine de nous envoyer. Siège vous voulez nous aider que Dieu vous bénisse.\n\nLa justice ordonne de prendre les armes, et si vous voyez passer la police, attaquez-la, détruisez-la. (Ecrit en anglais en travers de la première partie) après, prévenez les Sauvages des bois de ne pas se laisser surprendre.\n\nTerribles résultats de la guerre\n\nQui peut excuser Riel après une pareille déclaration de guerre ? Ce n'est pas seulement le flambeau de la guerre civile qu'il allume. Il appelle à son secours le tomahawk et la hache de guerre de l'Indien. Il déchaîne contre nous le plus dangereux, le plus terrible des fleaux, des hordes de barbares, qui ne connaissent aucun frein, aucune loi, avides de pillages, avides de sang, avides d'assassinats. Riel pourrait-il se laver de toutes ses fautes qu'il ne pourrait effacer celle-là. Car c'est une seule et même chose, un attentat à la morale inaudible, un crime de la plus grande humanité. Dans sa première révolte, Riel s'était vanté d'avoir refusé concours des Sauvages. \"Malgré nos difficultés, disait-il, nous n'avons jamais appelé à notre aide l'élément dangereux des Sauvages. Au contraire, tandis que nous n'épargnions rien pour les tranquilliser, on nous envoyait dans notre pays des émissaires chargés de nous rendre les Indiens hostiles ; mais nous espérons que la Providence nous aidera à pacifier complètement le Nord-Ouest.\" Ces paroles lui faisaient honneur, et je suis prêt à lui donner tout le crédit qu'elles lui méritent. Que ne tenait-il encore la même attitude ? Loin de refuser le concours des sauvages, il le réclame cette fois à grands cris. Ses agents sont partout, invitant les tribus à se soulever, à capturer, à piller les forts. Et les sauvages n'ont pas besoin qu'on leur demande de massacrer à la faucée une surprise, à la faveur des ténèbres : ils ne concevaient pas le moindre autrement. Ce n'est pas la lutte d'un petit peuple contre l'oppression qui s'engage. Ce n'est pas la lutte d'un peuple qui défend ses autels et ses foyers. C'est le combat de la sauvagerie contre la civilisation.\n\nSi les troupes de Middleton étaient arrivées cinq jours plus tard, m'a dit un évêque du Nord-Ouest, tout le pays était mis à feu et à sang. Elles n'ont pu empêcher cependant le meurtre de beaucoup de blancs, de plusieurs agents du gouvernement, le pillage, l'incendiaire de beaucoup de maisons, la captivité, les traitements cruels, horreurs de plusieurs femmes. Elles n'ont pu empêcher, hélas ! l'assassinat de deux saints missionnaires, de deux membres de la congrégation des Oblats, l'un Français et l'autre Canadien-français, le Père Marchand et le Père Faïard, qui ont été assassinés au moment même où ils donnaient l'absolution à d'autres victimes de ces barbares. Le martyrologue canadien, déjà illustré par les Breboult, les Lallemand et les Garnier, s'est enrichi de deux noms vénérés, la terre rougie de leur sang, du sang de deux confesseurs de la foi, est une terre à jamais bénie, à jamais sanctifiée, mais la révolte du Nord-Ouest a été souillée, flétrie par deux crimes qui seront éternellement réprouvés.\nMaltraitons-nous les Sauvages ?\n\nOn a soulevé les sauvages contre nous quand nous ne leur voulons que du bien. Il est possible que certains agents se soient montrés durs, injustes à leur égard. Mais la politique même du gouvernement est excessivement paternelle. Nous traitons les sauvages avec beaucoup plus d'humanité et de générosité que nos voisins. Nous ne les exterminons pas. C'est notre première guerre indienne, tandis qu'elle existe en permanence aux États-Unis. Nous travaillons à résoudre le grand, le difficile problème de la civilisation des sauvages. C'est nous qui les nourrissions, qui les vêlions, qui leur donnions nos armes pour la chasse, des filets pour la pêche ; c'est nous qui fournissons des instruments aratoires et des grains de semence à ceux trop peu nombreux, qui veulent cultiver un sol généreux. Chaque année nous augmentons leurs subventions. Plus d'un million de piastres y passe. Que l'on juge de notre libéralité par quelques chiffres : En 1872, nous dépensions $35,834, en 1875, $134,339, en 1878, $377,144, tandis que cette somme s'élevait en 1882 à $1,027,216, ce qui représente à peu près le chiffre actuel. Pour les aider à sortir de la sauvagerie, à la demande des évêques, des prêtres du Nord-Ouest, leurs meilleurs amis, nous avons doté les écoles agricoles et industrielles. Dans la dernière année du gouvernement libéral, on ne comptait que trois écoles parmi les tribus du Nord-Ouest, tandis que ce nombre est aujourd'hui porté à 53, lesquelles coûtent $12,241 par an ou $240 par école. Pour les former à l'agriculture, nous avons dès 1882 établi 27 fermes agraires, qui entraînent une dépense de plus de $70,000 par an. Non contents de ces largesses, nous leur avons même conféré l'affranchissement politique, dans une certaine mesure, à la dernière session. On a donc eu tort, mille fois tort, d'exploiter leur ignorance, leurs préjugés, leur laisser dans des conditions où un gouvernement qui non-seulement veut les sauver de la destruction, mais qui voudrait les rendre à la civilisation.\n\nL'apostasie de Riel\n\nOn ne peut pas dire que les bons conseils, que les sages avisements ont marché sur Riel. Sa voix, même des deux autorités, n'ont voulu l'arrêter sur le bord de l'abîme : il les a ingénueusement repoussées. Car, pour se révolter contre l'État, il lui fallut se révolter contre l'Eglise. L'Eglise est non-seulement la plus grande école du respect, c'est aussi le meilleur soutien de toute autorité. L'Eglise condamne sévèrement la révolte et ne l'excuse que dans les cas extrêmes. Il y a trois mois à peine, Sa Sainteté Léon XIII énonçait la doctrine catholique sur ce point dans son Immortelle Encyclique Immortale Dei. Il n'est pas plus permis de mépriser le pouvoir légitime, quelle que soit la personne en qui il réside, que de résister à la volonté de Dieu : Or ceux qui lui résistent courent d'eux-mêmes à leur perte. Qui résiste au pouvoir, résiste à l'ordre établi par Dieu, et ceux qui lui résistent s'attirent à eux-mêmes la damnation (saint Paul). Ainsi donc secouer l'obésance et révolutionner la société par le moyen de la sédition, c'est un crime de lèse-majesté non seulement humaine, mais divine. Ces paroles doivent suffire à faire faire condamner la révolte du Nord-Ouest.\n\nDès le début—en septembre 1884—Mgr Grandin vit avec défiance le mouvement dont Riel était l'instigateur et qui déjà prenait une allure lombe, secrète. Dès le début, le P. André, le P. Fourmond, le P. Moulin et les autres missionnaires du district de Saint-Laurent voulaient le mettre en garde, lui et leurs ouailles, contre le danger d'une insurrection. Mais Riel pas- sa outre. Non seulement il leur désobéit, mais il créa une religion nouvelle, apostasie et fit apostasier ses adhérents, se livrant à toute espèce de méchanceté contre l'Eglise et ses ministres. L'Eglise catholique (sa propriété) la belle Rome est dans le péché, elles étaient les dénonciations favorites de Louis Riel. Pendant longtemps les prêtres craignirent de dire oui, à mort. Il ne leur était plus même permis d'exercer le saint ministère. Les religieuses ne furent pas mieux traitées. On ne peut lire sans frémir les lettres dans lesquelles ils racontent tous les outrages dont ils furent l'objet. Aussi les soldats de Middleton furent-ils accueillis comme des sauveurs. Parmi les papiers de Riel trouvés à Batoche, on a recueilli la déclaration suivante au sujet de son apostasie—déclaration qui est insérée au compte-rendu officiel de son procès :\n\nLes Métis français, membres du gouvernement provincial de la Saskatchewan, se sont séparés de l'Eglise de Rome, et la grande masse du peuple en a fait autant. Si nos prêtres consentaient à nous rider jusqu'à ce jour nos prêtres ont refusé d'abandonner Rome. Ils devaient nous gouverner dans un sens opposé à nos intérêts, et ils devraient continuer à nous gouverner selon les ordres de Léon XIII. Chers frères en Jésus-Christ, pour l'honneur de Dieu, pour la nation, afin que nous puissions contre Rome, nous forons tout en notre pouvoir pour assurer nos droits politiques.\n\nRiel et la cause métisse\n\nDans un mémoire publié récemment, l'archevêque de Saint-Boniface dit que ses sympathies seront toujours acquises à ceux qui sont dévoués à la cause métisse. Je m'explique, j'admire ce sentiment de la part d'un prêtre qui a consacré toute sa vie, vie de sacrifices, vie d'abnégation, à l'apostolat le plus chrétien, le plus héroïque, le plus sublime, que l'on puisse concevoir. Mais je fais une grande distinction.\nentre Riel et la cause métisse. Si je condamne la révolte des Métis, comme un crime contre les lois de l'Église et de l'État, j'ai toujours sympathisé avec eux dans leurs luttes pour le droit. Tout en désirant le triomphe de nos volontaires, j'ai admiré leur vaillance sur les champs de bataille. Oui, tous se sont battus comme des braves, et le plus brave d'entre eux, Gabriel Dumont, vivra dans l'histoire. Aussi je ne puis pas m'empêcher de féliciter le gouvernement d'avoir été à la hauteur de la situation en grattant plusieurs des prisonniers, et d'exprimer l'espoir, avec vous tous, qu'ayant longtemps ceux qui sont encore sous les verrous pourront respirer de nouveau le grand air de la prairie, le grand air de la liberté. Le plus tôt on aura effacé toutes les traces de cette guerre fratricide, le plus tôt on aura cicatrisé toutes les plaies, éteint toutes les haines, tous les ressentiments, le mieux ce sera dans l'intérêt du pays tout entier.\n\nRiel a trompé les Métis\n\nSans doute que Riel fut choisi par les Métis comme leur chef. Mais le chef a trompé les soldats. Ceux-ci voulaient une agitation pacifique, légale, constitutionnelle. Ils ne songeaient aucunement à prendre les armes. Ils furent les dupes. Tenons leur compte de leurs intentions. Quand les délégués des Métis allaient chercher Riel au Montana pour lui demander de prendre le commandement, ils recevaient un rapport qui terminait par la déclaration suivante : \"Les discours de M. Riel nous inspirent la plus grande confiance, car ses instructions sont de nous aider mais en nous aidant il ne veut en aucune manière faire d'embarras inutiles au gouvernement.\" Ce rapport était signé par Gabriel Dumont, James Isbister, Moise Ouellette, Michel Dumas. Il fut soumis le 8 juillet 1884 au comité \"charge des sept résolutions adoptées par la population de la Saskatchewan\" avant cette même réunion, Riel fit un discours dans lequel il déclara que \"pour obtenir quelque chose d'un gouvernement on ne doit pas s'adresser à lui en lui faisant des gros yeux, mais en lui parlant avec respect et confiance, comme un bon enfant qui s'adresse à un bon père.\" Le 19 juillet, à une assemblée tenue à Prince-Albert, Riel disait encore qu'il \"a été appelé dans ce pays par ses anciens compatriotes, mais qu'étant bien accueilli partout le monde, il veut travailler avec tous, dans l'union et la paix, pour obtenir du gouvernement ce que chacun croit être juste. Que pour rentrer il faut absolument se servir de moyens constitutionnels et pacifiques.\" Le 19 juillet, un correspondant de Saint-Laurent écrivait au Manitoba : \"M. Riel est, paraît-il, un épouvantail pour quelques-uns, mais ils peuvent se tranquilliser ; il est venu, comme il l'a dit lui-même, partout, non pour troubler le pays, mais pour remettre les esprits dans une entière placidité. Ce qu'il veut c'est d'aider les citoyens par des moyens légaux.\" Le 5 septembre, à une Assemblée publique tenue à Saint-Laurent, en présence de Mgr Grandin, M. Charles Nolin s'écriait : \"Pas de rébellion ; ce mode n'a jamais été sérieusement dans la pensée de personne parce que ce serait un crime ; nous nous en tiendrons aux moyens légitimes.\"\n\nNéanmoins, après des délibérations publiques, Riel écrit une lettre à Sa Grandeur Mgr Taché, dans laquelle il lui disait de ne pas s'inquiéter que ses démarches étaient toutes pacifiques. Voici ses propres paroles, à la date du 25 juillet 1884 : \"Monseigneur, mes démarches ne sont pas des démarches de troubles. Je me propose d'agir dans le Nord-Ouest de la manière la plus propre à me gagner l'approbation des gens honnêtes et paisibles des deux lignes.\"\n\nLe succès d'une agitation légale\n\nEt cette agitation légale a été couronnée de succès, puisque le gouvernement annonça formellement qu'il allait nommer une commission pour régler toutes les réclamations des Métis ; promesse qui a été remplie à la lettre. Quel malheur que Riel ne s'en soit pas tenu à cette agitation constitutionnelle ! Que de sang, de larmes, que de millions, que d'horreurs, que de ruines eussent été épargnés ! L'injustice ne peut être longtemps tolérée parmi nous. Un peuple qui comme le nôtre, respire la liberté en naissant, ne saurait souffrir la tyrannie. Le désolisme, l'arbitraire sont incompatibles avec nos institutions...\n\nSi le gouvernement eût fait la sourde oreille, et que Riel eût adressé au Parlement du Canada une requête exposant tous les griefs de \"son peuple,\" croyez-vous que cet appel n'aurait pas eu d'écho dans l'enceinte parlementaire ? Riel, lui, ne pouvait plaider ignorance. Il connaissait tous les rouages de notre système, toutes les ressources qu'il offrait aux minorités opprimées. Cependant, jamais il n'a demandé l'appui des autres de la nation. Il ne pouvait bien compter sur les sympathies du parti conservateur francophone, sur lesquelles il a eu recours tant de fois. Il pouvait compter surtout, sur les sympathies des vingt-trois députés conservateurs—et plusieurs d'entre eux sont encore dans la politique—qui, à la session de 1875, votèrent seuls pour l'amnistie entière des insurgés de la Rivière-Rouge. Il pouvait compter sinon sur les sympathies des libéraux, du moins sur leur concours, ne fût-ce que pour avoir l'occasion de critiquer le gouvernement. Il pouvait même, si nécessaire, compter sur le soutien de l'honorable M. Blake, qui mit sa tête à prix voilà quinze ans passés, de l'honorable M. Mackenzie qui traita les chefs de la révolte de chefs de bandits. Oui, si Riel eût persisté dans son agitation constitutionnelle, il eût été un patriote, le champion...\nDes agitateurs modèles\n\nVoyez O'Connell. Pendant des siècles son peuple a gémé sous l'oppression, sous une verge de fer. A-t-il jamais songé à lui faire prendre les armes ? Non... Et cependant il lui aurait suffi d'un geste pour briller cent mille fusils dans les plaines de Clery ou de Tipperary. Mais O'Connell n'aurait pu se consoler d'avoir fait violence à la patience de sa race par l'ordre était : Agitez ! Agitez ! Sa gloire est d'avoir abattu les murailles de la tyrannie sans panache, d'avoir arraché la liberté, la beauté par lambeau, d'avoir obtenu l'emancipation des catholiques, sans jamais avoir fait entendre autre chose que sa voix puissante. Mais cette voix était plus retentissante que le canon Krupp ou la carabine Winchester. Elle résonnait comme un clairon dans toute l'Irlande, remuant toutes les âmes, faisant tressaillir tous les coeurs. Aussi le patriote irlandais paraît-il aux yeux de l'histoire comme l'un des plus grands bienfaiteurs de l'humanité. Aussi n'est-il pas de tâche sur cet astre d'une incomparable grandeur. O'Connell mourut en léguant ses os à sa patrie et son cœur à Rome ; ces deux patries qui sont l'antichambre de la patrie céleste. C'est une fin digne de sa grande vie. Sur un théâtre plus rétrécit, au milieu des plaines de la Saskatchewan, Louis Riel aurait pu devenir quelque sorte l'O'Connell du Nord-Ouest. Il a préféré le sort d'Erosaute maintenant le feu à un temple célèbre par le génie de son nom, à la patrie. Et de nos jours que voit-on ? L'île d'Irlande est pour ainsi dire aux pieds de Parnell. La Grande-Bretagne a bien un vice-roi à Dublin, mais le royaume d'Irlande est Parnell. Si quelques-uns de ses compatriotes ont employé le poignard ou la dynamite pour détruire ceux qu'ils considèrent comme leurs oppresseurs, lui a toujours réprouvé ces moyens odieux, il n'a voulu que de l'agitation légale et constitutionnelle. Et le jour n'est pas éloigné où, grâce à cette agitation incessante, lui et son peuple pourront s'écrier : L'Irlande est libre !\n\nLa fin de Riel\n\nLa fin tragique de Riel je la regrette, je la déplore. Oui, je regrette qu'il ait fallu donner cette grande leçon d'autorité. Je regrette qu'il ait fallu punir la révolte dans la personne de son chef. C'est le premier échafaud politique que l'on a vu se dresser depuis les jours sombres de 1839 ; espérons que ce sera le dernier. La mort de Riel, je l'appris en mer. C'était un soir, le dernier soir que nous passions au bord du stérile lac qui me rendait au pays. Le ciel était sillonné de météores lumineuses qui plongeaient dans la plaine humide pour ne plus reparaître. Nous n'étions qu'à cent cinquante milles de terre. Le pilote qui était venu au-devant de nous, nous apporta les derniers journaux de New-York : ils contenaient les renseignements les plus complets sur la fin de Riel et sur l'agitation qui s'en est suivie, agitation immense comme les flots qui nous ballottaients. J'étais tout entier à la joie du retour ; mais à cette nouvelle je ne sentis le cœur saigner, je ne sentis le corps plein de deuil, j'avais connu Louis Riel à la sortie du collège. Nous avions tous deux la tête pleine d'idées héroïques bien effectuées depuis. J'avais eu quelques sympathies assez... Après avoir écrit plus tard l'histoire de son père qui fut le libérateur commercial de la Rivière Rouge, il est naturel que je ne fusse pas indifférent au sort du fils, j'avais aussi connu sa mère, sa bonne mère—et quelle est la mère qui ne l'est pas ?—et je ne fûrai pas inconsolable douleur, toute l'importance de larmes qui ne se lassent pas de couler. Les anciens appelaient avec raison la guerre l'ennemie des mères—bella matribus detestata. Et, puis, si coupable que soit un fils, quelle est la mère qui ne lui pardonne pas, qui ne lui trouve pas des excuses ? La mère est non-seulement un trésor de bonté, c'est encore un trésor de miséricorde—Vous tous qui, plus heureux que moi, possédez cet ange tutélaire, l'ange du foyer, vous me comprendrez. En cette heure attristée, je songeai aussitôt à ces paroles de Napoléon—qui, lui, a fait pleurer tant de mères—paroles qui avaient une si douloureuse actualité : \"Le sang s'appelle le sang, c'est la réaction naturelle, elle est inévitable, infatible ; malheur à qui la provoque.\" Quand on s'obstine à être des troubles civils et des commotions politiques, on s'expose à un tomber victime. Mais, tout en sympathisant avec la famille de Riel, je me surpris aussi à pleurer avec les parents, avec les amis des autres victimes—et il en est plus de deux cents—de cette guerre fratricide. En cette ville même, nous avons vu passer le cortège funèbre qui accompagnait à leur dernière demeure deux braves, morts au champ d'honneur, morts pour la patrie. Nous avons payé la dette terrible du sang. Combien sont coupables ceux qui attirent sur leur pays de pareils fléaux !\n\nCeux qui ont demandé la tête de Riel\n\nPour soulever le sentiment catholique contre le gouvernement, on a dit que la mort de Riel avait été arrachée, décrétée, par les orangistes. Où est la preuve ? On se serait des orangistes comme d'un épouvantail. Ce qui est vrai, c'est que la presse anglaise a des raisons exceptions, près, demandant que la sentence fut exécutée. Le Globe, le Free Press d'Ottawa et le Free Press de Winnipeg, trois des principaux organes du parti libéral, ont réclamé à grands cris la tête de Riel. Depuis mars jusqu'à octobre 1885, le Globe n'a cessé d'écrire que Riel...\nméritait richement la mort. Avant sa capture, il demandait que le gouvernement mit sa tête à prix. Une fois pris, il déclara que le peuple tiendrait le gouvernement responsable de tout déni de justice, que l'on ne pouvait sauver Riel parce qu'il faudrait agrandir considérablement nos asiles d'aliénés. Vous jugerez de son langage par l'extrait suivant d'un article en date du 14 août :\n\nLe crime dont Riel s'est rendu coupable est un de ceux pour lesquels on ne peut demander merci, un des plus condamnables que l'on ait jamais pu imaginer. Il a causé la mort de deux cents Canadiens, et il en a fait blesser ou rendu invalides deux fois autant. Ses actes ont été pour ainsi dire sans recul au point de surcroît écraser les blancs établis au Nord-Ouest au profit de probablement subir les outrages les plus épouvantables. La circonstance la plus aggravante du crime de Riel, c'est qu'il aurait agi exactement les mêmes si les événements n'étaient pas intervenus. Tous ceux qui ont lu les dépositions des témoins ne peuvent nier que Riel mérite richement la mort.\n\nLe Free Press de Winnipeg, écrivait plus tard que le gouvernement ne pouvait pas faire autrement que de pendre Riel, et que son exécution jointe à celle des chefs sauvages aurait un effet salutaire. Le Free Press d'Ottawa, paraît avoir changé d'avis de puis, suivant les intérêts de son parti, mais voici le langage qu'il tenait avant l'exécution de Riel : \"Louis Riel connaissait \"sait bien la nature du sauvage et savait \"que son mode de guerre répugnerait à nos \"idées de civilisation. Quand Riel cons- \"pira avec les sauvages, il ouvrit les por- \"tes de la rapine et du meurtre, et pour \"cette offense il méritait le plus sévère \"châtiment.\" Le Port Hope Guide se \"criait : \"Si le chef rebelle n'était pas pendu, \"c'est parce que sir John Macdonald n'o- \"serait pas le mettre à travers les Front- \"ières de Québec.\" Et je pourrais citer des \"dizaines d'autres journaux du parti libé- \"ral. Tous ont voulu du sang de Riel tant qu'ils ont cru que le gouvernement ne lais- serait pas la justice suivre son cours. Aussi si le chef métis n'avait pas été exé- cuté, ces mêmes journaux dénonceraient aujourd'hui le gouvernement comme ayant cédé de nouveau à l'influence des bleus- ces terribles bleus de la province de Qué- bec—qui ont fait souche un peu partout, depuis l'Acadie jusqu'à Vancouver.\n\nBlake, Cartwright et la mort de Riel\n\nLe chef du parti libéral, l'honorable M. Blake, a dit qu'il ne voulait pas engager une lutte de parti sur la tragédie de Ré- gina, qu'il ne voulait pas lutter une plate-forme politique sur ce chahut ni la criée ni le cimetière avec des lieux de sang. Je le félicite d'être revenu à de meil- leurs sentiments, à des sentiments plus di- gnes d'un homme d'État. Car ses paroles sont la condamnation de sa conduite d'il y a quinze ans. Si M. Blake veut l'oublier, le public, lui, n'a pas oublié qu'il réussit à renverser le gouvernement Sandfield Mac- donald en se glissant au pouvoir au moyen d'un cadavre, le cadavre de Thomas Scott. Il ne recula même pas devant la trahison d'undes membres du gouvernement Mac- donald. Et ce traître fut plus tard nommé juge en chef de Manitoba : c'était le prix de la trahison. Et ce juge fut celui qui détermina le jury à prononcer un arrêt de mort contre Lepine, malgré toute l'élo- quence de Chapleau.\n\nLes paroles de M. Blake sont aussi la condamnation de ses alliés de la province de Québec—attendez M. Blake, nous di- ssait-on, et vous verrez combien il s'im- pétueurit vers nous. Eh bien, M. Bla- ke a parlé. Qu'a-t-il dit ? A-t-il blâ- mé le gouvernement d'avoir exécuté Riel ? Non.—A-t-il blâmé la manière dont le procès de Riel a été conduit ? Non.—A-t-il qualifié de meurtre judiciaire ? Non.—Il a déclaré qu'il n'entretiendrait aucun doute sur la justice du procès. Il a même félicité le gouvernement d'avoir payé les frais des témoins de la défense : ce qui avait été refusé dans le procès Lepine. Bien plus, il a blâmé plusieurs de ses amis de la province de Québec d'avoir prononcé certaines paroles et fait certains actes qui ne sauraient avoir son approbation. Son discours a pleinement convaincu les chefs libéraux de Québec que M. Lau- rier n'avait pas osé, prendre la pa- role. Cependant M. Laurier avait dit que s'il avait été à Batoche il n'aurait pas craint de dérocher la carabine de ses peres pour combattre pour la liberté. Eh bien, M. Laurier, quoique dûment invité de figurer en public à Montréal et à Toron- to, n'a pas encore osé dérocher sa redouta- ble carabine. Un autre chef libéral, sir Ri- chard Cartwright, a lui aussi parlé. Et qu'a-t-il dit ? Qu'il ne voulait pas blâmer le gouvernement d'avoir exécuté Riel—\"Une rébellion\", a-t-il ajouté, \"peut être exécu- see, et cependant les meurtriers qui entraî- nent des hommes ignorants et malheu- reux dans la rébellion être punis.\"\n\nSans doute que ces messieurs condam- naient la conduite des affaires du Nord-Ouest ; mais ils ne semblaient pas l'oppo- sition s'ils ne le faisaient pas. Vous savez la définition de l'opposition par M. Mackenzie : elle doit combattre tout ce que propose ou fait le gouvernement. C'est rétrécir, ra- baisser son rôle, mais c'est ainsi que les libéraux entendent l'opposition, pour laquelle ils sont tellement nés qu'elle menace de devenir pour eux le rocher de Sisyphe.\n\nLes accusations de trahison\n\nJe ne suis pas de ceux qui s'affraient des accusations de trahie, de rénégat, de pen- dard portées contre nos ministres. Qu'ils s'en consolent, l'injustice, l'ingratitude po- pulaire est de tous les temps, de tous les lieux. La tête de Cléorou fut promenée au bout d'une pique. Le vainqueur de Wa- terloo fut pendant longtemps l'idole de l'Angleterre, ce qui n'empêcha pas la po-\nLa gloire est plus solide après la calomnie\nEt brille d'autant mieux qu'elle s'en vit ternie.\n\nLa démission de nos ministres eût été une faute, une grande faute. L'homme politique qui céde à toutes les chaleurs populaires n'est pas un homme d'État. S'il en était autrement, aurait-il vraiment été le capitaine qui abandonne le commandement, qui déserte son bâtiment à la première tempête, à la première fureur de l'Océan, est un bon, un brave marin. — Il faut bien que je le suive puisque je suis leur chef, disait Ledru Rollin. Avec cette doctrine, une nation flotte à tous les caprices, à tous les virements de l'opinion publique. La stabilité gouvernementale n'est plus qu'un vain mot. La révolution s'établit en permanence. Sir Robert Peel a pu s'écrier avec beaucoup de vérité : \" Je proteste contre la doctrine que nous devons céder parce que c'est la volonté populaire. Si nous sommes convaincus que ce n'est pas l'intérêt populaire qui doit être pris en compte, mais l'intérêt du peuple, nous devons avoir le courage de résister.\" C'est des temps où il faut que les ministres aient le courage de se mettre en travers du flot populaire et de lui dire : \"Tu n'iras pas plus loin.\" Et ceux qui tiennent ce langage sont les vrais patriotes. Ce ne sont ni des flattereurs, ni des courtisans : cette plaie des rois, cette plaie des peuples. Ces hommes-là sont de véritables chefs, des conseillers éclairés, des guides sûrs.\n\nSi demain fut pour nos ministres masser tout l'élément français contre l'élément anglais. — Se démettre, c'était précipiter le pays dans une lutte électorale, qui aurait été inévitablement une lutte de races. Se démettre, c'était peut-être éviter la guerre civile, c'était peut-être reconnaître la barrière des Plains d'Abraham. Dès trop de paroles, trop de provocations offensantes ont été lancées. Le feu des haines nationales est facile à allumer ; mais souvent il faut des siècles pour l'étendre. C'est ce que nos ministres ont compris en bravant une tourmente qui aurait pu emporter l'édifice de la Confédération tout entier. Et loin de les clouer au pilori, l'histoire les remerciera d'avoir placé leur devoir, le salut public, au-dessus des vaines satisfactions d'une popularité éphémère.\n\nLe parti national\n\nDans ces derniers mois, on a beaucoup parlé d'unir les Canadiens-français sous un même drapeau, sous un drapeau que l'on aurait appelé le drapeau national. Et quelles sont les hommes qui veulent ensevelir ainsi les haines du passé, qui sont devenus tout à coup si chauds partisans de l'union ? Ce sont les hommes mêmes qui ont brisé cette union grand elle existait.\n\nIl fut un temps, et ce temps n'est pas encore très éloigné, où les Canadiens-français ne formaient qu'une même phalange, qu'un même parti. C'était au lendemain des jours orageux de 1837, peu après l'établissement de l'acte d'Union. Cette union avait été créée pour nous noyer, pour nous perdre, et il s'agissait d'en faire l'instrument du salut. Pour arriver à ce but, il nous fallait une union compacte, il nous fallait aussi des chefs habiles, intègres, inspirant la confiance générale. L'union ne fit d'elle-même tant le danger était grand et nous trouvions-nous en Lafontaine et Morin, son lieutenant, des chefs que nous pourrions toujours citer comme des modèles. Grâce à cette union, le gouvernement responsable nous fut ainsi conféré ; grâce à cette union, la langue française fut de nouveau officiellement reconnue ; grâce à cette union, les portes de la patrie purent s'ouvrir à nos exilés politiques, Papineau en tête ; grâce à cette union le Bas-Canada fut mis sur le même pied que le Haut-Canada, et il devint l'allié, non plus le vassal de l'autre.\n\nEh bien, qui a brisé l'union des Canadiens-français ? Est-ce Lafontaine qui lui avait dit : \"Je ne servirai jamais d'instrument pour diviser mes compatriotes.\" Ne détruisons pas le seul lien qui fait notre force, l'union \"entre nous\" ? Non. L'histoire nous dit que c'est le chef, le fondateur du parti rouge. A peine rentré en chambre, Papineau, jaloux probablement de ne plus jouer le premier rôle—les révolutionnaires sont rarement des hommes de gouvernement—battait en breche le ministère Baldwin-Lafontaine. Sur plus d'une mesure importante il fut même le seul Canadien-français qui passa à l'opposition ! Papineau n'avait pas foi dans le gouvernement responsable ; ce qu'il désirait, c'était un régime démocratique, une annexion aux États-Unis. En cette rupture, le parti libéral commença par Papineau, le continua par les Dorion, les Doutre, les Desaulniers, les Papin, les Laberge, par toute cette pléiade d'hommes de talent mais dévoyés, que l'on a appelée la pléiade rouge. Et quel était le programme qu'ils proposaient ? Suffrage universel, abolition des dîmes, écoles communes, élection des juges et des employés publics, et, pour couronnement bien entendu, l'annexion aux États-Unis. Le peuple a depuis longtemps fait justice de ces rêveurs et de leurs rêveries. Oui, tels sont les hommes qui sont responsables de la division des Canadiens-français.\n\nPlus tard, au George Cartier offrit un pont-pont à M. Dorion pour rétablir l'union parmi ses compatriotes. Cartier s'inspirait de l'exemple de Lafontaine ; mais il ne fut pas compris. M. Dorion refusa la branche d'olivier. De toutes les luttes acharnées dont nous avons été témoins...\nmoins. Ces luttes n'ont pas empêché cependant la masse de la population de se rallier autour du parti conservateur qui est devenu le grand parti national.\n\nPlus tard encore, les libéraux voulurent jouer la comédie dont nous sommes aujourd'hui témoins — et ils fondèrent un parti du parti national. Grâce à cette comédie, qui fut manifestement perçue par les électeurs par trop de gens, ils réussirent à battre Cartier et à commettre un acte d'ingratitude populaire que la ville de Montréal regrette encore. Au lendemain de sa défaite, le National s'écriait : \"Pitié même pour ce tentateur, ce corrupteur, ce Méphistophélès légendaire qui vivra comme le père le plus malfaisant de notre histoire.\" Quelques mois après, Cartier allait mourir à Londres, abrégée de chagrin. Aujourd'hui ils le pleurent avec des larmes de crocodile. Ah ! si Cartier vivait les choses iraient bien autrement, disent ceux-là qui ont aidé à creuser sa tombe. On voit le malheur arriver sur ses successeurs... quand ils ne seront plus. Mais le tour était joué. Grâce à cette comédie, on a réussi à faire arriver le parti rouge au pouvoir sous de faux prétextes. Arrivé les nationards ! C'est à peine si quelques-uns ont pu troquer leurs convictions protectionnistes pour des places, parmi lesquelles on a rassasié quelques tricorons. Et le parti rouge au pouvoir nous a valu cinq années de détresse, cinq années de ruines, cinq années de mauvaise administration. On eût cru qu'il voulait réaliser le fameux songe de Joseph concernant les sept vaches maigres qui deviendraient les sept vaches grasses. (On rit.) Ces cinq années de deuil nous ont aussi valu des années d'humiliation française : en ces temps-là, on ne parlait pas de domination française !\n\nL'œuvre du parti conservateur\n\nOn a fait et on fait encore un grand effort pour briser nos liens de parti, briser notre allegiance au parti conservateur. Mais les membres du Cercle Lofontaine ont été parmi les premiers à repousser cette offre séduisante. Fiers du passé de votre parti, de ce parti qui a fait la Confédération, qui a réglé la tenure seigneuriale, qui a codifié nos lois civiles, qui a bâti le Grand Tronc, le pont Victoria et l'Intercolonial, qui vient d'achever l'œuvre incomparable, l'œuvre monumentale de Païsique, qui nous a doté de la protection, qui a été pour nous l'ancre du salut, vous avez voulu vous recueillir avant de prêter l'oreille aux sirènes libérales. Et après vous être recueillis, après avoir mesuré la situation, vous êtes venus à la conclusion que, si elle n'était pas parfaitement le parti conservateur, que si ce parti n'est après tout qu'une institution humaine, vous trouvez là des garanties d'intelligence de patriotisme, de largeur d'idées de bon gouvernement, que nos adversaires ne sauraient vous offrir.\n\nLes injures des grits\n\nTiméo Danaos et dona Ierentes. Oui, nous avons raison de craindre les grits quand ils nous tendent une main chargée de présents. Pendant trente longues années cette main a souffleté notre nationalité sur toutes les faces. Pendant plus de trente ans, les grits ont exploité contre nous les plus mauvais préjugés, les plus dangereuses passions. Pendant plus de trente années, ils ont voulu soulever Ontario contre Québec, représentant notre vieux chef comme étant vendu aux intérêts français. Pendant plus de trente années, ils nous ont ridiculisés, vilipendés, conçus comme étant la queue française du parti \"the French tail\" of Sir John Macdonald. Encore ces jours derniers, le Times d'Hamilton, parlant de notre Cercle, nous insultait basiquement en disant que les trois quarts des conservateurs français d'Ottawa sont des émeuteurs de places. Avant lui, d'autres feuilles grises nous avaient traités d'ignorants, d'encroulés, de lécheurs de crachats, et autres gentillesses de cette espèce. Nous pouvons regretter, condamner quelques articles publiés dans des journaux conservateurs anglais — articles qui n'ont malheureusement pas été sans provocations ; mais cela ne serait suffire pour nous faire oublier en un jour tous les outrages, toutes les avanies, toutes les calomnies, dont nous avons été l'objet. Et nous ne les oublierons pas. Si jamais nous devons changer nos alliances politiques, que ce soit sur une autre base et dans d'autres conditions.\n\nDangers d'un parti \"national\"\n\nMais plaçons la question à un point de vue plus élevé. Le parti national serait pour nous l'isolement. Or, l'isolement pourrait nous être funeste. Nous sommes une minorité. Et cette minorité ne peut se considérer sans que la majorité nous concentre également ses forces. C'est une réaction inévitable. Tout notre intérêt repose dans le jeu des partis. C'est ce qu'ont compris les hommes qui, par leur position sont en état de mieux juger des intérêts de notre race, je veux parler des chefs des minorités françaises dans les différentes provinces. Parlant au nom des Acadiens, l'honorable M. Landry a refusé de prendre part au mouvement dit national. Parlant au nom des Canadiens-français d'Ontario, notre vaillant député de Russell, M. Honoré Robillard — celui-là même qui a fait son premier discours en français dans la chambre de Toronto — a dénoncé ce mouvement comme dangereux et propre seulement à livrer nos forces à l'ennemi. Son collègue, le député d'Essex, M. Stevenson White, qui n'est anglais que de nom, a tenu le même langage. Le chef des Canadiens-français du Nord-Ouest, l'honorable M. Royal, dont l'expérience, le sens politique, l'esprit éclairé, m'inspirent la\nplus haute confiance, n'a pas encore parlé, mais j'espère qu'il partagera les mêmes vues. Ces voix patriotiques, ces voix autorisées, me rassurent, me démontrent que nous sommes dans la bonne, dans la droite voie.\n\nRestons fidèles au parti\n\nOui, nous resterons fidèles à notre parti. Nous resterons fidèles aux idées de progrès, de justice et de grandeur qui le représentent. S'il est des abus, des injustices, nous essayerons de les corriger ou de les réprimer. Dans le temps, le grand arbre conservateur couvre le pays de sa bienfaisante influence, et quelques-uns de ses rameaux peuvent être vicieux, vermillon. Nous ébourgeonnons, nous émoussons ces branches, mais nous ne détruirons pas le vieux tronc qui a produit des fruits si abondants et si généreux. Ainsi taillé, ainsi rajeuni, le grand arbre conservateur qui puise sa force dans la sève de la vraie liberté, qui étend ses racines jusqu'aux deux océans, saura retrouver une nouvelle vitalité, une nouvelle puissance.\n\nDes luttes ardentes nous attendent, elles seront peut-être prochaines. Ces luttes ne nous effraient pas. Nous sommes habitués à combattre, à porter le poids de la journée. Mais pour combattre avec succès, faisons en sorte que personne ne manque à l'appel au grand jour de la bataille. Sous notre système politique, le soldat est l'électeur. Que tous soient inscrits à l'ordre du jour — et cet ordre du jour est la liste électorale.\n\nNous sommes encore à la période des harangues. Mais quand il nous faudra passer des paroles à l'action, quand il faudra nous mesurer de nouveau avec l'ennemi, quand nous vieux chef dira comme autrefois Napoléon à ses soldats : Deployez les drapeaux, le moment est arrivé que nous montions tous ensemble, armés de pied en cap comme autrefois la redoutable Minerve. Et si je n'ai pas l'honneur d'être votre chef, si je n'ai pas l'honneur de vous conduire au feu, je ne serais pas le dernier à vous admirer, à vous acclamer, tout comme aux grands jours de 1878 et de 1882, alors que de toutes les poitrines conservatrices — et dans ces poitrines battait le cœur de la nation — s'échappait un immense cri de joie — répété par tous les échos du Dominion — et ce cri que j'espère vous entendre pousser encore, était VICTOIRE !\n\nBIBLIOTHEQUE SAINT-SULPICE", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001548.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 22926, "total-output-tokens": 19354, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 144, 2], [144, 144, 3], [144, 3644, 4], [3644, 8591, 5], [8591, 14596, 6], [14596, 20450, 7], [20450, 25625, 8], [25625, 31125, 9], [31125, 36621, 10], [36621, 42176, 11], [42176, 47609, 12], [47609, 53337, 13], [53337, 58658, 14], [58658, 64134, 15], [64134, 66395, 16]], "primary_language": ["None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]