[{"id": "4a7c87cc4780bc2f2b11811b3db24aabb4531a71", "text": "HOLIDAY RAMBLES\n\nBETWEEN\n\nWinnipeg and Victoria.\n\nBY\n\nGEORGE BRYCE, LL.D.\n\nWINNIPEG\n\nI—Prairie and Mountain.\n\nII—To! The Poor Indian.\n\nWINNIPEG.\n\n1888.\nHOLIDAY RAMBLES\n\n— BETWEEN —\n\nWinnipeg and Victoria.\n\n— BY —\n\nGEORGE BRYCE, LL.D.,\n\nWINNIPEG.\n\nI.—Prairie and Mountain.\n\nII.—Lo! The Poor Indian.\n\nWINNIPEG:\n\n1888.\nContents.\n\nI. PRAIRIE AND MOUNTAIN\n\nI. A PROSE IDYL OF THE HARVEST TIME IN MANITOBA. ........................................... 3\nII. A DASH THROUGH THE PRAIRIES ON THE CANADIAN PACIFIC RAILWAY ......................... 8\nIII. THE ROCKIES—THE \"MOUNTAINS OF SHINING STONES.\" ....................................... 16\nIV. ATTRACTIONS OF ROCKY MOUNTAINS PARK. ...................................................... 23\nV. CLIMBING THE GLACIER AND SEEING THE BEAUTIES OF THE SELKIRKS. ......................... 32\nVI. FROM THE COLUMBIA AND DOWN THE FRASER TO THE SEA. .................................... 39\n\nII. LO! THE POOR INDIAN!\n\nI. VISIT TO THE FAMOUS CHIEF PIAPOT, AND VIEW OF OUR INDIAN POLICY ......................... 47\nII. THE RESERVES ON THE CROOKED LAKES OF THE BEAUTIFUL QU'APPELLE. ..................... 54\nIII. THE ASSINIBOINES ON THE HURRICANE HILLS .................................................. 62\nIV. THE CIVILIZED OJIBWAYS OF OKANASE .......................................................... 69\nV. OUR REFUGEE SIOUX TAKING KINDLY TO THE SOIL .............................................. 77\nVI. THRILLING INTERVIEW WITH THE FILE HILLS INDIANS. ....................................... 83\nWestward Ho.\n\nBOUNTIFUL HARVESTS—PROSPERITY FOR THE PEOPLE—A PROSE IDYL OF THE HARVEST TIME.\n\nThis is the time to journey through our prairies. The weather is cool, the air is clear and the season is restful. Manitoba is bursting with plenty. The hopes of the people have been realized, and now they are gladly bringing in their tributes to Ceres. Visitors from abroad are filled with wonder as from railway trains they look upon the continuous miles of the harvested Elysian fields. Old Manitobans declare the former days have returned, and the late comers admit they have never, in any land, seen such abundance. Letters from the east but serve to increase the wonder of the prairie dwellers, for they tell that few other parts of the continent have had such plenty. The westbound traveller on the Canadian Pacific Railway is first surprised at the magnitude of the\n\nPORTAGE LA PRAIRIE HARVEST.\n\nYear after year the Portage plains have been yielding their abundance. The early Canadian farmers, nearly twenty years ago, were attracted here. Many of them were good farmers from Ontario, and knew how to give our land an opportunity, for while our Province rejoices in affording a home for the poor man, yet the broken down tradesmen and unsuccessful merchants who have taken to farming on the prairies have, at any rate in the early years of their apprenticeship, made poor work of it and not done our soil or climate justice. Successful work for years has made the Portage la Prairie farmers well-to-do, and brought the land into a good state of cultivation. Though the prairie farmer is free from the toil of the Ontario pioneer, of having to level the forest, yet he must pay tribute to the genius of toil by working off the wildness and rawness of the prairie soil before he can lay it under full contribution. No doubt the well tilled acres of the Portage plains are favored by the salubrious climate, caused by the nearness\nof Lake Manitoba, which moderates the temperature along their northern side. As mile after mile of wheat in stook, or much of it in stack, is passed, one is thrown into the humor of poetry and feels like making a Manitoban \"Georgie.\" These are fields in reality. The stooks are so white and unstained by rain, and as far as the eye can see lines of them extend until they converge into one. Not only the size of the fields, but the crowded stooks suggest to the Ontario visitor a plenty that quite overwhelms him. What a grand harvest home the Portage farmer will have under the September moon as he looks at his shorn fields of stubble and his numberless stacks of gathered grain. But hastening west, we have business in the country and are glad of it, for from the railway line but a poor view of the prairie is got after all. We go to see the\n\nBRANDON WHEATFIELDS.\n\nWe return from Rapid City to Brandon—twenty-five miles by stage—and the journey is a constant delight. At one point we draw up for a moment to look at a field of wheat in stook, one hundred and fifty acres in size. That field will yield five thousand bushels of grain. The writer has never heard the farmers complain before of having crops too heavy, but this year this is the cry. The only safety of the country is the self-binder. Any one who has seen the army of peasants needed to attack a grain field in England or Scotland, or even the number of men required for an old fashioned reaper in Ontario, looks with surprise at the farmer, with his self-binder, drawn by three horses and followed by a single man, begin to harvest with perfect equanimity a field of sixty or eighty acres. The harvest time, however, will allow no sluggards. One farmer, a little late with his cutting, explained that a wheel of his reaper had broken, and finding by telegraphing to Winnipeg that the wheel could not be replaced, he was compelled to purchase at once a new reaper, costing upwards of $200, for harvest, like time, waits for no man. Among such scenes one's mind rises in indignation against a policy which puts artificial obstacles in the way of the farmer, either obtaining cheap implements for his work or getting his products to the markets of the world at reasonable rates. We were much interested in our first morning ride by the comments on the prairie scene of\n\nOUR STAGE PARTY.\n\nIt was made up of five persons beside the writer. It was a\ngroup illustrative of the country. The driver on a western stage in the hands of Mark Twain or Bret Harte, is a character of as much interest as Sir Walter Scott's dwarf or village natural, but our driver was simply a brawny, sonsie-faced young Scotchman, only three or four months out from the land of cakes. He and his companion being mechanics had found trade dull in their native Glasgow, had heard of far off Manitoba, and had come to it. His companion had made a year's engagement with a farmer near Rapid City, and though at small wages he would gain experience in farming, be comfortable for the winter and have a little \"siller\" in the spring. Our driver was a good, faithful fellow, and we saw a considerable sum of money handed to him in Rapid City to be delivered in Brandon. On our journey the conversation turned on Thomas Carlyle. The young stage driver quoted quite correctly a sentence from \"Sartor Resartus,\" of which we were speaking. Such immigrants—and Manitoba has received many of them—are a splendid material for our young society. Another of our passengers was an intelligent farmer's daughter: She had driven twenty-five miles to reach the stage and by eleven o'clock that morning had completed, at the house of a relative near Brandon, a journey of fifty miles. When Manitoba maidens can get up so early in the morning they are sure to succeed in life. Another of our party was a prominent member of the\n\nFARMERS' UNION.\n\nHe discussed the Red River Valley Railway, and held that this movement is simply the outcome of the principles laid down by his much maligned society. The farmers are the patriots of the country, have no other end to serve than the good of the country, and have quickened the provincial conscience to make our politicians stand up for the right as they are doing. This country, he maintained, had been compelled to fight an unequal battle with other immigration fields, and it would be much in the interest of all the railways to give lower rates of freight, for so the farmers would be able to embark in greater operations and provide more freight. The rest of the party would not admit that the Farmers' Union had had all the patriotism of the Province, but yet were not very well able to answer his arguments. We all agreed that the present harvest, with its estimated export of ten million bushels, would be a great boon to the farmers, and assuage many of their sor-\nrows. Perhaps the most interesting member of our party was\n\nA WELL-BORN LADY,\n\nthe wife of an Irish gentleman engaged in farming north of Brandon. This lady is connected with a family well-known, both in Canada and Britain, for its literary work. She had been brought up in Ireland, seen much of the world, had travelled largely on the Continent, and come to settle down on a prairie farm. And she was so fond of it that she could not think of going back to the Old Country. She and her husband had been accustomed to ride over the prairies on horseback, but two sweet little children, one of whom accompanied her on her stage journey, made a more elaborate mode of transport necessary now. She had, with true British pluck, undertaken the heavy duties of farm life, and yet was a lady of intelligence and cultivation, and, unless the writer is mistaken, could with her imagination and observing power, write a good book descriptive of prairie life, as one of her relatives had done of the backwoods of Canada. Too often we see our British immigrants living on driblets of money received from time to time from the Old Country, and we call them in contempt \"remittance farmers.\" It is pleasing to see well-born and cultivated men and women coming to engage with pleasure in prairie farming, and able at the same time to make it pay. Arrived at Brandon our pleasant party dispersed, and the writer esconsed himself in a C. P. R. train for the far west, when\n\nAN EPISODE\n\nof another kind occurred. Certain marriage arrangements of a friend of the writer in Brandon had been altered by circumstances. The writer was compelled bodily to leave the train about to start, and marched up town between the determined bridegroom and the equally determined father-in-law. This made a delay of a day and the cancelling by telegraph of certain engagements further west, but refusal was useless. To make kindred hearts happier is, however, always a congenial task. Next morning in the church three hundred of the youth and beauty of the city gathered for the ceremony, and as an old clergyman present remarked, a good many more than would have turned out to a prayer meeting at nine o'clock in the morning. The bountiful harvest is likely to bring on a plentiful crop of marriages in the Province, and even a whole-\nsale marriage excursion to Ontario is in favor in the west. At last we are out of Brandon, and hurried along are soon amidst\n\nTHE CROPS OF VIRDEN.\n\nThe region about Virden is very attractive. The soil seems lighter than further east, but there is here a pleasing alternation of ridge and bluff and prairie lake. The railway belt seems less settled, for as we go west the land—for a mile on each side of the railway was, by a mistaken policy, for a time reserved. But enough is seen, even from the train, to show that the same plenty as found elsewhere had come hither also. A rather intelligent young man became a travelling companion here. He was a Canadian from Ontario, who had been a number of years settled in Missouri. His observations were interesting. The harvest fields were something astounding to him. Accustomed to see fields burnt up with drought, the green herbage of Manitoba, and the full corn in the ear in the abundant sheaves delighted him. He said he noticed a difference between the people of the Northwest and those of the Eastern Provinces. The people here, said he, are more sprightly and have much grander ideas than in our older Canadian districts. There seems to be an air of progress about everything. It will be strange, indeed, if our Missouri visitor does not throw in his lot with us. One is much pleased to see the improving appearance of our\n\nMANITOBA TOWNS AND VILLAGES.\n\nAs we draw up in the train at these points the neat churches and good school buildings always attract attention. It is true these have been hurried on by the several denominations and local taxpayers without thinking much of the burdens to be borne. It would give the traveller greater pleasure if he could know that all these were paid for, but the rich returns of the fields this year will do something towards paying off these necessary debts incurred. The merchants, now that they see the fields in stock, are more courageous, and large business orders are being given for the autumn and winter trade. The outlook for Manitoba is most cheering. But we must away, and so on whirling wheels we leave our Province behind, to rush through the Territories and then over the Rockies to the Pacific.\nII.\n\nTHE WIDE WESTERN PRAIRIES—COMPAGNONS DE VOYAGE—ENERGY OF THE C.P.R.\n\nLeaving fertile Manitoba and its harvest home behind, we have an opportunity as we go through the territories, of looking at our travelling companions. There is in most companies a representative of the \"lone man\" species, who sits greatly apart, and like frowning Jove from Olympus disdains human society. That man loses half the joy of life. Like an ocean voyage, a Pullman car journey over the Canadian Pacific Railway promotes sociability and, except in the case of the most confirmed cynics, makes acquaintance easy. Diogenes-like, the \"lone man\" simply wants to be unmolested. Happiness to him means that sun, or wind, or umbrellas, or parcels, or valises, or railway porters, or romping children, or fruit sellers, or inquisitive fellow travellers, shall not disturb him. Our \"lone man\" was fortunately left behind at Regina, near which place we understood he had two sons engaged in the \"culchaw\" of the soil. Their interesting prairie cabin would no doubt induce paterfamilias, when he saw it, to draw still further within his shell. The solitary philosopher soon became to us all a fading reminiscence.\n\nVARIED SOCIETY.\n\nBut as they say in the plays, we must look at the \"persons represented.\" There were two Canadian M. P.'s on pleasure bent. These were wise men, for unlike the traveller who was asked whether he was taking his wife with him, and replied no, he was going for pleasure, they belied this imputation on the fair sex, by one being accompanied by his wife and the other by his daughter. A California lady and her daughter, of good old Virginian stock, were travelling west, taking their first outing among the Canadians. A gentleman from Australia who had been Commissioner to the American Centennial Exhibition some years ago, was now returning with his wife and daugh-\nter from Britain to the land of the Southern Cross. There was a Chinese missionary and his young wife, of whom more anon. Two American ladies leaving behind home and kindred, going to Tokio as teachers to elevate the subjects of the Mikado, and a British merchant returning to Yokohama from England, were en route for Japan. A French mademoiselle with two beautiful children in charge, was on her way to Victoria, B.C.; while a Canadian professor and the writer made up the party which became best acquainted. There were a few others, young fellows, who seemed chiefly taken up with the beautiful scenery of the \"smoking car.\" There is so much to be gained, don't you know, by travelling abroad, and inhabiting the \"smoking car.\"\n\nCOMFORTS OF THE JOURNEY.\n\nAs we whirled along through the plains of Assiniboia, our minds could not but recur to the travelling of our earlier days in the country. Then we had long and tedious drives, adventures in crossing swollen streams without bridges, stopping-places whose primitive cookery tried the most perfect digestion, and delays that vexed even the very patient. One can quite sympathize with the Calgary Indian, who, after gazing for an hour at the engine moving backwards and forwards, said: \"Man, who made that—big head.\" Whatever differences Manitoba may have with the Canadian Pacific Railway, all must admit the energy and skill with which the line has been built and is now worked. Our American cousins, who are accustomed to look upon everything Canadian as of second class character, are foremost in declaring their admiration of the perfection of working of our great railway. Day after day the train runs into the stations on the minute; beautiful Pullman cars with attentive officials are supplied; the dining car provides excellent meals, with all the fruits and delicacies of the season; and the western plains and mountains may be crossed without the ear of the most sensitive being shocked by an angry or profane word. The good from the absence of liquor through the Territories, notwithstanding the evasion of the law to some extent by the granting of permits, is seen by the C.P.R. route being free from the scenes of violence which characterize western American communities. But even the most delightful scenery, and the most peaceful surroundings, would be insufficient without the presence of pleasant travelling companions. The list already given shows what a large\ntraffic is growing up with China and the East, and conversations with people along the line and on the coast show that this year the volume of travel is so great that a number of the largest hotels must be rebuilt to accommodate the travelers. In the mountains the dining car is not used, but beautiful stations are erected in the midst of the finest scenery. As in sight of the ice fields of the Selkirks, you sit down in the Glacier Hotel, built in the form of a Swiss chalet, and find yourself surrounded by so many cultivated and pleasant people, you can quite fancy you are in a tourist's inn in Switzerland.\n\nTHE REAR PLATFORM.\n\nThere grows upon us as we go on hour after hour a disposition to take the world easier. Our powers of sight-seeing become overtaxed. The little prairie towns we are passing are very much like each other. Built as many of them are in the western American style, with the main business street facing the railway, we recognize familiar names of former Winnipeg people, who have obeyed the impulse to go west. But the most determined of our company, who have the true American sight-seeing disposition, find their way to the rear platform of the train, and there on camp-stool, on the steps, or standing first upon one leg and then on the other, remain hour after hour. The rear platform becomes the habitat of the more enterprising, and there with story, joke, or remarks upon the scenery, the time is wiled away. It becomes the gossip room of the Pullman. There are some in every company who form topics of amusement for the rest, and it does us good to have our follies and foibles taken off. With us the most observed of all observers was the pair\n\nENJOYING THEIR HONEYMOON.\n\nThere is always a supreme human interest in the case of newly married people. Not that they are anxious to be observed, but their very nervousness on the subject makes them interesting. Our honeymooners were most devoted. Unaccustomed to the ways of enterprising railway porters, our friend, who was middle aged, had been sixteen years in the East, and had come home to carry back a young wife from the banks of the Clyde to the flowery land, was induced to pay $15 extra for the use of the whole section, lest any intruder might purchase the upper berth and invade his garden of\nHesperides. Not even the vastness of the prairies, the glories of the snowy peaks, nor the magnificent scenery of the Selkirks could induce the devoted couple to gaze out of the windows, much less to adventure themselves on the rear platform. Byron's famous picture of the night before Waterloo, when \"eyes looked love to eyes,\" etc., so at least the ladies of the rear platform declared, could not exceed the devotion of the newly married pair. It was, however, charitably hinted that the long journey across the Pacific might wear off the glamour and increase the desire for a wider circle of acquaintance.\n\nOUR ARTISTS.\n\nEvery well appointed travelling party has a reporter and a representative of the imitative art. Indeed the photographic artist is as inevitable a feature of modern civilized life, as the life insurance agent. Our party had two artists in it, but they were both amateurs, and as it happened were both of them en route for Japan. The lady artist was indefatigable. The Indians were her chief object of interest. As soon as a railway station was reached, her camera on its tripod was erected, and aimed at the groups of natives. But Lo is becoming acquainted with the arts of the photographer, and whenever the instrument was recognized by the natives it produced as great a scattering as a Gatling gun would have done. One highly ornamented brave demanded a dollar to allow himself to be taken. The lady artist succeeded best when from behind the fortification of the car window she got a glimpse of some unconscious Indian group. The English merchant from Yokohama had two photographic instruments, so that he might be called a double barreled operator. One of the machines was very ingenious. It was so arranged that by looking down upon the top the image appeared, and in an instant at the will of the artist, the picture could be taken. The troublesome \"sighting\" process of the lady operator was thus avoided. The other instrument of the English gentleman was a \"detective's camera.\" It was not more than four inches across. It could be placed inside the vest of the operator, the projecting nozzle alone appearing. It proved a capital instrument for taking the coy and distrustful natives. While the skulking Indians were avoiding the lady artist they fell an easy prey before the unseen detective's apparatus. Our party had thus quite an air of business as we took along with us lasting\nimpressions of bedecked savages, prairie villages, icy peaks and mountain torrents.\n\nTHE LOST PASSENGER.\n\nOne afternoon as the train was bowling along at good speed the occupants of the rear platform were thrown into a state of excitement by what might have been a tragic accident. A lost passenger was seen to rise from the railway track in a confused manner, having fallen off the train. The sympathies of the ladies were at once aroused; the passenger was not sufficiently disabled to prevent a pursuit of the train, the cries of the ladies encouraging the chase; but the distance between the sympathizers and the pursuer steadily increased, until at length the conductor's aid was obtained, when the train was stopped. The chase was now more successful, and to the joy of all it was found that the injuries of the passenger—a fine spaniel which had sprung from the baggage car—were much less than those of a human being would have been. One of the inveterate occupants of the rear platform was\n\nA YOUNG LADY RANCHER.\n\nWhy shouldn't strong-minded young ladies of education and property go into ranching? Young women who can practice medicine, fill important government positions, and act as principals of large schools, have certainly executive ability enough to manage cowboys and wild cattle. Indeed the respect for woman brought out in Bret Harte's pictures of miners' life, and those of the adventurous English lady, Miss Bird, on the western prairies and Rockies would seem to show a peculiar fitness for succeeding in the \"Wild West.\" Our young lady was going first with her mother to San Francisco, and then intended to leave her chaperone behind and venture alone upon an estate owned by her family on the Pacific coast to engage in developing it. There was a fine enthusiasm about our young lady friend, and our party applauded her choice of thus striking out for herself. Better far thus than bestow her hand and fortune—especially the latter—on some unworthy suppliant in the effete East. Of course we did not enter on the other side of the question, of whether a comfortable and suitable marriage might not be better. That case was not before us.\nA LEARNED DISCUSSION.\n\nOne evening as the shades were falling, and the scenery became too dim to be distinguished, the two ladies for Japan, the intelligent wife of the M. P., and the professor fell into a discussion, which prevailed for an hour or two to the no small delectation of the company. The subject of dispute was the question of the use of the right and left hands. The senior lady for Japan maintained that every one should be trained to use right and left hands with equal facility. The professor held that the right hand was largely for grasping, and the left for support; that their purposes were different, and to become ambi-dextral would be of little advantage. Another of the party pointed out that the internal organs of the body were not bilateral, and so the hands would not be of equal power. The exception of left handedness was next discussed, the greater strength of the right side being referred to as the reason for a person lost on the prairie always going in a circle to the left; and so with arguments hot and heavy the evening was spent till we were all driven to our berths to be up in the morning early to view the mountains.\n\nTHE YOUNG LADY LETTER WRITER.\n\nThe young lady just from school was most exemplary in obtaining materials for her note book to be given in long letters to friends at home. With hints and suggestions from various members of the party the note book grew apace. The young girl just fresh from the dry manuals of history, and full of the technical geography of the schools, was anxious to obtain the bald facts of the journey. Our modern education pays too little attention to the imagination. The former generation with its Red Riding Hood and Cinderella, and \"Heigho says Rowley,\" could see the wonderful or the amusing more readily. The zeal with which our young lady took notes of population, heights of mountains, degree of gradients and curves and the like, was worthy of all praise. We shall draw on her materials in describing the\n\nTHREE PRAIRIE CENTRES\n\nwhich we passed. These are Regina, Medicine Hat and Calgary. Regina is the official town of the Territories. If you spy a rather well-to-do young man on the street in Regina and ask your friend his occupation, you will be told that he\nbelongs to the Indian office; if not to that then to the land office; if not to that then to the mounted police; and if that fails he must be an official of the court. To be a government official or to cater for that important class is the chief object of existence in Regina. But this year Regina has very good crops in its neighborhood, and there are several good settlements lying north of it. A beginning was made last year of a planing and flour mill, and no doubt other industries will be added. With churches and primary schools Regina is well supplied, and society is somewhat highly organized, as is usually the case in government towns.\n\nMEDICINE HAT\n\nis a far more picturesque locality than Regina. The great Saskatchewan and its deep cut valley is a new feature as we travel west on the C.P.R. It is a question as to what use the great unoccupied region stretching for two hundred miles east and as far west from Medicine Hat may be put. Its enormous radius of trade among Indians, miners, explorers and travellers, gives \"The Hat,\" as it is locally called, a considerable amount of business. It is probably true that while this region is not by any means a desert, as the country in the same longitude to the south in the United States is, yet the scantier rainfall and greater elevation will not allow it to compete with Manitoba as a farming district. It must be said in justice to the region that the crops this year are reported good, and our party saw in the neighborhood of Medicine Hat fields of grain harvested and presenting a fine appearance. The fact that here the buffalo roamed freely, and lived on the nutritious grasses, points to this as a field for stock raising, though it would seem to the writer better adapted for flocks of sheep. Sheep runs in Australia and New Zealand in somewhat similar districts prove a source of great wealth. Geologically this region is important, as underlying it and at no great depth are beds of bituminous coal, which will be of much value on these treeless plains.\n\nCALGARY.\n\nThis is the home of the rancher and the cowboy. One of our Nova Scotia visitors this summer wrote home that he saw herds of cattle near Brandon under the care of cowboys. Our visitor from the salt water evidently never saw a real cowboy. He has often been described. We pass him by, only remark-\ning that Calgary would be dull without him. Calgary is a fine town. Being the depot for the vast Edmonton country and for the Bow River district, it will no doubt continue to prosper. Situated on the beautiful, clear river, the Bow, and in sight of the peaks of the Rocky Mountains, its people naturally feel themselves though last on the prairies yet not the least. The buildings of the town promise to be substantial. It is the ecclesiastical centre of the great churches of the country for the far west prairies, and the adjuncts of a higher civilization are rapidly appearing. Our prairie journey has for the present ended. People tell us that dwellers on the plains are in all countries spiritless and common-place; not so when they are under the shadow of such magnificent mountains as the Rockies.\nWestward Ho.\n\nIII.\n\nTHROUGH THE MOUNTAINS—SHINING PEAKS—SPLENDID SCENERY—COMFORT AND SAFETY.\n\nHow is it best to see the Mountains? is the question many an anxious traveller to the Rockies asks. For through passengers there is no choice, as they rush up the valley of the Bow river at night to awaken in the midst of Alpine glories. But if possible the journey should be broken at Gleichen or Calgary, and then taken up in the daytime by mixed train. The point of view, the state of the weather, and the humor of the traveller will have much to do with his impression ever after.\n\nFIRST VIEW.\n\nOn a former visit the writer had his first view of the Rockies, and the picture is ineffaceable. An enthusiastic party of us had disembarked at Calgary, and determined to drive up the valley, but the weather was tantalizing. A bank of grey cloud hid before us what we knew must be the Mountains. But up and down the sides of the foot-hills—the Canadian Piedmont—the willing ponies carried the party at good speed. Forty miles of a journey along the banks of the Bow river seemed to bring the Mountains no nearer. Still the sombre sky refused to give up its secret. The party rested at night, and in the morning in a drizzling rain journeyed up the pass. It was a trial of faith. At noon a halt was called on the banks of the stream on which stood the old Bow River Fort of the fur traders. Luncheon over, the journey was resumed. From Gleichen, or the Blackfoot Crossing as we then knew it, where a fine view of the Rockies is obtained in good weather, one hundred and thirty miles had been gone and yet no vision came. Is there to be a total disappointment? Surely the oracle will speak. Suddenly as we ascended the banks of Bow Fort Creek the sky broke, and we were face to face with\n\"The Mountains of Shining Stones,\"\n\nas the earliest French voyageurs who saw the Rockies called them. And well they deserve the name. The icy peaks gleamed in the sun; the rays piercing the still falling raindrops, bathed the hillsides in rainbow hues. To the right stood in majesty, like the walls of a heavenly citadel, the Palliser range of sheer rocks, eight thousand feet high. That view must be the Rockies to us forever! Every different standpoint, however, has its advantages. At Calgary when the weather is favorable, the prospect of the different peaks, and the wide-spread vision possible from the outlying station, gives a panorama very grand indeed. Now for the ascent. But beware, for the traveller will be very much deceived in distances.\n\nA ROCKY MOUNTAIN STORY\n\nmeets us to give warning on this point. In the early days of the Canadian Pacific survey, it is said, a young sprig of nobility accompanied the explorers. From the camp at the foot of the Rockies the inexperienced traveller started alone one morning before breakfast to reach the mountains. Not returning for several hours, the adventurous youth was followed and found on the banks of a narrow stream. He had disrobed and was preparing to venture his life in crossing the shallow creek. Interrupted by the pursuer and asked his reason, he remarked that \"one must be careful in this country; he had been so mistaken in the distance of the mountains that there was no telling how wide the stream might be.\"\n\nOn the visit to the mountains now being described, the writer had taken the through train and had another delightful sensation in\n\nWAKING UP IN THE MOUNTAINS.\n\nAs the train thunders on up the ever narrowing valley, the sound increases from the reverberating walls of mountain. The Bow river, as the express rushes along its brink, or occasionally crosses it, seems to have a sharper rush and to dash over its bed more wildly than down near the prairie. No doubt its course is steeper, and the clearer and thinner air sharpens the sound. A short time before the train had passed the river Kananaskis. What a pretty Indian name! How much better than the Brown, Jones and Robinson names given\nto our new places, and, horribile dictu! even to the stately mountain peaks! But the \"Gap\" has been passed and the first view of the morning is in a mountain amphitheatre. As the sun lights up to brilliancy the icy peaks before us, we cannot wonder at the Blackfoot Indian of the plains, as he first catches sight of the distant shining peaks of his western horizon, falling down and worshipping the god of the morning. It is a fitting place as we remember Milton's line for\n\n\"Orisons each morning duly paid.\"\n\nThis is the\n\nROCKY MOUNTAINS PARK.\n\nIt is the grandest scenery of the Rockies, not now to make comparisons with the Selkirks or other western ranges. To the right was passed the \"Devil's Head,\" a prominent, ugly landmark, always standing out dark and threatening, however its companions may at times be clothed with virgin snow. In the foreground is the Cascade Mountain. It is really very grand, and is of solid rock. The broken layers and lines of bedding suggest all sorts of fantastic ideas. That view gives us a towering citadel; yonder are two arches that seem to lead into a vast cathedral; one can almost imagine heads of soldiers lining these barricades; beneath that cliff is a dark cave where robber hordes might find themselves secure; a cloud rests upon the summit, but disappears, no doubt in rain to bathe the brow of the rugged mountain; while directly before us is the silver thread of water—a dashing cascade of nearly two thousand feet—that gives the name to the mountain. At the base of this mountain a halt is called and this is\n\nBANFF.\n\nIn a future letter it may be well to describe all the wonders of the local scenery, the remarkable cave and the magical waters. Meanwhile the train is away and we are again gazing at the mountains. There is another of the monarchs of the range, the famous \"Castle Mountain.\" We leave the guide books to quarrel over the question of whether the Bow river is here \"dull China blue\" or \"pea green,\" for we are overpowered by the grandeur of this terraced, imposing, precipitous king of the crags. Edinburgh Castle, Dumbarton Cliff, the Keep of Carlisle, Stirling Rock, and Citadel of Quebec, all combined bear no comparison to this imposing pile, suggesting in different views some feature of all the castles named, and\npiercing the sky upwards of eight thousand six hundred feet above the sea. The ice fields stretching away to the north add sublimity to the scene, as—\n\n\"All around the white snows glisten\nWhere frost and ice and silence reign—\nWhile ages roll away, and they unchanged remain.\"\n\nSHINING PEAKS.\n\nBut there are, if not more beautiful scenes, at least grander heights to view. The air is pure, the herbage is slightly Alpine, and we are at dizzy heights, for the railway bed has reached an elevation of a few feet more than a mile above the sea level; and yet towering far more than another mile above us stand the mighty sentinels of the continent. The nervous system of the imaginative traveller reaches fullest tension as he realizes that he is nearing the summit of the mountains. It is like some crisis of our lives—the culminating point for which we have waited. The traveller having left Winnipeg has gone—by easy stages it is true—yet has risen upwards, more than seventeen-twentieths of a mile. A balloon ascent thus high would cause decided dizziness. To have reached the summit at Stephen seems to one to have accomplished something. It is useless to attempt a description of Mount Stephen, the height of which is variously estimated. The peak of the mountain would seem to be between 13 and 14,000 feet above the sea. Far away to the north, one icy peak after another is seen, until we become dazed looking at their number and brilliancy. Stephen and Cathedral mountains are passed and we become depressed with the thought of the unending mer-de-glace, the \"dreary wastes of frozen plain,\" and yet turning to the peaks again, the words of the sweet singer come to mind\n\n\"And glistening crags in sunlit sky\nMid snowy clouds piled mountain high\nWere joys to me.\"\n\nTHE DESCENT.\n\nOne of the excitements of crossing the Rockies is the western descent. The water now begins to run with us. But how unfortunate the name—the Kicking Horse—given to the dashing stream of the glacier, along whose brink we are to descend. We remember the \"Mazeppa\" of Palliser's expedition of thirty or forty years ago, Dr. Hector, as the origin of the name, but\nthe name is hateful to us every time it is spoken. To see the descent from the summit the correct thing to do—provided the engineer is willing—is to assume a position on the engine, or on the \"cow catcher\" better still, and take in the view. The \"facilis descensus,\" is quite safe, for a strong engine is attached in rear of the train, and \"down brakes\" is the engineer's order. Another assuring provision is the fixing at certain distances, of safety switches. They are open except when the \"four-whistles,\" the signal—somewhat like a fog horn—is given by the engine. Should a train escape from the control of the engineer it will enter the open switch, which runs up the mountain side, till it stops. Whether this has ever occurred we did not learn.\n\nTHE EPICUREANS.\n\nEleven miles from the summit all, however, are glad to stop, for it is the refreshment station—\"Field.\" Our lady artist declared it \"Philistinish\" to give up the beauties of scenery to descend to the baser pleasures of appetite. It was quite amazing to see the warmth with which the less imaginative members of the party, with cravings sharpened by the shrewd mountain air, replied to the aesthetic lady. The architecture of the hotel is Swiss, and the traveller is carried back to Alpine visits; but the freely appointed table and excellent food are worthy of a city. The fierce \"Kicking-Horse\" has been gathering volume, and here cuts out a deep gorge for itself, through which it rushes to join its waters to the Columbia. The journey resumed, the travellers set in good humor by the table d'hote at Field, are still able, despite the fears of our lady going to Japan, to enjoy the scenery, notwithstanding their having stooped to the \"lower pleasures\" of the table.\n\nTHE MOUNTAIN RANGES.\n\nThe descent of the western slope of the Rockies continues until the brink of one of the great rivers of the Pacific coast is reached. For practical purposes we may look at the Rockies as beginning at Calgary and ending at Donald—the first crossing of the Columbia. This is a distance of 183 miles. We are introduced, however, into the heart of the British Columbian Mountains, for there are the Selkirks and the Gold range to cross and the great canyon of the Fraser to descend. What a mighty upheaval must have taken place when these ranges\nwere formed! Scientific study teaches us that once a great plain extended from Calgary to Vancouver Island. With what tremendous earthquakes the continent was shaken when in the Tertiary Age our mountain ranges were hurled forth! a part of the mighty convulsion that rent the earth from Alaska to Patagonia.\n\nOTHER PASSES.\n\nIn days before the railway was built the more favorite routes for crossing the Rockies were further to the north than now. Milton and Cheadle in 1862, and Fleming's \"Ocean to Ocean\" party in 1872, crossed to the headwaters of the Thompson River by the Leather or Yellow Head pass, which lies west of Edmonton. This pass is claimed to be but 3,700 feet at its highest point, and if so, is some sixteen hundred feet lower than our railway pass. Even far north of the Yellow Head pass the mountains may be crossed, and this with ease. This is by following the course of the Peace river, by which so long ago as 1793 Sir Alexander Mackenzie, first of white men, crossed to the Pacific Ocean. The railway pass, consisting of the Bow river valley on the east side of the mountains and that of the Kicking-Horse on the west, is but one of the five more southern passes by which the valley of the Columbia river is reached—the others being Howse's, Vermillion, Kananaskis and Kootanie. These passes were all explored by Capt. Palliser in his famous expedition of 1857-9. The hardships and heroism of the men who first penetrated these mountain vastnesses can be but faintly imagined by us as we rush through them by rail in a comfortable Pullman.\n\nRIVAL RAILWAYS.\n\nA question often asked as we speed along is: How does this railway compare with the other transcontinental lines? The writer has not crossed by the Northern or Union Pacific railways, but the evidence of those who have is entirely in favor of the Canadian Pacific. \"There are no Rocky Mountains,\" was the common remark of tourists over the American lines. Our visitors speak otherwise. The majestic mountains and variety of scenery of the Canadian line are unapproached, and yet this \"tourist railway\" has not been obtained by sacrificing commercial considerations, for while our summit is 5,296 feet high, the Northern Pacific has two summits to cross, each 5,500, and the Union and Central Pacific railways reach\ntheir highest point at 8,240 and 6,017 feet respectively. For splendid views, increasing variety, comfort in travelling and safety, all American travellers give the Canadian Pacific the palm.\n\nMOUNTAIN VIEWS.\n\nWhy should we go to Scotland to be rapturous over Ben Lomond and Ben Nevis and the rest, when these but reach to the foot-hills of our Rockies? Why should we so earnestly desire to visit the Swiss mountains—majestic as they are—when Castle Mountain and Stephen and the Cascade await us on Canadian soil. In the nature of the case, however, the mass of our people cannot visit the Rockies any more than they can cross to see Ben Lomond or gaze up at the Righi or Matterhorn. Means should be taken to acquaint our Canadian people with the beauty and grandeur of our western heritage. Fortunately this summer the Mountains have been visited by a number of Canadian, British and even French artists, who have carried back many a \"thing of beauty.\" The photographers too are rendering good service by their really excellent views, taken from every \"coigne of vantage.\" Surely as the years go on our publishers will prepare pictorial volumes of Rocky Mountain scenery, that many more Canadians may feast their eyes on the beautiful.\nIV.\n\nROCKY MOUNTAINS PARK—SNOWSTORM IN THE MOUNTAINS—THE NEW C.P.R. HOTEL—THE ANTHRACITE MINE\n\nNo one can fully appreciate their grandeur by hurrying through the Rockies on a railway train. If the traveller wishes to see the greatest variety of scenery within small compass, he should lie over at Banff. This is the centre of the ROCKY MOUNTAINS PARK.\n\nThe idea of a national park for the Dominion has grown by degrees. At first a few miles square were reserved by the Government, but additions have been made from time to time on the recommendation of the capable Government Engineer and Surveyor, Mr. G. A. Stewart, who is resident in the park. Now, an oblong of twenty-six miles by ten is set apart, and within these limits a wonderful combination of mountain, lake, river and valley is to be found. But the grandest sights are valueless if they be inaccessible. It is only one of a hundred tourists who has perseverance, we may say recklessness enough, to penetrate unexplored jungles, cross unbridged streams, or clamber up pathless mountain slopes. By an annual vote the Dominion Parliament is providing for the comfort of visitors who come to view the park. Excellent macadamized roads, several miles in length, are found winding through the wooded valleys. The Bow river, which runs through the southwestern side of the park, and whose every turn is beautiful, is bridged in a substantial manner. Buildings are in course of erection at convenient points, and pathways being cut to points of interest. A conversation with the resident engineer showed that his tastes are in the main correct. The roads avoid angles, and really take nothing from the rustic beauty of the park. The buildings being erected are mainly after Swiss\nmodels, and seem to the Alpine traveller quite in keeping with the surroundings, while in their construction wood in unsawn form is largely used for the exteriors. The system of leasing land is going on largely, and a business street is appearing, very much after the fashion of our western towns. It is a question whether all the buildings put up should not require the approval of the resident engineer. Though the writer visited Banff in the middle of September, the first day in the park, and it was a Sunday, was spent in\n\nA MAGNIFICENT SNOW-STORM.\n\nAnyone acquainted with mountain climates knows that a snow storm may be expected at any time. Indeed in really mountainous localities hardly a week in the year is free from snow fall. \"Would it were always summer\" is a well known sentiment, and it was quoted to the writer by a distinguished English visitor this season, but it is a foolish wish. Mountains are at their best in winter scenery. During our visit six inches of snow fell in one day, and covered mountain and vale with a pure white mantle. Next morning the valleys were clear; the snow was gone; and hour after hour as the sun rose higher, the exposed mountains lost their covering, and but one distant, lofty range, the Pallisers, kept their snowy garment. Light showers with peals of thunder filled the morning air; and the rising mists, with ever changing hues, added beauty to the sunlit mountain tops. The angry storm was chased away by the floods of sunshine like the frowns and passion by the returning smiles on the face of a child. Nearly at noon—day—a fierce, driving storm of rain clouded the sky; the effect was grand; the mountains seemed disturbed on every side. As in Byron's storm on the Lake of Geneva,\n\n\"Far along\nFrom peak to peak, the rattling crags among\nLeaps the live thunder.\"\n\nIt is no figure to say with him,\n\"Every mountain now hath found a tongue.\"\n\nBut as the snow has gone, and the mists have cleared away we are ready to\n\nEXPLORE THE PARK.\n\nBanff nestles amidst the mountains. The grandest view is undoubtedly towards the north. There Cascade Moun-\ntain; with its splendid peak, already described by us, presents its beauties, reaching as it does into the sky some ten thousand feet above the sea. As the eye continues along the Sawback range, there is seen \"Hole in the Wall Mountain,\" and in the choice of these designations the early explorers have certainly rivalled the absurdities of the Indians in giving their chiefs such names, as \"Strike him in the back,\" and \"Man who Stole the Coat.\" Far to the west in the same view is the splendid Castle Mountain, to which we, in company with all visitors, have already paid our devours. It is along the base of these mountains that the Bow River flows, and many a visitor at Banff takes a canoe or boat and passes up the river to a series of beautiful lakes, known as the Vermillion Chain. These are of surpassing interest. The quiet expanses of water, safe for the tourist's party, clear as crystal in their depths, are full of attraction to visitors. Wild rice has been sown in the retired coves of these lakes, and wild fowl will no doubt, in ever increasing numbers, make this their summer home. Having seen the lakes, on our return we take in as we leave the river, looking southward, a fine view of the\n\nTERRACE MOUNTAINS\n\nor Sulphur range. These fill the whole southwestern horizon and reach a height of 7,700 feet. Many points of local interest will repay a fuller study here. Turning now to the east the mountain scenery is exceedingly grand. Down the valley before us is Tunnel Mountain. It is dark and wooded, and stands alone, seemingly left in solitude when the mighty range split open to provide the pass for the river. Its name is a case of \"lucus a non lucendo,\" for there is no tunnel through it. It seems it was originally intended that it should be tunneled, but certain adventurous spirits climbing to its top, discovered the present circuitous route around its base, and the tunnel was stopped. Southeast of Tunnel Mountain in our view are the\n\nTWIN-PEAK MOUNTAINS\n\nor Mount Rundle. These as they rise far up in the clouds, show plainly that they were once together, but in the mighty upheaval were torn apart. Letting the eye fall upon the northeast, with Tunnel Mountain to the right, and Cascade Mountain on the left, there is seen a magnificent view. Far away is the pure white chain of the Pallisers. Like hoary\nsentinels they stand, the sun making no impression upon them, while all around us the mountains are reeking with the rising vapors of the melting snow of yesterday. Tunnel Mountain and the Twin Peaks are all included in this colossal picture, and if anything more enchanting can be seen, it must be in a land of celestial glories. But besides, there are the\n\nLAKES AND RIVERS\n\nof the park. Across the railway to the north of Bow River is now being built a road which will open up the northeastern portion of the park, far away towards the stately Pallisers. Some seven miles of road will lead the tourist to Devil's Lake, the chief sheet of water in the park, bounded on the north by the Pallisers and on the south by the Beecher range. The lake takes its name from the rugged, unsightly peak, the Devil's Head, which, as before noted, is so prominent as to be visible out upon the prairies. In the same direction lies the Devil's Gap, so that the Prince of Evil seems to have a considerable recognition in the National Park. The Devil's Lake is a beautiful, clear mountain loch, and will become a favorite resort. It is about thirteen miles long and from one to two miles wide. The Government, it is stated, intend to place a steam launch upon it next summer, in which case a most romantic part of the park will be thoroughly accessible. But, back again to Banff. We may examine some of the local attractions. On Terrace Mountains occur the\n\nFAMOUS HOT SPRINGS.\n\nThese are very remarkable. No traces of volcanic action are found in this part of the Rockies, and yet at seven points along this Sulphur range springs flow from the mountain side, which have a temperature varying from $90^\\circ$ to $119^\\circ$ Fahrenheit. Summer and winter this thermal supply is given off, and the water has useful qualities. The furthest west of these springs is that connected with the celebrated\n\nMAGIC CAVE.\n\nWhen first discovered, a small opening some three feet across led down from the top of a ridge into a cavern thirty or forty feet deep to a sheet of water, this about thirty feet diameter and four feet deep. In the midst of the pool was found boiling up constantly a hot spring, the overflow of which makes\nits exit through the side of the hill. At the base of the mountain one of the Government buildings has been erected, and from this by a labyrinthine tunnel, a new entrance has been made to the pool. It is now possible, without the dangerous descent from above, to inspect the cavern and, if one is so inclined, to have a hot bath. A hundred yards farther west is another neat building erected by the Government, near which a view may be had of the \"basin.\" This is an excavation into which the water, at a little lower temperature, is gathered. The basin is built up about with the masses of tufa formed by the spring. In the building near by is a slab, some four feet square, showing well the process of incrustation, which is formed on everything touched by the water. Retracing our steps down the well-made road for a couple of miles, we reach\n\nTHE SANITARIUM.\n\nThis is a commodious wooden building, under the direction of Dr. Brett, one of our Winnipeg physicians. It has been the chief place of resort at Banff during the summer. It must be a difficult task, at a point so far from markets and business centres, to keep up a comfortable hotel, with capacity for satisfying the appetites of hungry travellers. The object of the Sanitarium is, as its name implies, to supply health to those in search of it. This purpose has been necessarily forced into the back-ground by the large numbers of visitors on pleasure bent. As hotels are built, no doubt the Sanitarium will return to its original design, and its charming position as a health resort will make it a great boon to invalids. There are at present no hot baths at the Sanitarium, but at a point higher up the mountain, a mile or two distant, and at the springs, Dr. Brett has erected the Grand View Hotel, for invalids only, though the baths are open to all. Carriages leave the Sanitarium at short intervals for the Grand View. Near the springs other enterprising persons have also erected boarding houses, where baths may be obtained. The baths, steaming hot, are certainly most interesting to visit.\n\nTHE SPRAY RIVER.\n\nStrolling leisurely back from the springs in a northward direction we turn upon a well-made road to the east, and pass the rustic residence, among the trees, of the resident engineer, Mr. Stewart, and further on take a path which leads us to the prettiest river scenery of the park. This is a stream called the\nSpray River—a favorite resort for artists. This dashing river, which empties a distance below into the Bow, is a succession of cascades, rapids and eddies. Its banks are solid rock. The rock on the south side is greatly dislocated. Beds of sandstone and shale are found tumbled together in a most promiscuous manner. The rock seems to be of Cretaceous age, and from it the writer secured a good specimen of fossilized wood. Having followed the stream nearly to the bridge, and regretful at leaving its beauties behind, we climb by a mountain path up to the palatial\n\nCANADIAN PACIFIC HOTEL,\n\nnow being finished. The situation of this fine building is unsurpassed in the park. From the balconies on every side of it the grandeur of mountain, forest, rock and stream presses upon us. The building is a fine piece of architecture, and its present brown finish, relieved by red, is very effective. In the building is a very lofty rotunda, extending from the ground floor to the very top, after the manner of hotels in the Southern States. Corridors run off in different directions, along which are rooms, said to number in all about three hundred. The building is heated by steam. The dining room is commodious, and the kitchens, with their handsome ranges, made us hungry, breathing as we were the caller air of the mountains. This hotel is nearly completed, the furniture having reached Banff, and it will no doubt be conducted in the faultless style for which the C. P. R. is already famous in its hotels in the mountains. For both the Sanitarium and the C. P. R. Hotel, it is plain, different arrangements than the present must be made for the use of the\n\nMINERAL WATER.\n\nA drive of two miles to the springs, especially for delicate patients, is too great. The writer was glad to hear of another plan proposed by the Government. The park being the property of the Dominion, no portion of it is alienated; even the use of the water is leased. It is the intention of the Government to establish, at a mile or more below the springs now used, a reservoir, in which will be retained a sufficient supply of water for the Sanitarium and the C. P. R. Hotel, and indeed for any other hotels which may be built. By connecting pipes with this reservoir the water will be conducted and the pressure regulated to meet all demands. The water itself is peculiar in composition as well as in temperature. The springs,\nand the buildings connected with them, have a strong smell of sulphuretted hydrogen—a by no means pleasant gas. The composition of the water, taking 100,000 parts, is given as follows:\n\n- Gypsum .................................................. 51.45\n- Epsom salts .............................................. 8.79\n- Glauber salts ............................................ 10.06\n- Limestone ............................................... 12.03\n- Soda of commerce ..................................... 19.37\n- Sulphuric acid .......................................... 7.65\n\nThe quantity of sulphuretted hydrogen given off suggests the presence of sulphides, and the rapid deposit as an incrustation of the substances in solution, when the water cools, is very surprising. The waters have evidently very important medicinal virtues. The writer met and conversed with all the invalids, at the time, in the Grand View Hotel, and certainly their testimony was very favorable. Rheumatism yields inevitably before the healing waters; nervous affections are, it is said, cured; several internal ailments are relieved, and cutaneous diseases giving way as if by magic. The patients drink freely of the water and become fond of it. The writer cannot confess, however, to have reached the stage of fondness. The rest from toil and worry, the bracing mountain air, and the opportunity afforded visitors for pleasant exercise, will contribute, along with the remarkable water, to make Banff a place of much resort. The account of a visit to the Rocky Mountains would, however, be very imperfect without a description of a trip to\n\n**ANTHRACITE.**\n\nAn old Winnipeg friend, Capt. Constantine, and his hospitable wife, who are living at Banff, insisted on the writer paying a visit to Anthracite. The place is reached by driving five miles from Banff and then by walking down the railway track for a mile, for Anthracite has no wagon road to it. It is thus a sort of island in the mountains. This little mining village of some 200 or 250 people has grown up very rapidly—in less than a year—and as every one knows owes its existence to the discovery of workable beds of coal within a stone's throw of the railway. The obliging superintendent of the mine afforded every facility for visiting it, and the writer penetrated every tunnel to the very end. The work of coal mining is here very easy. The mouth of the pit is about forty feet above the railway track. The\napproach is nearly horizontal as the mountain side is entered and is some twelve feet in diameter. This allows a track to be laid, on which, drawn by horses, are the usual shaped trucks of the coal pit. Carrying lanterns we penetrated the darkness and reached the first seam. This is a splendid coal layer seven feet thick, with a dip of perhaps 30°; it has been worked both right and left. Entering the left hand tunnel we followed it to the very end, 520 feet, and secured from the men working at the extreme point a choice specimen of coal. Similar tunnels further in were followed, one where the coal was about three feet thick, and another of nearly five feet. On going into the extreme distances the air became heavy, and we were glad to learn that for the health of the miners ventilating apparatus will soon be introduced. The coal is thus very easily mined; it is brought out by the horse-trucks, and thrown down on an inclined frame of iron bars. This in the meantime serves for sorting, but a rotating sifting apparatus is being prepared, which will be a great improvement. After picking over to remove any shale present, the workmen conduct the coal by spouts to the cars on the railway track. The expense of mining and moving the coal must thus be reduced to a minimum.\n\nIT IS ANTHRACITE.\n\nThe great question asked is as to the character of the coal. The Government geologists in our Northwest have been too timid. They for years decided against our Northwestern coal, but now such splendid deposits as that of bituminous coal from the Galt mine are pushing their way into recognition. Scientific opinion should encourage, not raise doubts, as to important enterprises. To many it seemed too good to be true that we should find real anthracite on Canadian soil. It was wrongly said that there is but one real anthracite deposit in the world and that in Pennsylvania. Of course there are anthracite beds in South Wales and Peru, and now we know that we have this valuable anthracite mine in the Rockies. The London Times correspondent calls our deposit semi-anthracite. Anthracite is simply stone coal. The specific gravity, percentage of carbon and hardness of the Rocky Mountain coal, rank it with anthracite. The writer has burnt this coal. It has small flame, has intense local heat and no smoke. Its local conditions are similar to those of Pennsylvania anthracite, for it is among the dislocated rocks where pressure and possibly heat may have been applied, as is the case where the Alleghanies of\nPennsylvania have changed the bituminous coal to anthracite. It is not easy to determine, without a full geological investigation, the age of the Rocky Mountain coal. Carboniferous rocks do occur in the Rockies, and at a higher elevation on the brow of Twin Peaks Mountain are Silurian beds, but in the Rockies the Carboniferous and Cretaceous are very conformable, and it may be of the latter. At any rate the practical tests of our black diamonds from the Mountains are highly satisfactory, and while we were at the mine an order for 4,000 tons for San Francisco was being filled. It would not be surprising if this anthracite should drive out the poorer varieties of bituminous coal found on the Pacific coast, for the bituminous coal of Nanaimo is somewhat inferior to our Galt mine coal. Our party returned from Anthracite rather begrimed and blackened by the visit to the coal mine, but filled with deep thoughts as to the possibilities in many ways of our Rocky Mountains.\nV.\n\nPERILOUS CLIMB IN THE SELKIRKS—GLACIERS OF THE SUMMIT—THE ICE FIELDS DESCRIBED—BEAUTIES OF SCENERY.\n\nWhen the tourist has reached Donald, the first crossing of the celebrated Columbia river, he has the satisfied feeling that he has \"done the Rockies.\" The passage, however, has been so smooth and easy, and the attention to bodily comfort so complete, that the traveller is, as far as possible, from imagining himself either a Hannibal or a Napoleon, though he may have crossed the Canadian Alps. At Donald, it is true, the most difficult engineering, and the finest scenery, are yet ahead, but the fact that the Rockies, the old time barrier, between the prairies and the sea, have been crossed, raises the thought of how great an achievement the Canadian Pacific Railway is. The cartoon in a late \"Punch,\" entitled the \"New Northwest Passage,\" is good. \"Britannia,\" holding her trident, is surrounded by walls of merchandize, and with the engine, \"Canada,\" in view drawing the railway train, thus speaks:\n\n\"Now, from my western cliffs that front the deep,\nTo where the warm Pacific waters sweep.\nAround Cathay and old Zipangu's shore,\nMy course is clear. What can I wish for more?\"\n\nBut the Columbia crossed, the train after following the river for a few miles, suddenly dashes into the\n\nSELKIRK MOUNTAINS.\n\nThe map of British Columbia shows the Columbia river sweeping in a loop around the north end of the Selkirk range, and this is called the \"Big bend of the Columbia.\" In building the railway the choice lay between following the river for sixty miles of a longer route, or facing the passes of the Selkirks. Whatever may be the commercial disadvantages, the tourist may rejoice that the present line was chosen, else he should have missed the grandest scenery of the whole journey.\nEverything about the Selkirks is rugged. As the line leaves the Columbia to ascend the valley of the Beaver river, a lofty gateway of rocks—the Beaver gap—marks the entrance on the gorge. Down the valley towards us dashes, over countless cascades, the stream made up of the melting glaciers of the Selkirks. The chasm, along whose side the river ascends, at times becomes so narrow that a single tree thrown across serves as a foot-bridge. Dashing torrents, one of them from a mountain cave, are encountered as they fall with terrific force down the cliff walls and pass under our feet. The climax of striking scenery is reached in a series of foaming cascades called \"The Surprise.\" Amidst such rugged grandeur, it does not amaze us to see a bridge, said to be the highest trestle bridge in the world, 296 feet above the boiling torrent. After a surfeit of rock and cataract the train runs up a small tributary of the Beaver and halts at the entrance of the\n\nFAMOUS ROGERS' PASS.\n\nReaders of the Century Magazine of last year may remember an article on the Canadian Pacific Railway. In it was described the series of hardships and thrilling adventures by which Major Rogers and his party discovered the pass through the Selkirks in 1883. It is said the whole party, thwarted in their efforts by the rugged mountains, were in despair, except their leader. The second in command could only be induced to make further effort by a promise, given by the Major, that the most majestic mountain should be named after him. The almost hopeless trial was made, and was successful. The railway reaches in this pass a height of 4,300 feet, which is almost one thousand feet less than the summit of the Rockies at Stephen. Through barriers overhanging us on both sides, we cross the heights, and on the other side are thoroughly glad to find\n\nTHE GLACIER HOTEL.\n\nIn the mountains the traveller is always ready for his meals, but in the Glacier House the viands are so attractive that even hunger as a sauce is hardly needed. But there are greater objects of interest here than the comfortable hostelry. The Glacier is worthy of full study, and here is thoroughly accessible. Standing at the railway station, having come through the pass, we are on the west side of the Selkirks and from this point the view is entrancing. The mighty mountains make\nabout us an amphitheatre. Mt. Sir Donald, nearly 11,000 feet above the sea, rises before us. The peak is snow-clad and very bold, as the tops of all the Selkirks are. High up on the bosom of the monarch lies a small glacier. Macdonald, formerly Mt. Carroll, is before us, while on the other side is \"Hermit\" mountain, looking like a cowled monk, with his dog following. This mountain, it is said, is now called \"Tupper.\" As we gaze at the magnificent landscape, we remember that this is the head of the valley, and that the small stream that dashes past our feet is the product of the Lower Glacier, which lies embedded in the hollow of the mountains. The river was formerly known as the Moberly, but is now called the Illicilliwaet, or \"Madly Rushing River,\" and well it deserves the name. Luncheon over, a start must be made to\n\nVISIT THE GLACIER.\n\nThe nearest point of the Glacier is perhaps a mile and a half distant. It looks like a bed of snow in the lap of the lower hills. A road, winding along the river, has been cut through the forest. One feels so filled with rapture in the majestic presence of the mountains that the company of other human beings seems irksome. In climbing, however, it is a mistake to go unattended. The journey is interesting, even from the starting point of the Glacier House. In the absence of other identifications, the writer gave suitable names to the various points of interest. Passing a high mass of overhanging rock, under which is a seat for tired or idle visitors, a beautiful turn of the mad torrent of the milky glacier stream bursts upon the view. Following on a lovely dell appears, and from this, through an opening in the forest, the glacier is seen. The path winds now towards the stream, and near it is erected a halting place. Already the tourist has inscribed himself upon the posts and rails of this summer house, and some more ambitious sightseers have engraved their names upon the rafters. Immediately on resuming the journey a rustic bridge is crossed, the first over the stream we are ascending. The path then becomes more steep, an opening in the woods suddenly reveals a \"panorama view\" of the mountains and their perpendicular cliffs. The path again descends and crosses the Illicilliwaet by the \"Boulder Bridge.\" Standing on the fragile structure the stream above is seen to widen out into a dry, sandy flat, covered with thousands of rounded boulders. The path now as-\ncends still more; the blocks of solid rock are more numerous; the stream is crossed again, and here is\n\nTHE BRIDGE OF THE GORGE\n\nStanding on this the traveller becomes excited. The river dashes beneath as if possessed by all the weird spirits of the flood. Above the bridge it may be seen boiling out from a narrow channel, with huge over-hanging rocks unable to confine it. Leaving the ordinary path, a hard, dangerous climb brings to a lofty cliff overlooking this boiling cauldron. Here is the \"Grand View.\" The glacier, with its caves and openings, is only a few hundred feet distant. Silvery torrents run down the steep mountain sides before us. Close under are the moraines of the former glacier, which at one time extended far down the valley. Around the \"Grand View\" is a wilderness of enormous rocks. It seems as if the Titans had been at play and had really piled Pelion on Ossa. But nothing will do but to\n\nCLIMB THE GLACIER.\n\nA struggle through dry water courses and dense tanglewood and the foot of the glacier is reached! See the steep precipice of ice, as deep in color as green bottle glass! Ice caves run here and there into its depth. Great crevasses, like perpendicular rifts, yawn in their greediness. In the green caves, water is dropping constantly, and from under the glacier are coming countless rivulets, joining at the base of the ice to form the river of the glacier. Rocks lying beneath the weight of ice are seen crushed to fragments; others, like flat tables, are on the edges of the monstrous pile smoothed by the grinding ice as if planed by the most perfect machinery. Tons of sand and gravel are carried away by the gurgling waters, emerging like springs from the icy caves. But such tame achievements as gazing from the bottom of the glacier do not satisfy, and the climb is begun up the\n\nOLD MORAINE\n\nalongside the glacier. The perspiration, flowing plentifully as the climb is pursued, is chilled in a moment by the air of the glacier. A scanty vegetation grows among the boulders and gravel, but is all Alpine in character. The writer was at length rewarded by a top view of the lower fold of the glacier, and a foothold was gained upon the icy field. But what a waste!\nThe crevasses opened their wide jaws; the expanse is a vast snow wilderness; and the sense of solitude is oppressive. In thickness, at the point where it is most advanced, the glacier is perhaps a hundred feet thick, but as it ascends, the solid ice must reach a depth of eight hundred feet. In breadth it widens out from a few hundred feet to three-quarters of a mile at its top, and becomes lost in the boundless mer-de-glace, or ice-field which covers the mountains at a height of 6,000 or 8,000 feet above the sea level. The motion of the glacier is its most surprising feature. Several hundred feet each year it creeps down the valley like a mighty Python, and scientists have now decided that the underlying ice is viscous and pliable, suiting itself to every inequality of its rocky bed. On the high mountain tops, which feed the glacier, the perpetual snow is found, not yet turned to ice. But the descent must be made, and over the rolling stones and shifting gravels it is more difficult than the climb up had been. On crossing the front of the ice mass, and passing to the north side, and again climbing up the debris,\n\nTHE CAVE OF THE GLACIER\n\nis reached. This is a thing of beauty. It is a great cavern thirty or forty feet deep, hollowed out from the solid mass. Arched overhead, as it is, by great ribs of green ice, as the writer stood within it, gazing at the great rock which formed its entire wall, and was no doubt the cause of the cave, the brilliancy of the scene seemed to recall the splendor of the Arabian Nights' Entertainments of our boyish fancy. Not far from the mouth of the cave lay a slab of gray rock, 18 or 20 feet square, and as smooth as glass—a splendid example of glacial action. Lapping with the hand from the ice cold water—and thrice that good fortune might attend the further journey—the writer turned away with regret from the moving ice monster of the valley to attempt something higher. To explore the lower glacier had taken about three hours, and now some three thousand feet higher, on the northern horizon lay\n\nTHE GLACIER OF SIR DONALD.\n\nCould that yet be attained before night? Leaving the Illicilliwaet, the steep path was again resumed. It was toilsome work. To the right lay the glacier already explored. Though the recent climb had weakened the leg muscles, yet there lay aloft the inviting ice field of the highest peak. For a time the herb-\nage was luxuriant, and blueberries grew thick enough to refresh the traveller. Suddenly, as the path turned to the left,—a roar was heard, and\n\n\"THE OUTLOOK\"\n\nwas reached, above a sheer precipice down which a torrent rushed. But, oh! what a scene! Before the eyes were the perpendicular stone walls of what might be a hundred citadels. A dozen torrents were at once in view streaming down these rugged cliffs. The sound of many waters could be heard. It seemed a picture from a tale of chivalry. There were the strongholds and the keeps of the mighty; there the munitions of rocks. The path runs higher. At last it stops, but a way appears open, by crossing the boulders over the torrent, and gaining an old moraine, with another dashing stream on its eastern side. Now the climb was up\n\nA STEEP PENINSULA OF BOULDERS.\n\nOn resting a moment, and turning around towards the south, there was to be seen the lowering glacier already explored, its point far below. But sights of sublimity had almost ceased to impress, and the aim in view invited to renewed effort. Clambering up the stones and gravel, Sir Donald peak does seem to be nearer. Another climb and it is certainly within reach. Yet it is approaching six o'clock, and there is not a companion or a resting place nearer than the hotel, three or four miles away. Indulging in a reflective mood for a few minutes, and while taking a final view of the mountain glories, murmuring that man's chase is always after that which eludes him, the attempt was given up, at a point perhaps 8,000 feet above the sea. The descent was accomplished safely, and the writer, hungry and tired reached the hotel as the shades of evening were falling. Next day the journey along the railway was resumed. The descent from the summit of the Selkirks has a wonderful piece of engineering in\n\nTHE RAILWAY LOOP,\n\nas it is usually called. The construction is made on the principle of the threads of a screw. Far down steep gradients on the mountain sides, and crossing curved trestle bridges across the valley, the railway winds round and round. Two points of the loop, 130 feet apart, have a difference in level of 120 feet. The loop is said to be seven miles long. The Illicilliwaet that\nwe saw as a bubbling rivulet at the point of the glacier is our constant friend down the valley, augmented now by streams from every mountain side. It becomes like an old friend by and by, but it is the fierce, uncertain, turbulent river to the end. Well on in the afternoon as we haste westward, we come to a tremendous fall in the river, by which it drops 200 feet, and to a level 300 feet below the train from which we see it. This is\n\nTHE ALBERT CANYON,\n\nand we view it from a giddy height. The constant feeling impressing the traveller is one of wonder at the gigantic operations undertaken here by the engineers. Nearly 12 miles of substantial snow sheds, now almost completed, will make, it is said, the avalanches of the Selkirks harmless eddies of snow. The traveller reaches with a feeling of relief the banks of the Columbia river, having descended in the short space of 45 miles no less than 2,300 feet from the summit of the Selkirks. Here is Revelstoke, the second crossing of the Columbia.\nWestward Ho.\n\nVI.\n\nDOWN THE FRASER GORGE—THE BIG TREES—MAGIC CITY—THE CITY OF THE DELTA—THE QUEEN OF THE PACIFIC—THE PACIFIC COAST, PAST AND FUTURE.\n\nFrom Revelstoke, an ascent is made, but by an easy transit the next mountain range is crossed. The region of majestic mountain scenery is left behind. A good story comes to us here: A sight-seeing American lady, a few months ago, on entering the Selkirks on the C.P.R., asked the conductor to kindly point out the objects of interest as they were reached. The obliging official promised the matter attention. And now, after leaving the wonders through which they had passed, the cicerone asked the lady whether the magnificence of the mountains, the fury of the cataracts, or the fearful chasms and canyons of the route; made most impression on her. Ah! replied the lady, it is all very beautiful—all very wonderful! But what was most striking to you? continued the conductor. Well, if I must say, answered the prosaic, but probably practical lady: \"The most impressive sight was the snow sheds.\" A steady rise of the line carries the train through\n\nTHE GOLD RANGE\n\nto the beginning of the Eagle Pass, named, it is said, as if from a Roman augury by the railway explorers who, following the flight of the king of birds, found the route. The mention of the Gold Range brings back to mind that we are in the land of the gold excitement of 1858, of which more anon. The western ranges of British Columbia all seem to contain gold. Everywhere weather beaten prospectors, or plodding Chinamen, may be seen wandering from place to place, with rocker and camp utensils on their shoulders, looking for new diggings. Mountain sides, here and there densely wooded, show the lines of\nsmoke, where the camp of the gold seeker is \"located.\" Pack horses or mules, with their loads, are to be seen climbing steep mountain paths, crossing over to the mining camps. The Cariboo, the Thompson and the Upper Fraser are names as familiarly associated with the search of the precious metal, as even the Gold Range. And how few of the explorers find a competence! The prospector, always feverishly expecting a new turn in the wheel of fortune, after many ups and downs, generally ends his miserable life disappointed. It is today as truly the \"accursed thirst for gold,\" as when the Roman poet coined the phrase. As the Eagle Pass is descended there is perhaps\n\nTHE MOST LOVELY SCENERY\n\nof the route. The surroundings are no longer grand, but they are beautiful. The Shuswap, a tribe of Indians visited three quarters of a century ago by the fur traders, lived here, and have given their name to the lakes of entrancing beauty, from which the southern tributary of Thompson River forms. Lake Shuswap lies in the centre of an upland district of great importance. At the point where the railway crossed an arm of the lake, called the Sicamous Narrows, is the embouchure of the Spallumcheen River, which runs from the finest agricultural district of British Columbia. The writer was informed that mills of large capacity, are now being erected on this river, by which the grain produced in the district will be ground, and a supply sufficient for the whole trade of British Columbia be obtained. After touching at several points of the ever re-appearing lake, the river is next followed, and at the junction of the two branches of the Thompson,\n\nFAMOUS KAMLOOPS\n\n(\"the Forks\") is reached. We are here on historic ground. It gives a double charm to the place for the traveller to know that this was a pivot point of the old fur trade. To Kamloops came first of whitemen, in 1810, David Thompson, \"astronomer and surveyor\" of the Northwest Fur Company of Montreal, and built Thompson Fort at the junction of the two rivers now bearing his name. We could imagine the stalwart trader, described as with \"high forehead and broad shoulders, the intellectual well set upon the physical,\" standing at this now famous point, admiring the scene, and puzzling in his mind whether this was the Fraser, the Columbia, or some hitherto undiscovered river. Two years later Alexander Ross,\nafterward the well-known sheriff of Red River, established here a post for the Astor Fur Company. Kamloops has now become the ranching district of British Columbia. The variety of climate in our Pacific province is something amazing. While Spallumcheen, passed by us further up the mountains, is, as we have seen, an agricultural district, and while on the coast there is a climate rivalling that of the west coast of the British Isles for moisture, at Kamloops is a region so dry as to REQUIRE IRRIGATION\n\nfor agriculture. The moisture of the winds from west and south-east alike is precipitated on the opposite slopes of the mountains, and Kamloops is so dry that for several years together no rain falls. Through the region, however, grows the celebrated \"bunch grass,\" which, with the appearance on the outside of dry stubble, is green and fresh in the centre, even in the driest seasons. Large herds of horses from this district have already found their way over the mountains to the plains of the Northwest, and are being sold in the prairie towns of Manitoba. This upper country has been settled for twenty years by immigrants, most of whom reached the locality by following the toilsome river journey from the Pacific Coast. Hither also came many a hapless wanderer from the Rocky Mountain passes. We could not forget the arrival here in 1863 of Lord Milton and Dr. Cheadle's party in their misery: \"Our clothes in tatters, the legs of Milton's trousers torn off above the knees, and Cheadle's in ribbons, our feet covered over by the shreds of moccasins, our faces gaunt, haggard and unshaven, our hair long, unkempt and matted, and we had no means of proving our identity, where our appearance was so little calculated to inspire confidence or liking.\"\n\nBut the C. P. R. does not allow us to linger long at Kamloops. Skirting the edge of Kamloops Lake the railway next follows the Thompson, into which the lake narrows. Here the river runs through a deep canyon, and the terrific river scenery of British Columbia begins. A mountain hamlet at Spence's bridge marks the spot where the precipitous gorge is crossed by a bridge, from which roads lead to various points in the mountains. The railway follows along the south side of the Thompson, until at Lytton.\n\nTHE MIGHTY FRASER RIVER\n\nis reached, and crossed by a lofty iron bridge. Our sensations\non reaching the Fraser river were peculiar. It is as well known to us by reputation as the Amazon or the Niger. It is our great river in British Columbia, and ranks with the Colorado and the Columbia on the Pacific coast. It brings back to us a whole flood of historic memories. Sir Alexander Mackenzie saw its upper waters in 1793, and now Simon Fraser of 1806, whose name it bears, seems alive to us again. The courageous, energetic, ill-tempered fur-trader is well commemorated by this fierce, uncertain, but dashing river which has his name. He is the same Fraser who stood his trial for the attack on Fort Douglas, Red River, in which Governor Semple was killed in 1816. Fraser was a typical Nor’wester. But Fraser river is not only wonderful,\n\nIT IS TERRIFIC\n\nin its grandeur. There seems, judging by the terraces or benches, to have been a great internal lake in upper British Columbia, hemmed in by the Cascade Mountains between it and the sea. At length by dislocation and upheaval a gorge, sometimes thousands of feet deep, and here and there a mile wide, opened to allow the pent-up waters of the interior to gush forth. With terrific—no milder word will suffice—force the way was cleared and the torrent rushes howling to the sea. A canoe would be dashed to pieces in a moment in its rapids; the sheer banks afford no natural pathways along them; the Frazer gorge presents probably the most awe-inspiring river scenery in the world. Even before the days of the C. P. R., which now skirts the gorge of the river, a great engineering work had been accomplished in building\n\nTHE FRASER RIVER WAGON ROAD.\n\nThe credit of building this most useful and surprising public improvement belongs to Mr. J. W. Trutch, who fitly became the first governor of British Columbia on its entrance into Confederation in 1871. How much better to be thus remembered than for having been a successful butcher of men!\n\nThe following description of Trutch’s wagon road has been given by a British traveller: “The road, especially from below Lytton to Yale, is probably the most wonderful in the world. Cut out of the mountain side of the gorge, it follows the hills as they recede in ‘gulches,’ or advance in bold, upright bluffs in constant windings, like an eternal S. The curves of ascent and descent are as sinuous as the lateral, the road at one time\nrunning down, by a series of rapid turns, to the very bottom of the valley, and then rising as quickly to pass the face of some protruding bluff, apparently a complete barrier to all advance, but past which it creeps, looking from below like a mere line scratched on the round front, 500 or 600 feet above the river. At these points the road is partly blasted out of the solid granite rock, and the width increased by beams of rough pine which project over the precipice, but it is yet too narrow for vehicles to pass each other except at certain points. There is, of course, no protecting wall; the road overhangs the precipice, and nothing is to be seen supporting the platform on which you stand—a terrible place to drive as we afterwards found. The road has been built in this skilful and laborious manner, from where it first strikes the Thompson to Yale, a distance of nearly 100 miles.\"\n\nYale is a town in\n\nA STATE OF DECAY,\n\nhaving become a mere wayside railway station, whereas it formerly had an importance as the head of navigation on the Fraser. Following the banks of the river, ever changing vistas are revealed as the railway track sweeps around bold headlands, crosses bridges at a dizzy height, or emerges from rocky tunnels, until the lower country near the delta of the Fraser is reached. The green valley shows that the seaside moisture is here, and that the regions of drought have been forsaken. A few miles before the seaside is reached the railway is left for a time to drive across country through the\n\n\"REGION OF BIG TREES.\"\n\nThe forests of the British Columbia sea coast are amazing. Not only the height and diameter of the stately trees, but the dense jungle, impassable in many places for man or beast, the trailing mosses hanging from the branches and the luxuriant foliage betoken an exuberance belonging rather to a tropical climate than to the Canadian forest. One feels as if travelling in Gulliver's land of Brobdignag, and the sight-seer appreciates his insignificance as he looks at these monarchs of the forest that were the contemporaries of Wyclif, or were a century old when America was discovered. Chief among these forest trees is the Douglas spruce or fir—known also as the Douglas or Oregon pine. This magnificent tree reaches a height of 250 or 300 feet, and is frequently eight feet in diameter. Visitors\nto the Parliament Buildings at Ottawa may remember on the grounds, the section of a Douglas spruce upwards of eight feet in diameter. Spars 130 feet long have been obtained from this mighty tree. The lumber manufactured from this tree is reddish in color, full of pitch, heavy, and is now finding its way to the prairies on this side of the Rockies. Other gigantic trees, chiefly of cone bearing varieties, are found in the British Columbian forests, while most of the ordinary Canadian trees occur. On Vancouver's Island the traveller is surprised to see the Arbutus tree, reaching some 50 feet high, with its tawny ragged bark. Enormous wealth lies in the forests of the Pacific Province. But returning to the railway the journey is resumed to the terminus on Burrard Inlet at\n\nTHE MAGIC CITY\n\nof Vancouver. Here, where the dense sea side forest was growing untouched, but little more than two years ago, and where a year-and-a-half since was the blackened site of a town destroyed by fire, is now a thriving, bustling city of five thousand people. It is still a city of stumps, for the mere clearing of the land is a work of great difficulty. Already lines of wharves are built, alongside of which were to be seen the \"Abyssinian,\" the China steamer, awaiting her cargo, and many other vessels, while lying around the inlet are ships taking loads for South America, Australia, and the Sandwich Islands. Vancouver is very far from seeming a fairy city, for the lines of liquor stores along Water Street remind us of the baser appetites of thirsty mortals. The place gives every evidence of its recent origin. Though churches and schools are erected, and are in full operation, yet their work is evidently awaiting them. At the west end of the town a fine street is being laid out, on which are Lady Stephen's block, and other substantial buildings of stone, erected by persons more or less closely connected with the C.P.R. To any one at all acquainted with the rising life of new countries the outlines are plainly visible of a great sea port in this terminal city of the Canadian Pacific Railway. The older life of the mainland is represented by\n\nNEW WESTMINSTER,\n\na few miles distant, not far from the mouth of the Fraser River. The former centre of the Mainland Province, for Vancouver Island and British Columbia were under separate jurisdictions\nuntil 1866, was this city of the Fraser River Delta. Though not the terminus of the railway, it has a branch, and seems a prosperous town. It seems more like a Canadian town than any place on the Pacific Coast, though a little toned down by the sleepy climate of Columbia. The site of the town is very beautiful, and the trade of the Lower Fraser River agricultural settlements is its principal resource. Four salmon canneries, in or near the place, employ, it is said, 1,500 men. The public buildings of New Westminster are a credit to the town.\n\nBut now for Victoria,\n\nTHE QUEEN CITY\n\nof the Columbian coast. Commodious steamers conduct us, in six or eight hours, through the famous straits of Georgia, in view in clear weather of lofty mountains west, east and even south in the neighbouring Washington territory. Straits and narrows which abound with islets remind us of the beautiful Thousand Islands of our own St. Lawrence. At night we arrive at Victoria and find it an interesting place, with hotels unsurpassed on the Continent. The city has some 13,000 people, and is evidently the abode of wealth and luxury. Its clubs, public buildings and private residences speak of an old and organized society. One recalls with wonder the gold excitement of 1858, when Victoria in a few months became, from a hamlet of 300, a city of 20,000 people. All is quiet and settled now. The Chinese element is large, distressingly so. The air of the whole city is English and tropical. There is a dilettante air even about the business men, that in this hurrying age is rather a pleasure to the visitor. The soft, genial air of Victoria betokens a Lotus Eater's land, and were it not that the liquor dealer's trade seems to thrive too well, life would here be very enjoyable. The neighboring town and graving dock on the harbor of Esquimalt is one of the little bits of British Imperialism still remaining to us in Canada. Everyone must of course visit in Victoria the Chinese joss house, and many the Chinese theatre. The Government buildings and grounds, with the neat stone shaft in memory of Sir James Douglas, British Columbia's greatest man, must be seen. Public schools, a few churches and the cemetery are worth a visit, and the rather antiquated governor's house suggests that Provincial Lieutenant-Governors are not very well supported amongst us. The really interesting sights of Victoria are the private residences, with their gardens and beautiful flowers.\nTHE NOTABLES\n\namong the people of the Government are the Island Millionaire Dunsmuir, who controls the Island railway, an adroit and pleasant politician, Hon. John Robson, and others included under a large Et Cetera. The writer had the pleasure of spending the evening with Bishop Cridge, the victim of ecclesiastical tyranny, but a genial and interesting man. His chief sin seems to have been being too honest and too evangelical. Many more men of his type are evidently needed to lift high the standard of truth on the Pacific coast. The impression made upon the mind of the writer was that certain forms of evil have become strongly intrenched on the Pacific coast, and will need vigorous and united action to overthrow them. The story of Metla-Katla, as heard from the Bishop's lips, and obtained from works on the subject made one much dispirited, as this Indian mission, seen by so many former visitors to be a garden of Eden, was described as a desolate spot, forsaken by the Indians who have crossed to Alaska. One evening we spent with\n\nTHE VETERAN FUR TRADER,\n\nDuncan Finlayson, one of the wealthiest and best known of Victoria's citizens. Duncan Finlayson came to the coast more than fifty years ago, and has spent his life upon it. He is a splendid specimen of a Highlander. Tall and handsome, the old man is still yet of surprising intellect. He came to establish the H. B. Co. fort in Victoria in 1843, and possesses a large portion of valuable city property. He keeps it simply to \"pasture his coo upon it,\" though it is in great demand. We passed with him a delightful evening discussing British Columbia of old, and went home to the \"Driard\" to dream of the furtraders.\nOur Indians.\n\nI.\n\nPIA-POT AND MUSCOWPETUNG—FOUR DAYS' VISIT ON THE RESERVES.\n\n\"What's to be done with the Indians?\" is the question being asked by churches, the Government, by settlers who live near the reserves, and by all who love their country. Even when all are agreed as to the need of caring for the Indian, men differ in regard to how the end may be attained. The General Assembly last year thundered forth denunciations of evil agents and officials. Private individuals spoke in the same direction. The Indian officials feel sore. The Government agents maintain that wrongs which formerly existed have been set right, and that now the Indian is on the fair way to happiness and comfort. Gov. Dewdney very generously offered to transport a delegation of the General Assembly through the reserves lying along the C.P.R. The deputation came and have gone; and it is well to know what the state of the Indian is. The writer followed the deputation, being indebted to a private offer to visit the reserves on a few days' trip.\n\nWILD PIA-POT.\n\nPia-pot's reserve is perhaps the best in the Northwest for studying the effect of the present Indian policy. This wily chieftain, as most people know, was five years ago the leader of a band of Indians at the Cypress Hills, near the boundary line. He is not a hereditary chief. He was a great warrior against the Blackfeet, Sarcees, Bloods and other tribes some thirteen or fourteen years ago. By his personal prowess, and by his cunning, he gathered around him a band of Indians, so bad that they have been called \"the offscouring of the plains.\" Moreover, like the well-known Shawnee chief \"the Prophet,\" the brother of Tecumseh, at the beginning of this century, or Sitting Bull, the leader of the Sioux in later times, Pia-pot is a medicine man of his band. The medicine man, by the use\nof magic, and of ways that are dark, keeps his people under control, even though they often doubt him. It is this power that makes Pia-pot and his band so refractory.\n\nPERSONAL APPEARANCE.\n\nPia-pot is a little over the medium size, and is said to be a Cree, although from the close association of the Crees and Stoneys in this part of the country, it seems not unlikely that the chief may have Assiniboine blood in his veins. His face is a compound of keenness and duplicity. His dark eye reveals nothing. A look at his face tells you that he has an alert mind, and a pow-wow increases the impression very strongly. Pia-pot is a diplomat of the plains. He now professes to be anxious for peace. \"Many people say Pia-pot is a bad Indian,\" were the words of the cunning chief. \"They are liars,\" was his emphatic disavowal. \"Pia-pot is now living so close to the whiteman,\" said he, \"that his hair is becoming white, too.\" The chief professes himself willing to send his little boys and girls to the whiteman's school, but not those of riper years. To see and hear about Pia-pot reminds one of the wily forest leaders, such as Kondiaronk and Pontiac of the former days. Pia-pot's skill as a manager may be seen from the reception of the delegation a few days ago. All good clothing was carefully hidden away; the old chief and his band appeared, to the disgust of the Indian officials, in utter rags; they were a real beggar's brigade. No doubt the deputation wondered where all the coats and dresses, stockings and caps sent by Christian women in Ontario had gone. It was simply a ruse to extract donations from their visitors.\n\nMORALITY.\n\nThe difficulty both of the government and the church must be recognized in the exceeding immorality of this and some other bands. The very general presence of scrofula speaks of poison in the blood that cannot be mistaken. It is well known that bands formerly along the boundary line were utterly debased. This band represents the most heathen population in the Northwest, and a heathen population degraded by contact with unscrupulous and villainous whites. The faces of the women and even of the young girls, are besmeared in the most hideous manner with red lead, thus poisoning their blood.\nThe whole band adhere closely to the blanket. Pia pot evidently regards the blanket as a fetish of his people; sits at his meals with it, walks in it, rides in it, and of course, sleeps in it. A number of houses belong to the Indians. These are situated in the Qu'Appelle Valley, but the band in the summer live in their teepees. The irregular and indiscriminate lives of the families result in utter wickedness.\n\nDISEASE.\n\nVice and disease are handmaids. As already said the vices of the past two or three generations since the Crees of the plains met the white traders and whiskey sellers are visited upon the children. Diseases of the lungs are very common. Hereditary ailments and the present mode of life conspire to make this more and more the case. The writer in company with the medical man visited Muscowpetung's reserve and was impressed with the necessity of careful medical treatment of this dying race.\n\nFOOD.\n\nSo much has been said about the character of the food given the Indians that on both Pia-pot's and Muscowpetung's reserves care was taken to examine the rations given out. The flour was \"strong bakers\" and was of excellent quality. Beautiful white bread was eaten by the writer made from this flour. The bacon was of excellent quality. At times fresh beef takes the place of bacon. Certainly this must be better for the health of the scrofulous natives than salt meat. At the same time the ease of keeping the bacon in hot weather, and the less amount of work both to Indians and officials required, by the use of preserved meat, are regarded as giving at times the preference to the bacon. The fat of the bacon is also valued by the Indians in their primitive cookery. The tea was good black tea of average quality. The tobacco seemed of good quality, though the writer is not a judge. The method of checking supplies seems very complete. The agent on the receipt of supplies, gives a receipt, along with a sample of the goods received, which is forwarded to Ottawa and there compared with the standard, before the price is paid.\n\nRATIONS.\n\nThe most puzzling question of Indian administration is the feeding of the Indians. Here we are in the midst of the for-\nmer buffalo country. These Indians cannot subsist on the prairie now. The game is gone. Gophers are all that remain in any quantities. The government supplies cattle and implements. The rule is laid down that all must work. If a man does not work, neither should he eat. Very well! The more tractable are got out of their teepees by the instructors. They are given plots of ground and seed. They and their families receive food. A portion do work well. The writer saw an Indian ploughing, and his skill would do no dishonor to a white man. But what about the idlers? A lazy man always quarrels with his tools. The average Indian is lazy. It would seem then that no rations should be given the idler. But the idler is noisy. He complains of being starved. This is attributed to the shabbiness of the agent or the stinginess of the Government. Troublesome people, who have a political axe to grind, or who court notoriety, take up the lazy Indian's cause, and as the result the effort to force the Indian to work becomes a failure. The stories about the Indians being compelled to eat garbage are very misleading. Here is an instance: Pia-pot's band a few weeks ago went to a Sun dance to another reserve. They feasted as only an Indian can feast. On their way home they came upon a dead ox at a farmer's house. They got permission from the farmer to take away their prize. They had a grand feast on the decaying carcase; indeed from the nature of the food enjoyed a \"high\" time. This might easily be tortured into a \"starving story.\" The fact is the stomach of an Indian is insatiable.\n\nThe great difficulty is to raise a feeling of emulation in an Indian's breast. If some inducement can be held out to make the Indian work, and some reward given that the lazy man may in time become a worker, progress may be made. The cultivation of the idea of property is working well, though slowly. On Moscopetung's reserve are numerous cases of Indians owning three, four, five and six cattle; so on Pia-pot's. On both reserves the Indians cut and sold enough hay last season to purchase wagons for themselves. The winter saw upwards of a dozen wagons on these reserves bought in this way. Every wagon purchased, or horse or cow worked for and owned, represents just so much progress towards civilization. Patience and firmness will be needed for a few years to come, in forcing by just and cautious methods, the Indians into a state of supplying their own wants. Probably not less than three hundred acres of waving grain in excellent condi-\ntion on these reserves of say 500 Indians, and about 300 cattle, speak of the efforts towards making the Indians self-sustaining. It must be by giving, for some time, enough to keep the Indian from want, but by as rigid a system as possible, preventing him from being pauperized and made permanently lazy and worthless, that progress can be made. The writer after seeing these two reserves, feels that though the process is a slow and disheartening one, yet, that enough progress has been made in these refractory bands to give some hope for its ultimate success.\n\nRELIGIOUS TRAINING.\n\nBeyond a few interviews, no religious teaching has reached these reserves. The Presbyterian Church has taken the matter up within the past year. A missionary has been appointed. A house is now erected for him. But in this, as in farming, the progress must be slow. These Indians are superstitious as well as vicious. When it thunders they rush under cover like a herd of animals. They are having their dances every night just now. They keep their old faith and customs. The doctor was frightfully disgusted to see several men to whom he had given strong medicine in the morning, dancing themselves into a perspiration, and then becoming chilled in the night air. The dance is the enemy of health, morality and progress. The fear of magic or medicine is strong. Any disease or disaster is traced to the malevolence of the missionary or teacher. Any contact with the white teacher or missionary is regarded as dangerous. Thus the process of christianization will be very slow.\n\nEDUCATION.\n\nThe real hope of the Indian is in the education of the young. Many are aware that the writer has been for years speaking and writing against the present system of Indian schools. The miserable attendance and utter want of progress of the pupils is their condemnation. It is gratifying now to find that all along the line, both in church and government circles, \"boarding schools\" are regarded as the only successful agency. On Pia-pot's reserve, for example, for some eight months past, where there are seventy or eighty children of school age, there has been the greatest irregularity. Some days there have been fifty pupils present, some days not five. The teacher, Miss Rose, is a model teacher, and an earnest\nChristian who loves the Indian. She is the very embodiment of kindness and cheerfulness. Yet walking with her through the Indian teepees, the writer saw children scamper away in terror, being told by the vicious old women of the camp that the \"white woman\" would eat them. The building erected here by the church, with Government aid, is a capital one, and it is to be hoped will soon be made a boarding school, in time able to accommodate most of the children on the reserve. The Government now generously gives $30 a year for each child kept in a boarding school.\n\nOFFICIALS.\n\nSo much has been said about Indian officials that the writer desires to give his impressions, and for safety sake will only speak of those he has met on his present visit here. The agent, Mr. Lash, who has in charge Piapot's, Muscowpetung's, Pasquah's, and Standing Buffalo's Sioux reserve, was one of Riel's prisoners at Batoche. He has been for years among the Indians. The agent has rather a trying and unpopular place to fill. Agent Lash has checked off a number of names this year from the lists, which plainly should not have been on them for years past. It is trying for anyone thus to do his duty. He will receive criticism for it, but the Government and the country will thus be saved from imposition. Mr. Lash seems to understand the Indian question well, makes a capable and painstaking officer, and of course is greatly assisted by his nearness to the headquarters at Regina. His amiable wife, belonging to one of the best families of Ontario, is most hospitable and a general favorite. Mr. Halpin, who was present at the Frog Lake massacre, and one of the best Cree speakers met, is a clerk in the agency office, and evidently has his hands full. He is married. On the reserves visited are two farm instructors. On Piapot's reserve is Mr. McKinnon, a Prince Edward Islander, who has been many years in the country. His selection to manage Pia-pot's troublesome band shows the confidence reposed in him. He is a shrewd, capable and decided man, and has the upper hand of Pia-pot. With Mr. McKinnon is a good officer, a clerk named Marling, belonging to the well-known Toronto family of that name. On Muscowpetung's reserve the farm instructor is a young Scotchman named MacIntosh, whose tact and ability are observable at every turn. Both McKinnon and MacIntosh are married men. The physician of the reserves is Dr. Dodd, whom the\nwriter accompanied, and who seems to have gained the confidence of the Indians.\n\nTHE FUTURE.\n\nEvery official met by the writer during this visit has seemed the right man in the right place. With one exception they are married men. It is said that this is the settled policy of the Government in regard to all who have to live on the reserves. As one who has had a good deal to say on the Indian question, the writer desires to express his opinion that in the western superintendency very great difficulties have had to be met, but that patience and attention are gradually overcoming them. To a gentleman well known to early Winnipeg people, and with whom the writer has discussed the question, Mr. Hayter Reed, belongs much of the credit for the system that has been formed during the years since the disappearance of the buffalo. Mr. Reed is a keen observer, a faithful official and a man of high character. He seems to have a love for the work of elevating the Indian. For the continued advancement of the system Mr. Reed is an indispensable factor, and probably nothing would give such general satisfaction to all parties in the territory as his elevation to the position of Indian Commissioner. It is but just to say that both in Regina and on the reserves the Governor is regarded with the greatest favor.\nOur Indians.\n\nII.\n\nTHE FOUR RESERVES ON CROOKED LAKE\nVISITED—THE BEAUTIFUL QU'APPELLE\nVALLEY.\n\nTHE BEAUTIFUL QU'APPELLE.\n\nWhat a grand valley! Everyone exclaims as he arrives on\nthe heights overlooking this western river. The prairie table\nland is three hundred feet at places above the river bed. Great\nundulating banks rise from either side of the stream, those\non the south side heavily wooded by forests of poplar and elm;\nthose on the north bare and gray—an indication of the great\nheat of the summer sun on the southern exposure in these west-\nern prairies. The Qu'Appelle is a small stream winding with a\nsilvery line through the level flat of the valley. At times it\nis so crooked as to remind one of the links of the Forth as\nseen from Stirling Castle. It is to the enlargements of the\nriver in its winding course that the name \"Crooked Lakes\" is\ngiven. The undulating heights on either side are exceedingly\ngrand, though perhaps somewhat monotonous. On the northern\nside the bare, winding clay hills are not unlike those of the\nSeine as seen below Paris. At one point of this part of the\nQu'Appelle is a settlement of French people, two of the set-\ntlers, Taillefer and De Cazes, being well-known in Winnipeg\nas having been in years gone by officers in the Provisional\nBattalion. The residence of one of these families is peculiarly\nbeautiful; it reminds one irresistibly of a rural scene in\nFrance. At the base of the hill is seen a white cottage. From\nits front slopes gently to the river a green plain several hun-\ndred yards wide. For two or three hundred feet above the\ncottage rises the gray hillside. Upstream from the house and\nbehind it in the coulee is a fresh green grove of our soft maple.\nIt needs but the planting of vines along the hillside to make\nthe scene one of southeastern France. For twenty miles along\nthe south side of the Qu'Appelle in this part stretch the four\nreserves included under the Crooked Lakes Agency. The re-\nserves run for ten or more miles to the south of the river, and\nare made up of what are familiarly known on the prairie as\nbluffs. Many lakes of clear, sweet water are interspersed, and\nthe appearance is not unlike that of a great English park. If\nthe gentle spirit of nature can ever soothe the savage breast it\nought to be here. Some fifteen miles north of Broadview sta-\ntion, on the C.P.R., we came suddenly on the encampment of a\ngreat Cree chief.\n\nKA-KEE-WIST-A-HAW.\n\nHis log-house and outbuildings are on rising ground, and are\nsurrounded by a good crop of wheat and potatoes. But in the\nsummer, according to custom, an encampment is made on the\nlower ground beside the lake, and we are fortunate today for\nthe chief is at home. The day is warm, and apart from his\ntent, sitting in the shade of a cluster of poplar branches thrust\nin the earth, and on a large white robe of dressed ox skin, sits\nthe patriarch of seventy summers. As our party approaches\nhe rises and salutes us with the ordinary \"How!\" He is\nabove six feet in height, and still straight as an arrow; has a\ngood face of the ordinary Cree cast, ears pierced, hair long,\nand is fairly well dressed in Indian fashion. He is one of the\nfour Northwestern chiefs taken by Col. McDonald to witness\nthe unveiling of Brant's statue at Brantford last year. But\n\"Flying-in-a-circle,\" for so his name means, is of distinguished\ndescent. His grandfather was a Cree chief of great mark.\nHe was of such gigantic stature and great prowess that he bore\nthe name among the Indians of the plains of \"The Eagle that\nsits where he pleases.\" He was known as the \"Ostenguide\" by\nthe traders. He is most celebrated to us as the great Cree\nchief who signed the treaty with Lord Selkirk at Red River\nin 1817. Anyone looking up the treaty as given in \"Morris's\nIndian Treaties,\" will find his name there as Mache-Mkeosab,\nor as \"Le Sonnant.\" Among the Indians as well as whites it\nwill be seen that \"blood tells.\" But \"Flying-in-a-circle\"\nhaving been limited in his flight, must now get a \"pass\" when\nhe wishes to leave the agency; he has settled down with his\npeople to be farmers instead of buffalo hunters; and his band\nnow comprises 166 souls. But we must hasten on northeast\nof this point. Some ten miles away, and in the valley of Qu'Appelle, we meet\n\nOO-CHA-PE-WE-YAS.\n\nThe significant name of this chief, who has the largest band of the four, numbering 264 souls, is \"Strike-him-in-the-Eye.\" Even Indian names seem at times misnomers. Instead of a daring and vindictive chief as one might suppose, \"Strike-him-in-the-Eye\" has a most insinuating manner, and even made the suggestion to the visitors that a supply of provisions and tea would not be wasted on him. It did not, however, strike his visitors in that way, and the chief, who wore an enormous fur cap, though the thermometer stood at 90°, accepted the refusal with becoming coolness. Perhaps the most advanced band on the agency is that of Cowesis, or\n\nLITTLE CHILD.\n\nThis band numbers 155, and has at present no chieftain, Little Child having died a year or more ago. All accounts go to show that he was a most intelligent and good Indian. An old Indian official related to the writer, almost with tears in his eyes, the virtues of this deceased chief. He told of Little Child's desire to know the religion of the white man, of his going with him to service on several occasions, of the great interest expressed in what he saw, and of his determination to lead a good life. Shortly before his death Little Child was baptized by the Rev. Hugh McKay, missionary of Crooked Lakes reserve. The vacancy, caused by the chief's death, has not yet been filled, but possibly O'Soup, the chief man of the band, may succeed to the office. Our party visited his house but did not see O'Soup himself. His house and farm are worth seeing, and instead of being like those of an Indian, suggested the thought that they might belong to some one white enough to be called O'Brien or O'Grady. His two large log houses, joined together by a smaller, which served as a vestibule to both, were clean, tidy and well furnished. A splendid field of wheat of thirty or forty acres, and plot of excellent potatoes, showed the advance made by these retired buffalo hunters. The western reserve was not visited as being out of the way. It is under Chief\n\nSAK-I-MAY,\n\nor mosquito. On this reserve are 193 souls. Thus on the re-\nserves are living 778 Indians in all. They almost all live in houses. These houses are distributed through the reserves and are perhaps half a mile apart. Some of them along with the farms are in the valleys, others of the newer farms and houses are on the prairie level or \"bench\" as it is called. During the winter the people keep largely to the valley, for there much of their hay is cut, and the neighborhood seems most pleasing to them.\n\nFARMS AND GARDENS.\n\nThe great object of the Government is to turn the Indians of the prairies into farmers. Amidst many difficulties it must be said from a survey of these reserves that the work is advancing. Oxen and implements are used by the Indians under the direction of the farm instructors. One Indian, whose farm was visited, had very nearly fifty acres of wheat. It was well put in and presented an excellent appearance. It will probably yield between 300 and 1200 bushels of grain. If anyone doubts the capability of the Indian he has but to see this farm of a man who, ten years ago, lived by the chase, to be convinced. Fields of from ten to twenty acres of grain belonging to Indians are quite common on these reserves. A special feature of the Indian farms is their freedom from gophers. Many readers may know that the gopher or ground squirrel is most abundant in the Northwest Territories. At the present time much damage is being done the fields of the white settlers by this pest. On the north side of the Qu'Appelle river, opposite the reserve, was a field of ten acres of wheat, useless through the ravages of the gopher. The explanation of the absence of the gopher from Indian farms is that the Indian eats the gopher, and thus regales himself with his savory dish and saves his crops. A hint to the white settlers is sufficient! A careful computation shows that on these four reserves there are 600 acres of wheat, barley, oats and peas. One field of peas especially the writer never saw excelled. There were 800 bushels of potatoes planted on the reserves this year, and there are not less than 15 acres of turnips. The gardens of the Indians are more interesting. Not only to raise vegetables, but to learn their value and use indicate a civilizing process. Beets, carrots, onions, Indian corn, etc., are in good condition. The gardens of the agent and several farm instructors are in excellent order. Probably four or five acres of gardens in all are to be seen in the reserves.\nCATTLE, ETC.\n\nAs explained in a former letter, the Government encourages the Indians in breeding cattle and other farm animals. A cow is lent to an Indian on condition of its return, or its equivalent, in two or three years. In this way the Indian grows a herd of his own, and actually has gathered from six to ten in some cases. The Government does not assist in raising herds of horses, probably because of it leading in the direction of the old life of the plain hunters. Every reserve, however, has a plentiful supply of ponies. The following is a summation of the farm animals on these four reserves given in the order in which we have mentioned them. It is of course understood that the animals belonging to the Government are for the use of the band.\n\nCattle belonging to the Government—47, 44, 64, 32, total 187; cattle belonging to private Indians—4, 26, 68; 9, total 107; pigs belonging to Government—4, 18, 2, total 24; pigs belonging to private Indians—9, 30, total 39; ponies, private property of Indians—20, 30, 66, 20, total 136.\n\nEDUCATION AND RELIGION.\n\nThe most of these Indians are yet pagans. Every year in some part of the reserves the booth for the sun dance is erected, and these dances are attended by men, women and children. This is a religious festival. It is connected with certain cruel rites, and is under the direction of the medicine men, or priestly class. There are a few Roman Catholics on one reserve, also a priest and a teacher. The school is a day school, and has but a small attendance. The scattered character of the people and the determination of the Government to isolate families as much as possible, renders the public school house here, as elsewhere, an impossibility. A couple of years or more since, the Rev. Hugh McKay, a missionary of the Presbyterian Church, took up his abode on the borders of these reserves. He has already obtained a great influence over the Indians. He had been for some time laboring in Manitoulin Island, and had become somewhat familiar with Indian ways. Of a quiet, decided disposition and a very kindly manner, he seems just the man to lead the poor savages in the way of truth. To Mr. McKay belongs the credit of reaching what seems to be a solution of the school question.\nis already known far beyond the limits of the Crooked Lakes reserves. Erecting a small mission building, Mr. McKay took a few of the children into his home and gave them such accommodation as he was able. Being himself a trained normal school teacher, he soon got a good hold of the children, and has in the short time of his residence gained a good knowledge of Cree. Last year he obtained the assistance of Mr. Benjamin Jones who has had much experience in the Northwest, and whose wife, a sister to the late Methodist minister to the far west, Rev. George McDougall, feels herself bound to carry on the work in which her deceased brother fell. Messrs. McKay and Jones fell to work with their own hands and made an addition to their building a year ago which enabled them to accommodate 33 pupils last winter. Encouraged by his success, Mr. McKay appealed to the christian ladies of Ontario, and the result is that $3,500 have been from different sources put at Mr. McKay's disposal for further addition. The addition will far exceed the original building. In two or three months from now will be completed a\n\nSUBSTANTIAL PILE OF BUILDINGS\n\nin which fifty pupils can be trained, and the plans seem to promise a most admirable building. It is built on a deep stone foundation, will be heated by hot air, and be a model school in many respects. Mr. McKay began this work largely at his own expense, his salary only being paid him by the church. Christian ladies in the Eastern Provinces have supplied clothing in large quantities. The expense of keeping fifty pupils will be considerable, and it is very pleasing to note that the Dominion Government has been so impressed with the value of this experiment that there has been an allowance of $30 a head for fifty pupils placed in the estimates for next year. Mr. McKay is determined to persevere until he has an institution large enough to hold all the school children on his reserves, say 120. Extensive stables are being erected to show the young Indians the proper care and management of cattle and horses.\n\nTHE OPENING\n\nof the new building will soon take place, and as much interest is taken in the school in the whole surrounding country, it is expected to be an event of importance. The school is situated\nat the eastern end of Round Lake, one of the lakes of the Qu’Appelle river, and the view from the door of the school up the lake is most beautiful. The good already done by the school is surprising. It is now holidays, but on our visit to several houses we saw children well dressed, clean, and with hair combed, and on enquiring found they had been pupils last winter at the school. Stopping to ask our way at the house of “Striped-Back,” a noted conjuror, a fine lad of thirteen came to our assistance, well dressed and intelligent. Though his home is the abode of superstition, and on the bushes and trees about it were to be seen strips of cloth of various colors floating as the offerings to the spirits, yet it is quite plain that two or three years at “McKay’s school” will give him a truer and nobler faith.\n\nTHE OFFICIALS.\n\nOne chief object of these visits is to see the officials about whom there has been so much talk. On Reserve No. 1 the instructor is Mr. J. Nichol, formerly instructor at File Hills. He is from Wentworth county, Ontario, was brought up a farmer, and is a young, active and suitable man. He had the misfortune to lose his wife last year. Mr. J. Coburn on Reserve No. 2 was the one not seen by us. He is a young married man and has an excellent reputation. Mr. J. Sutherland is instructor at No. 3. He was for some years in the mounted police. His wife is an excellent tailoress and can be of service to the Indians. Mr. Sutherland himself is not only instructor but can do blacksmithing, carpentering, and is acquainted with the veterinary art. The broken plows and other instruments brought in to be mended might have alarmed Vulcan, the god of smiths himself. The instructor in No. 4 is Mr. E. McNeil, a young Canadian farmer from the Ottawa. He has no wife, but like the few remaining instructors unmarried, has received his notice from the Government. He is a capable instructor, and has the largest band. He will, no doubt, qualify before his time expires.\n\nTHE AGENCY.\n\nIt would be Hamlet with Hamlet left out were we to close without reference to the veteran Indian agent, Col. Allan Macdonald, who has been a most valuable and popular officer in originating the present Indian system. Old residents of Winnipeg will remember him as an officer in the Provisional Bat-\nCol. Macdonald is a son of Archibald Macdonald, of Glencoe, whom all acquainted with the Selkirk colony will remember was one of Lord Selkirk's most trusted agents, and wrote a pamphlet with an account of one of the expeditions. After forty years of service in the Hudson's Bay Company he settled at St. Andrews, on the Ottawa, in Lower Canada. Although we found Col. Macdonald's good wife away on a visit to the East, the Colonel lives at the agency in good old Hudson's Bay Company style. He understands the Indians thoroughly, is very anxious for the improvement of the Indians in all respects, is a good friend to the missionary and the teacher, and possesses the confidence of old and young on the reserve. It was a pleasure to go on our long rounds through the reserves, accompanied by the agent and his clever son Archie, a lad of twelve, who jabbers Cree with any native and acted as interpreter. The official interpreter is an Indian from Oxford House, named Geddes, who gave us much information. The agent's assistant is a most interesting young man named McNeil, from Prince Edward Island. His books, papers and official documents were in capital order, and we gave them a thorough overhauling. Our return was made to Broadview in a hurry to catch the west-bound train, and if we dream to-night of Indians and instructors it will not be surprising.\nOur Indians.\n\nIII.\n\nTHE ASSINIBOINES ON HURRICANE HILLS—HUNTERS BECOMING FARMERS.\n\nINDUSTRIOUS INDIAN WOMEN.\n\nThe last few years have seen a great increase in the number of Indian agents and other officials. Before the necessity of having such close inspection of the Indians seems to have dawned on the Government, the intention appears to have been to have a central Indian agency for what now constitutes the five agencies in this district. Indian Head station on the C.P.R.—where the well known Bell Farm is situated—appears to have been headquarters, and probably the fact stated is the origin of the name. Around this point at considerable distances lie the four reserves of the Pia-pot group, the four reserves on Crooked Lake, the four reserves of the File Hills Indians, the three reserves on Moose Mountain, and the reserve for the Assiniboine tribe on Hurricane Hills. In former letters we have described the Pia-pot group under the supervision of agent Lash, and the Crooked Lakes agency under the care of Col. McDonald. Arrived at Indian Head it was determined to visit the Indians of the Assiniboine tribe under agent Grant. In company with a student of Manitoba College, who is doing good service as a missionary to the white settlers of Indian Head and vicinity, the writer started for a drive of twenty miles or more to the south-east of Indian Head. The trip, taken in the fresh morning air, and over the fine rolling prairie, redolent with flowers, was delightful. The Jehu, in addition to being a good missionary, is a capital horseman, and had himself broken in but a few weeks before the fine broncho mare, imported from British Columbia, which carried us like the wind to our destination. Half way to the reserve was encountered at their residence on a bleak hill a family which had been sufferers by the Glasgow Bank failure. In former days they had been in the habit of going off to the\nMediterranean in their private yacht; today they were about to visit a point a few miles distant to gather Saskatoon berries—the insipid fruit of the Amelanchier Canadensis. Mus-ing on the ups and downs of life, we hastened on from the prairie home of the lady related to the British nobility, to visit on the reserves some of the original settlers—indeed, the very \"old families\" of the country. The agency reached we received a very cordial welcome from Mrs. Grant, the wife of the agent, her husband being absent in Regina on Indian business. The assistant and interpreter, Mr. A. W. Taylor, a young Englishman, the son of a clergyman in England, placed himself at our disposal, and we drove three miles further on to the\n\n**INDIAN VILLAGES.**\n\nWe have seen nothing like this on any of the reserves previously visited. Here within an area of perhaps a square mile are the log houses—substantial erections capable of sheltering the band which consists of 250 men, women and children. A winding ridge is chosen as the situation for the houses, and the arrangement would baffle Hausmann, the great Parisian engineer, or the original planner of the streets of Boston, to discover. But here there are 69 log houses and 23 stables, and it is to be presumed each one knows his own, though there is no street nor number. The site of the village is at this season rendered picturesque by the canvas tent pitched in the neighborhood of nearly every house, for Assiniboine or Cree must take to his teepee in the summer time, however much he may not disdain the shelter of the comfortable log house in winter. As coming on a diplomatic mission we immediately drove to the teepee of the chief\n\n**CHU-ICK-KER-NUCK-A-ARGO.**\n\nIt is no wonder that for convenience sake the English people should choose a shorter name, but they have certainly gone to the other extreme in addressing his chieftainship as \"Jack.\" The translation of his Indian name is \"The man who took the coat.\" We entered the teepee of the chief, and found him sick. He is suffering at present with a severe attack of sciatica. Lying on a rug on one side of the tent he was covered with a blanket, and the significance of his Indian name was not at all evident, as he was \"sans coat, sans shirt,\"\nsans everything.\" He had been rubbed all over by the medicine men of the tribe with a mixture of white clay, but had also received a prescription from the Government doctor. Though it is dangerous to hazard an opinion on an Indian's age, I should think Chief Jack could not be much above 40. His two wives—sisters I am told—were in the tent ready to fetch or carry at the behest of their lord. An hour or two after we had an opportunity of seeing Chief Jack up and dressed, and he is a tall, handsome Indian, with a good face of the decided Sioux cast. As already stated, his band are\n\nASSINIBOINES.\n\nReaders may be aware that the meaning of the name is the \"Sioux of the Stony river,\" referring to the tributary of the Red River so familiar to Manitobans. This river seems in old times to have been the boundary line of the Crees and the Dakotas. But many years ago, before the coming of the white men a fierce feud arose among the Dakotas, or allies as their name implies. This took place on Lake Traverse, the headwaters of the Red river. An Indian Paris stole a dusky Helen, and the rescuing husband was killed in the tent of his rival and in the presence of his faithless spouse. The tribe, the Yantons, divided in consequence, and thus originated the Assiniboines, who held the northern limit of the old Dakota territory. Always at deadly enmity with the remaining Dakota or Sioux tribes, the Assiniboines or \"Stonies\" as they are familiarly called, made alliance with the Crees, and numerous intermarriages have taken place between the Crees and Stonies. Visitors who have seen the mission of Rev. J. McDougall at Morleyville, some forty miles west of Calgary, in the Rocky Mountains will remember that they are Stoneys, and that they are so well acquainted with the Cree language that the missionary can address them in that tongue. The Stoneys are now but a remnant of a great people. At the beginning of this century Alexander Henry, whose manuscript journals may be seen in the library at Ottawa, gives a census of the different bands of the Assiniboines and their places of residence along the Assiniboine and Saskatchewan rivers, and shows them to have numbered at that time several thousands.\n\nPECULIARITIES.\n\nLike all the Sioux people they are a tall and handsome race. Their faces have more shapely cut features, and are not\nso broad or coarse as those of the Crees. Having been absolute plain-dwellers they subsisted even more completely than the Crees upon the buffalo. The present band formerly lived in the Fort Walsh or Maple Creek region—the very heart of the buffalo country. It has been a tremendous wrench, that we whites can hardly appreciate, to give up the free life and fresh buffalo meat, and settle down to the restraints of a reserve, and salt pork as a diet. The writer is assured by the Indian authorities that this tribe is dying off very fast. Under the circumstances it can hardly be otherwise. We were glad to learn on this visit that fresh meat is being supplied this summer. The contractors are usually required to deliver the beef cattle on foot on the reserves, and it is said that the offal is more appreciated by the Indians than even tenderloin or Porter-house steak. This may improve their health, but the prevalence of disease among the Indians is so common that their\n\nDEATH RATE\n\nmust be very high indeed. As to the question of the increase or decrease of the Indians a great deal is said apart from the facts. The statistics published from year to year in the blue books are misleading because other elements enter into the case. For example transfers take place from one band to another. The treaty payments also have developed cases of fraud among the Indians. It is found that some bands have been claiming numbers in some cases ten or twelve per cent higher than the actual numbers of the band. Indians are said to have gone so far as to lend children to one another, on whom to draw treaty money. Under these circumstances, perhaps unavoidable, it will be seen that to draw general conclusions from the figures of the blue books is quite valueless. The change from their mode of life, their fondness for unwholesome food, their filth, disease and degradation, are in the opinion of those most capable of judging, resulting in the rapid diminution of our Northwestern Indians. That a point may be reached where the diminished remainder, christianized and civilized, may, under happier circumstances, begin by and by to increase is of course quite possible.\n\nIMPROVEMENT.\n\nThat a certain amount of progress is being made on our Indian reserves is, however, evident. On this reserve the\nhouses seem well kept. Though unoccupied for the summer they had been cleaned in most cases when their owners went into the teepees for the summer. The chief's house was as large and well arranged as an ordinary half-breed house on the Red River. We unrolled a carefully fastened package to find it a diploma from the Colonial Exhibition to the chief for farm specimens forwarded from this reserve. First prize show tickets—a handful of them—for various articles given by the local agricultural societies showed that Chief Jack is enterprising. The wife of the former teacher, Mrs. Scott, taught the Indian women a number of useful arts. We saw excellent bread—white and sweet—baked by the Indian women themselves. In one of the houses a commodious brick oven has been built and this is freely used by the several families in their baking. Butter is also made by the more thrifty of the women.\n\nKNITTING.\n\nThe most remarkable feature of an industrial kind on this reserve is the large amount of knitting done. Indeed for the last year a sort of knitting epidemic has been upon the reserve. Like their Sioux relations, the Assiniboines are more easily taught industrial arts than the Crees. Old visitors to Portage la Prairie will remember how expert with the axe, the hoe, and in general housework the Indian women can become. But the knitting tendencies of these Assiniboines are phenomenal. Even the \"braves,\" deprived of their accustomed journey on the \"warpath,\" have settled down to knitting. The contract for supplying the industrial schools throughout the territories with mitts and gloves was this year given to this reserve. We saw about a bushel and a half of mitts and gloves all knitted by these Indians, in the hands of Mrs. Grant, the agent's wife. They were of every variety of color and size. In some cases the gloves had the fingers well formed, and all that seems necessary for the Government to do is to furnish the pattern, and the work will be done. In some cases we saw yarn being used of a bright red color, dyed by the women by the help of the roots of plants found by them on the prairie. The Government buys the mitts and gloves at the rate of twenty-five cents a pair. Stockings and scarfs of somewhat complicated structure are also being made by these expert Assiniboines.\nFARMING.\n\nThe village system of this band is somewhat objected to as unfavorable to farming. It seems easier to induce those living, say, half a mile apart, to work than those living together. It is a considerable distance to the field, and the pleasures of society are too great on a hot day to be resisted. However, a good deal of farming is being done. A field of wheat of forty or fifty acres, the joint crop of four or five Indians, was certainly the finest field of grain seen on this western trip. On this reserve there are 250 acres of land broken, and 205 under crop, made up as follows: Wheat 77, oats 22, barley 16, potatoes 47, turnips 35, carrots 5, gardens 3. The crops looked very well.\n\nCATTLE.\n\nFor some reason or other the Assiniboines do not seem to take to stock raising so well as the Crees. The following are the numbers on the reserve: Belonging to Government (for the use of the band), oxen 14, bull 1, cows 8. Belonging to the Indians themselves, oxen 4, bull 1, cows 9, steers 10, heifers 6, calves 10.\n\nSHEEP &c\n\nThe only sheep seen on the reserves yet visited belonged to this band. After the rebellion two years ago, the Government rewarded the loyalty of \"Jack\" and his band by the present of a few sheep. The sheep have thriven, and now number 31. On a reserve still largely covered with bluffs, thus sheltering wolves and foxes, and in an Indian camp with its countless dogs, the life of a sheep is precarious. The Indians have, however, built a fine enclosure, into which the sheep are driven at night, and even at noon. It speaks well for the care taken that only two or three have been lost by dogs or wolves. The sheep are in excellent health. Eleven pigs also hold their own on the reserve, and it is to the credit of the women that large numbers of poultry are kept.\n\nTHE SCHOOL.\n\nA short distance from the village is the log school house, and near it the teacher's unpretentious residence. The conditions of village life are more favorable for the carrying on of a day school than on the other reserves, where, it will be remembered, we stated it was impossible to make it successful.\nThis band has only been five or six years settled here, the children are quick-tempered and suspicious, and, according to Indian custom, anything like severe discipline will be at once resented. Our party visited the school. It has only been a year and a half in operation. Its present teacher is Mr. John McLean, who is a capable teacher of 2nd class grade in Manitoba. There are 35 scholars on the roll. The average attendance for the last quarter was 12. On the day of our visit there were 14 present. For the time of berry picking and gardening this is not a bad attendance. We heard the highest class of two pupils recite. One of them, a Sioux boy of 12 or 14, read and spelt very fairly. The present teacher has been for more than half a year in charge, and is obtaining an insight into the ways of the Indian.\n\nOFFICIALS.\n\nMr. W. S. Grant, the Indian agent, was, as already said, away from home. From enquiry, we found him to be a capable man, having considerable knowledge of botany, and seemingly on good terms with the Indians. Mr. Grant is an Irishman, and has lived a number of years in the London district in Ontario. We were entertained most hospitably by Mrs. Grant, and had opportunity with our strong \"prairie appetites\" of appreciating what can be produced on an Indian reserve. Mr. A. W. Taylor, the assistant and interpreter, who accompanied us and gave us every information sought, has been with the Assiniboines since their settlement. We reminded him that we understood it was the Government policy that all officials should be married men. He acknowledged that he had received such information from his superiors. It is the writer's opinion that this should be rigidly insisted upon. Another employee on the reserve as farm assistant we did not see, but he is a married man. We made the usual examination of flour, pork and other government supplies given out as rations, etc., and can speak most favorably of them.\nOur Indians.\n\nIV.\nTHE OJIBWAYS OF OKANASE—SAULTEAUX WITHOUT FARM INSTRUCTORS AND RATIONS—INDUSTRY AND RELIGION.\n\nGoing up the Manitoba & Northwestern Railway from Portage la Prairie for 106 miles, and passing Gladstone, Neepawa and Minnedosa on the way, Strathclair station is reached. A Hudson's Bay Company officer from the far north is with us, coming to see an old friend settled in this part of the country, and we are met at the station by the veteran Indian missionary, Rev. Geo. Flett. Six or eight miles of a drive to the north brings us to Strathclair village on the Little Saskatchewan river. Here as the bank is reached a beautiful prospect lies away to the north in a pleasant valley. The morning air is delightful, and amid the sweet odors of prairie flowers and scented grasses, it is a most captivating spot. The herbage is wonderful in its extent and verdancy. One is at a loss to know why the Canadian Pacific Railway was diverted from this route, and old-timers are tempted to stand up for what later explorers tell us is a myth—the existence of a fertile belt, running away to the Northwest. One of the best tests of a good locality in the Northwest is the plentifullness of\n\nPRAIRIE FRUITS.\n\nHere the abundance is surprising. The strawberries, though earlier, are prolific here as the settlers' tables bear evidence. The Saskatoon berries are past their best also; but there are acres and acres of cherry trees. Three varieties of cherry are found—the choke-cherry, a small red cherry, very pleasant, and a still larger red cherry. Black currants are plentiful and of large size; the wild gooseberries are ripening. The high-bush cranberries, or Pembina berries, are found in abundance. Here is certainly a garden of delights! The Rev. Geo. Flett, some thirteen years ago, selected this as a spot for a mission, as he had several years before chosen Prince Albert among the\nCrees near Fort Carleton. The mission premises and the Indian reserve are two or three miles up the valley from the bend where the river is first reached. Through the midst of the valley runs the Little Saskatchewan, or Rapid River, over a pebbly bottom. It is a mountain stream rising in the Riding Mountains; its water is clear, cool and refreshing. In this part of the valley is a vast expanse of grass, being made by the Indians into hay. On the further side the banks are heavily wooded by the ordinary trees of the country, though at places traces of the fires of last year are seen. Within an easy compass are here supplied the trio for supply of the wants of man and beast—wood, water and hay. As we go up the valley exquisite building sites appear among the bluffs and woods in the western heights, and on approaching one of the most beautiful of these we learn that here is\n\nOKANASE,\n\nthe mission house for the reserve. Lying to the north of this along the valley is the Indian reserve. The people are wood Indians rather than dwellers on the prairie. They are Ojibways, and we have seen their race on Georgian Bay and the Manitoulin Islands; we have met them at Michipicoten and along the north shore of Lake Superior; we have mingled with them on the Rainy River and about the Lake of the Woods. It was by coming westward in this course from Sault Ste. Marie that these Indians got their name among us of Saulteaux. Of course as in all cases west of Winnipeg there is a Cree intermixture with the Ojibways. The band is said to number 235, but this seems to include a number of hunting families, which still roam through the unoccupied country to the north, and now and then appear on the reserve. Greater efforts should be made by the Government to induce these wanderers to settle. Perhaps 130 to 170 would represent the real population of the reserve. The band seems all descended from one recent ancestor, and Okanase—Ojibway for “bone”—is the family surname. Accordingly on the reserve the difficulty is as great as the endless repetition of Mackenzies and Macdonalds in a Highland settlement. Ethnologists who make so much of names are warned to be on their guard here. The missionary’s assistant bears the family designation, and retains the name, George Bone, which the writer saw him receive on his baptism ten years ago in Knox church, Winnipeg. To the family of the\nor Sky Man, has been given the honored name of Burns. Another family of the Bones are now known as Ross. We met another young man named George Flett, and so on. The Chief is a fine looking man, and is one of the last to receive Christianity, though his wife and twelve children are sent regularly by him to church, and his younger children to school. We visited Sky Man's house and found it a substantial log house 18x22 ft., the roof and gavels well shingled, and this all done in a workmanlike manner by the Indians themselves. This is the new house; beside it stood the former house of about equal size and still in good repair, which will be used as a kitchen. The house is two stories high, and both ground and first floors are well finished with good lumber. A field of grain of some five or six acres was near by, but the Indians are moving their farms up on the \"bench,\" i.e., the hilltops above the valley, the ground being more fertile, and the grain ripening earlier. According to Indian custom the houses are almost all empty at this season, and the summer is passed in the teepee or tent erected alongside the house, or in a camp in the middle of the reserve. As we drove through to the upper side of the reserve, the farm was reached of\n\nA FIRST CLASS INDIAN FARMER.\n\nThe owner was away from home, being encamped with his family alongside the meadow where we saw him, making stacks of hay. His house is 20x18 feet, with an addition of the same size nearly finished. The buildings are of log, with well shingled roofs, and all done by Indian labor. On looking within they were seen to be plainly, but well furnished. A cooking stove, box stove, tables, cupboard and dishes were all there. A short distance from the house are the stables and sheds of this careful farmer. His implements are well protected under cover; he owns a mower; we saw two pairs of sleds for winter use, made by the farmer himself. The farm consisted of 30 acres under crop, of oats, barley, potatoes and turnips, with a good garden. Here the Indian farmer is seen without the stimulus of the farm instructor. The large amount of hay already in stack shows that cattle and horses abound on the reserve. The cattle are the product of two cows given some years ago by the Government to the reserve. Several pairs of oxen have also been provided by the Govern-\nment. Being desirous of showing the condition of the Indians, the missionary had made arrangements for\n\nAN INDIAN MEETING\n\nin the church to greet the visitors. The church is a neat building capable of holding 70 or 80 people, is well seated, and a few months ago the Indians on their own motion, in the absence of the missionary, erected around it a substantial paling, with gates, presenting a neat appearance. The meeting was held at six o'clock, and though the urgency of the having season prevented a number of the men being present, the audience, which included a few whites, numbered between 50 and 60, and but for the busy season would have contained twenty more. The singing at the service was in Indian. It was inspiring to hear the Psalms in Indian sung to \"Dundee's wild warbling measures,\" or \"plaintiff's Martyr's\"; and to listen to the men, as well as the women, singing with good voices. An address was given through the missionary as interpreter, which was received with attention. It was with satisfaction the dusky audience heard their condition compared with that of the Crees and Assiniboines, who had lately been visited, and that the white man had stronger love than ever for the loyal Indians, who had stood true to Canada in the late Riel rebellion. At the close, the Indian children present, who were sitting in the front of the audience, sang with great sweetness and correctness a number of Moody and Sankey's hymns, in English. The whole service was conducted with as much decorum and attention as could be seen in any English-speaking congregation in the country.\n\nPRESS AND APPEARANCE.\n\nIt is well known that christianity changes the heathen and makes them sit \"clothed and in their right mind.\" The Pagan Indian clings to his blanket as a mark of his heathenism, and refuses to cut his hair. We did not see an Indian wearing a blanket on this reserve. Men, women and children were all well dressed. The Indian women make their own clothing, and are good knitters and workers. On approaching the church the women had over their heads the black shawl so common, especially among the French half-breeds, but in the church sat with uncovered heads, and were neat and comely. The whole congregation would have passed for a respectable\nhalf-breed gathering on the Red River. The appearance of the people betokens good health. The scrofulous appearance so common on the more western reserves is entirely wanting. The writer was informed that there was an almost entire absence of those diseases resulting in scrofula. The quiet respectful demeanor of the people was noticeable. On enquiry it was found that there seems to be a small increase among the Okanese Indians; but the deaths are so nearly equal to the births, that the population may at present be set down as stationary. The past year has, however, been one of healthfulness, so that covering a number of years, and considering the probability of greater death through epidemics, the case will not stand so well.\n\nEDUCATION AND RELIGION.\n\nA short distance up the valley from the church is the Government school, a comfortable log building. The teacher is Mr. Lauder, a married man, and he has for a year past held this position. The wandering character of a part of the band makes it impossible for a number of the children to attend school. The attendance of the resident children seems fair. During the past quarter there were 27 on the roll, with an average of 19. In addition to the biscuit allowance, Mr. Lauder has given, through the means of a donation of a friend to the school, flour for breakfast and supper to those children attending. During last winter something approaching the boarding-school system was adopted in the case of a number of children; but both missionary and teacher are in favor of a more extended experiment. Between this reserve, with its wandering families, and the two reserves, of which we shall speak, under Mr. Flett's care, there are about 70 children of school age. The proposal of erecting further premises, as was done in the McKay school, and getting in the children from a distance seems the only one that can result in the general education of these bands. It being holidays we had no opportunity of seeing the school in operation. Reference has been already made to the steady and religious character of the people. The ringing of the church bell brings with great regularity a good sized gathering at all times. The people are moral and respectable. There is not a case of polygamy upon the reserve, though as is well known, polygamy is the rule rather than the exception in the reserves lately visited. The writer heard of no drunkenness on the reserve. The distance\nfrom any large business centre is a point in favor of any Indian settlement.\n\nTHE VETERAN MISSIONARY.\n\nThe missionary, Rev. George Flett, is well known to many readers. His wife is the last survivor of the children of the late James Ross, whose family has been one of the most influential of the old Red River families. Both the missionary and his wife seem equally adapted for their work. He has a knowledge of Cree and Salteaux, and French and English, but is especially a master of the Indian tongues, and has great eloquence in their use. Many may remember that in the interesting articles by Mr. Coldwell in the Winnipeg Free Press Mr. Flett was seen to have been a man of action. The Indian, to have influence among his people, must be an orator. From different sources the writer has heard that the missionary Flett is ready in argument or debate, for Pia-pot or any of them. An instance of this was seen two years ago at the time of the rebellion. Mr. Flett was for six weeks among the Fort Pelly Indians keeping them quiet. One evening the news came that the rebels had driven the English troops back, and the story was in the most exaggerated form. One of the chief's sons gave the war-whoop, and cried out, \"Our people have conquered the English soldiers,\" and proposed to go on the war path. The missionary rushed to the front and said \"What simpleton gave the war-whoop? Who will be fool enough to go against the English? Why, the English, if one party is killed, will send in another, and if these fall, another; they will swarm in upon you. And they don't need to be in a hurry. They can seize the passes, keep out any food, and, without shooting one of you, starve you to death like rats. They have food and powder. They can wait till you are all dead and never fire a shot.\" And, so on, with his native eloquence the loyal missionary was listened to rather than the fiery braves. The missionary's wife is helper of her husband in translating the psalms and hymns, in leading the singing, and showing the Indian women the arts of civilization. The advanced state of these Indians has been gained with\n\nNO FARM INSTRUCTORS.\n\nThe missionary has been interpreter, farm instructor, and foreman in building operations. The father of the missionary was an old Orkney settler on the Red River half a mile north of\nthe railway track in Winnipeg. He had six sons, and old Red River settlers have seen these six sons mowing their six swaths side by side with the scythe in the old days. Expert in the use of the farm implement and the axe, the missionary has instructed his Indians with the results named above. While being their Christianizer he has also been their civilizer. Thirteen years ago they were as wild and unpromising as any band on the western reservations; today they are what we have seen. The nearest Indian agent is forty miles distant and he has a number of other reserves. The credit must belong to the missionary. The Government has been saved the enormous expense that is being incurred further west. Here, too, the Indians are self-supporting. The church, it is true, has for several years sent large supplies of clothing which have been invaluable to the people in the \"cold and cruel winter,\" but no Government rations are supplied, and the pauperizing tendency is thus avoided. It is, of course, to be remembered that here near the hunting grounds of Riding and Duck Mountains the condition of the Indians has not become so changed as further west on the prairies where the buffalo has become extinct.\n\nNEIGHBORING RESERVES.\n\nThe two neighboring reserves of Rossburn and Rolling River have been placed under Mr. Flett's care. The wandering character of the Indians is an obstacle to be overcome in these cases. The writer has seen for weeks past a considerable part of the Rolling River Indians encamped on the outskirts of Minnedosa. There can be little progress while this wandering habit is maintained. The missionary can gain no control over them. They come in contact with the worst of the whites, and become utterly debased and degraded. It is not for the writer to suggest a remedy. The Government is responsible, and some steps should be taken to induce the bands to remain at home. The churches are anxious to Christianize and educate the Indian. This cannot be done so long as he is a rover. It is not enough that he is peaceful just now. The Riel rebellion showed that in the ratio in which the Indians were Christian were they safe for the country. The heathen or superstitious Indian is the plaything of every schemer. The Rossburn reserve, which is 30 miles west of Okanase, is said to contain 170 souls, while the Rolling River numbers 101. Thus there are connected with these reserves\nsome 500 men, women and children, of whom a good nucleus have been Christianized and civilized. This is the ground on which the church and Government may co-operate most heartily in the work of education, religion and civilization.\nOur Indians.\n\nV.\nTHE SIOUX RESERVE ON BIRD-TAIL CREEK—NOTES OF ADVANCEMENT.\n\nTHE INDIANS TAKING KINDLY TO THE CULTIVATION OF THE SOIL—BEAUTIFUL BIRTLE.\n\nGentle reader, as the last century writers in their affectionate manner used to say, were you ever among the deep cut valleys and picturesque coulees of Northwestern Manitoba? These are the Manitoban highlands! Here you have reached the second great steppe. After you have travelled the length of the Manitoban & Northwestern railway and reached this point some 185 miles northwest of Winnipeg, you will find yourself discussing with your fellow-passenger the comparative merits of Minnedosa and Birtle valleys. Fourteen years ago the writer was shown a vertical section of this region by one of the early exploring engineers of the first Canada Pacific railway, and these deep valleys of the second prairie level gave it the appearance of a saw-edge. It was then said that it would take nine miles of a circuit to cross the Minnedosa valley; and this feature was given as a reason for diverting the C.P.R. railway to the present southern route. But what the Northwestern has lost in railway engineering it has certainly gained in beauty. The Bird-tail creek, which has been softened in the name of the town into Birtle is here narrow, but its banks give a good climb of 150 or two hundred feet. Having clambered to the eastern cliff let us turn and look at the picture before us. Up and down in the distance may be seen the heights of the winding banks. On yonder high hill is the pretentious residence of a former member of parliament of the district. It has a considerable tower and on the top a flag staff from which on festive occasions its master’s banner floated. The house is somewhat falling to decay and is a picture of deserted greatness, “Sic transit gloria mundi.” Further up to the right is railway hill, while the station and other buildings are half a\nmile from town. Running through the valley is the small stream, but here spread out into a fine sheet of water, relieving the scene and serving the useful purpose of driving the mill, which soon will be hard at work in grinding the abundant grain of Birtle district. Some of the buildings of the town are of stone, but most are wooden, and in some cases attention has been paid to tasteful ornamentation. Two or three neat, newly-finished churches give some indication of the hopes of the town, while half a mile down the valley is the public school building of some size, whose location shows a desire to give the rising generation plenty of exercise in reaching it. Birtle has a number of very energetic and enterprising inhabitants and they are justly proud of the town and its vicinity. But we have a good journey before us today, and so, under the kind guidance of Rev. W. Hodnett, who is an old inhabitant of the district, we are soon on the way for some ten or twelve miles to the\n\nBIRD-TAIL SIOUX RESERVE.\n\nThe herbage is most luxuriant; the bluffs give a park-like appearance to the scene; we pass the Blenheim school house, a dark painted and somewhat uncommon looking building, which a local Irishman described as the educational \"simiter\" of the locality, and amid ripe wheat fields reach a beautiful sheet of water known as \"Hooper's Lake.\" This is a large lake of sweet water, and as we refresh our \"Rosinante\" from its waters we see the fine sandy beach covered with a great variety of pebbles, contrasting with the miry margin of reeds so common in the prairie ponds and lakes. A most delightful morning drive brings us to the reserve, which is situated at the junction of the Bird-tail with the Assiniboine. Here the scenery is grand; yonder is the great Assiniboine valley, and we can see the buildings adjoining the well known old Fort Ellice, near which the Qu'Appelle joins the Assiniboine. The confluence of the Bird-tail and the Assiniboine lying several hundred feet below us, is well wooded with soft maple and elm, whose leaves give a beautiful contrast. The winding coulees and ravines suggest localities for robber hordes or illicit stills such as were once found in the Scottish Highlands, but probably the travellers here are not worth robbing, and the Indian is not allowed to participate in the mountain dew. Here is laid out a reserve of about one-third of a township for the band of\nThe Sioux, or Dakota Indians are the most noted of the Western tribes. They resemble the Six Nations of Eastern Canada in appearance, and in their confederacy. Christian missionaries began work among them in Minnesota in 1835, and a considerable number of them were christianized. They were, however, so savage as to have received the name \"Tigers of the plains,\" and many a conflict between them and the Red River half-breeds proved the title a true one. The American Government did not keep faith with their Indian wards, and in 1862 the terrible outbreak, known as the \"Minnesota Massacre,\" took place, in which many whites were murdered, and settlement checked in that State for ten years. The writer remembers seeing in 1871 settlers' houses and enclosures in Minnesota lying as they had been left in the year of the massacre of their owners. After the suppression of the outbreak a number of the Sioux fled into British territory. Much negotiation took place between the Hudson's Bay Company authorities in Red River and the United States, the permission having been at one time given the Americans to follow the refugees on British soil. This privilege, however, was never used. In 1877 Sitting Bull and his band fled to the north of the boundary line. Many of them were induced to return, but a number did not. So that the refugees from the two out-breaks remaining with us number some 2,000. They are chiefly found at Oak River, Moose Jaw, Prince Albert, Fort Qu'Appelle, Turtle Mountains and Portage la Prairie, and on the Bird Tail reserve we are describing. In 1874 treaties were made with the first named and last named bands and in later years with others, at least so far as granting them reserves, but no annuity is paid the Sioux band. The population of this Bird Tail reserve is 135, and the Sioux possess 27 log houses and 24 barns and stables. We drove around from house to house and were pleased to see so many evidences of civilization. Many of the families have given up the practice of pitching a tent and living in it during summer, as so many even of the most civilized Indians do. The houses are built upon separate locations, and not in a village, as is the case with their Assiniboine relatives near Indian Head. Beside each man's house is his farm, and the Anglo-Saxon idea of the landmark is fast gaining ground among these Dakotas.\nFARMING.\n\nThe farming was most interesting. No farm instructor here comes to incite the lagging or berate the lazy, but these Sioux farm of their own motion. Our visit was paid on the 26th of August, and almost all the wheat was cut and in stook; in some cases stacking was going on. The thirty horses owned on the reserve are sufficient for farm operations, and yet are not so numerous as to suggest the roaming tendency so prevalent among the western Indians. We found on enquiry that there are about two hundred acres under cultivation on the reserve, which would be an average of some seven acres per family. Take one example, \"Ben.\" This Indian has twelve acres under crop. His wheat is excellent and is partly cut. We found his son busy mending his reaper. It was not a self-binder but was serviceable. The young man had mended in a workmanlike manner a difficult part of the woodwork of the machine. The cooking stove outside the house was preparing dinner, and after partaking of this, Ben junior would attack the grain remaining. The children were cooking before the stove green ears of Indian corn of which a plantation was near. Ben had also several acres of oats, potatoes and turnips.\n\nSTOCK RAISING.\n\nThe Sioux are found engaging in mixed farming and in this show themselves wise. The writer was not able to obtain the quantity of stock belonging to private parties, as distinguished from that owned by the Government. But from the age of the reserve and the industrious character of the Sioux, it seems probable that most of the stock is private property. It will be seen that this is considerable. There are on the reserve 43 cows, 52 oxen, and 35 young stock — making in all 130 head of cattle. Perhaps the most noticeable feature of stock raising is the large number of sheep belonging to the Sioux. There are no less than 87 sheep on the reserve. The growth of sheep is perhaps one of the best indications of progress of an Indian band. The sheep need care and require protection from prairie wolves and the innumerable dogs that infest an Indian settlement. The product of the sheep can be utilized in many ways. The large flock of this reserve destroys what used to be a treasured belief of the western plains that sheep could not be reared in the Northwest. It is a suggestive circumstance, which no doubt the watchful ethnologists\nwho see connection between the Indians and the lost Jewish tribes will note that there is not a pig on the reserve.\n\nRELIGION.\n\nThe good seed which was sown in Minnesota by the devoted missionaries, Williamson and Riggs fifty years ago has borne a bountiful harvest among these Dakotas of our Northwest. The Sabbath is well observed, daily worship is maintained in many of the houses, and the people have a comfortable church. A belfry in front of the church, which is 32x18 feet, makes the church a prominent object on the prairie. This enterprising band have lately added a handsome harmonium costing $80 or $90 to their church, and are exceedingly fond of sacred music. A young Sioux named Thunder, now employed in the Indian office, Birtle, who has been away at school and has learned to play the organ, makes his journey every week to the reserve to lend his aid. The minister of the reserve is Rev. Solomon Tunkasaiyice, a pure Dakota, ordained in the United States. He cannot speak English well, but is an adept in his own tongue. Solomon of the unpronounceable name makes occasional journeys to the wandering bands of his countrymen at Moose Jaw and Portage la Prairie. In his absence several of the elders can lead the service, and at present a young student of Manitoba College, Mr. Macdonald makes a fortnightly visit to the reserve and speaks through an interpreter. Solomon, the minister, had but returned before our visit, and is not in good health.\n\nEDUCATION.\n\nThe school is under the care of Mr. Burgess, who for several years has been on the reserve, and is now becoming well versed in the Sioux language. The reserve though not very large has the dwellings so scattered that the distances come by a number of the pupils are considerable. The number of children on the roll is 27, and the average is 11. Mr. Burgess had the good fortune to receive one of the four prizes offered to Indian schools for the satisfactory condition of the Bird-tail reserve school. Mr. Burgess is respected by the Indians, and is of much use to the Indians in helping in their church service. Mr Burgess is unmarried and lives on or near the reserve.\n\nMR. MARKLE'S AGENCY.\n\nThe writer has been living for some weeks within the agency under the care of Mr. J. A. Markle. Mr. Markle has his house\nand office in Birtle. In the office is a clerk, Mr. William Graham, son of the late Indian agent, Mr. James Graham, who was well known to older residents in Winnipeg. The office seemed to present the appearance of good order, and all information sought was cheerfully given. There are eleven bands in the agency. It does not seem easy to keep such close supervision as in the western agencies. The heavy expenditure on Indian affairs no doubt forbids the increase of officials beyond the present staff. But it must nevertheless be said that unless the Indian can be kept on his reserve there is little hope of civilizing or christianizing him. Mr. Markle has a good reputation in the Birtle district, and seems obliging and painstaking.\n\nIS THE INDIAN DYING OFF?\n\nThis agency seems to supply some facts on this question. Of the eleven bands in the agency three have increased very slightly during the past year, the total being 13 of an increase. Six have decreased seriously, making a total of 65. Three bands have been stationary. Now this is on a total of some 1,790 Indians, so that, on the whole, of the eleven bands there is a decrease in population of about 3 per cent in a single year. Even the civilized Sioux of the Bird-tail reserve have decreased 2\\(\\frac{1}{3}\\) per cent. As formerly noted there is in these statistics a disturbing element in the fact that changes take place from one reserve to another, yet taking the area of a whole agency the error is probably very slight. The Sioux do not seem to be a robust race, and are like the Assiniboines of Indian Head in their tendency to fail before the white man. But in a number of the bands there is no difficulty in finding out the cause. Immorality lies at the root of the evil. In the bands north and north-west of Birtle the loathsome diseases, too disgraceful to be named, which are prevalent tell why the red man is fading away. Christianity is the only agency that can arrest the evil. The white man has brought his vices among the Indians, he is bound to supply to him the gospel which alone can make noble, free and pure.\nOur Indians.\n\nVI.\n\nTHE BRAVES OF FILE HILLS—A TROUBLE-SOME CHIEF STRIKES WORK—ISSUE OF RATIONS STOPPED—A POW-WOW AND ITS RESULT.\n\nSympathetic reader, may it never be your lot to make a prairie journey behind a \"shagganappi\" pony. Some may not be aware that this term is applied to the Indian or half-breed horses, which are used in all parts of our wide prairies. The name is probably got from the \"shagganappi,\" or tough home made leather used in harnessing these ponies. But for tardiness, trickiness, insensibility, and obstinacy not even the proverbial donkey can surpass a \"shagganappi.\" The pony has strange habits. In starting, a \"balking\" experience is quite common with him; the snail like motion then indulged in cannot be quickened by force, for the pony is said by those who know to be encased on the whip side in cast iron—he is certainly a pachyderm. When a \"slough\" or swamp is being crossed the pony often lies down in the mud for his own delectation and to the disgust of the driver. When remonstrated with the pony is exceedingly ill-tempered, and will often strike with his front foot an unexpected blow. So with driver armed with a dangerous looking whip the writer started one afternoon from Fort Qu'Appelle to visit the File Hills Indian reserves. The driver at once entered into a colloquy with the pony, laid down the principles to be observed, and immediately began to lay on the whip vigorously. Up the steep banks of the romantic Qu'Appelle we painfully strove, and sought to make our 20 miles before dark. The belaboring which the pony received was terrible. Everything, however, failed to increase the speed, above four miles an hour. At length the reserves were reached, and the writer accepted the hospitality of the agent, whose wife was an old acquaintance.\nTHE FILE HILLS RESERVATIONS\n\nlie 40 miles to the north of the C. P. R., and are reached by starting from Qu’Appelle station, which is 312 miles west of Winnipeg. The reserves are four in number, and form a block made-up of four parallelograms. The Indians here are plain Crees, who are being domesticated slowly, and though they are learning much seem rather wild and intractable. During the Riel rebellion these Indians were a source of great anxiety to the Government and were probably very near revolt, though along the very line of march of the troops from Qu’Appelle to Batoche. The four reserves bear the name of their chiefs—Peepeekesi’s, Star Blanket, Little Black Bear, and Okanese—the last named being absent at Turtle Mountain at the time of our visit. The condition of the crops and of the herds of cattle and the number of the horses were much the same as those in the other reserves. Next morning after arrival we were soon abroad to the school, which had an earlier session than usual that we might see it. Nine scholars appeared and were put through their exercises by Mr. Toms, the teacher. Our stay was too hurried to ascertain the ordinary condition of the school. Mr. Toms seemed doing his best under rather discouraging circumstances. The bands are widely scattered, and to a large number of the children it is an impossibility to reach the day school. It is understood that the church intends erecting buildings and organizing a more complete school on these reserves next year. On our return to the agency we saw\n\nRATIONS DAY\n\nin full operation. Here, as in most of the reserves of the Plain Crees and Blackfeet, the Indians gather at the agency twice a week or so and receive supplies as regularly as a regiment of soldiers. On this occasion an ox was being slaughtered, and the hungry crew, men, women and children, were all present to observe the whole operation. Squatted on the ground, or sitting on the gathered logs near the agency in their crouching posture, swathed closely round with their blankets, they suggested the idea of a flock of hungry and patient crows waiting their time to fall upon the prey. The gusto with which the offal was seized and set aside by the spectators for further use would somewhat disgust the aesthetic soul. No sooner had the animal been slaughtered than the carcase was divided up\namong the four bands in proportion to their numbers. But there was sorrow in one band for\n\nSTAR BLANKET GOT NONE.\n\nAs we returned from our morning educational trip we saw being carried in a wheelbarrow into the storehouse the portion for this disappointed band. Mr. Agent Wright, who had been appointed to the position but a few weeks before our visit, had explained on driving to the school that there would likely be a scene today. Star Blanket had been ordered by the new agent to plough fire brakes around the stacks of hay his band had made, as prairie fires were beginning to appear. This work the chief had evaded. Due notice had been given the day before that \"No work, no food\" must be the motto. Star Blanket is a daring, self-confident fellow, evidently ready at any time for a fight. It was plainly a trial of strength with the new agent to see who would rule on the reserves. Hungry and sulky Indians with their squaws and papooses were hanging about, suffering for Star Blanket's obstinacy. The word was passed around soon that\n\nA POW-WOW\n\nwould be held in the office. The writer was made a sort of honorary member of the court and sat at one side of the table with the agent and clerk. Thirty or so of the chief men of the four bands crowded the office, and most of them squatted on the floor. Facing the tribunal, among the Indians, sat the old half-breed interpreter. The Indians were invited to speak. An aged sagamore arose and said they would say nothing if they might not tell all. As it was yet only in the morning the agent informed them they might tell all their grievances even before the stranger. They need keep back nothing. Some half-dozen spoke and their addresses, though exemplifying different kind of oratory, were to the point and well delivered. Even through the medium of the interpreter it was plain to be seen that for diplomatic skill and independence we had yet met no band equal to the File Hills Indians. The hero of the occasion was of course the hungry chief, and so we only give the leading points of\n\nSTAR BLANKET'S GRIEVANCES.\n\nHe began by saying, \"Some of us will go home without anything to eat today.\" Further reference was made to the\nfact that in their fields no potatoes were yet ready. A general statement was hazarded that last winter some children and old people of the band had famished for want of food. He related specific instances when the \"long and dreary winter\" had proved too much for the women, and referred with pathetic ardor to the good days when the buffalo were black upon the plains, and the Indians were contented. Every allusion to the need of food found a most feeling response from an ugly, rather crafty looking, old Indian, who, we learned, was the leading spirit of the begging brigade. Star Blanket, however, made his points well. He is a medium sized, slight built Indian, but as he spoke with blanket girt tightly around his loins, and his prominent breast bare, his appearance was most striking. His ready utterance, flashing eye, and well-timed gestures marked\n\nA NATIVE BORN ORATOR.\n\nThe agent quietly brought out the facts of the chief's refusal to do what was most reasonable, and the matter being referred to the visitor who posed as a sort of associate presiding officer it was easy to show that the chief was in the wrong. As to the charges of starvation they were resolved into the cases of certain persons who had died from consumption in the previous year. But as the rations had been regularly given to their friends the charge seemed not sustained. The chief then spoke again. He took a wider range. He claimed a part of the land at Fort Qu'Appelle. The Government had promised farming implements to each family. Turning and pointing to the samples used by the Government for comparing new supplies, which were fastened on the wall, Star Blanket said the saws, and the augers, and the axes, and the hoes, and so on had been given only to a few. Each sort of implement formed the subject for a paragraph. It was quite plain that this sort of speech might be made after the model of the song with a thousand verses. In reply to all this, \"Morris's Indian Treaties\" was turned up and the treaty read. It was pointed out that the Government had three times over exceeded the promise of the treaty. But each was, of course, of his own opinion still.\n\nTHE DIFFICULTY\n\nwas at length solved by the chief agreeing to have the fire brakes ploughed around the stacks. As soon as this should be done, which would not take more than three or four hours for the\nyoung men to accomplish, then the beef would be delivered. But the chief demanded that he be allowed to visit the Governor at Regina to make complaint of the harshness of the agent. He was informed in reply that he could have a pass to leave the reserve for that purpose whenever he wanted it. Thus ended, after a struggle of some three hours, this affair. The writer was much impressed with the skill and outspokenness of these prairie diplomats.\n\nTHE AGENTS.\n\nA special opportunity was thus given of seeing the difficulties of the agents, and of reflecting how trying the situation must have been during the rebellion of two years ago. The former agent, Mr. Williams, was hardly successful with these File Hills Indians. The writer, however, never saw him, and simply speaks from hearsay. The present agent, Mr. W. F. Wright, has been known to the writer for several years. He and his amiable wife will be kind to the Indians. Several instances were incidently come upon where in cases of the aged and sick they had followed out their humane instincts and given relief. Were all the Indian agents as charitable and thoughtful of their poor wards as the same people would be towards the poor and suffering in town and city, how greatly would the dying Indians be blessed. And why not? The agents and their families are not merely Government officials. They may be angels of mercy to the unfortunate perishing redmen. Agent Wright held his own in the contest with quiet firmness and good temper. The journey was resumed to Qu'Appelle, and after further painful associations with the \"shag-ganappi\" the Fort was reached.\n\nCONCLUSION.\n\nOur wanderings among the Indians are ended for the present. We have seen them in every variety of circumstance this summer. They are very degraded in most cases still. But much more attention is being paid to them, both physically and mentally, than formerly. Well directed effort has borne its fruit already. There is hope for the Indian, but it is chiefly through dealing with the young. The day school is a failure. Boarding schools alone can accomplish the work. If both the Government and the churches give their best thought to the subject the poor Indian may in time be civilized and christianized.\n\nTHE END.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001711.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 91, "total-input-tokens": 130774, "total-output-tokens": 43056, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 152, 1], [152, 152, 2], [152, 316, 3], [316, 316, 4], [316, 1528, 5], [1528, 1528, 6], [1528, 3459, 7], [3459, 5871, 8], [5871, 8292, 9], [8292, 10594, 10], [10594, 12798, 11], [12798, 14667, 12], [14667, 17099, 13], [17099, 19390, 14], [19390, 21806, 15], [21806, 23968, 16], [23968, 26222, 17], [26222, 28557, 18], [28557, 29362, 19], [29362, 31141, 20], [31141, 33316, 21], [33316, 35603, 22], [35603, 37747, 23], [37747, 40052, 24], [40052, 42348, 25], [42348, 43585, 26], [43585, 45319, 27], [45319, 47417, 28], [47417, 49755, 29], [49755, 51958, 30], [51958, 54353, 31], [54353, 56756, 32], [56756, 59211, 33], [59211, 61727, 34], [61727, 62707, 35], [62707, 64501, 36], [64501, 66837, 37], [66837, 69271, 38], [69271, 71479, 39], [71479, 73877, 40], [73877, 76096, 41], [76096, 77101, 42], [77101, 78824, 43], [78824, 81199, 44], [81199, 83557, 45], [83557, 85899, 46], [85899, 88251, 47], [88251, 90605, 48], [90605, 93066, 49], [93066, 94753, 50], [94753, 96590, 51], [96590, 98823, 52], [98823, 101009, 53], [101009, 103542, 54], [103542, 105830, 55], [105830, 108252, 56], [108252, 109564, 57], [109564, 111338, 58], [111338, 113746, 59], [113746, 115932, 60], [115932, 118380, 61], [118380, 120633, 62], [120633, 122895, 63], [122895, 125201, 64], [125201, 126561, 65], [126561, 128473, 66], [128473, 130724, 67], [130724, 133065, 68], [133065, 135363, 69], [135363, 137664, 70], [137664, 139788, 71], [139788, 141728, 72], [141728, 143623, 73], [143623, 146011, 74], [146011, 148355, 75], [148355, 150616, 76], [150616, 153053, 77], [153053, 155376, 78], [155376, 157786, 79], [157786, 158018, 80], [158018, 159939, 81], [159939, 162356, 82], [162356, 164720, 83], [164720, 167074, 84], [167074, 169366, 85], [169366, 171463, 86], [171463, 173254, 87], [173254, 175599, 88], [175599, 177785, 89], [177785, 180142, 90], [180142, 182391, 91]], "primary_language": ["en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]