[{"id": "e98b4d10f11d8c593cd666014f5eba415fcb8ea3", "text": "La prise de Gros Ours porte le dernier coup à l'insurrection du Nord-Ouest et met le couronnement à la brillante campagne que nos troupes viennent d'y faire. Le temps nous a paru propice pour offrir au public un résumé fidèle des événements qui viennent de se dérouler dans le Nord-Ouest et lui présenter, sous une forme condensée, tous les détails offrant un intérêt sérieux qui se rattachent au drame qui vient de se jouer dans cette partie reculée du Canada : les causes du mouvement insurrectionnel tel qu'il est possible de les saisir aujourd'hui ; l'appel aux armes et la mobilisation des milices canadiennes ; leur transport sur le théâtre des troubles et les mouvements des diverses colonnes ; les rudes et brillantes étapes des divers bataillons et particulièrement du 65e de Montréal et du 9e Voltigeurs de Québec ; les travaux préparatoires de l'entrée en campagne ; le plan de campagne du général Middleton ; les récits fiables et complets des diverses batailles qui se sont terminées à l'honneur des armes canadiennes ; les récits poignants des massacres qui ont ensanglanté les plaines de l'ouest ; le dévouement des missionnaires au milieu de l'œuvre de sang accomplie par leurs farouches ennemis ; les hésitations, l'agitation croissante, et finalement la révolte armée de certaines tribus sauvages ; les sièges de Battleford et de Prince-Albert ; des renseignements généraux sur le foyer de l'insurrection, ses quartiers généraux, les Métis et les Sauvages qui y ont pris part ; la reddition de Riel et de ses principaux lieutenants, de Poundmaker et de ses braves ; la poursuite de Gros Ours abandonnée, puis reprise, et finalement l'abandon des opérations militaires suivi de près par la reddition de Gros Ours et la rentrée des troupes dans leurs foyers. C'est une page d'histoire qui vient de s'écrire dans le Nord-Ouest, en caractères de sang malheureusement. Il importe donc d'en préciser dès maintenant les principaux traits, et de fixer les éléments sur lesquels portera plus tard le jugement impartial de l'historien. C'est le but de ce travail tout d'actualité qui n'a aucune prétention littéraire, mais qui offre, croyons-nous, son utilité, son intérêt, en attendant une œuvre plus complète et plus réfléchie, qui ne sera possible que lorsque le calme se sera rétabli dans les esprits comme dans les faits. Pour ajouter à l'intérêt déjà si vif de cette publication, nous avons décidé d'y inclure de nombreuses illustrations : portraits des officiers supérieurs des troupes canadiennes et en particulier du 65e bataillon, accompagnés de notes biographiques ; portraits des chefs de l'insurrection qui ont joué un rôle en vue de soldats tués et blessés dans les divers engagements ; vues du Nord-Ouest ; cartes du théâtre de l'insurrection ; plans des forts érigés par nos volontaires, etc. Nous avons la confiance que le public nous saura gré de nos efforts et des sacrifices que nous nous imposons pour le tenir au courant des événements d'actualité qui sont de nature à l'intéresser, et nous sommes sûr qu'il les appréciera et les encouragera.\n\nCHAPITRE I.\n\nLES CAUSES DE L'INSURRECTION.\n\nPour nous, la cause première des troubles se trouve dans le tempérament même du métis. Produit du croisement de ce hardis et aventurieux trappeurs et voyageurs français qui ont laissé passer dans leur sein le souffle de leurs exploits, avec le sang pur du monde, il forme un type à part dans lequel on retrouve le mélange des qualités et des défauts des deux races. Il distille ses esprits parmi la hardiesse, la vigueur et la force physique, le goût et en quelque sorte le besoin d'aventures, une bravoure que jamais personne n'a contestée et qui moins que tous autres, nous en sommes convaincus. Nous ne pouvons d'aujourd'hui ne souhaiter à mettre en doute, une grande dextérité d'esprit et l'horreur du faux et de l'injuste, jointe à une certaine crédulité naïve, une tendance à l'idéalisation dans l'exécution d'un projet, une fois projet formé et arrêté. La vivacité et la fougue du Français sont tempérées chez lui par l'indolence native des races sauvages. La confiance qu'on retrouve au fond de l'âme de tous les Sauvages tient aussi sur le siège. Il est leur flair, leurs ruses de guerre, une adresse plus consciencieuse encore de sa valeur. Les conditions particulières de son existence ont développé chez lui ces traits dirigeants et la rudesse à laquelle il a été formé fait qu'il estime à peu de chose le sacrifice de sa vie.\n\nComme on le voit, c'est un composé singulier, où les bons éléments dominent en somme et qui doit constituer une population relativement facile à gouverner, à la condition qu'on tienne compte de ce qu'il faut ou à raison qu'elle considère comme ses droits inaliénables, mais susceptible, des déterminations les plus graves, des tentatives les plus audacieuses et les plus extrêmes du moment qu'elle croit voir ces droits, ou ce qu'elle considère comme tels, légitimement ou menacés. Habituel comme le Sauvage aux larges horizons des prairies, au grand air, à l'espace, le Métis se prête mal à ce qu'on enferme sa vie dans des formes conventionnelles et arbitraires, et il accepte difficilement un frein dont il reconnaît pas la nécessité et l'autorité.\n\nUne chose est assez curieuse : d'autres distinguent encore le métis : c'est son esprit de conservation et son respect pour la propriété d'autrui. Mais ce respect, il le conserve pour la sienne propre. Malheur à l'envahisseur de son domaine. On l'a vu en 1869-70 lorsqu'en consultation préalable avec les Métis ou leurs chefs naturels, la compagnie de la banque indienne voulut transiger sur quelques terres contre les droits et les prérogatives qu'elle exerçait sur eux et qui étaient garantis par la reconnaissance formelle de ses administrateurs. On n'évita pas l'interpellation du ministre de l'Intérieur, la réaction active de Mgr Taché, jusqu'à ce qu'il venisse expressément de Rome où il siégeait au concile ecclésiastique du Vatican, pour calmer les esprits et faire prévaloir son influence sur le gouvernement de la province. Mgr Taché réussit dans sa mission et fut assez heureux pour rétablir la paix. Mais il n'en ressort pas moins des documents qui se rattachent à ce premier mouvement de résistance que les Métis répugnèrent souverainement à laisser ainsi disposer d'eux et de leurs propriétés sans consentement explicite de leur part.\nOn sait ce qui advint par la suite comment l'insurrection éclata enfin. Les Métis récalcitrants ne s'étaient pas mis en tête de discuter des termes qui avaient été établis à la fin de l'année dernière, à Riel et à Lépine, qui, après avoir été capturés politiquement, condamnés à l'exil, durant leur exil sur une terre étrangère pour échapper à la haine du peuple. Riel, après avoir été quelque temps de plus en place, se contenta de discuter les termes de cette union, avant de partir aller s'installer avec sa famille au Montana, où il exerçait des modestes fonctions d'instituteur dans une école industrielle.\n\nDans l'été de 1881, les Métis de la Saskatchewan, qui, depuis quelque temps, faisaient valoir leurs revendications auprès du gouvernement canadien, sentirent le besoin d'avoir un chef d'intelligence et en l'absence de celui qui représente le gouvernement, ils commencèrent à agir de manière indépendante.\n\nLe gouvernement a, en effet, nommé une commission de trois membres chargée de réunir des justes sujets de la province de la Métis et de lui en faire rapport. La commission a aussitôt mis à l'ouvrage et en pleine campagne militaire, pendant que le gouvernement se trouvait dans des récriminations appuyées sur la force des armes. Mais, encore une fois, ce mode est peu expéditif et les derniers événements ont démontré la nécessité d'une réorganisation.\n\nNous avons parlé du caractère propre des Métis et de la confiance aveugle qu'ils reposeaient en Riel. Celui-ci entretenait cette confiance en utilisant des moyens qu'il savait propres à faire impression sur les esprits simples et crédulistes. Il pouvait, en effet, être considéré comme un prophète religieux et avait formulé des idées qui, sous le regard de l'opinion publique, semblaient être des vérités établies. Une de ses principales fautes n'aurait pas été celle de chercher à allier les sympathies des Métis à celles du clergé. Après quoi, il devait être considéré comme un corps d'élite, un tel abus de confiance révèle l'homme tout entier. Il ne manque pas de gens qui, le croient atteints de folie religieuse.\n\nIl n'en est pas moins vrai que cette nature ardente, dépourvue d'une ambition mesurée, manquant d'équilibre, possède quelques-unes des qualités qu'il faut pour s'imposer à la masse, mais dépourvue de cette puissance de caractère qui sait contenir les passions, de cette force de charisme, de cette patience persévérante du véritable homme d'État qui, sans rien précipiter, sait attendre et choisir le moment propice, n'est-ce pas le moins vrai disons-nous, que Riel était servi par un certain talent d'organisation qui, en deux occasions différentes, sut réunir autour de lui un corps nombreux de partisans dévoués et convaincus.\n\nOn raconte que Riel, dans une des dernières insurrections, écrivit à certains de ses amis qu'en 1869-70, que la \"Déclaration de droits\" de St. Laurent est en quelque sorte renouvelée de celle du 3 décembre 1869, qu'on y exerce à peu près les mêmes revendications et qu'on y trouve les mêmes griefs. On dirait que l'histoire se répète, que même les mêmes ambiances, les mêmes moyens à son service. Il y a des différences appréciables sans doute, puisque le mouvement de 1869 avait gravi à Riel des sympathies qui lui font défaut aujourd'hui.\n\nOn a cherché à impliquer le clergé catholique de la province dans ces troubles, en disant qu'il avait encouragé les insurrections, mais contre le clergé catholique, proteste l'histoire, tout entière du clergé catholique. C'est une odieuse accusation qui a...\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nCHAPITRE II.\n\nLE PREMIER ENGAGEMENT. — BA-TAILLE DU LAC AUX CANARDS.\n\nCes causes agissantes avaient dé- voulues leurs effets et préparé la voie. Les Métis étaient prêts pour la résistance armée. Pour que cette résistance passât dans les faits, il ne fallait qu'un prétexte. Or, c'est chose qui se trouve toujours.\n\nIl est généralement difficile, dans une situation comme celle que nous venons de décrire, de repérer le point de départ des hostilités; de démêler à qui incombe la responsabilité du premier coup tiré. On s'en défend de part et d'autre et chaque parti cherche à rejeter cette responsabilité sur l'autre.\n\nC'est ce qui s'est arrivé dans le cas actuel. Les rôles relatifs à l'engagement du Lac aux Canards n'ont pas manqué. Chaque parti a fait le mieux ou plutôt les siens et les versions se croisent, s'écheveillent, se confondent et suscitent des sentiments et qu'il importe de bien peser. Voici la version qui nous a paru la plus plausible jusqu'ici.\n\nLe 26 mars, Gabriel Dumont, Isidore Dumont et trois autres mé- tis s'en allaient chevauchant dans la partie sud du lac rencontraient un convoi de provisions conduits par un nommé McKay, escorté de quarante volontaires de Prince-Albert.\n\nS'étant approché, Gabriel Du- mont dit à McKay : \"Nous ne voulons pas te faire de mal, mais nous ne laissons pas passer.\" McKay, sans doute intrigué, re- brouta chemin, et le major Crozier, de la police à cheval, à qui il porta plainte partit avec cent de ses hom- mes et les quarante volontaires qui accompagnaient McKay pour aller apparemment chercher de l'aide. Dans l'intervalle, Dumont avait rassemblé vingt cavaliers qui vinrent avec lui au-devant de Crozier. Parmi eux se trouvait un Sauvage, frère d'Isidore Du- mont, par adoption, et qui n'avait pas de fusil. A travers les rives du lac aux Canards, militaire et militaire, se déroulait face à face le som- met d'un petit coté. Le major Crozier alors aux métis de mettre bas les armes et Gabriel Dumont lui répondit : \"C'est nous qui allons vous faire mettre bas les vôtres.\" C'est alors que le Sauvage s'lança sur un homme de la police à cheval pour lui arracher son arme. Repoussé de violence, il tomba sur terre et reçut un coup de fusil au moment où il cherchait à se relever. Tout aussitôt le malheureux Isi- dore Dumont tombait mort à côté du Sauvage; une balle l'avait frappé. Les Métis qui se trouvaient au haut du monticule se mirent à courir et envoyèrent une décharge sur les hommes de Crozier. Quatorze de ces derniers furent tués, dont trois hommes de la police à cheval et onze volontaires. Ceux-ci plongeant pu ou n'avaient en main la peur à cheval se mettront à couvert derrière leurs voitures, ce qui explique leurs pertes énormes comparées à celles de la police. Voici les noms de ces premières victimes du devoir : Capitaine John Morton, Wm. Napier, James Blakely, Skelington C. Eddy, Robert Middleton, D. McMillan, Charles Howe, Joseph Anderson, D. Macdonald, Charles Page, Alexander Fisher, volontaires, et les con- stables T. J. Gibson, Garretty et J. P. Arnold, de la police à cheval. Neuf hommes furent blessés du côté de Crozier.\n\nParmi les volontaires tombés dans cette pre- mière rencontre l'un était le fils d'un juge et le cousin de celui de notre ami le lieutenant fédéral, un autre le neveu du sir Francis Hincks, ex-premier ministre du Canada et ex-gouverneur des Îles sous le Vent, un troisième le fils de sir Charles Napier et un quatrième le neveu du célèbre homme d'État de la Nouvelle-Ecosse, l'on honnorable Joseph Howe. On voit par là de quels éléments se composent les colons du Nord-Ouest.\n\nDumont eut quatre hommes tués et plusieurs blessés. Lui même fut blessé à la tête par une balle qui avait ricoché.\n\nAprès une demi-heure de fusillade, Crozier, voyant qu'il ne pouvait déloger les métis sans un sérieux sacrifice de vies et manquant de munitions suivant une version, donna l'ordre de se retirer. Cet ordre fut aussitôt exécuté, les troupes laissant leurs voitures et le camp de bataille, se rendant vers vieux canot, de 7 dont elles n'avaient pu se servir et leurs blessés. Elles se replièrent sur Fort Carleton, où elles furent rejointes, aux portes mêmes de la palais- ade du fort, par le colonel Irvine qui arrivait de Qu'Appelle avec un renfort de 100 hommes de la police à cheval.\n\nOn est surpris du résultat de cet engagement quand on considère la disproportion des forces des parties bellicistes. Mais il faut tenir compte que les métis sont peut-être les premiers tireurs du monde et que du reste ils combat- taient à couvert tandis que les hommes de la police étaient exposés. L'inexpérience des vol- ontaires a sans doute aggravé davantage ce résultat.\n\nIl est à présumer également que Dumont s'appuyait sur des forces de réserve qui se trou- vaient à sa sortie, sans quoi il eût dans doute hésité, en dépit de sa bravoure et de son audace, à offrir ou à accepter le combat. Les premiers récits de l'engagement signalisaient la présence parmi les Métis du Sauvage de la réserve du chef Beaudry (le Brave) et l'on dit que le Lac aux Canards. On savait ce chef mal dissimulé depuis quelque temps et il avait déjà en plus d'une occasion donné beaucoup de trouble à la police. Il est assez naturel qu'il eût voulu profiter de l'occasion qui s'offrait lui de pulser, occasion que les laissait une certaine sécurité de son avantage. Mais Dumont a déclaré à maintes reprises que 25 Métis seulement ont pris part à cet engagement, et cela dans des circonstan- ces où il n'avait plus d'intérêt à exagérer l'importance de son succès, de sorte qu'on peut s'en rapporter à sa parole.\n\nOn a cherché à faire porter au major Crozier non seulement la responsabilité de ce premier échec, mais encore celle d'avoir, par une conduite imprudente, donné une excuse à l'insurrection et justifié la résistance des insurgés. On a exprimé diverses opinions sur le compte de cet officier, les uns le re- présentant comme un homme four- guieux, d'un caractère impétueux et capable de tout risquer sans néces- sité, les autres le représentant comme compétent, prudent, expérimenté, qui a rendu des services apprécia- bles et s'est créé des sympathies précieuses dans l'exercice de son commandement. Il est certain que les hommes de Crozier ont tiré les leçons de ce fait. Qu'ils ont été mal jugés la position, exagéré l'importance effec- tive de ses forces ou plutôt ne con- nu la valeur de ses adversaires. Do- là à justifier la résistance il y a loin.\n\nCrozier représentait dans cette circonstance l'autorité de la force publique. Les Métis avaient pillé des magasins et des convois de vivres, fait des prisonniers, établi un gouvernement provisoire, se constituant par la même en révolte contre l'autorité établie. Il en existait une certaine nombre de chefs et la somme de mettre tous les armes. Il était dans son droit. Les métis en refusant n'avaient pas dans le leur et prenaient qu'ils voulaient être les maîtres ou voir le sang cou- ler. Le major Crozier, lui, est, et l'avantage est resté aux insurgés. Mais le succès ne saurait légitimer le désordre ni en rejeter les consé- quences sur ceux qui, munis des pouvoirs venus, font acte de ré- pression au nom de l'autorité qu'ils représentent.\n\nRiel n'était pas au camp du Lac aux Canards. Il était bien le chef politique de l'insurrection, celui qui en avait posé les bases et dont le pres- tige lui en avait déterminé les adhésions. Mais le chef militaire, celui qui était chargé de pré- parer et de diriger les opérations actives, c'était Dumont. Dans un état d'excitation et de buffles, qui avait eu souvent matière à partir avec les Sauvages et s'était acquis dans ces luttes une réputation d'adresse et de bravoure qu'il mérite certes à tous égards. On cite de lui un trait qui prouve sa hardiesse et sa détermination.\n\nIl est à noter que le général Dumont était à la pointe avec un rang de Métis et de Canadiens-français. Il apprend qu'un camp de Pieds Noirs est à une vingtaine de milles de distance. Il fut décidé qu'on irait leur faire visite. Gabriel part, accompagné d'une dizaine de chasseurs. Comme ils arrivaient au camp des Sauvages, ceux-ci commençaient la Danse du Poisson. Cet exercice consiste pour chaque guerrier à se rendre près d'un pieu placé au milieu du camp et à faire\nle récit de ses exploits en frappant le pieu de son couteau. Gabriel entre sans heurter dans la danse. Son tour venu, il s'approche du poêlon, et après avoir fait quelques pas, il dit : \"Voilà le tout dix Pieds Nous.\" Et il attend l'effet de sa vantardise. Les compagnons de Dumont se regardent tout effrayés, et se disent : \"Nous sommes dorgens morts.\" De leur côté, les chefs sauvages avaient poussé leur Oui ! Oui ! signifi- catif. Puis, ils se levèrent et s'avancèrent vers Gabriel qui était en train de faire admirer pour cet homme qui était ainsi venu les braver presque seul jusque dans leur propre camp : \"Tu es un brave, lui dirent-ils ; nous avons entendu parler de ta valeur ; elle n'est pas surprenante, tu resteras avec nous, et nous ferons fortune.\"\n\nQuant à Dumont et les hommes partant à la nuit avec les Pieds-Noirs et regagnant au matin leur propre camp, au milieu des démonstra- tions d'amitié des Sauvages.\n\nPour en finir avec la bataille du Lac aux Ca- nards, le lendemain 27 mars, Riel envoya un messager porter une lettre à Mr. Irvine au Fort Carlton, lui demandant d'envoyer des voitures chercher les morts, qu'on fit sus- sitôt, deux autres prisonniers recevant mission de les inhumer dans un lieu sûr.\n\nLe fort Carlton n'était qu'un fort que de nom, n'étant protégé que par une masse de pierre et étant incapable de soutenir un siège. Le colonel Irvine et le major Crozier, après consultation, décidèrent d'abandonner le fort, la présence de la police étant d'ailleurs nécessaire à Prince Albert pour protéger les colons qui y étaient re- fugiés. Comme on ne voyait pas la fumée montant en bas, personne ne savait de la difficulté à faire les blessés. On embarqua dans des voitures les blessés et les familles des colons évacués et on se dirigea sur Prince Albert, en traversant 40 milles d'un pays où l'on attendait à tout instant de rencontrer l'ennemi. Ce voy- age fut dur et pénible pour les blessés et les vivres et des plus cruelles anxiétés qu'ait fait naître cette funeste échauffourée, si fertile en émotions de tout genre, et ce fut avec un cri de soulagement qu'on arriva, deux semaines après, à l'arrivée des réfugiés, sains et saufs, à Prince Albert.\n\nLa bataille du Lac aux Canards avait été pré- cédée d'événements qu'il importe de ne pas passer sous silence. La police à cheval avait eu vent des agissements des métis et il était vaguement rumeur qu'elle devait venir et les faire rentrer dans l'ordre. Le ministère de la Justice, pour- té à Prince Albert par M. Lawrence Clark, officier de la compagnie de la baie d'Hudson. C'était dans les premiers jours de mars. Infor- mé du fait, Riel rentra, le lendemain, tous les colons de l'endroit, et il fut décidé de prendre des mesures nécessaires pour parer à toute éven- tualité. Comme il fallait être extrêmement prudent à la subsistance de ses hommes, Riel se rendit aux magasins des frères Kerr, de MM. Walters et Baker, et leur ordonna de livrer à son monde tout ce qu'il y avait à sous forme de vivres, d'alcool et de munitions. La résistance était impossible, il fallut se soumettre. Riel décida, cependant, qu'il entamait alors les propriétaires et leur demanda de lui tenir compte de tout ce qui était enlevé des magasins. Il fit en même temps une dizaine de prisonniers, portant des noms anglais, qui se conforma, dans la maison de MM. Georges Fisher et P. Garnot, transformée en gîte pour la circulation.\n\nLa révolte s'étant ainsi affirmée, l'on devait songer à constituer une autorité. Riel organisa donc sans retard un Conseil composé de douze membres au nombre desquels se trouvaient Charles Nolin, M. Gabriel Dumont, Maxime Lepine, Nicolas Delorme, Joseph Be- langer, Joseph Paranteau, Alex. Fisher, John Caron, Philippe Garnot, et un nommé Jackson, converti de la veille au catholicisme. Ce dernier, collaborateur de Riel, l'hiver dernier, fut jadis apothicaire à Wingem, et lui et Garnot sont les seuls blancs que Riel ait associés au Conseil du Nord-Ouest. M. Maxim Lepine, le frère de M. Ambroise Lepine, qui a joué un rôle si marquant dans les troubles de 1870, a séjourné plusieurs années à l'Assemblée législative de Mani-tou.\n\nL'autorité de Riel était, paraît-il, suprême ; on ne discutait pas ses ordres. Il n'avait qu'à parler pour être obéi parmi la population qu'il commandait et dirigeait à son gré. Quoi que l'on puisse dire en faveur de ses actes, il est certain que Riel exerçait sur les Métis une influence extraordinaire. Et ce prestige est encore plus charmant qu'il ne semble pas avoir été amoindri par une longue absence. La plu- part de ses amis au Nord-Ouest refusaient de croire à ses intentions à l'égard de Batoche. Quelle était la force de Riel ? Quel était le nombre d'hommes sur lesquels il pouvait compter ? Quels étaient enfin ses alliés ? Riel avait sous ses ordres près de 500 partisans bien armés, dont 230 Métis, répartis dans quatre cantonnements : St. Laurent, Lac-aux-Canards, Batoche et Langlois, 100 Criez et plus de 100 Sioux. Il était aussi auxiliaire en jour le chef sauvage Gros Ours avec 1400 guerriers, également bien armés, et avait envoyé des courriers au Port-aux-Corne et ailleurs, pour demander du renfort. Il apparaît des papiers trouvés après sa reddition qu'il avait sollicité l'aide des Sauvages du Montana et même celle des Sioux.\n\nLes provisions des rebelles étaient déposées dans l'église catholique, située à trois quarts de mille de la Traverse de Batoche. Elles étaient abondantes. Il y avait là des vivres et des nu- tions pour longtemps, et les insurgés ne cons- umeraient que des boissons.\n\nLe village de Batoche proprement dit n'est qu'à quelques milles du Fort Carlton. Il comptait une quinzaine de maisons érigées sur le côté est de la Saskatchewan du Sud. Entre les frères Kerr, établis là depuis l'automne der-\n\nCHAPITRE III.\n\nSOULÈVEMENT DES SAUVAGES.\n\nDe part et d'autre on attachait une grande importance au résultat du premier engagement, car on savait que le succès ou la défaite de la transi- tion ou de la révolte des Sauvages, cela avait toutes les peines du monde à contenir sur leurs réserves. Le Sauvage, pareillement, manquant d'initiative, imprévoyant et sans industrie, est, dans notre pays comme aux États-Unis, un fardeau pour la civilisation. La politique hu- maine des gouvernements américains, de grand sens, parvenant à se les attacher d'une façon absolu, avait cependant réussi à assoupir leurs mauvais instincts et ce n'est que de loin en loin qu'on surprenait chez eux des véritables d'a- gitation.\n\nDisons aussi qu'à cet égard les missionnaires canadiens et américains ont tendu au gouver- nement et à son service d'antan plus appréciables qu'ils étaient plus désintéressés. En cherchant à faire régner dans leur esprit et dans leur cœur l'influence bienfaisante d'une religion de paix et d'amour, le missionnaire était allié naturel du pouvoir politique, dont il faisait l'objet en faisant une sinon. Et cepen- dant que ces grands patriotes de ces siècles divises que des êtres imprévisibles autant qu'incons- quents ont cherché à faire passer pour les complices des insurgés.\n\nMais la nature est plus forte que toutes les influences extérieures mises en œuvre pour la transformer et il est rare qu'un jour ou l'autre elle ne reprenne ses droits. Ainsi le saule pleureur, traversé de transformation persévérant et progressif, on retrouve chez le Sauvage de nos jours, entouré pourtant de toutes les influences extérieures de la civilisation, les mêmes instincts de rapine, de pillage et de meurtre qui distinguaient ses ancêtres.\n\nChez certains de ces Sauvages, les insti- ches mêmes de ce problème assez difficile à résoudre. Le Sauvage a faim et il a horreur du travail. Le travail comme loi de contrainte mo- rale lui repugne et il ne consent à s'y livrer que s'il est entouré de circonstances qui en font à ses yeux un plaisir, comme la chasse, par exemple.\n\nAujourd'hui cependant que, par la disparition du bûcher, l'homme est devenu un être qui ne veut pas voir, demander à la terre le secret de sa richesse. Le gouvernement, se faisant de cette nécessité un levier et agissant comme un bon père de famille, a assigné aux Sauvages de l'ouest des terres spéciales où ils peuvent se livrer à la culture. Leur livrer en effet une matière première, indigénée, à des opérations nou- velles pour eux, graines de semences, outillage, etc. Il a placé au milieu d'eux des instructeurs chargés de leur enseigner les méthodes de cul- ture moderne perfectionnées. Non content de cela, mais comprenant que le travail, dans les conditions où il existe en Suisse, ne peut pas être une chose de bataille rangée, c'est être mé- connaitre les instincts et les mœurs du Peuple-Rouge et du Métis. Les pièges, les surprises, voilà d'ordinaire l'arme la plus redoutable, la plus meurtrière de ces hommes à qui les raffine- ments de la civilisation n'ont pas encore appris à se laisser tuer scientifiquement.\n\nOn a même été surpris de les voir réagir, fortifiés à certains points déterminés, au lieu de courir d'un point à un autre comme c'était leur habitude, ce qui tendrait encore à prouver que la défense était préparée de longue main et habi- bilement concertée d'avance.\n\nCes renseignements généraux fournis sur le foyer de l'insurrection, les quartiers généraux et quelques-uns des hommes qui y ont pris une part active, nous allons reprendre la marche de notre récit sans nous embarrasser davantage de notes biographiques qu'on trouvera réunies à la fin de ce volume.\nFORT PITT.\n\n1. Casernes. 2. Dépot de Fourrures. 3. Magasin Cie. Baie d'Hudson. 4. Dépot de Provisions. 5. Maisons inhabitées. 6. Routes du Lac à la Grenouille. 7. Rives de la Saskatchewan. 8. Broussailles. 9. Montagnes. 10. Place où Louisa a été attaquée. 11. Place où Cowan a été tué. 12. Terrain cultivé. 13. Route de la rivière. A. Bastion. B. Établis.\n\nOn conçoit sans peine qu'animés de pareilles dispositions et travaillés depuis quelque temps déjà, il y a lieu de le croire, par Riel qui ne leur manquait pas les promesses, ces rudes enfants de la nature aient salué avec joie et une certaine exaltation, conforme à leur caractère, la perspective d'un plus grand effort ou peut-être d'agitation aiguë. Mais le Sauvage est prudent et s'il a conservé dans certaines de ses meurs, notamment dans les cérémonies d'inauguration de ses braves, des restes de la férocité des premiers occupants du sol, il n'en est pas moins pacifiste. Il ne doit pas commettre des dérèglements, mais à la condition que la tâche n'offre pas trop de danger.\n\nIl y eut donc tout d'abord une phase d'hésitation, de tâtonnement, d'oscillation qui donna occasion aux Sauvages de déployer leur fourberie ordinaire. Tout en affirmant leur loyauté au gouvernement, ils se montrèrent comme les grands connaisseurs dansaient leurs danses guerrières, manifestant une agitation qui allait croissant, mais sans entrer encore dans le sentier de la guerre. Ils attendaient que les insurgés eussent remporté un avantage marqué, prêt à se réclamer de leur loyauté si les troupes du gouvernement avaient été vaincues.\n\nLes réserves des tribus les plus puissantes et les plus aguerries se trouvaient, heureusement, à proximité du chemin de fer canadien du Pacifique, et les chefs de ces tribus, sachant avec quelle rapidité les troupes pourraient les atteindre pour les ramener à la raison, s'appliquèrent à calmer l'agitation de leurs jeunes braves, et dans leur langage caractéristique, affirment leur loyauté dans des déclarations aussi concrètes qu'on pourrait le faire à Chambly. C'est ainsi que Pied de Cochon, le chef d'une nombreuse et puissante tribu de Pieds Noirs, affirmait, dans une dépêche adressée à sir John Macdonald, à Ottawa, sa fidélité à la cause de l'ordre. Il est bon de rappeler ici que cette tribu, comme du reste plusieurs autres, fut considérée par les seigneurs coloniaux et les missionnaires et en particulier du Père Lacombe O. M. I. en qui ces Sauvages repoussent une confiance extrême. Le P. Lacombe n'hésita pas à entreprendre un voyage long et difficile pour aller lui-même visiter ces tribus et les encourager à persister dans leur loyauté et discrétion. Les gratifications de tabac et les rations supplémentaires de vivres firent le reste.\n\nQuant à celles des tribus chancelantes qui n'attendaient pour jeter leur masque qu'un premier succès remporté par les insurgés, le résultat de l'engagement du Lac aux Canards leur fut soumis bientôt l'occasion. Un cent-vingt-milles au nord du chemin de fer, au confluent de la rivière Bataille et de la branche septentrionale de la Saskatchewan, est située la ville de Battleford. Dans un rayon de trente milles de cette ville se trouvent les réserves de fortes tribus de Sauvages Cris et Stonies, au nombre de plus de deux mille. L'évacuation par la police à cheval du fort Battleford situé entre Battleford et les terrains gérés de la Compagnie de la Baie d'Hudson permettait à ce dernier de communiquer librement avec ces Sauvages, qu'il alléchait par la perspective du pillage et qu'il détermina à entrer dans le sentier de la guerre après la bataille du Lac aux Canards, dont les insurgés ne manquèrent pas d'exagérer l'importance et la situation des forces en présence.\n\nLe 29 mars au soir, on annonça que les Sauvages s'avancent sur Battleford. Aussitôt les colons et les citoyens de la ville, au nombre de trois cents environ, se réfugièrent dans l'enceinte du fort érigé sur la pointe formée par le confluent de la rivière Bataille et de la branche septentrionale de la Saskatchewan. Le colonel Morris, qui y commandait un détachement de la police à cheval et une compagnie de milice locale dans laquelle s'étaient enrolés tous les hommes en état de porter les armes, avait déjà fait construire des bastions pour ses troupes et était préparé à combattre. On passa la nuit sous les armes. Le lendemain, les Sauvages parurent sur la rive sud de la rivière Bataille, et commencèrent à piller les magasins et les résidences de l'ancienne ville. Ces Sauvages...\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nappartenait à la tribu de Poundmaker; ils n'étaient probablement pas plus d'une centaine, mais ils répondaient bientôt du renfort.\n\nLe 31 au matin, à trois heures, un Sauvage à forte stature pendait à une chaîne suspendue de l'arbre Applegarth, l'indicateur agricole de la tribu de Faisan Rouge, aux Montagnes de l'Aigle, à environ vingt milles au sud-ouest de Battleford, et l'avertit que les Sauvages de la réserve étaient soulevés et qu'il serait massacré s'il ne prenait aussitôt la fuite. Le Sauvage, après avoir été arrêté et étendu sur le sol, lui-même de sainte main, de prendre le sentier qui conduisait à Swift Current, une station du chemin de fer canadien du Pacifique, à cent soixante-dix milles plus loin. Applegarth mit aussitôt sa femme et son enfant dans une barouche et, profitant d'un moment où les Sauvages étaient occupés à piller les magasins, il commença à aller vers le sud-ouest; le long et pénible voyage, auquel il était contraint pour sauver sa vie et celle de sa famille.\n\nIl n'était pas rendu loin, cependant, que les Sauvages se mirent à sa poursuite, et pendant toute cette nuit d'angoisse, jouant de ruse et de stratagème, ils parvinrent à détourner la suspicion de ses ennemis. Pendant deux jours, il fut continuellement en danger d'être pris jusqu'à ce qu'il eût rejoint le parti de réfugiés du juge Rouleau, qui avait quitté Battleford le 29.\n\nLe même soir qu'Applegarth fut attaqué, le Steney de la bande de Mosquito, établie sur la rivière voisine de celle de Faisan Rouge, massacra-t-il l'instructeur appelé Paine, qui, deux jours avant, avait reçu l'ordre de leur loyauté. Les deux bandes réunies, fortes d'environ cent hommes armés, se rallièrent à Poundmaker, et bientôt Battleford se trouva investi par une armée de cinq à six cents Sauvages.\n\nLes Sauvages ne firent pas d'attaques contre les casernes qui, construites sur une colline dominant la rivière, était aussi inexpugnable que le roc de Gibraltar à une armée de Sauvages sans canon. Mais en essayant de piller la partie de la ville la plus rapprochée du fort, ils vinrent à porter à portée du canon et de l'artillerie, qui, après quelques autres démonstrations, des décharges mortelles.\n\nPendant toute sa durée, ce siège a créé une vive anxiété dans le pays; on craignait surtout que les assiégés ne manquent de vivres pour nourrir tous les réfugiés. Il n'a guère offert d'événement digne d'intérêt, sauf, de temps en temps, l'arrestation d'un ou plusieurs de ces derniers, et les retournements des éclaireurs en essayant de communiquer avec les postes environnants.\n\nCHAPITRE IV.\n\nMAGASÈGE DU LAC AUX GRENOUILLES.\n\nEVACUATION DE FORT PITTS.\n\nAvec le soulèvement des Sauvages, nous entrons dans la phase des horreurs. Il faut remonter aux premiers temps de la colonie pour trouver des scènes comparables à celles dont certains partisans du Lac aux Grenouilles ont le regret de raconter pendant cette insurrection.\n\nLes passions des Sauvages une fois déchaînées, il n'était que trop facile de prévoir à quelles terribles excès ils se porteraient et nous nous trouvons dans cette situation étrange qu'après tant de si noble sang versé, il nous faut encore remercier la Providence de ce qu'il lui a plu de...\n\nBATTLEFORD.\n\nAttaqué par Poundmaker et sa bande.\n\n...ne pas exiger plus de victimes expiatoires de l'irruption cruelle de quelques-uns de ces enfants. Le calme noir est là, en effet, s'allonger de plusieurs lieues, et les nouvelles nouvelles se multiplient et s'accroissent du port-à-porte de manière que ce fait remarquable! La liberté éclairant le monde, un flambeau à la main, c'est l'idéal; mais quand on songe aux excès commis au nom de la liberté, ne serait-ce pas plutôt une torche qu'il faudrait allumer comme symbole?\n\nMais laissez faire, laissez faire! Aussi bien, la plume se refuse à dire le sentiment que font naître de pareilles atrocités. A peu près dans le même temps que le soulèvement des Sauvages dans les environs de Battleford, se produisait, à environ cent cinquante milles à l'ouest, une série d'accidents férocement éternellement désespérant de la civilisation ou de la force de l'humanité.\n\nFort Pitt, station de la police à cheval, sur la rive nord de la branche septentrionale de la Saskatchewan, à environ cent vingt milles au nord-ouest de Battleford, était occupé par une garnison de cinquante hommes, sous le commandement du capitaine Dickens, fils du célèbre romancier, qui était venu du Canada et avait été nommé inspecteur dans le corps de la police à cheval.\n\nÀ trente milles au nord-ouest de Fort Pitt est située la station et mission sauvage du Lac aux Grenouilles, où la résidence d'un couple de Sauvages, avant pas chef, le Gros Ours et le bizarre Gros Ours. Le 30 mars, la nouvelle de l'engagement du Lac aux Canards fut reçue par M. T. P. Quinn, l'agent des Sauvages au Lac aux Grenouilles. L'inspecteur Dickens lui laissa le choix, ou de venir se réfugier à Fort Pitt avec sa famille ou de laisser les Sauvages ou de consentir à ce que la garnison de Fort Pitt allait le retrouver. On tint un conseil de guerre et on décida que le détachement de police du Lac aux Grenouilles, composé de sept hommes seulement, partirait sans retard, car, sans être assez nombreux pour protéger les colons contre une attaque, leur présence irritait les Sauvages. Les colons crurent qu'ils seraient en sûreté une fois...\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nVUE DE EDMONTON,\nsur la Rivière Saskatchewan.\n\nqui parle le sioux, descendez.\" Le beau-frère de Quinn, Loveman, lui dit \"ne pas descendre, dédaignant ce conseil, Quinn descendit. Les Sauvages, après quelques instants et en considérant la maison de l'instructeur, arrivaient Delaney où ils rassemblaient tous les blancs du poste.\n\nLes Sauvages avaient fait beaucoup de fanfaronnades depuis quelque temps, mais personne ne leur supposait de mauvais desseins. Avant de se rendre chez Quinn, ils avaient entendu les chevaux de Cameron, qui descendait chez Quinn, et Loveman, qui prenait le parti de Quinn, se préparait à faire feu sur Esprit Voyageur dans une querelle à propos des chevaux.\n\nÀ la maison de Delaney, les Sauvages continuèrent leurs menaces et leur mauvais conseil. Puis Esprit Voyageur et certains Sauvages se rendirent au magasin de la Compagnie de la baie d'Hudson. M. Cameron, l'agent de la compagnie, était déjà levé. Mauvais Enfant se présenta le premier et dit :\n— Avez-vous des munitions dans le magasin ?\n— Oui, un peu, répondit M. Cameron.\n— Alors, je veux que vous nous les donniez.\n— Non, nous nous en empêcherons.\n— Si vous tenez à les avoir, je vais vous les donner, plutôt que de vous voir piller le magasin.\nM. Cameron était le seul fonctionnaire de la compagnie sur les lieux en ce moment. Il se rendit de sa résidence au magasin et lui donna ce qu'il y avait de poudre, de balles et de capsules.\n\nIl n'y en avait qu'une petite quantité. Un baril de poudre et quelque foyers les cartouches à balles avaient été envoyés du Lac aux Grenouilles à Fort Pitt sur l'avis de M. Cameron et d'autres personnes, après qu'on eût reçu la nouvelle de la bataille du Lac aux Canards. Pendant que Cameron sortait les munitions pour les donner, les Sauvages, leurs fusils chargés et prêts à faire feu, surveillaient le près.\n\nÀ ce moment Gros-Ours entra. Étant dans le magasin, et faisant tourner son arme, il dit à ses braves : \"Ne touchez à Hen ici, dans le magasin de la compagnie. Si vous avez besoin de quelque chose, demandez-le à Cameron.\" Après avoir obtenu quelques marchandises, tous sortirent, à l'exception de deux Sauvages amis. Cameron les suivit pour voir ce qu'ils allaient faire, mais Esprit Voyageur lui ordonna d'aller chez Quinn et de lui dire :\n\nPendant ce temps-là, on avait amené à l'agence presque tous les blancs du poste et Pritchard, l'interprète métis. Les PP. Fafard et Marchand y étaient aussi et la maison était pleine de Sauvages. Esprit Voyageur dit : \"Je veux savoir quel est le chef des blancs dans ce pays.\nEst-ce le voyageur ou le commissaire de la baie d'Hudson ou quoi ?\" Quinn dit en riant : \"Il y a un nommé sir John Macdonald à Ottawa qui est à la tête des affaires.\" Les Sauvages dirent :\n— Veillez vous nous donner du bœuf ?\n— Quinn demanda à Delaney s'il avait quelques bœufs qui pouvaient être donnés à alimenter. Delaney répondit qu'il en avait un ou deux et tous sortirent de la maison.\n\nCinq Sauvages ramenèrent M. Cameron au magasin et lui demandèrent d'autres marchandises. L'un des Sauvages du Lac aux Grenouilles, Wm. Gladwin, demanda aussi à Gros-Ours de lui donner le charge du magasin parce que, dit-il, vous avez toujours quelque chose à demander et il est inutile d'y conduire Cameron.\" Ils se rendirent à cette demande.\n\nPeu de temps après, Esprit Voyageur vint trouver Cameron et lui dit : Pourquoi n'avez-vous pas l'église ? Tous les autres blancs sont déjà là. Puis il le conduisit à l'église catholique. Ce jour-là étant le Vendredi Saint, les prêtres les Pères Fafard et Marchand, O. M. I. deux braves missionnaires qui s'étaient dévoués au service des Sauvages, célébraient l'office religieux. Les Sauvages s'étaient trouvé un corps de l'Église, et les prêtres avaient prié pour M. Cameron et Mme Simpson. Gros-Ours et le Misérable se tenaient de chaque côté de la porte et les autres étaient agenouillés pendant que se faisait l'office divin. Esprit Voyageur entra et mit un genou en terre au milieu de la pièce, se tenant son fusil dans la main. Il portait un chapeau de grève et il avait la figure badigeonnée de jaune par moquerie.\n\nLes prêtres terminèrent la célébration religieuse, puis le Père Fafard se leva et avertit les Sauvages de ne pas commettre d'excès.\n\nLes Sauvages conduisirent les blancs à la maison de Delaney et Cameron alla déjeuner, Ours Jaune et un autre Sauvage du Lac aux Grenouilles ne le lâchant pas.\n\nAprès déjeuner, Cameron alla au magasin. L'Oiseau-Roi, le plus jeune fils de Gros Ours, vint à lui et lui dit : \"Ne restez pas ici.\" Ours Jaune sortit alors des causeries en disant : \"Je veux un chapeau.\" Cameron lui dit : \"Viens avec moi !\" Ours Jaune dit : \"Emportez-le moi ici.\" Cameron répondit : \"Emportez-le moi ! tu m'a commandé de venir ici, s'il me voit retourner, il pourrait me tuer.\" Le Sauvage dit :\n— Ne vous inquiétez pas, je vais aller avec vous au magasin.\"\n\nEn route, ils rencontrèrent Esprit Voyageur qui leur demanda où ils allaient. Ours Jaune répondit : \"Au magasin.\" Ils allèrent au magasin et Ours Jaune prit un chapeau. Le Misérable entra portant un ordre de Quinn, probablement le dernier qu'il ait écrit. Cameron l'a en sa possession. Il portait :—\"Mon cher Cameron :—Veuillez donner au Misérable une couverte.\"\n\n(Signé) QUINN.\n\nCameron dit : \"Je n'ai pas de couvertes.\" Le Misérable le regarda en plein dans les yeux, mais ne dit pas mot. Ours Jaune dit : \"Ne vous en fait pas, n'est-ce pas ? pourquoi le regardez-vous comme cela ?\" \" Eh bien, répondit le Misérable, je vais prendre autre chose\" et il prit pour quatre à cinq piastres de marchandises.\n\nLe sachet de faire ces transactions lorsqu'il entendit la première détonation. Le Misérable tourna sur ses talons et sortit à la course. Cameron entendit quelqu'un crié :\n— Arrêtez, arrêtez.\" C'était Gros Ours qui était à converser avec Mme Simpson, la femme du facteur, dans la maison de la compagnie de la baie d'Hudson.\n\nPour éviter l'appréhension, Esprit Voyageur avait ordonné à tous les blancs de se réunir au fond des Sauvages et ceux qui étaient restés dans la maison de Delaney furent contraints de marcher.\n\nEn sortant du magasin, Cameron ferma la porte à clef. Il était occupé à la fermer quand\nun Sauvage courut à lui et lui dit : \"Dis deux mots, et tu es un homme mort. Un homme a dit deux mots déjà et il est mort.\" Cet homme, Cameron l'apprit bientôt, c'était Quinn qui, ne tenant aucun compte de l'ordre donné par Esprit Voyageur, avait continué à converser avec Charlie Gouin, le charpentier métis, devant la maison de Pritchard.\n\nEsprit Voyageur vint à lui et lui dit :\n\"Vous avez la tête dure ; quand vous dites non, c'est non, et vous êtes fidèle à votre parole. Eh bien, si vous tenez à votre vie, vous allez faire ce que je vais vous dire : allez à notre camp.\"\n\nQuinn, qui était un homme fortement charpenté, avait beaucoup de détermination et de courage et qui, de plus, avait pour les Cris tout le mépris que lui donnait naturellement son sang sioux, répondit avec insouciance à la menace du Sauvage : \"Pourquoi y irais-je ?\" — Ne t'en inquiète pas, lui dit Esprit Voyageur en faisant un geste de menace. Quinn répondit avec calme : \"Je retourne chez Pritchard.\" Esprit Voyageur leva le fusil sur la tête de Quinn et lui dit :\n\"Je t'ai dit d'aller\" et il le tua raide. Gouin, un métis américain, fut tué par les Sauvages immédiatement après, en se rendant à leur camp à quelque distance de la maison de Pritchard.\n\nLe petit groupe de blancs, hommes et femmes, que les Sauvages avaient rassemblé dans la maison de Delaney avait à peine fait quelques pas quand le premier coup de feu fut tiré. À ce fatal signal, Petit Ours trouva d'une balle la tête d'un vieux maçon écossais, Williscroft. Le jeune Harry Quinn, qui se trouvait au dernier rang des prisonniers, voyant Williscroft tomber, se glissa entre ses grilles, entra sous bois et s'enfuit. Il alla porter au Fort-Pitt la nouvelle de cette sanglante journée.\n\nLes fusils de bon nombre de Sauvages n'étaient pas chargés quand le premier coup de feu fut tiré et ils se mirent rapidement à les charger, tandis que les courageux missionnaires les suppliaient, les priant de faire preuve de patience et de chercher à laisser passer une raison. Tout en parlant les deux prêtres s'étaient jetés entre les Sauvages et Mme Gowlanock et Mme Delaney. Delaney se trouvait là tout près. Soudain, les Sauvages levèrent leurs armes et se précipitèrent sur Delaney. Le Père Safard se jeta entre les Sauvages et Delaney en menaçant les premiers, mais, seul et sans armes, il dut succomber sous le nombre ; il fut renversé sur le sol, le Cou Nu, après avoir été sur Delaney, et fut, lui aussi, précipité. Deux autres Sauvages, après avoir jeté le cadavre, se précipitèrent sur Delaney.\n\nEsprit Voyageur, avec la soif de sang d'une panthère et suivi par le Ver et autres Sauvages, se précipita en ce moment et tua le Père Safard qui, en voyant tomber son compère missionnaire, s'était jeté, seul et sans armes, entre les Sauvages afin d'enlever le cadavre. L'homme qui Gagne rachoya Delaney et le Père Safard qui, terriblement blessé, se mit à gémir à la neige.\n\nGowlanock et sa femme, qui marchaient en se tenant par la main, étaient, sur le chemin qui conduisait au camp, un peu en avant du premier groupe, et Le Ver, laissant Esprit Voyageur, sortit d'abord en crime, disposer du plus grand nombre de Sauvages devant l'avant, tua Gowlanock. Une balle traversa le corps ; celui-ci s'affaisa dans les bras de sa femme.\n\nPetit Ours tua Gilchrist d'une balle dans la nuque. Deli. Celui-ci, qui n'avait pas été touché, prit la fuite, mais, poursuivi de près par les Sauvages à cheval, il fut bientôt tué lui aussi.\n\nPendant ce temps, Cameron était resté avec Mme Simpson, la femme du facteur. Il demanda à l'Oiseau Jaune qu'il trouvait avec eux ce qui signifiait tout cela. L'Oiseau Jaune lui saisit la main et dit : \"Venez ici.\" Puis voyant Mad. Simpson sur le point de quitter sa maison, il lui dit : \"Faites avec elle ce que vous voulez.\" Il s'éloigna, avec madame Simpson, et arrivée à une courte distance de la maison, elle s'arrêta et appela l'attention de Cameron sur les prêtres qui en ce moment se tenaient à environ une centaine de verges plus loin, et avaient l'air de vouloir calmer les Sauvages. Voyant que les prêtres et Delaney allaient être massacrés et qu'il ne pouvait rien faire pour les sauver, il prit Mme Simpson par le bras, pensant qu'elle pourrait apporter un tel choc. Ils partirent ensemble et elle ne cessait de le presser et de lui répéter : \"marchons plus vite.\" Les Sauvages les entouraient partout. Mais il était inutile de tenter de fuir et il fallait attendre que la fuite soit-elle été tentée. Cameron eut été tué avant d'atteindre le camp.\n\nUn chef du lac aux Grenouilles du nom de Strike-him-on-the-back les conduisait dans une hutte où on leur dit qu'il ne leur serait fait aucun mal.\nLes Sauvages sortirent ensuite et revinrent avec Benoit Voyageur, qui les assura que lui et sa bande ne feraient aucun mal à Cameron ni aux autres prisonniers. Mme. Gowenlock était avec Mme. Delaney, ayant quitté sa maison pour s'entraîner dès le commencement des troubles. Les Sauvages amenèrent alors les femmes à leur camp, où le lendemain de l'attaque, les Sauvages avaient toutefois après avoir enfourché le mouton de la compagnie et les maisons. Quand les deux femmes arrivèrent au camp, des mères les accueillirent afin de les soustraire à la cruauté des Peaux-Rouges.\n\nJohn Prichard, l'interprète, acheta madame Gowenlock, pour 50 dollars, et Pierre Blondin donna 2 chevaux en échange de Mme. Delaney. Les deux femmes furent reçues dans la famille de Prichard.\n\nM. Simpson, le facteur de la compagnie de la baie d'Hudson, eut à Fort Pitt au moment du massacre; mais, dans sa situation, comme il s'agissait de Fort Pitt, il était prisonnier. On ne le maltraita pas, cependant, et on lui permit de rejoindre sa femme. Environ 24 heures après le massacre, les cadavres des victimes furent jetés dans les maisons vides après avoir été dépouillées.\n\nLes fêtes et les danses se prolongèrent pendant quelques jours et ce ne fut que lorsque Fort Pitt fut sur le point d'être attaqué qu'elles cessèrent. Il fallut toute la vigilance des Métis et des Cris des Bois pour sauver les prisonniers pendant ce temps de réjouissance.\n\nL'intention des Sauvages était de se rendre à Battleford et d'y rejoindre Poundmaker afin d'attaquer ensemble les casernes de la police à cheval, de sorte qu'ils se dirigèrent sur Fort Pitt et marchèrent environ dix jours. Ils ne retournèrent cependant pas à Fort Pitt, mais se hâtèrent de descendre la rivière. Ils assiégèrent plusieurs camps dans les environs de l'endroit où le gén. Strange les rencontra plus tard et commencèrent leur grande danse, qui fut interrompue par l'apparition des éclaireurs.\n\nM. Cameron est le fils de feu M. John Cameron, de Toronto, et petit-fils de feu le révérend chanoine Bleasdel, de Trenton. Sa mère réside à Toronto.\n\nDeux jours après la retraite de la police à cheval du Lac aux Grenouilles, Harry Quinn arriva à Fort Pitt, seul, sans armes, sans cheval et très épuisé. Il n'avait été témoin que des premières minutes de violence qu'il s'était permis de raconter naturellement, et pendant ses semaines, son récit constituait les seuls renseignements dignes de foi qu'on eût sur cette sanglante boucherie, que les députés prenaient plaisir à confirmer à l'oreille, à confirmer de nouveau, en passant les années qui suivaient de loin les perspicacités de ce drame, et des alternatives de joie et d'angoisses pénibles.\n\nEn apprenant cette affreuse nouvelle, la garnison de Fort Pitt se mit immédiatement à l'œuvre pour mettre le fort, qui n'était qu'un assemblage de billots, en état de défense. On flanqua les murs de bastions, on construisit une palissade et l'on mit des courriers en campagne, chargés d'obtenir de l'aide et des renforts, si possible.\n\nLe 14 avril, un poste d'éclaireurs, composé de Benoit, Quinette, les deux éclaireurs de Cowan et Loosby, de la police à cheval, partit dans la direction du Lac aux Grenouilles dans le but de se renseigner, si possible, sur les mouvements des Sauvages et le sort de leurs prisonniers.\n\nAvant qu'ils fussent de retour, une centaine de Sauvages parurent sur les collines en arrière du fort et Gros Ours envoya un message au capitaine Dickens, dans lequel il lui demandait de traverser la rivière, vu qu'il y aurait autant de peines du monde à calmer l'ardeur de ses jeunes guerriers.\n\nLa garnison passa cette nuit-là sous les armes. Le lendemain matin, McLean, le facteur de la compagnie de la baie d'Hudson à Port Pitt, et un jeune Dufresno sortirent pour parlementer avec les Sauvages. Vers midi, les éclaireurs en revenant au fort, observèrent la foule des Sauvages et deux d'entre eux, Cowan et Loosby, s'éloignèrent pour le traverser. Ils réussirent à atteindre le sommet des collines qui dominaient le fort, mais les Sauvages firent pleuvoir sur eux une pluie de balles, celles-ci se dispersant à peine de leurs visées fort. Trois membres de Cowan ne purent se relever, tandis que le quatrième, frappé de deux balles, fit le mort, attendant le départ des Sauvages pour regagner péniblement le fort.\n\nLe troisième éclaireur, le jeune Quinn, le seul survivant du massacre du Lac aux Grenouilles, entra dans le fort. Sa course, à pied et galopée dans la direction du Lac aux Grenouilles, suivie de près par les Sauvages qui s'étaient mis à sa poursuite. On fut quelque temps sans savoir de ses nouvelles. Les Sauvages apportaient une telle ardeur à leur poursuite qu'ils s'approchèrent à portée de fusil. On ouvrit contre eux un feu bien nourri, qui les força bientôt à reculer.\n\nMcLean et Dufresno, qui étaient sortis pour parlementer avec les Sauvages, furent retenus prisonniers. Dans l'après-midi, Mme. McLean reçut une audience officielle dans laquelle elle lui conseillait, à elle et à tous les civils, de se rendre à Gros Ours et de se mettre sous sa protection. Gros Ours s'était engagé solennellement à protéger tous les civils si la police évacuait le fort. La police informa en même temps le capitaine Dickens que la place serait incendiée, les Sauvages ayant préparé des boules de matériaux inflammables saturées d'huile de plomb pour mettre le feu au fort.\n\nAllant à contrecourant de l'avis de la police, tous les civils, hommes et femmes, résolurent de se livrer à Gros Ours. Ce petit parti se composait de Mme. McLean et de ses neuf enfants — dont trois étaient des jeunes filles qui, pendant une période de cruelle anxiété où l'on s'attendait à une attaque contre le fort, firent bravement le coup de feu pour coopérer à la défense, et quelques-uns étaient de tout jeunes enfants — George Mann, sa femme et trois enfants, le révérend G. Quinette, sa femme, Malcolm Macdonald, Hodgson, quatre Métis garçons de ferme, dont deux emmenèrent leurs familles, et le Sauvage ami Nakootan, avec sa femme et son enfant. Leur sort demeura un mystère pendant plus d'une longue semaine.\n\nLe soir de ce même jour, et rempli d'énigmes, une soixantaine de Sauvages de la police évacuèrent le fort et traversèrent la rivière. Le lendemain matin, n'ayant guère autre chose que leurs uniformes et leurs armes, ils s'embarquèrent dans un vieux bac pour aller à la rivière, où ils allaient en descendant la rivière au cours rapide, obstruée par des glaces flottantes et dont les rives étaient gardées par un ennemi sans pitié. Le temps était froid et rigoureux.\n\nLe premier jour, plusieurs des hommes se gelèrent les mains et les pieds et pour combler le manque, le sac de provisions, comme s'il fût percé et il fallut tenir six hommes occupés constamment à le vidrer pour le tenir à flot. Toutes ces misères ne réussirent pas, cependant, à faire perdre à ces vingt-deux braves leur courage et leur gaieté. Ils rièrent volontiers en disant de l'état de leurs conditions, en disant qu'ils allaient passer une journée entière sur une île pour l'inspection des armes et des munitions, qu'ils déclarèrent \"une grosse affaire.\"\n\nEnfin, le 22 avril, cinq jours après leur départ de Fort Pitt, ils arrivaient à Battleford, où, depuis une semaine, ils étaient réputés perdus et la joie fut grande en les voyant. Constatant les faiblesses de cette courte course, et la courte facilité ne suffire pas à les préserver de la mort : Inspecteur A. J. Dickens (fils de feu Charles Dickens) ; chirurgien d'état-major J. B. Rolph, M.D. ; Sergent John Martin ; caporal R. E. Sleigh ; constables W. Anderson, H. Ayre, J. W. Carroll, A. Edmonds,\nR. Hobbs, R. Juce, F. Leduc, G. Lionnis, C. Loasby, (blessé), J. A. Macdonald, L. O'Keefe, C. Philip, J. Quigley, F. C. Roby, G. W. Rowley, B. H. Robson, R. Audley, W. W. Smith, J. Tector et E. W. Ward.\n\nAprès la traversée du Lac aux Grenouilles, les colons établis sur le long des rivières de la branche septentrionale de la Saskatchewan et de ses tributaires, la rivière Bataille et la grande rivière du Chevreuil, à l'ouest des Montagnes Rocheuses, se réfugièrent à Fort Saskatchewan, au poste de la police à cheval sur la Saskatchewan Supérieure. Leurs maisons et stations de chemin de fer canadien du Pacifique, où ils allaient demander abri et protection. Pendant plus d'une nuit on put voir des forts et des stations, les flammes consumer leurs résidences, préalablement dévastées et pillées.\n\nCHAPITRE V.\n\nMOBILISATION DES TROUPES,\n\nSERVICE DE TRANSPORT.\n\nLes premières nouvelles d'un soulèvement sérieux des Métis dans le Nord-Ouest, créèrent une surprise générale dans les provinces de l'est. On savait bien qu'il y avait des incontents dans les provinces éloignées d'Assiniboine et de Saskatchewan. On avait bien eu connaissance des assemblées qu'ils avaient tenues, des résolutions qu'ils avaient adoptées, mais chacun attendait naturellement le moment que les effets politiques, plus ou moins récédés, qui pouvaient en découler, et n'entre voyait que de loin, et combien une possibilité très récédée et très probable qu'il deviendrait au point de menacer les droits essentiels de l'autorité. On était à cent lieues de s'attendre que les choses prendraient cette tournure et cette gravité. C'est le 23 mars que le premier ministre, Sir John A. Macdonald, en réponse à une interpellation de M. Blake, déclara à la Chambre que le gouvernement avait reçu la nouvelle authentique d'un soulèvement des Métis. Mais on s'attendait si peu aux précautions d'avoir une agression que même alors, on crut que la police à cheval, avec l'aide des volontaires du Manitoba, réussirait facilement à réprimer l'insurrection naissante. La désillusion devait venir à son heure. Les gouvernements, cependant, agit avec la plus grande prudence et l'opinion publique éclairée et désintéressée, dans ce pays et à l'étranger, est unanime à reconnaître que c'est à la promptitude, à l'énergie, à l'activité féconde et au talent d'organiser satiriquement le personnel de la milice, l'honorable M. Caron, dans cette circonstance, qu'on doit d'avoir eu l'insurrection circonscrite dans son foyer et ses progrès arrêtés avant qu'elle eût le temps de gagner les échelons les plus dangereux de tout l'entourage. Dès le 24 mars, le général Middleton, commandant général de la milice canadienne était dépêché à Winnipeg, où il arriva le 27 pour prendre personnellement le commandement des troupes en campagne.\n\nLe lieutenant-colonel Middleton avait à son compte des nombreux états de service dans plusieurs pays étrangers. En 1846, il prit une part très active à la guerre des Moors dans la Nouvelle-Zélande, mais ce fut dans la mutinerie des Chipayas dans l'Inde en 1857 et 1858, en prenant part au dégagement de Lucknow, comme aide de camp du général Gordon, qu'il se distingua particulièrement et fit preuve de précieuse reconnaissance des services qu'il avait rendus dans cette campagne. À l'escarmouche d'A-gengibur il exerçait un commandement et pour avoir deux fois vaillamment sauvé la vie d'un compagnon d'armes dans cette journée, au plus grand péril de sa vie propre, il fut recommandé par le général Lugard pour la croix de Victoria. L'honneur qu'il a distingué pour de Montréal, et aussi par la connaissance approfondie qu'il avait des hommes qu'il devait commander, il n'est pas de douter qu'en cette dernière campagne il ait été déployé en tout une prudence, une modération et des qualités militaires qui ont été hautement appréciées, non seulement ici, mais encore dans la mère-patrie et par les observateurs étrangers les plus compétents à le juger.\n\nLe premier bataillon appelé au service fut le 90ème Carabiniers de Winnipeg, le plus jeune corps de cavalerie montée, qui est de particulière importance dans le choix de son ordonnateur. Il n'y avait qu'un an qu'il avait été formé des meilleurs éléments — des hommes parfaitement exercés, des pionniers de l'est — par le lieutenant-colonel Kennedy qui à l'époque où son bataillon était appelé en service actif dans le pays, était en France comme commandant du détachement des voyageurs canadiens attachés à l'expédition du Nil. L'infortuné ne devait pas être témoin des brillants succès remportés par le corps qu'il avait formé avec tant de soin.\n\nLe 25 mars, un détachement de cent hommes de ce corps, sous le commandement du major Borell fut dépêché en route hâte à Qu'Appelle, car on doutait de la fidélité des Sauvages de la culée de Qu'Appelle et des montagnes de Ton-dre. Il était suivi, deux jours plus tard, après une revue passée par le général Middleton, du reste du bataillon, fort de deux cents hommes et de la batterie de campagne de Winnipeg avec le canon de 4.\n\nLe 27 mars le gouvernement avait sans doute été informé de l'engagement du Lac-aux-Canards, car ordre fut transmis ce jour là à Ottawa, aux commandants des deux batteries régulières de l'artillerie canadienne, la batterie A à Québec et la batterie B à Magog, de former chacune un détachement de cent hommes et de les mettre aussitôt en campagne. Quelques heures après la réception de ces ordres, de bonne heure le matin du 28, les deux détachements s'embarquèrent et arrivèrent à Ottawa, où les ordres du lieutenant-colonel Montzambert, entreprirent le long voyage à Winnipeg à bord d'un train du chemin de fer canadien du Pacifique. Le chemin, au nord du lac Supérieur, n'était pas terminé, mais on croyait à droite à juste titre d'espérer de la difficulté à obtenir du gouvernement des États-Unis son consentement au passage des troupes par le territoire américain et comme on croyait qu'il y avait quelque danger que les citoyens irlandais de l'ouest se fassent opposer en commun une idée avec les rebelles, ne tentaient de faire dérailler les trains, on décida d'envoyer les troupes par la route canadienne.\n\nLe 28 mars, la compagnie C de l'école d'artillerie réclamée de Toronto, forte de quatre-vingts hommes, deux détachements de deux cent cinquante hommes chacun, des Queen's Own et le 10me Grenadiers Royaux étaient appelés en service actif. Le Queen's Own qui avait reçu son baptême de feu sur le fatal champ de bataille de Ridgeway, lors de l'invasion féminine, a toujours aspiré au fier honneur d'être prêt à répondre à l'appel en toutes circonstances et bien que la convocation fût faite à bref délai, cinq cents hommes assistaient à la première parade. Il se composait presque entièrement de jeunes gens adonnés aux commerce et aux professions libérales, et son départ réveilla l'ardeur guerrière des citoyens de Toronto.\n\nLe 30 mars, les six cents volontaires de Toronto, les premières troupe de l'est appelées à la campagne, partirent pour le même rendez-vous que les batteries. Le 29, le lieutenant-colonel Williams, M.P., fut autorisé à lever un bataillon provisoire de huit compagnies du district central, en tirant deux pleines compagnies de son propre corps, et une compagnie de chacun des liniers 40me, 45me, 47me, 49me et 50me bataillons.\n\nLe 28, le vaillant 65ème Carabiniers Mont Royaux de Montréal, sous les ordres du lieutenant-colonel Ouimet, M.P., avait été aussi appelé en service actif. Ce fut tout un événement à Montréal, on ne manqua l'occasion de reparaître en vantant les brillants exploits de ce beau régiment. Le 30, le lieutenant-colonel O'Brien, M.P., était autorisé à lever un bataillon de huit compagnies, dont quatre tirées des cadres du 35me (Simcoe) et quatre des cadres du 12me (York). Le lieutenant-colonel Scott, M.P., était autorisé à lever une 91me ligne à Winnipeg, forte de trois cents hommes, et un autre régiment de plus de trois cents hommes était formé dans le même ordre par le lieutenant-colonel Osborne Smith, et devait constituer le 92me bataillon d'infanterie légère de Winnipeg. Un détachement de cinquante tirailleurs, choisis parmi les gardes à pied du gouverneur-général, sous le commandement du\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nLe capitaine Todd, rejoignait en route sur le chemin du Pacifique le contingent de Toronto, après avoir été formé et dépêché en très peu de temps.\n\nLe 31 mars, le 7e de London, Ont., sous le commandement du lieutenant-colonel Williams, et le 9e Voltigeurs du Québec, sous le commandement du colonel Amyot, M.P., étaient appelés en service. Un bataillon provisoire était formé de détachements tirés du 6e Fusiliers de la Princesse Louise, du 63e Caribou, des 2e et 3e de l'artillerie de garnison de Halifax, sous le commandement du lieutenant-colonel Brunner. Ce bataillon, fort de 350 hommes, ne partit pour le théâtre des opérations que le 11 avril.\n\nOutre ces corps réguliers de milice, un grand nombre d'hommes, dans toutes les villes du Nord-Ouest, se formaient en compagnies locales pour la protection des villes et même dans les villes des provinces de l'est, les vétérans des régiments tels que ceux des Queen's Own et des carabiniers Victoria s'enrôlaient pour faire le même service. En tout, les forces régulières appelées en service à cette époque comprenaient de 280 réguliers, 1650 volontaires de Manitoba, 1450 d'Ontario, 595 de Québec, et 365 de la Nouvelle-Écosse.\n\nLe 30 mars, l'avant-garde du 90e s'avança de la station de Qu'Appelle à Fort Qu'Appelle. Ce mouvement fut suivi d'une monotonie pénible d'inaction, car ce n'est que le 6 avril que les bataillons B arrivèrent à la station de Qu'Appelle avant même huit jours à faire le trajet. Elles avaient eu à lutter contre des ennemis formidables, un froid intense, des mauvais chemins, une fatigue extrême dès le commencement de la campagne. Entre l'extrémité occidentale de la section est du chemin de fer canadien du Pacifique et Jackfish Bay, à quatre-vingt-dix milles au sud-est de Fort Arthur, la ligne était interrompue sur un espace d'environ de cent quatre-vingt-dix milles. Elles en avaient franchi plus de cent cinquante milles en wagons découverts et le dernier, quatre-vingt-cinq milles à peu près, en traîneaux. Le transbordement fréquent des canons et des munitions — plus de six fois dans les portages — leur imposait une rude fatigante. Le contingent de Toronto, les Grenadiers plus particulièrement qui durent faire de longs trajets à pied, souffrirent beaucoup du froid très vif et des saisons de l'année en franchissant les portages. Il est juste d'ajouter que les bataillons qui les suivirent ne furent pas plus épargnés, sauf les derniers appelés en campagne, car la compagnie du Pacifique apportait toute la diligence possible au parcours de cette voie.\n\nDurant la saison d'inaction forcée que l'avant-garde passa à Fort Qu'Appelle, des rumeurs exagérant de beaucoup l'importance du mouvement insurrectionnel étaient mises en circulation. On disait que le grand chef cri, Piapot, qui exerçait une grande influence sur les Sauvages de la plaine, magnifiait à la rivière et des montagnes du Tondraké et à la rivière, donné, comptait dans sa propre tribu un couple de cents guerriers, étant entré dans le sentier de la guerre, bien qu'il n'eût pas, que l'on sût, compromis ses nations en abandonnant sa réserve. L'avant-garde des troupes du général Middleton, formée d'un détachement de 90 hommes avec quelques éclaireurs, quitta les montagnes du Tondraké le 3 avril et y établit son camp.\n\nDès que les nouvelles du soulèvement des Sauvages autour de Battleford lui furent parvenues, un détachement de quarante-cinq hommes de la police à cheval avec une pièce de campagne, sous le commandement du colonel Herchmer, s'était disposé à voler par marche dessiner. Le général Middleton, dont l'avant-garde était arrivée à 40 milles au nord vers le 6 avril, se chargea de décréser l'insurrection des Métis de la vallée de la branche sud de la Saskatchewan. A son arrivée à Qu'Appelle, la batterie de King's Royal Rifles fut ordonnée de s'aller réfugier le 30e et le bataillon de Windham. Elle fut suivie par une compagnie de cavalerie forte de 85 hommes et levée par le major Boulton, qui avait déjà pris du service dans la première insurrection du Nord-Ouest. Subséquemment, la moitié de la compagnie C de l'école d'infanterie de la ville de Grenadiers Royaux furent dirigés de l'avant à marches forcées pour rejoindre l'avant-garde.\n\nLe colonel Otter, commandant de l'école d'infanterie de Toronto et qui avait sous ses ordres les Queen's Own, reçut la tâche de dégager Battleford et de frapper au cœur le soulèvement des Sauvages de la plaine. La compagnie se composait de la batterie J de quatre-vingt hommes de la compagnie C, des Queen's Own, et des franc-tireurs d'Ottawa sous les ordres du capitaine Todd.\n\nAutour de Calgary, au pied des Montagnes Rocheuses, se trouvent les réserves des Pieds Noirs, une fédération de tribus qui pouvait mettre sur pied une force de plusieurs milliers de guerriers Sauvages du Nord-Ouest. Cette fédération, composée des Pieds Noirs des Bloods, des Piegans et des Sarcees, est alliée aux tribus des Montagnes Rocheuses, des frères de la montagne, d'où on avait fait revenir Riel, et l'on croyait qu'avant de partir, il avait invité les Piegans et les Bloods du Montana à passer la frontière, à se rallier aux Pieds Noirs, et après s'être emparé des postes de la police à cheval, de Fort McLeod et Assiniboine, de l'Est de la Colombie-Britannique et de la plupart des villes du Pacifique. Les principaux chefs de la fédération étaient Pieds de Corbeau, le chef de la nation, Trois Taureaux, chef des Pieds Noirs, et Queneau d'Aigle, le chef des Bloods. Pieds de Corbeau, le chef de la nation, déclara que Riel lui avait envoyé du tabac — invitation que le signe de se soumettre à quoi qu'il voulait pas voulu accepter. Les jeunes guerriers étaient assurément agités et excités et le fait est qu'il y eut des désordres à travers des Pieds Noirs, où l'on s'attendait de voir paraître les Sauvages du Nord, qui étaient entrés dans le sentier de la rivière pour engager les Pieds Noirs à prendre part au soulèvement.\n\nIl devint donc nécessaire d'occuper Calgary et les autres villes de cette région avec des forces suffisantes pour intimider les Sauvages. Le gâteau de Montréal fut envoyé à Calgary, où il arriva le 10 avril. Il fut placé sous le commandement du major général Strange, qui avait déjà levé une compagnie d'infanterie dans la province de la Colombie-Britannique. Comme Calgary était la station du chemin de fer le plus rapproché d'Edmonton, on en fit la base d'une expédition que le général Strange fut autorisé à organiser pour aller au secours de cette ville.\n\nLe département du commissariat fut confié à cet officier-vétéran, le major général Laurie, qui fut un des premiers à offrir ses services. À raison du mauvais état des communications, la question du transport était une affaire des plus importantes, et il est fallu un nombre immense d'attelages. On décida d'utiliser, si possible, la branche méridionale de la Saskatchewan, ouverte à la navigation, ouvront généralement pour le transport des approvisionnements à la colonne du général Middleton. Dès le commencement de l'expédition, le Sr. A. T. Galt avait mis à la disposition du gouvernement les vapeurs \"Albert,\" \"Baroness,\" et \"Minnow,\" qui se trouvaient sur la rivière et le vapeur \"Northcote\" partit de Medicine Hat et fut chargé de l'approvisionnement et du départ de ses quartiers d'hiver. Le 6 avril, il entreprit son voyage, qui fut l'un des plus aventurieux qui ait jamais été entrepris par un vapeur. Le \"Northcote\" est un vaisseau à hélice, plat, d'environ deux cents tonnes, et il appartenait à la compagnie de la Baie d'Hudson. Ses instructions étaient de faire des chasses pour la mobilisation des troupes et leur transport qu'un mois après que l'insurrection eut éclaté, on avait mobilisé une force de plus de 3000 hommes de toutes les branches de service et qu'on l'avait transportée, la plus grande partie à plus de 1800 milles et le reste à 2500 milles, et qu'elle devait être renforcée par des troupes levées à Manitoba et dans l'ouest. De plus la mobilisation avait eu lieu dans la plus mauvaise saison de l'année ; le Pacifique n'était pas terminé, les chemins d'hiver étaient défaits par le gel, les chemins d'hiver étaient défaits par le gel, les chemins d'hiver étaient défaits par le gel, et il n'y avait pas de navigation. Les corps de milice ont commencé à manquer d'un dixième de la milice disponible et il n'y a pas un bataillon dans tout le Canada qui n'ait désiré marcher de l'avant. Ces faits portent en eux-mêmes, leur enseignement et leur éloquence.\nMAJOR GENERAL STRANGE.\n\nCHAPITRE VI.\n\nEXECUTION DU PLAN DE CAMPAGNE—LA PREMIÈRE COLONNE.\n\nLa tâche de la première colonne était de frapper au cœur l'insurrection et chaque jour de retard était un gain pour Riel, qui recollait des partisans, par des moyens de contrainte, sur le plus tard. Les ravages aussi devaient être plus en plus agités. Il importait donc de partir par le plus court pour arriver le plus tôt. La station de Qu'Appelle à Batoche, le château-fort des insurgés, la distance est de deux cents trente miles. La route à suivre traversait en plus grande partie une prairie où la neige fondante avait détérioré les pistes, était coupée à certains endroits par des marécages, et les détritus semaient les chaussures des hommes et leur blessaient les pieds.\n\nLe temps était affreux, la pluie tombant parfois en abondance pendant le jour et le mercure descendant sous zéro au-dessous du point de congélation. Le froid était devenu extrême la nuit. Entreprendre une marche rapide au milieu de pareilles circonstances et se charger de combattre un ennemi invisible, dont on ne pouvait que conjecturer le nombre, mais qu'on savait se composer d'une manière en général écrasante, était une tâche qui fallait pour éprouver la force de résistance, la détermination et l'adresse des troupes, les mieux disciplinées et les mieux briesées aux fatigues du métier. La petite troupe qui avait à sa tête le général Middleton se composait de citoyens-soldats du Canada, de volontaires tous jeunes, des adolescents pour la plupart.\n\nLe premier mouvement de l'avant fut entrepris le 9 avril par un détachement du 90ème de Winnipeg et trente éclaireurs sous les ordres du capitaine French, qui atteignit les montagnes du Tondre le 10 avril. À cette date, la colonne, composée du reste du 90ème de Winnipeg, de la première moitié de la compagnie C, de la batterie de campagne de Winnipeg et de la batterie A de Quebec constituées en brigade sous les ordres du brigadier-major Bonnet-Blanc, du 10ème Grenadiers et des éclaireurs à cheval de Boulton, sous les ordres du colonel Gressett, était en route de Qu'Appelle aux montagnes du Tondre. Quatre cents attelages transportaient les bagages et les approvisionnements. Des montagnes du Tondre à Humboldt, station où elle devait être de retour le 23, les missiles du gouvernement qu'on craignait de voir tomber aux mains de l'ennemi, la distance était de 78 miles. Le temps était mauvais; il fallait traverser des plaines alcalines. Tout cela fut exécuté en quatre jours.\n\nElle est l'établissement de Humboldt ne fut situé qu'à soixante-trois miles de Batoche, les insurgés n'y avaient aucunement opéré. Ici la route bifurquait en deux sentiers, l'un se prolongeant presque directement au nord jusqu'à Batoche, l'autre se dirigeant, en longeant la ligne télégraphique, vers la Traverse de Clarke sur la Saskatchewan du sud. On prit le chantier qui conduisait à la Traverse de Clarke et l'avant-garde s'approcha de là à 25 miles à l'ouest de Humboldt au Lac Vermillion. On distinguait des feux de signaux sur les collines au nord et à l'ouest, ce qui prouvait qu'on était en pleine insurrection. Les insurgés étaient parfaitement instruits de la présence et des mouvements des troupes.\n\nÀ la Traverse de Clarke se trouvaient une compagnie basée comme elle en aurait été, qu'à quarante-cinq miles de Batoche, on crut que les insurgés songeraient à s'en emparer, à détruire les bacs et empêcher les troupes de traverser. Dans la nuit précédente, momentanément les éclaireurs de French, la compagnie C et quelques hommes de la batterie A partirent le lendemain matin et franchirent en huit heures les trente-huit miles qui séparaient de la Traverse de Clarke, qui se trouvait dès lors en sûreté.\n\nBien que les troupes eussent franchi en onze jours la distance que les soldats ordinaires de dépôt finissent en huit ou onze, douze heures de marche par jour, représentant une moyenne de vingt-un miles, les hommes étaient impatients d'arriver à Batoche. Il dut être fait halte, cependant, pour permettre au reste de la colonne de les rejouindre. D'un autre côté, les vivres de l'avant-garde commençaient à se faire rares. Et puis, il fallait se renseigner sur la disposition et les forces des insurgés avant de pousser la compagnie au-delà de la Traverse de Clarke.\n\nCes beaux jours d'avant-garde, le général Middleton se mit dans le cas de décider s'il deviserait son effectif déjà pas très considérable. Les insurgés occupaient les deux côtés de la rivière aux traverses au-dessous de celle de Clarke. Si le général s'avancait avec tous ses forces sur le côté est, il serait obligé de traverser le fleuve et de s'emparer de la rivière à l'ouest, détruire les ponts et l'empêcher de traverser. Ces côtés de la rivière étaient très escarpés, bien boisés du côté ouest, dépourvus d'arbres du côté est, de sorte qu'à couvert du bois, les insurgés pouvaient résister avec avantage à des forces de beaucoup supérieures en nombre, placées sur les berges de la rivière, voyant à découvert. Bien qu'il soit clair que son plan était sujet à critique, le général Middleton se décida de faire deux divisions de sa colonne et à s'avancer des deux côtés de la rivière. Il fallut quelques temps pour réunir les détails, faire transmettre à l'autre côté de la rivière la demi-colonne et les munitions après l'arrivée du dernier détachement.\n\nLe 27, le 10ème Grenadiers arriva au camp, ce qui complétait une certaine quantité d'approvisionnements. Ce même jour, parti de Winnipeg le 10, avait fait ce long trajet en sept jours. Il avait droit au repos, ayant accompli un exploit dont tout régiment pouvait s'énerguer.\n\nLe même jour, une reconnaissance fut poussée par un détachement de la milice de Boulton sous les ordres de lord Melgund. Ce jeune noble, le secrétaire militaire du gouverneur, était par ses gouts, par son expérience et par son éducation bien propre à la tâche qu'on lui avait confiée. Les hommes qu'il commandait étaient assez bien qualifiés pour ce service. Jeunes guerriers anglais et canadiens du district de Birtle, ils avaient offert leurs services au premier appel et armés de petites carabines Winchester, portant pour uniforme un costume de chasse, ils menèrent des raids sanglants qui pouvaient vivre de l'herbe de la prairie, ils formaient un corps d'hommes précieux, qu'on pouvait utiliser pour toute espèce de services et en toutes circonstances comme ils l'ont prouvé dans tout le cours de cette campagne.\n\nIl y avait à peine une heure qu'elle était partie du camp qu'ils traversaient un journaliste, un officier d'infanterie portant des marques qui avaient l'air d'indiquer trois sauvages. Quelques minutes plus tard, ils virent trois sauvages qui essayaient de se glisser dans une coulée. Les éclaireurs furent à la poursuite, mais avant de se rendre, ils se précipitèrent à faire une charge. Le sauvage, et le main sur la détente de leurs carabines Winchester, il n'était pas absolument facile de s'approcher d'eux. Lord Melgund les appela, leur dit qu'ils n'avaient rien à craindre, et après quelques minutes de conversation, ils s'approchèrent, le cœur et l'esprit en paix, des Sioux Tetons, de la bande de Bonnet Blanc, partie d'une tribu américaine qui avait pris part au massacre du Minnesota il y a quelques années et s'était réfugiée au Canada. Leurs chefs et sa bande s'étaient déclarés pour Riel, et tous les éclaireurs semblent s'étant ralliés à lui. L'un d'entre eux fut renvoyé au camp de Riel avec un message pour Bonnet Blanc, offrant une récompense de $100 à qui ramènerait, seins et saufs au camp du général, les sept prisonniers qu'on savait être aux mains de l'ennemi.\n\nLes seuls renseignements dignes de foi qu'on n'avait reçus de Prince Albert depuis quelque temps étaient contenus dans un message apporté par Frank Hourie, le fils de l'interprète du gouvernement, un jeune brave qui s'est distingué dans cette campagne par ses actes d'audace.\n\nIl partit de Humboldt le 28 mars avec un message du général à colonel Irvine. Le lundi 30, il arriva à la Traverse de Clarke où il vit que la débâcle avait commencé sur la rivière. Il essaya de traverser à la nage, se frayant un chemin à travers les bancs de glace flottante dont la rivière était pleine, mais il ne put réussir à cheminer. Il fit ensuite une ascension à l'endroit de la rivière. Il renouvela sa tentative le soir et cette fois il réussit. Ayant laissé son cheval sur la rive sud, il dut marcher jusqu'à Prince Albert, où il arriva le jeudi et remit ses dépêches. Il trouva\nle colonel Irvine réfugié en sûreté dans un fort fait de billots, ayant sous ses ordres un corps de huit cents hommes dont la moitié bien armés. Les colons du voisinage s’étaient réfugiés à Prince Albert, de sorte que, avec l’augmentation des forces à nouvelles vivres commençaient à s’émouvoir. Ce furent ces enseignements, qui lui furent communiqués aux montagnes du Tondre, qui décidèrent le général à opérer de l’avant. En dépit de tous les efforts, cependant, il ne fut pas possible à la colonne de s’ébranler avant le 23 avril.\n\nDans l’intervalle, les divers corps de l’est subitement appelés en service étaient un à un arrivés à Winnipeg par la route au nord du lac Supérieur après avoir enduré leur part de fatigues et de misères. Le bataillon Midland arriva à Winnipeg le 14 avril et fut dirigé presque aussitôt vers qu’il devait être. Le bataillon de Toronto le suivit et le 9ème de Québec, sous les ordres du colonel Amyot, était envoyé en garnison à Fort McLeod et Gleichen dans le district de Calgary. Le bataillon du colonel Scott, le 9ème de Winnipeg, fut envoyé à Fort Qu’Appelle le 18 avril afin d’interdire les Sauvages sur le Mâtou de la vallée et de protéger la ligne de communication autour du fort. Les gardes du corps du gouverneur général et l’école de cavalerie de Québec, les premiers corps de cavalerie mobilisées arrivèrent aussi à Winnipeg, le 20 avril et avec la cavalerie de Winnipeg furent formées en brigades forte de deux cents hommes à cheval.\n\nOn savait que l’île était trop étroite pour transporter suffisamment de vivres à la Traverse de Clarke par la route des prairies et la Saskatchewan du sud étant maintenant libre de glaces, on décida de transporter la base des approvisionnements à Swift Current et d’utiliser les vapeurs pour descendre les approvisionnements sur le fleuve Saskatchewan du sud du débarquement au nord de Swift Current à la Traverse de Clarke. Le vapeur “Northcote” arriva à Saskatchewan Landing le port de Swift Current, le 14 avril et l’on se mit aussitôt en frais de l’équiper pour son voyage en bas de la rivière. Vers ce temps arrivèrent à Swift Current deux autres Gatling, commandées à la Gatling Arms Company de New Haven, Conn., et envoyées sous la charge du lieutenant Howard, de la milice du Connecticut, qui devait se distinguer dans cette campagne.\n\nLIEUT.-COL. C. E. MONTIZAMBERT.\n\nCHAPITRE VII\n\nDERNIÈRE COLONNE.—MARCHE DU COLONEL OTTER.\n\nNous avons dit que le commandement de la dernière colonne était échu au colonel W. D. Otter à qui était assignée la tâche de dégager Battleford. C’était la première fois qu’il exerçait le commandement des troupes en activité de service et il prenait ce commandement avec le précieux avantage d’être connu et admiré par la plus grande partie de ses troupes auxquelles il inspirait la plus grande confiance. On verrait qu’il en était digne.\n\nLa colonne marcha donc vers Swift Current, la station du chemin de fer du Pacifique qu’on avait choisie comme base de cette expédition. À cette date un détachement de quarante-cinq hommes de la police à cheval sous le commandement du colonel Macdonald s’était rendu à Saskatoon Landing. Durant la courte période écoulée entre l’arrivée des troupes formant cette colonne et le premier ébranlement, on avait fait une somme énorme de travail en organisant un service de transport. Le 13 au matin, la colonne se mit en route et commença sa marche. La colonne comprenait comme suit : La compagnie A, forte de 45 hommes sous les ordres du lieutenant Wadmore ; la batterie B, major Short, 112 hommes avec deux canons de neuf et deux mitrailleuses à la charge du lieutenant Howard, de la milice de Connecticut, les tireurs d’Ottawa, capitaine Todd, 50 hommes ; les Queen’s Own, lieutenant-colonel Miller, 285 hommes.\n\nLe 14 avril au soir, la colonne était arrivée au sommet d’une haute colline surplombant une plaine ondulée et accidentée, où coulaient les eaux profondes de la branche sud de la Saskatchewan dont le courant se rapprochait de la rive nord. On aperçut le vapeur “Northcote” quittant la rive sud et une dépêche fut reçue du général Middleton ordonnant au lieutenant Howard d’accompagner avec l’une de ses mitrailleuses Gatling le voyage du “Northcote” en bas de la rivière jusqu’à la Traverse de Clarke, pour se rallier ensuite à la première colonne. Grâce à une aide de plusieurs autres troupes, il fallut trois jours pour traverser les troupeaux et provisions sur la rive opposée et ce n’est que le 18 qu’elle put s’avancer du côté nord.\n\nÀ partir de ce moment, il n’y eut plus de retard. On avait rassemblé cent cinquante attelages et les fantassins prirent place dans des wagons afin d’arriver au plus vite. Bataille ils ne furent pas éprouvés par de longues marches. Sur un parcours de plusieurs milliers de kilomètres une magnifique plaine dépourvue d’arbres et la marche ne fut marquée par aucun incident. Le soir, on formait un carré avec les wagons qu’on attachait les uns aux autres par des cordes. On attachait les chevaux à l’intérieur du carré et l’on dressait les tentes en dehors, de sorte qu’on évitait par ce moyen tout danger que les chevaux effrayés ne prennent la fuite.\nLe bois était si rare dans cette partie du pays qu'il fallait en emporter avec les autres articles indispensables, et un soir, la provision étant épuisée, les hommes durent se coucher sans feu et souffrir de froid. On envoya des wagons avec une escorte à une anse située à quelque distance en avant pour en rapporter des souliers, qui, dans la prairie, ne croissent que sur les bords des cours d'eau.\n\nLa colonne n'avait pas encore jusqu'ici rencontré un être humain. La distance par la route suivie entre Swift Current et Battleford était de 205 milles, le plus proche point de la colonne avait fourni une étape de trente-deux milles et demi. Le 23 au matin, quatre-vingts hommes des Queen's Own avaient été choisis pour faire le service d'éclaireurs, et la police à cheval était à une grande distance en avant de la colonne. Dans celle-ci était la veille d'entrer dans les bois et le terrain accidenté des montagnes de l'Aigle où l'on s'attendait à rencontrer les Sauvages. Il était trois heures de l'après-midi et le temps commençait à devenir de nouveau plus chaud, des marchandises charroyées quelque temps auparavant par un entrepreneur de transport incapable de se rendre à Battleford, avait cessé, quand l'ordre fut donné aux tireurs de se replier sur le corps principal de la colonne carrière de l'avant au galop des chevaux. Il n'est pas certain toutefois, en tête de la colonne de nature à causer une alarme, mais à une grande distance en avant, les éclaireurs de la police à cheval avaient découvert et arrêté le Chef Ross. Chargé de la police à cheval faisant fonction d'éclaireur, était à peu près en avant de la colonne avec six à huit hommes de la police à cheval quand il aperçut à quelque distance en avant de lui une quinzaine de Sauvages à cheval. Quatre d'entre eux se rapprochèrent à une courte distance de la police commandant leur attaque. Ils avaient affaire.\n\nAprès quoi de part et d'autre, on est échangé soixante à soixante-dix coups de fusil, les Sauvages tournèrent bride et s'enfuirent, laissant derrière eux une cargaison entière de provisions, mais pas de capture.\n\nCeci se passait le jeudi : Le vendredi 24, les éclaireurs furent envoyés de l'avant pour explorer la réserve des Sauvages Stoneys qui se trouvait à la route à franchir ce jour-là. Ils y aperçurent pas un Sauvage, mais ils découvrirent le cadavre de Payne, le malheureux instructeur agricole massacré par les Stoneys, le 31 mars, en raison d'une mauvaise augure qui avait probablement payé de sa vie ses efforts pour sauver l'instructeur. Toute cette journée-là, la colonne traversa un pays boisé, mais sans rencontrer l'ennemi ; et ainsi, à la nuit tombante, elle put percevoir, à la clarté des derniers rayons du soleil couchant, les blanches demeures de Battleford, et l'on était arrivé au but de l'expédition.\n\nL'ordre de camp fut donné, cependant, et si impatients que fussent les hommes de pousser jusqu'à Battleford, ils dressèrent leurs tentes. Peu d'entre eux dormirent pendant cette nuit car ils se sentirent agités par l'émotion naturelle qu'on éprouve à la veille du combat. Vers neuf heures, on entendit des coups de feu au nord et un détachement de la police à cheval carrière de ces coups étaient ceux échangés entre les éclaireurs et l'ennemi. Les Sauvages laissèrent dans cette escar-\n\n**LE CANON GATLING.**\n\nque le bac qui faisait le service de la traversée précédemment utilisé, un groupe d'officiers traversèrent et se rendirent au Fort où le camp fut dressé à côté des anciens bureaux du gouvernement sur le côté sud de la rivière.\n\nLes troupes apprirent de tristes nouvelles à leur arrivée. Dans la soirée du même jour, un officier de la garde connu sous le nom de Frank Smart, avec un homme de la police à cheval, faisait le service d'avant-poste à trois milles à l'ouest du Fort, fut tué par un Sauvage embusqué. Son compagnon de faction et son cheval furent tués et vins apportés la nouvelle au Fort. C'est là que fut passé sous les armes M. Smart, était un jeune marchand de Battleford qui avait risqué sa vie pour apporter à Swift Current la nouvelle de l'insurrection et de la mort tragique de pénible mission. Le lieutenant Ross apprit aux assiégés la nouvelle de l'expédition du colonel John qui fut accueilli avec de grandes réjouissances parmi la population du fort. 660 personnes étaient réfugiées dans son étroit enclos quand la ville fut détruite. Le colonel Otter avait débuté dans son commandement en faisant faire à un corps de troupes de cinquante hommes un trajet de cent soixante-six milles en cinq jours, soit une étape moyenne de trente-trois milles par jour.\n\n**CHAPITRE VIII.**\n\n**LA BATAILLE DE L'ANSE-AU-POISSON.**\n\nEnfin, le retard forcé apporté aux opérations de la première colonne et qui avait tant impatienté les hommes était fini et le 23 avril au matin, le camp fut levé et toute la colonne, partagée en deux divisions, s'embrasa vers le nord en suivant les deux côtes de la rivière. Bien que séparées par cette dernière, les deux divisions devaient se réunir et ravitailler les une possible l'une de l'autre afin de s'appuyer mutuellement, et l'un des bacs descendit la rivière en suivant les troupes afin de traverser l'une des deux divisions en cas de nécessité. Les deux divisions étaient à peu près d'égale force en armes de toute sorte. Le général Middleton prit en personne le commandement du côté est, qui devait être plus facile de rencontrer l'ennemi en force. Elle se composait de 90 hommes de la batterie A, avec deux pièces de campagne de 40 livres, de la compagnie C, de 80 hommes de la cavalerie de Bouillon et du 90ème bataillon, fort de 300 hommes, soit 480 hommes en tout.\n\nLa division du côté ouest était sous les ordres du lieutenant-colonel Montague, avec lord Melgund comme chef d'état-major. Son affectif se composait de 25 des éclaireurs de French, de 20 hommes de la cavalerie de Bouillon, de 32 hommes de la compagnie C, de 90 hommes de la batterie de campagne de Winnipege avec deux canons et des 10ème Grenadiers Royaux fort de 250 hommes, en tout 375 hommes.\n\nLe premier jour de marche ne fut marqué par aucun incident notable de cette manière, mais les éclaireurs furent lancés très en avant, car on savait que l'ennemi n'était pas loin. Après avoir fourni une rude étape de 18 milles, le colonel de dieu dressa son camp sur le bord de la Saskatchewan, à quelques milles seulement d'un ravin boisé où, quelques jours\nSOLDAT LEMAY, 68me BA.\n\nauparavant, un éclaireur revenant de Prince Albert, avec des messages avait dû se réfugier pour échapper aux insurgés. Fatigués par leur longue marche et le croyant en parfait sécurité, les hommes dormaient à demi endormis. Et cependant, si l'exécution des projets des insurgés n'était pas été contre-carrée par une cause qu'on ne s'explique pas, une attaque de nuit eût été dirigée contre eux, et dans la confusion qui eut probablement suivi avec des cris qui auraient pu être entendus, nous aurions été massacrés. Pendant que Dumont et ses Métis, embusqués dans le ravin, s'attendaient à voir l'arrivée de renforts qui leur eussent permis de mettre leur projet à exécution, ils passèrent des sentinelles au lieu d'avoir à donner la hâte, une alerte de nuit, étaient heureux de se dire les unes aux autres que tout avait bien été.\n\nNous ne saurions mieux faire que d'emprunter au rapport officiel du général Middleton les détails qui se rapportent à cette bataille.\n\nLe 23 au matin, les deux colonnes s'avançaient vers le sud-ouest, après avoir fait une halte environ 18 milles en bas de la rivière, une colonne près de la ferme d'un colon du nom de McIntosh, l'autre en ligne avec nous de l'autre côté. Après une nuit tranquille, nous nous remîmes en route le 24 au matin, à sept heures, en prenant les précautions militaires ordinaires.\n\nCAPT. LAFRENIÈRE, 68me BA.\n\nun détachement plus considérable du 90e engagé pour les surveiller, et de leur envoyer quelques obus dans le taillis de temps à autre.\n\nLe lieutenant-colonel Houghton, mon D. A., commandant de la compagnie, se trouvait engagé avec les assaillants et s'avancait sur eux faisant preuve de beaucoup de détermination et de sang-froid.\n\nQu'il me soit permis de signaler ici la détermination et le sang-froid du capitaine par d'autres officiers (notamment le Capitaine Drury) et les hommes de la batterie en transportant leurs canons à bras jusqu'au bord du ravin et subseulement au ravin opposé, trois de leurs étant blessés dans cet exploit.\n\nPendant ce temps, après avoir vu ce détachement s'avancer et déployer comme je l'ai dit plus haut, je traversai droit, au galop de mon cheval, après avoir préalablement envoyé mes deux aides-de-camp avec l'ordre de faire, déployer la moitié de la compagnie C et deux compagnies du 90e.\n\nEn y arrivant, je vis que l'ennemi essayait de tourner nos flancs droits, après avoir mis le feu à la prairie, car le vent soufflait de notre côté.\n\nVers ce temps, le capitaine Drury de la batterie A envoya un obus dans une maison située à quelque distance où l'on voyait les insurgés se rassembler et y mit le feu. Les insurgés, à ce moment, sortirent de la maison de la fusée, du ravin qui s'étendait à travers notre ligne de front et le feu était furieusement vif et nourri.\n\nMon aide de camp, le capitaine Doucet et plu-\n\nSERGT. VALIQUETTE, 68me BA.\n\nSOLDAT MARCOTTE, 68me BA.\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nMAJOR L. N. F. CROZIER,\nSurintendant de la Gendarmerie à cheval du Nord-Ouest.\n\nsieurs hommes furent atteints. Nos hommes furent forcés de reculer un peu d'abord, mais ils se rallièrent bientôt et s'avancèrent avec fermeté, couvrant le terrain de leur couverture les plus qu'ils pouvaient mettre en œuvre la même tactique que leurs ennemis, ils eurent refoulés de taillis en taillis, et les eurent mis en fuite.\n\n\"Je ferai remarquer ici que la tentative de nous refouler en mettant le feu à l'ennemi ne réussit pas, bien qu'à un moment la situation n'ait été difficile, mais j'envoyais chercher un détachement de conducteurs d'attelages qui éteignirent les flammes, encore qu'ils fussent pendant quelque temps exposés au feu.\"\n\nVers 2 heures p. m., les ennemis avaient disparu et avait cessé le bruit des hommes qui se trouvaient dans le ravin et dont le nombre, à en juger par leurs voix était réduit. Je cherchai à les atteindre au moyen des canons postés sur le côté opposé du ravin et je crus avoir réussi, car je jugeais les traces de sang trouvées sous-jacentes dans le ravin et le cadavre d'un Sioux trouvé dans les environs.\n\n\"Pour en revenir à l'action du flanc gauche, en traversant de nouveau pour aller le retrouver, mon homme de fourrage fut percé par une balle de fusil, et après être tombé, les hommes qui se trouvaient dans les tranchées, qui avait déjà essayé plusieurs fois de m'atteindre et qui, j'ai lieu de le croire, était Gabriel Dumont lui-même.\n\n\"Quelques minutes plus tard, comme j'étais de nouveau obligé de traverser avec mon aide-de-camp, le capitaine Wise, le même homme tira de la même place sur le cheval du capitaine Clark, qui abattit. Peu de temps après, je fus amené d'abord à le dire, le capitaine Wise en regardant au bord du ravin pour voir si l'ennemi y était encore, reçut une balle dans le pied.\n\n\"Je constatai que du côté de l'ennemi il n'y avait plus que le feu des hommes du ravin qui durait encore, le reste ayant retiré en désordre.\n\n\"Pendant l'action, un courrier de la colonne gauche arriva pour me demander si je fallait faire traverser les troupes. Je donnai l'ordre de faire traverser le 10ème Grenadiers, ce qui fut exécuté de la façon la plus prompte au moyen du bac, une compagnie conduite par lord Melgund, arrivant vers 3 heures p. m., et un peu plus tard deux autres compagnies sous les ordres lieut.-col. Grassett, avec deux pièces de la batterie de campagne de Winnipeg sous la charge du major Jarvis. Comme l'affaire était alors à peu près finie, je ne contentai de faire déployer ma compagnie du 10ème sur le centre droit pour aider à surveiller le ravin où se trouvaient les troupes de l'ennemi, les autres compagnies formant une ligne droite à l'extrême droite et y restant définitivement jusqu'à ce qu'on transportât les blessés au camp dont, dans l'intervalle, on avait choisi l'emplacement.\n\n\"Qu'on me permette d'attirer particulièrement l'attention sur la traversée de ces troupes, dont les services héroïques n'ont pas été rendus manifestement par l'effet. Il faut avouer qu'il n'était pas facile de traverser la rivière avec le matériel que valait la rafale, avec laquelle cette traversée a été opérée en dépit des difficultés qu'elle présentait : des hautes boîtes de chaque côté, de 100 pieds de haut, à fond, de gros galets incrustés dans une bonne épaisseur de glace, une frange d'épaisses bandes de glace de chaque côté, et une rivière à traverser transportée au plus 60 hommes à la fois, que faisaient mouvoir des hommes armés de rames façonnées avec une hache, et un courant rapide de 3 ou 4 milles à l'heure, voilà les obstacles qu'il fallait vaincre à force de détermination et d'efforts de tous les officiers et soldats de l'armée et d'aider leurs camarades.\n\n\"Pendant ce temps, M. Rodson et M. Secrétan avaient formé à l'aide de quelques wagons une sorte de carré (zareba) où les médecins établissaient un hôpital temporaire et accomplirent leurs fonctions de manière calme, froid et calme, sous le contrôle intelligent du chirurgien-major de brigade Orton, du 90ème bataillon.\n\n\"Un peu plus tard, voyant que le feu avait cessé et que l'ennemi s'était enfui, à l'exception de deux ou trois qui se laissèrent pour la maison munitionner et descendre de l'autre côté, nous dressâmes le camp, au milieu d'un violent orage, dans un terrain découvert près du champ de bataille et choisi, comme je l'ai dit plus haut, par lord Melgund. Je joins à ce rapport une liste officielle des tués et des blessés.\n\n\"Il est regrettable qu'elle soit si considérable, mais elle est due à la bravoure de ceux qui devaient attendre, en tenant compte des circonstances dans lesquelles nous avons été attaqués et du fait que pas un des hommes qui ont pris part à l'action n'avait vu le feu à part moi. En outre je n'ai eu qu'environ 350 hommes engagés, et je peux dire le chiffre de 100 tués environ, 300 blessés.\n\n\"En ce qui concerne les pertes de l'ennemi, tout ce que, comme question de fait, nous avons pu découvrir sur le champ de bataille a été trois cadavres de Sauvages, mais j'ai la conviction qu'il a éprouvé des pertes assez sévères sans quoi il n'eût pas abandonné une position aussi forte et une position que, d'après\n\nCAPT. CLARK.\nBlessé à la bataille de l'Anse aux Poissons.\n\nLIEUT-COL FORREST\nQuartier-maître des troupes du Nord-Ouest.\n\nla quantité de vivres trouvée dans les différentes maisons, il s'attendait certainement à exécuter pendant quelques temps.\n\n\"Il est donc d'avoir à passer quelques jours dans mon camp actuel, jusqu'à ce que je puisse traverser une bonne partie de toutes mes troupes, officiers et hommes, se sont tous conduits et je dois les remercier tous ainsi que leurs divers commandants ; mais je ne peux mettre de mentionner par leurs noms ceux des officiers que j'ai particulièrement remarqués pour avoir pu les observer perspicacement et auxquels je dois une reconnaissance particulière : le capitaine Haig, T. R., et mon adjoint-quarter-maître général ; mes deux aides de camp, le capitaine Wise et le lieutenant Doucet, qui m'ont beaucoup aidé et m'ont rendu de grands services ; le major Sutherland de la compagnie C, du corps de renfort, le lieutenant-colonel Bessell et le capitaine Buchanan du 90ème bataillon, qui m'ont été d'un grand secours pour tenir le droit et forger éventuellement l'ennemi à retraite, sans un fort et une vive attention, pour faire un cheval tueux sur lui. Le sang froid et la fermeté déployés par le major Boniton en contenant l'ennemi au commencement de l'engagement ont été remarquables et ont été de grands services. MM. Rodson et Secrétan ont rendu un soin de grands services aux médecins pour leur hôpital temporaire qui était presque sous le feu de l'ennemi.\n\n\"Il doit aussi des remerciements au chirurgien-major de brigade Orton, du 90ème bataillon, les hommes de service d'ambulance ont aussi bien rempli leurs devoirs, n'hésitant pas à exécuter les blessés sous le feu de l'ennemi.\n\n\"Il ne saurait terminer sans mentionner un petit troupeau du 10ème régiment, officiers et soldats, qui s'est particulièrement rendu utile dans le transport des munitions au front droit alors que le feu était le plus vif. Il faisait ce service avec un sang froid particulier, marchant et criant avec calme. Eh bien, qui veut des merveilles?\"\n\n\"J'inclus dans ce rapport un extrait du champ de bataille fait par mon A. Q. M. G., le capitaine Haig, T. R.\n\n(Signé) \"Fred. Middleton\"\n\n\"Major Général.\n\nCommandant de la milice canadienne de l'expédition du N. O.\"\nARRIVÉE DU 6ème BATAILLON À WINNIPEG.\n\nLe 6ème bataillon des Carabiniers Mont-Royal, un régiment composé presque exclusivement de Canadiens français, est arrivé à Winnipeg le 17 avril. En dépit de tous les efforts pour hâter le départ de cette division, les difficultés presque insurmontables qu'on rencontrera dans l'organisation du service de transport causèrent des retards, et même après l'arrivée du 92ème bataillon de Winnipeg, le 17 avril, il s'écoula encore quelques jours avant le départ de la colonne.\n\nA ce moment-là, le lieutenant-colonel Quimet, commandant du 6ème, partit de Calgary pour revenir à Montréal où il appelait des affaires personnelles et la maladie. Ce voyage entraîna, en plein milieu de la campagne, une diminution de la population de la région de Calgary, qui était absente en vertu d'un congé du général Strange. Quelques jours après son arrivée à Montréal, il retourna prendre le commandement de son bataillon.\n\nLe 92ème avait à peine établi son camp que les officiers canadiens de la route d'Edmonton commencèrent à arriver à Calgary. Le marquis du révérend M. Gaeté, de l'Orignal Rouge, fut pillé par les sauvages pendant que le propriétaire accompagné de ses fils conduisait sa famille à Calgary. Les magasins de Baker et Baylis, à la rivière Bataille furent aussi pillés mais personne ne fut molesté.\n\nLa mission de la colonne du général Strange consistait à passer le fort Pitt et de reconquérir le Fort Pitt qui avait été pris alors en danger, bien qu'à cette date, on ne connût pas encore toute l'étendue du soulèvement dans ce district.\n\nUn parti d'éclaireurs qui servait d'avant-garde à la colonne fut envoyé en avant avec l'ordre de s'emparer de la traversée de la rivière de l'Orignal Rouge et le matin du 19 un détachement composé de cinquante éclaireurs sous les ordres du capitaine Steele et du lieutenant-colonel Hughes, partit pour le nord sous les ordres du général Strange.\nLa route s'étend à travers la prairie presque sans arête, et quelques marais furent les seules difficultés que les soldats eurent à rencontrer sur leur chemin. Samedi, le 26, la première étape était bien évidemment franchie. Le détachement campa sur le bord de la rivière et une partie des wagons de transport furent renvoyés pour porter les provisions à la seconde colonne.\n\nOn traversa la rivière, qui sans difficulté le lendemain, et on continua à s'avancer 5 plus petites journées, à travers un pays plus accidenté.\n\nLe 23 avril, la 2e colonne composée de l'artillerie du régiment de cinquante hommes de police à cheval avec deux cents mules et de cinquante carabiniers à cheval d'Alberta, tous sous le commandement du major Perry, un gradin de l'école militaire de Kingston, se mit en marche. Cette colonne atteignit la rivière de l'Original Rouge le 28 avril ; cette rivière que la première colonne avait pu traverser en quelques minutes était devenue un fort obstacle. On construisit une ponte à partir de bateaux et l'on essaya de faire traverser, mais le bateau se brisa et c'est grâce aux efforts désespérés du major Perry que le bateau fut sauvé sur lequel on avait mis le canon, les munitions, etc., à partir de la rive gauche au moment où le major Perry fit le dessin d'un bateau et les soldats s'étant procuré quelques matériaux bruts, un bateau passable fut construit en trois jours.\n\nLe 30 l'aide droite du 92e, le régiment de Victoria, commandé par le colonel Osborne Smith à Winnipeg, sembla être la colonne la plus complète de la division du général Strange. Le bataillon du lieutenant-colonel Smith était composé d'hommes d'élite qui se distinguèrent en se rendant à Edmonton en neuf jours de marche ou onze jours en comptant les haltes. Le capitaine Steele avec un fort détachement de police et d'escorteurs fut envoyé dans la direction de Victoria pendant que le général Strange, le général Smith et le fort Saskatchewan. Le major Perry avec la deuxième colonne arriva le 12 mai, et lorsque le 12, l'aide droite du 92e et 46 escouadeurs furent aussi arrivés, le général Strange se trouva à la tête d'un corps de 700 hommes composé comme suit : 300 de police, 90 de cavalerie, 70 hommes de police à cheval, 50 carabiniers à cheval d'Alberta, 46 escouadeurs et les 190 hommes du 92e. On avait hâte à la construction des bateaux plats qui devaient servir à se rendre par eau jusqu'à Fort Pitt ; et malgré les rumeurs concernant l'arrivée d'une expédition de 14 mai, le 15, elle descendit la Saskatchewan vers le sud en sept barges construites à la hâte, et quatre compagnies du 65e sous les ordres du lieutenant-colonel Hughes partirent par la route du Nord, le rendez-vous étant fixé à Victoria à 74 milles d'Edmonton sur la rivière.\n\nLe 18 un détachement de 120 hommes, un canot et 340 fardeaux complétant à Victoria. Le lieutenant-colonel Ouimet qui malgré la maladie avait rejoint son régiment en exécutant des marches forcées, fut laissé en garnison à Edmonton avec les quatre autres compagnies de son régiment.\n\nOn régimentait une compagnie de colonnes et de Mèze pour protéger Victoria et l'ancien poste entouré d'un palissade en bois et d'un petit bastion fut mis en état de défense. On répara le bateau plat en l'entourant de défenses à l'épreuve des balles, et toute la flotte fut munie d'ancres imposantes. Le bateau plat, sur lequel le canon était accroché de telle sorte que, bien que l'on fut privé de toute force motrice on pouvait se servir du canon dans toutes les directions. Le capitaine Steele, avec un détachement de cent escouadeurs et hommes de police, était beaucoup en avant des autres et la marche de la colonne fut retardée de quelques jours pour attendre de ses nouveaux les être renseignés sur les faits et gestes de Gros Ours et sur le sort des 30 prisonniers.\nCHAPITRE X.\n\nMONTAGNE ET CAMP DE POUTLAU\n\nÀ l'arrivée du général Otter à Battleford les bandes de Sauvages qui parcouraient la ville en plein jour et qui pillant toutes les maisons qui étaient hors de la portée de l'unique canon de la caserne disparurent, mais les cours de fer, près sur le sentier, demeuraient encore de crainte que chaque bruissement de crinière ne fasse un marauder aux agents. Les services de Mossonou, Petit-Pin, L'Enfant du Tonnerre, Patou-Rouge et Mosquito étaient donc là et l'on pouvait que beaucoup de ces Sauvages étaient allés rejoindre Poundmaker, sur sa réserve au sud-ouest de la ville.\n\nAprès une marche à escarmouche, les troupes arrivèrent quelques jours pour se réfugier dans le fort Otter qu'ils construisirent sur la rivière sud de la rivière Bataille, vis-à-vis les casernes, et aussi pour murmurer à propos de leur ravitaillement qui en tout temps et en tous lieux est considéré invariablement d'un morceau de lard, un morceau de mauvais bœuf et de biscuits. Même quand l'ordre de ces mets était renversé, le lard n'était pas moins bon, le bœuf plus coriace et les biscuits moins succulents.\n\nUn jour vers la fin d'avril, un messager arriva à Battleford et raconta qu'il s'était évadé du camp de Poundmaker où il avait été retenu prisonnier avec plusieurs autres messagers. Il ajoutait que les mets se tournaient contre les Sauvages s'ils étaient attaqués par les troupes et que si l'attaque avait lieu sans retard, avant l'arrivée de Gros Ours et de sa bande que Poundmaker avait envoyé chercher, où les vainscrirait facilement.\n\nSi Poundmaker opérait sa jonction avec Gros Ours ou il attaquait Battleford ou il irait rejoindre Rielle. Le colonel Otter, soit pour punir immédiatement des séditions ou l'empêcher de commettre de nouveaux méfaits, décida de lui porter un coup inattendu.\n\nLe 1er mai, à 2 heures de l'après-midi, il sortit de Battleford à la tête d'une colonne composée de 75 hommes de la police à cheval commandée par le lieutenant-colonel Horchler, 30 hommes de la batterie B (Kingston,) sous les ordres du major Short, avec deux canons de sept et un Gatling ; 20 hommes des gardes d'Ottawa, lieutenant Gray ; 40 hommes de la compagnie de l'infanterie de la Queen's Own, capitaines Brown et Hume et 40 carabiniers de Battleford, capitaine Nash.\n\nCette après-midi là la marche ne se fit pas par un pays découvert, mais par un pays accidenté, coupé de nombreux ruisseaux, de hautes épaisses interrompues par des collines à travers lesquelles passait la route.\n\nÀ la tombée de la nuit la colonne fit halte et après avoir allumé des feux, les hommes prirent un bon repas. On jugea inutile d'essayer à cacher la marche des troupes à l'ennemi, car en sortant de Battleford on avait vu des colonnes de fumée s'élever vers l'ouest et on était convaincu que c'était le signal donné à Poundmaker par ses éclaireurs.\n\nEn attendant le lever de la lune pour les éclairer dans leur marche, les hommes se réunirent autour des feux en causant de la prochaine bataille et de ses chances de succès. Quelques soldats de la compagnie C, donnèrent aussi un concert improvisé.\n\nVers onze heures et demie, lorsque la lune, maintenant à son déclin, fut assez haute pour éclairer la route, les feux firent un moment de silence et la colonne à cheval ou montée sur des wagons s'avança rapidement vers l'ouest, sur les pas des éclaireurs et des tireurs de la police qui avaient pris le devant.\n\nLa lumière fantastique de la lune éclairait en plein chemin devant les soldats, mais les ténèbres qui traversaient le paysage, le loin de grandes ombres mystérieuses, qui donnaient à penser à plusieurs, combien d'entre eux survivraient si cette longue colonne silencieuse était tout à coup attaquée du côté du bois.\n\nAu lever du soleil, les troupes arrivèrent à l'entrée d'un amphithéâtre naturel, où l'on trouva les traces d'un campement récent. Il était évident que les \"Nights\" avaient du laisser la place à la hâte.\n\nLe chemin traversait ce camp, et se dirigeait encore vers le droit, longeant un coteau à une élévation et passant dans un ravin qui était juste assez profond pour rendre très difficile le passage à gué des wagons. La tête de la colonne s'avançait à travers le bois, au nord-ouest du ravin, espérant être protégée des éclaireurs ou pressés le pas. Ces hommes de police qui étaient à cheval sortirent du bois et franchirent le cours d'eau. Ils gagnèrent rapidement un magnifique site élevé et couvert de gazon, au sommet du ravin, sur une colline. Les canons suivirent au galop, mais ils n'étaient pas encore en position au sommet de la côte lorsqu'elles balles commencèrent à siffler, et la bataille avec...\nPoundmaker était commencé. Il semblait qu'on avait préparé une ambuscade et que les Sauvages s'imaginaient prendre les troupes dans le piège naturel formé par le marais qu'elles venaient de franchir.\n\nMais il comptait sans cette marche de nuit et comme il était le peu près cinq heures; les Sauvages étaient pris à l'improvisée.\n\nUn retard de quelques minutes leur aurait permis de s'emparer du sommet de la côte, et Dieu seul sait quel aurait été le résultat de la bataille dans ce cas. Poundmaker avait choisi son terrain; à ce même endroit, plusieurs années auparavant, il avait combattu les Sarcos commandés par leur chef Coup-de-Couteau et les avait complètement défait. C'est depuis cette bataille que l'endroit porte le nom de \"Coup-de-Couteau.\"\n\nLes huit ou neuf Sauvages tatoués et enveloppés de couvertes, qui constituaient l'avant-garde, entrèrent dans la coulée à environ deux cents verges en avant des canons; entre les canons et la coulée le terrain était plat et découvert. A cette première décharge des Sauvages, le corps de Sleigh de la police à cheval fut frappé d'une balle à la tête. Son camarade Ross, qui se trouvait toujours là où il y avait du danger le prit dans ses bras et l'emporta sous le feu de l'ennemi.\n\nLes timoneurs se mirent à l'œuvre, et les obus commencèrent à pleuvoir sur l'endroit où l'on savait que l'ennemi se tenait caché. Un de ces obus éclata juste au milieu du camp des Sauvages, renversant une demi-douzaine. Il n'y a pas de doute que le canon Gatling mit hors de combat beaucoup d'assaillants, bien que le résultat n'ait guère été en proportion des efforts considérables qu'il a lancés par ses six bouche pendant l'engagement.\n\nPendant que la batterie B et la police à pied occupaient les postes avancés, les autres troupes, après avoir attendu de la fin après une longue marche de nuit, s'élançaient à leur poste de combat sans même prendre un biscuit avec eux, et les balles de Gatling, de leurs têtes avant, qu'ils essayent de se mettre à l'abri, en se couchant sur le revers de la coulée. À gauche près du fleuve se tenaient les Gardes de la province, commandés par le général; le Queen's Own étaient plus en arrière, du même côté, pendant que les carabiniers de Battisford défendaient l'arrivée de la gauche. Les soldats de la Compagnie C, accompagnés au début de quelques hommes des Gardes d'Ottawa, formaient l'aile droite.\n\nLes officiers et les chevaux avaient été rassemblés dans le carré inoccupé formé par les troupes et les conducteurs se tenant à l'abri derrière les roues. Cependant personne ne regardait faire. Il était évident que les Sauvages essayaient de cerner les troupes en profitant de l'abri que leur offraient les ravins et ils ont bien failli y réussir.\n\nOn en vit quelques-uns à pied et d'autres à cheval s'élançant pour s'emparer de la colline à droite, sur l'autre côté de la coulée. La compagnie C s'était avancée tentativement en faisant une charge et en occupant elle-même la colline. Pendant un certain temps la compagnie fut exposée à un feu très vif. Pendant que cette progression mouvement pour retraiter lentement les Nichis jugeaient le moment opportun et dirigèrent leurs balles sur les habitants rouges.\n\nSur la gauche les Gardes, placés entre trois feux étaient dans une position critique. Des Sauvages ou des métis étaient embusqués dans le bas de la colline, protégés par le bois et la nature du terrain; pendant que d'autres occupaient une colline plus en arrière et tiraient par-dessus la tête de leurs compatriotes, qui apparaissaient rarement les premiers; les francs tireurs de la Garde, pour diriger leur feu, se guidaient sur la fumée qui s'échappait des mousquets ennemis. Ceux qui occupaient la colline montraient de la mollesse à tirer. L'ennemi était assez à une grande distance par un homme de la police, qui était couché près des wagons.\n\nPresque au commencement de la bataille, le lieutenant Gray, conduisit ses hommes au bas de la coulée, du côté opposé à celui que défendait en ce moment la compagnie C, pour se placer à une centaine de pas de face que l'on redoutait. Ils furent reçus par une vive fusillade et durent reprendre leur première position. Osgood, soldat de cette compagnie devançait les autres et...\nlorsque l'ordre fut donné de retraiter il avança encore pour se mettre à l'abri dans le bois, mais il fut frappé et tomba juste au moment où il allait être trouvé à couvert ; son cadavre n'avait pas été retrouvé.\n\nLes Queen's Own avaient à battre contre les mêmes ennemies et la même manière de combattre.\n\nAu commencement on déposa beaucoup de poussière et de pluie à travers sur des couvertures et des chapeaux que les officiers portaient en évidence pour tromper l'ennemi, et chaque fois qu'un soldat se levait à demi pour viser sur ces chapeaux ou ces couvertures il servait de cible à un sauvage qui guettait ce moment là.\n\nBientôt les blancs s'aperceurent de la ruse et ils poussèrent leurs têtes aux pointes rouges.\n\nVers le milieu de l'engagement vingt hommes des Queen's Own reçurent l'ordre d'aller prendre la position qu'ils avaient été obligés d'abandonner sous un feu croisé et bien nourri. Nou seulement ils exécutèrent l'ordre mais ils dépassèrent l'élévation qui les protégeait et avec des cris ils s'élançaient dans la direction du bois.\n\nIls vinrent si près des sauvages que le lieutenant Brock, qui commandait la charge put se servir de son fusil. De plus la situation était beaucoup trop exposée et les soldats retournèrent se mettre à l'abri du versant de la côte.\n\nL'enseigne Cooper reçut une violente blessure pendant cette charge, et il fut abandonné sur place et secouru par les soldats Jake Spence et Campbell. Les hommes de l'ambulance le transportèrent malgré ses protestations. Il ne cessait de répéter qu'il avait son compte et qu'ils feraient mieux d'aller porter secours aux deux qui avaient encore besoin d'eux.\n\nVarey fut blessé à peu près en même temps. Spackman, le joyeux sergent major de brigade, faisait le coup de feu avec les Queen's Own contre les mêmes soldats, lorsqu'il reçut une balle dans le bras gauche, près de l'épaule.\n\nPendant ce temps-là l'artillerie avait fort à faire. Les affûts des deux canons de 7 étaient verrouillés et un des tourelles s'était rompu à la première décharge. Au sixième coup l'affût céda complètement sous le mouvement de recul, et à chaque fois il fallait soulever le canon de terre pour le recharger.\n\nL'autre affût s'était rompu avant la traversée de la Saskatchewan et s'était réparé à la hâte sur le terrain.\n\nDans de telles circonstances il n'est pas étonnant que l'artillerie ait failli avoir un combat corps à corps avec l'ennemi. Les Sauvages se précipitèrent sur les canons et les artilleurs, aidés de force par le major Short et le sergent Varey, repoussèrent les assaillants et les soldats à ses côtés ; et la baionnette au canon de leur fusil ils s'élançaient sur l'ennemi. Ce dernier n'attendait pas le coup, mais la charge des volontaires était si violente qu'ils arrivèrent presque sur les Sauvages et le major Short tua un sauvage avec une balle qui entra le canon droit de sa carabine. Il se contenta de faire remarquer que c'était un casque neuf. Un petit cuisinier français attaqué à la batterie abattit un Néhi avec la crosse de sa carabine. Toulle le trompette de la brigade, âgé de 19 ans et appartenant à la compagnie \"C\" tomba frappé d'une balle à la tête. Il cria à ses camarades : \"Mortez-moi, je ne peux plus !\" Mais tout était fini ; et les soldats gardèrent le cadavre qu'ils apportèrent avec eux en retraitant. On constata plus tard qu'avant de tomber il avait reçu deux autres balles, une dans la poitrine et l'autre dans l'épaule. Ce fut une charge brillante et elle ne serait terminée qu'avec l'arrivée des sauvages si le major et ses hommes n'avaient été ramenés à leurs canons. C'est ainsi que les canons furent sauvés et on évita probablement un terrible désastre lorsque la colonne dut opérer sa retraite.\n\nUn par un les morts et les blessés furent rapatriés au centre. Ils commencèrent à avancer avant qu'on eut pu prendre aucune disposition et ils furent étendus parmi les roues des wagons.\n\nLes balles continuaient à pleuvoir au-dessus de leurs têtes et deux chevaux qui était tout près furent atteints. On forma une sorte de cercle avec des arbres d'asclépiade et on y plaça les blessés qui furent soignés par les chirurgiens Strange et Leslie, et par l'infatigable sergent de la batterie, Labatt. Le corps d'ambulance fit noblement son devoir, mais il devait faire chaque fois qu'il était besoin de ramener les blessés sur un brancard à travers une grille de plomb.\n\nComme les canons s'étaient brisés et qu'il était impossible de déloger l'ennemi qui s'était installé, il fallut se retirer. Vers dix heures et avant l'ordre de retraiter fut donné avec l'intention de camper dans la prairie que la colonne avait traversée la nuit précédente. Le capitaine Nash reçut ordre d'opérer une démonstration dans la cour de garnison et d'en cesser. En attendant les volontaires furent appelés à appuyer ce mouvement et les Queen's Own et les Garde partirent en avant. Ce mouvement réussit mais le succès fut payé cher. Charlie Winder, un conducteur qui avait emprunté une carabine, était jeté plus fort de la mêlée tomba ainsi que Gilbert un canadien français qui était trompette dans les carabiniers de Bat-\nLIEUT. COL. W. R. OSWALD,\nCommandant d'Artillerie de Garnison de Montréal.\n\nLIEUT. OSCAR PELLETIER.\nCHAPITRE XI.\nLE VOYAGE DE L'ANSE AU POISSON.\n\nLes rebelles avaient tellement de bateau qu'ils avaient pris le Poisson en péril. Leur armée était composée de plusieurs centaines de soldats, et ils avaient décidé de traverser la rivière pour attaquer les forces gouvernementales. Le général Middleton, qui commandait les forces gouvernementales, avait ordonné à ses hommes de faire tout ce qui était nécessaire pour empêcher les rebelles de traverser la rivière. Les rebelles avaient été obligés de renoncer à leur projet et de retourner sur leurs pas.\n\nLe 1er mai, l'armée gouvernementale a commencé à marcher vers le sud, en direction de la ville de Qu'Appelle. Les rebelles ont été surpris par cette nouvelle et ont été obligés de se replier vers le nord. Le général Middleton a ordonné à ses hommes de poursuivre les rebelles et de les capturer.\n\nLe 30 mars, le gouvernement a nommé une commission composée de MM. W. R. P. Street, C. R. de London, Ont., Roger Goulet, de St. Boniface, et A. E. Forget, de Regina, pour étudier les réclamations des Métis dans le Nord-Ouest.\n\nOn avait ouvert un tribunal à Qu'Appelle et dans beaucoup de cas on accordait des certificats (land scripts) de $210, en compensation des droits garantis aux Sauvages et aux Métis. On a procédé en plein respectant que plusieurs de ces certificats soient vendus des détenteurs et que l'argent ait servi à acheter des armes et des munitions qui avaient été immédiatement envoyées à Riel. Mais cela a été négligé et on n'en eut jamais de preuves positives.\n\nDans le 1er mai, l'eau de la Saskatchewan, montait lentement par suite de la fonte des neiges des Montagnes Rocheuses, et on envoya un certain nombre de charpentiers à Swift Current pour construire des barges qui devaient servir à transporter les munitions et les provisions ; ces travaux furent poursuivis avec tant de vigueur que le 1er mai de ces barges partirent avec une grande quantité d'approvisionnement pour le général Middleton. Le petit bateau à vapeur \"Minnow\" avait entrepris le même voyage deux ou trois jours auparavant.\n\nOn n'avait pas entendu parler du Northcote depuis huit jours, lorsque le 3 mai un détachement commandé par Dennis, l'a-perçu échoué sur un banc de sable. La crue de la rivière ne permettait pas d'avancer plus rapidement, et après avoir débarqué le corps d'ambulance à Saskatoon où l'hôpital devait être établi et deux compagnies du Midland à la traversée de Clarke, pour y tenir garnison on atteignit le camp du général Middleton à l'Anse-au-Poisson le 5 mai.\n\nLe 1er mai, cinq wagons couverts avec des toiles et deux ambulances partirent lentement avec les blessés de l'Anse-au-Poisson qui étaient en état de supporter le trajet, sous la garde d'une escorte, commandée par le major Boulton.\n\nSwinford qui avait reçu une balle dans la tête n'était pas avec eux. Il mourut quelques jours après, après être resté plusieurs semaines dans un coma. A présent, rien ne restait plus de l'armée de la colonne sur Batoche, le château fort des rebelles.\nCHAPITRE XII.\n\nPour le récit des événements qui survinrent ensuite, jusqu’après la prise de Batoche, nous empruntons encore le rapport officiel, si clair et si précis, du général Middleton :\n\n\"Batoche, 31 mai 1885.\n\n\"Monsieur, — J'ai l'honneur de vous donner les détails de la bataille des 9, 10 et 11 et de l'action du 12 à Batoche, pour l'information de Son Excellence le Gouverneur-Général et le vôtre. Comme vous le savez, je levai mon camp de l'Anse-au-Poisson le 7 au matin, après avoir fait traverser la rivière à ma colonne gauche pour se rallier à ma colonne droite et avoir été rejoint par le lieutenant-colonel Williams, commandant le régiment Midland, avec deux compagnies de corps et une mitrailleuse Gatling, sous la charge du capitaine Howard, ci-devant de l'armée des États-Unis.\n\n\"Mes forces se composaient de :\n- La batterie A, 2 canons, 86 officiers et soldats ;\n- La batterie de Winnipeg, 2 canons, 40 officiers et soldats ;\n- Le régiment Midland, 2 escadrons de cavalerie, 100 hommes ;\n- Le régiment Royal, 210 officiers et soldats ;\n- Le détachement du régiment Midland, 81 officiers et soldats ;\n- L'infanterie à cheval de Boultot, 65 officiers et soldats ;\n- L'éclaireurs de French, 28 officiers et soldats.\nTotal, 72 officiers et soldats.\n\n\"Je pris l'infanterie en brigades et j'en confiai le commandement au lieutenant-colonel Stranzenzie, qui me rejoignit en même temps que le lieutenant-colonel Williams et les deux compagnies du bataillon Midland. Je chargeai aussi mon adjutant-major-maître-général, le capitaine Haig, I. R. de médecine, de vapoter sur le pont de Batoche, et je fis descendre à mon camp avec des provisions en état de défense au moyen de pièces de bois, de sacs d'avoine, etc., et après avoir placé à bord la moitié de la compagnie C de l'école d'infanterie, je lui donnai instruction de descendre la rivière dès le lendemain pour la nuit à la Traverse de Galbraith, de se mettre en communication avec moi à cet endroit et de descendre la rivière le lendemain, de façon à se trouver vis-à-vis Batoche à 9 h. m., auquel temps je calculais que je serais prêt à commencer mon attaque. Il devait alors opérer la traversée de la rivière, en utilisant notre favori, briser si possible le câble de la Traverse de Batoche, et s'il y voyait qu'il ne pourrait remonter la rivière, continuer jusqu'à la Traverse de la baie du Hudson, au sud de Prince Albert.\n\n\"Ce qu'en réalité le vapeur a fait, vous en trouverez le récit dans le rapport du major Smith, de la compagnie C, de l'école d'infanterie, que je vous transmets avec le présent rapport. Je dois ajouter que l'officier en chef de la compagnie C, le capitaine Wise, auquel sa blessure ne permettait pas de suivre les troupes, le lieutenant H. J. Macdonald, du 90e qui était malade, et les lieutenants Gibson et Ellwood, du régiment des Fusiliers Royaux, qui souffraient de rhumatisme avec le Dr. Moore et M. Pringle, du service Medical, M. Budson, son principal officier du service de transport, son complice Vigneau, et plusieurs autres étaient à bord et quelques-uns, comme on le verra plus tard, le rapport du major Smith, ont rendu de précieux services.\n\n\"Le 8 au matin, ayant entendu dire que la route qui conduisait à Batoche, le long de la rivière n'était pas bonne et qu'elle offrait des endroits dangereux, je marchai à l'est puis au nord-ouest, débouchant à environ 9 milles de Batoche, sur la route de Regina. Howard établit à Batoche un camp pour la nuit. Dès que j'eus choisi l'emplacement du camp, je poussai mes quelques hommes de l'infanterie à cheval de Boultot, jusqu'à 4 milles de Batoche, sans être inquiétés de rien, et n'ayant appris que deux éclaireurs de l'ennemi qui s'approchaient de nous.\n\nCONSTABLE COWAN,\nDe la police montée.\n\nLIEUT.-COL. WILLIAMS.\n\nmitrailleur Gatling avaient mis en suite, nous avançâmes tranquillement vers l'église. Un drapeau blanc était déployé sur une maison située juste de l'autre côté de l'église. Je me rendis à l'église et vis que les prêtres catholiques et quelques religieuses qui avaient l'air métis. Après les avoir rassurés, je m'avancai avec prudence, déployant mon infanterie et repoussant l'ennemi jusqu'à ce que nous étions attaqués par une flèche d'une éclaireuse qui nous permit de descendre les canons et de les installer sur le sommet de Batoche. Comme les maisons étaient de construction légère et pas très grandes, les dégâts ne furent pas très considérables. Précipitamment à ce moment, comme quelques coups de feu furent tirés à partir de l'église, je fis fuir sur la rivière et courus l'endroit où se trouvaient les canons était complètement exposé à ce feu, je donnai l'ordre de ramener les canons en arrière, et comme on était à exécuter cet ordre, soudain l'ennemi ouvrit un feu très nourri d'un endroit que nous avions supposé être vide, mais avait des tranchées juste au-dessous de là où s'étaient trouvés les canons. Mais ce feu fut réduit au silence par le feu vif et rapide de la mitrailleur Gatling, magnifiquement manœuvrée par le capitaine Howard, secondé par le lieutenant Riggs de la batterie A.\n\n\"Quelques temps après, voyant que le feu recommençait du côté opposé et des tranchées, et qu'un cheval avait été tué et un des hommes qui manœuvraient le Gatling atteint, je donnai l'ordre au capitaine Howard de ramener le Gatling en arrière ce qui fut sans essuyer d'autres pertes. Le bâtiment fut transféré à grands risques du champ de bataille sur mon ordre de commandant le capitaine Freret de la compagnie B de l'école d'infanterie et le canonnier Coyne, de la batterie A.\n\n\"Je passai alors à la droite de ma ligne déployée en arrière de l'église et je vis que les maisons de l'autre côté de la rivière, même celles de cette rue qui était à l'arrière de l'église, étaient exposées à un feu partant d'un endroit devant lequel une fosse avait été récemment creusée et entourée d'une barrière de bois.\n\n\"J'ordonnai d'amener la mitrailleur Gatling pour réduire ce feu au silence, ce qu'il fit tout de suite, grâce à la puissance de cette arme, mais bientôt après, l'ennemi recommença son feu et nous découvrîmes plus tard qu'il tirait abrité dans des tranchées construites avec soin et que les projectiles passaient contre toute fusillade.\n\n\"Pendant ce temps, le capitaine Peters, de la batterie A avec une partie de l'artillerie de garnison de l'école de la batterie A, avait essayé de déloger l'ennemi des tranchées où il était venu se cacher, mais avait été obligé de ramener les canons, mais le feu était trop vif et il leur fallut se retirer, laissant un blessé derrière eux.\n\n\"A mon retour de cette partie de l'attaque, informé de ce fait, je fis descendre le bataillon du bataillon Midland dans une coulée en talus à gauche, entre le cimetière et l'église avec l'ordre de maintenir une vive fusillade de façon à distraire l'attention de l'ennemi de l'endroit où était situé le bateau blanc, et je fis passer aussi une partie du 90e et du 10e qui étaient couchés en travers de la route de faire la même chose.\n\n\"J'envoyai alors une partie de l'artillerie de garnison avec un brancard pour ramener le blessé, mais qu'il était sans hésitation, et une grande satisfaction, ils réussirent à le ramener sans perdre un homme, ce que je redoutais, mais malheureusement l'infortuné était mort.\n\n\"Nos morts et nos blessés furent placés temporairement dans l'église où ils recevaient les soins des médecins assistés des religieuses catholiques qui ont généreusement fait ce qu'elles ont pu pour aider aux médecins.\"\n\"Comme il commençait à se faire tard, et voyant que nous conservions notre position, il n'était pas possible que nous puissions avancer davantage ce jour-là, il me fallut décider de nous établir dans notre camp pour la nuit. Prenant en considération l'importance énorme en ce moment de ne pas même parfaire retraiter, de si peu de distance que ce fut, je résolus d'envoyer chercher mes tentes et mes bagages, et d'établir mon camp là où j'étais, bien que l'endroit ne fût pas favorable. J'enverrai donc arriver dans ce but mon second officier supérieure du service, le lieutenant M. Secrétan, qui réussit à m'apporter tout l'équipement de mon camp de la veille et les attelages dans un temps remarquablement court. Après avoir formé un carré avec les attelages, j'ordonnai à nos engagés de se retirer en arrière graduellement, ce qu'elles firent d'une façon satisfaisante, poursuivies par une partie de l'ennemi qui croyait probablement que nous retirions.\n\nIl revint bientôt de son erreur, cependant, en recevant une très-faible du carré, et bien que quelques ennemis manquèrent encore un feu isolé, à la nuit tombante ils se retiraient, mais non sans avoir, j'ai le chagrin de le dire, tué 2 de nos chevaux et blessé un homme dans le carré. On posta les sentinelles, on creusa une légère tranchée autour du carré, et le reste des hommes dormit tout armés sur les quatre faces du carré, chaque côté était sous la charge d'un officier commandant avec un certain nombre de sentinelles posées sur chaque côté pour faire la garde pendant que nous dormions et la nuit se passa ainsi tranquillement. Nos pertes dans cette journée ont été — 2 soldats tués, 1 officier et 9 hommes blessés.\n\n10 mai. — Après un déjeuner matinal, je fis sortir l'infanterie et pris une position aussi avancée que possible, mais l'ennemi était en plus grand nombre que la veille, ce qui était surprenant, je pense, au fait que le vapeur avait descendu la rivière, et que nous étions à moins de 500 mètres de la maison de l'ennemi, près du cimetière et quelques tranchées qu'il avait construites pendant la nuit, juste au-dessous de la hauteur où la mitrailleuse Gatling avait été mise en position la veille.\n\nQuelques ennemis avaient aussi occupé un point s'étendant un peu plus bas que le cimetière et, en somme, nous avions plutôt perdu que gagné du terrain. J'étais toujours convaincu que l'état pour mes soldats un bon exercice, de bonnes leçons, en ce qu'il leur fallait rivaliser de ruses avec leurs ennemis et se tenir à couvert.\n\nDe plus je savais que, mieux que nos adversaires, nous pouvions être pourvus de cartouches, lesquelles dans des escarmouches de ce genre sont brûlées inutilement des deux côtés et j'encourageai mes jeunes soldats ; une partie du détachement du Midland n'avait pas encore reçu son équipement de campagne.\n\nDans la matinée je fis bombarder une maison sur l'autre rive par les deux canons de la batterie A et lancer quelques décharges aux endroits où l'ennemi se montrait.\n\nDans l'après-midi les deux canons de la batterie de Winnipeg bombardèrent le cimetière, occupé maintenant, et quelques autres tranchées sur la droite de notre position. Le soir, je refisais mes avant-postes, comme la veille. Ils furent encore suivis par l'ennemi, mais j'avais fait pratiquer des tranchées protectrices jusqu'à 200 verges en avant dans lesquelles j'avais placé un détachement d'infanterie, outre quelques autres tranchées en profondeur, et les deux avant-postes ennemis dans lesquels étaient quelques hommes du 90me armés de Martini-Henry. Les ennemis, à leur approche, furent reçus par un feu meurtrier partant de ces tranchées ; ils rebroussèrent chemin à la hâte. Un des ennemis\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nsemblait tirer dans notre camp avec une carabine à percussion. Il ne causait pourtant que peu de mal, seul un cheval ayant été touché, et son feu ayant été vite éteint par nos tireurs. La nuit fut encore tranquille.\n\n\"En se retirant, ce soir-là les hommes observaient un ordre plus parfait. Nous n'avions qu'un tué et cinq blessés, qui indiquaient que nous avions gagné de l'expérience dans le combat. La situation était particulièrement belle, nous ne dressâmes point les tentes, vu qu'il y avait tant de chevaux dans la Zareba.\n\n\"Les éclaireurs du corps des arpenteurs, au nombre de 50 s'étaient réunis à nous dans l'après-midi.\n\n\"Il fallait que j'apprenne qu'ils avaient loin de là une belle prairie dominant les maisons de Batoche et ayant envoyé des partis d'infanterie occuper les anciennes positions, je m'en fus reconnaître la prairie en question avec l'infanterie montée de Bouton et le Gatling.\n\n\"Ce terrain était en communication facile avec notre camp, mais je savais qu'il était peut-être défendu par une forte fortification ennemie. En partant du camp j'eus la douleur de voir arriver sur un brancard, le père Moulin, blessé à la cuisse gauche par une balle tirée du cimetière par les rebelles à travers les meurtrières du presbytère même. Heureusement ce n'était qu'une blessure dans les chairs ; il fut déposé dans une tente hôpital et partira avec les blessés. J'arrivai sur la prairie par un petit détour. Je vis que c'était une bonne grande plaine, de forme irrégulière et d'environ deux milles de long sur 1,000 verges dans son plus large, avec une sorte de ravin en milieu et des ondulations. Voyant un bon nombre d'hommes rentrer à notre gauche nous leur envoyâmes deux ou trois rafales du Gatling et une partie des hommes de Bouillon bordèrent le ravin.\n\n\"Ceux-ci commencèrent un feu assez vif du haut des crêtes du ravin ; mais on découvrit bientôt que l'ennemi était protégé par une suite de retranchements, et que la seule façon de tenir l'ennemi en respect, je dirigeai ma monture vers le nord de la prairie suivie de l'Infanterie à cheval. Apercevant deux éclaireurs ennemis à cheval, nous leur donnâmes la chasse, mais ils gagnèrent le bois et nous les perdîmes de vue.\n\n\"Je revenais à notre parti quand je vis un homme sortir à pied d'un retranchement. Nous piquâmes de son côté et découvrîmes que c'était un sauvage sans armes qui dit être un domestique du prêtre, mais que nous reconnûmes plus tard pour un rebelle.\n\n\"Ainsi, après avoir fait feu pendant quelques temps, je donnai ordre de retraiter et de regagner le camp, ce que les troupes ont fait en bon ordre,\n\n\"A ce moment, nous avons vu que nous avions repris tout le terrain perdu, grâce à notre attaque sur le flanc de l'aile gauche des ennemis, cette manœuvre obligeant les rebelles à porter une partie de leurs soldats sur l'aile droite de la défense de l'aile gauche. En ce moment, quelques soldats du bataillon de Midland, conduits par le lieutenant colonel Williams se précipitèrent, vaillamment dans les retranchements ennemis, arrivèrent au cimetière, et en chassèrent les Indiens qui y laissaient leurs couvertures et plusieurs autres objets.\n\n\"Un canon de la batterie A avait attaqué le cimetière et les contre forts qui se trouvaient près de l'église.\n\n\"Vers l'après-midi j'ai fait placer deux canons de la batterie de Winnipeg à l'endroit occupé par le Midland, près du cimetière, d'où on pouvait facilement observer les positions de l'ennemi de l'autre côté de la rivière.\n\n\"Les canons furent braqués vers la maison sur laquelle Riel avait fait hisser un drapeau blanc et où se dirigeait une foule considérable.\n\n\"Dès que le feu de ces deux canons fut presque détruit, et la foule qu'elle contenait se dispersa en toute hâte dans les bois des alentours.\n\n\"L'ennemi resta dans son camp toute l'après-midi. Et à la tombée de la nuit, mon parti d'éclaireurs revint au camp, comme de coutume.\n\nJ'aperçus un homme venant des lignes ennemies avec un drapeau à la main. Je poussai mon cheval à sa rencontre : ce héraut d'armes était M. Ashley, un arpenteur, qui avait été libéré quelques jours auparavant. Il me dit qu'il venait de la part de Riel et me remit une lettre de ce dernier, me disant de ne pas faire tirer sur les maisons et que si je massacrais leurs femmes et leurs enfants, ils massacraient leurs femmes prisonnières.\n\nJ'écourai immédiatement en réponse que je désirais beaucoup ne point faire de mal aux femmes et aux enfants, et que s'il (Riel) voulait les renfermer dans un même endroit et me laisser connaitre cette place, je veillerais soigneusement à ce que l'on ne tirât pas dans cette direction. Au même moment, un autre prisonnier, M. Jackson, arriva avec un autre drapeau blanc à la main et une copie de la même lettre dont je viens de faire mention. Il me dit qu'il ne voulait plus retourner, malgré que je lui aie déclaré que sa fuite pourrait bien déterminer les rebelles à massacrer les autres prisonniers, parce que lesquels se trouvaient un de ses frères. Il me répondit que les prisonniers ne seraient pas inquiétés par cela et qu'il préférerait ne pas retourner. Je le laissai à lui-même. L'autre prisonnier, M. Ashley agit bien différemment. Il me dit qu'il allait s'en retourner, dans l'espérance de pouvoir être\n\nFORT EDMONTON.\n\n\"Pendant cette journée quatre hommes de nos soldats ont reçu des blessures légers. Ce qui prouve que mes hommes commençaient à se familiariser avec ce genre de guerre, et malgré le peu de progrès que nous avions alors fait, je résolus, pour me servir d'une expression bien connue et devenue historique, d'encore fort tant que nous n'aurions pas réussi à prendre Batoche.\n\n\"Pendant la journée, ceux des soldats que j'avais laissés en arrière pour protéger le camp et les convois de wagons qui portaient les provisions, avaient occupé leur temps à travailler à augmenter les fortifications de notre camp.\"\n\nCHAPITRE XIII.\n\nIl y avait maintenant trois jours que la première division avait entamé la capture de Batoche et le quatrième devait être le dernier jour de résistance des rebelles. Le rapport du général continue ainsi :\n\n\"Mai 12—Ce matin j'envoyai mes 150 hommes de la police à cheval avec un canon de la Batterie A et le Gatling faire la même tournée que la veille. Nous avions occupé nos positions, et nous avons ouvert le feu sur les lignes ennemies après avoir déployé les hommes en tirailleurs. Au milieu de la bataille utile à ses autres compagnons de captivité. Il repartit pour le camp ennemi, je retins mes soldats, petit à petit, et en bon ordre vers notre camp, leur disant que j'avais l'intention de l'attaquer dans cette direction. Je regrette de dire cependant, que nous avons alors perdu un de nos soldats qui a reçu une balle dans la tête pendant qu'il surveillait l'ennemi dans les broussailles.\n\n\"Après dîner, nos hommes allaient reprendre les anciennes positions. Deux compagnies du Midland, 60 hommes en tout, sous le commandement du lieutenant-colonel Williams, furent placés à gauche et prirent position près du cimetière, et les \"Grenadiers\" au nombre de 200 sous le lieutenant colonel Grasset, prolongèrent la ligne à droite appuyés par le 90e.\n\nLe Midland et les Grenadiers conduits par les lieutenants colonels Williams et Grasset, et le tout de la division, menèrent un flanc et le colonel Straubenzee se précipitèrent en avant et chassèrent l'ennemi de ses retranchements en face du cimetière. Pendant ce temps là un feu bien nourri venant de l'autre côté de la rivière harcelait mortellement nos soldats. Les soldats du Midland, avec l'aide d'une compagnie du 50me détachèrent leurs fusils de ce côté et parvinrent à chasser les rebelles.\n\n\"Le régiment de Midland et les Grenadiers se précipitèrent vaillamment en avant sous le\ncommandement de leurs officiers, jusqu'à l'abord des broussailles où étaient les maisons. C'est là que tomba, tué par une balle le capitaine Fitch des Grenadiers. On plaça alors dans cette partie un des canons de la batterie de Winnipeg qui tira pendant quelques minutes et fut remplacé par un canon de la batterie A. À un moment de l'action, pendant le temps de le remonter, le 90me en avant de manière à prolonger la ligne d'attaque. Le Gatling fut placé en avant du 90me et fut braqué sur les maisons sous la direction du lieutenant Murray de la batterie A et du capitaine Howard, et après quelques décharges on se précipita en avant au milieu des vivats et toutes les maisons furent prises, les prisonniers en liberté, et Batoche fut du fort définitivement en notre pouvoir. C'est alors que le capitaine French fut frappé à mort pendant qu'il regardait à la fenêtre de l'hôtel Batoche. Toute l'armée regretta la perte de ce brave officier. J'envoyai ensuite une patrouille de Grenadiers le long de la rivière sur la rive gauche, puisque chez un nommé Champagne, un rebelle et sur la rive gauche je fis déployer en tireurs une compagnie du 90me.\n\nLe soir venu, j'envoyai au camp chercher des couvertures et des vivres, et nous passâmes la nuit au tour des bâtisses dans Batoche. Nous avons trouvé un nombre considérable de femmes et d'enfants Métis et Sauvages sous nos tentes un peu au-dessous de l'hôtel Batoche, et plusieurs passèrent la nuit autour de notre camp.\n\nEn examinant le champ de bataille je fus étonné de la force de l'organisation des rebelles et de l'habileté et du génie dépensé dans la construction des tranchées. Au fond et autour de ces tranchées nous trouvâmes des couvertures, des habits, chemises, bottes, souliers, vivres, huile, et un ou deux canons brisés et une bonne carabine. Ces tranchées étaient admirablement placées pour une attaque de front. Mais comme nous avions une mouvance de flanc pour attaquer l'aile droite de l'ennemi qui était son endroit le plus faible, il est arrivé que nous avons tout-à-fait renversé la position, et au lieu de supporter une attaque en front, protégés par leurs retranchements, les rebelles ont été obligés de résister à la charge, par la droite, et à découvrir. C'est ce qui a été cause de leur débandade et du saucisson général.\n\nNous avons trouvé 21 rebelles morts sur le champ de bataille, et deux sur la rive plus loin que le cimetière, de plus 5 blessés, dont deux conseillers de Riel. Je regrette de dire que Riel et Dumont ont réussi à s'échapper, mais je vais me mettre à leur poursuite aussitôt que l'on aura découvert la direction qu'ils ont prise.\n\nMai 13. Les métis sont venus en grand nombre se rendre et remettre leurs armes, sous la direction de leurs prêtres.\n\nJ'ai une liste des plus vilains rebelles et je congédiai ceux dont les noms ne figuraient pas sur cette liste. J'ai maintenant 13 prisonniers.\n\nJe dois faire remarquer ici que parmi les prisonniers de Riel, que nous avons mis en liberté, était un nommé Albert Monkman, que me raconta que Riel l'avait fait prisonnier parce qu'il le redoutait. Mais je ne peux pas convaincre que ce Monkman était un rebelle traité à ses compatriotes, et je l'ai fait mon prisonnier. J'ai appris cette après-midi que Riel et Dumont étaient de ce côté-ci de la rivière.\n\nLe prêtre catholique a donné ce matin le montant des pertes des rebelles qu'il énumère comme suit : 1er jour, 4 tués et 5 blessés ; 2e jour, 2 tués ; 3e jour, 3 blessés ; 4e jour, 47 tués, 163 blessés. Total, 52 tués, 212 blessés.\n\nMai 14. Nous avons marché vers la Traverse de Lépine. Après dîner, on m'a informé que Riel était dans le voisinage.\n\nMai 15. J'envoyai quelques hommes de la police à cheval, sous le major Armstrong, pour examiner les bois. Dans l'après-midi, deux éclaireurs, Armstrong et Hourie, découvrirent Riel qui se livra de lui-même, en leur donnant la lettre que je lui avait envoyée, lui demandant de se rendre, lui permettant de le protéger, jusqu'à ce que je l'eusse remis entre les mains du gouvernement canadien.\n\nLes éclaireurs me l'ameneront au camp et je le fis prisonnier, comme bien vous pensez, avant de vous faire connaître la conduite de toutes les troupes ainsi que les actes des officiers que leurs devoirs, pendant ces quatre jours retenaient auprès de moi, qu'on me permette, en justice pour la vaillante petite troupe que j'avais sous mon commandement, d'attirer l'attention, sur sa force et sur ses exploits, les sujets desquels on semble se méprendre, non seulement dans la presse anglaise,\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nmais même dans le Dominion. Un journal anglais aurait dit que j'avais attaqué des forts à Fish Creek, avant de demander 1,500 hommes, et que j'avais fait venir le bataillon Midland et que j'avais combattu avec 1,000 hommes et des armes supérieures à celles de l'ennemi. Voici les faits tels qu'ils se sont passés : j'attendais à Fish Creek, pour pouvoir mettre les blessés en lieu sûr et recevoir de l'aide, mais non, des renforts. Deux hommes seulement du bataillon Midland vinrent me rejoindre, sous les ordres du Lt. Col. Williams, et, comme j'avais perdu environ 60 hommes, tués ou blessés, et qu'il me fallait en mettre 35 à bord du \"Northcote\", mon renfort se trouvait être de 2 hommes. Parce que c'est des hommes courageux à qui je ne ferai pas de 724 officiers et soldats, vu qu'il me fallait laisser 100 hommes pour protéger le camp, sans compter les malades et les blessés, les cuisiniers, les troupes, hommes de l'ambulance, etc., je ne pouvais amener que 496 hommes à l'engagement et ce, sans comprendre l'armée, qui, vu la position qu'elle occupait, ne pouvait faire autant que l'infanterie.\n\n\"Ainsi, avec environ 400 hommes, nous avons délogé-en lui faisant éprouver de grandes pertes—une force d'au moins 600 Métis et Indiens d'une position choisie et gardée avec soin, et s'étant dit-on des nouvelles tirées de l'en- droit et la plupart étaient équipés de longues carabines. Inutile, après cela, de parler de la conduite des troupes en général, durant l'engagement. Mon second, le lieutenant-colonel Stranberg, m'a rendu de grands services et son commandement du 12, a été excellent. Le lieutenant-colonel Houghton, le Lt. D. C., a été extrêmement beaucoq de sang-froid au feu, où il comman- dait la Zareba, pendant l'action du 12.\"\n\n\"Le capitaine Haig, R.E., mon A. Q. M. G., m'a été d'un grand secours et, à lui aussi, mon beaucoq de sang-froid; c'est un des officiers les plus énergiques et il m'a été d'un grand secours contre tous les ennemis et les rebelles, proté- geant la Zareba, contre le feu de l'ennemi et pour toutes les autres manœuvres exigeant la connaissance d'un ingénieur. Le lieutenant-colonel Molgund, qui a été, quelque temps, chef d'état-major, m'a rendu de grands services, le temps qu'il a été sous mes ordres, dans le 90me.\"\n\nLe lieutenant Young, de la batterie de cam- pagne de Winnipeg, m'a rendu de grands services et pour tous les autres officiers, je ne peux pas dire assez de bienfaits qu'ils ont rendus. Je leur dois aussi de grands services, dans la campagne et il mérite beaucoup pour sa ponctualité avec laquelle il a rempli les devoirs de sa charge ; je l'ai choisi pour prendre charge de Riel, depuis le moment de sa reddition et tout le temps qu'il a été dans ma compagnie. Le capitaine Young cou- chait dans la tente avec un prisonnier et c'est lui qui l'a conduit à Régina.\n\n\"Mon A. D. C. le lieut. Freer, du 38e bataillon, Compagnie C de l'École d'Infanterie, m'a été d'un grand secours et de grands services, sur le Northcote, avec l'aide de mon autre A. D. C., en dépit de sa blessure et de M. Bedson, ainsi que le constate le rapport du major Smith. Le major Jarvis, commandant la compagnie de la Compagnie de Winnipeg et le capt. Drury, de la batterie de Winnipeg, ont été excellents officiers et ont été signalés durant les quatre jours, ainsi que le lieut. Rivers, qui avait la manœuvre du canon Gatling, aidé du capt. Howard, ci-devant de l'armée des États-Unis, qui a fait preuve de beaucoup de bravoure et de courage. Le capt. Petersen, commandant la compagnie, couvrant les canons d'un détachement de la batterie A. Le lieut. Digsbrow, attaché à la batte- rie A et que j'avais placé en charge des mu-\n\nnitions, de la commencement de la marche, a rendu de grands services et mérité de beaux éloges. Le major Boulton, commandant l'infanterie, cheval, officier fécond en expériences et qui m'a été du plus grand secours tout le temps qu'il a été sous mes ordres, a montré tout le courage et tout le sang-froid qu'on lui sait et le 12, il m'a rendu de très grands services, à la droite, par la mer, et à gauche, à la mer.\"\n\n\"Le capitaine Dennis, qui commandait les éclai- reurs arpenteurs, a rendu de grands services, et il mérite de beaux éloges pour la manière dont il a dirigé ses hommes. Le capt. French qui commandait aussi un parti d'éclaireurs, et le capt. Macdonald, qui a fait preuve de sa valeur et de sa bravoure militaires. Nous devons aussi de grands éloges au Dr. Orton, chirurgien de la brigade, et à ses subordonnés pour l'excellente manière dont ils ont pris soin des blessés.\"\n\nNous devons encore des remerciements au Rév. D. M. Gordon, de l'église presbytérienne, qui rejoignit le 90me au camp de l'Axe-au-Poisson et qui était avec le même bataillon à la bataille de Batoche ; aussi au Rév. C. C. Whit- combe, de l'église d'Angleterre, qui rejoignit les Grenadiers le 16 mai, afin de veiller à leurs besoins spirituels et à ceux des restes des troupes.\n\n\"J'ai l'honneur d'être monsieur,\n\n\"Votre très obéissant serviteur,\n\n\"(Signé) FRED. MIDDLETON,\n\n\"Major Général,\n\n\"Commandant des troupes de l'expédition\n\n\"du Nord-Ouest.\"\n\nQuant à Gabriel Dumont, personne ne le vit ; tout ce qu'on apprit, c'est qu'après s'être battu comme un lion et tout espoir étant perdu, il monta sur son cheval, le plus rapide de la prairie et gagna les bois. Il arriva dans la Montana et fut reconnu par les autorités américaines, mais il fut bientôt relâché, sur des ordres venus de Washington.\n\nCHAPITRE XIV.\n\nLES PÉRÉPÈTIES DU \"NORTHCOTE.\"\n\nLe Northcote au sujet duquel on entretien- tant de craintes pendant le siège de Batoche, avait passé par une suite d'événements émo- vants. À partir du 9 mai, il avait ordre de s'arrêter à un mile et demi de Batoche, et d'attendre que la colonne principale eût commencé le bombardement de la ville.\n\nLe bateau était en marche depuis deux heures lorsque l'apparition des rebelles vint déranger nos plans. De partout on vit les révolts offrir un abri, des grêlons de balles pleuvaient sur le bateau et tous les agres supérieurs furent bientôt abat- tus. La compagnie \"C\" qui formait l'équipage de combat, riposta par une vive fusillade, à l'abri de la cabane du pilote et des travaux de défense qu'on avait faits avant le départ. Les malades et les blessés allaient à passer les munitions à leurs camarades, mais en arrivant où la rivière fait un brusque détour, le courant est extrêmement rapide et le chemin très étroit.\n\nEn s'engageant dans cette passe difficile, le devant du Northcote effleura presque un rocher élevé et couvert de bois. Cet endroit était rem- pli de rebords et les flancs du Northcote eu- rent à subir une fusillade intense et une meurtrière que jamais ; mais les travaux de dé- fense étaient si solides que les dommages furent peu considérables. En passant vis-à-vis l'église, on vit le corps d'un homme pendu à un arbre près de la grève, mais on n'y jamais au qui était celui de l'un de l'insurrectionnaires, ni pourquoi ce malheureux avait été mis à mort.\n\nRendu à Batoche l'ennemi arriva en nombre, mais il fut encore repoussé. À la traversée, comme le bateau, aidé par un fort courant, descendait à toute vitesse, le câble d'acier qui sert à traverser le lac, fut tout à coup basse. Le câble effiloché tomba du bateau, et, en retombant ensuite dans les tuyaux, il renversa tout sur le pont d'arrière. Si le câble avait été baissé un peu plus, il brisait la cabane du pilote et le navire désemparaillait aux mains des rebelles. Quelques minutes après le bateau tourna bon cap vers et se dirigea tout droit à la côte. L'ennemi se précipita de ce côté pour opérer l'abordage, mais la vive fusillade de l'équi- page le repoussa. A neuf heures le feu des rebelles cessa. Le Northcote jeta l'ancre deux milles plus bas, il était presque complètement détruit. L'équipage se mit à l'œuvre pour réparer les nuyaux, mais le travail était si pénible qu'une nouvelle fusillade vint chasser les ouvriers du pont.\n\nAucun d'eux ne voulut s'aventurer de nouveau sur le pont pour réparer le sifflet qui était le seul moyen d'entretenir des communications avec le général Middleton. Il fallut quelques jours chacun à deux ouvriers pour accomplir ce travail. On recommença à donner des signaux au général Middleton mais on ne reçut d'autre réponse que la vive canonnade qui avait lieu de l'autre côté de Batoche.\n\nTrois officiers supérieurs qui étaient à bord tinrent conseil et on décida de retourner en ar- rrière, mais le capitaine refusa en prétextant que c'était contraire aux instructions écrites du général et qu'en essayant de remonter la rivière le pilote serait infailliblement tué. Durant la nuit, une décharge de muskets fut entendue faire le bateau de la rive ouest, mais on n'y répondit pas. On passa toute la journée du dimanche à l'ancrage, sans nouvelles du général Middleton et tout ce qui eut lieu ce fut l'échange de quelques coups de feu avec l'ennemi. Toute tentative pour fortifier la cabane du pilote fut frustrée.\nC'est alors que les soldats les surnomment \"chiens des prairies\" les comparant à ces petits animaux, qui ne s'aventurent jamais bien loin de leur trou et qui y restent à la première approche du danger.\n\nLe colonel Irvine qui a la réputation d'un brave officier explique cette longue inactivité de la police en disant que son départ aurait laissé Prince Albert à la merci des rebelles, et qu'en marchant sur Batoche il aurait probablement rencontré dans la forêt qui sépare les deux villes, un ennemi assez supérieur en nombre pour anéantir son détachement.\n\nLe général Middleton décida alors de détruire Battleford qui était toujours gardé par les Sauvages. Des garnisons furent placées à différents endroits menacés, et le 20 mai, un détachement de 14 Gardes du Gouverneur Général s'empara de Chapeau-Blanc et de ses environs et le conquit jusqu'à Humboldt.\n\nGabriel Dumont, était le seul chef rebelle encore en liberté, depuis que les autorités américaines l'avaient relâché. Le Barbu avait fait sa soumission au général qui lui enleva sa médaille et lui ôta son chapeau de cuir.\n\nLe 22, le général Middleton, avec son état-major, 371 hommes un canon et un Gatling, embarqua sur le Northcote, et rendu à Carleton on lui amenait trois parlementaires, un neveu de Poundmaker, Alexandre Cadieux, un Métis, et un constructeur agricole, fait prisonnier par Poundmaker. Ils apportaient une lettre de Poundmaker dans laquelle il demandait à quelles conditions le général accepterait sa soumission.\n\nLe général lui répondit qu'il devait se rendre sans condition et il le somma de venir le rencontrer à Battleford le 26, avec ses complices et toutes les armes qu'il avait en sa possession.\n\nCHAPITRE XVI.\n\nSOUMISSION DE POUNDMAKER.\n\nUn prêtre de la congrégation des Oblats, qui avait été fait prisonnier par Poundmaker raconte ainsi la soumission de ce chef :\n\n\"Enfin, le 17 mai, arriva des environs de Carleton, un cavalier nous apprenant la nouvelle que Riel et ses gens au nombre d'environ 600 étaient entrés en territoire contre les troupes du général Middleton, au nombre de 1500, disait-on.\"\n\n\"Le 19 mai, quelques autres cavaliers vinrent nous annoncer la fin de la bataille, que dans cette bataille Riel s'était fait prendre et que la paix était accordée à M. Riel.\"\n\n\"Aussitôt, sans perdre de temps, j'essayai de faire comprendre au chef Poundmaker et à ses gens qu'ils ne pourraient pas résister longtemps contre les blancs qui viendraient les attaquer par milliers et qui, en prenant tous les prisonniers, Poundmaker passerait pour un homme plus généreux et plus brave et aussi qu'il se ferait estimer des blancs s'il s'exposait lui-même pour sauver son peuple et la vie de ses enfants, qu'il valait mieux qu'il allât se livrer lui-même et s'en remette entièrement aux dispositions des généraux et qu'ainsi en épargnant le sang des deux côtés, il serait récompensé du bon Dieu.\"\n\n\"Généralement les Sauvages aiment leurs enfants et pour leur sauver la vie, ils ne reculent devant aucun sacrifice. Aussi Poundmaker envoyait-il de suite une missive au général Middleton encore à Carleton.\"\n\n\"Puis, après avoir fait écrire une deuxième lettre, il me chargea moi-même d'aller, avec les 22 prisonniers teamsters, la porter au colonel Otter, commandant de place à Battleford.\"\n\"Je partis donc à cheval, le mercredi 20 mai, et j'arrivai le soir à Battleford où tout le monde paraît content de me revoir sain et sauf. Je ne saurais comment assez exprimer ma reconnaissance à tous les officiers pour la manière obligante avec laquelle ils m'ont reçu ce jour-là. Je fus conduit aussitôt chez le colonel Pitt où je fus accueilli par quelques-uns des officiers. Tous étaient fort curieux de entendre les nouvelles.\n\n\"Après avoir remis la lettre au colonel, je fis un court récit de tout ce qui s'était passé pendant mon séjour chez les Sauvages rebelles et le lendemain, vers midi, chargé d'aller même pour la réponse de Poundmaker, je retournai sur camp des Sauvages.\n\n\"Il fut assez tard que nous avons été appelés à l'assemblée :\n\n\"Vous tous tant que vous êtes, regardez-moi. Vous m'appellez tous votre chef. Écoutez bien ce que je veux vous dire. Il ne s'agit plus aujourd'hui de se battre. Vous qui avez commis des méfaits, vous qui avez pillé des innocents, il ne s'agit pas non plus de penser à sauver votre vie propre. Voyez toutes ces femmes, voyez tous ces enfants ; voyez toute cette jeunesse qui vous entoure ; tous vous demandent la vie à grands cris. Il s'agit de les sauver. Je sais que nous sommes tous braves. En combattant contre les blancs nous pouvons les emballer, mais nous ne pouvons pas succomber sous le nombre et rien ne nous dit que nos enfants survivront. J'aime mieux me livrer, au risque d'être perdu moi-même, plutôt que de voir nos enfants massacrés par ma faute, plutôt que de faire verser des flots de sang par une mutinerie qui n'a aucune raison d'être ; maintenant que ceux qui ont le cœur fassent comprendre à mes amis.\"\n\n\"En disant cela, il jeta ses armes à terre. Tous les hommes se levèrent et tous déposèrent leurs armes.\n\n\"Ensuite les Sauvages qui avaient pris part à la force forcée, par crainte d'être tués par leurs frères et qui n'avaient jamais cessé de montrer de la sympathie aux captifs firent des discours à neuf plus finir dans lesquels ils voulurent le dire qu'ils ont toujours fait armé eux les Hommes de la Prière.\n\n\"Il y eut bien parmi le nombre de vieux méchants qui parcoururent le camp en disant que je devais être pendu et que leur tuerais un père.\n\n\"Mais le plus grand nombre était impatient d'avoir la paix et les récalcitrants menacés, durant se taire. Poundmaker me chargea de nouveau d'aller à Battleford attendre l'arrivée du général Middleton et de venir le chercher dès qu'il serait arrivé. Il me donna une lettre de soumission entière et sans conditions.\n\n\"Avant de prendre de nouveau congé des Sauvages je pris Poundmaker de laisser aller les Métis prisonniers. Il me répondit que je pourrais emmener tous ceux que je voudrais.\n\n\"Maître Assiniboine n'y comprit qu'à moitié, les pauvres Métis désirant s'éloigner que petit à petit du camp sauvage. Comme j'avais hâte d'arriver à Battleford et de voir tout le monde tranquille à Battleford et tout à l'entour de cette place, je pris les devants.\n\n\"J'ai quitté le camp de la veille, le lendemain, dans la matinée. Le général Middleton arrive le dimanche 24, au soir et le lundi soir je remontai à cheval et je cours chercher Poundmaker. Toute sa bande, au nombre de 500 têtes, hommes femmes et enfants étaient déjà en marche sur Battleford.\n\n\"Je rencontrais mes chers Métis campés à 2 milles de la ville, et je trouvais les Sauvages accourant par derrière, campés trente milles plus haut. Je conseillai aux Métis de se rendre dans la ville le plus tôt possible afin de ne pas être confondus au milieu des Sauvages.\n\n\"Vers midi, le lendemain, j'étais de retour, emmenant avec moi Poundmaker et quelques-uns des officiers principaux. Poundmaker s'est livré lui-même à quelques Crie Assiniboines, entre autres l'assassin de M. Steeple, fermier instructeur des Assiniboines, et il a déposé devant le général Middleton les armes de tous ses gens. Maintenant tout est tranquille à Battleford.\n\n\"Tous les Sauvages sont rentrés dans leurs réserves respectives.\"\n\nCHAPITRE XVII.\n\nLA POURSUITE DE GROS-OURS.\n\nLe général Strange ne fut que trois jours à Victoria, mais ce temps parut encore trop long à ses soldats qui brûlaient le désir d'aller délivrer les soixante-cinq prisonniers de Gros-Ours, sous le lieutenant-colonel Smith ; l'infanterie à cheval d'Ottawa, 60 hommes sous le major Paton ; un canon de 9,30 hommes de police et les éclaireurs de Steele, en tout 450 hommes.\n\nL'ennemi était retranché à la Butte-aux-Français, à 15 milles de Fort Pitt, et à trois milles de la rive nord du Saskatchewan.\n\nGros-Ours avait choisi le terrain le plus favorable pour y dresser une embuscade afin d'attaquer les troupes. Il était à la tête de 700 guerriers, dont un grand nombre ont pris part aux guerres indiennes aux États-Unis.\n\nLe pays est accidenté, coupé de ravins, isolé de rivieres et couvert de bois épais. Les Sauvages ne pouvaient choisir un meilleur endroit.\n\nUn canon fut mis en position et lancé quelques obus, pendant que les compagnies Nos 1, 2 et 3 du 92me se déployaient en tirailleurs dans le bois.\n\nAprès un combat de trois heures les Sauvages furent repoussés de la vallée.\n\nOn campa pour la nuit et de bonne heure le lendemain on attaqua la Butte-aux-Français. Le capitaine Strange donna le signal avec son canon et le 65me et le 92me se déployèrent en tirailleurs. Les soldats descendirent de la colline et une ligne occupait trois-quarts de mile. Du côté ennemi, c'est Gros-Ours lui-même qui donna le signal de l'attaque, mais vers neuf heures et demi, l'artillerie et le feu de fusil commença à faire des ravages au silence. Le général ayant été informé que deux cents Sauvages opéraient un mouvement de flanc, fit retirer les troupes de la colline du 65me qui n'étaient plus qu'à 200 verges des tranchées ennemies. Ils voulaient aller les enlever à la pointe de la baionnette, mais, vu leur petit nombre, le général Strange s'y résigna.\n\nDeux autres compagnies du 65me étaient parties de Fort Pitt en bateau pour attaquer le camp des Sauvages en flanc, mais ce mouvement ne réussit pas.\n\nLes Sauvages ont eu cinq hommes tués et cinq blessés ; du côté du général Strange, trois soldats du 65me et un d'Alberta ont été blessés. Marquis de Montcalm et Le Moyne étaient les seuls dont les blessures fussent sérieuses.\n\nLe lendemain le général retraita et résolut d'attendre des renforts.\n\nLe général Middleton qui était en route de Battleford pour rejoindre le général Strange, à bord du vapeur \"Northwest,\" lorsqu'il arriva à Fort Pitt, apprit par les courriers de Grand Rapids, rebrouta sa chemin afin de lever des renforts pour le général Strange.\n\nAvec cinq cents soldats, tirés du régiment des Grenadiers du 90ème de Winnipeg et de la battalion Midland, et 25 hommes de Batterie A, de quatre éclaireurs et autres, il partit le 31 mai par le bateau à vapeur pour aller au secours du général Strange.\n\nAprès des marches forcées, sous une pluie torrentielle les deux colonnes avaient opéré leur jonction le 2 juin. Les éclaireurs rapportaient que Gros-Ours, immédiatement après la bataille, avait abandonné sa position et avait retraité en toute hâte vers le nord.\n\nA peine le général Strange eut-il appris la retraite de Gros-Ours que le missionnaire Quiney, qui avait été fait prisonnier à Fort Pitt, arriva dans le camp. Il était accompagné d'une femme de bois qui était séparée de Gros-Ours. À cette nouvelle le révérend M. Mackay, avec huit éclaireurs, quitta le camp du général Strange, pour aller intercéder en faveur des prisonniers de Gros-Ours. Il traversa le camp des Cris aménagé le long de la rivière Red. De là, il alla à Maniwaki et plusieurs prisonniers métis. Ils avaient été isolés du camp principal et ne se trouvaient pas par conséquent as...\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nseuls à la surveillance du Gros Ours et de ses guerriers. Plusieurs autres prisonniers réussirent à se sauver et furent arrêtés après plusieurs jours. Les deux femmes, mises en liberté, partirent immédiatement pour retourner dans leur famille dans la Province d'Ontario.\n\nMadame Delaney et madame Gowanslook dirent que les Cris des Loups voulaient les assassiner parce que les Métis, en empêchant plusieurs fois le général aprés qu'ils eussent été membres de la famille McLean, qui étaient encore prisonniers étaient bien traités. M. McLean fut obligé de boucher le bois et de puiser de l'eau. Le rév. M. Q. Scott refusa de traverser et les Sauvages le firent enfermer.\n\nMackay rendit aux Métis leurs armes, en laissant trois hommes pour les escorter jusqu'à Fort Pitt, puis se mit à la poursuite de l'autre bande parmi laquelle ne trouvaient Mme Du frey, Simpson et d'autres. Cette fois, basse quatre hommes pour ramener les prisonniers au Fort Pitt et en envoya deux autres pour porter la nouvelle au général Strange. Il partit alors lui-même pour le Fort Pitt en compagnie de Mr. Gowanslook et de quelques prisonniers.\n\nLe 3 au matin, le major Steele qui avait été constamment à la poursuite de Gros Ours se vit tout-à-coup attaqué par les Sauvages à 40 milles de Fort Pitt. Le major Steele n'avait que 80 hommes et les Sauvages une force nombreuse de 300.\n\nLe capitaine Steele a entrepris un feu nourri pendant trois heures; comme on était en pleine forêt, il était impossible de faire usage de la cavalerie.\n\nAu bout d'une certaine heure, le capitaine Steele écrivit un pavillon blanc, et le rév. M. Mackay somma Gros Ours de rendre les prisonniers qu'il retenait captifs.\n\nGros Ours répondit : \"Non, jamais, je ne céderais jusqu'à la mort.\"\n\nLe combat dura encore deux heures, au bout de ce temps le capitaine Steele crut voir que les Sauvages désiraient retraiter, et en conséquence il arriva le drapé blanc.\n\nLes combattants n'étaient qu'à cent verges, les uns des autres, un petit ruisseau les séparait.\n\nLe capitaine Steele commanda une seconde fois à Gros Ours de rendre ses prisonniers; les Sauvages répondirent par un déchaînement de violence.\n\nIls battirent ensuite en retraite et se retranchèrent sur un petit monticule, mais ils furent délogés de là par une charge des éclaireurs de Steele.\n\nTrois hommes ont été blessés dans ce combat : Mr. Fury, de la police à cheval et Williams West et Thomas Fisk, des éclaireurs de Steele.\n\nLe combat avait duré huit heures.\n\nSteele, se replia sur le gros de la colonne, et les éclaireurs continuèrent à surveiller les mouvements de l'ennemi. C'est alors que le général Middleton prit le parti de poursuivre Gros Ours, sans relâche.\n\nToutes les précautions furent prises pour que ni elle ne s'échappât pas par d'autres côtés et on commença la marche vers le nord.\n\nLes canons furent démontés et chargés à dos de chevaux, les wagons furent abandonnés et les soldats partirent avec des provisions pour dix jours. Le général Strange était alors à Smithfield en avant, et cette distance fut franchie dans une seule journée, mais ils avaient fui, abandonnant tout derrière eux, à l'exception de leurs armes et de leurs provisions. Ils ne purent pas le temps d'enterrer leurs morts et plusieurs cadavres furent découverts sur la route. Ce pays n'est qu'un vaste marais dans lequel hommes et chevaux enfonçaient à mi-jambes, et de plus ils étaient incommodes par des nuées de mouches et d'insectes qui les faisaient souffrir.\n\nLe 5 juin la colonne du général Strange, malgré toutes ces difficultés, franchit une distance de 30 milles et deux compagnies du 92ème fit 40 milles, de Fort Pitt au Lac à la Grenouille.\n\nLe lendemain, sans une seule journée de repos, la chaleur était si intense que le soleil disparaissait par son ardour, était toujours en avant. Les hommes étaient presque nu-pieds et leurs uniformes étaient en lambeaux. La journée du dimanche fut encore plus pénible que les autres ; les insectes étaient intolérables et les chemins tout-à-fait impraticables. Des soldats étaient obligés de trainer les chevaux eux-mêmes qui entraînaient les chariots dans la boue.\n\nOn est obligé d'abandonner un chemin une partie du bagage.\n\nAprès avoir franchi 20 milles de cet horrible pays, on atteignit une plaine fertile et cultivée, dans la vallée de la rivière Castor.\n\nEn arrivant on vit cinq cents Sauvages traverser la rivière Castor, mais ils ne furent pas molests. Comme les Sauvages de Gros Ours avait quatre jours d'avance sur les troupes et que ces dernières n'avaient plus que pour trois jours de vivres, le général Middleton décida de renoncer à la poursuite et traversa le fleuve pour rejoindre Fort Pitt après avoir parcouru 80 milles dans un pays impraticable et inexplorés, sans résultats appréciables.\n\nPendant ce temps les Chippewas avaient fait leur suspension au général Strange et lorsque le 13, le général Middleton revint au camp, il s'occupa immédiatement de l'organisation d'une nouvelle expédition à la poursuite de Gros Ours. Middleton devait rejoindre le général Strange à la Rivière-au-Canard avec sa cavalerie et les Gatlinga. Si on ne trouvait pas les Sauvages à cet endroit, son intention était d'aller les rencontrer par l'Ouest.\n\nLe général Strange fut stationné à Calgary, McLeod, Gleichen et autres endroits des environs et le 9ème fut mis en garnison à Qu'Appelle et surveilla la route jusqu'à Humboldt. De plus le 28 mai, l'artillerie de garnison de Montréal fut envoyée à Régina, la capitale des territoires de la Reine, pour aider à la défense de l'État qui venait d'être établi à cet endroit, et aussi pour surveiller la tribu de Piapot.\n\nLa tribu des Pieds Noirs resta loyale et tint les promesses faites par le chef Pied-de-Corneau.\n\nLes Cris de la Vallée de Qu'Appelle étaient turbulents mais non hostiles. Pour les apaiser plus complètement on leur permit de tenir une \"danse du soleil\" un vestige de barbarie et d'idéalité que le gouvernement défendait depuis plusieurs années.\n\nLe lieutenant-gouverneur Dewdney et plusieurs officiers canadiens assistèrent à cette cérémonie.\n\nLe camp des sauvages était établi dans un endroit charmant, au milieu d'une plaine fertile, couverte de pins, et bien fournie d'arbres. Toute la population, hommes, femmes, garçons, filles et enfants étaient peinte des couleurs les plus bizarres, et revêtus des costumes les plus fantastiques. La fête eut lieu dans une grande cabane, au milieu du camp, dont l'intérieur était disposé en amphithéâtre.\n\nOutre la musique, les discours, les dances et les contorsions, il y eut aussi l'initiation des guerriers. Les jeunes gens qui aspiraient à devenir guerriers et à une plus haute classe que la chasse, la pêche et la guerre, doivent subir l'épreuve de la danse du soleil.\n\nLe postulant qu'on a dû aborder fait jurer pendant plusieurs jours, s'avance à main nue, aux mains d'une sorte de lugubre et le médecin ou sorcier de la tribu lui pratique avec un couteau une large entaille sous chaque sein, et dans les plaies béantes il enfonce deux petits billes de bois, par lesquelles sont attachées à un poteau planté au centre de la cabane. Alors l'aspirant guerrier s'éloigne du poteau de manière à tendre les cordes et il danse autour du poteau en tirant toujours jusqu'à ce que la chair et la peau cédent sous ses efforts. Lorsqu'il est à bout de forces de ses efforts, il reste en prières couché sur le ventre et la figure sur la terre. Lorsque les chefs jugent l'épreuve suffisante, on le relève et il est admis au rang des guerriers.\n\nCeux qui ne peuvent supporter ces terribles épreuves restent dans les camps à faire les travaux manuels, et il ne leur est pas permis d'avoir plus d'une femme.\n\nCelui qui a été admis dans cette circonstance est un jeune sauvage du nom de Petit Loup, un neveu de Piapot.\n\nLe retour Piapot et les chefs de sa tribu furent accueillis par le général de l'Artillerie de garnison de Montréal, et on passa une heure en leur présence. Les évolutions des soldats et la musique les émerveillèrent beaucoup, et la grosse caisse, surtout, fit des délices de Piapot qui, à son grand plaisir, obtint la permission de la battre pendant plusieurs minutes.\n\nQuelques jours après les Sauvages des quatre régiments de la Compagnie du Nord-Ouest, sortirent de leur réserve au nombre 479, le 12 juin, et donnèrent de grandes inquiétudes ; à force de menace, ils obtinrent du gouvernement une grande quantité de vivres et de vêtements.\n\nLe lieutenant-colonel Scott envoya immédiatement des compagnies du 8ème pour les ramener sur leurs terres. Les chefs Piapot, Coquetry Blanches et Pee-pee-see-sees furent arrêtés et envoyés à Régina. Tous les prisonniers qui avaient été faits à Batoche et à Prince Albert...\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nLe soir du 17 ces plans furent dérangés par la nouvelle que la famille McLean et les autres prisonniers des Cris des Bois étaient en liberté et se rendaient à Fort Pitt.\n\nOn apprit aussi que lorsque le général Middleton eut renoncé à la poursuite, les guerriers de Gros Ours qui manquaient de vivres et de munitions s'étaient débandés.\n\nGros Ours se dirigea vers l'est soit pour rejoindre Riel dont il ignorait la capture, soit pour retourner à Lac Ste. Anne où se trouvait un magasin de la Cie de la Baie d'Hudson.\n\nLe général renonça encore une fois à la poursuite et le 20 il arrivait à Fort Pitt.\n\nLe 22 tous les prisonniers du camp de Gros Ours arrivèrent dans l'avant-midi. McLean dit que les prisonniers ont enduré beaucoup de misères, mais que le sort était au plus pire. Tant que les Sauvages ont eu des vivres en abondance, ils ont été relativement bien traités, mais ensuite ils ont souffert de la faim. Les Cris des Bois se sont séparés de Gros Ours et l'on force à rendre les prisonniers, qu'on laissa libres de partir pour Fort Pitt, seuls, trois jours avant.\n\nMcLean dit qu'on ne lui a fait aucune insulte personnelle à lui ni à aucun des membres de sa famille.\n\nTous les prisonniers étant relâchés et les guerriers de Gros Ours étant partis en petits bandes trop peu nombreuses pour être dangereuses, le général Middleton jugea que l'œuvre des volontaires était terminée et il laissa à la police à cheval le soin de soumettre les derniers rebelles.\n\nLe 20, on avait appris que Gros-Ours était au lac Étchemin ou sud du lac Vert, où se trouvait Irving's Otter avec les Queen's Own et la compagnie C, était aussi sur les traces des fuyards, mais il n'avait que vingt cavaliers avec lui, et l'infanterie ne pouvait pas entreprendre une telle poursuite. De plus les sauvages ayant aperçu un éclaireur, furent tellement effrayés qu'ils s'enfuiront encore plus avant dans le Nord.\n\nL'ordre de retraiter parvint à Otter quelques jours après.\n\nC'est alors quelle retour commença, mais il ne fit pas sans difficultés. Les troupes étaient harassées, le Midland arriva à Fort Pitt le 22, le 23 le 45e arriva à Fort Pitt et le 24, nous avons franchi 37 milles à travers les marais, dans une seule journée, et ce n'est que le 27, qu'il fit son entrée à Fort Pitt ; l'arrière-garde de la colonne de Strange arriva le 29.\n\nLes trois divisions qui avaient opéré sur la Saskatchewan étant toutes rentrées, on décida de faire partir l'infanterie en bateau jusqu'à Selkirk, en wagons jusqu'à Port Arthur, en bateau jusqu'à Owen Sound et enfin par char. Ce trajet rapide fut très agréable aux troupes épuisées.\n\nDans la matinée du 3 juillet, le lieut.-colonel Williams le commandant du Midland qui avait fait toute la campagne et qui s'était trouvé près de la rivière Batcota, mourut sur le bateau d'une fièvre typhoïde. Moins d'une heure après, le sergent Valiquette du 65e, qui avait aussi supporté vaillamment toutes les fatigues et les dangers de cette expédition lointaine, succombait à la même maladie.\n\nLes corps de ces deux victimes du devoir ont été rendus à leurs familles, et leurs deux villes, nous disons que le pays leur firent des funérailles dignes de leur belle mort.\n\nCes tristes événements retardèrent quelque peu le départ du bateau.\n\nLe même jour, mais dans une autre partie du pays se passait un événement qui mettait virtuellement fin à la campagne. Un faible détachement de la police à cheval, commandé par le major Sévère Gagnon s'empara de Gros-Ours, de ses trois enfants et d'un de ses conseillers. Ces prisonniers furent envoyés à Prince Albert sous bonne escorte.\n\nQuelque temps après l'Esprit Errant, Le Ver et quelques autres instigateurs du massacre du Lac à la Grenouille firent leur soumission au col. Osborne Smith.\n\nTous les chefs de la rébellion étaient maintenant entre les mains des autorités, à l'exception du général chef des rebelles, Gabriel Dumont.\n\nNous n'avons pas à faire l'éloge des volontaires qui ont pris part à cette campagne, ni même de la révolte, mais nous reconnaissons leurs services et les réceptions qui leur ont été faites nous dispensent de tous commentaires.\n\nCHAPITRE XIX.\n\nLA FIN DE LA CAMPAGNE.\n\nAprès la soumission des Chippewayans à la rivière Castor, le général Strange institua une enquête pour savoir quelle part ils avaient prise au massacre du Lac à la Grenouille ; le résultat de l'enquête fut qu'ils obtinrent la permission de retourner sur leur réserve.\n\nLe général Strange engagea les meilleurs de ces Sauvages comme (clairiers pour donner la chasse à Gros-Ours dont on avait perdu les traces.\n\nLe 16 juin, le général Middleton arriva au camp du général Strange.\n\nLe camp de la rivière au Castor, devint la base des opérations contre Gros-Ours et sa bande.\n\nMiddleton dépêcha le colonel Osborne Smith et 100 hommes du 92 de Winnipeg au lac Froid.\n\nLe capitaine Constantine avec un parti d'éclaireurs et deux Chippewayans descendit la rivière Castor vers l'est pour s'assurer si Gros Ours s'était échappé par là.\n\nOn fit venir de Fort Pitt des provisions pour une campagne de deux semaines.\n\nPIAPOT,\n\nLe grand chef de Qu'Appelle.\n\navaient été conduits à Régina et outre Riel, il y avait le lieutenant McNeil et Sauvages.\n\nCe fut là le résultat de la tentative commencée depuis trois mois pour fonder \"La Nation Métisse\" et le \"Gouvernement provisoire de la Saskatchewan.\"\n\nREV. P. LEGOFF,\n\nMissionnaire parmi les Chippewas à la rivière au Castor.\n\nVEAU JAUNE.\n\nDans la matinée du 3 juillet, le lieut.-colonel Williams le commandant du Midland qui avait fait toute la campagne et qui s'était trouvé près de la rivière Batcota, mourut sur le bateau d'une fièvre typhoïde. Moins d'une heure après, le sergent Valiquette du 65e, qui avait aussi supporté vaillamment toutes les fatigues et les dangers de cette expédition lointaine, succombait à la même maladie.\n\nLes corps de ces deux victimes du devoir ont été rendus à leurs familles, et leurs deux villes, nous disons que le pays leur firent des funérailles dignes de leur belle mort.\n\nCes tristes événements retardèrent quelque peu le départ du bateau.\n\nLe même jour, mais dans une autre partie du pays se passait un événement qui mettait virtuellement fin à la campagne. Un faible détachement de la police à cheval, commandé par le major Sévère Gagnon s'empara de Gros-Ours, de ses trois enfants et d'un de ses conseillers. Ces prisonniers furent envoyés à Prince Albert sous bonne escorte.\n\nQuelque temps après l'Esprit Errant, Le Ver et quelques autres instigateurs du massacre du Lac à la Grenouille firent leur soumission au col. Osborne Smith.\n\nTous les chefs de la rébellion étaient maintenant entre les mains des autorités, à l'exception du général chef des rebelles, Gabriel Dumont.\n\nNous n'avons pas à faire l'éloge des volontaires qui ont pris part à cette campagne, ni même de la révolte, mais nous reconnaissons leurs services et les réceptions qui leur ont été faites nous dispensent de tous commentaires.\nCHAPITRE XX.\nLE PROCÈS DE RIEL.\n\nAprès la capture de Grégoire, le départ des troupes et la soumission des derniers rebelles, dont le commandant le dernier nettoyeur, ou le dénouement, du cédénaire du Nord-Ouest; nous voulons parler du procès des instigateurs et des auteurs de la rébellion.\n\nLe procès de Riel commença à Régina le 6 juillet, devant le capitaine Richardson, magistrat des territoires du Nord-Ouest. L'accusé apparaît à la barre, avec l'assurance d'un homme qui a confiance dans la justice de sa cause.\n\nAyant répondu d'une voix ferme au magistrat que son nom était Louis Riel, ce dernier lui demanda pourquoi il se présentait. Voici ce document :\n\n\"Etant sujet de Notre Souveraine Dame la Reine, mettant de côté son devoir d'allégeance, n'ayant pas la crainte de Dieu dans son cœur, mais étant poussé et séduit par l'instigation du diable comme faux contre le droit de Notre Souveraine Dame la Reine, et, en conséquence, ne respectant pas l'allégeance, la fidélité et l'obéissance que tout sujet veut être fidèle de notre dite Souveraine Dame la Reine doit à notre dite Souveraine Dame la Reine, à la fin du mois de mars, dans l'année susdite, avec diverses autres personnes, fausses traitres, insoumises, des armes, des armées, des escarmouches, des guerres, c'est-à-dire des canons, des carabiniers, des pistolets, des baionnettes et autres armes, étant alors illégalement, malicieusement et traitrement assemblées et réunies ensemble contre Notre Souveraine Dame la Reine, ont de la manière la plus méchante, la plus vilaine, la plus ignoble, la plus basse, la plus faible, la guerre contre notre dite Souveraine Dame la Reine, dans une localité connue sous le nom de Lac au Canard, dans les dits territoires du Nord-Ouest du Canada, et dans les limites de ce royaume, et ont alors malicieusement et traitrement, par force armée, tenté de prendre et de faire la constitution et le gouvernement de ce royaume, tel qu'établi par la loi, et privé et déposé notre dite Souveraine Dame la Reine du titre, de l'honneur, et du nom royal de la Couronne Impériale de ce royaume, au moins de notre dite Souveraine Dame la Reine, de la manière, de l'exemple de tous autres se rendant coupables de la même offense, contrairement au droit d'allégeance qui lui était dû par le dit Louis Riel, contre la forme du statut en pareil cas fait et pourvu, et contre la paix de Notre Souveraine Dame la Reine, sa couverture et dignité.\"\n\nUn semblable acte d'accusation a été dressé au sujet des deux batailles de l'Anse au Poisson et de Batoche.\n\nLe procès public de Louis Riel commença régulièrement, présidé par le magistrat stipendié du tribunal assisté de MM. Lejeune, juge de paix, et de MM. Robinson, Osler, Burbridge sous ministre de la justice et Chase Casgrain.\n\nLes avocats de Riel étaient MM. Lemieux et Fitzpatrick de Québec, MM. Greshields de Montréal et MM. Johnston de Régina.\n\nAprès avoir vainement accusé la juridiction du tribunal, les avocats de Riel essayèrent de prouver la folie de leur client.\n\nLa preuve faite par la couronne consista à faire entendre plusieurs témoins qui avaient été plus ou moins mêlés à l'insurrection et à produire certains documents trouvés en la possession de Riel.\n\nLe 21 juillet, la défense demanda un ajournement d'un mois pour pouvoir faire venir les témoins nécessaires. Après délibération, la cour accorda la remise à huitaine et la couronne se chargea de faire venir à ses frais, les témoins indispensables à la défense.\n\nPendant l'ajournement, le 24, Jackson, le secrétaire de Riel, subit son procès qui dura quinze minutes, et il fut acquitté sur un plaidoyer de folie.\n\nLe 28 on reprit le procès de Riel.\n\nLa couronne entendit entendre les témoins suivants : Le docteur Willoughby, de Saskatoon ; Thomas Macdonald, de Prince Albert ; Henry Ross, un arpenteur de Prince Albert ; H. Ross, Wm. Tompkins, Tash, un agent des Sauvages ; George Ross ; George Kerr ; Henry Waters ; Wm. Mitchell ; Thomas Jackson ; le général Middleton et Charles Nolin.\n\nLa couronne ayant terminé sa preuve, la défense fit entendre les témoins suivants : Le révérend père André ; Philippe Garnot ; le révérend père Fourmond, et les docteurs Roy et Clarke. Tous ces témoins jurèrent que l'accusé, d'après eux, est fou, ou du moins irresponsable lorsqu'il s'agit de questions religieuses ou politiques.\n\nEn cours de preuve, la couronne fit entendre, le docteur Wallace de Hamilton, le docteur John de la rivière à cheval, le général Middleton, le capitaine Young, le révérend C. B. Pitblado, le capitaine Dunn et le caporal Piggott.\n\nLe 31 la preuve était terminée de part et d'autre et les plaidoiries commencèrent.\n\nElles eurent lieu dans l'ordre suivant : pour la défense, M. Fitzpatrick, puis Riel lui-même, puis pour la couronne, M. Robinson.\n\nLe juge Richardson, commença alors à relire la preuve au jury, mais il dut ajourner au lendemain.\n\nÀ dix heures le 1er août, le juge termina le résumé des témoignages, et après une charge du juge, les avocats de la défense se retirèrent pour délibérer à 2.15 de l'après-midi. À 3.15 il revint avec un verdict de coupable, avec recommandation à la clémence de la Cour.\n\nRiel qui était resté en prison pendant tout le temps de la délibération des jurés, reçut ce verdict avec calme, et le juge lui ayant demandé s'il avait quelque chose à dire avant que la sentence fût prononcée, il se leva et parla avec animation pendant presque deux heures.\n\nLorsqu'il eut terminé, le juge prononça la sentence de mort et Riel fut condamné à être pendu à Régina le 18 septembre.\n\nRiel reçut ce nouveau coup avec un grand calme apparent et il fut reconduit dans sa cellule.\n\nLes avocats partirent immédiatement pour Winnipeg pour en appeler de ce jugement, à la cour du banc de la Reine du Manitoba, et cet appel est fixé au 3 septembre.\n\nDans l'intervalle, des assemblées ont lieu à différents endroits dans la province de Québec, des représentants du gouvernement, pour demander au gouvernement soit de commencer la sentence, soit de gracier Riel, soit d'accorder un sursis, soit de nommer une commission de médecins aliénistes pour examiner l'état des facultés mentales de Riel. On organise aussi des souscriptions pour permettre aux avocats de Riel de porter la cause jusqu'en Angleterre.\n\nNous sommes certains que le gouvernement ne veut pas tarder à faire de toute une province et qu'il interviendra d'une manière ou d'une autre, de façon à satisfaire toutes les exigences.\n\nLa principale objection des partisans de Riel qui demandent un appel, c'est que le tribunal a été présidé par un simple magistrat stipendié et non par un juge, et aussi qu'il n'y avait que six jurés au lieu de douze.\n\nLa question de la jurisdiction qui a été jugée en faveur de la couronne par M. Richardson, reviendra aussi devant le tribunal d'appel.\n\nLe point le plus saillant de tout ce procès, c'est l'invincible opposition que Riel fait à toutes les tentatives de ses avocats et de ses témoins pour démontrer qu'il est fou. Il a répété à plusieurs reprises qu'il préférait mourir que de laisser croire qu'il est privé de raison. \"Je ne tiens pas, dit-il, à la vie purement animale, et je refuse l'échafaud à une existence privée de liberté.\"\n\nCHAPITRE XXI.\nDÉPART DU 65ÈME BATAILLON, SA CAMPAIGNE ET SON RETOUR.\n\nÀ sept heures et demie dans la soirée du 27 mars, le colonel Harwood, D. A. G. de Montréal, recevait de l'Adjudant Général Powell, d'Ottawa, la dépêche suivante :\n\n\"Aviser le 65ème bataillon sous les armes, pour service immédiat, et faire moi part du résultat par dépêche.\"\n\nLe lieutenant-colonel Harwood, qui habitait Vauclerc, était parti pour la journée et la dépêche resta au bureau jusqu'à onze heures le lendemain matin, lorsque le lieutenant-colonel Hughes, ayant entendu dire que le 65ème allait être appelé sous les armes, se rendit au bureau du télégraphe et parvint à se faire remettre la dépêche adressée au colonel Harwood.\n\nIl notifia immédiatement le colonel Ouellet et tous deux furent parvenir la nouvelle à tous les autres officiers du bataillon. Une assemblée fut tenue immédiatement et une autre fut convoquée pour le lendemain à 9 a.m. On décida alors qu'une parade du bataillon aurait lieu à 7.30 le même jour.\n\nLes soldats se réunirent au marché Bonsecours en nombre de 200, tous pleins d'ardeur et d'enthousiasme mais pauvrement équipés.\n\nIls ne s'étaient pas réunis depuis des mois, et sous le rapport de l'exercice, ils ne valaient guère mieux que des recrues. De plus, le bataillon n'était pas au complet, on enchaîna un certain nombre de nouveaux venus.\n\nLes officiers firent tous leurs efforts pour équiper convenablement leurs hommes, mais comme beaucoup d'articles devaient être fabriqués, ce n'est que le 2 avril que le régiment fut prêt.\n\nPendant ce temps-là le bataillon était sous les armes du 24 au 26 heures à onze du matin et de deux à cinq du soir, faisant des exercices sans relâche, de sorte que, le 24 avril, à huit heures du soir, lorsqu'il partit de Bonsecours pour la garde du Pacifique au milieu d'une violente tempête de neige, il avait une allure toute militaire.\n\nÀ la garde il y avait des femmes en armes, et après quelques minutes de marche, elles se mirent à saluer les officiers.\n\nDans les chars tout le monde discutait avec animation les événements du Nord-Ouest, et chaque soldat exprimait le désir que le 65ème prenne une part éminente dans la suppression de la révolte.\n\nOn disait que le 65ème ne serait pas envoyé au feu, mais serait placé en garnison à quelque part, tous les hommes du bataillon signèrent une requête demandant à marcher sur l'ennemi, et d'avoir l'occasion de croiser le fer avec les rebelles, au plus tôt.\n\nCette requête fut présentée au colonel Ouellet, qui la transmettra à la division supérieure, à Sudbury Junction, dans la soirée du 3 avril, vingt-quatre heures après le départ de Montréal.\n\nUne rivalité amicale existait entre les différentes compagnies, pour savoir qui occuperait le poste d'honneur dans le cas d'une rencontre avec l'ennemi.\n\nDans la même soirée, une députation de la compagnie No. 1, capitaine Ostell, réclamait du colonel le privilège d'exécuter la première charge à la baïonnette contre les forces de Riel. On ne vit jamais de soldats plus remplis d'enthousiasme.\n\nLe bataillon atteignit l'extrémité du chemin de fer au Lac Ste. Anne. À l'intervalle à partir de 10 heures, le train arriva, bien que les autres bataillons, eussent des wagons pour transporter le bagage.\n\nLe thermomètre marquait 15° au-dessous de zéro et dans certains endroits la neige avait cinq pieds d'épaisseur et cependant on entendit une plainte de murmure.\n\nLe bataillon arriva à Port Arthur de bonne heure le 9 mai au matin, et on lui fit une réception enthousiaste. À six heures le lendemain matin, on arrivait à Winnipeg et les hommes déjeunèrent dans les différents hôtels de la ville.\n\nDans l'après-midi du même jour, la patrouille pour Calgary, au nord des colonies, des milliers de soldats qui avaient accompagné jusqu'à la gare. À 10.25 du soir ils étaient à Brandon, où les dames de la ville montèrent dans le train et distribuèrent du café et des pains de provisions aux soldats.\n\nLe bataillon débarqua à Calgary dimanche matin, le 12 mai, à 10 heures. Officiers et soldats mirent tant d'ardeur aux exercices de toutes sortes, que bientôt, à les voir on eut dit un régiment de vétérans.\n\nTous soupiraient après la bataille, mais ce n'est que le 20 avril, que l'aile droite comprenant les compagnies 6, 7 et 8, sous le commandement du lieutenant-colonel Hughes, et le général Strange, pour faire lever le siège d'Edmonton. Le 24, l'aile gauche partit aussi, sous le commandement du major Perry. Il y avait des wagons pour la moitié de l'aile droite, et les soldats prenaient les voitures chacun leur tour, mais l'armée était trop nombreuse. On dut ainsi faire remarquer que les Queen's Own, qui allaient au secours de Battleford, furent pressés tout le trajet en voiture.\n\nL'aile droite du 65ème arriva à Edmonton le 2 mai et l'aile gauche le 5. Ce bataillon arriva juste à temps pour empêcher le massacre des centaines de femmes et d'enfants réfugiés dans les forts Edmonton et Saskatchewan.\n\nCette marche de Calgary à Edmonton est peut-être la plus remarquable de la campagne\net le général Strange et le major Perry, qui ont tous deux fait longtemps du service actif dans l'armée anglaise, s'accordent à dire que dans toute leur carrière ils n'ont jamais rencontré d'hommes aussi prêts et aussi disposés à agir.\n\nLe capitaine Ethier, de la compagnie No. 8, après avoir passé toute une nuit à surveiller la rive nord de la rivière de l'Élan Rouge, par où l'on s'attendait à voir arriver Gros-Ours avec ses guerriers, reçut instruction d'agir comme adjoint de l'infanterie.\n\nIl y avait maintenant une compagnie en garnison à la traversée de l'Élan-Rouge, sous les ordres du lieutenant Normandeau, et l'autre moitié aux Collines de la Paix, sous le lieutenant Villeneuve. Arrivés à Edmonton, les capitaines Ethier et Oatell furent mandés auprès du général Strange qui les félicita chaleureusement.\n\nCAPT. C. BOSSE,\nPov-Maître, 65me Bat.\n\nLe capitaine Ethier, de la compagnie No. 8, après avoir passé toute une nuit à surveiller la rive nord de la rivière de l'Élan Rouge, par où l'on s'attendait à voir arriver Gros-Ours avec ses guerriers, reçut instruction d'agir comme adjoint de l'infanterie.\n\nIl y avait maintenant une compagnie en garnison à la traversée de l'Élan-Rouge, sous les ordres du lieutenant Normandeau, et l'autre moitié aux Collines de la Paix, sous le lieutenant Villeneuve. Arrivés à Edmonton, les capitaines Ethier et Oatell furent mandés auprès du général Strange qui les félicita chaleureusement.\n\nCAPT. JOS. ROBERT,\nAdjutant, 65me Bataillon.\n\nLe 65me eut encore à supporter le fort de la mêlée et trois d'entre eux furent blessés.\n\nUne grande partie de l'intérêt qu'on portait aux événements du Nord-Ouest était concentrée sur les mouvements de Gros-Ours, dont une certaine quantité des femmes et des enfants. C'est au 65me et aux autres volontaires qui accompagnaient le général Strange, qu'on doit la délivrance de ces prisonniers.\n\nLes forces de Gros-Ours étaient complètement désorganisées et le résultat des différents engagements qu'elles avaient eu avec les braves Canadiens-français, et l'évasion des prisonniers devint facile.\n\nLe rév. M. Quinney arriva au camp immédiatement après la dernière bataille, disant qu'il s'était échappé du camp des Cris des Bois qui avaient abandonné Gros-Ours, et qu'il y avait encore avec eux plusieurs prisonniers, à quelques milles de là.\n\nUn détachement se porta à leur secours et bientôt après madame Gowenlock, madame Delaney, la famille Pritchard, le facteur Simpson et sa femme furent ramenés au camp.\n\nGros-Ours avait encore un grand nombre de prisonniers et la poursuite recommença. Une reconnaissante fut poussée jusqu'à la rivière au Castor, où on fit prisonniers 200 Chipewayans qu'on déarma.\n\nQuelque temps après on apprit que Gros-Ours était tellement démoralisé par ses rencontres avec le 65me, et par la chasse que ce bataillon lui avait donnée, qu'il remit tous ses prisonniers en liberté.\n\nLes troupes revinrent au Fort Pitt et reprirent bientôt l'ordre de rentrer dans leurs foyers.\n\nVoilà une feuille de route et dossier dont un régiment peut être fier.\n\nLe 3 juillet, les forces du Nord-Ouest, au nombre d'environ 4000 hommes partirent pour le retour. Le 65me fut mis à bord du \"Europe\" pour descendre jusqu'aux Grands Rapides. Ensuite, ils arrivèrent à Bathurst pour les funérailles du lieutenant William et du sergent Valiquette. À Prince Albert, on profita aussi d'un moment d'arrêt pour visiter Gros Ours qui venait d'arriver avec son fils et un de ses cousins. À Cumberland, M. Bélanger, faisant partie de la délégation, célébra dignement le passage du bataillon.\n\nÀ Grands Rapides, après un passage de 6 milles, le bataillon fut mis sur des barges plates remorquées par deux vapeurs et il traversa ainsi tout le lac Winnipeg et la rivière Rouge jusqu'à Selkirk, où une grande réception l'attendait.\n\nÀ Selkirk-Est, le bagage fut mis à bord des chars, et tout le trajet se fit ensuite par voie ferrée, sans interruption, jusqu'à Montréal.\n\nTout ce chemin fut une marche triomphale pour notre populaire bataillon.\n\nDes démonstrations de tous les lieux furent faites par les populations de tous les endroits importants où le train arrêtait : des adresses lui étaient présentées par les maires, et les citoyens venaient en foule acclamer les soldats et leur porter la main.\n\nÀ certains endroits mentionnons Selkirk, Port-Arthur, Red Rock, Sudbury, North Bay, Mattawa, Ottawa, Ste. Rose, St. Martin et Montréal.\n\nTout naturellement, c'est à cette dernière ville que la réception a été la plus grandiose. À neuf heures du soir le train entrait en gare. Plus de 20 000 personnes se massèrent toutes les rues avoisinantes ; la circulation était interrompue ; les fenêtres, les toits, les clôtures, les quais étaient couverts de monde agitant des mouchoirs et des drapeaux. La batterie de l'île Ste. Hélène tonnait, les nains vinrent distribuer des souvenirs et toutes les cloches de la ville étaient en branle.\n\nLe maire, accompagné des députations des autres corps militaires de la ville, et des\nCHAPITRE XXII.\n\nNOTES BIOGRAPHIQUES.\n\nLOUIS RIEL.—Nous n'entreprendrons pas de donner une biographie complète de Louis Riel, dont les faits et gestes sont bien connus de nos lecteurs, et qui serait trop longue pour le cadre restreint de ce volume. Nous donnerons une simple chronologie, aussi complète que possible : Né à St. Boniface en 1844. Entra au séminaire de Saint-Boniface en 1860. Étudia le droit à Montréal en 1865. Retourna au Canada en 1866-1867, cultivateur à St. Vital ; 1869, premiers mouvements en faveur des Métis ; 1870, Mgr. Taschereau agit comme médiateur.\n\n1873, amnistie accordée à Riel par les autorités impériales ; élection par acclamation de Riel dans le comté de Provencher ; il est réélu, cette fois, par élection officielle ; 1874, 16 avril, il est exclu de la Chambre par un vote de 124 contre 68 ; 3 septembre, il est réélu à Provencher ; 15 octobre, il est mis hors la loi par la Cour Suprême du Manitoba. 1873, 12 février, Riel et Lepine, privés de leurs droits politiques, sont amnistiés moyennant 5 ans d'exil.\n\nLIEUT. PLINGUET,\n\nCompagnie No. 1, 65e Bataillon.\n\nNos braves enfants, brûlés par le soleil, en haillons, mais l'air cramoisi et l'âme navale, reformèrent en ordre et alors commencèrent, traversant cette marche triomphale, dont nous ne croyons pas qu'il y ait eu d'exemple ailleurs. L'enthousiasme s'était changé en défi, des cris et des bravos partaient de toutes les poitrines ; la foule se bousculait pour le moins de voir, voulait toucher ces héros aimant récemment après quatre mois d'absence et des fatigues sans nombre. Toute la ville était décorée et pavonnée, et c'est sous une pluie de bonnets et de drapéaux que le drapeau blanc à la fleur de Lis-Dame pour y chanter au colonel Le Deum et entendre la chaleureuse allocution de monsieur l'abbé Énard.\n\nLa grande fête civique, était fixée au samedi 25 juillet, pour attendre le retour des deux bataillons mais la population dans son impatience, ne put attendre si longtemps pour accueillir le 65e.\n\nToute la semaine fut une semaine de fête, tous les soirs il y eut feu d'artifice et illuminations et la grande fête du samedi n'a été que le digne couronnement de cette semaine mémorable.\n\nLIEUT. A. VILLENEUVE,\n\nCompagnie No. 4, 65e Bataillon.\n\nGABRIEL DUMONT.—Celui qui a dirigé les opérations militaires des rebelles du Nord-Ouest, c'est Gabriel Dumont. Sous sa direction intelligente, encouragés par sa bravoure et son intrépidité, les Métis ont parfois accompli des prodiges de valeur.\n\nC'est lui qui commandait le feu lors du premier engagement avec la milice Canadienne. Il était à la tête de 22 braves et ils ont repoussé 140 hommes de la police à cheval et en ont tué un grand nombre.\n\nC'est encore Gabriel Dumont qui commandait les Métis à Batoche où ils ont formé une résistance digne de bons soldats et où leur chef a fait preuve de beaucoup de tact, d'habileté et de courage.\n\nCe n'est que par un coup d'audace que nos troupes sont parvenues à les déloger de leurs retranchements que Dumont avait faits dans l'espace de quelques jours et qui font honneur à son génie militaire.\n\nGabriel Dumont est un guerrier qui tient du sauvage et qui a emprunté à la civilisation, ce que la tactique militaire\n\nCAPT. DES TRÉOISMAISONS,\n\nCompagnie No. 2, 65e Bataillon.\n\n1877, il passe plusieurs mois à l'île de Bouctouche ; 1878, cultivateur dans le Minnesota ; 1879, instituteur dans le Montana ; 1881, il épousa Marg. Beaudry, à Fort Ellice ; 1882, il se rend aux sollicitations des Métis de la Saskatchewan, et porte la parole dans plusieurs assemblées ; 1883, 15 mars, son conseiller de commerce à la traversée sud de la Saskatchewan ; 23 mars, commencement de l'insurrection ; 26 mars, bataille du lac au Canot ; 31 mars, massacre d'un constructeur près de Batoche ; 2 avril, massacre du lac aux Grenouilles ; avril 24, bataille de l'Anse-au-Poisson ; 2 mai, bataille de l'Anse-aux-Coucous ; mai du 4, au 11, bataille de Batoche ; 15 mai, Riel se livre au gén. Middleton ; 23 mai, Riel en prison à Régina ; 20 juillet, commencement du procès.\n\nLIEUT. LAFONTAINE,\n\nCompagnie No. 5, 65e Bataillon.\n\nCAPT. GIROUX,\n\nCompagnie No. 6, 65e Bataillon.\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nCAPT. ETHIER,\nCompagnie No. 8, 65e Bataillon.\n\nDumont faisait au Nord-Ouest, la traite des pelleteurs : il a passé une grande partie de son existence à la chasse. C'est un tireur des plus adroits et un chasseur des plus habiles. La chasse du bison est une des expériences les plus difficiles et Dumont aimait à en courir les dangers. Il est d'un caractère aventurier, hardi, brave et prudent. Il ne connaît pas ce que c'est que d'avoir peur. Avec tout cela, il est honnête, sincère et loyal.\n\nIl était le chef militaire des Métis, mais il a détesté la politique.\n\nIl a toujours rêvé l'indépendance pour les enfants du sol de ces contrées. Son ambition était de fonder une petite république dont il serait le président. Il était au fond des troubles qui ont eu lieu en 1869.\n\nEn 1870, il formait un gouvernement provincial, et il mena le défilé du coup de main qui a éclaté en 1885. Pour mieux atteindre son but, il est allé lui-même, avec quelques autres, chercher Riel, qui résidait dans le Montana. S'il a soufflé l'esprit de révolte, ce n'était pas pour causer des embarras, ni pour le plaisir de voir des tragédies. Le général Dumont était sincère, il croit réellement pouvoir obtenir l'indépendance du Nord-Ouest. Il comptait sur les difficultés que présentaient ces vastes prairies et sur le concours des tribus sauvages pour réussir dans l'accomplissement de son projet.\n\nS'il est pu compter sur un plus grand nombre de combattants, c'était un homme à faire un coup d'éclat comme Washington et Lafayette.\n\nIl a fait des exploits dans le Nord-Ouest qui le rendent légendaire même chez les Sauvages. Dumont doit avoir une cinquantaine d'années maintenant. Il est respecté des tribus sauvages et des Métis, ses nationaux.\n\nLa dernière insurrection a démontré sa vaillance, ils ont combattu en brave, jusqu'à ce que vaincus par le nombre, ils se soient dispersés. Comme la seule planche de salut pour les chefs des rebelles était la fuite, Gabriel Dumont se réfugia dans le Montana, où il est maintenant en sûreté.\n\nLe nom de Gabriel Dumont sera respecté dans l'histoire. Sir John MacDonald disait en parlant : \"Gabriel Dumont s'est conduit comme un brave et il a droit au respect.\"\n\nL'HONORABLE P. A. CARON, ministre de la Milice, et fils de feu l'Honorable R. E. Caron, Lieutenant-Gouverneur de la Province de Québec.—Il naquit en 1843. Fit ses études au séminaire de Québec, aux Universités de Laval et de McGill, où il gradua B. L. C. 1865. épousa le 25 juin 1869, Alice, fille unique du feu l'Hon. Francis Baby. Étudia chez M. G. Baillarge, Q.C., et subéquemment avec Sir John Rose, bart., et fut reçu avocat en 1869.\n\nFut élu député du comté de Québec en mars 1873, ré-élu par acclamation en 1874 et encore ré-élu aux dernières élections générales. Fût créé Conseil de la Reine en 1876.\n\nLE GÉNÉRAL MIDDLETON.—Le major général Middleton commandant en chef de l'expédition du Nord-Ouest a à son compte de nombreux états de service dans plusieurs pays étrangers. En 1846, il prit une part très active à la guerre des Moors dans la Nouvelle-Zélande, mais ce fut dans la mutinerie des Cipayes dans l'Inde en 1850 et 1853, qu'il prit une part au désastre de Lucknow, comme aide de camp du général Lugard, qu'il se distinguait particulièrement et fit promptement preuve en reconnaissances des services qu'il avait rendus dans cette campagne. À l'escrime de l'Agaiburg il exerçait un commandement et pour avoir deux fois vaillamment sauvé la vie d'un compatriote d'armes dans des circonstances, au cours desquelles la situation fut recueillie par le général Lugard pour la croix de Victoria. L'honneur qu'on ambitionnait pour lui fut accordé à un autre, l'un de ses compagnons dans l'une de ces aventures, et le général Middleton, alors capitaine, ne fut pas recommandé par lord Clyde pour la croix de Victoria, parce qu'il ne pouvait être recommandé pour la croix de Victoria.\n\nComme officier de la nouvelle école, il jouissait d'une haute réputation dans le service et pendant quelques années, il occupa la position de commandant du collège militaire de Sandhurst, où jeune homme, il avait reçu son éducation. La classe de 1869, expérience militaire, il était particulièrement qualifié pour la campagne du Nord-Ouest, avant longtemps vécu au Canada, de plus son alliance, il faisait partie de l'une des familles canadiennes françaises les plus populaires, la famille\n\nCAPT. ROY,\nCompagnie No. 4, 65e Bataillon.\n\nDouceur, de Montréal, et aussi j'ai la connaissance approfondie qu'il avait des hommes qu'il devait commander. Il n'est que juste d'ajouter que dans cette dernière campagne, il a déployé en tout, une prudence, une modération et des qualités militaires qui ont été hautement appréciées et qui, malgré tout, ont été encore dans une certaine mesure et par les observateurs étrangers les plus compétents à le juger.\n\nMAJOR GÉNÉRAL STRANGE.—Le Major Général Strange descend par sa mère, de Charles Martel et de Charlemagne.\n\nIl s'était distingué dans les Indes, en 1853 et 1859, par sa bravoure et son aptitudes pour la vie militaire et il a pris part aux campagnes de Chitral, Skandar et Dhorrorra, ainsi qu'à la prise de Lucknow ; en un mot, il a été à treize engagements.\n\nLors de l'évacuation de Québec, en 1871, le colonel Strange reçut instruction de former et de commander la première garnison d'Artillerie Canadienne, qu'il a établi sur des bases solides, sur les écoles d'artillerie qui ont fourni tant de forces capables.\n\nC'est un homme d'un grand ascendant, un disciplinaire d'un commandement à la fois bon et ferme. Le Major Général alla à Kingston en juin 1880, lorsqu'on y transféra ses batteries. Il fut promu à la Grade de 1882 et après de temps, il fut retiré. Il alla dans le Nord-Ouest, où il acheta une grande étendue de terrain, au pied des Montagnes Rocheuses.\n\nLorsque l'insurrection a éclaté, il a offert ses services au gouvernement et le commandant en chef de nos troupes a confié le commandement d'une colonne de notre armée dont le 65e faisait partie.\n\nLE COLONEL W. D. OTTER, qui commandait dans le Nord-Ouest les volontaires de Toronto, est d'origine anglaise. Son père était fils du Très-Rév. William Otter, ancien principal du King's College, à Londres,\n\nLIEUT. ROBERT,\nCompagnie No. 6, 65e Bataillon.\nL'INSURRECTION DU NORD-OUEST, 1885.\n\nLe colonel Otter a commencé sa carrière militaire dans le régiment des Queen's Own, organisé en 1832 sous le commandement du colonel Durie. Son goût, ses talents plus que extraordinaires pour la vie militaire lui assurèrent une promotion rapide et en 1841, il servait comme enseigne dans le bataillon de Niagara sous le capitaine Gilmore.\n\nQuand ce dernier fut promu au grade de colonel des Queen's Own, l'enseigne Otter devint adjoint et fit ensuite un stage de sept ans dans ce grade ; enfin, au départ du colonel Gilmore, en 1875, le major Otter lui succéda.\n\nEn 1876, il fut nommé fait partie du détachement pour le concours de tir de Wimbledon et en 1881 il y avait le commandement en chef ; il resta quelques temps en Angleterre.\n\nDe stature moyenne, il a une digue et belle contenance et des manières franches qui excluent tout malaise.\n\nLe Lieut.-Colonel Jos. Adrien Ouimet appartenant à une des plus vieilles familles de France, de Québec. Fils de M. Michel Ouimet, né à Ste-Rose, Province de Québec le 26 mai 1848. Étudia au séminaire de Ste-Thérèse de Blainville ; gradua L. L. B., au collège Victoria de Cobourg en 1869. Épousa en 1874, Mme Ouimet, fille de Alfred Laflèche de Montréal, et de dame Emeline Berthelet. Fut reçu avocat en 1870, il fait partie de l'association de Ouimet, Cornetier et Lejoie. Fut élu député de Laval-le-Haut en novembre 1873, réélu par acclamation en 1874, et aux dernières élections générales. Il est colonel du 5e bataillon depuis 1880.\n\nLe Lieut.-Colonel Guill Amiot, avocat de Québec, né le 9 décembre 1843, à St-Gervais, comté de Bellechasse ; il reçoit son éducation au collège de Ste-Anne de l'Ancienne-Lorette, comté de Kamouraska. Il fut élu député de Ste-Anne-de-Bellechasse le 20 mai 1881.\n\nLe 29 juin 1882, lors des dernières élections générales, il eut pour adversaire, toujours dans le comté de Bellechasse, M. Ernest Proulx, mais il sortit victorieux de cette lutte, avec une majorité de 142 voix.\n\nLe député de Bellechasse est commandant du 5e bataillon des Voltigeurs de Québec. Bien qu'il n'ait pas reçu le baptême de feu, il a su conquérir le suffrage populaire pendant la campagne du Nord-Ouest. Si son bataillon ne revient pas avec autant de lauriers que les autres, il peut du moins se rendre le témoignage d'avoir accompli son devoir, et à ce titre il a bien mérité de la patrie.\n\nLe Lieutenant-Colonel Montzambert est né à Québec en 1841, du mariage d'Edouard Louis Montzambert, grand-père du colonel et de Dile Bowen, fille de feu, juge de paix. Il reçut une éducation commerciale à Québec, mais de bonne heure il fit preuve de dispositions militaires prononcées. Il entra résolument dans le mouvement des volontaires et servit pendant plusieurs années comme capitaine adjoint dans l'artillerie de garnison de Québec.\n\nQuand les batteries A et B furent formées en 1871, il fut nommé major dans la batterie B avec le grade de lieutenant-colonel sous les ordres du colonel et de feu général Strange. Lors de la retraite de ce dernier, il devint lieutenant-colonel et commandant de la batterie B et de la citadelle de Québec et se rendit avec la batterie à Kingston il y a cinq ans.\n\nIl a été un fois commandant des tireurs envoyés à Winnipeg et a été subalternement adjoint à plusieurs fois à l'arsenal de Woolwich comme instructeur d'artillerie.\n\nLe colonel, qui est un excellent officier, a commandé sous le col. Strange lors des émeutes des journaliers à Québec il y a quelques années. Il est marié à la fille de feu M. James Gibb, Secrétaire du Gouverneur-Général et Secrétaire Militaire. Attaché à l'état-major du général Gordon, il est maintenant major-général du Nord-Ouest. Il avait offert ses services au gouvernement impérial, lors de l'expédition au Soudan pour secourir le général Gordon, mais l'Angleterre tout en remerciant le gouvernement canadien de son éloignement, fit réponse qu'on ne croirait pas nécessaire d'utiliser les forces de notre milice.\n\nLorsque le col. Williams a offert ses services pour le Nord-Ouest, on les accepta avec empressement et, le 6 avril dernier, le colonel laissait Kingston à la tête d'environ 385 soldats et officiers.\n\nÀ la fin de la campagne, comme il était sur le bateau qui ramenait les hommes de son régiment dans leurs foyers il fut atteint des fièvres typhoïdes et succomba après quelques jours de maladie.\n\nLe Major Lieut. Nevry F. Crozier, qui commandait à la bataille du Lac-au-Poisson ou Ca-\n\nnard, est le plus ancien survivant de l'insurrection à cheval du Nord-Ouest. Né à Newry, dans le nord de l'Irlande, en 1846, le major est descendant des Croziers de Liddesdale. Thomas Deacon, son grand-père, fut le premier maître du poste de Kingston.\n\nLe major Crozier commença sa carrière militaire en 1865, lorsqu'il s'engagea dans le 1er bataillon et prit du service sur la frontière de Niagara. Il servit ensuite en 1866, lors de l'invasion américaine et il fut fait officier et pris du service à Cornwall.\n\nAu Nord-Ouest, le major Crozier s'est distingué par maints exploits, et il a rendu de grands services dans la répression de la révolte.\n\nLe Lieut.-Col. Forrest, major-chef de troupes, il avait ses quartiers généraux à Québec. Sa position habituelle est celle de directeur des magasins, et, en recommandant sa nomination, le chronicleur de Québec disait, le 15 février : \"Le Colonel Forrest est tout à fait qualifié pour être nommé directeur de la classe de la Royal School of Gunnery. Il a été le premier à activer l'entraînement volontaire à Lévis et il fut gazeté le 19 décembre, 1861, lors de la formation du premier corps à Lévis. Il fut nommé major-chef du 7e District Militaire en 1866, et Surintendant des magasins en 1879. Il a rendu de grands services.\n\nLe Lieut.-Col. Oswald, commandant de l'artillerie de garnison de Montréal, est originaire d'Ecosse et descend d'une des plus anciennes familles militaires de ce pays.\n\nIl vint au Canada en 1866, et retourna en Ecosse après quelques années, pour revenir définitivement au Canada, en 1870. À Montréal, il est agent des compagnies d'assurance \"Scottish Provident\" et \"Scottish Fire Insurance.\" Il fait aujourd'hui partie de la maison Oswald Brothers, courtiers en assurance.\n\nLe Colonel Oswald entra dans l'artillerie de garnison en 1868. En 1870, il fit partie de la campagne contre les féroceins et devint commandant du bataillon en 1881.\n\nMembre de l'association des Artilliers de garnison, depuis environ 12 ans, il remporte le prix du Marquis de Lorne, à Shoeburyness, en 1881, et est aujourd'hui Président de l'Association.\n\nC'est grâce à son énergie et à son esprit d'initiative que les Artilliers Canadiens ont aujourd'hui les armes Armstrong.\n\nLe Lieut.-Col. Houghton, major de l'artillerie, qui a fait la campagne du Nord-Ouest avec le 65e est né à Trois-Rivières en 1846. En 1878, il abandonna ses études pour s'engager dans le régiment des zouaves pontificaux. Il passa deux ans en Italie, en 1878, en qualité de soldat et officier, et en 1880, il était nommé major de brigade du 6e district. Il est major dans le 65e depuis 1880.\n\nLe Docteur Darby Bergin, chirurgien général de la milice canadienne, naquit à Toronto, le 7 septembre 1828.\n\nIl est le fils de feu Wm. Bergin, ingénieur civil, qui était venu s'établir au Canada en 1829. Le Dr. Bergin fit son cours classique au Upper Canada College, où il sut se distinguer et fut nommé diplômé du collège de Montréal.\n\nLors des difficultés de Trent, en 1861, il fut nommé pour prendre le commandement d'une compagnie de volontaires et il a continué, de puis lors, à occuper activement du service. Il servit dans le 4e Bataillon Provincial, à La Prairie, de décembre 1863 à mars 1864, comme officier de santé et, en 1865, pour la campagne de l'Insurrection, en 1861. En 1869, il organisa le 65e Bataillon de Stormont et Glengarry et fut gazeté lieutenant-colonel, poste qu'il occupa jusqu'à ce qu'il fût nommé chirurgien général.\n\nEn 1870, le Dr. Bergin fut élu pour l'élection à Cornwall, province de l'Ontario, il fut défaire en 1873, et élu de nouveau en 1878. En 1882, lors de la ville de Cornwall fut annexée au comté de Stormont, il fut choisi pour être le porte-étendard du parti conservateur dans le comté.\nIl avait pour opposant feu M. James Pothuné, C. L., qui fut défait par plus de cinq cents voix.\n\nLe Dr Douglass, dont nous publions le portrait, grâce à sa bienveillante obligeance de Mme Douglass—est le fils du Dr Geo. Douglass; venu d'Écosse pour s'établir à Québec, et qui a eu, pendant quelque temps, la surveillance de la quarantaine, à la Grosse-Île.\n\nLe sujet de notre portrait, assez vingt ans de l'artiste, est mort en 1882.\n\nIl a servi aux Indes, British Burmah, Andaman Island, (où avec quatre autres officiers du 24e régiment, auquel il était attaché, il avait reçu la croix Victoria,) à la Nouvelle-Écosse, et de nouveau aux Indes.\n\nLe Dr Douglass fut fait membre honoraire de l'ordre de Saint-Jean de Jérusalem, lorsqu'il se rendit aux Indes, en 1880, après avoir fait des examens et des lectures sur les devoirs de l'ambulance dans plusieurs villes de l'Angleterre. Il reçut aussi, dans le même temps, la croix Victoria, il lui fut donnée une médaille d'argent de la Légion d'honneur.\n\nLe Dr Douglass est actuellement chargé du corps d'ambulance, au Nord-Ouest.\n\nPoundmaker est probablement le plus dangereux des chefs Cris; il est sans contredit le plus habile. Ce n'est pas seulement un Indien cruel comme Gros Ours et Beardy, mais un homme d'une intelligence supérieure, comme on peut le lire sur sa figure. Voyant le buffle disparaître il s'est alarmé pour l'avenir de sa nation et toujours fait des demandes fort extravagantes qu'on ne pouvait pas ignorer ou ignorer quelqu'un.\n\nMécontent, depuis une couple d'années il n'a guère parlé à sa réserve.\n\nDeux fois il s'est mis à la culture et il semblait s'y être fait; car, dans les rapports on trouve souvent son nom à côté de demandes de bétail, de chariots de grains et surtout d'un moulin où, malgré les chefs qu'on lui avait promis, mais qu'il espérait n'avoir jamais trouvé.\n\nSa famille compte 164 personnes et possède 58 chevaux. Ils ont aussi nombre de maisons et de bateaux. On l'a d'abord redouté à Battleford; car en recrantant la nouvelle de l'affaire du lac au Canada, il a assailli Battleford.\n\nGros Ours est un homme d'une cinquantaine d'années, qui personnifie obstination et les défauts de sa race. La civilisation n'a pu le transformer complètement et depuis plusieurs années on le signale comme un chef aventurieux et incontournable, qu'on a eu toutes les peines du monde à fixer dans une réserve et qui est toujours à l'affût d'un coup de main possible ou de dépréciations à commettre.\n\nGros-Ours a une sorte de responsabilité dans les horizons qui viennent d'encanaler le Nord-Ouest et si nous le présentons à nos lecteurs, ce n'est certainement pas comme figure sympathique, mais précisément parce qu'il a joué un certain rôle dans les événements actuels en détruisant le premier la hache de guerre des Sauvages.\n\nPiapot.—Ce redoutable chef a probablement causé plus de trouble au département des affaires des Sauvages que tout autre Sauvage du Nord-Ouest et bien qu'il n'ait pas été le chef de guerre le plus violent, il a soulevé à plusieurs reprises le sentiment de la réserve.\n\nSa réserve, où il a amené sa bande en 1882, sans quoi elle serait morte de faim, est située dans le voisinage d'Indian Head, et c'est lui-même qui l'a choisie. Piapot est une cause de troubles depuis de longues années. Les tribus voisines le chassent au buffle dans le sud et pendant quelques années ils vagabondèrent autour du Fort Walsh, refusant absolument d'aller s'établir sur la réserve qu'on leur avait offerte. En 1882, on l'engagea à revenir s'établir sur une réserve choisie par lui, mais il revint presque aussitôt au Fort Walsh avec une forte partie de sa bande.\n\nPiapot, finalement, cédant aux menaces et aux privations, partit pour Indian Head, s'attarda 8 jours en route sans se décider, puis il finit par atteindre sa réserve, se soumit au gouvernement et reçut ce qu'il fallait pour nourrir les femmes et les enfants de sa famille.\n\nC'est avec le chef Piapot M. Dewdney, le lieutenant-gouverneur du Nord-Ouest, a eu une étrange difficulté au sujet d'une voiture à ressort qu'il avait promise à Piapot et qu'il négligea de lui donner, provoquant chez le Sauvage les expressions du plus profond dégoût.\n\nBeardy (le Barbu) n'est pas un Sauvage pur sang, mais un Métis qui depuis longtemps fait cause commune avec les Sauvages et est devenu le chef d'une bande de Sauvages Cris. Dans les dix dernières années, il eut souvent maille à partir avec la police à cheval et a toujours été l'allié de Gabriel Dumont.\n\nSa bande compte 162 hommes et sur ce nombre trente, tout au plus, sont des guerriers; ils sont tous païens.\n\nLa vignette que nous publions est la copie d'une photographie récente et très fidèle.\n\nFaisan Rouge est à la tête d'une bande de Cris qui compte environ 140 âmes. Sur ce nombre 69 hommes et femmes capables de travailler. La bande a occupé pendant quelque temps une réserve, au Sud-Est de Battleford et peut être encore de cette dernière peste. Alors ils étaient l'objet de beaucoup d'attention et recevaient des instruments, etc., pour cultiver la terre; mais ils semblent pourtant être payrés aujourd'hui. Le dernier rapport dit que ce sont des gens apatiques et qu'ils ont fait bien peu de progrès. Ils n'avaient dans leur réserve que vingt chevaux et quelques moutons.\n\nFaisan Rouge est un chef violent et a été assailli par leur instructeur, M. Georges Applegarth, et de le poursuivre dans sa fuite, avec son épouse, vers le sud. Le malheureux Payne, instructeur sur la réserve voisine, n'eut pas, comme lui, le bonheur d'échapper à la fureur des Peaux-Rouges. Les deux bandes formant en tout 830 indiens devraient se diriger vers le Nord-Ouest pour rejoindre Poundmaker dès le commencement des troubles.\n\nVrai Jaune. Ce jeune chef est à la tête d'une bande de Sauvages Cris qui, sous sa direction intelligente, se sont intéressés à la culture avec beaucoup de succès. Leur réserve dans la vallée du Qu'Appelle est excellente, mais les choix de terrain et d'établissement permettent de dire malheureusement imprévis à la culture. Ils furent forcés de le changer et d'abandonner les améliorations qu'ils y avaient faits. En dépit de ce désavantage, après un an d'occupation de leurs nouvelles terres ils avaient érigé des maisons appropriées pour chacune des 14 familles de la bande, labouré 40 acres de terre et mis 20 acres en culture.\n\nIls avaient acheté une moissonneuse, une faucée, un rateau à hévéal et trois charrettes propres à la culture.\nLE MONDE\nETABLIE EN 1867.\n\nNo. 1650 Rue Notre Dame, Montreal.\n\nJOURNAL POLITIQUE, COMMERCIAL, INDUSTRIEL, AGRICOLE,\nLITTERAIRE ET SCIENTIFIQUE,\n\nQUATRE EDITIONS PAR JOUR.\n\nDe tous les journaux français du Canada, Le Monde est aujourd'hui celui qui possède\n\nLA CIRCULATION LA PLUS CONSIDERABLE.\n\nC'est le journal par excellence. Il est complètement renseigné sur tous les événements du pays et de l'étranger. Il ne contient que des matières variées et d'un intérêt actuel.\n\nSes feuilletons, toujours d'une haute moralité et acquis à grands frais, lui viennent directement d'Europe, et offrent une lecture très émouvante. Il publie tous les jours les prix des marchés, les cotes de la Bourse, de la Chambre de Commerce, une liste complète des heures d'arrivée et de départ des chars et des bateaux à vapeur.\n\nLe Monde consacre une colonne aux questions d'étiquette et de \"Questions et Réponses.\"\n\nLe prix d'abonnement est tellement minime que le plus pauvre peut le recevoir. L'abonnement à la campagne édition quotidienne y compris le numéro littéraire du Samedi, de 8 pages, est de\n\n$3.00 p. an; $1.50 p. six mois; $1.00 p. quatre mois.\n\net l'Hebdomadaire, 8 grandes pages, $1.00.\n\nLa grande rapidité de nos presses, nous permettant de mettre sous presse à la dernière heure, Le Monde contient, par conséquent, les dernières nouvelles de la ville et de l'étranger.\n\nLe Monde entretient aussi des correspondants spéciaux, à Paris, à Londres, aux États-Unis, etc., etc.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001505.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 41, "total-input-tokens": 71924, "total-output-tokens": 66021, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6360, 1], [6360, 9886, 2], [9886, 18170, 3], [18170, 27627, 4], [27627, 32133, 5], [32133, 37523, 6], [37523, 43754, 7], [43754, 48429, 8], [48429, 56069, 9], [56069, 64253, 10], [64253, 64253, 11], [64253, 72770, 12], [72770, 81277, 13], [81277, 86430, 14], [86430, 92829, 15], [92829, 95729, 16], [95729, 103247, 17], [103247, 105171, 18], [105171, 108981, 19], [108981, 113634, 20], [113634, 117855, 21], [117855, 122972, 22], [122972, 123072, 23], [123072, 126084, 24], [126084, 133576, 25], [133576, 137256, 26], [137256, 145017, 27], [145017, 149549, 28], [149549, 158535, 29], [158535, 161808, 30], [161808, 169516, 31], [169516, 178254, 32], [178254, 185232, 33], [185232, 197458, 34], [197458, 202460, 35], [202460, 206613, 36], [206613, 212896, 37], [212896, 221099, 38], [221099, 227556, 39], [227556, 229024, 40], [229024, 229024, 41]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]