[{"id": "a4d5edd1b9f52ae5dc074bc431f3198da9e768fc", "text": "THE SOUDAN CAMPAIGN\nTHE\n\nSOUDAN CAMPAIGN\n\nBY\n\nMAJOR DE ST. HUBERT D'ENTRAGUES\n\nH. M. Reserve Forces\n\nPrice: One shilling and six pence.\n\n1886\n\nAll rights reserved.\nCONTENTS\n\nMuch of the information contained in this book has been taken from Official Papers and Reports, the leading newspapers, &c., &c., and other reliable sources.\n\nI. The Battle of Teb ........................................... 6\nII. \" \" Tamai .................................................. 15\nIII. Advance on Khartoum ...................................... 20\nIV. Battle of Abu Klea .......................................... 24\nV. \" \" Metamneh ............................................... 31\nVI. \" \" Kerbekan ................................................ 49\nVII. \" \" Hasheen .................................................. 55\nVIII. Lord Wolseley's despatch .................................. 69\n\nRiels Revolt:\n\nI. Riels Revolt .................................................. 84\nII. Supplies .......................................................... 85\nIII. North West Field Forces .................................... 86\nIV. Loyalty .......................................................... 94\nV. Sir F. Middletons despatch .................................. 96\nVI. Colonel Otters despatch ..................................... 104\nVII. Batoche ........................................................ 111\nVIII. Rebellion a Crime and sure to fail ....................... 131\nTHE SOUDAN CAMPAIGN\n\nI.\n\nThe heroic defence of Khartoum for 317 days by the illustrious General Gordon with a few men, against many thousand ferocious partisans of the Mahdi, is one of the most glorious exploits ever recorded. What he did is unequalled in modern History, and will make him famous for all time. He perished at the very moment when the British troops were within a stones throw of him. Gordons brave resistance like that of the heroic Denfert Rochereau in Belfort, shows how much, in war, sometimes depends on one man, and what can be done, with inferior numbers, by a resolute and capable chief.\n\nHe has added new honour and glory to the noble profession of arms, and his name like the famous hero Bayard, sans peur et sans reproche, will live forever in story and on the page of history.\n\nIt was to save this great soldier that the Empress Queen Victoria sent her troops to Egypt.\n\nThe orders for the expedition to Suakin in 1884 were received by General Stephenson on the 12th of February. By the 28th of February a force of 4500 men had actually disembarked at Trinkitat; the battle of El Teb was fought, and Tokar, the object of the expedition, was reached on the 1st of March. Three\ndays later the force returned, bringing back about 700 of the survivors of the garrison and inhabitants of Tokar. The battle of Tamai was fought on the 13th of March, and the expedition was concluded on the 28th. The military result of that expedition was that the power of Osman Digma was effectually crippled for a time by the two severe blows struck at him by the expedition, and to do more than this was not in the power of the general or the force intrusted with the expedition.\n\nTHE BATTLE OF TEB\n\nAccording to previous arrangements, the whole army bivouacked round Fort Baker. The 65th pushed across the lagoon as soon as they were landed from the Serapis. The troops bivouacked in the same order as that in which they were to advance, and were, therefore, ready for instant action should the enemy attempt a night attack. The column consisted, roughly, of 3000 infantry, 750 cavalry and mounted infantry, 115 men of the Naval Brigade, and about 200 artillery-men and engineers; 300 men were left at Fort Baker when the advance was made, and 150 at Trinkatat, under Colonel Ogilvie.\n\nThe force of the enemy was about 10,000 strong.\n\nThe orders were that the troops should advance in a hollow square. The Gordon Highlanders were to form the front face, and were to advance in company column at deploying distance. The Irish Fusiliers were to form the right face in column, with the Rifles inside them in open column. The 65th were to constitute the left face, with the Marines inside in the same formation as the Rifles. The Black Watch were to march in line in the rear. Thus the whole were to form a square of about two hundred and fifty yards.\nbroad by a hundred and fifty yards deep. In the centre, between the Marines and Rifles, the transport animals, with reserve gun and rifle ammunition, hospital necessaries, stretchers, &c., were to take their place. The six machine guns were to be stationed at the left of the Gordon Highlanders, and the eight seven-pounder guns belonging to the Fleet, which had been transferred to the camel battery in place of their own pieces, were to remain in the centre of the square, in reserve. The main body of the cavalry were to keep well in the rear of the square, and to abstain from action until ordered to pursue. Two squadrons of cavalry were to advance a mile in our front and on both flanks, extended as scouts, with orders not to engage the enemy, but to fall back on the infantry if attacked, sweeping round the flanks so as not to intervene between the infantry fire and the enemy. The infantry were directed to fire only in volleys by word of command, and the fire was to be held until the enemy were within three hundred yards. No other transport was taken save the mules, with the spare ammunition and medical appliances.\n\nMajor Harvey, in accordance with instructions from England, went out with a flag of truce. He approached very closely to the enemy's lines and then planted the flag well within their view, attaching to it a letter telling the enemy that we were going to advance, and that if they attacked us the responsibility rested with them. The flag appeared to puzzle the enemy much, and was apparently regarded as a charm which might exert an evil influence; at any rate, they kept up a brisk fire at it for some time.\n\nFires were kept up all night, and gave a wild and picturesque appearance to the encampment. There were long lines of men sleeping as they were to march in the morning, while many gathered round the fire and smoked their pipes, and discussed the coming fight. The men fully realised the rush with\nwhich their wild foes were likely to attack them, and thoroughly understood the necessity for meeting it with steadiness. Towards morning the rain fell heavily. Every one was glad when the réveille sounded, the fires were piled higher again; and the men tried as best they could to dry themselves. Breakfast was eaten, and at eight o'clock the Force stood in their ranks in the order above mentioned — silent and ready to move forward. The first move was a short one, as they only advanced a few hundred yards from the spot where they had bivouacked, into fresh ground free from litter and fires. Here they halted. A brief inspection showed that all was in order, distances were taken up more accurately, and the advance towards Teb began in earnest.\n\nScarcely had the column begun to advance when the enemy's scouts could be seen falling back, just as they had done when Baker Pacha's Force marched out from the same halting-place against them. With a good glass the enemy's strong position could be seen near the wells. A great many banners floated in the light air, a dark swarm of men could be made out, and, judging by the ground over which they were scattered there was no doubt that the force was a large one as its front extended over a mile. At various points along the line guns in position could be seen. To avoid their direct fire and attack in mass, the order was given for the column to change its direction, and it accordingly swerved off to the right of the direct route to the wells originally followed by Baker. Frequent halts were made, and at each halt the men fell into their fighting position, and the four sides of the square faced outwards, so as to accustom the men to the work they would have to do, and enable them to prepare to resist an attack quickly, and without the least confusion.\n\nSlowly and cautiously the British Army advanced, with the cavalry in a dark body on the left rear, hid-\ning their time. The line of march was across their front, nothing less than 400 yards from their strong position. Suddenly the silence was broken by a hot fire of musketry, which spurted out from bush and earthworks, and the Krupp guns were also brought to play upon the British.\n\nThe brave General Baker was badly wounded, but was soon again in the saddle, ready for any service.\n\nAt a little before noon our guns got the mastery over those of the enemy. His fire slackened and gradually died out. The constant movement of the black heads among the bushes showed that the position was strongly held. A consultation was held between Generals Graham and Buller, and the order was given for a move. The men sprang to their feet cheering, the bag-pipes struck up again. It was not a charge, but a steady, solid movement in the formation which had all along been observed. It looked, however, all the more formidable, for enthusiasm and discipline were equally marked, as the whole of the troops cheered while the square swept down towards the enemy.\n\nA bloody battle now commenced. The Arabs ceased firing, put aside their rifles and grasped their spears. They rushed out from their walls and flung themselves straight on the British bayonets.\n\nThey charged almost simultaneously on two sides of the square, and as from the change of direction the flank of the square was now its front, the brunt of the onset fell on the Black Watch, the 65th, and the Naval Brigade. The enemy did not come on in masses, but in groups of thirties and twenties, sometimes of threes and twos, sometimes alone. They dashed forward against our ranks with poised spear, but not a man reached the line of bayonets, for one and all were swept away before the terrible fire of musketry which broke out as they rushed forward. For a moment, on the other side of the square, the matter was in doubt. So hotly did the Arabs press for-\nward that the troops paused in their steady advance. It became a hand-to-hand fight, the soldiers meeting the Arab spear with cold steel, their favourite weapon, and beating them at it. There was not much shouting, and only a short, sharp exclamation, a brief shout, or an oath as the soldiers engaged with their foes. At this critical moment, for the enemy rushed up thickly, the Gardner guns opened fire, and their leaden hail soon decided matters.\n\nAt this instant Admiral Hewett, who, with Mr. Levison, his private secretary, was present as a spectator, joined the Naval Brigade and led them on over the dead bodies of the Arabs, lying thickly strewn in their front, into the work, which proved to be but a bank of sand. The gallant Colonel Burnaby had his horse shot under him, and a bullet passed through his arm. Still with the double-barrelled fowling-piece he carried he knocked over the Arabs who assailed him. But they pressed on; and he was only saved from being speared by one of the Gordon Highlanders bayonetting an Arab who attacked him when both barrels of his gun were empty.\n\nSeveral fierce personal encounters took place as the troops rushed into the entrenchments. The first feeling of nervousness had passed away, their blood was up now, and the enthusiasm of battle was on them. More and more shrill the pipes skirled out, and the men were eager to close with the foe. As single Arabs rushed down the brave soldiers stepped singly forward from the ranks and met, the bayonet to spear, in almost every instance vanquishing them by the bayonet alone, without firing.\n\nThe Cavalry were very ably handled and made some dashing charges. The Cavalry moved round behind, and advanced towards a large mass of the enemy, who made off in the distance. They were manifestly quickening their pace. Faster and faster they went; their sabres flashing in the sunlight, and\nthey dashed into the mass of the enemy. Right through them they cut their way, and then turned sharp back again. The Arabs did not fly, but stood and fought stubbornly and gallantly, displaying as much courage as against the Infantry. Again and again they were dispersed, but each time they gathered together as the horsemen came on. Our infantry were so confident that they at last abandoned the square formation and attacked the enemy in line.\n\nBy 2 o'clock after nearly three hours incessant fighting, the British Army passed over the entire position occupied by the enemy.\n\nOur forces entered it at the rear and emerged at the front. Every foot was contested by the enemy, who displayed a courage, a tenacity and a contempt for death such as only steady troops could have withstood. There is no doubt that had General Graham's Force consisted of Egyptian instead of British troops, the former disasters would have been repeated here. The close of the fight was announced by a loud cheer from the Gordon Highlanders as they passed out at the front of the enemy's position, and by a triumphant peal from the bagpipes.\n\nThe loss in killed on the British side was four officers, twenty-two privates, and two Marines; in wounded, seventeen officers and one hundred and forty-two soldiers and Marines. Officers killed: Lieutenant Freemann, 19th Hussars; Major Slade, 10th Hussars; Lieutenant Probyn, 9th Bengal Cavalry; Quartermaster Wilkins, 3d Battalion King's Royal Rifles.\n\nOfficers Wounded — General Baker Pacha, severely; Lieutenant Colonel Burnaby, severely; Lieutenant Colonel Barrow, 19th Hussars, dangerously; Lieutenant Boyd, R.N., dangerously; Brevet Major Erabazon, 10th Hussars, slightly; Captain Kellie, Royal Artillery, slightly; Veterinary Surgeon Beech, slightly; Quartermaster Watkins, Irish Fusiliers,\nslightly; Surgeon Turner, slightly; Major Dalgety, York and Lancaster Regiment, severely; Captain Littledale, York and Lancaster Regiment, severely; Lieutenants Gordon (Wolrige Gordon) and Macleod, Royal Highlanders, slightly; Captain Green, Royal Engineers, and Captain Wauchope, Royal Highlanders, Staff, slightly; Captain and Adjutant Poé, and Major Allen, Royal Marines, slightly; Staff Surgeon Martin, R.N., slightly. Our loss would have been far heavier had the entrenchments been attacked in front.\n\nCaptain Wilson, of the Hecla, gallantly rescued a Marine from the attack of three rebels. While striking at them his sword broke off short at the hilt. Captain Wilson then dismounted, and killed all three of the Marine's assailants.\n\nAll the guns defending the enemy's works were captured, together with a quantity of rifles, ammunition, and cattle. The enemy had two thousand killed and many wounded.\n\nThe battle of Teb bore out the anticipations which were formed of what would happen when the brave fanatics of Osman Digna met a steady and disciplined foe. The former fought with supreme valour, but their efforts were but as waves upon the rocks, as in parties of twenties and thirties they dashed against the solid line of the British infantry. The dispositions taken by General Graham were excellent. The oblong square, with its long faces front and rear, was the best formation which could have been adopted against the expected rush of the Arab spearmen. That rush never came. The garrison of Tokar, which had swelled the ranks of the enemy, had no doubt pointed out to them the immense value of entrenchments, where they could remain under shelter until the English were close at hand, and whence they could use their newly-acquired rifles and guns until the moment came to dash forward with the spear.\nUndoubtedly, the advice was sound, and might, had it been somewhat differently carried out, have given them a chance of victory. Had the mass of Arabs lain perdu behind their sand banks, maintaining their fire of rifle, Krupp cannon, and Gatlings until the last moment, and then, when the English line was within a few paces, leaped to their feet with a terrible yell, and darted, ten thousand strong, upon us, the result might have been different. At least, such a plan would have given them a possibility of success, for their sudden charge might well have shaken the steadiest troops in the world. As it was carried out, the new tactics were fatal to them. Their main body was shouldered away from their camp by our march round their left, and took no part in the fight, save in resisting the charges of our cavalry. But fifteen hundred men remained in the lines round the wells, and these attempted no simultaneous rush such as proved fatal to the two forces they had before encountered and overpowered on the same ground. They fought in little groups and parties, and attacks by such bodies as these on the solid phalanx of British troops were as spray against the bows of a great steamer. The enemy met them piecemeal, and with each success the self-confidence of the troops rose. Even the halt while the artillery silenced the enemy's guns had a good effect, for it tired the men's patience, and made them burn with a desire to get at their foes. The hand-to-hand contest, which they had before hoped to avert by their rifle fire, was now longed for, and when they rose and advanced, cheering wildly, the battle was virtually won, and even had the enemy charged in a mass, the English might have been trusted to repel them with empty rifles. The heavy list of casualties among the officiers in comparison to the total loss may be accounted for by the fact that in an attack the officiers lead on their men, and would therefore be the first to come in contact with\nthe enemy's spearmen. The courage with which the Arabs met the charges of the cavalry is even more remarkable than that which they displayed in the defence of their works, for it is rare indeed that undisciplined troops will withstand cavalry. Their obstinacy cost us some valuable lives, among them, notably, that of Colonel Slade, of the 10th Hussars. The gunners from Tokar appear to have worked their pieces steadily and well, and to have made fairly good practice.\n\nThe victory of Teb is one which we can regard with immense satisfaction as eminently creditable alike to the troops and to their General. The first advance in hollow square was the best formation which could be adopted against attack. The turning movement by which the column avoided the loss that a direct assault upon the enemy's position would have involved was well conceived and executed, and contributed largely to the success of the day, as the great bulk of the rebel Arab forces at once fell back. Lastly, the abandonment of the square formation for an advance in line, when the men had gained confidence in themselves, and were in full fighting humour, and when there was no longer a risk of attack, was a measure which was perfectly justified both by the circumstances and the results. All arms appear to have behaved alike with steadiness and gallantry. The execution of the flank movement under a heavy musketry and artillery fire without returning a shot was one which would have tried the calmness of veteran soldiers, and the enthusiasm with which the final assault was made and the men met the enemy, bayonet to spear, sometimes in single combat, speaks highly for the spirit of the troops. The fight at Teb is worthy of a place among the noteworthy deeds of arms of British soldiers.\n\nHer Majesty received the gratifying intelligence of the victory of Sir G. Graham over the rebel forces\nnear Trinkatat, and at once telegraphed her congratulations to Sir G. Graham through the General Commanding her forces in Egypt, as well as the expression of her sorrow at the loss of brave officers and men, and her anxious inquiries after the wounded.\n\nII.\n\nTHE BATTLE OF TAMAI\n\nThe British Army advanced from the Zariba at 8 o'clock in the morning in échelon of brigades. The 2d Brigade was in advance. The front line was formed by a half-battalion of the Black Watch (Royal Highlanders), with the other half-battalion of each regiment in open column on the respective outer flanks, ready to wheel up into line. In rear, in a second line, close to the flanks of the first line, were the Royal Marines, in line. A nine-pounder battery of four guns was in rear of the detachment of the York and Lancaster Regiment, having the half-battalion of that regiment in column on its right flank. The Gatling battery was in the same position on the left flank of the front line, so that on the word, \"Halt\", by the outward wheel of the half-battalion on the flank, square would be instantly formed.\n\nThe 1st Brigade was in the same formation, with a half-battalion of the Gordon Highlanders and a half-battalion of the Royal Irish Fusiliers forming the front line, the remaining half-battalions of these regiments being in column in rear of their flanks. The camel battery was in rear of the centre of the front line.\n\nThe force advanced in échelon of brigades by fours from the right of companies. The morning was bright and clear, but with no breeze to carry away the smoke of the men's fire.\nOwing to there being no breeze heavy clouds of smoke hung over the men to their immediate front, entirely obscuring their view of what was going on in front of them. As the first companies reached the edge of the incline the rebels suddenly appeared in great numbers, leaping from behind the rocks, and made a wild charge upon the square.\n\nOur men could not see their enemy for the smoke, and so a species of momentary panic arose. The rebels were quick to profit by the confusion in our ranks. They crawled on their hands and knees beneath the bayonets and beneath the muzzles of the Gardners and Gatlings, and thus got into the square, when they commenced stabbing and slashing our men, doing terrible execution among them.\n\nThe York and Lancaster men fell back behind the Naval Brigade, thus cutting the latter off from their limbers and ammunition. That the Naval Brigade stuck to their guns to the last is sufficiently testified by the fact that they lost three officers and 11 men before they left their guns, and then only retired when they had no more ammunition.\n\nWhen first the infantry were engaged the cavalry withdrew to the rear, where they were hidden from the enemy by a fall in the ground. When the panic occurred the cavalry advanced at a trot, meaning to afford aid to the infantry by a charge. This, happily, was unnecessary. The enemy, seeing a large body of cavalry bearing down upon them, hesitated, and this gave time to the soldiers to listen to their officers and reform.\n\nThey did not do so a moment too soon, for the rebels, elated by their first success, soon began to come on again, and the men had all their work to do to repulse them by a heavy fire, and so prevent a repetition of the reverse. Here, again, the cavalry did good service, some of the squadrons dismounting and firing volleys at the rebels, who were collecting in\nthe rear and on the flanks, and advancing, part towards the zariba, and others towards the rear of the flanks of the 2d Brigade.\n\nWhen once the men had halted and turned, they quickly reformed and advanced slowly and in good order towards the abandoned Gatlings. The York and Lancaster Regiment suffered heavily, losing two officers and over 20 men; while the Black Watch (Royal Highlanders) lost one officer and nearly 60 men. The force generally suffered severely.\n\nMeanwhile, the 1st Brigade, stationed some quarter of a mile in the rear, and to the right of the 2d, had been hotly engaged, the attack being chiefly made by the rebels on their right flank. The men behaved admirably, and their fire was so well directed that no rebel could live within 60 yards of the line. The mounted battery was also brought into play, making splendid practice among a group of the enemy collected on the opposite side of the valley and along a ridge on the nearer side.\n\nThe 1st Brigade advanced slowly in excellent order, the rebels falling back before it and leaving numbers lying on the ground. They passed the spot where the guns were left, and advanced to the edge of the ridge commanding the entire breadth of the valley, where they poured a murderous fire into the rebels, who were soon in hot retreat, tumbling down the valley side, scurrying across the plain, and hiding here and there behind the bushes and rocks. All chance of success had departed for the enemy, who began to understand that this was the case. Now and then, with wonderful courage, a small group of two or three devoted fanatics charged up the valley side, only to fall after proceeding a few yards, their bodies in some instances rolling and bounding downwards from rock to rock.\n\nThe 2d Brigade had also advanced by this time to the guns, of which the Naval Brigade took possession.\nwith a cheer. One Gatling, however, had been run down into the valley by the rebels, and this was not got up till about half-an-hour later.\n\nAfter a short halt, but not long enough to give the enemy time to rally, the 1st Brigade again advanced, taking with them this time the nine-pounder battery. The brigade descended slowly into the valley, and then took the opposite heights at the charge. Clearing the way before them with a steady fire, they then descended the next hill into a small valley, where Osman Digma's camp and the village of Tamasi lay. The rebels made here an attempt to hold their own, but by doing so only lost a few more brave warriors, and the village was taken.\n\nIn the villages were found bags of money, Korans, talismans, and rebel property of various kinds, while on the outside of each hut was stored a considerable quantity of grain. The rebels had evidently not contemplated the possibility of our getting so far, and had been forced to leave everything in great disorder.\n\nHaving burned the villages and all they contained, the 1st Brigade recrossed the valley and joined the 2d Brigade, which had meanwhile occupied the wells.\n\nFrom Tamasi the troops brought back Osman Digma's standard and Tewfik Bey's standard, which was captured when his force was annihilated.\n\nThe expedition was entirely successful. The rebels were shown that they are not able to do entirely as they choose when England wills otherwise. Their losses at El Teb and Tamasi may roughly be estimated at nearly 6000 men.\n\nOur losses were 70 killed and over 100 wounded. The naval Brigade, 42d, 65th, suffered most.\n\nLieutenants Almack, Houston-Stewart, and Montresor, and ten seamen killed; two dangerously wounded.\n\nGeneral Graham encamped at the wells, in Osman's camp, 18 miles off.\nSir Gerald Graham and his gallant troops fought and won a battle which is worthy of a place among the recorded honours of the British Army. Osman Digma is not a great potentate wielding the organized forces of a vast Empire, yet many a field on the issue of which Imperial fortunes have been staked has been contested with less desperate valour and less heroic contempt of death than were shown by the enemy who poured out their blood like water in the vain attempt to check and hurl back the advance of General Graham. If our soldiers were insignificant in number compared with those assembled on the battle-fields of modern Europe, their quality was none the less tested and, despite momentary weakness in one portion of the force, proved in an ordeal different from any familiar in civilized warfare, and not inferior to any in its effect on the spirit even of the bravest, the steadiest, and the most enduring. A desultory fire was opened on our lines in the early morning, and at half-past seven o'clock General Graham sent forward the cavalry to clear the way for the advance which immediately followed. Before noon the English commander was able to telegraph to the authorities at the War Office from Osman Digma's camp announcing his success \"after hard fighting since eight o'clock.\"\n\nThe struggle was much more serious and obstinate than the battle of El Teb. The enemy did not wait to be attacked in their intrenchments or on the rocky ridges, but apparently poured down in immense numbers and with impetuous ardour on the advancing squares of General Graham's force. The significance of the desperate attacks made upon the British squares, in spite of the severe lessons taught in the previous skirmishing, will be readily understood. After their experience of the effects of the weapons of precision handled by our troops and of the shell-fire of the night before, the insurgents were nevertheless\ndaring and determined enough to throw themselves with the courage of despair upon the squares, sometimes coming close enough in the teeth of the withering blast from the rifles of our men to inflict deadly wounds before they fell. Under cover of the smoke they even succeeded in breaking into the foremost square, crawling on their hands and knees under the muzzles of the rifles and the Gatling and Gardner guns, and throwing our men into confusion by their murderous spear thrusts. The York and Lancaster Regiment was driven back on the Naval Brigade, and the enemy followed, until the cavalry checked the pursuit. The second square had done its work admirably, and the advance began again. The enemy never recovered their advantage. Our losses, if we have regard to the proportions of the force, were indisputably heavy. The fighting qualities shown by Osman Digma's followers have not often been surpassed.\n\nIt is impossible not to reflect that if the Arabs of the Eastern Soudan were among the valiant native races we have brought under our rule in India, their subjection would be followed by the employment of their fighting qualities in the cause of peace and order. Perhaps the time may come when this undisciplined valour and this uncalculating devotion will not be allowed to run all to waste.\n\nIII.\n\nTHE ADVANCE ON KHARTOUM\n\nThe Nile expedition started from Cairo in September, 1884, and was able to advance from Korti on the 10th of January, 1885.\n\nThe Nile expedition has been marked by incidents which have not had any complete precedent on any former occasion. The ascent of the Nile for a distance of 1,500 miles from what was practically the base of\nthe expedition at Alexandria by means which had to be improvised for the occasion, and means which depended altogether on the troops themselves for their efficiency, is a precedent altogether new in military annals. The conception and execution of that operation will form a new chapter in military history. Great credit is due to Lord Wolseley for the courage and self-reliance with which he formed the plan of that operation, and for the manner in which he staked his great military reputation on the success of measures which were hitherto untried, and of which we had no knowledge. And not less credit is due to the soldiers and sailors who were engaged in that expedition for the manner in which they undertook new and untried duties, and for the perseverance and resolution with which they grappled and encountered all the difficulties and hardships entailed upon them.\n\nThe duty which they were sent to perform was of singular difficulty and great danger, and surrounded by circumstances strange to the experience of the British Army, and calling forth some of the greatest qualities which that Army could display. The generalship of Lord Wolseley in that campaign along the Nile has won the tribute of many high authorities among the most military nations of Europe, and while the work was going on it was watched with mingled solicitude and admiration by spectators from every country; and everybody must have felt that Lord Wolseley displayed singular and unusual qualities in fighting against the strange and unaccustomed difficulties with which he had to contend, and those qualities were more than emulated and seconded by the officers and men under his command. He had to send an expedition, mainly along a river torn with cataracts, among deserts in which neither food nor water was to be had, and in the face of enemies fighting in their own country, skilled in their\nown warfare, and animated by that tremendous mixture of religions fanaticism and military spirit which the religion of Islam seems alone to have the secret of conferring upon its votaries. This tremendous task he performed in an incredibly short space of time, and considering what he had to go through, with singularly little loss of life, and the men, whether they were forcing their boats up cataracts or whether they were engaged in the unpleasant duty of conducting camel convoys across the desert, or whether they were fighting with Arabs whose like they had never met before, showed throughout the peculiar qualities for which British soldiers have always been known. It was a campaign which must have been very trying to the spirit of any army, but it made a special appeal to what may be called specially British qualities. There are armies which show as much fire and impulse in the middle of battle, in the inspiriting charge, in a pitched conflict, when foes are ranged face to face in the field, but there is no army which shows in an equal degree the qualities of patient endurance, of steady discipline, and of determination through long and exhausting and anxious service, to do all, to bear all, to dare all, and to fulfil the extreme demands of military fidelity and duty. The hardships were faced in a manner deserving the greatest praise. Courage in the presence of danger is one of the incidents of the English character.\n\nGenerals and soldiers alike faced and conquered all the difficulties and all the enemies that were opposed to them. For more than 500 miles of river, cataract, and desert, the whole system of transport for men, material, supplies, and stores, including medical stores — which were never better supplied in any expedition which has left this country — had to be organized, Whaleboats had to be forced up 190 miles of most turbulent and dangerous water; camels had to be taken across long stretches of waterless\ndesert by soldiers who knew nothing of the management of boats or of the camels which they had to ride. Yet, all this was successfully done with hardly any loss of life, and with a willing cheeriness which insured the success of those most difficult operations. Never in any expedition which ever left this country was everything that tends to the efficiency and health of the troops more completely cared for than it was in this Nile Expedition. When the force was directed to withdraw down the Nile the withdrawal was effected at the hottest period of the year, when the river was lowest and in the most difficult condition to navigate, with the loss of only a single life. Not only that, but 14,000 refugees from Dongola were sent down in safety and in comfort. A study of the map serves to bring out clearly the strategic features which governed the military situation. The vast northerly bend of the Nile, the cataracts which impede navigation, the caravan routes fixed by the positions of the wells, and the points at which these routes strike the river combined to impose hard-and-fast limitations upon military movements. With so many limitations and so small a choice of practicable routes, strategy was reduced to its simplest terms. The quadrilateral formed by Korti, Abu Hamad, Berber, and Metammeh formed the strategic theatre of operations. Korti was the advanced base of the expedition, the main depot of the enormous quantity of stores which were forwarded up the Nile with so much labour, the centre to which the resources of the surrounding country were drawn. Abu Hamad is important as the first point at which rapid communication with the advancing expedition could be established and a line of supply worked from Korosko. Berber had a strategic importance of its own, not only as being within 260 miles of an English force and English gunboats, but as a town of some size, the occupation of which might be expected to have political and military signifi-\ncance. Metammeh closes the desert route to Korti, guards the line of communications, and could become an etappen station and an advanced depot of stores.\n\nIV.\n\nBATTLE OF ABU KLEA\n\nSir Herbert Stewart's camel brigade left Korti on Thursday, the 7th of January, and arrived at Gadkul on the 12th.\n\nGeneral Stewart's force left Gadkul after two days' rest from the march across the Desert, on the 14th, for Metemneh, a distance of about ninety-five miles across Bayuda Desert. The column was accompanied by Colonels Wilson and Burnaby, and comprised: The Guards' Marines Camel Corps, 380; the Heavy Camel Corps, 360; Mounted Infantry, 400; a Squadron of the 19th Hussars, 90; a half-battalion Sussex Regiment, 175; Royal Artillery Camel Battery, three guns; Royal Engineers, 30; Naval Brigade, 50, with one Gardner machine gun, making a total effective force of 1475 men, with three guns.\n\nGeneral Stewart arrived near the Abu Klea Wells on the afternoon of the 16th. The cavalry in advance of the force reported the enemy in strength, occupying a position in front of the wells. Wisely waiting to rest his command and to allow time for the serious work before him, the General bivouacked for the night, roughly protecting his position with earth and brushwood. As before Tamai, the Arabs did not attack, but contented themselves with keeping up a \"harmless fire\" as soon as darkness came on, at the same time moving a force to their left and throwing up works threatening the British right flank. On the 17th General Stewart endeavoured to draw his enemy on to attack without success. Leaving his baggage and camels behind in the hastily-formed zeriba guar-\nded by a detachment drawn from the Sussex Regiment and the Mounted Infantry, he then advanced to the attack with his remaining force formed in square. The Mounted Infantry formed the left front angle, the Guards the right. Guards and the Sussex Regiment formed the right face; the Heavy Camel Regiment and Mounted Infantry the left. The Heavy Camel Regiment and the bluejackets closed the rear face. The artillery and the Gardner gun were in the centre. Following Sir G. Graham's tactics at El Teb, Sir H. Stewart passed round the left flank of the enemy's position, thus forcing the Arabs to attack or be enfiladed. Thus driven to bay, the enemy wheeled to the left and, advancing in two grand divisions, after some well-conceived manoeuvres, delivered a single headlong charge. As at Tamai, the square was partially broken at its left rear — the angle the well known weak point of a square — where the Heavy Camel Regiment stood; but the same admirable steadiness and rallying power were evinced by the British soldier. A hand to hand fight was now carried on, in which the gallant Colonel Burnaby unfortunately lost his life. Meanwhile, the deadly fire of the breechloader was beginning to tell round the other faces of the square; the Arabs were falling by hundreds and were finally driven back on all sides. The cavalry at once pushed on for the wells, which were occupied at 5 p.m. Thus the force was under arms the whole day, and after marching followed by heavy fighting required rest and water. A strong post was established at the wells, and General Stewart on the 18th pushed forward to Metammeh.\n\nA loss of nine officers and 65 non-commissioned officers and men killed and nine officers and 85 wounded is a heavy proportion out of a total fighting strength which was only about 1,500. The loss of two naval officers out of the small number present is remarkable, and it may be that, as at Tamai, the ma-\nchine gun in their charge was a special object of attack, and that, like their devoted comrades, they died beside it.\n\nThe enemy's strength was estimated at 10,000. If the victory has been dearly bought at the price of so many gallant lives, it is most satisfactory to know that it was complete and crushing. It must not be forgotten that General Stewart's men were called upon to fight after a trying desert march of 53 miles, and a night broken by the enemy's fire. To some of them, little accustomed to camel riding, the ordeal must have been severe indeed while all had to undergo for two days the privation involved in a limited water ration under circumstances where the craving for water becomes almost intolerable. General Stewart and his 1,500 have nobly earned the praise which Lord Wolseley bestows. They have shown that a comparatively small English force can, if necessary, go to Khartoum, and they inflicted a blow which the Mahdi's followers could hardly fail to understand.\n\nThe completeness of General Stewart's victory is shown by the fact that he was able to leave his wounded at the Abu Klea wells and to advance to Metamneh on Sunday. The whole available Arab force was doubtless concentrated at Abu Klea, and news of the heavy defeat suffered on Saturday spread through the surrounding country.\n\nStewart's column, which until late in the morning of the 16th had advanced in somewhat straggling order, received warning from traces of the recent presence of the enemy's scouts that an engagement was probable. Halts were called and a regulated and compact advance was adopted. It seems to have been by this time expected that the Abu Klea wells would be held by the Arabs; but that so large a force had been massed there was probably unforeseen. The British column had bivouacked at the southern end of a broad plain, with distant hills on either side and\na rough, broken ridge in front, over which the route lay. At noon information was sent back from the Hussar scouts, who were at some distance in front of the column, that the wells of Abu Klea were held by the enemy. General Stewart at once formed up his command for attack in a square formation, with all the baggage and water camels in the centre. The square was halted about 400 yards from the foot of the ridge. The latter commanded a wide view, a valley rapidly broadening out into the fertile country bordering the Nile. The enemy's force could be made out among the clusters of mimosa at the narrow end of the valley, it was then too late to do more than make careful dispositions for the night. Small trees and brushwood were felled and formed into a rough zariba round the baggage. A little in advance of the zariba a stone parapet about 150 yards long was thrown up. The position chosen was about four miles from the enemy's camp, and General Stewart's proceedings were watched by detached parties of Arabs from the hills on his left front. A few rounds from the three 7-pounders were fired at about 6 p.m. The night must have been a trying one to the whole force. Long-range fire was kept up by the enemy, and, though casualties were slight, bullets were constantly singing overhead and occasionally dropping into the square. A general attack at daybreak was expected, and the men were three times called to arms. Morning showed that some stone parapets had been constructed on high ground to the right and rear of the position, from which a desultory fire was opened, but soon checked by the Mounted Infantry. At 8 a.m. the enemy showed in force on the right front, moving over the ridges in good order in two long lines. A partial attack at the same time threatened the left front. The fire from the square began to grow hot. Still, however the Arabs appear to have declined to deliver a definite attack, and to have endeavoured\nto surround the British force, doubtless hoping to induce a partial advance, which would lay bare a portion of Stewart's position, and enable them to close. So far, the enemy's tactics seem to have resembled those of the Zulus at Isandlana. At 10 a.m. General Stewart determined to bring on attack, and, leaving nearly all his camels and baggage under a guard only 150 strong, he formed his whole force, with the exception of the Hussars and a few of the Mounted Infantry, into a single square, and advanced on foot towards the wells. Water and ammunition were carried by camels posted in the centre.\n\nA square formation is always unsuited for movement, and the advance was slow, frequent halts being necessary to preserve the proper distances. The positions of the various regiments in the square were described. It will be noticed that each face, except the rear, was composed of a composite force, the object being, probably, to provide against a break of corps at the angles. Thus, the Guards held the right forward angle and the Mounted Infantry the left. The Heavy Camel Regiment held the rear face and the left rear angle. The Sussex Regiment closed the gap in the right face between the Guards and the Heavy Camel Regiment. Thus, there was a break of corps only at the right rear angle. Some loss was experienced from rifle fire during the advance, which seems to have continued for about two miles and to have been directed with a view of turning the left flank of the enemy's position. As at El-Teb, this manoeuvre succeeded in forcing on an attack. The Arab idea of field fortification appears to be, not to build enclosed works, but, like the Egyptians at Tel-el-Kebir, to draw a line across their front and expect it to be directly attacked. Thus turned, it became necessary for the Arabs to charge General Stewart's square, or their position would have been enfiladed and taken in reverse. At 11 o'clock, according to one account, the square had\nbrought up its left face opposite to the Arab position, about a quarter of a mile distant, when the charge was delivered with precisely the same headlong speed and reckless devotion which were shown at Tamai and with the same result. It is easy to make reflections on this second breaking of a British square. Soldiers know, however, that a rush of masses of men utterly regardless of death and fired with the fanatical fury their religion supplies is infinitely more dangerous than a charge of the finest cavalry. The best cavalry in Europe would not have reached General Stewart's square. The horseman has two minds to control, and one at least is not inspired with a determination to close at all cost. The density of the cavalry attack is far inferior. In the space occupied by one trooper struggling with his half-maddened animal unable at best to do more than keep a straight course, there may be 10 or 12 Arabs lithe and active, all fired with the determination to close, able to dodge, cut and thrust, to creep along the ground and strike at their opponents' legs. And the soldier in his place in the square, instead of having one man and horse to deal with individually, finds himself faced by five or six savages dashing at him, close packed one behind the other, two perhaps able to slash or thrust at the same time. The analogy of the British squares at Waterloo fails utterly. These squares would have been broken with ease and annihilated by the men who charged General Stewart's force on Saturday. At Tamai the square was broken for obvious reasons. The right forward angle had been brought dangerously near to a nullah crowded with the enemy, and at this specially unfortunate moment the front face was ordered to charge. It is stated that the Arabs followed close on the retiring skirmishers, which seems to indicate that the formation was not quite complete at the left rear angle. In any case, there was surely something anomalous in placing heavy cavalry in an\nInfantry square, a formation altogether contrary to the spirit of their training and traditions. The behaviour of their force in the wild mêlée which ensued and the steadiness which enabled the square to be reformed under circumstances which rendered disaster possible were worthy of the finest traditions of the British Army. The Gardner gun seems to have jammed at the critical moment, as machine guns too often do, and the Naval Brigade who guarded it suffered severely. No real pursuit took place, for the Hussars seem to have come up too late to deal an effective blow. Moreover, they were only 90 strong and, in view of the experiences of El Teb, where the light cavalry sword proved a very ineffective weapon, it is doubtful if they could have inflicted any serious loss. They were able, however, to push forward and occupy the wells without resistance, a fact which goes far to prove the demoralization of the enemy.\n\nThe British loss in proportion to the number of men engaged was almost exactly double that at Tamai. The proportion of killed and wounded, 74 to 94, at Abu Klea contrasts strongly with that at Tel-el-Kebir, which was only 54 to 342. On the other hand, the estimated loss of the Arabs, 800 killed at Abu Klea out of a nominal 10,000, falls far below the 4,000 out of 12,000 recorded of Tamai. Apparently Osman Digma's men were able to stand greater punishment.\n\nThe following is the list of the casualties on the 17th:\n\nOfficers Killed. — Colonel Burnaby, Royal Horse Guards; Major Carmichael, 5th Lancers; Major Atherton, 5th Dragoon Guards; Major Gough, Royal Dragoons; Captain Darley, 4th Dragoon Guards; Lieutenant Law, 4th Dragoon Guards; Lieutenant Wolfe, Scots Greys; Lieutenants Pigott and Delisle, Naval Brigade.\n\nSeverely Wounded. — Lord St. Vincent, Major Dickson, Royals; Lieutenant Lyall and Guthrie, Artillery; Surgeon Magill.\nSlightly Wounded.—Lord Airlie, Lieutenant Beech, Life Guards; Costello, 5th Lancers, contusion; Major Gough, Mounted Infantry.\n\nAmong the list of the slain was Colonel Burnaby, one of the most dashing and brilliant officers in the British Army. When the square was broken the heroic giant Burnaby and other officers performed prodigies of valour. General Stewart carried out a difficult and dangerous task with admirable skill, and all honour is due to him and to the brave troops led to victory.\n\nV.\n\nBATTLE OF METAMMEH\n\nGeneral Stewart's force gained a brilliant victory at Metammeh on the 19th. The enemy were 7,000 strong, with cavalry. Many of them were armed with rifles. The British loss was 20 killed and 60 wounded. The enemy lost 2300 killed and wounded. Sir H. Stewart's force, much worn with hard fighting, did not leave Abu Klea till about 4 p.m. on the 18th. Acting on orders from Lord Wolseley to establish himself on the Nile above Metammeh, the General diverged slightly to the right of the caravan track after passing the wells of Shebacat. After marching nearly all night, the force halted for breakfast at 7 a.m. on the 19th, forming \"strong zariba\" about five miles south of Metammeh and three or four miles from the Nile. The enemy appeared in force on the ridge in front, as if to bar the advance to the river.\n\nThe troops were promptly dismounted, and the first care of the General was to form a zariba. The camels were unloaded and a fortification was thrown up, composed principally of the saddles and baggage. The hospital was placed in the centre, protected by Gardner and Gatling guns. All the while the men\nwere constructing the zariba, a hot fire was kept up by the enemy's sharpshooters, who were concealed behind bushes and high grass on all sides.\n\nTheir fire was, on the whole, well directed, and had most disastrous effect, General Stewart himself being severely wounded in the thigh. Altogether 12 were killed and 40 wounded here. Mr. Cameron, the correspondent of the Standard, and Mr. St. Leger Herbert, representing the Morning Post, were also shot dead.\n\nWhen the Zariba was nearly completed, the force was formed into a square and the advance was sounded. The front of the square was composed of the Naval Brigade and Grenadiers, the right flank of the Coldstreams, Scots Guards, and part of the Heavy Corps, and the left flank of the Mounted Infantry; while the Sussex Regiment and the remainder of the Heavy Corps brought up the rear.\n\nAfter the British force had advanced for about two miles, the enemy also began to move forward in two large bodies in échelon. They first directed their attack on our right front, towards which they charged, but our men stood perfectly steady, and delivered a terrific fire into their midst, mowing them down in heaps. So telling was each volley that none of the attacking force could get within 60 yards of our front line. Our loss here was six killed and 23 wounded. The guns were worked admirably by Captain Norton of the Royal Artillery, and did immense execution.\n\nWhile one body of the enemy was thus fruitlessly attacking the square, another body, mostly on horseback, made for the zariba. The force garrisoning it was made up of detachments of every corps, under the command of Lord Charles Beresford. The attack on the zariba was sustained for two hours, when the enemy were compelled to retreat before the fierce fire kept up by the garrison from guns and rifles alike. One man was killed and three were wounded.\nwhile they were helping to erect a small redoubt some 50 yards to the right of the zariba. This small work, when finished, was held by Lord Cochrane and 40 of the Life Guards and Scot Grey's, who by their steady fire did much to repel the constant rushes of the enemy.\n\nAt sunset the square reached the Nile, and then encamped for the night. Early next morning (Tuesday) parties were sent out to reconnoitre, and destroyed some empty villages.\n\nThe caravan track passes over a saddle, the highest point along the portion of the route and about 360ft. above the level of the Nile. No doubt the point selected for defence by the Mahdi's lieutenants was determined mainly by the existence of the wells of Abu Klea — so large a force could not have been kept at a distance from its water supply for any time — but the eight miles of rugged country interposed between two nearly level tracts appear to have been well adapted for defence, just the place, in fact, at which an unskilful general might be lured into a trap. Leaving this hilly region, the route passes over an even tract sloping gently to the brackish wells of Shabacat. The ground now rises slightly, and then drops somewhat abruptly to the valley of the Nile. Metammeh is about one and a-half mile from the river, at a slight gap in the low ridge, probably just above the level of highest Nile. There are other Arab villages in the neighbourhood. The plains in which the Shabacat wells lie have a considerable growth of small trees, mimosas, and grass, and support large flocks, which are watered at these wells and at Abu Klea. As far as can be judged there is no point between Abu Klea and Metammeh which offers any special advantages to an Arab defence.\n\nWe paid a heavy price for victory in the death of that gallant officer and able commander Sir Herbert Stewart. Lord Wolseley describes him as one of\nthe ablest soldiers and most dashing commanders he has ever known. The deprivation of his services must be regarded as a national loss. Seven or eight of the Mahdi's Emirs, or generals were killed in the last two battles.\n\nWhile constructing the zeriba the British force was much harassed by a well-directed fire from sharpshooters concealed by bushes and grass, which caused nearly half the total loss. Here the General was wounded, and the command devolved upon Sir C. Wilson. Having completed the extemporized defences and left the wounded under a guard, the advance was sounded and the troops moved out in square at about 3 p.m. to the ridge overlooking the Nile, where the enemy was posted in force. It was intended, by drawing on an attack, to put an end to the galling fire of the enemy, and to clear the way to the Nile. After the advance had continued for two miles, the Arabs charged from the right front, but were unable to reach the British square, and were repulsed with a loss estimated at 2000 killed and wounded. Lord Wolseley says that the attack was not delivered with the \"same determination or courage\" which had been shown on the 17th; but, that the square remained intact, was doubtless due in part to the experience gained and the sense of mutual reliance engendered by the previous fighting. It is probable, too, that the men had steadied down and fired with greater effect, for Sir C. Wilson draws special attention to their admirable coolness, both under the heavy fire in the morning and the Arab charge in the afternoon. The 7-pounder guns of the Royal Artillery also seem to have done great execution. During the fighting, Sir Charles Wilson, with great judgment and a self-renunciation only too rare in such a case, handed the command of the square to Colonel Boscowen, the training of whose previous career had perhaps better fitted him for this special\nduty. In the evening, the force reached the Nile, and encamped on the bank, entrenched itself near the village of Goubat, and brought in the wounded and baggage from the Zeriha. The 20th was spent in minor reconnaissances, in which some Arab villages were destroyed; and on the 21st, a reconnaissance in force was made towards Metammeh, which was found to be strongly held and prepared for defence. On this day, the four steamers, which probably left Khartoum on the 18th or 19th, arrived, and Nusri Pasha, General Gordon's Lieutenant, landed men and guns to take part in the operations. Sir C. Wilson wisely determined not to attack Metammeh at once; since, although the Arabs appeared to be unwilling to show themselves and the place could doubtless have been taken, a further loss would have been occasioned with no compensating advantage. On the 22d, a reconnaissance with the steamers was made down the river towards Shendy which was found to be weakly held by the enemy. On the 24th, Sir C. Wilson, with two steamers and a detachment of the Sussex Regiment, which, as the pioneer force on the Nile, well earned the honour of being first at the goal, started for Khartoum. The principal features of the fighting of the 19th seem to have been that the Arabs made a greater use of rifle fire, and charged with less determination than at Abu Klea, with the result that the proportion of killed to wounded — 22 to 94 — was much smaller, that they used artillery with little result — the shells never bursting, and that the moral effect of General Stewart's victory of the 17th had told heavily.\n\nOfficers Killed.\n\n19th Hussars. — Quartermaster A. G. Lima.\nCommissariat and Transport Corps. — Conductor of Supplies A. C. Jewell.\nAlso Messrs. St. Leger Herbert and Cameron, Correspondents.\nOfficers Wounded.\n\nStaff.—Brigadier General Sir H. Stewart; Captain Lord Airlie, 10th Hussars, slightly.\n\nHeavy Camel Regiment.—Major Lord A. Somerset, Royal Horse Guards.\n\nGuards.—Lieutenant C. Crutchley, Scots Guards.\n\nMounted Infantry.—Lieutenant T. D. O. Snow, Somersetshire Light Infantry; Lieutenant C. P. Livingstone, Royal Highlanders, slightly.\n\nEast Lancashire Regiment.—Captain A.G. Leonard.\n\nRoyal Navy.—Lieutenant Munro.\n\nRoyal Marines.—Major W. H. Poé.\n\nAlso Mr. Burleigh, Correspondent, slightly.\n\nWe cannot but experience a sense of wonder when we consider the coolness with which General Stewart's square moved against an enemy ten times its number, in an inhospitable country, with the natives in full revolt, and in a climate so different from their own—so enervating and so deadly. The effect of the intrepidity of the English soldiers upon the mass of Arabs must have been immense. Notwithstanding the serviceable arms possessed by the latter, in the use of which they had been well trained, notwithstanding their superior position, their long experience of life in the desert, and their overwhelming numbers, they were completely put to flight. We see that even a small army under commanders well trained in the art of war, and who are determined to conquer or die, may, when called upon, rout an adversary much superior in numbers; as the English army has shown in all the wars fought by it during this century in Europe, in Asia, and at the two extremities of the African continent.\n\nWith the English victory near Metammeh on the 19th ended one of the most dashing, most brilliant, most heroic feats in the whole range of military history. This victory, unhappily, was not won without heavy cost. There was a heavy loss in killed\nand wounded, heavy, considering the smallness of the column.\n\nToo late by only a few days, the steamers with Sir Charles Wilson and the detachment of the Sussex Regiment reached Khartoum to find the town fallen into the Mahdi's hands. They were fired upon from all sides.\n\nThe boats were compelled to retire before Gordon's fate could positively be learned.\n\nFive natives who were at Khartoum when it surrendered declare that the rebels were admitted by the treachery of two Pachas, who had once been punished by General Gordon.\n\nThe officer commanding the three steamers which remained at Khartoum is said to have taken the Mahdi's troops to the main gate of the city, where they were admitted after dark. Two of the natives affirm that General Gordon was killed.\n\nOn the way down the steamers and our men narrowly escaped capture at the Sixth Cataract.\n\nDuring the hours of darkness the two steamers slipped past the rebels, shot the rapids, and were within sixty miles of the fort, when one boat went aground. The other stranded near an island twenty miles lower down, where Sir Charles Wilson and the Sussex detachment remained. Major Stuart Wortley, with three English soldiers and natives from Khartoum, came down in a boat.\n\nLord Charles Beresford's steamer, with 20 picked marksmen of the Royal Rifles attached to the Mounted Infantry, went up to relieve them.\n\nThe country has solid ground for gratification in the fact that Sir Charles Wilson was released from his perilous position, and that, after a very rapid ride across the desert, he reported himself to Lord Wolseley at Korti. The details of his rescue, and, indeed, of his whole adventure, are romantic in the highest degree. He approached within 800 yards\nof Khartoum, and on his return both his steamers were wrecked, by the treachery of the Arab pilots. It is gratifying to learn that these men did not escape. Their treachery offers a too probable explanation of the disaster which cost Colonel Stewart and Mr. Power their lives. Sir Charles Wilson, secured a tolerably safe refuge on an island, and the next step for the force at Gubat was to release him. The task was undertaken by Lord Charles Beresford, who performed it with characteristic pluck and resource. His steamer engaged a battery of the enemy, and in the action which followed received a round shot through her boiler. Nothing dismayed, Lord Charles set to work to repair the damage under fire, and succeeded so well that he was able after a while to recommence hostilities, to the \"consternation\" of the natives. Sir Charles Wilson, seeing a vast cloud of steam arising from the vessel, imagined that she was blown up, or at least that she was rendered useless for his rescue, and consequently took measures to save himself. He landed on the right bank with guns and men, drew off some of the fire of the hostile battery, which he returned with effect, and presently halted for the night. Next morning, no doubt to the infinite surprise and delight of the party, the steamer picked them up, and they arrived safely at Gubat.\n\nEdwin Carnow, second-class petty officer, killed; Lieutenant E. Van Koughnet, Royal Navy, wounded (flesh wound in thigh); and two English and four natives wounded or scalded in engine-room when shot went through boiler.\n\nLord Wolseley says I cannot speak too highly of the plucky manner in which Lord C. Beresford acted on this occasion. Indeed, all his party, and that under Sir C. Wilson, behaved admirably, and with the usual determination of Englishmen.\n\nNothing but the coolness and courage of our officers and men saved our force from great disaster,\nand secured to us a brilliant success, as the enemy to which we were opposed was supposed to number from ten to fifteen thousand.\n\nIt is impossible to read, unmoved, the story of the battle near Metammeh on Monday. It is a story of the deepest pathos — just because it is a story of the rarest heroism. Try to realise for a moment what is implied in the description \"our tiny square.\" It was \"tiny\" enough—some fifteen hundred men strong — when it vanished silently into the haze of the desert at Korti, on its long march to the Nile. At Abu Klea the fifteen hundred were reduced for marching purposes to about one thousand, for the casualties at the Abu Klea fight were about one in ten, and a detachment had to be left behind to keep the wells and take care of the wounded. Sir Herbert Stewarts thousand, after a brief rest, started off for the Nile. There was no time to be lost. A few hours' delay, and the Arabs, now scattered to the four winds, might rally, and dispute the passage of the \"tiny\" square to its haven of rest on the river banks. Sir Herbert started late in the afternoon of the 18th — Sunday — and like his distinguished chief, Lord Wolseley at Tel-el-Kebir, made up his mind to try a night surprise. The uproar of our native drivers when the column and its transport animals became entangled in the brushwood gave the Arabs warning, and when morning broke our men discovered the enemy waiting for them in their thousands — seven thousand according to one account on the crests of the sandhills which divided them from their destination, only three or four short miles away. Now, owing to the casualties the brigade had sustained while, under a hot, incessant fire, it threw up its temporary entrenchments in face of the enemy, and owing also to the detachment of at least one hundred men to protect the spot, the \"tiny\" square which marched out to do battle with the seven thousand Arabs could hardly have numbered more\nthan eight hundred men at the utmost — half the number with which they started from Korti. The square, which to those who remained behind in the redoubt must have seemed like a speck on the plain, was furiously assaulted by one body apparently from Metammeh, and by another from the southwards — the body, perhaps, which the Mahdi is reported to have despatched for the extermination of the English army. The Nile was within reach, but it seemed as if the Soudani horse and foot who swarmed over the sand dunes would in a moment engulf and destroy their handful of assailants. They charged and recharged, with their innate, desperate valour, all the more desperate because of their religious fanaticism, and the resentment of a previous defeat; but — to quote Lord Wolseley — none of the brave warriors who followed the Mahdi’s Emirs succeeded in getting within thirty yards of the English square.\n\nGiven a good position, an English square is in warfare of this kind a match for any odds whatever. Perhaps the square was led too closely to the enemy before the latter rushed. At this new battle on the Nile, our troops had the advantage of a fairly wide “fire-zone” all round about them. Hence the Arabs fell dead in scores, as they rushed across through the storm of bullets which hissed out from the sides of the “tiny” square. The same thing happened at Tamai — where Sir Redvers Buller’s brigade halted, and stood fast, at a distance of five or six hundred yards from the spot where the enemy was known to be ready for a “rush”.\n\nEvery one will deeply regret the necessity which compelled Sir Herbert Stewart, the gallant leader of the expedition, to make over his command. He had at all events, the satisfaction of knowing that he accomplished a march which is unique in military annals. In Lord Charles Beresford he found a capable substitute. Sir Charles Wilson, who commanded the\nsquare at the last fight, Sir Herbert being disabled by his wounds, is as resolute and brave as he is gentle in temperament and retiring in manners. Sir Charles Wilson's services in the first Egyptian campaign are well known, as also in Asia Minor, and in his capacity of representative of the English Government during the trial of Arabi and his fellow-officers. As for the list of casualties in this battle, it is not so heavy as that of Abu Klea — and the reason may be the advantages of position which Sir Herbert Stewart's force seems to have gained.\n\nThe Empress Queen commanded the Secretary for War to telegraph to Lord Wolseley the expression of her satisfaction and warm thanks to her brave troops, and her deep concern for their losses and sufferings. Her Majesty added a special word of sympathy with General Stewart, together with the announcement that she had promoted him to the rank of Major General.\n\nWhen the lamentable intelligence of the fall of Khartoum reached the Queen it caused profound sorrow to her Majesty. Sir John and Lady Cowell visited Miss Gordon and her two sisters to express to them the Queen's true sympathy in their sorrow and painful suspense:\n\nBefore marching, Mr. Burleigh, of the Daily Telegraph, Mr. Villiers, of the Graphic, Colonel Barrow, of the Hussars, and Lord Charles Beresford, who had gallantly conducted the defence of the zareba, together with, Mr. Melton Prior, of the Illustrated London News, and Mr. H. H. S. Pearce, of the Daily News, bore sadly to the grave the body of their lamented colleague Mr. Cameron. His grave was dug alongside those of two officers and Mr. Herbert, of the Morning Post. Lord Charles Beresford read the Burial Service which the circumstances rendered most impressive.\n\nAmong the names of the killed at this last battle by the Nile there occurs one which has for years been\nfamiliar to newspaper readers throughout the world. We speak of John Alexander Cameron, the War Correspondent of the *Standard*. Mr. Cameron possessed in the highest degree the rare combination of gifts which go to form the leaders of the profession. Mr. Cameron never served in any of the great campaigns which have in the course of a few years changed the map of Europe. His experiences — and rare ones they were — were gathered, as he used to say himself, in savage warfare in Afghanistan, in South Africa, in Lower Egypt, in Tonquin, in the Soudan. But his great successes in these campaigns have placed him in the very first rank of War Correspondents — side by side with Mr. Archibald Forbes, Dr. Russell, Mr. MacGahan, and Mr. O'Donovan. John Cameron knew more of the theory and practice of war — from strategy down to the minutest tactics — than many a general officer who has grown grey in the service.\n\nHis letter from Southern Afghanistan, describing the battle of Maiwand, was one of the very best ever written to any newspaper by any War Correspondent. Good as his work always was, it was always improving. His late letters from the Soudan showed how his writing was crystallizing into the perfection of descriptive style. He had had so many hairbreadth escapes, he could not always expect to be lucky. His young life, his brilliant and promising career, ended at last; and he sleeps, never to be forgotten by those who knew him, in the desert by the Nile.\n\nIn the same engagement in which Mr. Cameron was killed, Mr. St. Leger Herbert, the Special Correspondent of the *Morning Post*, also lost his life.\n\nThe sad news of the death of Mr. Herbert evoked deep sorrow among a large and distinguished circle of friends and acquaintances, by whom the lamented gentleman was regarded with warm feelings of affection and esteem. Mr. Herbert was a member of that\nbranch of the Herbert family of which the Earl of Carnarvon, is the distinguished head. His grand-\nfather, William Herbert, Dean of Manchester, was\nthe third son of the first Earl of Carnarvon, and the\nDean's second son, Captain Frederick Charles Her-\nbert, was the father of St. Leger Algernon by his\nmarriage with the youngest daughter of the late Cap-\ntain Henry Stuart, of the 39th Regiment. Although\nso young he had seen great and varied service, and\ndistinguished himself on many occasions. His univer-\nsity career was brilliant. He was a scholar of Wad-\nham College, and obtained a first class at the Oxford\nModerations. His first public appointment was with\nLord Dufferin, when that nobleman was Governor-\nGeneral of the Dominion of Canada. He afterwards\nacted as private secretary to Lord Wolseley (then\nSir Garnet) on the occasion of the annexation of Cy-\nprus, and was also civil secretary to Sir Garnet Wol-\nseley when he proceeded to South Africa as High\nCommissioner. For his services on these occasions\nMr. Herbert was made a Commander of St. Michael\nand St. George. He was present at the taking of Seku-\nkuni's mountain, for which he obtained the South\nAfrican medal. Mr. Herbert was also civil secretary to\nSir Frederick Roberts in South Africa, and when\nthat General returned to England he was made\nsecretary to the Transvaal Commission, Mr. Herbert\nserved with the Mounted Infantry at Tel-el-Kebir as\na volunteer, for which he obtained the Egyptian me-\ndal. He was present two years later at the engage-\nments of El Teb and Tamasi, where he acted as galloper to Sir H. Stewart, and obtained the clasp.\nAt Tamasi Mr. Herbert received a severe wound, but\nhis youth and good constitution enabled him quickly\nto recover from it.\n\nThe Victoria Cross would be by no means an exces-\nsive reward for such services as are rendered to the\nnation by men of the stamp of Cameron and Herbert.\nWe are not suggesting that it should be given; we are merely estimating the military and combatant value of their courage. At the end of the Franco-German war the Iron Cross was conferred by the Emperor William I with his usual kindness and sound judgment, on more than one English War Correspondent, and the Germans are not in the habit of lavishing military honours meaninglessly. No Correspondent in European warfare incurs a thousandth part of the peril run by the Correspondents who accompanied General Graham, and General Stewart. The English people, however, are not oblivious of brave men, and though the State may be unwilling, or unable, to appraise such heroism, public opinion will crown Cameron with the laurels of the soldier. He lived a hero's life, and he died a hero's death. He was cut off in the flower of his vigour; but he lived long enough to endear himself to all who knew him, and to convince the world that an Englishman does not require to wear military garb to be as fearless of death as those who do.\n\nTo such men, we feel sure, soldiers will be the first to pay their homage. They are, in almost every sense, their comrades, ready to encounter the same peril as themselves, in order to be able to tell the English people how their countrymen fight and die. It was by no means the first time that Mr. Cameron had risked his life in the performance of that task. When the square was broken at Tamasi, he escaped, we may say, by the skin of his teeth, and was repaid for his daring by sending an account of that engagement which made everybody ask who it was that sent it. In Afghanistan he had already proved the stuff off which he was made. Nor must we, in the midst of our deep regret at his death, forget that, prominent as he was as a War Correspondent, he was but one of a little army of able, brave, and indefatigable men who take their lives in their hands, and\nface every conceivable trouble, peril, and mischance, in order that England may not be kept waiting a moment for full and accurate accounts of what has happened to its sons in the storm and stress of battle. The career of a War Correspondent has its attractions, no doubt, to natures passionately fond of adventure. But they must needs be greatly enamoured of their task to confront its drawbacks.\n\nThey have to live perpetually on the alert, and to subordinate the weakness of flesh and blood, hunger, thirst, weariness, to the one supreme object of ascertaining accurately what has occurred, and of conveying the information with the utmost speed to those who are waiting for it. When the fight is over those who fought rest. But the work of the War Correspondent then begins. For him there are no sweets of victory. He must collate facts, put them into shape, impart to them an appropriate and faithful colouring, and personally superintend the transmission of his despatch. In a word, a first-rate War Correspondent, a Correspondent like Cameron, must be all that a fighting man is, and be a man of letters into the bargain. He must have a good physique, a robust constitution, nerves beyond proof, and, on the top of all this, be as ready with his pen as with his person. In such campaigns as England has recently waged he must be a dashing horseman, whom no amount of riding, will weary, and must have a digestion that can defy bad food and scanty rations. M. Cameron had all these requirements, and more.\n\nThe calm courage with which Mr. Cameron himself faced the chances of a Campaign, knowing full well that the path of duty might also be the path to death, is the inspiration that has nerved Englishmen in all ages in the hour of danger. We know full well that others will be forthcoming to take the place of those who fall. Yet the risks, it must be confessed, are growing apace.\nThe time was when a War Correspondent ran little or no chance of being killed, unless he took great pains to meet that fate. Colonel Pemberton, it is true, was shot at Sedan, but not in the mere performance of his duty as a Correspondent. He was a soldier into the bargain, though not a combatant; and he volunteered upon a service that was not obligatory. But it is clear that every Correspondent who accompanied General Stewart to Abu Klea, and thence on to Mettemneh, carried his life in his hands. If we are to wage such wars as those in which we have recently been engaged, the risk will recur, and perhaps the fate. How great are the services rendered by such men to the nation. It must be obvious to every one that they perform the most arduous, responsible, and dangerous duties, without any prospect of that public recognition which falls to hundreds of people whose risk is not greater.\n\nCol. Kitchener in his \"Notes on the Fall of Kharthoum\" says:\n\nThe last accurate information received about Kharthoum is contained in General Gordon's Diary, and dated the 14th December 1884.\n\nThe state of the town was then very critical, and General Gordon states: \"the town may fall in ten days.\"\n\nThe fort of Omdurman had been cut off from communication with Khartoum since the 3rd of November; it was at that date provisioned for one month and a half, and the Commandant, Farag Allah Bey, had requested further supplies of ammunition.\n\nThe garrison may therefore be considered to have been in great difficulties for food and necessaries after the 20th December.\n\nIt may therefore, be considered that even on reduced rations the supply in store must have been almost, if not quite, exhausted about the 1st January 1885.\n\nIt has been estimated that only about 14,000 remained in the town out of the total of 34,000 inhabitants,\nthe number obtained by a census of the town in September.\n\nGeneral Gordon kept heart in the garrison by Proclamations announcing the near approach of the English Relief Expedition, and praising them for the resistance they had made, as well as by the example of his unshaken determination never to surrender the town to the rebels.\n\nOn the 20th January the news of the defeat of the Mahdi's picked troops at Abu Klea created consternation in the Mahdi's camp. A council of the leaders was held, and it is said a considerable amount of resistance to the Mahdi's will, and want of discipline, was shown. On the 22d the news of the arrival of the English on the Nile at Metammeh, which was thought to have been taken, led the Mahdi to decide to make at once a desperate attack upon Khartoum, before reinforcements could enter the town. It is probable that next day the Mahdi sent letters to Farag Pacha, commanding the black troops, who had been previously in communication with him, offering terms for the surrender of the town, and stating that the English had been defeated on the Nile. Rumours were also prevalent in Khartoum of the fighting at Abu Klea, and the arrival of the English at Metammeh.\n\nOn the 23d General Gordon had a stormy interview with Farag Pacha. An eye-witness states that it was owing to Gordon having passed a fort on the White Nile, which was under Farag Pacha's charge, and found to be inadequately protected. Gordon is said to have struck Farag Pacha on this occasion. It seems probable to me that at this interview Farag Pacha proposed to Gordon to surrender the town, and stated the terms the Mahdi had offered, declaring in his opinion that they should be accepted. Farag Pacha left the Palace in a great rage, refusing the repeated attempts of other officers to effect a reconciliation between him and Gordon.\nAt about 3.30 a.m. on the morning of Monday, the 26th, a determined attack was made by the rebels on the south front. The principal points of attack were the Boori Gate, at the extreme east end of the line of defence on the Blue Nile; and the Mesalamieh Gate, on the west side, near the White Nile. The defence of the former post held out against the attack, but at the Mesalamieh Gate, the rebels, having filled the ditch with bundles of straw, brushwood, beds, &c., brought up in their arms, penetrated the fortifications, led by their Emir, Wad-en-Nejumi. The defenders of the Boori Gate, seeing the rebels inside the fortifications in their rear, retired, and the town was then at the mercy of the rebels.\n\nFarag Pacha has been very generally accused of having either opened the gates of Khartoum himself, or to have connived at the entrance of the rebels; but this has been distinctly denied by Abdullah Bey Ismail, who commanded a battalion of irregular troops at the fall of the town, as well as by about 30 refugee soldiers, who lately escaped, and came in during the last days of the English occupation of Dongola. The accusations of treachery have all been vague, and are, to my mind, the outcome of mere supposition.\n\nHassan Bey Balmasawy, who commanded at the Mesalamieh Gate, certainly did not make a proper defence, and failed to warn General Gordon of the danger the town was in. He afterwards appears to have taken a commission under the Mahdi, and to have gone to Kordofan with the Emir Abu-Anga.\n\nIn my opinion Khartoum fell from sudden assault, when the garrison were too exhausted by privations to make proper resistance.\n\nThe massacre in the town lasted some six hours, and about 4000 persons at least were killed. The black troops were spared, except those who resisted at the Boori Gate and elsewhere; large numbers of the towns-people and slaves were killed and wounded.\nThe Bashi Bazouks and the regulars, numbering 3327, and the Shaiga irregulars, numbering 2330, were mostly all killed in cold blood, after they had surrendered and been disarmed. The presence of Gordon as a prisoner in his camp would have been a source of great danger to the Mahdi, for the black troops from Kordofan and Khartoum all loved and venerated Gordon, and many other influential men knew him to be a wonderfully good man. The memorable siege of Khartoum lasted 317 days, and it is not too much to say that such a noble resistance was due to the indomitable resolution and resource of one Englishman. Never was a garrison so nearly rescued, never was a commander so sincerely lamented.\n\nVI.\n\nBATTLE OF KERBEKAN\n\nThe splendid victory of General Earle's column near Dulka Island, fifty miles beyond Merawi, in which nearly all the enemy were killed, was of the highest importance.\n\nOn the 10th General Earle discovered the enemy occupying a strong position on a high ridge 75 miles above Merawi, and advanced to the attack. Leaving two companies of the Staffordshire Regiment and two guns to hold the enemy in front, Generals Earle and Brackenbury, whose name is in itself a sufficient guarantee of skill and promptitude in the conduct of operations, marched with six companies each of the Staffordshire Regiment and Black Watch round the ridge, thus completely turning the enemy's position. The Black Watch then advanced over the rocky ground, and stormed the position, driving the enemy back with great coolness. The Staffordshire attacked the high ridge over most difficult ground, and carried\nthat position. Meanwhile the 19th Hussars under Col. Butler swept round the enemy's rear and captured their camp. The rebels were almost entirely destroyed, and the success of the British troops was complete. Ten of the enemy's standards were captured in the engagement. Three of the Mahdi's chief men were killed. General Earle was foremost in the attack when he fell, and Colonel Eyre was leading his regiment when he also was killed.\n\nBy General Earle's death England has lost one of the bravest and most brilliant and popular soldiers.\n\nOur own loss was as follows: Major-General Earle; Lieut.-Col. Eyre, South Staffordshire; Brevet Lieut.-Col. Coveney, Royal Highlanders; one corporal and three privates Royal Highlanders; three privates South Staffordshire, and two Egyptian Camel Corps. Missing: One private Royal Highlanders. Wounded very severely: Brevet-Lieutenant-Colonel Wauchope, Royal Highlanders. Severely wounded: Captain Horsbrugh, Stafford; Lieut. Hon. J. G. R. Colborne, Staffordshire; Lieutenant T. Kennedy, Royal Highlanders. Wounded: Twenty non-commissioned officers and men Stafford and eighteen Black Watch.\n\nDulka, the scene of General Earle's victory, is situated about a hundred miles from Korti, which the column left the beginning of January, and is close to Kerbekan. It is about twelve miles ahead from Berti, which General Earle, with the vanguard of his column, reached on the first day of the month, and from which, several reconnaissances were made by Colonel Butler, who, by the way, performed other valuable service of the same kind during the advance from Hamdab. The position is perhaps the strongest anywhere on the Nile between Hamdab and Berber. At that point the Nile bank becomes broken and precipitous — it is, in fact, a labyrinth of low hills, crags, ravines, and ridges, which a small body of determined men could hold against almost any odds. To\npass the narrow channel of the Nile there, without driving the enemy from this fastness — which extends to the river bank, completely dominating it — would have been impracticable. So it had to be carried at all hazards. To accomplish this, General Earle had only a portion of his force — namely, the South Staffordshire Regiment, about five hundred strong; the famous \"Black Watch,\" also about five hundred; one squadron of the Nineteenth Hussars, say eighty men; and two guns of the Egyptian Artillery — in all less than twelve hundred men. General Earle's total force amounted to 2,500 men. But the Duke of Cornwall's Regiment, the Gordon Highlanders, the detachment of the Essex Regiment, and a few \"details,\" were still on their way up the river. However, General Earle did not wait for them. He determined to attack with the \"Staffords\" and the Highlanders; and, halting on Monday afternoon on a spot fifteen hundred yards from the enemy's central position — a \"fort\" or entrenched and loopholed structure of some sort, about the middle of the ridge and overlooking the river — he surrounded his brigade with a zereba and rested there until the morning. To add to the natural strength of the place, the enemy threw up barricades on every point of vantage. The two or three thousand Arabs appear to have been armed with Remington rifles. In short, even with a handful of fairly good marksmen in front of the position of General Earle's force would have been in the highest degree critical. Lastly, indifferent marksmen as the Soudanis are at long and intermediate ranges, they may be formidable enough at close quarters; so that to attack them straight in front would have been an extremely risky proceeding. The battle, in short, had to be won, not only by the usual display of pluck and dash, but also by manoeuvring.\n\nThe battle of Kerbekan was a masterpiece of tactics. For the first time in the history of the Soudan cam-\npaigns the Soudanis were beaten at their game. They were completely surrounded even before the fight commenced, so completely that only one way of escape was left to them — the river, where, it seems, numbers of them perished. To understand how this was, let the reader imagine a short line drawn eastwards from Kerbekan. Fifteen hundred yards to the south of that line General Earle's force was posted. The line would represent the ridges on which the enemy were drawn up. Instead of marching right upon the middle of the line, the \"Staffords\" and the Highlanders turned off eastwards. In other words, their object was to go round by the Arab left flank (the right flank rested on the river) and assault the Arabs in rear. And just before this flanking movement began, as also while it lasted, the two seven-pound guns, placed right in front of the ridge, and supported by two companies of the Staffordshire regiment, fired away at the enemy, and fully occupied his attention. In the flanking movement, the infantry marched in two parallel columns, the Staffordshire men composing the inner column, the Black Watch the outer one. It will thus be easily seen that when the enemy's left flank was turned and the infantry advanced upon his rear the Highlanders occupied the side next the river. In this way the task of carrying the enemy's strongest position, that immediately dominating the river, fell to the lot of the Forty-Second. The Hussars, too, had their share in this remarkably clever performance — for they swept round by the enemy's left flank, and occupied his camp, two or three miles ahead. The whole story bears a striking resemblance to that of Sir Gerald Graham's brilliant fight at El Teb. El Teb was won as much by skilful manoeuvring as by actual fighting. It consisted of a series of turning movements, beginning, as at Kerbekan, with an advance round by the Arab left, and finishing, also as at Dukka, with a clean sweep, from\nback to front — to use an untechnical expression — of the enemy's entrenchments. The only difference, as regards a general comparison between the two battles, is that at El Teb the fight was fought over level ground, whereas at Kerbekan the ground must have somewhat resembled that of Tamai, where marching or riding was like an endless going up and down stairs. At Kerbekan — or, as the place is also called, Dukla — as at El Teb, one of the most striking incidents was the charge of the cavalry a long way ahead of the spot where the infantry were engaged in hand to hand conflict with their enemies. The Nineteenth Hussars, too, were at both fights. At El Teb they were under the chief command of Sir Herbert Stewart. At Kerbekan they were led by Colonel F. W. Butler, who is one of Lord Wolseley's most trusted officers, and who has long since won distinction in more than one campaign between the Red River and the Nile. In superintending the preparations for the flotilla expedition and its subsequent progress up the river, Colonel Butler displayed the greatest energy, and a rare faculty of organization; and the style in which, with his couple of squadrons of Hussars, he pioneered General Earle's column along some of the most difficult reaches of the Nile, is worthy of the highest praise.\n\nTactically, the battle was won before the fight began. But the fighting had to be done, and the severest portion of it appears to have fallen to the Highlanders, who found themselves at the conclusion of the manoeuvring behind the enemy's right rear, that is to say, on the ridges immediately overlooking the river. They had to advance across these ridges, from the loopholed walls of which the enemy poured a fusillade upon them. The Highlanders replied briskly with their Martini rifles. But they failed to dislodge the Arabs. And then came the order which ever sends a thrill through a British soldier—the order to charge.\nThe pipes instantly \"skirled,\" for the first time in history, among the Kerbekan crags, and the Highlanders, with the cry of their famous regiment, carried the ridge at the point of the bayonet. It was while leading this gallant charge that General Earle fell. His death will be deeply deplored. It has cost the army a most able, distinguished, and popular officer. The Staffordshire regiment was as stubbornly opposed, for a time, as the Black Watch. But they cleared the ridges in splendid style, though at heavy cost, for they lost their gallant leader, Lieutenant-Colonel Eyre. The total loss in Tuesday's battle appears to have been twelve killed and forty-two wounded — officers and men included.\n\nThe two distinctive features, then, of the battle of Kerbekan are its completely successful manoeuvring, and the prominent part which bayonet charges played in it. It is also one of the most stubbornly-contested engagements since February, 1884. It lasted five hours. It shows to how large an extent Lord Wolseley's army was composed of crack shots. As the whole of the Arab force was armed with Remington rifles, and as it was so well sheltered, it should, after five hours' firing, have much more decimated the two English battalions. On the other hand, the British troops appear to have almost destroyed the Soudani host. The rocks were covered with heaps of the Arab lead. They had advantages of position which in themselves should have been worth an army, and such as were possessed by no Arab force which we had yet encountered. A small English brigade, won a brilliant and decisive victory under an entirely new set of conditions.\n\nVII.\n\nSecond Suakin expedition. On the 8th of February 1885 it was decided to open up the Suakin-Berber route and to make a railway to Berber. On the 13th\nof March a force of nearly 11,000 officers and men was assembled at Suakin, and during the following month the important positions of Tamai, Handoub, and others were successfully occupied, and the railway was laid down for a considerable portion of the distance, and by the time the force was withdrawn it is not too much to say that the power of Osman Digma had been absolutely crushed, and positions were obtained which offered us a prospect of securing the goodwill and the confidence of some of the most important of the Arab tribes.\n\nBATTLE AT HASHEEN\n\nThe force which General Graham had under his command at Souakim when he arrived there on the 12th numbered about 12,000 men, which, after leaving about 600 men of the Shropshire Regiment and details as guards, would give him nearly 10,000 troops with which to operate against the enemy. The force consisted of battalions of the Coldstreams, under Colonel Lambton, and the Scots Guards under Colonel the Hon. W. Trefusis, the 20th Hussars under Colonel C. R. Nicholls, the 5th Lancers, three battalions of the line — the Shropshire, Berkshire, and East Surrey — a battalion of Marines, the Indian contingent of one regiment of cavalry, three battalions of Sepoys, and one company of Sappers, a battery of Royal Horse Artillery, one screw gun battery, one garrison battery, a corps of Mounted Infantry, besides Engineers and departmental corps. That General Graham considered this force sufficient is shown by the fact that on Tuesday the 19th Hussars embarked for Cairo, whither they were to be followed by the Egyptian Camel Corps. The nature of the operations and necessities of the ground rendered\nthe services of cavalry and guns of great importance, the enemy occupying a range of hills to the west and south-west of Souakim, the approach to which was in some places through thick scrub, the track occasionally becoming so narrow that our troops were obliged to proceed in single files. A Gardner battery under command of Captain Crooke was drawn by mules, and the G battery B Brigade R. A. was taken with the force with a view to shelling the positions and clearing the way for our advancing troops. Unlike the operations of last year, when it was desired only to inflict a crushing defeat on the Arabs, it was now necessary to occupy the enemy's country for the purpose of covering the line of the proposed railway; and although it was believed that water could with suitable appliances be discovered in the neighbourhood, in addition to whatever supply the Hasheen Wells might afford, provision for present needs was made by taking over twenty thousand gallons, while the troops were supplied with two day's rations. For obvious reasons it was desirable to make the advance early. At daybreak preparations were being made, and shortly after six o'clock the cavalry started across the plain. It was expected that by operating in the direction of Hasheen the main body of Osman Digna's troops, which it was thought had not shown themselves during the reconnaissance on the previous day, would emerge from between the hills in the direction of Tamai, which place is about a dozen miles to the south of Hasheen, probably hoping thereby to attack our troops in the rear, while it would, however, enable General Graham's force to operate in the open country between the hills and Souakim. In about two hours the first hill was reached, but the enemy did not offer much resistance, retiring to another hill at a short distance. This was carried by the Berkshire Regiment and Marines, who advanced cautiously, and sustained only a few minor\ncasualties. As the enemy fled from this position towards their base at Tamai, the cavalry were able to charge them, and it was here that the most severe fighting took place, one officer and several men falling in hand-to-hand combats. The artillery also were enabled to drop a few shells among the rebels, streaming across a valley west of Hasheen, with great effect. The enemy were pursued for some distance. After the operations had lasted several hours the troops returned to Hasheen, and subsequently to camp, the position which had been taken at Hasheen being occupied by the East Surrey, with the stores and guns entrenched as a point from which further operations could be conducted.\n\nThe whole of the country round by the foot of the hills, from Hasheen to Tamai, is admirably adapted for the kind of tactics which Osman should follow in fighting with British troops. It may with sufficient accuracy be described as a network of deep khors, or ravines, in which large hosts of men may easily conceal themselves from an enemy approaching them on the level of the plain.\n\nThe enemy, as doubtless General Graham expected, at once withdrew to a ridge more than a mile distant, from which they were driven by the Berkshire and the Marine Light Infantry, with the Guards and part of the Indian Contingent as supports. Expelled from this position, Osman's men retreated southwards towards Tamai.\n\nParties of Arabs were working round by the right of the English position, but were scattered by the 5th Lancers. Four thousand is the estimated number of the Arabs who were actually engaged. The fight was a pretty stubborn one. One of the most notable incidents of the battle was the charge of the Indian cavalry — the distinguished regiment known as Hodson's Horse, after the brave officer who raised it, and who perished in the Indian Mutiny. The 9th Bengal\nLancers are one of the crack regiments of the native Indian army. They are the very men for savage warfare of this sort. Unlike the gallant 19th Hussars at El Teb — who found their sabres far too short for their agile foes — the Bengal Lancers could charge in and out among the mimosa bushes, sure to give a good account of themselves and of their opponents. The lance, and not the sword, is the weapon for cavalry charges in the Soudan, and last year the 19th Hussars acted on this principle when, on the march onwards to Tokar, they armed themselves with the spears which they picked up on the field of El Teb.\n\nKilled. — Scots Guards, Captain Dalison, Private Ashley. 5th Lancers. — Troop-Sergt.-Major Nicholls, Private Edwards. 9th Lancers (Bengal.) — One non-commissioned officer, four Sowars.\n\nWounded. — Surgeon-Major Lane, Army Medical Service (severely). Scots Guards, six men; Coldstreams, eight men; Grenadiers, eight men; Berkshire, two men; 5th Lancers, Major Harvey (severely), two men (slightly); 9th Bengal Cavalry, Major Robertson (severely), seven sowars; 15th Sikhs, one man; 70th Sikhs, two men.\n\nThe attack on Sunday was very sudden and determined, and came, unfortunately, on our weakest point. The Sikhs charged the enemy with the bayonet. The Berkshire behaved splendidly, clearing out the zeriba where entered, and capturing three standards. The Marines also behaved well. The Naval Brigade was much exposed, and suffered severely. Engineers also suffered heavily, being out working when attacked. M'Neill, with his usual courage and skill, did everything possible under the circumstances. Two Thirds of his force stood to their arms and victoriously defeated the enemy on all sides with tremendous slaughter.\n\nThe cavalry (5th Lancers) did their best to give information, but the ground being covered with bush\nit was impossible to see any distance. The troops behaved extremely well. All the staff and regimental officers did their utmost.\n\nThe enemy charged with reckless courage, leaping over the low zereba to certain death, and although they gained a temporary success by surprise, they received a severe lesson. General M'Neill reports the British loss to be larger than at first stated.\n\nThe troops had formed a low zereba and had just finished their dinner when the cavalry sent in two messages to say that the enemy were approaching.\n\nAlmost immediately the rebels rushed upon the zereba and succeeded in penetrating one corner. The natives who entered the zereba were all killed.\n\nAfter twenty minutes sharp fighting the enemy was repulsed with great loss.\n\nIt is believed that 1,500 rebels were killed and many wounded. Our troops behaved admirably.\n\nA number of the transport animals within the zereba effected a stampede, causing some confusion. A large number of camels and mules were killed owing to their getting between the zereba and the enemy.\n\nThe rebel force is estimated to have been between 4,000 and 5,000. Our loss amounted to five officers and 51 men killed and 170 wounded. One of the most striking features of Sundays desperate fight was the gallant defence made by the \"F\" and \"G\" companies of the Berkshire Regiment. When the first alarm was given Captain Edwards was serving out water to his men of the \"F\" company. This company had just come in from covering the men who were cutting bushes. Captain Edwards called to his men to stand to their arms. The \"G\" company did the same, and the two formed a rallying square outside the middle zariba, and quite 100 yards away. Only a rough square was formed round the officers. The enemy made a fierce rush at this gallant little band from all directions, but were met with a terrific\nand wonderfully steady fire which mowed down hundreds of them. The men were well in hand, and reserved their fire until the Arabs were within 30 yards. Two of the assailants fell dead under the bayonets, one hurling his spear before he died and wounding Private Campbell. This little square was commanded by Colonel Gillespie, and all the company officers were present. After fighting for half an hour, the square fell slowly back upon the Marines' zariba, halting at times to fire.\n\nWhile this was going on, far from the Berkshire zariba, the Colonel commanding the regiment, Lieutenant-Colonel Huyshe, was in the Berkshire zariba, with four companies, all of which had just turned out in their shirt sleeves to complete the construction of the fence when the alarm was given. All the working parties rushed into the zariba, and seized their arms and accoutrements.\n\nMeanwhile the enemy had leaped the zariba and captured the sandbag redoubt at the corner, hewing and slashing with their cross-hilted swords and stabbing right and left with their terrible spears. The companies of the Berkshire Regiment rallied by the Colonel, were pouring a steady fire into the still advancing foe outside the zariba and also bayoneting those who had already got in.\n\nThe 17th (Indian) Native Infantry fell back in disorder across the Berkshire zariba and poured through the corner to their own. Colonel Huyshe was attacked by three Arabs all of whom he shot dead, one actually falling against his horse. The scene inside the zariba now was something terrible. A hand-to-hand combat raged everywhere; the Arab swordsmen were slashing and cutting at soldiers, camels, and horses alike; the Native Infantry were inextricably mixed up with the flying stream of baggage mules and camels; bullets were whistling from all points, and there can be little doubt that several of our men were\nkilled by the fire of our own force. This, under the conditions of the fight, was absolutely unavoidable; the only strange thing being that more did not fall from this cause. The total loss of the Berkshire Regiment was one officer, Lieutenant Swinton, killed, with a spear wound, 15 men killed, and 20 men severely and six slightly wounded, while 22 men were missing.\n\nThe advance guard of Cavalry, and the reinforcing brigade, now arrived at the zaribas.\n\nThe Brigade of Guards, marching in square, enclosed a transport train, with water and provisions, drew up on the flank of the Marines' zariba, and presented a magnificent appearance.\n\nThe Arabs seem to be more like wild beasts than human beings. Even women and children fight in their ranks, and when our men sought to afford aid to some of the enemy who could not walk, the latter crawled towards them with their spears between their teeth, striving even yet to slay a Kaffir. These traits somewhat diminish the sympathy which we should otherwise feel for such brave antagonists. Were their ferocity shown in the heat of the battle it would be excusable, but these wretches hours after were animated by a fiendish desire to injure those who sought to relieve their sufferings. Even the nobler animals have some idea of gratitude, and Arabs must henceforth be regarded in the light of the most savage of the worst description of beasts of prey. The fact is they are maddened into brutality by fanaticism.\n\nBerkshire — Killed, Lieutenant Swinton and 12 men. Marines — eight men killed, 12 wounded. Navy — Killed, Lieutenant Seymour, six men. Royal Engineers — Captain Romilly and Lieutenant Newman killed. Indian Contingent — about 25 killed, including Major Von Beverhondt, and 70 wounded.\n\nKilled. — Ordnance Store Department, Quarter-master C. Eastmead.\nWounded. — Royal Navy, severely, Surgeon M. Digan; Staff, Lieutenant Hon. A. D. Charteris, Coldstream Guards, A. D. C.; Royal Engineers, Captain C. B. Wilkiescn; 17th Bengal Native Infantry, Lieutenant F. M. Drury; 28th Bombay Native Infantry, dangerously, Lieutenant A. T. F. Edwards; slightly, Lieutenant Thompson.\n\nA military writer of recognized authority, and who has seen much war, especially in Abyssinia, suggests that, as in that country, the bush should be cut or burnt for a certain distance from the road or posts. He says that in the Abyssinian campaign the army had to march over exactly similar ground, and the cutting down of the mimosa bushes, or the burning them by fire when the wind is favourable, is no difficult task.\n\nThe more we read the graphic account of Sunday's fight, the more are we struck by the steadiness, discipline, and dauntless conduct of the troops and the fine leading of the officers. The stampede of camels, mules, and their drivers dashed against a portion of the native contingent, broke gaps in their zariba, and in one or two instances swept several men, horses and all, to the ground. Some of the European troops, too, were outside cutting bushes; others were having water served out to them, while others, again, were in their shirt sleeves just setting to work to complete the defences. In fact, everything was against our force, which seemed for the moment utterly helpless. So the Arabs must have thought, but in an instant they were undeceived, and saw, to use Sir William Napier's words, \"with what majesty the British soldier fights.\" Those men who were inside or close to the zaribas seized their arms and accoutrements, fell into their places instinctively, and steadily, as if on parade, poured forth sheet after sheet of bullet-laden fire. Those outside and at a distance from the zaribas were no less prompt and calm. F and G com-\npanies of the Berkshire — the 49th — were 100 yards away from the zaribas receiving their allowance of water. Having just come in from covering the working parties, they had their arms piled close by. Suddenly came the alarm, but no panic ensued. The officers ordered them to stand to their arms, and a rough square was formed round the officers, the commander being one who bears a name of good augury, Colonel Gillepsie. The enemy tried to rush the little group, but with a steady fire, reserved till the Arabs were within 30 yards, our men mowed the foe down by hundreds. The Arabs fell dead under the bayonets, so resolute were they to win. After a period estimated at half an hour the little square fell back steadily on the Marines zariba. The remainder of the Berkshires, under Colonel Huyshe, were meanwhile engaged in a desperate encounter with a body of Arabs who had penetrated their zariba. The difficulties of the Berkshires were increased by the number of camels, mules, and horses which had rushed in. At first the men were naturally in a little, not disorder, but confusion; they were, however, soon rallied by their colonel, and while some fired on the enemy outside, others strove to rid themselves of those who had entered. A hand-to-hand mêlée of the fiercest nature raged for some minutes, bayonet and revolver met sword and spear, and every moment down went a fair-skinned Englishman or a dusky Arab. The colonel himself was attacked by three Arabs at once. He shot them one after the other, and soon the last of the 70 or 80 Arabs who had got inside the enclosure bit the dust. The old 1st Bengal Fusiliers, now 1st Battalion Royal Munster Fusiliers, were nicknamed \"the dirty shirts,\" because once on a sudden emergency they turned out and defeated the enemy in their shirt sleeves. The 49th may now claim to share the nickname with them. Where all were heroes it seems almost invidious to select one for\nspecial mention, but we cannot refrain from writing of the devotion and courage of Lieutenant Hon. Alan Charteris, Coldstream Guards, Aide-de-Camp to Sir John M'Neill. This young officer, whose eldest brother, gallant, handsome, popular Alfred Charteris, died from disease contracted in the Ashantee war, was close to his general when, on the alarm being given he tried ineffectually to make his horse leap the zebra. The Arabs were close on Sir John, and his situation was desperate. Fortunately Charteris saw his peril, rushed to his aid, and turned aside the barrel of a rifle that was being pointed at his brave chief, and cut down another with his sabre. While thus occupied he was attacked by an Arab boy, who speared him in the arm before he, the Arab, was shot. Major Drury, of the 17th Native Infantry, in the endeavour to save one of his disabled men, kept at bay for several minutes some 20 Arabs with his sword, till a wound and the danger of being surrounded induced him to retire. The Rev. Mr. Collins also displayed the utmost heroism. Truly some Victoria Crosses have been well earned in this fight.\n\nAccording to official returns, the loss on Sunday was, exclusive of camp followers, six officers and 94 men killed, six officers and 136 men wounded, and one officer and seven men missing, making a grand total of 250 casualties.\n\nFLIGHT OF OSMAN DIGMA\n\nGeneral Graham, with his entire force, marched on Friday on Tamai, which was occupied after a brief resistance. The column consisted of 150 Lancers, 150 Hussars, 150 Mounted Infantry, 400 of General Hudson's Horse, four guns of the Horse Ar-\ntillery, six Gardner's and two mountain guns, the Grenadiers, the Goldstreams, the Scots Guards, and the Australians. The main body of the enemy's force was withdrawn, but small parties of Arabs kept up a desultory fire, which caused but few casualties. The huts at Tamai were burnt. Our loss was very slight, consisting of one man killed and eleven wounded, two of the latter being Colonials, who thus shed their blood for the mother country. Thus at the spot where, above all others, it was believed that Osman Digna would concentrate his forces, there was nothing to interfere with Sir General Graham's movements. It is evident that the enemy dared not face us in force. We only saw them in small groups, and they were afraid to attack us in the open. Their power was undoubtedly broken, and their spirits crushed. The capture of Osman Digna's camp shows excellent leadership from beginning to end. From Lieutenant-General Sir G. Graham to the Secretary of State for War. (Received April 4, 10 25 a.m.) \"Suakin, April 4, 11 50 a.m. Troops began return march from Teselah zariba at 2 15 p.m. yesterday, and arrived at No. 1 zariba at 5 50 p.m. General Fremantle reports everything most satisfactory. They are now marching back, and will be here with convoy about noon. I consider that the troops of all arms deserve very great credit for the way in which they have borne the fatigues of these two days, and for their readiness in constructing a zariba at end of long march on arrival at Teselah-hill; also for their steadiness and good discipline when under fire during the night and the following morning at the Tamai Springs. The Australian Contingent have cheerfully borne their share of our hardships, and shown themselves worthy comrades in arms. I regret that they have had two men wounded.\" The conduct of the Guards and every Regiment was superb. Lord Wolseley with his magnificent army had conquered the Soudan.\nThe Queen telegraphed to General Graham, through Sir Henry Ponsonby, expressing her great admiration of the conduct of her troops, for whose welfare she feels very anxious. Especial mention is made in the telegram of her Majesty's admiration of the gallant and untiring perseverance displayed by her troops under the most trying and harassing warfare in which they could be engaged. There never was a force of the size of those engaged in these expeditions composed of men from more different latitudes — British, Indian, Egyptian, Soudanese, Kroomen, and lastly, but by no means least, it will always be remembered there were Canadians and Australians. No doubt these latter were few in number, but it is not their number, but the fact of their presence there which has made this expedition memorable, for they have shown, and conclusively shown, that strong and deep loyalty which is the real bond of union between this country and her colonies, and that, at the faintest idea of danger, the colonies will rally around the mother country and fight with her soldiers and sailors wherever they may be required. Strong determination animated them all to preserve untarnished the ancient reputation of the British Army. If we treat our colonies rightly, we have a fund of strength which will enable us in a crisis to face even the known world. General Hudson commanded the Indian contingent, Colonel Denison commanded the Canadian voyageurs, and Colonel Richardson the New South Wales contingent. It is impossible to over-estimate the good conduct of all these contingents. A portion of the Indian contingent especially, had the opportunity of rendering in company with British troops most gallant and most conspicuous services; nothing could exceed the courage, steadiness, firmness, and the soldierlike qualities which were displayed by the Sikh regiments on the occasion of the attack on M'Neill's zariba. Great credit is due\nto His Royal Highness the Duke of Cambridge commander in chief; and the officers connected with the departments at home. It is admitted, on all hands that the commissariat, the transport, and the medical arrangements were made with a completeness and a perfection which have never been surpassed. The greatest possible credit is due to the officers of the departments at home, on whom the duty devolved of purchasing and sending out supplies, and to the officers of departments in the field, on whom devolved the duty of distributing and making use of them for the benefit of the troops. The perfection of the medical arrangements in this campaign has been the cause of mitigating to a great extent the unavoidable sufferings which must be endured on all occasions of this kind, and never has the devotion to their duty shown by the medical officers of every rank been exceeded. The army, one of the most remarkably composite armies that even England has ever sent forth, was called upon to perform a task making heavy demands upon courage, endurance, devotion, and discipline. It responded to the call in a manner that commanded the admiration of all competent observers, both at home and abroad, and that proves with gratifying conclusiveness the persistence of the great qualities to which the English people owe their present position in the world. What the nation has a right to contemplate with peculiar satisfaction is the excellence of the material, the strength and temper of the stuff, of which the rank and file are composed. We all know that no special pains are taken in its selection. It is no military caste, fortified by training and tradition, nor is it even a careful blend of all ranks of the population, as in the case of the German army. It consists, in the main, of men possessing few advantages but such as are the common heritage of the race, reinforced by a course of discipline which certainly does not err on the side of extravagant\nlength or elaboration. But it responds, with unfailing gallantry and success, to demands not merely for the common physical courage of the mass, but for individual versatility and resource, for moral intrepidity in novel and unprecedented circumstances, and for sheer physical effort such as cannot be continuously put forth, except by men who add to muscular strength the finer qualities to which in a horse we give the name of breed. There is no Englishman, however great his personal attainments, who ought not to recognize with proud humility how much he owes to his membership of a race whose common men, picked up haphazard by the recruiting sergeant, can row up a thousand miles of river, cross waterless deserts under a scorching sun, and fling themselves into an impregnable square, when an Arab charge sweeps like a tornado against them.\n\nWe should be sorry to forget for a moment what is due to the men who have directed all this splendid material, and that the more, because many have laid down their lives in the service, and many more who contributed to the result cannot be named in votes of thanks or even be mentioned in despatches. The original conception of the Nile Expedition being put beyond the pale of present criticism by its political character and associations, none can call in question the wonderful foresight, energy, and resource displayed by Lord Wolseley in carrying out the plan. He showed the highest qualities of a great commander in the arduous and complex task. He was ably seconded by Sir Redvers Buller's chief of the staff General Earle, General Stewart, General Brackenbury on whom it devolved to conduct the difficult and arduous retirement down the rapids of the Nile from the advanced post which that force had occupied, Sir C. Wilson, Lord Charles Beresford who performed the gallant feat of arms in rescuing Sir Charles Wilson and his companions from a position\nof almost unparalleled and unexampled danger, and other gallant officers.\n\nFROM GENERAL LORD WOLSELEY TO THE SECRETARY OF STATE FOR WAR.\n\nCairo, June 15.\n\nSir,—1. All the troops on the Upper Nile are now quitting Dongola. Some have already embarked for England, and the others are on their way to their allotted destinations. The withdrawal of our forces to a defensive position on the Wady Halfa Railway in accordance with the orders I have received is now nearly completed. I, therefore, think it desirable that, before leaving Egypt for England, I should place on record my opinion as to the manner in which all ranks under my command have carried out their respective duties. I wish also to bring to your notice the names of some officers who have specially distinguished themselves, almost all of whom I think it would be in the interests of the service to promote while they are still young and efficient.\n\n2. It is a source of great pride to me as a soldier, and of satisfaction as a British subject, that upon each fresh occasion when I am brought in contact with Her Majesty's troops in the field, I find the army more efficient as a military machine than it was the last time I was associated with it on active service. This improvement is evident in all grades and in all arms and departments, but it is, I think, most marked in the rank and file. Military spirit—the essence of military efficiency—is now established in our army in a higher form, and on a sounder basis than formerly. The soldier is prouder of himself and of his calling than he used to be, and his self-esteem has also been raised by the healthy feeling of liberty arising from the knowledge that if the army does not suit his tastes he can easily quit it, instead of being bound to it for 10 or 12 years. Our rank and file are\n\nThe Soudan Campaign, by Major d'Entregues. H. M. Reserve Forces.\nmorally better, and militarily more efficient than formerly. The general conduct and bearing of our men in the Soudan left nothing to be desired, and was not only creditable to the British army, but should be also a just source of pride to the British nation.\n\n3. The physical appearance of the soldiers who assembled at Korti in last December and January spoke well for the efficiency of our present recruiting service. I have never seen a finer body of troops in the field, and both their appearance and the noble spirit which animated them made me feel that I was safe in relying on them to accomplish any enterprise where success was possible. The great bulk of these men had reached Korti in the whalers expressly built in England for the navigation of the Nile, and the bodily training obtained by rowing, tracking, and portaging, gave to these young soldiers the toughness, as well as the outward look, of veterans. No men have ever done harder work than they did, and to their lasting credit, be it said, they did it cheerfully and without a murmur.\n\n4. It would be impossible for any commander to have been more ably seconded by his chief of the staff than I was by Major-General Sir Redvers Buller, V. C., K. C. M. G., C. B. To his already well-established reputation as a daring and skilful leader in action he has now added that for great administrative capacity. When the late Major-General Sir Herbert Stewart was wounded, and Colonel Burnaby, whom I had appointed to command at Metamneh, had been killed, I ordered General Sir Redvers Buller to take command of the desert column, and he carried out to my entire satisfaction the difficult operation of withdrawing it from Gubat to Gakdul in the face of an active enemy — an operation requiring great nicety of execution, and a thorough knowledge of the military art. When I received orders that the army was to fall back from its summer quarters on the Nile to\nthe Wady Halfa Railway, I entrusted him with the details of this movement, which was also most ably effected. I beg to recommend this officer to your favourable consideration.\n\n5. Major-General Sir Evelyn Wood, V. C., G. C. M. G., K. C. B., was the General of Communications, and brought the utmost zeal to bear upon the arduous and difficult duties of the position. Our line of communications by rail, river, and desert from Alexandria to Gubat was about 1500 miles in length. The responsibility of supervising it was great, but, thanks to Sir E. Wood's ability and energy, and to the efficient support he received from the large staff of officers under his command, the army operating in the front was well fed and provided with all it required. The officers and men of the Egyptian army, under General Wood's immediate orders, worked along this line with indefatigable earnestness, and with the best possible results to the welfare of the expedition.\n\n6. It is very desirable to utilize to the full the opportunity which active service affords of gauging the military ability of our officers. Every campaign enables a selection to be made among those whose proved skill in the field and thorough knowledge of their profession mark them out as fitted for higher rank. Brigadier-General Brackenbury, R. A., comes, I consider, prominently under this category, and, in the interests of the Army and the State, I would strongly recommend him to your favourable consideration. When Major-General Earle was killed at Kirbekan, Brigadier-General Brackenbury assumed command of the Nile column, and led it in its advance towards Abu Hamad. In this, and throughout the operations in the Soudan, he proved himself to be one of the ablest officers in Her Majesty's Army, and he would be a most valuable addition to our present list of general officers.\n7. The column intended to operate from Suakin in the direction of Berber, and to construct a railway to that place, was despatched last February, partly from England and partly from India, with a rapidity that was highly creditable to our military and naval organization. Great numbers of camels and other transport animals were safely and quickly disembarked at Suakin during the month of March, and three brigades of infantry and one of cavalry took the field there before the end of that month, destroying Osman Digma's power in the hard fought action of the 22d of March, under Major-General Sir J. M'Neill. The quickness with which this column was organized for active service is most creditable to Sir Gerald Graham, and to the zeal and ability of the officers under his command. He speaks in high terms of the manner in which Major-General Sir George Greaves, K. C. M. G., C. B., performed the duties of Chief of the Staff to his force. I do not believe there is any officer who has a more extensive knowledge of the working of our army than Sir George Greaves, nor one who can use his great staff and administrative experience to better purpose.\n\n8. I attach to this despatch a list of those officers, non-commissioned officers, and men, whose services are, I consider, specially deserving of mention, and in it I have included those of the Suakin force who, I think, have done the best work.\n\n9. The various departments were administered to my entire satisfaction by the following officers: — In the Intelligence Department, Colonel Sir C. Wilson, K. C. M. G., C. B., R. E., kept me fully supplied with information as to the enemy's doings and intentions, and showed himself eminently qualified to conduct the duties of that department. At Suakin similar information was furnished by the exertions of Major Grover and Major Chermside, both of the Royal Engineers. The last-named was Governor-\nGeneral of the Red Sea Littoral, and has rendered valuable service to the State for a lengthened period.\n\nThe Medical Department was administered with ability by Deputy Surgeon-General O'Nial. I have never seen the sick and wounded better cared for. The arrangements were good, and the medical officers worked with untiring zeal and great devotion to their duties. At Suakin Deputy Surgeons-General Barnet and Hinde directed all medical matters with great credit to themselves and to their department. Both there and on the Nile the work done by the nursing sisters was highly appreciated by doctors and patients. The Commissariat duties were well performed throughout, the department being excellently directed by Assistant Commissary-General Hughes. At Suakin Assistant Commissary-General Robinson did good work; all his arrangements were satisfactory.\n\nLieutenant-Colonel Furse, the Director of Transport, carried on his duties in a most creditable manner, and produced good results under considerable difficulties. The system of separating those duties from those of the Commissariat answered admirably. Lieutenant-General Graham speaks in high terms of Lieutenant-Colonel Walton, who was the Director of Transport to the Suakin force, and of Lieutenant-Colonel Bockett, who was in charge of the Indian Transport.\n\nAssistant Commissary-General of Ordnance Pease, on the Nile, and Assistant Commissary-General Skinner, at Suakin, evinced a thorough knowledge of the detail and working of the Ordnance Store Department. All the officers under them worked zealously and well.\n\nOwing to the great length of the line of communications up the Nile Valley, and to the number of stations upon it, the work of the Pay Department was difficult and very heavy. Great credit is due to\nColonel Olivey for the efficient manner in which it was performed. The pay duties at Suakin were satisfactorily carried out by Lieutenant-Colonel Craig.\n\nThe Rev. J. Brindley, the Senior Chaplain with the army up the Nile, won the esteem of all by his untiring devotion to his sacred duties, and by his unfailing and cheerful kindness.\n\nVeterinary-Surgeons Burt and Waters well performed the work that fell to them.\n\nThe Volunteers were represented by men of the Volunteer Engineers and of the Post Office Corps, who, both by their zeal and their soldierlike bearing, sustained the reputation of the service to which they belong.\n\n10. The Indian Contingent, under Brigadier-General Hudson, C. B., showed high, soldierlike qualities, and was of the utmost value in the operations round Suakin.\n\n11. The assistance rendered by the Royal Navy was willingly given, and of the greatest importance. I cannot praise too much the manner in which officers and men under the command of Captain Boardman, R. N., helped us in fitting out boats, in working them over the worst cataracts of the Nile, and in keeping open our line of communications along that river. In previous despatches I have dwelt upon the excellent services rendered by the Naval Brigade, under Captain Lord C. Beresford, R. N., an officer whose readiness of resource and whose ability as a leader are only equalled by his daring. At Suakin Commodore More-Molyneux was untiring in his exertions to help the troops; and the naval transport duties were most successfully carried on, under the direction of Captain Fellowes, R. N.\n\n12. Great credit is due to Colonel Butler, C. B., and to Lieutenant-Colonel Alleyne, R. A., for the care and thought with which the whalers for Nile service were designed and fitted out, under their immediate su-\nperintendence. The experience they had gained in boat work during the Red River Expedition of 1870 enabled them to bring to this matter, and, later on, to their work on the Nile, an amount of special knowledge possessed by few men. Without these whalers, or had they been less efficiently organized and equipped, the assembling of the troops at Korti at the date it took place, and the subsequent advance of the two columns, one across the desert and the other up the Nile, would have been impossible. The great bulk of the provisions taken with the first column, and the whole of those taken with the second, were conveyed to Korti in our English whale boats. In a similar manner the retirement just effected from our positions on the Upper Nile extending from Merawi to Abu Fatmeh would have been extremely difficult save for these boats, as the river at this season is unnavigable by nuggers or other native craft.\n\n13. This is the first time that colonial troops have been employed outside the colonies in any of our wars. The result has been so satisfactory that I earnestly trust the noble and patriotic example set by New South Wales may, should occasion arise, be followed by other colonies. The officers and men of the New South Wales Contingent, under Colonel Richardson, were a credit to their colony and to the parent race from which it sprung.\n\n14. The Dominion of Canada supplied us with a most useful body of boatmen, under the command of Colonel Denison, of the Ontario Militia. Their skill in the management of boats in difficult and dangerous waters was of the utmost use to us in our long ascent of the Nile. Men and officers showed a high military and patriotic spirit, making light of difficulties, and working with that energy and determination which have always characterized Her Majesty's Canadian forces.\n\n15. The officers of my personal staff are named in\nthe margin (Lieutenant-Colonel Swaine, C. B., Lieu-\nColonel Grove, military secretaries; General Zohrab\nPasha, Captain Lord C. Beresford, Royal Navy,\nMajor Creagh, Royal Artillery, Major Childers, Royal\nEngineers, Major Adye, Royal Artillery, aides-de-\ncamp; Dr. Simson Pratt), and I beg to recommend\nthem to your favourable consideration. I cannot lay\ntoo much stress on the valuable services rendered by\nGeneral Zohrab Pasha, of the Egyptian Army. His\nknowledge of Eastern languages, his intimate ac-\nquaintance with the manners and customs of the\nSoudanese people, and his tact in dealing with the\nnative authorities enabled him to assist me in a way\nthat no British officer could have done. Lieutenant-\nColonel Swaine, C. B., Rifle Brigade, was my military\nsecretary, until, unfortunately, his health broke down,\nand to my great regret he had to leave for home. The\nduties of military secretary have since then been car-\nried out by Lieutenant-Colonel Grove, East York-\nshire Regiment, with the greatest ability. He is\nhighly educated as a staff officer; and, previous to\ntaking up this work, had done excellent service\nsuperintending the fitting out of the English whale\nboats at Gemai. To all my aides-de-camp also my\nthanks are specially due.\n\n16. In conclusion I would only add that, though\nthe expedition was not crowned with success, the\nspirit and behaviour of the troops which took part in\nthe operations, whether on the Nile or at Suakin,\nmay be viewed with satisfaction by every English-\nman. The army under my command was unable to\naccomplish the object set before it, and to save the\nlives of the gallant General Gordon and of the gar-\nrison of Khartoum. But this was from no fault of its\nown, from no lack of courage or of discipline, of dash,\nor of endurance. It overcame physical difficulties of\nthe greatest magnitude; it swept from its path in\nevery encounter an enemy almost its equal in bra-\nvery and greatly its superior in numbers; and its advanced guard reached the outskirts of Khartoum only two days too late. No one can regret more than I do the fall of that place, but, in common with all my countrymen, I look back with pride to the gallant struggle made by our troops to save Khartoum and its heroic defender.\n\nI have, &c., WOLSELEY, General.\n\nThe Right Honourable the Secretary of State for War.\n\nENCLOSURE.\n\nList of officers, non-commissioned officers, and men whose services are deserving of special mention:\n\nROYAL NAVY.\n\nCaptain F. R. Boardman, Captain Lord C. Beresford, Commander T. F. Hammill, Commander Julian A. Baker, Lieutenant R. A. J. Montgomerie, Lieutenant Bourke, Lieutenant C. Reeve, Chief Engineer H. Benbow.\n\nCAVALRY.\n\n1st Life Guards. — Lieutenant-Colonel Hon. R. A. J. Talbot, Major the Hon. C. C. G. Byng, Lieutenant D. V. Pirie.\n\n2d Life Guards. — Major the Earl of Dundonald, Lieutenant W. F. Peel.\n\nRoyal Horse Guards. — Captain J. F. Brocklehurst, Lieutenant Sir J. C. Willoughby, Bart.\n\n3d Dragoon Guards. — Major F. M. Wardrop.\n\n1st Dragoons. — Captain F. W Rhodes.\n\n4th Hussars. — Brevet Lieutenant-Colonel H. F. Grant, Captain C. W. Peters.\n\n5th Lancers. — Captain E. C. W. Gilborne, Captain A. C. Little.\n\n7th Hussars. — Colonel H. McCalmont, Captain C. F. Thomson, Captain T. H. Phipps (since dead) Captain H. Paget.\n\n10th Hussars. — Major R. C. D'E. Spottiswoode.\nCaptain the Earl of Airlie, Regimental Sergeant-Major B. Turner.\n\n14th Hussars. — Brevet-Major the Hon. G. H. Gough.\n\n16th Lancers. — Major T. Davison, Private W. Ilsley Private H. Newton.\n\n19th Hussars. — Lieutenant-Colonel P. H. S. Barrow, C. B., C. M. G., Major J. C. Hanford-Flood, Captain J. C. K. Fox, Troop Sergeant-Major W. Beale, Sergeant Chislett.\n\n20th Hussars. — Lieutenant-Colonel C. Mangles, Major F. J. Graves.\n\n21st Hussars. — Captain C. B. Pigott.\n\nROYAL ARTILLERY.\n\nColonel F. Duncan, Colonel H. Brackenbury, C. B., Brevet Lieutenant-Colonel J. F. Maurice, Brevet Lieutenant-Colonel J. Alleyne, Major R. MacGregor Stewart, Major A. E. Turner, Major W. Hunter, Brevet Major F. G. Slade, Brevet Major A. G. Creagh, Brevet Major J. Adye, Captain A. N. Rochefort, Captain H. C. Slater, Captain R. A. Bannatine, Captain G. F. A. Norton, Captain H. M. L. Rundle, Lieutenant J. M. Grierson, Lieutenant F. R. Wingate, Sergeant T. Lee.\n\nROYAL ENGINEERS.\n\nColonel J. B. Edwards, C. B., Colonel Sir C. W. Wilson, K. C. M. G., C. B., Colonel E. P. Leach, V. C., Brevet Lieutenant-Colonel J. C. Ardagh, C. B., Brevet Lieutenant-Colonel T. Fraser, C. M. G., Brevet Lieutenant-Colonel E. Wood, Major G. E. Grover, Major W. Fitz H. Spaight, Major J. F. Dorward, Brevet Major D. A. Scott, Brevet Major H. C. Chermside, C. M. G., Brevet Major H. H. Kitchener, Brevet Major E. S. E. Childers, Captain D. C. Courtney, Captain H. H. Settle, Captain H. A. Yorke, Captain C. B. Wilkieson, Captain F. W. Bennet, Captain G. F. Wilson, Captain A. H. Bagnold, Lieutenant F. C.\nHeath, Lieutenant A. G. Thompson, Lieutenant H. M. Lawson, Sergeant-Major Dalton, Lance-Corporal J. Dale, Sapper W. Leitch, Sapper T. Berret.\n\n**INFANTRY.**\n\nGrenadier Guards. — Colonel R. T. Thynne, Lieutenant-Colonel H. E. Colvile, Captain E. M. S. Crabbe, Captain the Hon. F. W. Stopford, Captain H. P. St. J. Mildmay, Lieutenant J. T. St. Aubyn, Sergeant-Major Hall, Colour-Sergeant G. Ditchfield, Private R. Cragg.\n\nColdstream Guards. — Colonel A. Lambton, Lieutenant-Colonel the Hon. E. E. T. Boscawen, Captain the Hon. H. C. Legge, Sergeant-Major Dickenson, Sergeant-Major Birch.\n\nScots Guards. — Colonel the Hon. W. R. Trefusis, Lieutenant-Colonel Mildmay W. Willson, Lieutenant J. W. A. Drummond, Colour-Sergeant Livesay.\n\nEast Kent Regiment. — Captain R. G. Kekewich.\n\nRoyal Fusiliers. — Lieutenant E. M. Barttelot.\n\nSomersetshire Light Infantry. — Captain H. A. Walsh.\n\nEast Yorkshire Regiment. — Brevet Lieutenant-Colonel C. Grove, Lieutenant Hastings St. L. Wood.\n\nRoyal Irish Regiment. — Lieutenant-Colonel H. Shaw, V. C., Captain H. W. N. Guinness, Lieutenant W. R. B. Doran.\n\nYorkshire Regiment. — Captain F. B. Briggs, Captain H. Bowles.\n\nLancashire Fusiliers. — Lieutenant F. Hammersley.\n\nRoyal Scots Fusiliers. — Sergeant Duggan.\n\nScottish Rifles. — Major C. T. Barrow.\n\nEast Lancashire Regiment. — Captain A. G. Leonard.\n\nEast Surrey Regiment. — Colonel W. H. Ralston. Major F. H. Maturin, Lieutenant J. R. K. Birch, Quartermaster-Sergeant H. Curson.\nDuke of Cornwall's Light Infantry. — Captain H. P. Carden, Lieutenant G. A. Ashby, Lieutenant H. G. Morris, Sergeant R. B. Briscoe.\n\nRoyal Sussex Regiment. — Colonel J. O. Vandeleur, Major M. S. J. Sunderland, Captain L. J. Trafford.\n\nSouth Staffordshire Regiment. — Lieutenant-Colonel H. Beal, Major J. Emeris, Lieutenant H. N. C. Heath.\n\nSouth Lancashire Regiment. — Captain D. P. Chapman.\n\nWelsh Regiment. — Major C. G. Smyth.\n\nRoyal Highlanders. — Colonel W. Green, C. B., Lieutenant-Colonel R. K. Bayly, Captain A. Scott Stevenson, Captain Lord A. Kennedy, Lieutenant J. G. Maxwell, Colour-Sergeant F. Tweedie, Colour-Sergeant T. Connan.\n\nEssex Regiment. — Major F. Ventris, Captain W. G. Carter, Captain H. S. Fleming, Lieutenant R. J. Tudway.\n\nDerbyshire Regiment. — Lieutenant F. R. Gregson (3d Battalion).\n\nBerkshire Regiment. — Lieutenant-Colonel A. G. Huyshe, Captain F. W. N. MacCracken, Quartermaster T. Frod, Sergeant-Major Mathieson, Colour-Sergeant Cloke.\n\nRoyal West Kent Regiment. — Colonel E. Leach, Captain H. D. Armstrong, Lieutenant F. Wintour.\n\nSouth Yorkshire Regiment. — Major A. S. Wynne, Captain G. E. Lloyd.\n\nShropshire Regiment. — Lieutenant-Colonel R. H. Truell, Captain J. H. W. Eyton.\n\nKing's Royal Rifle Corps. — Colonel (local Major-General) F. W. Grenfell, Major C. Holled Smith, Major R. S. R. Featherstonhaugh, Captain Lord F. Fitzgerald, Lieutenant E. J. Montagu-Stuart-Wortley, Lieutenant R. L. Bower, Private B. Fagan.\n\nGordon Highlanders. — Lieutenant C. H. Payne, Sergeant Pitman.\nCameron Highlanders. — Major E. Everett.\nRoyal Irish Rifles. — Captain the Hon F. L. L. Colborne.\nRifle Brigade. — Brevet Lieutenant-Colonel L. V. Swaine, C. B., Captain C. R. Orde, Private G. Wood.\n2d West India Regiment. — Major C. H. W. Tyndale.\n\nROYAL MARINES.\n\nBrevet Major J. H. Sandwith, Brevet Major W. H. Poë, Captain A. C. Pearson, Lieutenant D. J. Kysh, Sergeant-Major Scudamore.\n\nGENERAL OFFICERS AND OFFICERS ON HALF-PAY.\n\nLieutenant-General Sir G. Graham, V. C., K. C. B.,\nMajor General Sir E. Wood, V. C., G. C. M. G., K. C. B.,\nMajor-General Sir J. C. McNeill, V. C., K. C. B.,\nK. C. M. G., Major-General Sir G. R. Greaves, K. C. M. G., C. B.,\nMajor-General Sir R. H. Buller, V. C.,\nK. C. M. G., C. B., Major-General A. J. Lyon-Fremantle,\nColonel H. P. Ewart, C. B., Colonel H. Brackenbury, C. B.,\nColonel H. B. H. Blundell, Colonel W. Arbuthnot, Colonel R. Grant, half-pay, Royal Engineers; Colonel G. B. Wolseley, Colonel W. F. Butler, C. B., Colonel K. G. Henderson, Lieutenant-Colonel G. A. Furse, Lieutenant-Colonel F. T. Lloyd, half-pay, Royal Artillery.\n\nINDIAN ARMY.\n\nBrigadier-General J. Hudson, C. B., Bengal Staff Corps.\n9th Bengal Cavalry. — Colonel A. P. Palmer, Bengal Staff Corps; Major D. H. Robertson, Indian Army; Ressaldar Hakm Singh.\n15th Sikhs. — Colonel G. R. Hennessy, Bengal Staff Corps; Major D. W. Inglis, Indian Army; Captain H. A. Abbott, Bengal Staff Corps; Subadar Goor-dit Singh.\n17th Bengal Native Infantry. — Captain T. E. Spencer, Bengal Staff Corps.\n28th Bombay Native Infantry. — Lieutenant-Colonel F. C. Singleton, Bombay Staff Corps; Captain R. E. D. Reilly, Bombay Staff Corps; Subadar Rama Kurrikur.\n\nBengal Staff Corps. — Brevet Major Norman Stewart; Brevet Lieutenant-Colonel E. S. Walcott, Bombay Infantry, Principal Commissariat Officer; Brigade-Surgeon J. H. Thornton, M. B., Indian Medical Staff, Principal Medical Officer; Lieutenant-Colonel S. Beckett, Bengal Staff Corps, Director of Transport; Major E. H. H. Collen, Bengal Staff Corps, Assistant Military Secretary; Major G. R. J. Shakespear, Bengal Staff Corps, Director of Transport.\n\nAustralian Contingent.\nColonel J. S. Richardson, Lieutenant-Colonel W. W. Spalding, Major Mackenzie, Major Morris.\n\nCanadian Militia.\nLieutenant-Colonel F. Denison, Dr. Neilson.\n\nDepartments.\nChaplains' Department. — The Rev. W. H. Bullock, the Rev. R. Brindle, the Rev. R. F. Collins, the Rev. J. Mactaggart.\n\nCommissariat and Transport Staff. — Lieutenant-Colonel J. L. Robertson, Assistant Commissary-General; Lieutenant-Colonel E. Hughes, C. M. G., Assistant Commissary-General; Lieutenant-Colonel C. E. Walton, Assistant Commissary-General; Lieutenant-Colonel J. T. Skinner, Assistant Commissary-General; Major R. A. Nugent, C. B., Assistant Commissary-General; Major A. A. Backer, Assistant Commissary-General; Major M. E. Rainsford, Assistant Commissary-General; Captain M. Graham, Deputy Assistant Commissary-General; Captain J. Whitley, Deputy Assistant Commissary-General; Captain J. A. Boyd, Deputy Assistant Commissary-General; Quartermaster M. P. Wasp, Quartermaster\nJ. MacLoughlin, Quartermaster W. J. Barrell (Honorary Captain), Quartermaster H. Joyce, Conductor Haycock, Staff-Sergeant P. O'Malley.\n\nMedical Staff. — Deputy Surgeon-General J. O'Nial, C. B. Deputy Surgeon-General S. A. Lithgow, M. D., Deputy Surgeon-General O. Barnett (since dead), Deputy Surgeon-General G. L. Hinde, Surgeon-Major E. C. Markey, Surgeon-Major G. C. Gibbon, Surgeon-Major R. Waters, M. D., Surgeon-Major G. E. Will, Surgeon-Major C. H. Harvey, M. D., Surgeon-Major T. F. O'Dwyer, M. D., Surgeon-Major F. Ferguson, M. D., Surgeon-Major B. B. Connolly, Surgeon T. J. Gallwey, M.D., Surgeon W. H. Briggs, Surgeon J. Magill, Surgeon W. B. Allin, Surgeon H. L. Donovan, M. D., Staff-Sergeant Arbeiter.\n\nOrdonnance Store Department, — Lieutenant-Colonel T. Pease, Assistant Commissary-General of Ordnance; Major E. G. Skinner, Assistant Commissary-General of Ordnance; Captain F. G. Wintle, Deputy Assistant Commissary-General of Ordnance, Captain F. E. Mulcahy, Deputy Assistant Commissary-General of Ordnance; Quartermaster C. L. Sheppard, Conductor P. Mullen.\n\nPay Department. — Colonel W. R. Olivey, C. B., Major R. G. Craig, Major T. W. Drage, Major F. N. Woodall, Major G. T. C. St. J. Kneller, Major A. P. G. Dowdall.\n\nVeterinary Department. — Inspecting Veterinary-Surgeon W. B. Walters, Veterinary-Surgeon First Class W. Burt, Veterinary-Surgeon First Class C. Philipps, Veterinary-Surgeon First Class A. Queripel.\nRIELS REVOLT\n\nI.\n\nIn putting down Riels Rebellion with such rapidity and success Gen. Sir F. Middleton, commander in Chief, showed great energy and ability. He was ably seconded by his staff, Gen. Strange, Gen. Laurie, Col. Otter, Col. van Straubenzee, Col. Williams, Col. Grassett and all the officers and men. And great praise is due to the Marquis of Lansdowne, Gov. Gen., to the Rt Honble Sir John Macdonald, G. C. B., Premier; the Hon. Sir A. Caron, Minister of Militia, the government and parliament, Col. Panet, Deputy Minister of Militia, and Col. Walker Powell, Adjutant General, for their united energetic efforts. The colonies are now bound to England by the bond of affection and loyalty and by self-interest, because there are no communities in the world which possess such free and independent constitutions as the colonies of England. Any scheme of Imperial federation should combine on equitable bases the resources of the Empire for the maintenance of common interests, and adequately provide for an organized defence of common rights. It is not possible, to over-estimate the enormous advantages to Englishmen who live beyond the seas to have the military and naval power of England at their back. There is one condition which is absolutely necessary. It is that the union should imply mutual defence—mutual alliance with common citizenship. If the colonies were asked to contribute their quota to the interest of any loan raised for the naval and military defence of the Empire that would be a real practical step towards federation. Canada is very loyal and her best interests would be forwarded by Imperial Federation. In any\nwar the people of Canada would be ready to take their share of the responsibility and the cost. Federation means peace among all the members of the Empire. It means greater strength for each member of the Empire and the power of aiding and protecting one another. It next means a common career for every British subject, for every citizen, and that is no slight thing for the colonies. The political and commercial value of the Canadian Pacific Railway will be incalculable. Among its more perceptible political results will be the strengthening and hastening of the operations of the Army and Auxiliary Forces in Canada, Australia, India, and the Eastern Colonies, and of the Navy on the Pacific, Australian, Indian, and China stations. It will also facilitate the quelling of disturbances in the vast dominion through which the line passes. The length of the railway is 2870 miles. It runs through British territory, and will be in communication with the eastern provincial railway systems of Canada. Ninety-five days were required to move the men from Toronto to Winnipeg, about the centre of the Dominion, in 1870 to suppress the Red River rebellion. In 1885, in 15 days, Sir A. Caron called into the field a thousand organised Volunteer troops, with 400 horses; furnished them with transport to the seat of war, 2000 miles distant, and pushed forward three columns, widely separated, to points hundreds of miles from the railway. The Minister, moreover, kept the troops supplied, and covered an immense frontier. The Hon. Sir A. Caron, Col. Panet and Col. Walker Powell had difficult tasks to perform, and they performed them in a manner worthy of the highest praise.\n\nII.\n\nOne of the greatest difficulties is to get supplies of all kinds. The larger the force the greater the difficulty. Soldiers must be well fed.\nman Army, which is a perfect instrument, has been greatly increased, and the Emperor is supported by great men like Prince de Bismarck, Count de Moltke, Count de Blumenthal, von Kameke, v.d. Goltz, etc. The French Army, now a magnificent force, has also greatly increased and possesses great and distinguished officers like Gen. Campenon, Duc d'Aumale, Duc d'Auerstedt, the Marquis de Galifet, Faidherbe, &c. Russia and Austria also possess enormous armies. Something more powerful and terrible than powder will probably be used. Repeating Rifles and improved weapons, steering Balloons and telephones are already used. It is possible that in the next great war two, or even three millions of men may be put in the field on both sides, with two or three hundred thousand cavalry and 7000 guns. But even with all the new inventions, improvements and great ability of the distinguished men just named, it will be one of the most difficult tasks to get supplies for such enormous armies in the field.\n\nIII.\n\nNORTH WEST FIELD FORCES\n\nSTAFF:\n\nMAJOR-GENERAL SIR F. MIDDLETON, GENERAL COMMANDING.\n\nLord Melgund, Chief of Staff; A D C's, Capt. Wise, Lieut Doucet, Lieut Freer, Lieut-Col Van Straubenzie, Commanding Infantry Brigade; Major-General Strange, in Command 3rd Division; General Laurie, in charge of depot at Swift Current; Lieut-Col Whitehead, Quartermaster-General; Lieut-Col Forrest, Quartermaster-General 1st Division; Major McGibbon, Quartermaster-General 3rd Division.\nGovernor-General's Body Guard.\n\nStaff — Lieut-Col. G. T. Denison, Commander; Lieut. W. H. Merritt, Acting Adjutant; Quarter-master Chas. Mair; Assistant-Surgeon, Jas B Baldwin.\n\nA Troop. — Captain Clarence Denison; Lieut T Blair Browning, Sergeants Charles Grainger, W Tilley, T McGregor, H J M Wilson; Corporal's R A Donaldson, A E S Thompson, H Hancock, A Stretton; Troopers Edmund Kershaw, Geo Pearsall, John Woodburn, P Miley, Geo Pearson, Percy Newton, E Stinson, R Grainger. J Skaith, F Flint, J Walsh, Fred W Kane, J F McMillan, A Risch, Donald Mac Intyre, W H Craig, E J Murphy, H C Simms, A Dent, T Bills, S E Guest, J Bennet, A E Denison, H H Drury, W Coldham, H E Scholfield; Farrier Sergt, Chas Black; Trumpet Major, F. Bacon.\n\nB Troop. — Major Dunn, Lieut Fleming; Regimental Sergt.-Major, Geo. Watson; Troop Sergt.-Major, John Watson; Staff Sergeants, W L Rain, John Schmitt; Corporals (band) Mathew Ryan, John B Eager, Robert M Corrie, W D McNabb; Lance-Corporals, Alfred Richardson, John Tilley; Troopers Wm Hurst, C G Watts, Wm Latham, Max Sterne, W J Richie, Thos Anderson, W W Baby, Daniel O'Connell, Jas Nelson, R E Bell, Geo. Cornell, Peter Doherty, Walter Douglas, N C Weatherstone, Wm Felton, D H McKay, Edward Klien, Geo Hunter, F Chadwick, James Bain, Walter Beavan, Geo Sparrow, John J Hamilton, Stuart Harvey, H Bredin, J A G Gray, Douglas Matherson.\n\nThe Governor-General's Body Guard was first raised during the war of 1812 by Colonel Geo. T. Denison, grandfather of the present commanding officer, and has always been under the command of one of the family. When first raised it was known as the York Light Dragoons. It is a dashing, splendid Cavalry Regiment. Cavalry School Corps, Colonel Turnbull 40, Win. Tp. Cavalry,\nCapt. Knigot 40, Mounted rangers, Capt. Stewart, 160 to 200, Mounted Corps, Lt-Col. Boulton 60, Cavalry scouts, Lt-Col. Houghton 12, Mounted men... Major General Strange, M. and B. Batt., Col Montizambert 200. No 1 Battery Quebec Garrison Artillery. Captain Roy Six batteries of the Montreal Garrison Artillery, numbering 278 men under command of Lieut. Col. Oswald, Toronto Garrison Battery, Cap. McMurrich, Toronto Field Battery, Major Gray. Win. Field Battery, Major Jarvis 63, Capt. Howard, Gatling guns.\n\n1st Battalion Governor-General's Foot Guards, Ottawa.\n\nOne company of Sharpshooters called out 30th March, 48 men, 3 officers — Capt Todd; Lieutenants Gray and Todd, Staff-Sergeant Newby; colour-sergeant Ross; Sergeants Winters and Taylor; corporals Davis, Nash, and Tasker; Privates Bunnell, Brophy, Boucher, Bovill, Chester, Cassiday, Cameron, Chepmell, Cunningham, Clark, Fuller, Firth, Hamilton, Jarvis, Kingsley Looney, H H May, J V May, McQuilkin, McDonald, McCarty, Matheson, McCracken, Mullin, Nash, Pardy, J Patterson, W Patterson, Ring, Sparks, Rogers, J D Taylor, Wiggins, Weston; Buglers Cowan and Modener, Troopers Bell and Humphrey, Princess Louise Dragoon Guards; Sergeant Dunett, Field Battery; Staff-Sergeant Rogers, Private Osgoode, 43rd Rifles.\n\n2nd Battalion Queen's Own Rifles.\n\nCalled out on 27th March, 257 men, 18 officers. — Lieut-Col Miller; Major Allan; Adjutant captain Delamere; Surgeon Dr Lesslie; Assistant Surgeon Dr Nattress; Paymaster captain Blain; Acting Quarter-master-Sergeant Heakes; Sergeant-Major Cunningham; Supply Officer Lieut-Col Lamontagne.\n\nA company. — Sergeants F Kennedy, W W S Howard; corporals C Aldridge J A McMaster.\nB company. — Lieutenant A W Scott; Colour-Sergeant G E Cooper; Sergeant L D Merrick; corporal Dinsmore.\n\nC company. — Captain Hughes; col-sergeant Warrington; Sergeant Chator; corporals Thompson, Staton, Lee.\n\nD company. — Captain Macdonald; col-sergeant S C McKell; Sergeant Strachan; corporals Dingwall, Smith, Bunton.\n\nE company. — Captain Kersteman; lieutenant Mutton; sergeants A Robertson, F Robertson; corporals Hector, McPherson.\n\nF company. — Captain J C McGee; lieutenant Lee; sergeants McLaren, Baird; corporals Robinson, McIntosh, Gibson, Douglass.\n\nG company. — Lieutenants Brock, George; sergeants Townsend, Langtry; corporals McKay.\n\nH company. — Captain Sankey; lieutenants R S Cassels; sergeant World; corporals Fuller, Green.\n\nI company. — Col-sergeant J Crean; corporals W. G Kennedy, Higginbotham.\n\nK company. — Lieutenant E Gunther; sergeant H W Mickie; corporals H B Cronyn, G H Needler, A B Thompson.\n\nBuglers. — Bugle-major C Swift; sergeant J McEvoy; corporals Wm Bryden, F Elliott.\n\nAmbulance corps. — Surgeon Dr Lesslie; Hospital sergeant Pringle; Hospital corporal Fere; privates Bell, Boyd, Batting, Bain, Roberts, Torrance, Thompson.\n\nPioneer corps. — Corporal Harp; Pioneers Doctor, Bateson, Cameron, Brash, J Bromley, Cunningham.\n\n7th Battalion \"Fusiliers\" London.\n\nCalled out 7th April, 237 men, 20 officers. — Staff. — Lieut-Col Williams commanding; majors A M Smith, W M Gartshore; Adjutant Geo Raid, Surgeon.\nDr Fraser; Quartermaster, Capt J B Smith; Supply officer, Capt Hudson.\n\nA company. — Capt Mackenzie, lieutenants Baty, Eazan; col-sergt Jackson, sergt Beecroft, corp Arthur Pugh.\n\nB company. — Captain Butler; lieutenants Chisholm, Gregg; colour-sergt Gould; sergeants McLintock, O'Rourke; corporals D Dyson, James Gould, Brown; sergeant McCouther (pioneer); lance-corporals Graham, Andrews.\n\nC company. — Captain Tracey; lieutenant Payne; sergeants Anundson, Anglin; corporals Graham, Wanless, Kirkendale; lance-corporals Fysh, Dignam.\n\nD company. — Capt Dillon; lieut Hesketh; sergts A McDonald, W Owens, McGregor; corporals Mills, Lowe, McBeth.\n\nE company. — Captain Peters; lieuts Jones, Fope; col-sergt Jacob; sergeants J Summers, J Neilson; corporals G Apted, H Rowlands, P Fields.\n\nF company. — Sergeant-major Byrne; col-sergt Line; sergeants Harris, T W Stanfield; corporals Black, Thomas H Hills; Buglers Insell, Weir.\n\nG company. — Col-sergts Alex. Borland; sergts J J Lynch, Fred Fuller; corps W Harrison, Frank Lynan, T H Packinson; lance-corporals Wm Essex, G Terry, T Borland.\n\n10th Battalion \"Royal Grenadiers\" Toronto.\n\nCalled out on the 27th March, 250 men, 17 officers. — Col Grassett in command; major Dawson; No 1 Capt Caston; lieut Howard and lieut Gibson; No 2, Capt Mason; lieuts Irving, Hay; No 3, Cap Spencer; lieut. Fitch and Morrow; No 4, Capt Bruce; lieuts Elliott and Michie; adjutant, Capt Manley; Acting Quartermaster and Paymaster, lieut Lowe; assistant surgeon Ryerson.\n\nNo 1 company. — Col-sergeant Francis; sergeants Over, Goodman, Davis, Magner; corporals G Craig,\nW Rodgers, W Small, J Foley, Thrush, A Moore.\n\nPrice.\n\nNo 2 company. Alkens, Blake, Burroughs, Bruce.\n\nNo 3 company. — Colour-sergeants Dale, Knight; corporals Fowles, Moore, Whiteacre, Johnson, Marsh, Dickson, Taylor, Butcher, Boulton, Hicks, Gray.\n\nNo 4 company. — Colour-sergeant Cusack; sergeant Kitchener; corps Armstrong, Currie, Locke; staff-sergeants Quina, Hutchison, Hazolton.\n\nPioneer corps. — Pivates Belz, Golden, Sheppard.\n\nDrum corps. — Sergeant Bewly.\n\nMIDLAND BATTALION\n\nCommissioned on 30th March, left for front 6th April, 342 men, 34 officers. — Lieut.-Col. A. T. H. Williams commanding; Senior major H. R. Smith; Jr major Col Duncon; Paymaster, J. Leystock Reid; adjutant E Ponton; Quartermaster Capt J P Cleenes; Surgeon Dr Horsey, Ottawa; Assistant Surgeon Dr Might, Port Hope; Supply officer lieut.-col Macdonald; Sergeant-major T L Sproule; Quartermaster's Asst L J Burrows; Quartermaster's Clerk, L V Macdougall; Hospital Sgts David Carson, Port Hope; Orderly Room Clerks John Hooper, P M S W Stewart; No 5 Company (45th) — Major Hughes, Capt Grace; No 6 Company (40th) — Capt Bonnycastle, Capt Giles, lieut Bliss, Ottawa; No 8 company (47th) — Capt Kelly; lieuts Hubbelt, Sharp. Attached. — Lieuts R J Cartwright, G Laidlaw, H C Ponton, A M Tomlinson, C E Cartwright.\n\nCompany G — Capts Howard, Thos Burke; lieuts Brennan, J Welter, R M C; col-sergt Percy-Myles, 8th R R; sergts A F Tytler, Geo K. Mark; corporals A B Rogers, S Hendren, Jacob Roberts.\n\nNo 7 company, 15th battalion. — Captain Lazier; lieutenants J Helliwell, C E Kenny; col sergeant Wighton; sergeants Maiden, Alex Robinson; corporals H James, J W H Belcher.\nCaptain E. Harrison; lieutenants H A Yeomans, R J Boll; col-sergeants A H Smith, Geo Wilson, E G Bowen; corporals S J Hilton, James Merrill, P Howe.\n\nPort Hope. — Capt and bat-major Rod Dingwall; lieuts R Wallace, capt T B Evans, Ottawa, and Smart, Port Hope. Non-commissioned-officers: — Thos Barker, Robt Bever.\n\nMillbroke and Manvers company. — Capt Chas H Winslow; lieuts H F Miller, J V Preston; col sergeant Fred McCurry; sergeant John Beatty; corporals Robt Lamb, Wm Guy, M H Sisson.\n\nYORK AND SIMCOE BATTALION\n\nCommissioned on 30th March, started for front 2nd April, 342 men, 34 officers.\n\nStaff. — Lieut-colonel O'Brien: majors, lieut-cols Tyrwhitt, Wyndham; adjutant-captain W. Hunter; surgeon L T Smith; asst-surgeon, J L G McCarthy; supply-officer, lieut G H Bute, G G F G; Quarter-master; major Ward; No 1 co — Major Graham, lieut Landrigan, lieut Banting; No 2 co — major Burnett, lieut Drinkwater, lieut L Burnet; No 3 co — captain Leadley, lieut L Shannon, 1st battalion G G F G, lieut Ramsay; No 4 co — Capt Campbell, lieut C Spry, lieut Lennon; No 5 co — capt Thompson, lieut Ven- nel; No 6 co — capt Brooke, lieut Symons; No 7 co capt Smith, lieut Both, lieut Fleury; No 8 co — major Wayling, lieut Laslie, lieut Allan.\n\nParkdale.— Corps J H Smith, John Malcolm; lance-corporal Thos Gilmour.\n\nRiverside. — Staff-sergeant Brown; colour-sergeant John Ridout; sergeant Bell; corporals J Foot, G Brown; lance-corporals Sonthstead, J. Robinson.\n\nYorkville. — Sergeants Fraser, Remington; corporals Greenho, Bell.\n\nSeaton Village.— Staff-surgeon McGreal; sergeant Grealis; corporal M Connors, E Grealis.\nNewmarket.—Sergeants Kavanagh, Bogart, Wernham; corporals Keetch, Ferry.\n\nAurora.—Quartermaster sergt Collett; col-sergt Taylor, sergts Price, DEgo, Farr; corps Montgomery, E Hand, John Ego, O'Brian.\n\nNo 1 company.—No 1 co-sergts Anson, Kiel, Murt, McCarty, A C Barraud, Neilly; corps Wm Healy, H Bushnell.\n\nNo 2 company.—Sergeants T Sallons, E Crockford, Stewart, Burnett; corporals Thos Reid, Joseph Dunham.\n\nNo 3 company.—Sergeant-Major Sydney McDougall; col-sergeant Malcolm McDougall; sergeants William Campbell, James Kirkup, E McIntyre; corporals Wm Holdsworth, J Halliday.\n\nNo 4 company.—Sergeants W Gilkinson, C H Dunning.\n\n65th batt., Col. Ouimet 400. 9th battalion, Col. Amyot 280.\n\nCol Ouimet and Col Amyot had the honour to command two of the finest battalions that went to the North-West. Their members conducted themselves as true soldiers throughout the campaign, undertaking every duty in the most cheerful manner.\n\nHal. Pro. En. Col. Brenner. Intel. corps, capt Dennis 50. 90th batt major Mackeand 323. Company at Regina, lieut-col Scott 40. Company at Birtle 40. 8 companies, Col. Osb. Smith 336. 6 co's Manitoba, lieut-Col Scott, M P 366. 8th battalion, two companies. 63rd battalion, Halifax, Col Mackintosh. 62nd battalion, St-John, Col Blaine.13th battalion, Col Skinner. 35th batt, Col O'Brien 360. C int. Schl. corps, Col Otter 80. Co at Battleford, H Gisborne 40. Company at Emerson Chas Whitman.\n\nCol Irvine with 300 men defended Prince Albert. If it had been necessary the following brave Regiments were ready to go under Col Worsley: the Royal Scots, 257; Prince of Wales rifles, 238; 6th fusilers,\n249; Victoria rifles, 298; cavalry, 30; engineers, 30. These, with the Field battery, brought up the strength of the brigade to 1,400. Also, the following brave Regiments under command of Col Harwood, D A G of the Sixth District, and lieut-col G A Hughes, brigade major. The 64th, of Beauharnois; 70th, of Chateauguay; 80th, of Nicolet; 84th, of St. Hyacinthe; 85th, of Laprairie, and 86th, of Louisville.\n\nAmbulance corps: Dr Powell, son of the adjutant-general, assistant surgeon, Dr Roddick, Toronto, Dr Douglas, Victoria, &c., &c.\n\nLieut-col Jackson, D A G, London, commissariat officer; lieut-col La Montagne, D A G, headquarters staff, commissariat officer of the Toronto force, lieut-Col D A Macdonald, militia department, commissariat officer; lieut-col Forest, Quebec, commissariat officer to lieut-col Montizambert's command; Dr Jas A Grant, Jr, med. officer to lieut-Col Montizambert's command.\n\nIV.\n\nSir John Macdonald's only son (Hugh John) is a lieutenant in the Ninetieth foot.\n\nStaff-sergt. McDougall, son of the Hon William McDougall, was with the Midland battalion under Col Williams, M P. Had the voluntary services of twenty times the number of those accepted been asked for, a few hours time would have sufficed to supply it; and we have no hesitation in saying that had the entire local Force been ordered out the response to the bugle call \"to arms\" would have been obeyed with that alacrity which was a distinguishing characteristic of the troops who served through the campaign.\n\nAmongst those most conspicuous on the field was Gen. Middleton, who posed himself on the rebel fire with great sang froid, and during the heat of the engagement received a bullet in his hat. Lieut. Doucet, aide to the General, was wounded in the arm at an early hour, but Capt. Wise, the other aide, remained\nunhurt until a late hour, and by his cool daring won the admiration of all. Twice he had his horses shot under him, and each time he escaped injury by a miracle almost. About four o'clock he received a bullet in his foot below the ankle joint, and calmly sat chewing a piece of hardtack whilst the surgeon extracted it.\n\nLieutenant-Governor Masson subscribed 200 dollars towards the support of the families of the volunteers belonging to the 9th battalion at the front. In the Legislature Hon. Faucher de St. Maurice, member for Bellechasse, suggested that the members instead of giving a ball as proposed should hand the funds to the committee formed to relieve the families of those men of the 9th battalion left without means of existence. The suggestion was unanimously adopted.\n\nOfficers and men showed discipline, pluck, gallantry and valour. Their conduct was above all praise, it was worthy the reputation of veterans. They came back crowned with complete success, praised by Gen. Middleton, their veteran, intrepid and gallant commander, and covered by the well-earned plaudits of the entire Dominion and the British Empire. Col. Otter was in command at the Cut Knife Hill engagement. Than Col. Otter Canada has no more capable gallant soldier.\n\nThe \"Sharpshooters\" are proud of such gallant officers as major Todd, who commanded them during the campaign, lieut. Gray and lieut. Todd. And when the news of the Cut Knife Hill fight came, all heard how her representatives had upheld the honour of the city of Ottawa.\n\nColonel Otter's force met Poundmaker's band on Saturday and defeated them with great loss. The Indians were driven from their camp and part of their camp burned. Otter's loss was 8 killed and 13 wounded. The Indian loss is known to have been 100 Warriors. The battle lasted from 5 in the morning till noon.\nThe veteran major-gen. Strange while in command in the North-West felt that Col. Otters force was the other side of the nippers which should have crushed Big Bear, and he eagerly listened for the unerring ring of the Sharpshooters rifles. He looked upon that force as the other complement of his own. Gen. Strange handled his force with ability.\n\nV.\n\nCopy of the Official Reports of Major-General Middleton, C.B. (commanding the North West Field Forces) relating to engagements at Fish Creek, April 24, 1885; Cree Reserve (Poundmaker), March 2, 1885; Batoche, March 9, 10, 11, and 12, 1885, with list of Killed and Wounded.\n\nFISH CREEK.\n\nNorth West Field Force, Head Quarters,\n\nSir,\n\nFish Creek, May 1, 1885.\n\nI have the honour to state, for the information of his excellency the Governor-General and yourself, the following particulars of the engagement between my force and that of the rebels on the 24th of April last, which I have been unable to do before, except by telegraph, owing to having so much to do in reconnoitring, getting up supplies, and making arrangements for the movement of the troops in the other parts of the North West Territory.\n\nI had previously informed you of the division of my forces, and on the morning of the 23rd both columns advanced on the two sides of the river, with the scow moving down between them. We halted about eighteen miles down the river, my column near the farm of a settler named McIntosh, the other in a line with us on the other side. After a quiet night, we started on the morning of the 24th at about 7 a.m., with the usual military precaution.\n\nMounted Infantry scouts spread out well in front,\nwith support of Mounted Infantry under Major Boulton, about 200 yards in rear. An advance guard of the 90th battalion about 300 yards in rear of that, and the main column about 200 to 300 yards in rear of the advanced guard.\n\nThough I had not been led to believe that the rebels would not come so far to the front to attack us, still I was aware of the existence of a rather deep ravine or creek about five or six miles ahead, consequently I was on this occasion, with the support under Major Boulton, accompanied by Captain Haig, Royal Engineers, assistant quartermaster general, and my two aides-de-camp captain Wise and lieutenant Doucet, and Mr MacDowell attached to my staff. On approaching some bluffs just as the left advanced scouts were circling round, we suddenly received a heavy fire from a bluff and some ground sloping back on our left, which fire was luckily too high to do mischief, having been evidently fired in a hurry owing to the approach of the left scouts. Major Boulton instantly ordered his men to dismount, let loose their horses (two of which were immediately shot), and hold the enemy in check. This was done by them most gallantly — the flankers and files in front falling back on the main body. I sent captain Wise back with orders to bring up the advanced guard and main body, which was soon done, though in going with the order captain Wise's horse was hit by a shot from the bluffs on the left. The advanced guard, on arrival, extended and took cover in the bluffs nearest us, and as the main body came up, two more companies of the 90th were extended, the rebels advancing up out of the ravine, into which, however, they again speedily retired and a heavy fire was exchanged, but having sent a party round to a house on the enemy's right the enemy gradually retired along the ravine, while our men advanced slowly to the crest of a deeply wooded part running out of the main ravine.\nIn this former ravine a small party of the rebels made a stand in what we found afterwards to be some carefully constructed rifle pits. These men were evidently their best shots — Gabriel Dumont being amongst them, but were, so to speak, caught in a trap. A great number of their horses and ponies being in this ravine, and, what is said to be very unusual, were tied up, thus showing, I am informed, that the rebels were pretty confident of success; 55 of these horses were killed. These men were gradually reduced in number until, from the position of our men, it was almost impossible for them to retire, and they continued to fire at intervals, doing a good deal of mischief. Captain Peters with great pluck and dash led the dismounted men of the A Battery, supported by a party of the 90th, under captain Ruttan, and gallantly attempted to dislodge them, but they were so well covered and were able to bring such a heavy fire on the party advancing without been seen, killing three men, two artillery men and one of the 90th (the body of one artillery man was afterwards found within eight or ten yards of their pits) that I resolved to leave them, contenting myself with extending more of the 90th in front to watch them and sending some shells into the bluff now and then. Lieutenant-colonel Houghton, my deputy adjutant-general, in taking orders got mixed with this party and advanced with them, showing great pluck and coolness. I would here beg to notice the pluck and coolness displayed by other officers (especially captain Drury) and men of A Battery in running their guns up by hand to the edge of the ravine and the opposite gully afterwards, three of the men being wounded. In the meanwhile, having seen the part of the 90th extended as above-mentioned, I galloped across to the right, having previously sent my two aides-de-camp there with orders to get C half-company and two companies of the 90th extended. On arrival there I found\nthat the enemy was in force, trying to turn our right, having set fire to the prairie as the wind was blowing towards us. About this period captain Drury, of A Battery, threw a shell into a house, some distance off where some rebels were seen congregating, and set it on fire. The rebels at this time advanced under cover of the smoke out of the ravine, which extended across our front, and the firing was tremendously hot. My aide-de-camp, lieutenant Doucet, and several men being hit, our men were forced back here a little at first, but soon rallied and advanced steadily, holding their own and taking cover well, until using the enemy's own tactics we fairly drove them back bluff by bluff, and they retired, all together, going off as hard as they could. I may mention here that their attempt to drive us back by setting fire to the prairie proved a failure, though at one time it looked awkward, but I sent for a party of teamsters, who soon beat it out, notwithstanding they were for a short time under fire.\n\nBy about 2 p.m. the enemy had disappeared and all firing ceased, except from the men in the ravine, who seemed by their voices to be reduced in number, and whom I endeavoured to reach by means of the guns from the opposite side of the ravine. I think successfully, from the amount of blood found afterwards in the pits, and a dead Sioux found near there. To return to the action of the left flank. On recrossing to them I received a bullet through my fur cap from one of the men in the rifle-pits, who had made several attempts to hit me before, and whom I have reason to believe was Gabriel Dumont himself, and who a few minutes after, being obliged to recross with my aide-de-camp, captain Wise, shot from the same place his horse and threw him. Shortly after, I am sorry to say; while looking over the brow of the ravine to see if the enemy were still there, captain Wise received a shot in the foot. I found the firing\nreduced to the men in the ravine, the rest of the enemy having retired in confusion.\n\nDuring the action a messenger from the left column arrived, asking if they should bring troops across, and I directed the 10th Grenadiers to be brought over, which was done, by means of the scow, most expeditiously; one company, with Lord Melgund, arriving about 1 p.m., and two other companies, under lieutenant-colonel Grassett, later on, with the two guns of the Winnipeg Field Battery, under major Jarvis. As the affair was nearly over then, I contented myself with extending a company of the 10th on the right centre, to assist in watching the ravine where the enemy's rifle-pits were, the other companies being on the extreme right in support, and ultimately remaining there until the wounded were removed to the camp-ground, which had been selected in the meantime. I would here beg leave to draw particular attention to the crossing of these troops, who, though luckily not required, might well have been. To fully appreciate the rapidity with which this was done, in spite of the difficulties that existed, the river must be seen. Wooded heights on each side 100 feet high — at bottom large boulders encrusted in thick sticky mud — a fringe of huge blocks of ice on each side, a wretched scow, carrying about sixty men at most, pulled with oars made with an axe, and a rapid current of about three or four miles an hour, were the obstacles that were surmounted by dint of determination and anxiety to join with and aid their comrades.\n\nMeanwhile a sort of zareba had been formed by Mr. Bedson and Mr. Secretan of a few wagons, where the doctors formed their temporary hospital, and carried out their functions skilfully, coolly, and quietly, under the able superintendence of brigade-surgeon Orton, 90th battalion. A little later, finding the firing had ceased, and the enemy fled except the two or\nthree whom I left there for the reason above mentioned, and as a thunder storm was coming up—having removed the dead, and sent off the wounded we pitched camp amidst a severe thunder storm in an open spot close to the scene of the fight, which had been selected by Lord Melgund as above mentioned. I append an official list of killed and wounded, which I regret is so large, but which is not larger than might be expected considering the circumstances under which we were attacked, and the fact that not a man in the force but myself had ever before been under fire. Moreover I had only about 350 men in action, and I estimate the enemy at about 300 — as regards their loss all we actually found on the field was three dead Indians, but I am confident they must have sustained a tolerably severe loss as they would not have abandoned so strong a position, and one from the amount of food we found in the different houses they evidently expected to occupy for some time. Moreover, after crossing the creek, the trail was so situated as regards numerous bluffs, running at right angles to it, that they could have impeded my advance with a very few men. I am afraid I shall have to stay some days in my present camp, until I can send my wounded to the rear. All my troops, officers, and men, behaved well, and my thanks are due to all of them and to their several commanders, but I beg to mention by name those officers, who came especially under my personal notice, and to whom my great thanks are due, viz., captain Haig, R.E., my assistant quartermaster-general. My two aide-de-camps, captain Wise and lieutenant Doucet, who gave me great help and assistance. Major Smith, C company, I. S. corps; major Boswell and captain Buchan of the 90th battalion, who were of great help to me in holding the right, and eventually forcing back the enemy under a very heavy fire. Major Boswell was hit in the heel of his boot, and captain Bu-\nchan's horse received a shot. Major Boulton's coolness and firmness in checking the enemy at the commencement of the engagement, was remarkable and deserves great praise. Messrs. Bedson and Secretan, also were of great assistance in forming a zareba of wagons round the place, selected by the medical men for their temporary hospital, which was almost under fire of the enemy. My thanks are also due to brigade surgeon Orton, 90th battalion for the excellent arrangement made by him for attending to the wounded, and removing them to our new camp. The men employed as ambulance men also performed their duty well, not hesitating to bring away the wounded under fire. I cannot conclude without mentioning a little bugler of the 90th regiment, named William Buchanan, who made himself particularly useful in carrying ammunition to the right front when the fire was very hot, this he did with peculiar nonchalance, walking calmly about crying \"Now, boys, who's for cartridges?\"\n\nAnd also herewith a rough sketch of the scene of the action drawn by assistant quartermaster-general Captain Haig, Royal Engineers.\n\n(Signed) Fred. Middleton,\nMajor-General, Commanding Canadian Militia and N. W. Field Force.\n\nP.S. — May 13th. I find from papers captured at Batoche yesterday, that the number of the rebels at Fish Creek was 280, under Gabriel Dumont, that they had intended to let me enter the ravine or crest and then destroy us, taking me prisoner and holding me as a hostage to assist them in making terms with the Government at Ottawa. Their scheme was defeated by my having my scouts so far in advance, which obliged them to fire on them, and thus disclose their position. I also find now that the rebels had 11 killed or died of wounds, and 18 wounded at Fish Creek.\n\n(Signed) Fred. Middleton.\nOfficial List of Killed.\n\nA Battery. Gunner C H Damanolly, W Cook.\n90th battalion. Private A W Ferguson, James Hutchins, George Wheeler, William Ennis.\n\nOfficial List of Wounded Seriously.\n\nA Battery. Gunner E Moteau, C Armsworth, Driver M Wilson.\n90th regiment. Private David Hislop, corporal J E Lethbridge, private C H Kemp, lieutenant Charles Swinford.\nC company infantry school corps. 49 private Robert H Dunn, 165 Arthur J Watson, Boulton's Scouts, trooper Val Bruce, Perrin, J Langford, C King, Baker Darcy.\n\nWOUNDED.\n\nA battery. Staff Sergeant S W Monhinney, Acting-Bombardier D Taylor, Gunner A Asselin, W Woodman, A Weneric, N Ouillet, W Langerell, Driver J Harrison, I Turner.\nC company J. S corps. 59 private R Jones, 142 E Harris, 26 E J McDonald, 71 Harry Jones, 28 colour-sergeant R Cummings.\n90th battalion. Private Miles Riley Jones, corporal John Code (died of wounds); captain W Clarke, private A S Blackwood, N Cantiff, E Lowell, W W Mathews, Joseph Chambers, corporal W Thacker, private Charles Bouchette, corporal J W C Swan, H H Bowden.\nBoulton's Scouts. Captain Gardner, sergeant Alex Stewart, trooper F H Thompson.\n\nTotal Killed or Died of Wounds 10. Wounded 40.\n\n(Signed) Fred. Middleton,\nMajor-General, Commanding Canadian Militia and N W Field Force.\nCUT KNIFE HILL\nEngagement with Poundmaker.\n\nSir,\n\nBattleford, May 26, 1885.\n\nI have the honour to forward herewith for the information of His Excellency the governor-general and yourself Lieu.-Col. Otter's Despatch, concerning his engagement with the Chief Poundmaker and his band, on the 2nd of May last. Though lieutenant-colonel Otter made this attack under a misunderstanding of my orders on the subject, he and his men seem to have done their duty well, and are deserving of great praise, and had the force been larger the consequence might have been more decided.\n\nI have, &c.\n\n(Signed) Fred. Middleton,\nMajor-General, Commanding Canadian Militia and Forces in the Field N. W. Territory.\n\nVI.\n\nFrom Lieutenant-Colonel Otter, Commanding Battleford Column N.W.F.F. to Major-General Middleton, Commanding Militia of Canada.\n\nSir,\n\nI have the honour to report that, having learned on the 29th ultimo from my scouts that a force of Cree and Stoney Indians, numbering about 200 men, were camped near the reserve of the former tribe, some 38 miles from here, and subsequently that Poundmaker, the Cree chief, was hesitating between peace and war, the latter eventually depending upon his being able to obtain assistance from Big Bear's tribe, I felt it necessary that definite action should be taken in order to make Poundmaker declare himself, and prevent a junction of the forces of the two chiefs.\n\nI determined on a reconnaissance in force, and left Battleford on Friday, the 1st instant, at 3 p.m., with the following troops, viz.: —\n75 Md. Police, of whom 50 were mounted, captain Neale.\n\n80 B battery, R C A, major Short.\n45 C company, I S C, lieutenant Wadmore.\n20 G G Foot Guards, lieutenant Gray.\n60 Queen's Own Rifles, captain Brown, including the Ambulance corps of same regiment.\n45 Battleford Rifles, captain Nash.\n\nOne Gatling gun and two 7-prs. belonging to Police, the latter being selected as more easy of transport than the 9-prs. guns, and a train of 48 wagons to carry men's rations and stores.\n\nHalting at 8 p.m., I waited nearly four hours until the moon rose, and then pushed on through the night, reaching at daybreak the enemy's camp, which was seen on the higher of two hills, partially surrounded by a wide ravine, with a large creek running through it. Crossing the creek, our advanced guard, the scouts, and police were almost at the top of the lower hill before our presence was discovered and the general alarm sounded; hardly had our scouts gained the crest of the hill when the advanced part of the enemy was met, who opened fire upon our men with vigour. The police immediately extended on the brow, and the guns supported by B battery were pushed forward into the same line, opening fire with shrapnel on the camp. The Indians, who had evidently been taken by surprise, very quickly gathered themselves together and attempted to surround us; so large was their force, that it required the whole of ours to be placed in the fighting line to meet the attack. Taking advantage of the cover afforded by the many small coulees and ravines surrounding our position, a most vicious and determined cross fire was poured in upon our men, which at first proved most destructive, owing to carelessness in exposing themselves. Soon, however, we followed the example of our foes, and made the most of any\ncover that was obtainable, and in point of accurate shooting quickly demonstrated our ability to cope with them.\n\nThe disposition of our force was as follows: — In the centre of the front line and just behind the brow of the hill was the Gatling, flanked on either side by a 7-pr. brass gun, all under the personal supervision of major Short, ably assisted by captain Rutherford; the support of these guns consisted of the Garrison division of B Battery—Immediately to the rear, resting in a slight declivity, were the horses of the Police and the wagon train; these were so well placed by captain Neale that only two casualties occurred through the day, viz., the loss of two horses, one of the wagon train, and captain Rutherford's charger. On either flank of the Artillery were the Police, to the right and right rear was C company and detachment of Guards; to the left, lying on a lower ledge of the hill and extending nearly to the creek, was the Queen's Own, and protecting the right rear and ford was the company of Battleford Rifles. The positions thus described were, with some slight changes, retained by these corps more or less throughout the action.\n\nShortly after the fight became general, a rush was made by the enemy for the Gatling, but was sharply repulsed, a party from the police and artillery gallantly headed by major Short, and four Indians killed.\n\nThe trail of one of the guns now unfortunately gave way, rendering that valuable arm practically useless, excellent practice was, however, made by the other guns, assisted whenever opportunity offered, by the Gatling, the other gun shared a similar fate later in the day.\n\nOur men had now fairly settled down to their work, and in the most cool, collected, and praiseworthy manner went about forcing the enemy to\nabandon their numerous points of advantage and cover.\n\nThe right rear which took in the ford was menaced, and a part of the Battleford rifles, under captain Nash, assisted by individual men of C company grenadier guards, and Queen's own rifles, with Constable Ross (chief scout) of the police, undertook to clear the coulee at that point; this they did most effectually, capturing four ponies whose riders were shot by them.\n\nA similar duty had now to be performed on our left rear, which was entrusted to parties of the Queen's Own and Battleford Rifles, and proved one of the sharpest brushes of the day; the enemy's fire here was, however, only partially subdued, as there remained a few men whom neither bullets nor shells seemed to reach, and who were only dislodged at the end of the day, by sending Ross with his scouts by a long détour to the rear and flanking them.\n\nAt eleven o'clock, that is, six hours after the beginning of the engagement, our flank and rear were clear, but the position we occupied was not tenable over night, while both guns were practically useless through broken trails, and the wounded required proper attention; further, the object of the reconnaissance had been accomplished, inasmuch as he had declared his intentions, but Big Bear, or at least his men, had effected a junction before my arrival as the number of the enemy was fully five hundred fighting men, including some fifty half breeds.\n\nI, therefore, concluded to withdraw and return at once to Battleford in case a counter attack might be made on that place — placing the Battleford Rifles on the opposite side with one of the maimed guns, the wagons, dead, save Private Osgoode, G G F Guards, whose body had rolled into a deep ravine and could not be recovered, and wounded were taken safely over the creek, followed in turn by the various\ncorps from their respective positions — a few of the enemy on perceiving our withdrawal, followed to the edge of the ravine, but were quickly driven back by the Gatling, under major Short, which brought up the rear, and two rounds from the 7-prs. with the Battleford Rifles, under captain Rutherford, both of which rounds had to be fired with the gun bound up with ropes and splints to keep it together — the crossing was effected without the slightest loss, and the enemy failed to follow, although had they done so much delay and loss of life might have been entailed upon us as the country was favourable to them.\n\nToo much praise cannot be given to the officers, non-commissioned officers, and men engaged throughout the whole action for their admirable coolness and gallantry; the circumstances were most trying to our troops who, without sleep or breakfast, found themselves opposed to a cunning and determined enemy thoroughly acquainted with the ground, adopting a new style of warfare and in numbers nearly double.\n\nWhere all behaved so well it is difficult to select those deserving of special mention, but I should not be doing my duty did I not bring to your notice the names of a few whose conduct came under my especial observation.\n\nMajor Short, R C A., by his plucky charge already mentioned, no doubt saved the Gatling, and throughout the day proved himself the beau ideal of an officer, he seemed to bear a charmed life as he coolly stood in the front lines working his guns.\n\nSergeant major Wattam, N W M Police, was another whose brilliant example and dogged courage gave confidence and steadiness to those within the sound of his voice.\n\nConstable Ross, N W M Police, our chief scout, was always ready to lead a dash or take his place in the\nskirmish line, in fact he seemed everywhere and at the proper time.\n\nLieutenant Brock, Q O R, most pluckily led the party to clear our left rear, and sergeant McKell, Privates Acheson and Lloyd, of the same corps, distinguished themselves by assisting the wounded to places of safety in the face of heavy fire; Private Lloyd himself being wounded in this duty.\n\nThe Ambulance Corps of the Queen's Own was particularly prominent in answering the numerous calls from the front for assistance, many times having to traverse ground that was raked by the enemy's fire.\n\nBrigade surgeon Strange, I S C, and surgeon Leslie, Q O R, rendered willing and valuable assistance to the wounded both on the field and in the temporary hospital that was established in the wagon laager.\n\nTo my personal staff, lieutenant Sears, I S C, brigade major and captain Mutton, Q O R, brigade quartermaster, I owe many thanks for their boldness, promptness, and assiduity in executing the orders given them.\n\nIn lieutenant-colonel Herchmer, N W M Police, I had a most valuable assistant, and not only in the action of Saturday, but throughout our march from Swift Current to Battleford, he displayed the most sterling qualities of a soldier; while the men of his command have time and again proved themselves as invaluable to my force.\n\nAttached I beg to hand you an official list of the dead and wounded, with the causes of their death and nature of wounds.\n\nAll the wounded are, I am glad to say, doing well at the time I write.\n\nI have, &c.,\n\n(Signed) W. D. Otter,\nLieut.-Col. Commanding the Battleford Column.\nMounted Infantry, 65 officers and men; French's Scouts, 28 officers and men; total 724.\n\nThe infantry I formed into a brigade and placed it under Lieutenant-Colonel Straubenzie, who had joined me at the same time as Lieutenant-Colonel Williams and the two companies of the Midland Battalion. I had also caused my Assistant-Quartermaster-General, Captain Haig, R.E., to put the steamer \"Northcote\" (which had come down with stores to my camp) in a state of defence, by means of lumber, bags of oats, &c., and having placed half C Company Infantry School on board her, under command of Major Smith, I directed her to drop down the river and anchor for the night at Gabriel's Ferry, communicate with me there, and to drop down next day, so as to be abreast of Batoche about 9 a.m., by which time I calculated I should be ready to commence my attack, and they were then to create what diversion they could in our favour, if possible to break the wire of the Batoche Ferry, and if they found they could not steam back, they were to continue on to the Hudson's Bay Crossing, south of Prince Albert. What was actually done by the steamer, you will find described in the report of Major Smith, C Company Infantry School, forwarded herewith. I may add that besides the half C Company, Captain Wise, my aide-de-camp, whose wound would not allow of his accompanying the force, Lieutenant H.J. McDonald of the 90th who was ill, and Lieutenants Gibson and Elliott, of the 10th Royal Grenadiers, suffering from rheumatism, with Dr. Moore and Mr. Pringle of the Medical Staff, Mr. Bedson, my chief Transport Officer, his clerk, Vinen, and four scowmen were also on board, some of whom, as will be seen by major Smith's report, performed valuable service.\n\nOn the morning of the 8th having heard that the trail along the river to Batoche was not good, and had some dangerous places on it, I marched out to\nthe eastward, and then to the N W, and struck the regular trail from Humboldt to Batoche about nine miles from Batoche, and camped there for the night, as soon as I had selected the spot for the camp, I pushed on with some of Boulton's Mounted Infantry to within four miles of Batoche, without meeting any resistance, merely seeing two of the enemy's scouts, who fled on our approach; and I then selected a good spot to camp in the next day in case I found it necessary to fall back from Batoche. On the morning of the 9th I left my camp standing, and advanced on Batoche. We arrived without hindrance to a spot within about half a mile of the new Catholic church, just where the trail strikes the river bank, before turning down to Batoche. There were three houses between us and the church where a number of men were seen, who fled on two or three shells and some rounds from the Gatling being fired at them, and we advanced slowly towards the church. From a house just the other side of the church a white flag was being displayed, and I rode up to it and found three or four Catholic priests in it with some sisters, and a number of women and children apparently half-breeds. Having reassured them, I advanced cautiously, extending my infantry and pushing back the enemy until we reached the crest of a hill, which enabled me to bring the guns down and shell the houses of Batoche, which were visible from a spot just below the crest. As the houses were of light construction and not very large not much damage was done, and just then as some shots came from across the river from a bluff along the bank, and as the spot the guns were in was completely exposed to this fire, I directed the guns to retire, and as they were doing so suddenly a very heavy fire was opened from what we afterwards found were some rifle pits in a bluff just below where the guns had been, but which was stopped by a rattling fire from the Gatling, which\nwas splendidly handled by Captain Howard, ably supported by Lieutenant Rivers, A Battery. After some time finding that the fire from the opposite side was again commencing, and also from the rifle pits, and that a horse had been killed and a man hit belonging to the Gatling, I directed Captain Howard to bring his Gatling back, which he did without further loss, and the wounded man was brought in at great risk by my aide-de-camp, Captain Freer, B Company Infantry School, and Gunner Coyne, of A battery. I then went off to the right of my extended line behind the church, and found the men holding their ground, but exposed to a fire from a bluff with a newly made grave in front of it railed in with wood. I then ordered the Gatling round to try and silence their fire, which it did at first, owing probably to the novelty of this weapon, as regards the enemy, but shortly afterwards the enemy's fire was renewed, and we afterwards found that they were firing from carefully constructed rifle pits, which completely covered them from any fire. During this time Captain Peters, A battery, had endeavoured to drive the enemy out of the pits from whence had come the fire which caused me to retire the guns with a portion of the Garrison Artillery of A Battery School, but the fire was too hot and they had to retire leaving a wounded man behind. On my returning to that part of the attack, and hearing of this I advanced a part of the Midland battalion down a coulee or bluff on the left between the cemetery and the church, with orders to keep up a hot fire, so as to distract the attention of the enemy from the spot where the wounded man was lying, and also directed a part of the 90th and 10th, who were lying down in advance across the trail, to do the same, and sent down a party of the Garrison Artillery with a stretcher to bring the man back, which they did without hesitation, and to my great satisfaction they succeeded in bringing him\nback without losing another man which was what I feared, but unfortunately the man himself was dead. Our dead and wounded were temporarily placed in the church where they were attended to by the medical men, assisted by the Roman Catholic sisters who kindly did all they could to help the doctors. As it was now becoming late, and I saw that, though holding our own, we were not likely to make any advance that day, it became necessary for me to decide as to where I should camp for the night, and taking into consideration the enormous importance at that time of not even appearing to retreat even so short a distance as to where I had selected a spot for my camp, I resolved to send for my tents and baggage and camp where I was, though there was no good place for it. I accordingly sent back for that purpose my second senior transport officer Mr. Secretan, who succeeded in bringing all my old camp equipage and teams, in a remarkably short time; and having formed a zareba with them I then ordered the advanced parties to be gradually withdrawn, which was done very creditably, as some of the enemy followed them up, probably thinking at first that they were retreating. They were, however, speedily undeceived by receiving a heavy fire from the zareba, and though a few of them kept up a desultory fire for a short time, as darkness fell they retired, but not before, I am sorry to say, killing two of our horses and wounding one man in the zareba. The piquets were then posted, a slight trench made round the zareba, and the rest of the men lay down with their arms lining the four sides of the zareba, each side being under the charge of a field officer with so many sentries on each face, who kept watch whilst the others slept and so the night passed in quiet. The casualties this day were as follows: Two men killed and one officer and nine men wounded.\n\nMay 10th. — After an early breakfast I moved out\nthe infantry, and took up position as advanced as possible, but the enemy were in greater force than the day before, principally as I expect on account of the steamer having passed down the river, and held the ground about the cemetery, and also some pits which they had made during the night just below the crest where the Gatling had been in position the day before. Some of the enemy also had got into position at the end of a point running out below the cemetery, and altogether we had lost rather than gained ground as compared with yesterday. I still felt it was good practice and training for my men, who were being taught by somewhat painful experience the necessity of using their enemy's tactics, and keeping themselves under cover. Moreover I knew that we could afford the ammunition which (in a sort of skirmishing fight like this) was wasted on both sides better than our adversaries, besides giving confidence to my young soldiers, some of whom — the Midland Detachment — had as yet not received their baptism of fire. During the morning I had the two guns of the A Battery shelling a house on the opposite bank, and some bluffs where some of the enemy were seen, and in the afternoon the two guns of the Winnipeg Battery shelled the cemetery, which was in possession of the enemy, and some rifle pits from a bluff on right front of my camp. In the evening, as before, I withdrew my advanced parties, who were again followed by the enemy, but I had some shelter trenches made in front of the camp, about 200 yards in advance, in which I had a party of infantry, and on the right front some more pits, nearly flanking the enemy's advance, in which I placed some men of the 90th, armed with the Martini-Henry; as the enemy approached they were received with a heavy fire from these trenches, which quickly drove them back, and though one of the enemy fired apparently with a long-range rifle into our camp, little damage was done, only one\nhorse being touched, and his fire was speedily silenced from our camp, and again we had a quiet night. In retiring this evening the men were much steadier, and during the whole day we had one killed and five wounded, showing that the men were improving in their fighting. The weather being luckily fine as we were bivouacking, not liking to put up tents when so many horses were in the zareba.\n\nMay 10th. — The Land-Surveyor's Scouts, fifty strong, under Captain Dennis, joined my force in the afternoon.\n\nMay 11th. — Having heard that there was a fine piece of prairie ground which overlooked the houses of Batoche, and having sent our parties of infantry to take up the old positions, I started off to reconnoitre the prairie ground, taking with me Boulton's Mounted Infantry and the Gatling. The trail to this ground went right through our camp, but I thought it probable that the enemy might have rifle-pits to defend it. I regret to say that as I was leaving camp one of the priests, Father Moulin, was brought in on a stretcher, wounded in the left thigh by a Winchester bullet, fired from the cemetery by the rebels, through the garret of the priest's house; it was luckily a flesh wound, and he was put in a hospital tent, and will go down to Saskatoon with our wounded. I took a slight detour, and came on to the prairie ground a little east of the trail. I found it was a good large plain, of an irregular shape, about two miles long, and 1,000 yards in the broadest part, with a sort of slight ridge running down the centre, and some undulations. We saw a good many men moving about on our left front, and fired two or three rounds from the Gatling, at the same time lining the crest of the ridge with some of Boulton's men, which soon drew a pretty smart fire from the edge of the bluffs running parallel to the ridge, which we soon saw was defended by a series of rifle pits. Leaving this\nparty to hold the enemy, I galloped along the prairie to the northward with the men of the Mounted Infantry, and seeing two of the enemy's mounted scouts, gave chase, but they got off into the woods, and we lost sight of them. Having pulled up myself, I was returning towards the other party, when I caught sight of a man coming out of a bluff on foot, and gave chase, and on coming up found it was an Indian without arms, who said he was a priest's man, but who eventually turned out to be a rebel who had been fighting against us. After firing for some time at the pits, I retired the force in good order and regained the camp. Here I found that we have regained all our lost ground owing to my feint on the enemy's left, which had drawn a good many of the enemy from their right to repel what they feared was a general attack, as owing to the lay of the ground, the enemy could not see what my force was. Some of the Midland Battalion, led by Lieutenant-Colonel Williams, gallantly rushed some rifle pits beyond the cemetery, and drove the Indians, who had been left on their right, out of them, capturing some blankets and a dummy which had been used to draw our fire. In the morning, one gun of A Battery shelled the cemetery and pits near the church. In the afternoon I brought up two guns of Winnipeg Half Battery to a spot held by the Midland advanced party, near the cemetery, from whence they were able to see to shell a house on the opposite side of the river which was flying Riel's white flag with some design on it, and about which a great many people were moving. The range was a long one, and the materiel of the house so light that not much harm was done, but the people all dispersed at once, and seemed to take to the woods. During that afternoon some few shots were fired from the opposite bank, but the fire was kept under and silenced by a party of men posted on the ground overlooking the river.\non the left of the camp. In the evening my advanced parties were withdrawn to the camp as usual, but the enemy hardly pursued at all. There was no firing into our camp, and our casualties of the day consisted of four wounded, all very slightly. This showed that my men were becoming more at home in this mode of warfare; and though as yet we had not made much progress, I resolved, to use a historical expression, \"to peg away\" until I succeeded in my object of taking Batoche, which I was sure I should do. During the day the men left behind to protect the camp and the teamsters added to the slight parapet and trenches already made, and made a traverse across the south side of the zareba, which would have effectually prevented any shot from doing mischief in the camp.\n\nMay 12th. — This morning I took the whole of the mounted men in my force, about 150 men, one gun of A Battery and the Gatling, and taking the same circuit as yesterday, took possession again of the piece of basin, and extending my force as much as possible and again engaged the rifle pits in front of us, firing also shell and the Gatling. In the middle of our firing I saw a man riding towards me waving a white flag. I rode forward to meet him and found that it was a Mr. Ashley, a surveyor, one of the men who had been made a prisoner by Mr. Riel. He told me he had just come from Riel, who was apparently in a great state of agitation, and handed me a letter from him in which he said, apparently referring to our shelling the houses, that if I massacred his women and children, they would massacre their prisoners. I at once wrote an answer saying that I was most anxious not to injure women and children, and that if he would place them all in one spot, and let me know where it was, I would take care that no shot should be fired in that direction. Just then, another prisoner, a Mr. Jackson, came up on foot, with another white flag and a copy of the same letter.\nabove alluded to. He announced his intention of not returning, though I suggested to him that the other prisoners, among whom was his own brother, might be massacred if he did not return. However, he said they would not be touched for that, and that he was not going back, so I left him to his own devices. The other prisoner, Mr. Ashley, acted in a very different manner. He said he should go back, on the chance of being yet able to assist his brother prisoners. He told me that they were all kept in a dark cellar, whenever anything unusual occurred; that they were all now confined in the cellar with a tremendous weight of stones on the trap door, and that he had been taken out with Jackson especially to bring this message. Accordingly he returned with my message, and I then drew my force gradually off and retired to camp in good order, having, as I afterwards found out, convinced the enemy that I intended attacking by that way. I regret to say, however, that one of the Surveyor's Scouts was killed, having been shot through the head while lying with the rest of his troop in a bluff on our left. On regaining the camp, I was much annoyed at finding that, owing to a misconception of my orders, the advanced parties had not, as I directed, been sent forward to hold the regained position and press forward, as I drew the enemy from their right by my feint; but I am now inclined to think that it was a fortunate thing that they had not, for I believe the total silence and absence of fire from my left only strengthened the belief of the enemy that I was going to attack from the prairie ground. After the men had had their dinners they were moved down to take up the old positions and press on. Two companies of the Midland, 60 men in all, under Lieut.-Colonel Williams, were extended to the left and moved up to the cemetery, and the Grenadiers, 200 strong, under Colonel Grasset, prolonged the line to the right beyond the church, the\n90th being in support. The Midland and Grenadiers, led by Lieutenant-Colonels Williams and Grasset, the whole led by Lieut.-Col. Straubenzie, in command of the Brigade, then dashed forward with a cheer, and drove the enemy out of the pits in front of the cemetery and the ravine to the right of it, thus clearing the angle at the turn of the river. During all this time a heavy fire was kept up from the other side of the river, which annoyed our advance. This was kept down as we best could by a few of the Midland Regiment in pits on the bank of the river, and one Company of the 90th Regiment was sent to support Lieutenant-Colonel Williams on the extreme left. The Midland Regiment and Grenadiers kept pushing on gallantly, led by Colonels Straubenzie, Williams, and Grasset, until they held the edge of the bluffs, surrounding the left part of the plain, where the houses were. Just before this a most promising young officer, Lieutenant Fitch, of the Grenadiers, was killed. At this period one of the Winnipeg Battery Guns was got into position where it could shell the houses on the plain, but after two or three rounds it was disabled, and a gun from A Battery took its place and fired a few rounds, but not much damage was done, as the houses were not brick or stone. During this time I advanced the 90th so as to prolong the line of attack, and eventually brought down the Surveyor's Scouts, Boulton's Mounted Infantry, and French's Scouts, and dismounting still further prolonged the line on the right. The Gatling was now ordered up in front of the 90th to take the houses in flank, which was gallantly done by Lieutenant Rivers, A Battery, and Captain Howard, and after a few volleys a general advance was made, with rattling cheers, and the whole of the houses were taken, the prisoners released, and the position virtually captured. It was at this period that the late lamented Captain French was killed by a shot from\nthe ravine, while looking out of the window at Batoche's House. This officer's loss was keenly felt and mourned by the whole force. He had been with the force from the commencement, and he was always ready for the front, and his cheerfulness and good humour was proverbial and had a cheerful effect on the whole camp. I had already brought Captain French's name to your notice in terms of strong commendation. A company of the Grenadiers was sent along the river on our left up to the house of the rebel Champagne, and a company of the 90th was sent well forward on the right, as a few desultory shots were fired from a ravine there, and by evening all firing ceased, and I sent up to the camp for the men's blankets and food, and we bivouacked for the night around the buildings. We found a large camp of women and children, natives and half-breeds, on the bank of the river below Batoche's House, and a good many camped round our bivouac for the night, some remaining where they were. On inspecting the scene of action after it was over, I was astonished at the strength of the position, and at the ingenuity and care displayed in the construction of the rifle pits, a good idea of which can be gained by reference to one of the sketches by Captain Haig, R.E., A.Q.M.G., forwarded herewith. In and around these pits were found blankets, trousers, coats, shirts, boots, shoes, food, oil, Indian articles of sleep, one or two damaged shotguns and one good rifle. It was evident that a detachment of rebels had lived in these pits day and night, and it was easily understood, by an inspection of them, how perfectly safe the holders of these pits were from the fire of our rifles, and especially from the Gatling and Artillery. These pits were also judiciously placed as regards repelling a front attack, but by attacking their right (which was their weakest point) and driving it in, we turned and took in reverse all their entrenchments, along the\nedge of the prairie ground, and thus caused a rout which ended in a \"sauve qui peut.\" As it was getting dark, and my men were tired out, I did not attempt to pursue. We found 21 of the rebels dead on the ground in the vicinity of the houses, and two dead men on the river bank, below the cemetery. Also five wounded, of whom two were belonging to Riel's Council, two of whom were also amongst the killed. I regret to say, that as far as I can learn, Riel and Dumont have escaped, having gone off together on our gaining the clear ground of the settlement, but I shall follow them up as soon as I learn the direction they have taken, which at present is a matter of doubt, some saying they have crossed the river, and others that they have not; I, myself, am inclined to think they have not crossed.\n\nMay 13th. — The half-breeds were continually coming in with white flags to give themselves and their arms up, some by themselves, and some with the priests. I have a list of the worst of the rebels, and I dismissed those not in it, with a caution to return to their houses, and a warning that if hereafter any charge is brought against them, they are liable to be arrested. I have now thirteen prisoners, two of them being members of Riel's Council. I may remark here that among Riel's prisoners released by us was a half-breed, who looked like a white man, by name Albert Monkman. He stated that he had been made prisoner by Riel, because he suspected he was getting disaffected, which he said was the case. But I received evidence which so clearly showed that this man was deeply committed to the rebellion, and that his change of idea originated most probably from discovering that he was on the wrong side, that I arrested him also. Heard this afternoon that Riel and Dumont were on this side of the river. The Catholic priest reported this morning, the following loss of the rebels, in the four days' fighting: — 1st day, 4 killed\nand 5 wounded; 2nd day, 2 wounded; 3rd day, 3 wounded; 4th day, 47 killed, 163 wounded; Total, 51 killed, and 173 wounded.\n\nMay 14th. — Marched for Lepine's Crossing. Having halted for dinner, I received information that Riel was somewhere in the vicinity so determined to make for Guardapui or Short's Crossing, which was some miles nearer and camp for the night.\n\nMay 15th. — I sent out parties of mounted men under Major Boulton to scour the woods. In the afternoon two scouts, Armstrong and Hourie, who had been sent out with Boulton and had moved away by themselves, came upon Riel, who gave himself up, producing my letter to him in which I summoned him to surrender and promised to protect him until his case was considered by the Canadian Government. The scouts brought him into my camp, and I made a prisoner of him as you are aware. Before bringing to your notice the conduct of the whole force, and the names of those officers whose duties during those four days on account of their rank or appointments necessarily brought them more prominently under my personal notice, I would here beg to be allowed, in justice to the gallant little force under my command, to draw attention to its actual strength and weapons, about which there seems to be some strange misconception not only in the English press, but even in that of the Dominion. In one of the English papers, I am represented as having been waiting at Fish Creek for reinforcements, of having asked for 1500 more men, and as having been reinforced by the Midland Regiment, and as having fought with 1000 men and arms superior to the enemy. The real facts of the case being as follows: I was waiting at Fish Creek as you know to get rid of my wounded, and get oats up, and not for reinforcements. Only 100 men of the Midland Regi-\nment reached me, then under Lieutenant-Colonel Williams, and as I had lost, killed, and wounded nearly 60 men, and had to put 35 men on board the \"Northcote,\" my actual reinforcement was 5 men. As regards the actual number of men engaged out of my total force of 724 officers and men, owing to having to leave 100 men to protect my camp, leaving wounded and sick men, cooks, ammunition carriers, assistants to ambulances, &c., I was only able to bring 495 men into the engagement, and this included the Artillery and Gatling which owing to the nature of the position were not able to do so much damage as the Infantry. So that with about 400 men we drove with heavy loss a force of (taking the lowest estimation) 600 half-breeds and Indians, many of them armed with long range rifles, and who were considered the finest and best prairie fighters in the country, out of a strong position carefully selected and entrenched by themselves. After this I need say no more concerning the conduct during the engagement of the whole force. From my second in command, Lieutenant-Colonel Straubenzie I received every assistance, and on the 12th his leading of his brigade was beyond praise. Lieut-Colonel Houghton, D. A. G., showed great coolness under fire, and was in command of the zareba during the action of the 12th. Captain Haig, R. E., my Assistant Quarter-master-General, was very useful to me, and cool under fire, he is a most energetic and willing officer and has been of much service to me all along, especially in rendering the zareba safe from the enemy's dropping fire, and all other work requiring an Engineer's knowledge. Lieutenant-Colonel Lord Melgund, who was my chief of the Staff for some time, was also of great service while with me on the 9th. Captain Young, of the Winnipeg Field Battery, Brigade Major, has done most excellent service throughout the campaign, and is deserving of great\npraise for the way in which he performed his staff duties. I selected him to take charge of Riel from the time he surrendered, and while he was in camp Captain Young slept in the tent with him, and afterwards conveyed him safely to Regina. My Aide-de-Camp, Lieutenant Freer, 38th Regt., B Company, School of Infantry Instruction, deserves great praise for the way in which he performed his duties while continually exposed to the fire of the enemy. I have already brought to your notice the gallant way in which he went to assist in withdrawing a wounded man under the fire of the enemy. The conduct of Lieutenant-Colonels Montizambert, commanding Artillery, Williams, commanding Midland Regiment, Lieutenant-Colonel Grassett, commanding Grenadiers, and Major McKeand, commanding 90th Regiment, was everything I could wish. Lieutenant-Colonel Williams and Lieutenant-Colonel Grassett came prominently to my notice from the gallant way in which they led and cheered their men on the left, rush by rush, until they gained the houses on the plain, the former having commenced the rush. The field officers of the different infantry regiments, Majors Smith and Hughes, Midland; Major Dawson, Grenadiers; and Major Boswell and Acting Major and Adjutant Buchan, 90th Regiment, are equally to be commended for their behaviour on this and the other days. Major Smith, C Company, Infantry School Corps was doing excellent work on board the \"Northcote,\" under very trying circumstances, ably assisted by my other Aide-de-Camp in spite of his wound, and Mr. Bedson, as will be seen by Major Smith's report. Major Jarvis, commanding Winnipeg Field Battery, and Captain Drury, A Battery two guns, did excellent service during the four day's work, as well as the Gatling under Lieutenant Rivers, A Battery, in fighting which arm Captain Howard, late United States Army, the instructor in the\nuse of the weapon, showed great gallantry and cool courage. Captain Peters, as usual, was well to the front, covering the guns with the dismounted portion of A Battery, Lieutenant Disbrowe, attached to A Battery, whom I placed in charge of the ammunition from the commencement of the march, was particularly useful and deserves great praise. Major Boulton, commanding the Mounted Infantry, who is an excellent officer, full of resources, and who has been of the greatest service to me from the time he joined my force, displayed his usual coolness and courage, and on the 12th was of great use on the right by the way he disposed and led his men. Captain Dennis, commanding the Surveyor's Scouts, did excellent service, and deserves great praise for the way in which he handled his men. Captain French, commanding Scouts, whose loss we all deeply deplore, displayed his usual dash and courage. Great praise is due to Brigade-Surgeon Orton and his subordinates for the excellent way in which the attendance and care of the wounded men was carried out.\n\nThanks are also due to the Rev. D. M. Gordon, of the Presbyterian Church, who joined the 90th at Fish Creek Camp, and was with them during the fighting at Batoche, and to the Rev. C. C. Whitcombe, Church of England, who joined the Grenadiers on the 16th of May, for their attention to the spiritual wants of the wounded and the rest of the troops. I forward herewith sketches of the position by Captain Haig, Royal Engineers, my Assistant Quartermaster-General.\n\nI have, &c.\n\n(Signed) FRED. MIDDLETON,\nMajor-General, Commanding North-West Field Force.\nNorth West Field Force under General Middleton, C. B.\n\nReturn of Officers and Men Killed during the attack on Batoche from 9th to 12th May inclusive\n\nMay 24th, 1884.\n\nA Battery.\nGunner William Phillips, gun-shot wound, 9th May. 10th Grenadiers. Lieut. W. Fitch, gun-shot wound, 12 May; private T. Moore, gun-shot wound, 9th May. 90th Battalion. Private R. R. Hardisty, gun-shot wound, 10th May, private James Fraser, gun-shot wound, 12th May.\n\nBoulton's Infantry.\nCaptain E. L. Brown, gun-shot wound, 12th May.\n\nBoulton's Scouts.\nCaptain John French, gun-shot wound, 12th May.\n\nIntelligence Corps.\nLieut. A W. Kippen, gun-shot wound, 12 May.\n\nRecapitulation, 9th May, 2\n\" 10th \" 1\n\" 12th \" 5\nTotal 8\n\n(Signed) E. A. GRAVELY,\nBrigade Surgeon.\n\n(Signed) FRED. MIDDLETON,\nMajor-General, Commanding North West Field Force.\n\nMord West Field Force under Major-General Middleton, C. B.\n\nReturn of Officers and Men Wounded during the four days attack upon Batoche from the 9th to 12th May inclusive.\n\nMay 24th, 1885.\n\nA battery.\nGunner William Fairbank, thigh, 9th May.\nRoyal Canadian Artillery.\n\nGunner M. Cowler, thigh, 9th May. N. Carpentier; right knee and left leg, 9th May. Driver T. Stout, run over by gun carriage, 9th May.\n\n10th Greadiers.\n\nPrivate Brisbane, forehead, 11th May.\nEager, jaw, 12th »\nCorporal Foley, side, 11th »\nPrivate H. Millsom, chest, 12th »\nA. Martin, shoulder, 10th »\nMarshall, ankle, 12th »\nBarber, head, 12th »\nCantwell, hand and thigh, 9th »\nQuigley, right arm, 12th »\nCaptain Manley, foot, 12th »\nMajor Dawson, leg, 12th »\nPrivate , ruptured during action, 12th »\nCaptain Mason, hip, 9th »\nStaff-Sergeant Mitchell, forehead, 11th »\nBugler Gaghan, hand, 12th »\nPrivate Cook, arm 12th »\nStead, arm, 10th »\nScobell, arm, 10th »\n\n90th Battery.\n\nCorporal William Kemp, gun-shot wound in right eye, 9th May; private Ralph Baron, gun-shot wound left hand, 10th May; private Mack Errickson, gun-shot wound left arm, 11th May; private Alexander L. Young, gun-shot wound left thigh, 12 May; sergeant F. R. Jackes, gun-shot wound left hand, 12th may; sergeant M. John Watson, gun-shot wound left thumb, 12th May; corporal James Gillies, gun-shot wound left leg, 12th May; private F. Alexander Watson, gun-shot wound neck and chest, 12th May; Major A. MacKeand, sprained leg during action, 12th May.\nMidland Battery.\n\nSergeant A. E. Christie, right arm, 12th May.\nLieutenant G. E. Laidlaw, right calf, 12th \"\nPrivate William Barton, left hip, 12th \"\nCorporal E. A. E. Halliwell, face, 12th \"\nCaptain John Halliwell, left shoulder, 12th \"\nColour-Sergeant William Thomas Wright, left arm 12th \"\nPrivate S. M. Daley, left hand 12th \"\n\nBoulton's Infantry.\n\nPrivate William Hope Hay, fore-arm, 12th May.\n\nFrench's Scouts.\n\nPrivate G. R. Allen, right shoulder, 9th May.\nR. S. Cook, left leg, 9th \"\nInt. Corps: — Garden, shoulder, 12th May.\nA. O. Wheeler, shoulder, 10th \"\n\nWounded on the \"Northcote\" during the Action.\n\nCivilians:\n\nMr. Pringle, Medical Ambulance Corps, 9th May.\nMcDonald, Boat's Crew, 9th \"\nVinen, Transport Service, 9th \"\n\nWounded in the field 40\nInjured in the field 3\nWounded on the boat 3\n\nTotal 46\n\n(Signed) E. A. GRAVELY,\nBrigade Surgeon.\n\nWounded on the 9th 9\n\" \" 10th 5\n\" \" 11th 4\n\" \" 12th 25\n\nTotal 46\n\n(Signed) FRED. MIDDLETON,\nMajor-General, Commanding North-West Field Force.\nVIII.\n\nA great point now is to finish a war rapidly. In 1862 Gen. Mac Clellan transported the Army of the Potomac 80,000 strong from Alexandria to fort Monroe between the 17th March and the 4th April. His advance on Richmond was skilfully planned, and if he had immediately attacked the city with determined energy and vigour, in force, he would have taken it. This is the opinion of Gen. Grant, Gen. Sherman, Gen. Sheridan, Gen. Hancock, Gen. Seymour, Col. Jas. mac Kaye and many other distinguished officers of the U. S. Army. Gen. Grant, one of the greatest soldiers of modern times, would have done it and finished the war in a few months. After the terrible battle of Antietam, McClellan by vigorous offensive movements, could have surrounded Lee and cut his army in pieces. He could also by an energetic pursuit have crushed Lee on his line of retreat. What loss in life and money this would have saved the United States!\n\nIn 1837 Mackenzie and Papineau raised a Rebellion. On that occasion hundreds of the first settlers like Col. Sir Allan N. McNab, Bart, Sir Jas. Stewart, Bart., Sir John B. Robinson Bart., Col. de Salabery, de Beaujeu, Col. Denison, Duchesnay, Col. Jarvis, Panet, Col. Duggan, Col. Cruickshank, Major Henry Pingle, Col. Ed. W. Thomson, The Heward's, Sherwoods, de Boucherville, Boultons, Col. Prince, &c., drew their swords in support of their handsome young Queen Victoria. Mackenzie and Papineau were defeated and many families ruined. Riel has twice rebelled and has been twice defeated.\n\nWhat advantage or benefit could any honest man in the Dominion obtain, from such men as Riel, Dumont, Poundmaker or Big Bear? Is it not better to\ntrust in the Crown, and the able and distinguished statesmen and members of Parliament of both political parties, who know the wants of the country, and who directly represent over four millions of the most intelligent people in the world.\n\nLet us hope this is an end of Rebellions. But if any would be \"shirtless patriots\" and martyrs still exist let them reflect well how absurd it is to oppose the forces of a mighty Empire which can put, if necessary, millions of the finest soldiers in the world in the field ready and sure to find and crush all rebels whether near or remote. Let them reflect that they are sure to ruin their own families, and their poor ignorant, deceived followers, and that they inflict the very worst injury on the best interests of their country.\n\nThe greatest liberty is enjoyed under the British flag. No country in the world enjoys greater liberty than Canada. The author speaks from personal experience; but the author, as a soldier, has nothing to do with politics. Looking at the whole movement from a purely military point of view it may be said that Riel should have united all his rebels in one mass, and with great energy assailed Her Majesty's Forces night and day before Sir F. Middleton had time to concentrate and march against him. Or by forced marches and rapid movements he could have menaced our lines of communication, attacked our troops on their line of march, obstructed the routes, or by a bold and skilful movement with overwhelming numbers assailed either Otter or Strange before Gen. Sir F. Middleton had time to come up. But of course Sir F. Middleton, like a skilful soldier, knew his enemy, and admirably made his dispositions accordingly. And in this the General proved his great ability. Riel had neither money, ammunition, supplies nor reserves to fall back on, and in war every soldier knows these are absolutely necessary.\nThe wild attempts of Rebels must therefore surely fail, and their mean, criminal opposition to authority and the law is certain to be crushed with an iron hand.\n\nFor it is a great crime to rebel against the Empress Queen Victoria, who is the kindest, best and most illustrious sovereign of the greatest empire the world has ever seen.\n\nThe integrity of the British Empire must be maintained.\nStaff of the Halifax Contingent.\n\nCol. Brimmer, 66th Batt., in command.\nCol. McDonald, Senior Major, 66th Batt.\nMajor Walsh, 63rd Batt. Rifles.\nPaymaster, Capt. Garrison, H.G.A.\nSurgeon Tobin, 66th Batt.\nAssistant Surgeon Harrington, 66th Batt.\nQuartermaster, Capt. Doull, 66 Batt.\nAdjutant, Capt. Kenny, 66th Batt.\n\nAfter arriving at Swift Current the men of the 66th went to Medicine Hat; then Capt. Heckler and Cunningham with some of the men of the 63rd went to Saskatchewan Landing, 30 miles from Swift Current; the remaining companies of the 63rd, and two companies of the Halifax Garrison Artillery, went to Moosejaw, where they remained till the Battalion started for home.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001437.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 136, "total-input-tokens": 187718, "total-output-tokens": 56976, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 20, 1], [20, 20, 2], [20, 164, 3], [164, 1465, 4], [1465, 2669, 5], [2669, 4322, 6], [4322, 6259, 7], [6259, 8179, 8], [8179, 10084, 9], [10084, 11965, 10], [11965, 13785, 11], [13785, 15604, 12], [15604, 17575, 13], [17575, 19452, 14], [19452, 21038, 15], [21038, 22899, 16], [22899, 24752, 17], [24752, 26539, 18], [26539, 28450, 19], [28450, 30118, 20], [30118, 32002, 21], [32002, 33956, 22], [33956, 35932, 23], [35932, 37588, 24], [37588, 39504, 25], [39504, 41380, 26], [41380, 43322, 27], [43322, 45282, 28], [45282, 47263, 29], [47263, 49129, 30], [49129, 50766, 31], [50766, 52632, 32], [52632, 54499, 33], [54499, 56384, 34], [56384, 58173, 35], [58173, 59927, 36], [59927, 61652, 37], [61652, 63548, 38], [63548, 65490, 39], [65490, 67378, 40], [67378, 69235, 41], [69235, 71105, 42], [71105, 73004, 43], [73004, 74900, 44], [74900, 76791, 45], [76791, 78618, 46], [78618, 80459, 47], [80459, 82354, 48], [82354, 83959, 49], [83959, 85854, 50], [85854, 87786, 51], [87786, 89735, 52], [89735, 91663, 53], [91663, 93461, 54], [93461, 95119, 55], [95119, 97059, 56], [97059, 98917, 57], [98917, 100754, 58], [100754, 102603, 59], [102603, 104473, 60], [104473, 106287, 61], [106287, 108176, 62], [108176, 110105, 63], [110105, 111717, 64], [111717, 113640, 65], [113640, 115567, 66], [115567, 117527, 67], [117527, 119436, 68], [119436, 121310, 69], [121310, 123236, 70], [123236, 125080, 71], [125080, 126982, 72], [126982, 128759, 73], [128759, 130559, 74], [130559, 132441, 75], [132441, 134356, 76], [134356, 135771, 77], [135771, 137339, 78], [137339, 138810, 79], [138810, 140333, 80], [140333, 141834, 81], [141834, 143417, 82], [143417, 144855, 83], [144855, 146502, 84], [146502, 148323, 85], [148323, 149800, 86], [149800, 151552, 87], [151552, 153233, 88], [153233, 154678, 89], [154678, 156278, 90], [156278, 157931, 91], [157931, 159549, 92], [159549, 161177, 93], [161177, 162991, 94], [162991, 164824, 95], [164824, 166473, 96], [166473, 168390, 97], [168390, 170341, 98], [170341, 172281, 99], [172281, 174175, 100], [174175, 176106, 101], [176106, 177899, 102], [177899, 179178, 103], [179178, 180716, 104], [180716, 182505, 105], [182505, 184291, 106], [184291, 186129, 107], [186129, 187892, 108], [187892, 189480, 109], [189480, 191370, 110], [191370, 193307, 111], [193307, 195256, 112], [195256, 197171, 113], [197171, 199123, 114], [199123, 201025, 115], [201025, 202944, 116], [202944, 204892, 117], [204892, 206842, 118], [206842, 208776, 119], [208776, 210725, 120], [210725, 212661, 121], [212661, 214460, 122], [214460, 216363, 123], [216363, 218240, 124], [218240, 219844, 125], [219844, 220906, 126], [220906, 222158, 127], [222158, 223157, 128], [223157, 224823, 129], [224823, 226708, 130], [226708, 227100, 131], [227100, 227782, 132], [227782, 227782, 133], [227782, 227782, 134], [227782, 227782, 135], [227782, 227782, 136]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]