[{"id": "0eec53e339035e939a9011148f60e1686a72aa4f", "text": "THE MEMORIAL\n\nOF\n\nSETTLERS\n\nIN THE PROVINCE OF THE\n\nSaskatchewan Homestead\n\nCompany,\n\nIN THE\n\nCANADIAN NORTH-WEST.\n\n[Signature]\n\n[Stamp]\nThe Memorial\n\nOF SETTLERS IN THE TRACT GRANTED TO THE\n\nSASKATCHEWAN HOMESTEAD COMPANY.\n\nTO HIS EXCELLENCY\n\nTHE GOVERNOR-GENERAL\n\n(IN COUNCIL).\n\nMay it please Your Excellency:\n\nWhereas great ignorance prevails as to the nature and terms of the Colonization plan of December, 1881, and the Agreement thereunder, which ignorance extends, we regret, even to the North-West Council;\n\nAnd Whereas unfriendly and untrue representations of the whole Colonization work have been industriously circulated to serve personal and political ends; which statements, though not directed against any particular Company, nevertheless justice and decency compel us to give them a flat denial so far as concerns The Saskatchewan Homestead Company.\n\nAnd Whereas the great and many real merits of the plan have been unwittingly or dishonestly concealed, and thus, by the general public not understanding the\nnumerous and valuable benefits that will ensue to settlers in these tracts, a serious wrong is done to a beneficent system:\n\nNow, therefore,\n\nThis Memorial of the undersigned,\nwho are\n\nACTUAL SETTLERS\nin the Tract granted by you to the Saskatchewan Homestead Company,\n\nHumbly Sheweth:\n\n(1) That, in their judgment, the Government Colonization Plan is wise and good, and tends to the welfare of the settler, the settlement, and the country. That the stringent provision for two resident settlers upon each section—odd as well as even—secures a population more dense and uniform than has hitherto marked rural districts in the North-West, and, by reason of greater proximity and number, far superior social, educational, religious, and municipal advantages ensue. Already your Memorialists have experienced most beneficial effects in this respect.\n\n(2) That the Saskatchewan Homestead Company is entitled to unqualified approval for the course pursued by it in the settlement of this tract. The policy of the Company has from the first been liberal and patriotic, and speedy development is now going forward. Your Memorialists cheerfully testify that, individually and collectively, they have experienced almost indispensable benefits through the praiseworthy enterprise and liberality of the Company. The very considerable measure of prosperity now enjoyed, the harmonious and neighbourly spirit which prevails, and the contentment among the settlers\nprove, beyond question, that the plan is a good one when ably and honestly acted upon.\n\n(3) That unprecedented success will, in the opinion of your Memorialists, characterize the tract of a Company which discharges efficiently the duties assumed under the Colonization Agreement. Adverse criticism at so early a stage betrays an antagonism that would condemn untried. Your Memorialists have abundant evidence of increased prosperity in the future, and deplore that a laudable and wisely-devised system should be misunderstood and defamed. With entire confidence in and approval of the Colonization method, the Company itself, and its administration, your Memorialists enter heartily into the congenial work of developing and beautifying their respective farms in this fertile portion of the Canadian North-West.\n\nCrescent Lake,\n\nAssiniboia, N.W.T., November, 1883.\n\n| NAME          | West of 2nd Mer. |\n|---------------|------------------|\n|               | Sect. | Tp. | Rge. |\n| Wm. Eakin     | 10    | 23  | 3    |\n| George W. McBean | 36   | 23  | 3    |\n| S. W. Switzer | 28    | 23  | 4    |\n| NAME               | Sect | Tp | Rge |\n|--------------------|------|----|-----|\n| Edward Salisbury   | 22   | 23 | 4   |\n| Wm. Eckardt        | 18   | 23 | 3   |\n| Thos. O. Youngs    | 12   | 23 | 4   |\n| J. Geo. Phelps     | 10   | 23 | 3   |\n| Christo C. Rogers  | 2    | 23 | 4   |\n| Geo. Addison       | 18   | 23 | 3   |\n| E. Ainsworth       | 4    | 23 | 4   |\n| William Cross      | 14   | 23 | 4   |\n| Frederick Baines   | 20   | 23 | 3   |\n| NAME                        | Sect | Tp | Rge |\n|-----------------------------|------|----|-----|\n| Anthony D. Eckardt          | 24   | 23 | 4   |\n| Richard Medcalf             | 12   | 23 | 3   |\n| George Stephen Thomson      | 36   | 23 | 3   |\n| R. Murray McBean            | 26   | 23 | 3   |\n| William Maddock             | 24   | 23 | 3   |\n| Joseph Lucas                | 24   | 23 | 3   |\n| W. C. Middleton             | 22   | 23 | 3   |\n| F. H. Middleton             | 22   | 23 | 3   |\n| H. J. Middleton             | 22   | 23 | 3   |\n| NAME                  | Sect. | Tp. | Rge. |\n|-----------------------|-------|-----|------|\n| Alexander Heggie      | 16    | 23  | 4    |\n| William M. Anderson   | 28    | 23  | 4    |\n| Thomas Bolton         | 4     | 23  | 3    |\n| Thomas Ambler Bolton  | 4     | 23  | 3    |\n| John Benson           | 4     | 23  | 3    |\n| Edward Outhwaite      | 16    | 23  | 3    |\n| Phos. Evans           | 16    | 23  | 3    |\n| John Atkey            | 6     | 23  | 3    |\n| Willard S. Eckhardt   | 24    | 23  | 4    |\n| NAME                  | Sect | Tp | Rge |\n|-----------------------|------|----|-----|\n| Charles Mann          | 18   | 26 | 2   |\n| George Deacon         | 18   | 23 | 4   |\n| Henry Deacon          | 18   | 23 | 4   |\n| William A. Thomson    | 12   | 23 | 4   |\n| W. J. Dawson          | 32   | 23 | 4   |\n| G. C. McCollum        | 6    | 26 | 2   |\n| H. M. Watts           | 32   | 23 | 4   |\n| Alex J. Macdougall    | 2    | 23 | 3   |\n| J. S. Darbolton       | 4    | 26 | 2   |\n| NAME            | Sect | Tp. | Rge. |\n|-----------------|------|-----|------|\n| Wm. Bedford Jones | 4    | 26  | 2    |\n| Joram Eckardt   | 24   | 23  | 4    |\n| Chas. Barraas   | 6    | 23  | 3    |\n| W. K. Moore     | 12   | 23  | 4    |\nTHE SASKATCHEWAN\nLAND AND\nHOMESTEAD COMPANY,\nLIMITED.\n\nCAPITAL $500,000.00\n\n(6,000 SHARES OF $100 EACH)\n\nDIRECTORS\n\nJOHN T. WITHROW, Esq., President of the Industrial Exhibition, Toronto.\nAlderman, etc., Toronto.\n\nREV. A. SUTHERLAND, D.D., General Missionary Secretary and Secretary of General Conference, Methodist Church of Canada, Toronto.\n\nH. E. CLARKER, Esq., M.P.P., Alderman and Chairman of City Executive, Toronto.\n\nJOHN T. MOORE, Esq., Alderman, Member of Council of Institute of Chartered Accountants, Toronto.\n\nWARING KENNEDY, Esq., of Samson, Kennedy and Gammel, Wholesale Dry Goods Merchants, Toronto.\n\nDANIEL MOLLERN, Esq., of D. McLean and Co., Wholesale Leather Dealers, Toronto.\n\nEDWARD LEADLAY, Esq., of E. Leadlay and Co., Produce and Grain Merchants, Toronto.\n\nC. H. GOODERHAM, Esq., of Gooderham Bros., Grain Merchants and Millers, Toronto.\n\nRICHARD BROWN, Esq., of Brown Bros., Wholesale Stationers and Booksellers, Toronto.\n\nW. J. PAGE, Esq., of W. J. Page and Co., Counsellors and Publishers, Toronto.\n\nP. R. GRINDLAY, Esq., of P. and T. Grindlay, Silver and Hollow Ware Manufacturers, Toronto and Hamilton.\n\nDERVIE MOORE, Esq., of Moore, Robson and Co., Iron Founders and Metal Merchants, Hamilton.\n\nSECRETARY\nJOHN T. WITHROW, Esq.,\nToronto.\n\nTREASURER\nREV. A. SUTHERLAND, D.D.,\nToronto.\n\nMANAGING DIRECTOR\nJOHN T. MCINTOSH,\nToronto.\n\nGENERAL OFFICE\n327-329 ST. GEORGE STREET, TORONTO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001174.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 17160, "total-output-tokens": 2537, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 137, 1], [137, 137, 2], [137, 1023, 3], [1023, 2473, 4], [2473, 3571, 5], [3571, 4022, 6], [4022, 4572, 7], [4572, 5089, 8], [5089, 5573, 9], [5573, 5815, 10], [5815, 5815, 11], [5815, 7225, 12]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, true, true, true, true, true, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false]}}]