[{"id": "e40561147771ccb84880aefb96c59a5c6c7ce226", "text": "CERTIFICATS\n\nNous, soussignés, déclarons et certifions que cette gravure est la vraie copie du portrait de Louis \"David\" Riel, dont l'original est la propriété d'Abraham Guay.\n\n(Signé,) Veuve JULIE RIEL.\n\" Veuve MARGUERITE RIEL.\n\" JOSEPH RIEL.\n\" OCTAVIE LAVALLÉE.\n\" ALEXANDRE RIEL.\n\" HENRIETTE POITRAS.\n\nDaté à St-Vital, 12 janvier 1886.\n\nJe certifie par la présente que le portrait de Louis Riel, qui m'a été montré par M. Guay, est une ressemblance parfaite.\n\n(Signé,) JOHN LEE.\n\nMontréal, 24 février 1886.\nPOESIES\n\nReligieuses et Politiques\n\nPAR\n\nLOUIS \"DAVID\" RIEL\n\nPRIX : 15 Cts.\n\nMONTREAL\nIMPRIMERIE DE \"L'ETENDARD,\" 37 ST-JACQUES\n\n1886\nCERTIFICAT ET AUTORISATION\n\nNous confions et autorisons Monsieur Abraham Guay à faire imprimer et livrer à la publication les dits documents, et déclarons faux tout ce qui ne sera pas reconnu tel par les soussignés.\n\nJOSEPH RIEL,\nALEXANDRE RIEL.\n\nDaté à St-Vital,\n12 Janvier 1886.\n\nEnregistré conformément à l'acte du parlement du Canada, en l'année mil huit cent quatre-vingt-six, par ABRAHAM GUAY, au bureau du ministre de l'Agriculture.\nNOTE DE L'ÉDITEUR.\n\nNous présentons au public deux poèmes de Louis \"David\" Riel. Nous avons pensé remplir une lacune en publiant quelques vers de l'homme qui a été la cause d'une controverse passionnée dans la presse du monde entier. Nous n'avons pas voulu ajouter de commentaires, ni notes explicatives, ni même de corrections, laissant aux lecteurs la pensée de l'auteur avec tout le cachet du terroir. Nous aurions pu corriger ou modifier le vers pour lui donner la forme exigée par la prosodie, mais il aurait perdu son caractère et nous ne voulions pas changer en quoique ce soit l'originalité de l'ouvrage.\n\nCes deux poèmes donneront une idée de l'homme qui a joué un rôle important dans l'histoire du Nord-Ouest canadien. Ils ont été composés pendant l'exil de Riel au Montana, en 1879. Nous croyons que leur authenticité, dont les certificats ci-joints font foi, est une raison suffisante pour les faire accepter du public, et c'est dans cet espoir que nous les livrons à la publicité.\nMON SAUVEUR.\n\nO Jésus-Christ ! je veux n'entendre\nEt n'écouter que votre voix,\nJe veux obéir et me rendre\nEn tout, à l'Esprit de vos lois.\n\nJe m'attache à vous : je veux suivre\nLe sens de vos instructions.\nGuidez-moi : je ne veux pas vivre\nAu gré de mes illusions.\n\nDans l'état actuel des choses,\nVous vous cachez dans l'univers,\nComme, dans les rosiers, les roses\nSe cachent durant nos hivers.\n\nVous ne parlez plus à la terre\nDe vive voix comme jadis :\nVous lui parlez avec mystère\nDu sein de votre Paradis.\n\nL'homme le plus sage a beau dire,\nSi votre esprit divin et grand\nNe parle au sien et ne l'inspire ;\nIl ne vivra qu'en s'égarant.\n\nVous parlez tout bas à son âme,\nPersonne ne s'en aperçoit :\nVos lèvres sont comme la lame\nDu zéphir : aucun ne les voit.\n\nParlez à ma conscience :\nVous êtes, en vérité,\nLe Christ de ma confiance,\nLe Christ de la charité.\nNOTRE SEIGNEUR IDENTIFIÉ AVEC SON CLERGÉ.\n\nLes envoyés du Christ sont, je le sais, les prêtres,\nIls ont l'emploi divin d'enseigner, de prêcher ;\nDe lier et de délier ma conscience, en maîtres,\nToutes les fois que j'ai le malheur de pécher.\n\nJe les aime ; je les écoute,\nC'est là ma disposition :\nLes prêtres sont la clef de voûte\nDu ciel : de la Rédeption.\n\nJe cherche Jésus-Christ : je l'aime.\nPuisque, mon cœur peut le trouver\nDans ses prêtres : ma joie extrême\nEst d'aller à lui, sans me laisser entraver.\n\nTout ce que le Sauveur dit des pouvoirs du prêtre\nEst la vérité même : et je ne puis la nier.\nLa foi m'élevera peut-être\nUn jour, quoique je sois aujourd'hui le dernier.\n\nJe crois au Rédempteur, je crois en sa parole.\nMoi, je suis ignorant : je m'en rapporte à lui.\nJe médite : et je tiens ma raison dans son rôle.\nL'erreur est mon plus grand ennui.\n\nAvant les joies de l'Evangile,\nLe monde a dû faire pitié.\nAlors qu'Euripide et Virgile\nEtaient les rois de l'amitié.\n\nLe genre humain était barbare.\nIl vivait dans la dureté.\nL'amitié certaine était rare\nComme la franche liberté.\nL'Evangile a paru comme parait la lune,\nAu milieu de la nuit.\nLe Christ a pris du temps à faire sa fortune.\nMais à douze ans, déjà, son nom faisait du bruit.\n\nSa parole est cent fois plus belle,\nMille fois plus grande que celle\nD'Alexandre le Grand ou du premier César.\nSes accents sont suivis d'une gloire immortelle,\nIls sont plus beaux que ceux du Czár.\n\nJésus-Christ parle mieux que les Grecs, lorsque Sparte\nImmolait ses soldats, en les glorifiant.\nIl est plus ravissant encore que Bonaparte.\nQuand sa voix et son glaive allumaient l'Orient.\n\nSes discours sont plus beaux que ceux de Démosthène\nLorsqu'il faisait la lutte à Philippe-le-Roi.\nEt que sa voix prenait d'enthousiasme Athènes,\nEn envoyant au cœur des ennemis, l'effroi.\n\nSes pensers sont naturels et sublimes\nEt plus parfaits que ceux de Cicéron,\nLorsque son éloquence interdisait les crimes,\nLes infidélités, les forfaits de Verron. (1)\n\nSon génie est plus admirable\nQue celui de Brougham, de Pitt et d'O'Connell.\nIl est vif : il est adorable :\nC'est l'esprit inspiré du Fils de l'Eternel.\n\nO Jésus ! vous avez reçu de votre Mère,\nD'incomparables dons, les dons les plus heureux.\nVous avez éclipsé le chef-d'œuvre d'Homère.\nAristote et Socrate ont des livres fameux :\n\n(1) Je prends la liberté de traduire le nom de Verres—Verron.)\nL'une des merveilles du monde\nLes sept sages anciens, illustres fondateurs\nOnt fait preuve, il est vrai, de sagesse profonde ;\nIls se sont mis avant tous les législateurs.\n\nIls ont fondé des villes\nEt des peuples puissants.\nLeurs institutions politiques, civiles\nOnt rendu leurs pays, célèbres, florissants.\n\nMais j'ai beau m'appliquer à leur philosophie.\nJe ne trouve en eux rien qui puisse me sauver.\nVotre Evangile, O Christ, est sur quoi je me fie.\nVos lois, si je les suis, peuvent me relever.\n\nTous vos écrits sont bons : ils ont bien plus de grâce\nQue ceux de Tite-Live ; ils sont plus attrayants\nQue les Pages d'Ovide et les odes d'Horace\nIls sont toujours vrais et, quelquefois, effrayants.\n\nVous avez l'esprit gai du Vigneron qui verse,\nA tout moment, du vin dans sa coupe, à pleins bords.\nLe siècle est orageux : votre esprit le traverse\nAvec plus de grandeur qu'Henri cinq de Chambord.\n\nVous êtes plus affable en même temps plus grave\nQu'au milieu de sa cour, Louis quatorze le grand,\nVous planez au-dessus des triomphes d'Octave,\nO Jésus ! Je ne vois que vous de conquérant.\n\nC'est vous qui commandez aux empereurs, aux princes\nVous les encouragez : parfois vous les fouettez.\nTous les empires sont à vos yeux des provinces,\nLes royaumes ne sont pour vous que des cités.\n\nVous êtes l'héritier de tous les diadèmes,\nLes rois avec tous leurs honneurs\nEt leurs autorités suprêmes\nSont vos lieutenants-gouverneurs.\nEt les prêtres sont vos Ministres,\nCe sont eux qui me font savoir\nQue les joies du mal sont morbides et sinistres\nQu'elles mettent dans l'âme un nuage très noir.\n\nVos Ministres ont soin de mon corps, de mon âme,\nL'observation de vos lois\nConservent à mon cœur son premier feu : la flamme\nDe la vie, en laissant à mon esprit ses droits.\n\nVous avez copié notre belle existence\nSur vos penchants divins, sur vos affections.\nVous manqueriez de consistance,\nSi vous nous défendiez nos inclinations.\n\nMais ce n'est pas ce que vous faites.\nVous aimez que l'homme ait toute sa liberté.\nVous aimez qu'il se fasse et des joies et des fêtes,\nMais dans la régularité.\n\nVos lois veulent que ses actes\nArrivent mesurément,\nEn proportions exactes,\nDe ses forces sagement.\nLA SAINTE VIERGE.\n\nO Vierge digne de Louanges!\nVous ressemblez à l'Orient.\nImpératrice des Archanges\nJe me prosterne en vous priant.\n\nVous êtes plus douce et plus grande\nQue l'Impératrice Augusta,\nN'est dans la Puissance Allemande,\nOù la main de Dieu l'exalta.\n\nSainte Vierge! je vous salue,\nCar le Seigneur est avec vous,\nVous êtes maîtresse absolue\nDu ciel : l'épouse de l'époux.\n\nVous avez la première place\nDans l'empire du Fils de Dieu.\nL'aurore n'a pas tant de grâce\nQue vous ; votre amour est de feu.\n\nBénie entre toutes les femmes,\nJésus le fruit de votre sang,\nJésus le monarque des âmes\nVient de vous, tout éblouissant.\n\nIl est béni : les cieux l'adorent\nC'est l'Homme-Dieu ressuscité\nLes plus beaux feux du soleil dorent\nLe manteau de Sa Majesté.\n\nMère du Fils de Dieu ! Marie!\nPriez pour nous, pécheurs, maintenant.\nDotez l'Eglise et la patrie,\nD'un calme heureux et permanent,\nFaites que ma chère famille\nDonne au prochain de grands secours.\nQue mon sang régénéré brille\nEn travaillant pour Dieu toujours.\n\nPriez Dieu qu’il donne à Marguerite\nUn esprit de plus en plus franc,\nSauvez ma femme humble et petite,\nSauvez son cœur obéissant.\n\nVoilà plusieurs fois que ma plume\nEssaye, O Vierge, à vous chanter,\nMais par le mal qui me consume,\nJ’en arrive à me lamenter.\n\nBénissez notre heure dernière,\nProtégez-nous jusqu’au tombeau,\nAh ! soyez pour nous là lumière\nDu soleil qui se couche, beau.\n\nLes harmonies\nEn relief\nDes litanies\nDe Saint Joseph.\n\nTuteur de Jésus-Christ ! votre main droite et belle\nAvec le lys. Le nom que vous portez me rend\nLa paix : il réjouit l’Église universelle\nIl encourage l’homme en santé, le mourant.\n\nLe juste expire avec votre appui dans l’idée,\n\nLe Très-Haut qui voulut vous avoir pour gardien\nDe son Fils Bien Aimé dans l’antique Judée,\nVeut que vous demeuriez à jamais du chrétien\nL’espérance vivante et bien consolidée.\n\nAimable Saint Joseph ! glorieux charpentier !\nDu haut du ciel, vos mains protègent l’édifice\nDe l’Église du Christ, dans l’univers entier,\nL’archange St Michel ne fait pas d’autre office.\nAvec votre coutume et vos outils d'ouvrier\nTel que vous vous offrez à nous, dans les images,\nVous êtes mille fois plus beau que le laurier\nCouronné de ses fleurs : agréez nos hommages.\n\nJadis le Grand Roi Pharaon\nFit du premier Joseph son Intendant Suprême,\nEt le Dieu-Très Grand de Sion\nFait de vous maintenant le régent du ciel même.\n\nO Saint ! Notre Patron ! Priez pour Léon Treize\nEt pour son immense clergé ;\nPour la grande race française\nEt tout cet univers dont le pape est chargé.\n\nSaint Joseph ! Bénissez la pieuse Italie.\nPriez Dieu, s'il vous plaît, pour le peuple Espagnol ;\nPour l'Irlande qu'on humilie ;\nPour la Pologne dont les rois ont fait le vol.\n\nPriez Jésus pour la Bavière,\nPriez pour le peuple Autrichien :\nPriez que la Belgique étende la lumière.\nSoyez du Portugal le céleste soutien.\n\nSaint Joseph ! Protégez les nations chrétiennes,\nIntercèdez pour les Hébreux.\nPriez Notre Sauveur pour les Tribus Indiennes.\nEt pour les payens malheureux.\n\nVous êtes plus puissant par votre patronage\nQue jamais Empereur ne fut dans aucun âge.\n\nVous fûtes du Christ-Roi le père nourricier.\nVous eûtes soin de Lui, de sa divine enfance.\nSi je pouvais le dire à mon Dieu, sans offense,\nJe dirais : \"Saint Joseph est le seul créancier\nQue vous ayiez, Seigneur : exaucez les prières—\nQu'il fait pour nous aider d'indicibles manières.\"\nO Notre Dieu ! Merci que vous nous renvoyiez\nAux charitables soins de sa haute intendance ;\nEt qu'en nous le faisant honorer, vous voyiez\nA nous combler des biens de votre Providence.\n\nSaint Joseph ! Demandez à Jésus, s'il vous plaît,\nDe mettre dans mon âme un grand regret complet\nD'avoir transgressé sa loi Sainte :\nQu'il me donne un cœur pur, résolu d'observer\nCette loi désormais : un cœur plein de sa crainte\nEt qui, vers lui, toujours travaille à s'élever.\n\nSaint Joseph ! obtenez de Jésus qu'il me fasse\nEn premier lieu\nLa grande grâce\nDe chercher, de trouver le royaume de Dieu ;\nEt qu'il m'accorde\nSelon l'immensité de sa miséricorde,\nTous les biens précieux d'ici bas, par surcroit.\n\nPriez le Christ : Ah ! priez le qu'il daigne\nDe plus en plus faire arriver le règne\nDe la Vérité Sainte et celui du Bon Droit.\nVotre protection est visible et frappante.\n\nDe ma sanctification\nSaint Joseph ! élevez vous-même la charpente:\nAchevez la construction\nDe mon salut. Priez Dieu que je me repente,\nQue je sorte du mal dont mes pieds ont la pente.\n\nSoutenez-moi : je veux pratiquer la vertu\nSur le même chemin que Jésus a battu.\nQue je sois tout à fait saint, avant que je meure.\nAidez-moi, Saint Joseph ! jusqu'à ma dernière heure.\nSaint Joseph ! aidez-moi vous-même à m’assoupir\nD’un sommeil qui n’aît rien de fatal ni d’horrible.\nAssistez-moi vous-même à mon dernier soupir\nPour que ma mort soit douce, exemplaire et paisible.\nEt qu’aussitôt après avoir rendu l’esprit,\nJ’entre en partage, avec mon Sauveur Jésus-Christ.\nSaint Joseph ! vos vertus sont la belle atmosphère\nQue mes deux poumons ont besoin de respirer.\nBénissez-moi ! je suis l’humble thuriféraire\nQui vous encense ; puis-je assez vous admirer ?\n\nPriez afin que Dieu prenne en douce mémoire,\nLes fidèles défunt qui sont en purgatoire ;\nSurtout ceux qui me sont chers et plus attachés.\nQu’Il délivre aujourd’hui de la peine des flammes\nCeux de nos aieux dont les âmes\nOnt besoin que Jésus efface leurs péchés.\n\nVoilà vingt ans passés que j’ai perdu mon père\nEt qu’il dort le sommeil inconnu du trépas.\nLe bras dur de la mort m’a pris des sœurs, un frère\nTrès aimés. Saint Joseph ! Ne les oubliez pas.\n\nConduisez-les au ciel, s’ils n’y sont pas encore.\nIls ont remis à Dieu leur âme, en vous aimant.\nVite, délivrez les, puisque je vous honore.\nIls vous ont invoqué jusqu’au dernier moment.\nL'ARCHEVÊQUE DE SAINT BONIFACE\n\nAlexandre Antonin Taché!\nVous avez accompli des œuvres qui m'enchantent.\nDu haut des Monts-Rocheux, mon front se tient penché\nSous votre main. Mon cœur et mon esprit vous chantent.\n\nVous avez été fait prêtre chez les Oblats\nA la fleur de votre âge. Et depuis, vos années\nOnt été pour le Dieu qui vous les a données.\nEvêque à vingt-huit ans, actif et jamais las,\nVous avez établi des missions nombreuses,\nNonobstant la misère et des peines affreuses.\nVous êtes grand devant moi, parmi les prélats.\n\nVous avez du Sauveur annoncé les maximes\nAu milieu de plusieurs tribus.\nVos leçons ont fermé sous leurs pas des abîmes\nD'erreurs et des gouffres d'abus.\n\nVous leur avez donné la loi surnaturelle\nEt tous les préceptes divins\nDe la religion du Christ qui prend sur elle\nD'effacer les péchés, et qui hait les dévins.\n\nSous votre épiscopat, les familles Métisses\nOnt fait plus de progrès en trente ou quarante ans\nQue des gouvernements riches, pleins d'injustices\nLeur en auraient fait faire en un siècle de temps.\n\nL'éducation eut votre sollicitude:\nPlusieurs qui sont instruits ne le doivent qu'à vous,\nCe fut votre habitude\nDe travailler pour tous,\nVos travaux dont je vois briller la noble trace\nSont plus profonds que ceux du Congrès dans l'Utah.\nMonseigneur, vous avez parmi nous plus de grâce\nQue Minnéapolis dans le Minnesota.\n\n***\n\nVous êtes le pivot de la foi catholique\nAutour duquel, Métis canadiens et français\nViennent s'amalgamer sans cesse et sans réplique\nDans ce Nord-Ouest où Dieu leur donne un accès.\n\nLes Métis canadiens français\nGrandiront sous votre guidance.\nCe triple nom vivra grâce à la Providence\nJ'en serais moins certain si je n'obéissais.\n\nMonseigneur, la beauté de vos vues se déroule\nDevant les émigrants en foule\nComme le sol du Nebraska\nVotre voix est édifiante.\nVotre parole sainte est plus fortifiante\nQue les eaux de Kamouraska\nNe le sont à ceux qui s'y baignent\nHeureux\nSont ceux\nQui vous aiment et qui vous craignent.\n\n***\n\nSoixante et dix vous fait honneur,\nVotre autorité salutaire\nA fait du bien à l'Angleterre,\nSa Puissance vous doit, je pense le bonheur\nDes œuvres qu'Elle vante à la Rivière Rouge,\nMais elle m'a fait mal, aussitôt que je bouge,\nJe sens l'horreur des coups que son bras m'a portés,\nMonseigneur, je vous remercie\nD'avoir pris votre part de nos difficultés.\nAssuré que, sans vous, une tombe noirce\nCouvrirait à jamais les cendres de mon corps,\nOn parlerait de moi comme on fait des victimes\nDe trente-sept, l'Eglise et mes amis intimes\nReconnaîtraient, c'est vrai, mes généreux efforts,\nMais je serais parmi les hommes qui sont morts.\n\nD'ailleurs, vous le savez, j'ai compris votre rôle ;\nPuisqu'au moment voulu, j'ai pris votre parole.\n\nChaque fois que vos pieds partaient pour Ottawa,\nVous me paraissiez suivre une route aussi rare\nQue le Mississipi, lorsque son eau sépare\nLes Illinois de l'Iowa.\n\n***\n\nC'est la religion qui vous a fait prospérer.\n\nEn dix-huit cent soixante et onze, le Saint Père,\nQue nous aimions vous fit monter\nDans la Sainte hiérarchie.\nEn vous fortifiant aux yeux de l'anarchie\nQue vous travailliez à dompter.\n\nLe Pontife régnant de la ville de Rome\nDésireux d'honorer l'archiépiscopat\nVous y promît ; afin que se développât\nDe plus en plus votre œuvre approuvée du grand homme.\n\nL'évêque de St-Albert\nS'inclina devant vous, avec son diocèse\nEt la tribu Montagnaise\nEt les autres indiens que son clergé dessert.\n\nVous avez un ami fidèle\nUn confrère prudent, un apôtre modèle\nDans Monseigneur Vital Grandin,\nSes travaux courageux dissipent les ténèbres\nAu loin : et deviendront, peut-être, plus célèbres\nQue les exploits de Saladin.\nJ'ai pu connaître un jour sa charité parfaite,\nSon souvenir revient souvent\nEgayer mon cœur comme un souvenir de fête,\nJe sens qu'il fait gaudir ma plume en écrivant.\n\nIls savent ce qu'ils font ceux qui l'ont mis au faîte.\n\n***\n\nLe Saint Evêque d'Anemour\nQui donne à Jésus-Christ, aux pauvres, son amour,\nAvance\nEt lance\nSes prédications avec votre support,\nAussi bien qu'il peut dans le Nord.\n\nSa grandeur qui vous doit le respect de sa Mitre\nVous est soumise avec ses pouvoirs et son titre.\n\nJe me souviens toujours de Monseigneur Faraud,\nJadis auprès de vous, il a dit quelque chose\nPour m'aider. Maintenant je peux en dire un mot,\nCe mot : c'est merci ; c'est le mot couleur de rose.\n\nL'Evêque d'Ermidel; son cher coadjuteur,\nChaussé de la raquette et de sa pesanteur,\nSouffle le dévouement dont son âme est saisie\nDans l'Athabasca-McKenzie,\nTout droit au Pôle dont son zèle a la hauteur.\n\nDe quel pays heureux est donc originaire\nCe courageux missionnaire ?\nAh ! c'est du beau pays de France ; Eh bien ! Salut !\nEmparez-vous du Nord. Faites fondre la glace\nAu feu de votre cœur, infatigable élu !\nPrêchez ! Faites du bien ! Qu'un Dieu Bon vous en fasse !\n\nArchevêque Taché ! Vos grands Vicariats\nApostoliques, sont d'autorité plus forte\nÀ mes yeux de chrétien, que les Viziriats\nAutrefois si fameux de la Sublime Porte.\nVous pouvez bien mettre les gants\nBlancs de la grâce et ceux de votre Seigneurie,\nHabillez-vous dans la soierie\nDes grandeurs de l'Eglise ! ah ! vos pieds élégants\nOnt le droit de chausser la céleste chaussure,\nPuisqu'en vous infligeant mainte et mainte blessures\nVous avez fait les pas du ciel... Vos suffragants\nOnt en soin le beau champ de votre immense course,\nIls gravitent autour de votre trône aimé\nComme autour du Pôle allumé\nLes étoiles de la Grande Ourse.\n\nLes Monts-Rocheux sont des remparts\nQue franchit aisément le feu de vos regards.\n\nVos juridictions, votre archidiocèse\nNe comprennent-ils pas la Colombie Anglaise ?\n\nMes illustres Seigneurs d'Herboniez et Durien,\nAngéliques acolytes\nVous servent au nom de Dieu.\nIls ont le cœur plus pur que les aérolites\nDont l'éclat se répand au milieu de la nuit,\nSous la voûte des cieux, sans y faire de bruit,\nLa mer vient vénérer sur les sables sauvages\nLe Préalat de Marcopolis.\nEt son front se prosterne, humble, sur ses rivages,\nDevant la crosse d'or de Militopolis.\n\nLa mer vient encenser de sa vague éloquente\nVotre autorité dans ses ports.\nEt de ses beaux rouliers la caresse fréquente\nEmbrasse votre sol, en chérissant ses bords.\n\nVous êtes revêtu de la Grâce Divine.\n\nLe plus beau des océans\nFait monter comme en colline\nSa lame pour tâcher de vous voir : il incline\nPour vous ses flots bienséants.\n\n* * *\nLe soleil qui descend de l'horizon a hâte\nDe passer les pays situés au nadir,\nIl court toute la nuit; jusqu'à ce qu'il éclate\nDu côté de l'aurore, où je le vois bondir\nLe matin, pour venir se mêler à la grâce\nQui plane sur l'archevêché,\nD'Alexandre-Antonin Taché.\n\nL'Eglise de St Boniface\nN'éprouve jamais de chagrin,\nSans que le ciel le plus serein\nSe contriste et devienne sombre;\nSans qu'on entende au loin le tonnerre gronder\nEt peu de temps après la foudre se fronder\nDans des nuages dont Dieu seul connaît le nombre.\n\nJe sais que les politiciens\nOnt leurs enjeux de politiques,\nPour déconcerter ou pour gagner la critique;\nLes plus francs ont leurs ruses et leurs petits moyens\n\nMais votre conduite est circonspecte, honnête.\nDes motifs élevés guident vos actions,\nJe vous ai vu parmi les chefs et les champions:\nVous étiez plus grand qu'eux tous, de toute la tête.\n\n***\n\nCombien n'avez-vous pas pris de précautions\nPour tâcher d'adoucir l'amertume des luttes?\nAh! Lorsque vous voyez se succéder mes chutes\nVotre voix me donnait des bénédictions.\n\nVous avez expliqué dans vos écrits lucides\nLe sens de mes succès, celui de mes revers,\nEt vos lettres bien que placides\nOnt souvent flagellé des ennemis pervers.\n\nLes enfants de St Jean-Baptiste\nEt la multitude orangiste\nParlaient en toute occasion\nDe se mettre en collision,\nIls étaient partis pour se faire\nLa lutte la plus sanguinaire,\nMais par votre intervention\nVotre grâce a su mettre un terme\nÀ la grande irritation\nDes esprits, vous avez eu la main large et ferme.\n\nEt poussant cri sur cri plaintif\nVous avez de la paix enfin gagné la palme.\nVous avez rassis dans le calme\nVotre cher pays adoptif.\n\nVous serez dans l'histoire aussi grand qu'un colosse\nEntre le Nord-Ouest et le Haut-Canada,\nVotre Pallium fait honneur au Sacerdoce,\nEt votre nom s'étend comme le Névada.\n\n***\n\nSi ma poésie est œuvre de bon poète,\nJe l'offre à votre Grâce ; et j'en ai du plaisir,\nMa langue, Monseigneur, serait presque muette\nSi vous ne m'aviez pas aimé pour me choisir\nComme vous l'avez fait d'une manière aimable\n\nLorsque j'avais douze ans,\nJe me souviens toujours de quel air agréable\nVous m'avez désigné parmi beaucoup d'enfants,\nEn disant : \"Nous pourrions, je crois, le faire instruire,\"\nOh dix-huit cent cinquante-huit !\n\nÀ mes yeux charmés, c'est Dieu qui vous a fait luire !\nVous êtes l'année, où jeune, l'on m'a conduit\nDans le noble pays de la Nouvelle France\nPour me sauver de l'ignorance\nEt des profondeurs de sa nuit !...\n\nGrâce à vous, Monseigneur, j'eus ma place au collège\nDes Sulpiciens de Montréal\nJ'eus l'éducation qu'approuve le Saint-Siège,\nEt ma jeunesse a vu clair. Le feu boréal\nDe l'enseignement catholique\nEclaira l'horizon de mon heureux printemps,\nJ'ai reçu dans mon cœur ses rayons éclatants.\nJ'ai compris la lumière, et j'ai vu dans sa marche\nLes doux efforts que font vers le ciel ses tirants.\nJ'ai vu droit au zénith la beauté de son arche,\nEt tout autour de moi ses immenses courants.\n\nL'Eglise est un foyer de lumière électrique ;\nLa Sainte Eglise apostolique\nEt Romaine m'a fait contempler l'idéal\nDu bien dans Jésus-Christ, et la vertu possible.\nSur les pas de son chef visible\nQui seul est Pape-Roi de l'ordre social.\n\nLe jour où mon pays eut besoin de mon aide,\nJ'embrassai de ses droits le chemin lumineux,\nPour obtenir, après des travaux épineux\nLa constitution des forces qu'il possède.\n\nJ'ai tâché, comme font les gens vraiment instruits,\nD'avoir soin du présent, en vivant de constance,\nJ'ai tâché de porter pour l'avenir des fruits\nComme doit en donner tout arbre d'importance.\n\nAussi suis-je certain d'avoir édifié\nLes pauvres et les bons, même d'injustes hommes,\nEt je suis sans chagrin d'avoir mortifié\nLes ambitieux dont j'ai refusé les sommes.\n\nMais sans votre protection,\nSans la brillante instruction\nDont les prêtres que je vénère\nM'ont fait don sous le toit de leur beau séminaire ;\nAh ! sans vos bienfaits, Monseigneur,\nComment aurais-je pu m'élever à l'honneur\nD'écrire mon nom dans l'histoire ?\nJamais, sans vos bontés, je n'aurais eu la gloire\nDe me trouver en lutte avec ces millions.\nD'hommes dont j'ai bridé les fortes passions.\nAh ! Si la charité que vous avez nourrie\nPour moi, dès mon bas âge ! Ah ! Si votre Grandeur\nN'avait pas fait de moi l'homme de ma patrie,\nJamais des bons combats je n'aurais eu l'ardeur !...\n\nEt jamais je n'aurais reçu les doux hommages,\nLe soutien généreux, le grand appui moral\nDont le peuple rural,\nLes cités, les villages\nDu Bas-Canada, se sont plu\nÀ m'honorer ; jamais je n'aurais vu les dames\nLes filles de Chambly, tant d'autres nobles femmes,\nS'expliquer d'une voix et d'un cœur résolu\nÀ Lady Dufferin ; et la presse de dire\nAu représentant de l'empire\nAu vice-Roi son fier époux,\nQue les Métis étaient frappés d'injustes blâmes,\nEt que cinquante-huit millièrâmes\nEtaient en deuil de voir leurs chefs sous les verrous.\n\nJamais les filles Angéliques\nDes cloîtres canadiens n'auraient, dans la ferveur\nDe leurs vœux et de leurs pratiques,\nSoupirées vers le Dieu du ciel en ma faveur !...\n\nMes yeux n'auraient jamais contemplé le spectacle\nD'un archevêque de Québec,\nS'adressant à la Reine, avec,\nLa prévoyance d'un oracle,\nPour aviser Sa Majesté\nD'agir vis-à-vis nous selon la probité\nQue l'Etat doit toujours à ses chargés d'affaires ;\nEt pour prier la Royauté\nDe se conduire envers nous, avec loyauté.\nPuisque les sommités avaient été bien fières\nDe vous autoriser du ton le plus flatteur\nEn termes généraux et pleins de latitude\nÀ vous rendre chez vous, en Pacificateur,\nAfin d'y mettre un terme à notre inquiétude.\nÀ tout le trouble dont le gouvernement rude\nD'Ottawa, seul était l'auteur.\nJamais je n'aurais vu l'épiscopat sublime\nDe la Nouvelle-France intervenir, aider\nAvec sa force, avec son clergé magnanime ;\nEt d'accord avec vous, tout ensemble, plaider\nPour tout un peuple, auprès du trône,\nEt je n'aurais pas l'agrément\nQue la Providence me donne,\nDe savoir qu'aujourd'hui le noble document\nDe la Pétition épiscopale, bonne,\nAttend après ses fruits et mûrit doucement\nDans les Bureaux de la Couronne.\n\nArchevêque Mon Bienfaiteur !\nPuisque vos pieds saints m'ont cherché dans la chaumière\nMétisse, pour ouvrir mes yeux à la lumière !...\nAh ! puisque vous m'avez servi de bon tuteur,\nIl convient que je vous renvoie\nAvec humilité les fiertés de ma joie\nEt tous ces éloges d'État\nQu'a daigné me donner la Presse Américaine\nLorsque ses grands journaux se sont donnés la peine\nDe voir et d'empêcher qu'on ne vous molestât.\n\nLe nom de Louis a brillé : sa renommée\nVous appartient. Elle est à vous.\nLa parole de Dieu que vous avez semée\nEn lui, vous fait du grain qui monte à vos genoux,\n\nSes vues sont les épis d'une moisson mouvante,\nQui du soleil ont eu la chaleur au besoin,\nQue les orages ont arrosé avec soin,\nL'air les fait onduler, balancer, quand il vente.\n\nLe champ de mes pensées, sous un temps trop couvert.\nNaguère encor, c'est vrai, paraissait un peu vert.\nMais enfin la récolte est mûre\nElle est grande à pleine clôture,\nRécoltez, Monseigneur ! Le peuple Anglo-Saxon\nNe s'en fâchera pas. Il sait que la récolte\nNe peut pas s'appeler révolte.\nCommencez, s'il vous plaît, faites votre moisson.\n\n***\n\nJe recommande à tous ceux qui sont bons, cette ode,\nJe l'ai faite en vous célébrant.\nQue le bon Dieu le veuille ! Et ce sera la mode\nDe réciter ces vers que j'adresse, en souffrant,\nA Monseigneur Taché-le-Grand.\nJOSEPH DAMIANI.\n\nSUPÉRIEUR DE LA MISSION SAINT PIERRE, MONTANA.\n\nSur la coulée aux Saulés-Plates\nUn prêtre promène ses pas.\nIl nous civilise ; il nous flatte\nEt ne nous abandonne pas.\nEt pour nous sa puissance éclate\nAu delà même du trépas.\n\nPendant la vie il nous console,\nIl nous instruit comme il le faut,\nEt sa vertueuse parole\nCorrige en nous plus d'un défaut,\nLorsqu'enfin la mort nous immole\nIl nous aide auprès du Très-Haut.\n\nL'amour céleste du bon Maître\nLuit dans le regard de ses yeux.\nQuel est l'endroit qui l'a vu naître ?\nAh ! Dites nous quels sont les cieux\nQui nous ont envoyé ce prêtre\nAussi dévoué que pieux ?\n\nIl vient de la belle Italie,\nDe la ville de Tivoli.\nSa charité qui se publie\nNe sera pas mise en oubli.\nÀ nos bons désirs, il se plie,\nC'est le jésuite accompli,\nIl prêche le bien qu’il pratique,\nC’est un ange de Bon-Conseil.\nDans cette grande république,\nC’est lui qui nous tient en éveil.\nSa résidence Monastique,\nEst à la Rivière-au-Soleil.\n\nJe me livre et me recommande\nAu pouvoir dont il est muni,\nVos ordres ont force plus grande,\nPrêtre Joseph Damiani,\nQue ceux du Lord, chef de l’Irlande\nDans le sein du Royaume-Uni.\n\nCharitable Missionnaire !\nL’esprit que Dieu vous a donné,\nNous conserve et nous régénère.\nAu ciel soyez-en couronné.\nLe peuple métis vous vénère,\nCar il possède un cœur bien né.\n\nVos pensées sont plus élevées\nQue la montagne du Grand-Bois,\nVos vertus sont mieux éprouvées\nQue l’or pur des anneaux des Rois,\nLes voies du ciel que j’ai rêvées\nS’aplanissent quand je vous vois.\n\nVotre âme est plus belle et plus pure\nQue l’Eternel Ceinturon Blanc\nDes Montagnes de la Ceinture,\nLe vent du ciel en s’élevant\nN’a pas un aussi beau murmure\nQue votre voix en nous parlant.\nAU REV. PERE JESUITE FREDERICK EBERSVILLE\n\nCURÉ DE BENTON, MONTANA.\n\nPrêtre Fréderick Ebersville!\nVous êtes éclairé; Vous êtes affermi\nDans les sentiers de l'Evangile.\nVos instructions sont bien celles d'un ami.\n\nJe sais que vous m'aimez. Votre amour pour mon âme\nS'inspire au Sacré-Coeur même de Jésus-Christ.\nVotre prière ainsi qu'un pieux télégramme\nMonte, quand vous voulez, droit au divin esprit,\n\nAyez la charité, mon Père, et la tendresse\nDe vous intéresser en ma faveur, afin\nQue Dieu m'aide à présent que le besoin me presse.\nLe prêtre qui prie est autant qu'un Séraphin.\n\nDemandez au Seigneur que son salut descende\nDu ciel sur moi qui suis de bonne volonté.\nComme prêtre approuvé votre influence est grande\nAuprès de ce Dieu dont vous prêchez la bonté.\n\nVos supplications lui sont plus agréables\nQue les parfums de l'encensoir.\nSouvenez-vous de moi dans les cris ineffables\nQue vous poussez vers Dieu le matin et le soir.\n\nVotre piété solide\nEst un grand arc bien tendu\nQui décoche au Très-Haut son trait juste et rapide,\nSon trait le plus assidu.\nVos oraisons jaculatoires\nSont des éclairs éblouissants.\nElles sont aussi méritoires\nQue des présents d'or pur et de myrrhe et d'encens.\n\n***\n\nLorsque votre prière éclot du sanctuaire\nEt s'élève vers l'Eternel ;\nLorsque vous récitez votre saint breviare,\nLe son de votre voix est grave et solennel.\n\nVotre voix suppliante est pleine d'harmonie.\nToutes vos oraisons sont d'admirables chants.\nQue des armées d'Élus écoutent, réunies,\nParce que tous vos vœux, mon père, sont touchants.\n\nLa Vierge vous bénit. Les célestes phalanges\nPrient pour vos pénitents qui font bien leurs aveux.\nEt selon vos désirs, le plus parfait des anges\nFait monter jusqu'à Dieu le moindre de vos vœux.\n\nVous conseillez le bien, tout ce qu'il a d'aimable,\nVous voulez à tout prix qu'on haïsse le mal,\nVous voulez que chacun vise à l'état normal,\nEt s'abstienne avec soin de tout acte blâmable.\n\nVous faites ce qui plaît à Dieu, ce qui lui plût,\nCe qui plaira toujours à sa vie éternelle,\nVous vous tenez pour moi sans cesse en sentinelle,\nVous gardez jour et nuit les portes du salut.\n\nPrêtre ! vous me donnez l'exemple\nDes grandes vertus. Le regard\nFixé sur vous, je vous contemple,\nDieu vous a mis plus haut parmi nous dans son temple\nQue ses mains, dans le ciel, n'ont mis le St. Bernard.\nLes côtes de Benton sont moins belles, moins blanches\nSous la neige de leurs hivers\nQue vos épaules, les dimanches,\nQuand vous priez pour l'univers ;\nEt que tous vos habits éclatent\nDe splendeur, proche des autels\nOù mes yeux attentifs constatent\nCombien vous dominez le commun des mortels.\n\nLorsque vous élevez vos deux mains vers la voûte\nDe l'église et des cieux,\nQue je vous vois prier et que je vous écoute ;\nJe demande à mes yeux\n\nSi vos mains ne sont pas des ailes.\nQui s'ouvraient ainsi pour prendre leur essor\nVers les régions éternelles\nOù Dieu règne à jamais dans son royaume d'or.\n\nPrêtre ! vous ressemblez à la Butte-Carrée,\nQue j'aperçois d'ici, qui se tient séparée,\nDes montagnes ; et qui, s'élevant à l'écart\nGuide le voyageur en fixant son regard.\n\nJe veux rester soumis à votre Révérence,\nMon respect envers vous n'est pas superficiel,\nLes plis de votre aube ont la riante apparence\nDes blanches nuées du ciel.\n\nCe cordon de laine pure\nQui vous ceint d'un triple tour,\nN'est-ce pas une ceinture\nDont la beauté ressemble à la barre-du-jour ?\n\nVous me semblez dix fois plus fort par votre étole\nQue ne fut par le glaive autrefois Du Guesclin.\nVous êtes plus grand en parole\nQue le prince Bismarck aujourd'hui dans Berlin.\nVotre manipule est auguste,\nC'est un ornement simple autant que fastueux,\nQui rend beau votre bras sur lequel il s'ajuste,\nLes Empereurs n'ont rien d'aussi majestueux.\n\nLorsque je vois durant la Messe, la chasuble\nRépondre aux mouvements de vos reins droits et forts,\nIl me semble que c'est l'eau haute du Danube\nQui s'agite à mes yeux, en saluant ses bords.\n\nLes actions de votre vie\nPrêtre Ebersville, sont belles comme le Rhin,\nSi l'Eglise du Christ, hélas ! est asservie,\nVous savez la distraire au moins de son chagrin.\n\nLe nom de Waxweiler, votre place natale\nVivra toujours dans mes essais,\nCar l'attention générale\nEn devenant impartiale\nMettra peut-être en vogue un jour mes vers français.\n\nQue Dieu récompense la Prusse\nDe vous avoir fait naître. Il faudrait que je fusse\nIngrat, pour oublier ce pays glorieux\nQui donne au monde de saints prêtres,\nQui donne à l'Europe des maîtres\nDont la Magnificence éclate à tous les yeux.\n\nO Prusse ! vos soldats ont eu force en campagne,\nEt vous avez gagné l'Empire d'Allemagne,\nMais vos prêtres en Mission\nDans les divers endroits du monde,\nOnt mis peut-être une main plus profonde,\nQue vous pensez, à la perfection\nDe votre Victoire\nEt de votre gloire.\nRECONNAISSANCE\n\nFabien Barnabé sommeille\nDu profond sommeil des morts,\nL'aumône qu'il a faite est un flambeau qui veille\nSur les restes de son corps.\n\nIl a fini ses jours ; mais son âme chérie\nVit... Mon Dieu ! vous savez qu'il aimait votre loi !\nSouvenez-vous, je vous en prie,\nDe son dernier soupir de foi !\n\nPayez-le de m'avoir aidé dans la souffrance,\nSon cœur était rempli d'abandon sage à vous,\nJe sais que vous aimez, O Jésus trois fois doux,\nLe Tou-Beau (Tombéau) de son espérance.\nMon Dieu ! Souvenez-vous qu'il se trouvât inhumé\nDans une terre sainte ; et qu'il est embaumé\nDans le Serre-Cueil (Cercueil)\nDe sa charité.\nIl a passé, Seigneur, comme passe une feuille,\nPayez-le, maintenant, pour ce qu'il m'a prêté.\n\nLOUIS \"DAVID\" RIEL.\n\nCeci est la vraie copie d'un document écrit et composé par Louis \"David\" Riel.\nSur quoi nous certifions et apposons nos signatures.\n\n(Signé) JOSEPH RIEL\nALEXANDRE RIEL\nHENRIETTE POITRAS.\n\nDaté à St-Vital, 12 janvier 1886.\nA SIR JOHN A. MACDONALD.\n\nSir John A. MacDonald gouverne avec orgueil\nLes provinces de la Puissance.\nEt sa mauvaise foi veut prolonger mon deuil\nAfin que son pays l'applaudisse et l'encense.\n\nAu lieu de la paix qu'il me doit,\nAu lieu de respecter d'une manière exacte\nNotre Pacte\nEt mon droit,\nDepuis bientôt dix ans, Sir John me fait la guerre.\nUn homme sans parole est un homme vulgaire,\nFort ou faible d'esprit, moi, je le montre au doigt.\n\nIl a voulu jeter dans la sombre disgrâce\nLe prélat de Saint Boniface,\nEt se voyant mal pris il a feint la candeur,\nIl s'est montré gentil pour plaire à Sa Grandeur,\nIl commissionna le Pontife Alexandre\nD'apaiser les métisses justement soulevés :\nEt de ne pas manquer de leur laisser entendre\nQu'ils avaient, après tout, bien fait de se défendre\nPuisque les MacDougall et les Schultz dépravés\nEtaient dûment désapprouvés\nDe nous avoir causé toutes sortes d'alarmes\nEn prenant contre nous les armes\nSans l'autorité\nDe Sa Majesté.\n\nEh ! comme de raison, il voulait faire croire\nAu gouvernement Provisoire\nQu'Ottawa renonçait à la duplicité\nEt rejetait le mal qu'il avait médité\nContre nous, et saurait prendre une politique\nÀ notre égard, conforme à la saine critique.\nSir John eut du bonheur, car l'envoyé sacré\nAgit et parla comme il avait espéré.\n\nQui peut dire autrement? L'évêque a bien fait l'œuvre\nPour convaincre, il jura la parole d'honneur,\nMais au lieu d'accomplir, Sir John fit la couleuvre,\nLe traître, il a fait honte au noble ambassadeur.\n\nIl a laissé hurler sa province enragée,\nIl ne l'a pas guidée, il n'a su que flatter,\nEt John, dans ses erreurs, l'a même encouragée.\nCet homme n'a jamais rien fait pour racheter\nLa parole d'honneur qui se trouve engagée.\n\nIl a trompé l'Évêque, et puis l'a démenti-\nÀ mots couverts, avec assez de politesse\nPour cacher sa scélératezse,\nEt contenir ses gens sans nuire à son parti.\n\nIl a beau revêtir des façons imposantes,\nIl a beau se fier sur son habileté,\nIl rendra compte un jour, au Seigneur irrité,\nDe ses injustices criantes.\n\nSes discours sont fins ; c'est le chef du Parlement,\nIl est assis parmi les princes du royaume,\nMais à peine Sir John sera-t-il un atome\nLorsque Dieu le fera paraître au jugement.\n\nEt qui sait même, dès ce monde,\nS'il ne faudra pas qu'il réponde\nDe n'avoir été qu'un méneur\nSans principes et sans honneur.\n\nTandis que ce géant des Communes étale\nDevant Son Altesse Royale,\nSes qualités de diplomate,\nMoi je me fortifie, et mon cœur se dilate,\nDans ce que la souffrance offre de plus exquis.\n\nJ'offre à Dieu de grand cœur tous les maux que j'endure,\nAfin que son esprit souffle à mes ennemis\nDe n'avoir pas la main trop dure.\nVis-à-vis mon peuple soumis.\n\nLe candidat battu de Kingston s'est permis\nPlus d'une ruse en sa carrière,\nC'est ainsi qu'il ternit sa réputation ;\nUn renard hors de sa tanière\nFait aussi bien des tours dignes de mention.\n\nEt souvent Sir John tache encore sa renommée\nAuprès d'une carafe, en abusant du vin,\nEt quand bien même la fumée\nDe son cigare est parfumée\nCela l'empêche-t-il d'être un ministre vain ?\n\nEn dix-huit cent soixante et treize\nQuand Lépine fut en prison ;\nQue le Manitoba se tordait de malaise\nEt qu'on me traquait sans raison\n\nSir John offrit trente-cinq mille piastres\nSi je voulais déserté pour trois ans\nMa nation dans ses désastres ;\nEt laisser mon ami Lépine, dans le temps\nQue ses mains et ses pieds portaient des fers sanglants.\n\nAh ! Je me suis trouvé content de voir à terre.\nUn bon matin, Sir John avec son ministère !\n\nCependant ses projets sont beaucoup moins étroits\nQue ceux d'Édouard Blake et ceux de MacKenzie.\nSi Blake s'est fermé l'avenir, c'est la fois\nQu'entraîné par la frénésie\nIl a voté le prix du sang,\nEt qu'au mépris de la justice\nIl a sauté de haut sur un peuple innocent,\nEt maudit, dans ses chefs, la nation métisse.\n\nMacKenzie est un homme à peu près dépensé.\nSon règne de cinq ans l'a bien récompensé\nDes services qu'il a pu rendre\nAux amis qu'il avait. Nous l'avons vu descendre\nDu pouvoir, degré par degré.\nIl perdait tous les ans, sans y manquer, des votes,\nSes mesures étaient toutes un peu manchotes.\nCet homme fut chétif; ce me semble, à son gré,\nPersonne ne l'a dénigré.\nUn autre a pris sa place, il a perdu son siège.\nOn a pour lui le cœur plus froid que de la neige.\nC'est un chef demi-mort que j'aperçois debout.\nPeut-être avant longtemps fera-t-il la culbute.\nIl peut dans son comté faire encore une chute.\nJe respecte son âge. Ah ! le vieux Marabout.\n\nSir John A. MacDonald a du prestige, certes,\nSi ses amis de l'Est l'ont laissé sans appui,\nLa Colombie Anglaise a réparé ses pertes,\nEt l'un de ses comtés a tout voté pour lui.\n\nSir John se trouve encore une fois au pinacle\nQuoiqu'il soit très habile et leste à se jucher,\nOn peut presque s'attendre à le voir trébucher\nBientôt. Et ce sera peut-être au moindre obstacle.\n\nIl discourt en faveur de la Protection,\nMais il frappe Lépine et moi d'oppression.\nCet homme fait dommage à sa cause Ontarienne\nEn y subordonnant la cause Canadienne.\nEt pendant que Sir John tourne ses plans en loi,\nMoi je coupe et je fendis mon bois,\nJe nettoye humblement tous les jours une étable.\nJe méri; je médite; et je suis équitable;\nNon pas autant qu’il faut, mais autant que je peux,\nSir John gouverne avec les loges débridées\nD’Orange, il les soutient, moi je souhaite et veux\nConduire en m’appuyant sur les bonnes idées.\n\nQue l’anglais soit ce qu’il voudra\nQu’il soit religieux à sa manière anglaise.\nIl faut que moi je vive autant qu’il me plaira\nSelon la bonne foi catholique et française.\n\nS’il veut me gêner là-dessus,\nJe saurai conserver dans mon âme assez forte\nLes principes que j’ai reçus.\nJe me rirai de lui, je passeraï sa porte\nEn disant :\n“Malfaisant”\n“Que le Diable, après tout, si tu le veux, t’emporte.”\n\nO Dieu Puissant ! Daignez protéger les Métis.\nQue déjà les Anglais ont presqu’anéantis.\n\n***\n\nLe Lac Ontario dans un jour de tempête\nDésempara la goëlette\nDe Sir John MacDonald. L’illustre Paria\nSe trouvait à la belle étoile\nParmi les naufragés, quand Ryan le pria\nDe venir remonter sa voile\nS’il pouvait, à tout risque, au marais du cajeu,\nAu milieu\nDes grenouilles\nQui chantent jour et nuit à l’ombre des quenouilles.\nSir John accepta. Mais quelqu’Ave Maria\nL’a sans doute chassé du comté de Marquette\nCar à peine essoufflé, le grand homme à la quête\nSe rendit à l’appel d’un gueux qui-lui cria\nEt s’en fut respirer l’air de Victoria.\nChassé des bords de l'Atlantique\nIl peut se reposer sur ceux du Pacifique.\nEn vérité, c'est consolant.\nMais à tout prendre, c'est tout de même étrivant.\nSir John n'a pas grand poids, si Kingston le garoque\nSans forcer, par dessus les montagnes de roche.\n\nJe ne souhaite pas, Sir John, que votre mort\nSoit pleine de tourments, mais ce que je désire\nC'est que vous connaissiez et souffriez le remords,\nParce que vous m'avez mangé, comme un vampire.\n\nL'horizon, tout le ciel m'apparaissait vermeil.\nVous avez accablé de soucis mon jeune âge.\nEt vous êtes sur moi comme un épais nuage\nQui dérobe à mes yeux la clarté du soleil.\n\nJ'espère voir la fin de vos pensées altières.\nVous avez fait le mal : et c'est ce qui détruit.\nVous tomberez peut-être avec le même bruit\nQu'on entend l'Ottawa bondir dans les Chaudières.\n\nVos moyens d'actions, John, ne sont pas les miens.\nMes amis ont souffert de ma grande folie.\nIls s'en consoleront car elle fut jolie.\nVous n'effacerez pas mon passé, car j'y tiens.\n\nVous, vous serez comme pour le hardi mensonge...\nC'est à vous que j'en veux pour ma proscription\nJe fais mon temps d'exil, et je mange mon rouge\nEt je suis, malgré vous, chef de ma nation.\n\nJe n'abandonne pas mon plan, je l'étudie.\nEt je l'ai travaillé d'une façon hardie.\nJ'ai trouvé ce que je voulais.\nJe vous connais à fond maintenant, peuple anglais.\n\nLe Bas-Canada n'est pas libre\nAvec vous, comme on le prétend,\nVous souffrez quand un nom canadien français vibre;\nVous tâchez de l'abattre en le persécutant.\nVous avez rempli d'amertume\nLa grande âme de Papineau.\n\nEt notre historien Garneau\nNe vous a pas encore mis assez sous sa plume,\nQuoiqu'il ait buriné souvent la vérité\nSur votre compte avec beaucoup de netteté.\n\nNous sommes, grâce à Dieu, nés pour les idées belles\nPour les actes d'honneur et de beau dévouement\nNous avons de l'essor pour les vertus réelles,\nMais votre faux gouvernement\nPèse sur nous sans cesse et nous coupe les ailes.\n\nVous voudriez remplacer notre religion\nPar vos idées philanthropiques.\nVos journaux possédés avec leurs philippiques\nGrondent, chacun leur tour, contre la légion\nDes Canadiens-français d'élite, hommes et femmes,\nQui travaillent pour Dieu, pour le salut des âmes.\n\nVous admirez nos sœurs pour haïr nos couvents,\nVous détestez nos séminaires\nAutant que nos missionnaires.\nEt moi je vous ai vu rire de nos savants.\n\nVous détestez tous ceux qui, dans le sacerdoce\nCombattent vaillamment les effets du poison\nQue vous donnez à grosse dose\nEn mettant, dans chaque maison,\nCette soif de l'argent et de la jouissance\nQui fait tomber le corps en dégénérescence\nEt qui fait aussi perdre à l'esprit sa raison.\n\nJ'ai voulu consacrer plusieurs de mes journées\nÀ sonder, comme il faut, quelles intentions\nVous avez, en faisant vos fréquentes tournées\nAux belles institutions\nDu Canada français:\nVisiteurs à maudire,\nVous y venez toujours pour trouver à redire.\nLa plupart d'entre vous, vous vous souciez peu\nD'être même polis. Vous entrez l'œil en feu,\nVous partez sans laisser le moindre bon sourire;\nCar vous ne savez pas aimer.\n\nLorsque vous me croyez pris de folie extrême\nMes oreilles cent fois vous ont ouï blâmer\nLes établissements de la charité même.\nQuand vous vous croyez seul, votre bonheur suprême\nEst de nous mépriser et de nous diffamer.\n\nDans le Bas-Canada, la classe gouvernante\nDit généralement qu'elle est fière et contente\nD'obéir à l'anglais; qu'il est pour nous, courtois\nEt bon de nous laisser faire nos propres lois.\n\nMais croit-on que l'anglais fera jamais outrage\nAux Canadiens-français qui font bien son ouvrage,\nL'anglais est égoïste et plein d'ambition,\nIl lui faut pour agents des âmes aussi viles\nQu'habiles.\nAussi s'applique-t-il, dans notre nation,\nÀ gagner les plus forts d'entre les plus serviles.\n\nCanadiens! L'anglais n'est ni droit ni généreux,\nC'est absolument le contraire,\nVous n'avez, pour le voir, qu'à bien ouvrir les yeux.\nVoulez-vous bien juger de la vieille Angleterre,\nMenacez de l'astreindre au traité de Paris.\nNon pas d'une manière infirme et libérale;\nMais dans l'acception très juste et littérale\nDe chaque terme; alors vous verrez tout le prix\nQue l'anglais fait de vous; il jetera des cris,\nIl vous prodiguera les plus grandes injures,\nIl traînera, s'il peut, tous ses arguments faux\nDevant le Parlement, devant les tribunaux.\nSes cours, contre vos chefs, produiront des parjures,\nEt quand, douze jurés, embrouillés et confus\nAuront tous, sur les bancs qui leur servent d'affûts\nFait entendre un verdict de haine Anglo-Saxonne,\nUn Lord parlant au nom de sa propre couronne\nEt de sa fureur, écrira\nAu grand chef d'Ottawa, des lettres toutes croches\nQue ce méchant-ci publiera,\nPour vous administrer les plus sanglants reproches,\nL'un et l'autre indirectement.\n\nC'est ainsi que dernièrement\nCarnavon de sa voix arrogante et colère\nOutragea tant Lépine. Et l'infâme insulaire\nEmu jusqu'à l'emportement\nDe ma présence au Parlement\nEssaya de s'en prendre à la bonne Province,\nDe crainte que je ne parvinsse\nUn jour à réussir par le Bas-Canada,\nIl lui fit les gros yeux et le reprimanda\nA mon sujet, de la manière\nLa plus sotte et la plus grossière.\n\nNos évêques avaient fait leur pétition,\nCarnavon n'eut pas l'air d'y faire attention,\nIl télégraphia son espèce de prêche\nA l'hypocrite et fin gouverneur général.\nAussitôt celui-ci du fond de Rideau Hall\nOrdonna de livrer au public sa dépêche\nQui traitait le Québec d'aveugle et d'ignorant.\nAnglais ! Vous ignorez ce que c'est qu'être franc.\n\nCartage n'a jamais vanté sa foi punique,\nParce que ses enfants avaient encore du cœur.\nMais l'anglais d'aujourd'hui se vante sans pudeur\nDe sa justice Britannique.\nEt nous savons qu'il veut par d'infâmes leçons\nEt par tous les moyens nous rendre anglo-saxons.\nVos titres, votre argent, vos emplois, vos menaces\nGatent, à mon avis, surtout les hautes classes\nDu peuple. Vous aimez les principes nouveaux,\nVous voudriez que déjà notre foi fut perdue,\nAussi vous parlez fort sur l'influence indue,\nEt vous menez nos chefs comme des queues de veaux\nDans les chambres provinciales.\nEt dans les chambres fédérales.\n\nMais le Bas-Canada n'est pas fait pour périr,\nSes évêques sont prêts, je crois, à tout souffrir\nS'il le fallait, plutôt que de vous laisser faire\nQuand vous voulez les faire taire.\n\nLeur charge est de prêcher à temps, à contre-temps,\nVous savez, leurs discours seuls sont très importants.\nIls doivent s'opposer à l'orgueil, à l'envie,\nCar la légèreté de l'homme en cette vie\nTend sans cesse à lui faire oublier l'essentiel\nObéir au clergé, c'est le chemin du ciel.\n\nLes Évêques sont grands ; celui qui les méprise\nEst puni tôt ou tard, car Dieu les autorise\nQuand il leur dit d'aller prêcher les nations.\nLes peuples ont besoin dans leurs corruptions,\nEt les gouvernements dans la moindre entreprise\nQue les hommes de Dieu, suivant leurs missions,\nLes instruisent du vrai, leur enseignent sans cesse\nAu nom du Bon Esprit, les voies de la sagesse.\n\nTout homme dont le cœur est assez animal\nPour outrager le prêtre, ou lui faire du mal\nLui fait ce que les juifs ont fait au fils de l'homme\nLes prêtres zélés sont dans ce bas monde comme\nDes brebis au milieu des loups.\nMais si vous osez faire insulte à leurs lumières,\nLeurs pieds peuvent soulever de terribles poussières\nContre vous.\nEt Dieu leur prêterait l'appui de son courroux.\nA vingt lieues d'ici, Dieu peut lever des armées\nPlus promptes sur leurs chars que les aigles au vol;\nEt de qui les fureurs une fois allumées\nPourraient en quelques jours dévaster votre sol.\n\nNotre clergé dira ce qu'il doit dire en chaire.\nMettez-moi\nHors la loi.\nEt si vous me trouvez l'humeur encore trop fière,\nConsolez-vous, ma tête est toujours à l'enchère.\n\nQuoi! n'importe qui peut divaguer en public\nSur les hustings, pour ou contre le ministère,\nEt le juge de rien qui tient à l'Angleterre\nÀ ce qu'elle a de faux, comme un peu de mastic\nTient à la vitre, va gagner de faire taire\nNos prêtres! Ah! messieurs, vous aurez fort à faire\nÀ nous innoculer votre venin d'aspic.\n\nLe Bon Dieu m'a donné du cœur et de la taille,\nEt je ne mourrai pas sans vous livrer bataille\nLa bataille du bon sens\nEt celle du droit des gens.\nCe qui me rend fort, c'est un dévouement sans borne.\nJe suis homme à sauter dans l'arène à pieds joints,\nJohn Bull m'a trop fait mal avec ses coups de corne,\nJe gagnerai sur lui. J'en aurai pour témoins\nLa princesse Louise et le marquis de Lorne.\n\n***\n\nLisgar et Dufferin ont tous deux fait les gros,\nMais je dirai toujours que ce fut deux zéros.\nZéros qui n'ont jamais aidé chez nous le nombre\nDes bons, que dans le sens du calcul décimal.\nZéros que l'Angleterre avec son crayon sombre\nPlaça toujours pour elle, au grand profit du mal.\n\nLisgar aimait beaucoup mieux les gens malhonnêtes.\nIl était satisfait lorsque tout son conseil\nLe priait humblement de signer des sornettes,\nMais le droit des métis agitait son sommeil.\nDufferin fut habile à rejeter ma cause,\nJe suis sûr que ce Vice-Roi\nN'aurait pas voulu pour grand'chose\nQu'Ottawa fût fidèle à l'honneur envers moi.\n\nCet homme de talent eut le don de séduire\nLes Canadiens-français auxquels il a su nuire,\nIl excellait surtout à donner des partis,\nSes conversations avaient de la prudence.\nIl faisait au grand nombre un peu de confidence,\nIl attirait à lui les grands et les petits,\nTous laissaient son hôtel flattés et divertis.\n\nRideau-House est un lieu charmant dans les baissières\nC'est là qu'un anglais borgne à force de manières\nSut, petit-à-petit, faire approuver mes maux\nPar ceux-là de nos chefs qui sont lâches et sots.\n\nSur sa table abondait le plus vieux Malvoisie,\nNos Membres y trouvaient toutes liqueurs choisies\nLes bouteilles de vin qu'il faisait déboucher\nLeur lançaient le bouchon sans paraître y toucher.\n\nQuand le vin chatouillait sa lèvre cramoisie\nEt passablement ivre, il semait à propos\nDans ses discours de fantaisie\nSur le Bas-Canada, quelques doux et bons mots.\n\nMême il a su charmer Québec la vieille ville\nEn lui promettant bien de l'embellissement,\nMais son brillant esprit et son parler facile\nNe m'ont jamais frappé les yeux d'aveuglement.\n\nQu'il arrange, s'il veut, l'ancienne capitale.\nLa faveur, après tout, n'est jamais que locale.\nTandis que son décret de commutation\nAu sujet de Lépine et ma proscription\nCompris d'avance avec la cour Impériale\nOnt jeté dans les accès\nD'une honte générale\nLes Métis et non moins les Canadiens-français.\nQuand j'ai vu que cet homme obtenait des éloges\nDe fou, je me suis dit : je m'en vas dans les loges\nC'est là qu'en travaillant j'ai su faire le mort\nLe temps que j'ai voulu, dans un coin de Beauport.\n\nMes ennemis venaient, en allumant leurs pipes\nS'informer si le fou de l'asile était près\nD'avoir en un cercueil sa tête dans les ripes.\nEt cependant je tirais\nAu naturel leurs portraits.\nJ'ai plusieurs photographies\nDe nos grands maîtres anglais.\nMa main, en écrivant, leur pousse des soufflets,\nQui causeront peut-être à leurs joues des bouffées.\n\nLes anglais m'ont tant malmené,\nQue je m'en trouve aliéné.\n\nJe ris de ceux qui font passer la flatterie\nAvant l'amour sacré qu'on doit à la Patrie.\nJ'ai droit de rire, moi, du comte Dufferin\nCe mort-né qui sortit du sein meurtrie d'Erin\nEn présentant non pas sa tête la première\nMais en offrant son derrière\nLe premier à la lumière.\n\nDufferin et sa femme ont repassé la mer.\nL'ennui de les avoir perdus n'est pas amer.\n\nIls ont des successeurs illustres,\nIssus d'un marquisat et d'une royauté.\nMoi je suis de parents pauvres et presque rustres\nQui m'ont dit de prétendre à la principauté\n\nDes bons principes ; et que c'est rendre service\nDe résister aux grands qui font mal. C'est pourquoi\nJe haïs en politique autant qu'ailleurs le vice,\nQuand même c'est le Vice-Roi.\nL'homme injuste est en paix dans sa maison d'argile.\nMais elle tombera, car sa base est fragile.\n\n**\nLe travail d'un solide et courageux esprit\nDoit valoir les combats d'un Guillaume d'Orange.\nNotre peuple est bon, c'est malaisé qu'on le range.\nVoyez ce que je fais en n'étant qu'un proscrit.\nOn peut gagner beaucoup par un seul bon écrit.\n\nLes Ontariens ont pour eux les grosses bourses\nMais moi j'ai dans l'esprit mes plans et mes ressources.\nMessieurs, vous nous paieriez l'affaire de Guibord,\nEt vos jugements creux à propos des écoles\nDu Nouveau-Brunswick. Plus vous nous avez fait tort,\nMoins nous vous serons bénévoles.\nSi vos décisions sont celles du plus fort,\nElles n'en sont pas moins tyranniques et folles.\n\nSachez que Washington est plus proche de nous\nQue Londres. Vos voisins sont plus nobles que vous.\n\nSi Dieu nous a jadis séparés de la France\nMalgré les beaux éclats de notre affection,\nSouvenez-vous, un peu qu'aussi bien sa Puissance\nPeut briser d'un clin d'œil le sceptre d'Albion.\nPrenez garde. Je puis sans gêne vous le dire.\nPour ma part, je vous veille. Et je suis décidé\nDepuis longtemps. Tout votre empire\nGraque il a trop joué ses vilains coups de dés.\n\nLes enfants dispersés de la Nouvelle-France\nOnt, sous le joug anglais, trop connu la souffrance\nPour ne pas en vouloir au peuple décrépit\nQui les a gouvernés avec tant de dépit.\n\nLes nombreux rejetons de l'Irlande indomptable\nNe sont pas, sans dessein, dans les États-Unis.\nLe jour qu'ils se mettront sous un chef acceptable\nEt qu'ils voudront marcher dans des chemins bénis.\nLes Canadiens-français et les métis sincères\nMarcheront avec eux comme avec de bons frères :\nEt sans aucun embarras\nIls leur ouvriront les bras.\n\nEt nous verront si la matière\nEt le commerce anglais ont d'aussi forts enjeux\nQue la justice et la lumière\nDont le propre est de rendre heureux.\n\nUn peuple à beau porter une puissante armure,\nS'il fait une injustice il n'est pas bien gardé.\nAussitôt que d'un mal la conséquence est mûre\nElle éclate, et malheur quand elle a retardé.\n\nSi vous ne voulez pas que notre fière race\nSe détache sitôt de vous,\nTraitez la comme il faut, puisqu'elle est à sa place\nNe vous en montrez pas insensément jaloux.\n\nLouis \"David\" Riel.\n\nDaté à Saint Joseph, Dakota, Août 1879.\nCERTIFICAT.\n\nNous, membres de la famille Riel, déclarons et certifions que ceci est une vraie copie des documents écrits et composés par Louis \"David\" Riel.\n\nLES MEMBRES DE LA FAMILLE RIEL.\n\nDaté à St-Vital, 12 janvier 1886.\n\nJOSEPH RIEL,\nOCTAVIE LAVALLÉE,\nALEXANDRE RIEL,\nHENRIETTE POITRAS.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001532.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 57, "total-input-tokens": 75438, "total-output-tokens": 18723, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 509, 5], [509, 509, 6], [509, 643, 7], [643, 1083, 8], [1083, 2077, 9], [2077, 2077, 10], [2077, 2938, 11], [2938, 4029, 12], [4029, 5328, 13], [5328, 6752, 14], [6752, 7509, 15], [7509, 8399, 16], [8399, 9565, 17], [9565, 10905, 18], [10905, 12139, 19], [12139, 13261, 20], [13261, 14439, 21], [14439, 15645, 22], [15645, 16905, 23], [16905, 18230, 24], [18230, 19600, 25], [19600, 20875, 26], [20875, 22249, 27], [22249, 23735, 28], [23735, 25235, 29], [25235, 26583, 30], [26583, 26972, 31], [26972, 27763, 32], [27763, 28692, 33], [28692, 29751, 34], [29751, 31018, 35], [31018, 32257, 36], [32257, 33460, 37], [33460, 34428, 38], [34428, 34428, 39], [34428, 34428, 40], [34428, 35547, 41], [35547, 36830, 42], [36830, 38100, 43], [38100, 39610, 44], [39610, 40837, 45], [40837, 42347, 46], [42347, 43647, 47], [43647, 45153, 48], [45153, 46574, 49], [46574, 48155, 50], [48155, 49705, 51], [49705, 51214, 52], [51214, 52634, 53], [52634, 54184, 54], [54184, 54798, 55], [54798, 55090, 56], [55090, 55090, 57]], "primary_language": ["None", "None", "None", "None", "fr", "None", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]