[{"id": "d35373c9b149613a6946e5ade32c0e84d394c8a9", "text": "The True Inwardness\nOF THE\nCanadian\nNorthwest\nRebellion\nOf 1885\nEXPOSED;\nOr, Who is to Blame?\nTHE TRUE INWARDNESS\n\nOF THE\n\nCANADIAN\n\nNORTHWEST REBELLION\n\nOF 1885\n\nEXPOSED;\n\nOr, WHO IS TO BLAME?\nIn order to fix any given event on the public mind it has ever been the privilege of the story-teller to select the most prominent persons connected with it, and present them as sponsors to his statements. Having secured his central figures, he proceeds to give full play to his conceptions, and constructs his facts or figures as best suits his purpose. This license was prostituted in a very remarkable manner during and after the incipient rebellion which occurred in the Canadian Northwest in 1885, about which such a flourish of trumpets was made and by which so many men were lionized in a greater or less degree. But now that the mists are cleared away, and time has given a faithful interpretation of the motives of those connected with it, it is relevant to hold them up to public gaze in their true light. It may be said \"let the past be passed, and let the dead bury their dead,\" but experience has taught us to avoid the pitfalls of life by an appeal to history. It is in that hope that this beacon is lifted to warn all those whom it may concern. The duty is unpleasant, but it is none the less a duty.\n\nAs a matter of fact, were it not that the names of Louis Riel, Gabriel Dumont, and that phenomenal soldier, Major General Sir Fred Middleton, were associated with that affair, it would long ere this have been deeply buried in the forgotten past; but these are the personalities on whom hang a tale.\nWhatever may be said of the two former, it is safe to say that the latter gentleman, much to his own satisfaction and to the lasting humiliation of the Dominion, played the part of the inflated frog, that emblem of impotency, to the accompaniment of eight million dollars added to the debt of Canada.\n\nOne of these persons, Louis Riel, scholar, orator, and patriot, though he were, has passed away on the scaffold, having fallen a victim to his love of race. With a heroism worthy of his cause, he nobly appeased the insatiable demand for human sacrifice. He defied that inexorable will which in its relentless grasp at political power, perpetrated at his death a judicial murder. He died like the enthusiast he was, in the full belief that his death would gain the rights of his people. His resting place is in the French village of St. Boniface, Manitoba, together with that of his unhappy wife, who died of a broken heart shortly after his execution. Their graves are side by side, and are an evidence of the ingratitude of those for whom he gave his life. They are marked by a shapeless mound of yellow clay, made to look as if the blight of heaven rested upon them, a reminder by the way, as the world has it, of the distinction between rebel and patriot. Both may be and often are, good men and true, but one succeeds, the other fails; one reaches the scaffold, the other may win a crown.\n\nGabriel Dumont still lives, a splendid type of his race, a brave, capable, self-reliant man, who in the course of long years of frontier life, acquired vast wealth and great influence over his people. He is a born leader, a man of indomitable will and great\nresource; for when all was lost to his cause and when through want and starvation his supporters fled like stricken deer to the surrounding fastnesses of nature, when everything they had was destroyed, except their furs and they were looted and carried away to Ottawa by Middleton, in direct defiance of all law, human or divine, and when he found himself an outcast from home and country, he was still himself and did not hesitate to accept a life of excitement in the United States in the hope of regaining his former fortune. In that connection he has frequently been heard from, but always in the interests of his compatriots. His demands on the Dominion government for restitution on his own and on their behalf will have to be met sooner or later, and that claim is clearly attributable to the haught and criminal avarice of General Sir Fred Middleton, who, while he strictly forbade the troops under his command to decorate themselves with even the tail of a muskrat, always took care to be far enough in advance of them to secure for himself all the furs that were of any value. This is notoriously true.\n\nGabriel Dumont was the leading spirit of the rebellion. It was under his leadership at Fish Creek that, with a reputed force of forty-seven half-breeds, armed principally with flint lock shot guns of ancient pattern, he successfully withstood and in fact defeated the redoubtable Middleton, with the flower of the Canadian volunteers, young, ardent, spirited fellows, who but for his bungling would have quickly routed their dusky assailants; possibly without loss of life. But a bloodless victory, with a knighthood in view,\nwould have been unworthy so great an opportunity, for, as if to assist the half-breeds in their onslaught, he threw away his own advantage and brought his line to within easy range of the rebel shot-guns, instead of using his more effective weapon at long range. As a consequence his men were mowed down without inflicting any serious injury on the rebels. Such was the effect of this management that at the conclusion of the fight, Middleton, in his bewilderment, wired the minister of militia to send more troops. He even went so far as to send Lord Melgund to Ottawa, a distance of twenty-five hundred miles, for the purpose of urging the British government to send imperial troops from England. But his lordship, instead of lending himself to such an insane work, made that the opportunity to escape in disgust from the command of such an incapable officer; and, although a thorough soldier and proud of his profession, he never re-appeared on the scene.\n\nIn the meantime, Dumont and his handful of associates, not realizing how destructive their fire had been, and no doubt being somewhat appalled at their own temerity in meeting a general officer of the British army, surrounded by all the glitter and panoply of war, horse, foot, and artillery, naturally fell back on the French village of Batoche, where a considerably larger force was mustered, amounting in all to between three and four hundred men.\n\nUnder his direction the approaches were skilfully protected with rifle pits, so constructed that the whole force lived in them and stood guard over the village, awaiting the approach of their enemy.\nAfter his four hours' encounter at Fish Creek, under the plea of awaiting reinforcements from Ottawa, Middleton, with an indecision worthy of his subsequent acts, determined to rest his men for a couple of weeks and revive them after their severe losses. Most military men, with such an overwhelming force at their command, every man with his blood up and eager for the fray, would have pressed on, as he was urged to do, and prevented the rebels from concentrating themselves, and offering further resistance; but he looked with supreme contempt on the Canadian volunteers, his only advisers and supporters, and scorned their counsel.\n\nFor five years previously Manitoba had been in a chronic state of unrest, sometimes verging on rebellion, at other times despairingly inert. The various difficulties incident to a new country, the take-it-or-leave-it-on-our-terms policy of the government, the system of suppression and repression arising out of the absolute power possessed at Ottawa over Manitoba, the making it the dumping ground for silencing the shoals of political cormorants who infested Ontario and Quebec; men who had been feeding at the public crib for a lifetime and who had become so clamorous in their demands that they had either to be pensioned at the public expense or else sent to Manitoba to assist in garrotting the people into submission; the Canadian Pacific railway monopoly, which with vulture-like greed calculated the smallest necessary pittance upon which the farmer and his family could live, and took all the remainder of their earnings for carrying the crop to\nmarket, these and numberless other disabilities conspired to render the development of Manitoba an impossibility, and paralyzed the efforts of its best friends. As a consequence the mass of the people were dissatisfied and stood as it were with daggers drawn. To all appearance it was only a question of time when the people, through its Legislature, would declare themselves out of confederation and assume the position of a crown colony of Great Britain.\n\nThis was the condition of things when Middleton's appeal for help went forth. It met with a hearty response. It was a blessing in disguise. It was the occasion so ardently longed for. It gave the Government an opportunity to kill two birds with one stone, that of overpowering the people of Manitoba by a demonstration of strength and of subduing the rebels by force. What did a few millions of dollars and the life of a few half-breeds, more or less, weigh in the balance as compared to the continuance in power of Sir John Macdonald and his associates? What did it matter that the people of Manitoba should bite the dust of poverty so long as the oligarchy at Ottawa prevailed. No sooner said than done, five thousand volunteers were ordered out from Ontario and the eastern provinces and sent to the northwest. Parasites in the way of contractors and camp followers were let loose like hounds from a leash to not only feed on but steal from the people in such proportion as their consciences permitted. It was indeed a carnival, a royal feast.\n\nWhen Middleton had given the rebels plenty of time to prepare for him, for there is no other military\nexplanation possible, and when reinforcements had arrived to at least four times the rebel strength, he again took up the line of march to Batoche, and in a short time was within range of the enemy's rifle pits. After a slight reconnoissance he discovered that the rebels had violated every principle of modern warfare; for instead of occupying some elevated vantage ground, from which to command the position, they were entrenched in a valley, and had built rifle pits on the brow of a hill covered with woods, over which he would have to pass before taking the village. This reversal of recognized tactics aroused all his military acumen. He had heard of the cruel treachery of the red men, and determined not to be outwitted. But this method surely portended something. What right had they to defend themselves in such an unheard-of manner. It was rank heresy, and must be summarily punished. But the rifle pits proved to be empty and he pushed down the trail till a portion of his force was in rear of pits and fronting the village. Still no resistance, for on the river opposite the village was the steamer Northcotte laden with commissariat supplies, and the rebels not being aware of his near approach had deserted the pits and rushed off to attack her.\n\nThis was his opportunity. A well directed disposition of his force would have cut off the rebel cover and compelled them to meet him, if at all, on the open plateau surrounding the village. But the dread of a surprise of some kind made him falter. He forgot the teachings of all great military authorities. Sir Garnet Wolseley, when speaking of opportu-\nnities says: \"The General feels as it were from the pulse of his men, when the supreme moment has arrived. Happy is the man who knows when to say with Wellington, 'up guards and at 'em.' There is no salvation for him who cannot do so. The opportunity passes in the twinkling of an eye, and if not seized at the proper moment cannot be expected to return.\" Here was a literal illustration, for the rebels in the distance, having got sight of the line of red coats instantly ceased their attack on the steamer and with a wild yell rushed back to, if possible, regain their position. Will it be believed that Middleton, with the key of the position in his keeping, without an effort to retain it, quietly retraced his steps up the hill and pitched his tents in a ploughed field 700 yards from and directly in front of the line of rifle pits. He threw up an embankment to protect his front, but alas, he did not see that by reason of the rising ground to his rear, the rebel riflemen, if such there were, had a clean sweep at him down to his toes, but as he was his own Quarter-Master General, and as no harm came of the blunder, he was not severely criticised.\n\nThe rebels being thus permitted to repossess themselves of their splendid position, began to feel equal to the situation, and prepared for a vigorous resistance.\n\nMiddleton's reinforcements included some of the most prominent and trusted officers of the volunteer force of Canada, thoroughly practical men who took in the situation and advised him accordingly; but to no purpose. For three successive days a pro-forma\nfire was kept up on both sides, the rebels having the protection of their pits, as well as the cover of surrounding woods, inflicting very serious injury to the volunteers, who, strange to say, were withdrawn at noon and night, instead of being relieved, to hold the ground, thus any advantage gained between times was thrown away. Each advance had to be fought over alternately, through lurking foes in ambush before getting again within range of the pits. By this means the casualties were very great, so much so that the Canadian officers were compelled to disobey orders and charge the pits on their own responsibility. Had they been unsuccessful, they would have been tried by court martial and shot, but being in close touch with their men, and knowing their metal, they drove the rebels from cover, and broke the back of the rebellion.\n\nWhen Middleton, who was lying in his tent, heard this hurrah, which always accompanies a British charge, he was furious, and exclaimed in terms more expressive than polite, against the impudence of such a proceeding, and then with his staff rushed to the field to claim the laurels of victory.\n\nIt is not relevant to the purpose of this article to recite the many incidents, amusing and otherwise, which were wrought up in connection with this memorable charge. Soldiers, even civilian soldiers, are much the same everywhere. They are like the boys and frogs in the fable, inclined to make fun even at the expense of others, and it was truly the case here, though be it said to their honor, that whilst they punished all resistance, with true gallantry they\nrespected the rights of their fellow citizens, although in rebellion. With the ferocity of bloodhounds, the troops hunted and brought down as lawful game the contingent of Sioux who were attracted from Minnesota and Dakota by the desire for blood and plunder.\n\nIn this work of extermination, the volunteers were ably assisted by Captain Howard, who will ever be recognized as the Yankee Captain, or Gatling Gun Howard. He with his two guns sent over from the United States, played a prominent part; he was a brave man and by his social genius won all hearts. He had fought the Sioux in Minnesota and Dakota and had witnessed their atrocities, and ever since had nursed his wrath against them to keep it warm. He believed the only good Indian was a dead one, and on this occasion he was everywhere with his gatlings, in the thickest of the fight. His praises were on all lips, and his services are enthusiastically remembered.\n\nAfter the rebels were scattered in hopeless confusion, another short halt was called, and an attempt made to capture the leaders, but Dumont had fled, and after three days Riel practically surrendered himself as a prisoner of war. It is true he was brought into camp by two scouts, but he was alone and on his way there when arrested.\n\nThe fall of Batoche, by means unknown to civilization, was heralded in some mystic way to all the bands of malcontents scattered over a territory of enormous extent, and whereas, up to that time, the rebels had, by capturing a number of whites, among whom were several young ladies of prominent families,\nby harassing the troops stationed at all available points, and by menacing them at others, created a spirit of alarm everywhere in the Northwest, which required vigilant care to suppress, now their whole solicitude was in escaping punishment, by returning prisoners, and by generally performing acts of conciliation whilst still in flight.\n\nSeveral of the leading chiefs and others were taken prisoners and condemned to the penitentiary for life, but public clemency was in their favor, and after being incarcerated for a short time, during which the Indian chiefs were treated like conquered princes, they were released and sent to their respective tribes in peace.\n\nThere is no doubt that prison life broke their wild spirit, and ultimately killed them; they were overawed by the magnanimity of the white man and tamed by the forgiving spirit exhibited towards them. If their descendants exist in future generations long enough to give traditional effect to their dying words, when poverty and disease shall have contributed to their extinction, they will, doubtless, count that outbreak amongst the follies of their forefathers.\n\nNot so, however, with the half breeds who had accepted treaty, and were entitled to all the rights of citizenship. Their complaints were well founded. For years they had patiently awaited the confirmation of certain agreements with the government, who, instead of taking a parental interest in, and protecting them in their far off loneliness, permitted scheming speculators to menace them with threats of ex-\npulsion from their homes; and, although it is true the government had no intention of breaking faith with its wards, the half breeds, it was criminal in permitting a delay of eight years in carrying out its promises. The delay kept the people on the ragged edge of uncertainty, till in final despair, having no one to champion them, they at great expense sent for Riel from Montana. Under his direction, petition after petition was sent to Sir John Macdonald at Ottawa, and it was not until rebellion had actually broken out, that a committee was sent to investigate and report on their demands. During the three months of the rebellion, this committee was in constant session at different points, and everything asked for was granted. It is evident that had the government met the half breeds earlier, in the spirit of conciliation and kindness, the country would have been spared the enormous expense of the rebellion. The half breeds would have remained loyal and contented, and many valuable lives would have been spared to the country. Therefore, taking the rebellion all in all, it was clearly chargeable to the indifference of the government to the rightful demands of a half civilized, and over-confiding people. It was criminal for the government to be so badly informed, in the face of the volumes of information at its disposal, of the real character of the outbreak and of the proper means for its suppression: they were blameable in being moved so easily at the ipse-dixit of General Middleton, who although a bold and fearless man so far as his defiance of bullets was concerned, yet by his administrative acts\nfrom the first, earned, and only could earn, the contempt of his whole force.\n\nThe government ought to have known that the half breeds had no resources with which to prosecute a successful fight, and they might have known that the city of Winnipeg and surrounding country sent out men enough aided by the mounted police of the Northwest Territory, a splendid body of men and well armed, to have ended the rebellion in thirty days, but this was not in the programme.\n\nThe return of the troops as might be expected, whilst it re-opened the wounds of many a bleeding heart, brought great rejoicing. The people met the troops with every demonstration of honor, more on account of reunion, than for the results of victory. It seemed strange, however, that the returned soldiers were silent about their achievements; the incidents of camp life were referred to with interest, but their battles never.\n\nThe British government with its usual magnanimity to the colonies, conferred the rank of knighthood on General Middleton for his services. This title was given, as such titles frequently are, more in recognition of the circumstances, than of the man: there had to be personality to represent the gift, and he was the one chosen. The Canadian government voted twenty thousand dollars to him in addition to his other honors and, upon the whole, he was pretty well recompensed for his wonderful exertions; but it is presumed that a country's gratitude must expend itself somewhere, and why not pay a return compli-\nment to Great Britain for the honors conferred on Canada.\n\nThe Northwest rebellion was not without good results on the country generally. Up to that time, as already stated, the government had in various ways been crushing the life out of the people, in order to invest itself with supreme authority, and under the guise of developing the country, had been feeding a vast number of monopolies. It now saw its opportunity to correct the mistake, without acknowledging the wrong; they overlooked the fact that the country was being settled by the cream of the other provinces, by men who had been educated up to their rights as citizens, and who insisted on establishing them in true British form, hence, the agitation already referred to. The government in defense of its position resorted to all means within its control to suppress free discussion and punished by political ostracism and otherwise all who participated in it. The experience gained in the rebellion taught them the danger of tampering with the rights of an intelligent people, and since then, they have, without appearing to yield, taken means to remove the disabilities under which the people of Manitoba were suffering.\n\nWithout egotism it is safe to say, that whatever of true liberty has been gained to Manitoba, and whatever the degree of prosperity awaiting its people is fairly attributable to the devotion and loyalty of those, who at the risk of their liberties and reputation stood up valiantly like the fathers of yore, in their contention for right.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001323.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 24130, "total-output-tokens": 5140, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 94, 1], [94, 94, 2], [94, 194, 3], [194, 194, 4], [194, 1610, 5], [1610, 3264, 6], [3264, 4904, 7], [4904, 6515, 8], [6515, 8108, 9], [8108, 9716, 10], [9716, 11332, 11], [11332, 12909, 12], [12909, 14511, 13], [14511, 16079, 14], [16079, 17622, 15], [17622, 19247, 16], [19247, 20755, 17], [20755, 22283, 18]], "primary_language": ["en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]