[{"id": "48dfb944823e96542957f6d8f0bb76f9849449c8", "text": "MAP SHOWING THE POSITION OF THE EDGELEY ESTATE, QU'APPELLE, ASSINIBOIA, N.W. TERRITORY OF CANADA.\n\nTHE ESTATE, COMPRISING 20,000 ACRES, IS SHOWN IN RED. EACH RED SQUARE CONTAINS 640 ACRES.\nPARTICULARS\n\nOF\n\nFarms to be Let or Sold\n\nON THE\n\nEDGELEY ESTATE,\n\nQU'APPELLE VALLEY,\n\nASSINIBOIA,\n\nNORTH-WEST TERRITORY OF\n\nCANADA.\n\nMANCHESTER:\n\nI. SOWLER AND CO., GENERAL PRINTERS, 24, CANNON STREET.\n\nMDCCCLXXXIII.\nPREFACE.\n\nIn the spring of 1881, whilst travelling towards Winnipeg, I had the pleasure to meet the then General Manager of the Canadian Pacific Railway, who, on hearing of my farming operations in the United States, proposed to me a purchase from the C.P.R. Land Grant. This proposal led to correspondence with the Directors of the Railroad. In May, 1882, I was again at Winnipeg, and relying on information which I then received, that the Railway would pass near Township 19, Ranges 15, 16, and 17 West of the 2nd Principal Meridian, and hearing from Government Surveyors and others that the land in those Townships was of unusually excellent quality, and that spring commenced there about three weeks earlier than in the Red River Valley, I arranged my purchase of the 20,000 acres on terms which, though favourable, provide for cultivation of a considerable proportion.\n\nThe information which I received in 1882 as to the superior climate has this year been fully confirmed; moreover, the results of the harvest in the Qu'appelle Valley district, upon land most imperfectly cultivated, has verified the statements made to me in 1882, as to the extraordinary richness of the soil.\n\nMany land seekers spend considerable time and money in fixing upon a locality and in selecting land. I venture to suggest that in the case of many it would be good policy to purchase first-class cultivated land, within a reasonable distance of a railway, and consequently of a market for the produce of the farm, rather than commence on unbroken land, at a long distance from a railway, where farming can only be carried on under difficulties.\n\nR. SYKES.\n\nEDGELEY HOUSE,\nSTOCKPORT, ENGLAND,\nNovember, 1883.\nFARMS TO BE LET OR SOLD\n\nON THE\n\nEDGELEY ESTATE,\n\nNORTH-WEST TERRITORY OF CANADA.\n\nThe Edgeley Estate, the property of Mr. Richard Sykes, of Edgeley, near Stockport, England, was purchased in May, 1882, from the Canadian Pacific Railway Co., and consists of a selection of $31\\frac{1}{4}$ sections, each containing 640 acres, in Township 19, Ranges 15, 16, & 17, west of the 2nd principal meridian, lying immediately north of the main line of the Canadian Pacific Railway, and extending for 18 miles between Qu'appelle and Regina. The average distance from the railroad is about 7 miles, but no part of the property lies further away than 11 miles. A projected railway from the Wood Mountains, where there are rich deposits of coal, to Fort Qu'appelle, would intersect the property.\n\nRegina, the capital of the North-west Territories of Canada, is about 24 miles from the centre of the property. Here are the government buildings of the Territories, the Governor's residence, and barracks for the mounted police.\n\nQu'appelle, which is the Railway Station for the Edgeley property, is an important town, being the distributing point for Fort Qu'appelle, the Touchwood Hills, and the Prince Albert Settlement. It is pleasantly situated in a park-like country, and already contains several hotels and stores. The leading manufacturers of agricultural implements both in Canada and the United States are represented here.\n\nThe selection was made after twelve months' careful investigation. The Canadian Pacific Railway was then advanced to a point about 100 miles east of Qu'appelle. It has now been carried 600 miles beyond, and in 1885 the completion is promised from Montreal to the fine harbour of Port Moody in British Columbia, a distance of about 2,900 miles. This transcontinental route is 427 miles shorter than the route from New York to San Francisco, and it is estimated that it will save in distance,\nbetween Great Britain and Japan, at least 1,000 miles, and that it will materially shorten the journey between the ports of Europe and those of China and Japan.\n\nThe Qu'Appelle Valley is well situated for markets. It is now directly connected by rail with Port Arthur, on Lake Superior, and as it will shortly have direct communication with Montreal and Quebec, the produce of this fertile region can be transported thence to Europe. To the westward the Canadian Pacific Railway has developed unlimited coalfields, and it has now been proved that Gold exists in large quantities in the Rocky Mountains, on the line of this railway. Thus a large mining industry will undoubtedly spring up and the Qu'Appelle Valley will have the choice of two markets for its produce, one to the East and another to the West. British Columbia, which is also destined to become a rich mining district, will also exchange her fish and fruit for the agricultural products of the Qu'Appelle Valley.\n\nThe fine climate is one of the attractions of the Qu'Appelle Valley. It lies in the latitude of the Isle of Wight and Boulogne (50°40 N.), and enjoys even more sunshine throughout the year, though with greater heat in summer and greater cold in winter. Mr. G. W. Vis, in his report upon Canada as a field for Dutch emigration, gives the following description of the climate: \"In winter the thermometer does at times indicate a very low temperature, but it would be altogether incorrect to form a judgment as to the severity of the climate from these indications alone. The air is in general pure and dry, and the cold is on this account much less felt than in countries where the atmosphere is humid and laden with moisture. I spent the whole of December and part of January in Manitoba last year, and I am convinced that the winters there are bracing and eminently healthy. Moreover, I have frequently observed in my journeys the sturdy, vigorous appearance of the inhabitants. As regards myself, I always found the cold agreeable, and suffered no personal inconvenience whatever, though I wore the same clothing as I am accustomed to wear in Amsterdam, New York, and elsewhere. The climate of Manitoba and the Canadian north-west in summer and autumn is healthy and agreeable in every respect. The days are warm and the nights cool—conditions particularly favourable to the production of the best class of grain. The crops of Manitoba are, indeed, of a\nbetter quality than those of the United States, the grain being as a rule harder and heavier, and consequently commanding a higher price. At the International Exhibition in Philadelphia in 1876, a gold medal was awarded the wheat of the North-west of Canada.\n\nOwing to the influence of the Chinook winds, spring commences three weeks earlier in the Qu'appelle Valley than in the Red River Valley, which lies to the east, and winter sets in correspondingly later, thus giving the farmer the advantage of a longer working season than is allowed to his brethren in Manitoba. Should he desire to exchange the steady dry cold of the winter for a warmer climate he can, on the completion of the railway in 1885, within 48 hours and without change of cars, reach British Columbia, where, in the latitude of the Channel Islands, and under the influence of the warm winds which blow down the Pacific coast, he has the choice according to locality of greater dryness or greater moisture.\n\nThe land was acquired on favourable terms, as the proprietor undertook to bring under cultivation a considerable portion each year, and thus create a revenue for the railroad. This undertaking he is carrying out to the extent of about 2,000 acres per annum, by means of steam ploughing and harrowing machinery, manufactured specially for the purpose by Messrs. John Fowler and Co. of Leeds, and by which the work is done far more effectually than by animal labour. Sixteen hundred acres have thus been cultivated during the present season (1883) and will be ready for seeding in April, 1884. The land having been purchased with a view to cultivation and resale, portions of the estate, both cultivated and uncultivated, are now offered for sale without any conditions of cultivation being imposed on the purchasers, and with the option of deferred payments, and on terms which must prove highly advantageous to the purchasers, or portions of it might be rented for one year with the option of purchase.\n\nMr. W. C. Cameron of Loch Broome, Ross-shire, who manages the property, wrote to the proprietor on September 10th, 1883, suggesting that the advantages of farming in the Qu'appelle Valley should be made known to farmers and gentlemen's sons in the old country, and added that the opportunity of purchasing at about the yearly rental of similar land in England should induce\nmany to go out. The opportunity is a particularly favourable one for gentlemen's sons with a little capital, who would be able to watch the railway development, and, as occasion arose, to secure a free grant under the Homestead Act in a desirable situation. At present homesteaders have to go an average distance of 20 miles from the railway to find eligible land.\n\nThe land is high, well watered, and naturally drained. It is gently undulating prairie, with rich herbage and valuable hay lands. The grasses throughout the Qu'Appelle Valley being very nutritious, it is destined to become a fine district for raising and feeding stock.\n\nThe soil is a strong black loam about a foot deep, resting on a subsoil of rich friable clay, largely impregnated with lime, perhaps the best possible combination for agricultural purposes. Sir John Rose of London, writing in 1882 upon the subject of his journey through Canada, remarks: \"I must say that the Valley of Qu'Appelle is unsurpassed by anything I have seen for picturesqueness and fertility. All that has been written and said about this magnificent country is true, and people going thither will find their most sanguine anticipations more than realised.\"\n\nProfessor Tanner, of the Royal Agricultural College, in his report upon his tour in 1883 through Manitoba and Assiniboia, remarks: \"The Qu'Appelle Valley has been generally recognised as one of the choicest portions of the fertile north west, and in a few years we shall doubtless find that popular judgment very fully justified by the large number of luxuriant and profitable farms which are being established within its boundaries.\" Mr. J. H. McTavish, the Land Commissioner of the Canadian Pacific Railway, wrote to the proprietor on June 2nd, 1882, on the subject of his selection: \"From all I can learn, the land in Township 19, Ranges 15, 16, and 17, is the pick of the whole country.\" Mr. Kendrick, a farmer from Staffordshire, who visited the Qu'Appelle Valley in 1882, reports of the Edgeley tract thus: \"The whole of this tract of land is AI, with but few marshes, and is magnificent soil for general farming purposes, particularly for grain growing.\" Mr. A. A. Hughes, Inspector of Lands for the Canadian Pacific Railway Co., in his report on the Edgeley Farm, dated September 7th, 1883, concludes by remarking: \"This farm I must say is worthy of my greatest praise.\"\n\nThe sections in Township 19, Range 15, are for the most\npart open prairie, well watered, with but little timber; those in Ranges 16 and 17 present a park-like appearance, containing clumps of young poplar, from 3 to 6 inches in diameter, which, with attention and proper thinning, would make valuable timber. At present it is useful for fencing and fuel, and for log houses and outbuildings. About 100,000 acres lying immediately to the south, and for the most part in Townships 17 and 18, Ranges 15, 16, and 17, are heavily timbered, so that for many years to come there can be no scarcity of fuel or material for fencing and log buildings.\n\nThe government land around is all taken up, and is being farmed for the most part by an intelligent and well-to-do class from Ontario and Eastern Canada, who reached the Valley in 1882, in advance of the railway, passing over 200 miles of country in order to gain this far-famed region.\n\nNumbers of English gentlemen have settled all round Qu'appelle, and hundreds of later arrivals have crossed the river and taken land north of Fort Qu'appelle, the picturesque situation of which will probably make it a favourite resort and an important and comparatively large town.\n\nThe great advantage which the Edgeley Estate possesses, in addition to its being all first-class agricultural land, is in its proximity to the main line of the Canadian Pacific Railway. This fact alone gives it a prospective value of fully $10 per acre over land north of the Qu'appelle River, as the saving in haulage of farm produce to the railway is considerably more than the interest on $10 at 10 per cent per annum.\n\nThere is good sport to be had on the property and in the neighbourhood, as the woods and meadows are well stocked with prairie-chickens and partridges, and with a large description of rabbit. The country abounds with geese, ducks, and other kinds of wild fowl. The fishing in the lakes near Fort Qu'appelle and Long Lake is most excellent. The prairie roads are good and easily travelled over.\n\nThe Edgeley property is under the able management of Mr. William C. Cameron, a practical Scotch farmer and a good judge of horse flesh, who will be ready to render every assistance in his power to anyone settling on the estate, and would, if required, select machinery and stock and put up buildings.\nThe proprietor would have pleasure in granting free run for the cattle of any purchasers over unsold portions of the estate.\n\nFurther particulars and price lists may be had on application to\n\nRICHARD SYKES, Esq.,\nEDGELEY HOUSE,\nSTOCKPORT, ENGLAND;\n\nor to\nWM. C. CAMERON, Esq.,\nEDGELEY FARM, TROY POST OFFICE,\nQU'APPELLE, N.W. TERRITORY OF CANADA.\nAPPENDIX.\n\nThe following letters may be considered interesting:\n\n75, LOMBARD STREET, E.C.,\n24th Nov., 1883.\n\nDEAR SIR,\n\nDuring my recent visit to the Canadian North-West I visited your property near to Qu'appelle with the object of seeing your steam-plough at work.\n\nI can safely compliment you on your selection, as, owing to proximity to the main line of the Canadian Pacific Railway and to the excellence of the land, it should prove a desirable investment.\n\nI had heard much spoken in praise of the Canadian North-West, and I must admit that my anticipations were more than realised.\n\nI understand that it has never been your intention to farm yourself the land which you are bringing under cultivation, but rather to rent the improved land or sell it with the option of deferred payments.\n\nIf such is your plan it certainly commends itself to me most highly, offering as it does an excellent opportunity to English gentlemen and farmers who wish to find immediate employment for themselves and for their capital, and who are not disposed to travel far from the railway in order to take up the free grants which are no longer to be found in desirable locations except at a considerable distance from the main line.\n\nI am\n\nYours very truly,\n\nR. SYKES, Esq.,\nEdgeley House,\nStockport.\n\nF. H. EVANS.\n\nFARMING IN THE NORTH-WEST TERRITORY OF AMERICA.\n\nTo the Editor of the \"North British Agriculturist.\"\n\nSIR,\n\nFor some months back your valuable and instructive paper has been finding me out regularly every week in this far away corner of the globe, and I must say that it was never so welcome in the 'old country,' where I read it for several years, as it is here. I think it is a great pity that more Scotch farmers do not come to this country, where they could get on so much better and more easily than at home; and if money is not made so quickly, they certainly would not lose what they did make so fast as they do now, struggling, as a great many of them are, with high rents and bad seasons.\n\nI have been employed this summer in managing what would be considered in Scotland a large tract of land—20,000 acres. In this country\nit seems but a drop in the bucket. This land is owned by Richard Sykes, Esq., of Edgeley House, Stockport, England, and he is having it brought into a state of cultivation as fast as a pair of Messrs. Fowler and Co.'s (Leeds) engines and two ploughs can turn it over. They have been at work since the middle of June up to within a fortnight ago. We are now going over the land already ploughed with a discer, cutting up and pulverising the sods, and by sowing time there will be close on 2,000 acres ready for seed. Mr. Sykes intends renting the improved land at 12s. to 16s. per acre, or selling it at about £4, less or more, according to quality and situation, and the unimproved land at from 25s. to 30s. per acre. All the land is within ten miles of a railway station, and a considerable part of it within three or four miles.\n\nFarmers, by taking the improved land, save a year, as the crop taken off the land the same season as it is broken seldom comes to much. There are, no doubt, a great many reports of an exaggerated and misleading character sent home about this country, and I must say that I was sadly disappointed when I first came here, and quite intended to return to Scotland in the beginning of winter; now I have changed my mind, and if I do go back, it will be to return in spring. The crops have turned out wonderfully well here this season, taking into consideration that they were almost without exception sown late and on the sod, little or no breaking having been done in this quarter until last spring; and it was really wonderful to see oats and wheat, sown as late as the month of June, almost ready for the reaper by the middle of September. My object in writing this letter is to let you know that all the best land is being fast taken up. There is hardly a half section of free-grant land to be had within miles of this place, and lands that are for sale rise several dollars in price every year; for instance, land that was bought this time last year for 10s. per acre sells now for 30s., and next year will probably be higher still; so that farmers intending to come to this country should come as soon as they can get rid of the heavy yoke of lease and rent.\n\nThere is a very mistaken idea in Scotland, viz., that any person can farm in this country. To a certain extent it is true, as farming here certainly does not require either the practice or science that it does at home; but at the same time a man who has driven a pen or an awl all his lifetime has no chance with the practical farmer, especially if the latter has a small amount of capital to start with, the more the better; but for those who have little or no capital, it is a hard struggle for the first year or two.\n\nIf you can find space in your already crowded paper, and think the above worth while inserting, I will be glad to give any further information I can with regard to this part of the country, either through you or to private individuals.\n\nI am, &c.,\n\nW. C. CAMERON.\n\nEdgeley Farm, Troy P.O.,\nQu'appelle Valley, Assiniboia, N.W.T.,\n15th October, 1883.\nThe following is extracted from the letter of the Special Correspondent of the \"Winnipeg Weekly Times.\"\n\nQu'Appelle Station,\n\nJune 10.\n\nOur fire brigade has been duly organised, and in the event of another conflagration no doubt the boys, under the able command and guidance of I. B. Robinson and Flat Boat McLean, will be able to render a good account of their capabilities in conquering the devouring element.\n\nThe Late Fire.—Our city is fast recovering from the effects of the fire. To replace those destroyed, Messrs. Lee and Raymond have nearly completed a large building, 67 by 24 feet, two stories high, tin roof, intended for billiard hall and offices or hotel; it will be the finest hall outside of Winnipeg. Mr. H. S. Caswell has commenced his store, 30 by 70 ft., with front on N. Pacific Avenue and Qu'appelle street. It is two stories high, tin roof, &c. Both these buildings will be a credit to our young town. Various other buildings are being erected. Amongst them one intended as a store for Mr. W. Brittlebank on Qu'appelle street; in fact buildings are going up so fast that it is hard to keep count of them.\n\nWe have had quite a busy time during the past couple of weeks, owing to the fitting up of Mr. R. Sykes' steam plough, the first imported into the Dominion, which arrived here on six cars the 27th ult., and was finally put together and got into working condition last Tuesday evening. This modern wonder, which has been selected by Mr. Sykes for the breaking up of his land, was manufactured by the celebrated firm of John Fowler & Co., Leeds, Yorkshire, England, a firm who devote their whole attention to the manufacture of steam farming machinery and portable railways. The motive power is furnished by two traction engines, each of nominal 16 horse-power, capable of being run up to 25 horse-power if desired. These engines are something after the build and style of a railway locomotive, except that the steam chests, piston, eccentrics, etc., are fixed on the top of the boiler instead of underneath, and are supported on four monster wheels. The fore wheels are two feet wide and five feet in diameter; the hind wheels, which are placed immediately under the fire-box, are three feet wide and seven feet in diameter; the motive power from the engine is delivered to the larger or driving wheels by suitable cog-wheel gear, and is capable of being given an increased speed by the ordinary shifting shaft, by which this \"thing of life\" obtains a speed of from 6 to 8 miles an hour on any ordinary prairie road; the locomotive motion is on the right hand side of the engine, while that imparting the motion to the drum for working the implements, and which is fixed underneath the boiler, is communicated from the left, where a large fly-wheel, weighing two tons, regulates the general motion. Around the drum is coiled the wire cable for hauling the implements, weighing some 3½ tons. The engines are steered by a worm, which is worked by a steersman—it operates on the fore wheels, which are on a pivot, and inclines the engine either to right or left as desired.\nThe implements for ploughing are two, each containing ten separate 16-inch furrows, placed and held in position by a stupendous wrought steel balanced frame; the ploughs, as fixed, have five on each end, their points facing each other, i.e., supposing the ploughs are working from east to west, those pointing to the west would be in the ground, while the others would be elevated, and vice versa; the ploughs are drawn by a substantial steel wire cable \\( \\frac{1}{2} \\) mile long, which is wound round the drum of the engines. The plough balanced frame is supported on wheels—something after the style of the ordinary sulky—with gear for elevation or depression; the rolling coulter, mould boards, &c., are made after the celebrated John Deere pattern.\n\nThe harrows are 16ft. wide, with 120 teeth made of inch square iron and 14 inches long, set in frame and supported on wheels, with steering and elevating and depressing gear same as plough.\n\nThe discers, or rolling harrow, for cutting the sod, comprise 26 discs, 18 inches in diameter, fixed on shaft 16ft. long and supported on frame; gear for steering, &c., same as plough.\n\nThe whole of the machinery, which was transported in parts, was put together in a masterly workmanlike manner by Mr. Milne, assisted by Messrs. Lobley and Clixby, all of whom accompanied the machines from Leeds. Mr. Milne has been employed by his firm in setting up steam ploughs in Russia, Germany, Poland, Spain, &c., and deserves well the trust and confidence placed in him by his employers. Messrs. Milne and Lobley remain with Mr. Sykes to run the plough for the season. Various comments were made by the sage wiseners, some declaring the utter impracticability of the working of the plough, while others remark on the utterly useless strength of the various portions of the tackles and machinery, all of which were placed at naught as will be shown by the sequel.\n\nAbout half-past four o'clock p.m., steam was up and everything ready for a start. The leading engine having in tow the two sets of ploughs, and in charge of Mr. Milne, tooted its shrill whistle, the steam hissed, the ponderous fly-wheel whined, and the giant driving wheels, slowly but surely began to revolve, while amidst the suppressed and awe-stricken spectators—of whom there could be not less than 300—the snorting monster gently moved on its journey over the prairie to the scene of its future labours. The other engine, having in tow the harrows, tools, baggage, &c., in charge of Mr. Lobley, followed in the wake—and thus, at the rate of 6 miles an hour, these giants of engineering skill and human ingenuity began their course of usefulness, piloted by the water cart driven by Mr. J. W. McLean. They reached their destination, a distance of about 6 miles, at six o'clock without the slightest mishap. It occurred to the writer as a curious incident that the old frontier man, Flatboat McLean, who a decade or so ago piloted across the same plains a few Red River carts, and who also proved the practicability of the navigation of the Red River by his rude flat boats, should, without any preconcerted arrangement, have the distinguished honour to lead the way for this great modern civilizer, the first steam plough\nin the Dominion. It was generally remarked how very smoothly and evenly the machinery worked without any rattle or other discordant noises so common in the general run of machinery. This proves with what care and ability everything connected with the plough was got up. Coulies, ravines, hills, or other supposed obstructions, offered no resistance to its progress towards the Edgeley Farm, so called by Mr. Sykes in commemoration of his paternal home in \"Merrie England.\" This now celebrated farm, consisting of some 20,000 acres of beautiful land, about half of it being open prairie and the remainder intersected with small clumps of trees of one to five acres in extent, and valuable hay meadows, presents \"that park-like appearance\" which is so pleasing to the eye, and which has already rendered the Qu'appelle Valley so famous. Mr. Sykes purchased the land from the C.P.R. last year, and it is his intention to break it up as quickly as possible, and erect houses and suitable offices, and to rent the lands to farmers from Ontario or elsewhere.\n\n\"SPEED THE PLOUGH.\"\n\nYesterday afternoon there was a large gathering at the Edgeley Farm to witness the first trial of the first Fowler plough imported into the Dominion. Amongst the visitors were Chief Factor McDonald, H. B. Co., and Mrs. McDonald and family, Mrs. Storer-Brown, Mr. Calder, H. B. Co., Dr. Edwards and Mr. M. Thompson, Touchwood Land Co., from Qu'appelle. Mr. and Mrs. McManus, Mr. and Mrs. J. N. Thompson, agent Commercial Land Co., Mr. Bouyea, agent Harris & Son, Mr. Warner, C. R. P., Mr. Doolittle, Mr. Johnston, etc. etc., from Qu'appelle Station, Mr. T. Wright, Miss Wright, Miss Nellie Wright, and Mr. W. R. Wright, of Glen Thomas, Mr. Baker, Dominion Emigration Agent, Mr. Anderson, Government Land Guide, Mr. Gordon, Dominion Land Agent, Regina, Major and Mrs. Bell; Mr. Routledge, Qu'appelle Farming Co., Indian Head. The visitors thoroughly inspected the plough and its workings, and all pronounced but one opinion, that it was a \"famous victory.\" The mode of working the plough is quite simple. The engines are placed one-half mile apart on the piece of ground required to be ploughed, connected by the wire cable. At one end of the cable is fixed one of the sets of ploughs, and, midway, the other set. On a signal from the steersman on the plough, the engine having the slack commences to wind up the cable and the ploughs move along at the rate of from three to four miles an hour. By the time the plough which was midway at starting reaches the engine that is working, the plough following will finish where the other started from. The plough frames are then reversed by the balance elevating the points toward the hauling engine, and both engines move laterally to the required distance, about sixteen feet; the ploughs in the meantime are guided to the proper distance and retrace their course, and so on backwards and forwards, thus ploughing at one haul about an acre of land: time from 20 to 25 minutes, counting delays, etc. The wire is kept off the ground by several small carriages at intervals. The sod turned averaged 17 in. by 4 in. deep. It is intended, instead of the usual backsetting, to cut up and pulverise\nthe sod by the discers, which will leave the ground fit for sowing next spring. Eight men are employed, including teamsters hauling water and coal; of the latter about two tons are consumed in the 16 hours, which at present, till we gain access to our southern coal fields, forms the largest item in the running expenses. Those who condemned the heavy ponderous build of the gear in general, when they had seen the actual working, freely acknowledged their error, and confessed that there was not a single particle of useless strength about it. The common verdict was that it was a complete success. The previous days, at first starting, many little defects which experience exposed, were improved or remedied, and it may be now fairly said to be in thorough working order.\n\nAfter everything had been seen Mr. Sykes entertained his guests to a sumptuous camp luncheon, where appetites, which can only be gained by a trip across the prairies, did full justice to the good things provided, and all will, I am sure, in the future recall with pleasure the day thus profitably and happily spent in seeing the working of our first steam plough. The great kindness and courtesy of Mr. Sykes, who was indefatigable in his endeavours to show and explain the working of his giant machine, will not be easily effaced from the minds of his first visitors to Edgeley Farm, and long may this and other kindred undertakings in the paths of peace and civilisation thrive and prosper is, I'm sure, the sincere wish and desire of all present. Mr. Sykes' enterprise in this direction deserves well of every well-wisher who has the advancement of our country at heart, and it is to be hoped that his example will be followed by others, and that they may be induced \"to go and do likewise.\"\n\nThe total cost of the outfit foots up to $16,000. Mr. Sykes is confident that the undertaking will pay him for all his trouble and expense. The farm has been placed under sole management of Mr. Cameron, a young Scotchman, brought out by Mr. Sykes, who gives every indication that he will do credit to his employer's confidence and trust. Mr. Adair, the late foreman, returns to the Dakota farm by to-night's train. His departure is greatly regretted by the men over whom he had supervision. They evinced their appreciation of his kindness and amiability towards them in the presentation to him of a beautiful meer-schaum pipe and handsome inkstand. Mr. Adair leaves with the best wishes of all for his welfare and prosperity.\n\nT. Sowler & Co., Printers, 24, Cannon-street, Manchester.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001180.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 19, "total-input-tokens": 27446, "total-output-tokens": 7731, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 189, 1], [189, 189, 2], [189, 407, 3], [407, 407, 4], [407, 2099, 5], [2099, 2099, 6], [2099, 4009, 7], [4009, 6442, 8], [6442, 8799, 9], [8799, 11242, 10], [11242, 13519, 11], [13519, 13866, 12], [13866, 16001, 13], [16001, 19065, 14], [19065, 22163, 15], [22163, 25394, 16], [25394, 28605, 17], [28605, 31161, 18], [31161, 31161, 19]], "primary_language": ["en", "None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]