[{"id": "a6e3c1e7ee60802ef4d187674afb7f0abb482006", "text": "Mr. BLAKE. It seems to me that there are some very serious questions involved in this affair, and that it ought not to pass without some discussion. In the first place, I wish to call the attention of the House to the fact that the matter which forms the subject of this report is not new to this House at all; that it was not new this Session, or last Session, or the Session before; that for several years it has been brought up; that for several years statements have been made which have turned out to be substantially true; and that some time ago, the very letter of Mr. Hayter Reed, which forms the essence of the whole question, was read in this House—not the revised letter, but something which purported to be the original letter, and which was substantially the same as the revised letter. I wish, in the second place, to draw attention to the fact that the Government was called upon, from this side of the House, by hon. gentlemen who brought the question up, to act; that the Government had an obvious duty to enquire and to act; that the Government, upon one occasion at least, if not on more than one, acknowledged that duty and undertook to act; and that up to this hour we have not had the slightest indication of the Government having taken the first step towards enquiry into the matters, so circumstantially stated, and so largely proved, as they were, by the letter of Mr. Hayter Reed. I think the Government are called upon to state to the House what steps they took. I think they are called upon to state whether they called upon the General commanding, who was incited by these statements, and by that letter, to give any report to them. I think they are called upon to state whether they instituted any enquiry into his conduct, and that of Mr. Hayter Reed and of Mr. Bedson; and if they did, when they did it, how they did it, and with what results. They should state to the House how it happens that this disgraceful matter—for so I call it—was brought to their attention so long ago without their taking any action, if no action was taken; or if action was taken, to what extent it was operative. A serious question arises upon this letter, which, at some time or another, appears to have got into the possession of the Department itself, because, as well as I can gather from the report of the proceedings, the revised letter of Mr. Hayter Reed was ultimately produced from the custody of the Department. When it got there, how it got there, what was done upon its getting there, we know not. But that letter, as revised, read thus:\n\nFort Pitt, July, 1885.\n\n\"To the officer in charge of the property taken from Rebel:\n\n\"The General having decided to confiscate the furs now in your care and taken from rebel, desires that you should make up a select bundle of beaver and fisher for him, and a selection also for those of his staff. Have them properly packed and addressed, and keep a memorandum of what is packed.\"\n\nHAYTER REED.\n\nIt appears that the instruction in the original letter was that the General commanding was to have a double portion—two boxes for himself, and one each for the staff. It appears also that the language used in Mr. Hayter Reed's revised letter, \"make up a select bundle,\" was still stronger in the original letter, in which the words used were \"select beaver and fisher\"—the two, however, meaning pretty much the same thing. It appears further that the original letter contained instructions to the person to whom it was addressed to keep it private, not to let it be known, and that the fact that this direction became known was the reason why it was withdrawn and replaced by the letter I have just read. It was found, it seems, that in the interval the party to whom this direction was addressed, one Warden did not keep it private, and it became known; and the object of the direction having become thus thwarted, the fact of the direction, and the impropriety of the direction were at once made manifest, I suppose, and so the direction was withdrawn, as its purpose had not been served. Now, in this whole matter there has been a grievous course of misconduct and impropriety on the part of an official of the Canadian Government. There has been a grievous wrong done to a Canadian subject. It has been a subject of enquiry and discussion here for many Sessions without effective result; and I very well remember that in the end, after the debate had been, at the request of the Government adjourned, when the First Minister announced that the great inquest of the nation should be allowed to make enquiry, it turned out that it was because the General commanding had signified his good-will and pleasure that an enquiry should be made, that an enquiry was vouchsafed. It almost sounded as if the General was still in the North-West, as if he was still monarch of all he surveyed, as if he was still the dictator of the\ncountry, the arbiter of the lives and fortunes and property of the people; because Parliament was carefully told that, as the General has been kind enough to say you may enquire, we will grant an enquiry. It was rumored—I know not with what foundation—at an early stage of these proceedings, before the Committee had met, that this matter could be accommodated in some way, and I think £3,500 was suggested as a sum which would satisfy Mr. Bremner; and I think that it was suggested that somebody—no, rather, that everybody—should pay it, so that the matter might be hushed up. My opinion is that this is a matter which should be settled by those who have done the wrong, and not by the Canadian people, who are not responsible for the wrong which has been done; and I believe that we ought not to indemnify, either in reputation or in purse, the man who did the wrong, but I believe that he should bear the consequences of the wrong he did. He has had honors and rewards enough, and he should now pay for his misconduct, and should receive the censure which is his due. I have had some little opportunity of judging of the rules of morality which have been generally applied to the conduct and the honor of British officers; and having some vague idea of what British military conduct and British military honor were, I was overwhelmed with astonishment when I saw the letter which was sent by the General, and, if possible, I was still more astonished when I saw the evidence of the General as to what he considered his rights and his powers, and the doctrines of ethics and morals which he applied to this matter. Thinking that the information available in regard to military duties and military regulations, in what may be said to be analogous cases, might afford in some way a justification for the General's view, if I looked into them a little, I took that trouble, but all I have been able to find or to read of seem to be entirely in condemnation of the course which has been here pursued. The authorities to which we generally look, fortunately, cannot bring before our view cases of civil war. They are not cases of disturbance on British soil, but they are almost always cases of conflict with a foreign foe and on foreign soil. This case was, of course, entirely different. It was not a conflict on foreign soil or with a foreign foe. It was a conflict on British soil with British subjects—misguided, it is true, in rebellion it is true; but British subjects still—and in this case there could not be any question of prize of war or booty at all. In a case of this kind, different principles are to be applied from those which apply in the ordinary cases of military operations. But, restricted as this case thus was, it was restricted still further by the circumstance that, even when the difficulty was at the extreme height, the Administration—and I commended them at that time, and I renew the commendation now—announced that there was never an idea of proclaiming martial law in that country. The Government asserted that there was no intention to proclaim martial law, and the Government, as I shall show later on, acted upon the view and announced it from the earliest period, that the Queen's civil and criminal courts of justice were open and should remain open, and that the Queen's subjects, whether they were concerned in the rebellion or were actually in the field, should be dealt with by them alone; so that we had no proclamation of martial law in that country. It seems, I think, to be clear that there was not the shadow of a claim to confiscate, and if there was even a shadow of a claim for confiscation, or if the incident of prize of war could have arisen, it seems to be perfectly clear that there was not the shade of the shadow of a claim to appropriate on the part of the confiscator; and that appropriation and that confiscation are each of them unlawful and criminal acts, the appropriation being only more improper than the confiscation. In the case of the Monmouth rebellion, it appears that articles of war were for the first time put forth introducing powers for the destruction of rebels' property on the order of the general commanding. That was in connection with the case of what was considered to be a very dangerous revolt. We know that, whether in the case of domestic or foreign war, one painful necessity is to distress the enemy by the destruction of property. In fact, that may be a humane thing to do, as causing others to desist from warfare, and so earlier terminating the war. It was for that purpose alone that this authority was introduced into the Articles of War on that occasion; and accordingly, though the provision was made applicable to the property of civilians engaged in rebellion during the rebellion, the Secretary of War of the day directed Colonel Kirke no longer to use it after the rebellion ceased. It was a war measure in order to distress the rebels and cause the rebellion to cease. It was a measure for the destruction of property in order to terminate the war. These articles are continued in the general articles of 1872, and, if you take those articles of war in their whole scope, in all the provisions bearing in any way on the conduct of officers and soldiers engaged in military operations, you will find that they are all alike condemnatory of such conduct or of such an action as this. They show a power to take useful stores from the enemy for the service of the State. They show that there is no right to hurt the subject in person or property. They show that plunder and pillage and destruction of private property are high military crimes. They show rigorous provisions for prevention and punishment of such offenses. Many of them are not applicable in terms to this case, but they are most valuable as teaching the road to be followed and as indicating to any man in the position of General Middleton, with very great plainness, how far he was departing from that road in the course he took. In the Articles of War of 1872, the 11th regulation is this:\n\n\"Any public stores taken from the enemy, whether of artillery and ordnance, engineer stores, clothing, forage, provisions, shall be seized for our service, and the officers commanding in chief are to be answerable to us for any neglect in this respect.\"\n\nThen the 17th article, which refers to the proceedings on the commission of offenses, is:\n\n\"Whenever any officer or soldier shall be accused of a capital crime or offense or any offense against the person or property of any subject purchased by the known laws of the land, the commanding officer or officers of his corps are, upon application duly made in behalf of the party injured, to use their utmost endeavors to deliver over such accused person to the civil magistrate, and assist the officers of justice in apprehending and securing him.\"\n\nThe commanding officer is not himself to become the culprit; he is not himself to take the goods.\nNo; he is to see that those below him who do that shameful and criminal act shall be delivered over to the civil magistrate for punishment. Then article 51, and the following articles deal with \"any officer or soldier who shall leave his commanding officer or his post to go in search of plunder, or who being employed in foreign parts shall do violence to any person bringing provisions or other necessaries to the quarters of our forces, or break into any storehouse or cell for plunder.\" It was not indeed necessary for General Middleton to break into this storehouse, because he could command the storehouse to be opened; so he did not break in, but he commanded the storehouse to be opened in order that he might plunder; and he ordered the plunder to be packed up and delivered to him and his staff. But the Article of War goes on: \"Shall on conviction suffer death or penal servitude for not less than five years, or such other punishment as a General Court Martial shall award.\" Then, under the heading \"Disgraceful Conduct,\" in article 80 it says:\n\n\"Any officer or soldier, or other person employed in the War Department, or in any way concerned in the care and distribution of any money, provisions, stores, arms, ammunition, clothing or other stores belonging to our army or for our use—\"\n\nAnd I shall show you before I sit down, that if this could be considered prize of war, it was for Her Majesty's use, it was the property of the Crown and not of the individual.\n\n\"—or who shall embezzle, fraudulently misapply, wilfully damage, steal or receive the same, knowing the same to have been stolen, or shall be convicted therein, on conviction before court-martial, shall be sentenced to five years' penal servitude.\"\n\nAnd article 81 says:\n\n\"Any soldier who shall steal or embezzle Government moneys or property, or shall receive the same, knowing them to have been stolen or embezzled, may be sentenced to such punishment other than death, or penal servitude, as the court may award.\"\n\nThen article 103, which is one of those I fancy, introduced upon the occasion of the Monmouth Rebellion to which I have adverted, says:\n\n\"Any officer or soldier who shall commit any waste or spoil, either in walls of trees, parks, warrens, fish ponds, hedges, privies, dykes, ditches, fences, walls, enclosures, meadows—shall maliciously destroy any property—whether belonging to our own subjects or to inhabitants of other countries, unless the destruction of property shall be ordered by the commander-in-chief of our forces, to annoy rebels or other enemies in arms against us, shall be an offence, on conviction, be cashiered or suffer such other punishment &c.\"\n\nAnd Article 130 says:\n\n\"In addition to any other punishment which the court may award, every offender shall further sentence and offender to be put under seige of pay until he shall have made good any loss or destruction of, or damage or injury to, any property whatsoever, occasioned by his willful or negligent misconduct.\"\n\nSo far with reference to the articles of war, the whole tenor and spirit of which go to show to any man who has read them but for the first time, and much more to a man like the General with whom they ought to be familiar next to his bible—show, I say, to any one familiar or unfamiliar with them, how far this course was a departure from the spirit and doctrine and practice of the British army as so prescribed. Then, Sir, if you look at the Wellington Despatches and General Orders you will find numerous instances of the severest possible course being taken with reference to those who engage in plunder and pillage. I have looked out many of them, and I cite only one that is the most familiar, because it happens to be quoted in the authority upon these subjects. In October, 1810, the Duke of Wellington announced by general order that:\n\n\"He was concerned to have been under the necessity of carrying into execution an order to him which he has always thought of advantage, the immediate execution of any soldiers caught plundering, and that a British and Portuguese soldier have consequently been hanged this day for plundering in the town of Leiria where they were contrary to orders, and for other criminal purposes. He trusts this example will deter others from these disgraceful practices in future, and that the troops may depend upon it that no instance of this kind will be passed over.\"\n\nThen I looked to our great neighbors who were engaged in a gigantic struggle some years ago, to see what course they pursued when they were engaged in that struggle which added to all the horrors of war, the further horror that it was a domestic war upon the most tremendous scale; and the instructions that were given by them in cases where martial law was proclaimed—a class to which this case does not belong—are of importance. The instructions which governed their armies, issued in 1803, are stated in Cloete's book as follows:\n\n\"Martial law in a hostile country consists in the suspension by the occupying military authority, of the civil and of the criminal and domestic administration and government in the occupied place, and in the substitution of military rule and courts for the same, as well as in the dictation of general laws as far as military necessity requires this suspension, substitution or dictation.\"\n\nThere is the rule of war—if martial law be proclaimed it is to abrogate all ordinary conditions so far as, and no further than, military necessity requires:\n\n\"As martial law is exercised by military force, it is incumbent on those who administer it to be strictly guided by principles of justice, honor and humanity; virtues adorning a soldier even more than other men, for the very reason that he possesses the power of his arms against the unarmed.\"\n\nMartial law should be less stringent in places and countries fully occupied, and fairly conquered.\n\nAll civil and penal law must continue to take its usual course in the enemy's places under martial law, unless interrupted or stopped by order of the occupying military power.\n\nThese rules are founded on just principles which must command themselves to every man, they are based upon no technical treatment, but upon the obvious principles of justice and mercy. You find a man made a dictator over the country, and entitled to make laws for the people; and the fundamental principle stated is that he is to act \"upon the grounds of justice, honor and humanity,\" and that all the more strictly because he is all powerful for the moment against the people, who are unarmed. So, in the case of the Canadian rebellion of 1837, a case which comes closer to ourselves, the opinion of Lord Campbell and Lord Cranworth upon the subject of martial law was this:\n\n\"For the reason quod necessitas non defendit, we are of opinion that the prerogative (of creating martial law) does not extend beyond the cases of persons taken in open resistance, and with whom, by reason of the suspension of the ordinary tribunals, it is impossible to deal according to regular course of justice. Where the courts are open so that criminals cannot be delivered over to them to be dealt with according to law, there is no case we conceive, any right in the Crown to adopt any other course of proceedings. Such a power can only be conferred by the Legislature.\"\n\nOnce again, I apply that rule and I say, here was no martial law nor any occasion for it. The Administration would have been morally criminal if they\nhad attempted to proclaim it; but they did not proclaim it. The courts of justice were open, the courts of justice were about to be applied, as I shall show presently, to this aggrieved subject; and yet you find martial law—no, not martial law at all; but something quite beyond the rigors of martial law unjustly exercised, beyond the extreme abuse which could be committed under the guise of martial law. The rule is stated by Lord Hale as follows:\n\n\"In times of peace the exercise of martial law in pain of death is declared murder.\"\n\nThat is still law.\n\n\"A military officer having prisoners taken in the riot should hand them over to the civil power, if existing; but if not existing, then his responsibility is to the civil justice of the country. Under these circumstances, if a court of justice cannot be convened, or by courts martial, if those courts only can be summoned.\"\n\nThen Clode goes on to say:\n\n\"Such necessity arising for the trial of civilians by court-martial, the commanding officer will be careful to compose those courts of men (civil or military) whose experience and character afford to the criminal the best security for the exercise of a sound judgment and discretion in the most solemn function of judicial administration which they, the judges, are thus immediately called upon to discharge. The jurisdiction of the court is to be upheld by the supreme power of the executive Government to administer justice at all times.\"\n\nI call attention to the fundamental principle that justice is to be administered, and this, if possible, by the civil courts, if not, then by courts erected for the occasion, but still erected to administer justice; and I need only ask the House to apply these principles to the transaction which took place and which forms the subject of this report, and to say whether they have not been, so far as possible, violated instead of observed. Then Clode says, on page 168:\n\n\"The result of exceeding powers. Those charged with wrong in the civil or criminal courts are to meet the legislature or submit to their own responsibility, either alone or together, with the aid of the civil department, if military officers. They must be prepared to know that martial law was not only established de jure but de facto; for otherwise, indeed, any usurpation might be tolerated.\"\n\nThis done his act must be justified as coming within the limits of his authority.\n\nI cite this because it alludes to the principle of British rule, the constitutional principle, which is that the Crown can do no wrong; but that the subject must not be aggrieved without remedy; and, in order that the subject may not be so aggrieved, no person appointed to power by the Crown who exerts that power can go beyond what the Crown can give or the Legislature has given, without personal responsibility to the subject for wrongs done. Upon this topic of martial law and the principles of its administration in those cases in which a commander in chief is clothed with the power and does assume it, no less a person than the Duke of Wellington in April, 1851, in a very important discussion in the House of Lords, which involved some of these questions—I refer to the discussion on the disturbances in the Island of Ceylon—made this statement:\n\n\"Martial law was neither more nor less than the will of the General who commanded the army.\"\n\nThat is what General Middleston seems to have supposed he was invested with, and that he had power to do anything he pleased.\n\n\"In fact, martial law meant no law at all. Therefore—\"\n\nWhat is the sequitur? That you may rob the subject? That you may order and do just what you like? No.\n\n\"Therefore, the general who declared martial law and commanded that it should be carried out into order was bound to lay down distinctly the rules and regulations and limits according to which his will was to be carried out. If he (the Colonel) in another country, carried out a special law, and to that law he gave a general promulgation of the people of a country by his own will. But then, what did he do? He declared that the country should be governed according to its own national laws, and be carried into effect that will. He governed the country by his own law, and the country was governed by him. He made a modification the political servants and judges who had at first felt or been expelled afterwards consented to act under his direction. The judges sat in the courts of law conducting their judicial business, and administering the law under his direction.\"\n\nAll this shows that with whatever power you are invested, under the great agency which makes salus rei publicae suprema lex, you are bound to use it as little as you can; and that, in what use you do make of it, your action must be founded on the general principles of eternal and immutable justice. You are to be just, you are not to interfere beyond what is necessary, and your interference is to be based on the principle of justice. And this, when in a foreign country, when martial law has been proclaimed. How much more so when the country is our own, and when there martial law has not been proclaimed. I said the question of prize of war does not ever arise in case of a rebellion. A British subject can be deprived of his property only by judicial or legislative action. By judicial action, based upon the existence of the general law of the land, which gives the result of an escheat of the property of an individual convicted of treason, or by ex post facto legislation by a bill of attainder, in each case corrupting his blood. In these two ways only can a British subject, or his heirs, be deprived of his property, and that is a distinction, a characteristic belonging to the British subject which we ought to sacredly preserve and maintain. You may declare martial law; you may try a man and execute a man as a rebel taken in arms, by a court-martial, and yet his property is not alienated but it goes to his children. You cannot deprive him or them of his property by that course. In order that forfeiture may result he must be found to be a traitor by the courts, the ordinary courts of the country, in the ordinary course of the administration of justice. He may have fallen in the field itself, he may have fallen by your own artillery in battle against you, and the same result happens. There is no corruption of his blood, and his property cannot be forfeited. Now to turn to another feature. With respect to the case of the spoils of war, when that principle is at all applicable, if this were such a case, it is perfectly plain that no personal right arises to the property in favor of the commander in chief or other person who may happen manually to obtain possession of prize or booty-of-war. The statement of Clode, \"Military Forces of the Crown,\" is this:\n\n\"When the expenses of war were borne by the Crown (previously before William III.) the spoils of war belonged to the Crown as part of the property rather than the public revenue. Thus the disposition of the prize was made by the articles of war; and Parliament did not interfere.\"\n\nBy the 23rd section, Articles of War, 1672, there is this provision made:\n\n\"In what place soever it shall please God that the enemy shall be subdued and overcome all the ordinance, ammunition and victuals that shall be there found shall\nbe secured for our use, and for the better relief of the army, and one tenth part of the spoil shall be laid aside towards the relief of the sick and lame soldiers.\"\n\nBut after the appropriation Acts, when the expenses of war were provided by Parliament, the Crown dealt with prize as a trustee for the public. The House of Commons appointed Commissioners of prize and, aided by statutory power, the sanction of Parliament was thus given to the distribution. But the sole right of the Crown has always been allowed. That right was conferred—\n\n\"Not for private purposes or personal splendour, but for the public service to answer the great exigencies of the public interest and the claims of public justice.\"\n\nThese were the words of Sir William Scott, afterward Lord Stowell. That authority further says:\n\n\"Price is altogether a creation of the Crown; no man has or can have any interest beyond what he takes in the mere gift of the Crown; beyond the extent of that gift he has nothing. Bella porta cedunt republica.\"\n\nLord Brougham said:\n\n\"The Crown has property in prize and can deal at its pleasure with it. The title of a partly claiming prize must therefore in all cases be the act of the Crown, by which the Royal pleasure to grant it is signified.\"\n\nIt is a matter of pure bounty. Again:\n\n\"A grant made to the army by the Royal warrant is in certain definite shares and proportions, and it is the only authority given to the Secretary of State to decide these questions.\"\n\nBy the statute of prize, 2nd William IV, chapter 53, it is provided that the officer in chief in command is to appoint agents for the collection and realisation of booty by rule, and within one month afterwards the agents are to transmit the amounts to the Chelsea Hospital. One of the most important cases—having reference to the special conditions of the question which exist in India, where we know the tenure of the land is peculiar, where a condition of the native states and populations existed, from semi-dependence merging into servitude on the one hand, and rising into independence on the other—was that connected with the Bandar-Kirkee booty, in which Dr. Lushington gives valuable information on the general question.\n\nHe said:\n\n\"As to grants of booty made by the authority of the Crown, and grants of money through Parliament or state, although not being new of themselves, they have been construed as booty belonging to the Crown; the Crown disposes of it among the troops engaged as the advisers of the Crown may think fit to recommend. It seems this was always the case and is now regulated by the 2nd William IV, chapter 53, regulating the payment of army prize money, which provides that the military authorities shall provide that in all captures of any fortress or possession of Her Majesty's enemies, or any ship or vessel in any road or haven of such fortress, and in all captures, expeditions or actions from which prize money, or any other legacy grants shall arise, the officers and other officers and soldiers therein engaged, shall have such right to act as Her Majesty shall think fit to order in all the arms, ammunition, stores of war goods, merchandise, booty prize and treasure belonging to the State or to any public trading company, or such estates which may be in the hands of the quarter, or any person so captured, or granted for such expedition or action, to be divided in such proportions and according to such general rate of this division for the army as Her Majesty shall establish, or in default thereof, as Her Majesty, by such manner as she shall think fit, shall direct, according to the advice of the law officers. The proposition is clear, that all prize taken in war belongs absolutely to the Crown, and for one and a half centuries the Crown has been in the habit of granting the prize, after condemnation, to the takers.\n\nAnother result of the cession of prize, and that by no means unimportant, is, that it restrains pillage, as you will find stated repeatedly. The result of any other course would be to recognise some right in the actual taker by the fact of his taking, and so to have pillage indiscriminately, instead of the first idea being the defeat of the foe and victory for the army. That property captured at sea should be kept intact is to the interests of all parties, of neutral and friendly powers, that if not prize, it may be restored to the captor, and if prize it may be legally distributed. I have said that the Ceylon case was one of great importance. It was the case of a rebellion. It was a case in which martial law was proclaimed; and Colonel Drought, who was commanding the forces, issued a proclamation threatening confiscation or attachment of the land or goods of the disaffected. Lord Torrington, the Governor, later on, threatened further measures of that kind against those who did not within twenty days return to their homes. Now what was done in that case? I tell you what was done in order that you may see, in a case in which exceptional measures were taken, the course that was pursued, though even that course received a rebuke which I shall show you. Martial law, as I say, was proclaimed; then first warnings were given to the people; then second, to a certain extent, they were acted upon; and what was done? The property was sequestrated by the military authorities, taken to the store house, we will say at Battleford, to keep it safe, being so sequestrated. The perishable articles were sold, an account was kept of the receipts, and the goods were cat-marked so that it might be known whose goods they were and what price they fetched. The articles which were lasting were kept intact; and of course the land was left untouched; and in the end what was done was this. The value of the goods which had been sold, and the property in specie which was not sold, were restored to all those who had not been found guilty of high treason by the ordinary courts. Even the goods and property of those who were hanged by court-martial, were restored to the heirs and next of kin. In the case of those shot to death in arms, the same rule was pursued. There was no attempt to plunder as there was here. A bill of indemnity was brought in by the legal authorities after peace had been restored, and that Bill was very wide in its terms. It was considered by the Colonial Secretary, Lord Grey, and in his report he points out:\n\n\"That the measures taken—\n\nThose which I have described—\n\n\"did not fall within the ordinary course of martial law\"—\n\nThe ordinary course even of martial law did not justify the sequestration of the property of the subject, it did not justify the sale of the perishable articles, and did not justify the taking possession of those which were unsold; but Lord Grey adds, that it may have been necessary, and competent for indemnification. The sequestration, the selling of the perishable goods, the keeping of the accounts and the restoring of the property may have been necessary, but it was competent for indemnification. But what does he add?\n\n\"It the property of persons sentenced by court-martial for insurrection, but who had in no legal way incurred forfeiture, had been seized and sold for the benefit of the government, say, if persons suspected of rebellion had been thus despoiled—\n\nThat is the phrase the Colonial Secretary used with reference to a transaction which was not one of taking and pocketing property by a com-\nmander, but one of seizing it and selling it for the use of the Government—had been thus despised, the words of the law seem large enough to cover even such arbitrary proceedings. This goes much further even than necessity or justice could warrant.\"\n\nThat is his criticism upon the proceedings on the Ceylon rebellion. Therefore, Sir, if martial law had been proclaimed in the North-West; if the goods of Bremner, suspected of being a rebel, had been seized; if, being perishable goods—which they were not, for they say that some of them are as good as new, now, and shining upon other backs—if they had been seized and sold (for the benefit of the Government, the act would not have been suffered to be the subject of indemnification at all. But in this case there was no martial law, the courts were open. Bremner was at the very time being sent by his confiscator for trial, to ascertain whether he was a rebel or not. The confiscator had himself taken the goods for safe-keeping; the rebellion was over; the General was on his way back, victorious, to be laureled by the authorities at home, and to be enriched by us, and at that time—yes, at that time—he appropriates the goods to himself. He does not say \"they are perishable goods, which will be lost if they are not sold, and I sell them for Government.\" He does not say \"they are lasting goods which will be lost if I do not keep them, and I keep them for Government.\" But he says: \"I take them for myself.\" The rule then is: that the State has no right to touch the goods of a British subject by the military power otherwise than by the course of law, and that when, acting through the military power, the State engaged in a foreign war, does take prize or booty, it is for the State and not for the individual, and the State afterwards grants what it pleases to grant, and as it pleases to grant it; and one of the reasons of that rule is to deter as far as possible from pillage and plunder, and to keep within the limits of honor, justice, humanity and legality as far as may be, those who have the power of the armed over the unarmed, as a military force has over the civilian population of a country, whether the war be foreign or domestic. Now, Sir, I want to apply these general principles to the case in hand, and to ascertain what the general course of the Government, and of the Commander himself was, as to the persons and as to the property of those who were engaged in this rebellion; and also the result of General Middleton's course, in the particular case of Bremner and his turn. Now, Sir, I have nothing but words of commendation on my own part, for the course which the Government pursued—so far as it has been communicated to us—during the rebellion, with reference to the instructions they gave as to dealing with persons and with property. First as to persons, I will read what was stated across the floor of this House at the time, and seems to me, as I say, to merit nothing but words of commendation. Very early in the rebellion, Colonel Crozier, in command of a detachment of the Mounted Police, issued the following proclamation:\n\n\"God save the Queen.\"\n\n\"All persons found to be engaged in the rebellion against Our Sovereign Lady Queen Victoria, or those retained by the rebels against their will, will receive protection on presenting themselves to the Commanding Officer at Carleton and Prince Albert.\"\n\nImmediately after Batoche, General Middleton's dispatch report as to what he was doing under date of 13th May, reads as follows:\n\n\"The rebels were continually coming up with white flags to give themselves and their arms up. We have a list of names of the rebels, and I am disposed not in it with caution to refer to the names, and a warrant that if hereafter any charge is brought against them they are liable to be arrested. I have now three prisoners, two of them being members of Riel's council.\"\n\nOn the 28th May, 1885, I made this enquiry of the Government:\n\n\"Whether Government has given any instructions to, or communicated with General Middleton as to the disposition of any of the insurgents who have surrendered?\"\n\nTo which the Minister of Militia replied:\n\n\"No instructions were issued to General Middleton, except in so far as instructing him to send to Regina the persons whom he considered should be committed for trial.\"\n\nThe House will remember that about that time, or before, a proclamation was issued by General Middleton with the praiseworthy view of causing those on whom he might prevail, to desist from further rebellion, and to come in and surrender, but this proclamation I do not happen to find in the midst of the voluminous papers. Such a proclamation, the hon. Minister of Militia will agree, was issued, and it was a proper proclamation to issue. On the 16th July the hon. Minister of Public Works, on a question being raised as to the disposition of the arrested men, said this:\n\n\"The question is how to distinguish these men—who is a leader, who is not a leader, who has committed an act against the peace of the country, who has committed murder or any other offence, and who have not committed such offence?\"\n\nAnd then I condense his words thus:\n\n\"Of the men who were battling, all are not under arrest at Regina ready to stand their trials. A large number were placed at liberty at once, and are now at their homes; others fell on the field; others were wounded, and a number of those wounded are in our hospitals. But the question is, deciding who are the leaders, who are traitors, who has committed a grievous offence, the offence of murder for example, and the question whether a man was guilty or not—the same questions which it is not for us to try; it is for the tribunals of the country to decide the question. That is the reason why you do not see the men tried by martial law; the men to be tried by the civil authorities and under the laws of the country. I do not think it is in the interest of those men who are to be placed on their trials, or in the interest of the peace of the country, or in the interest of anyone, that we should interfere in a matter of this kind. The Government has done its best and made its effort to see that men have had fair and impartial trial. They are their right, and it is what the Government intended to secure for them, and what they have intended from the beginning, to see that these men, beginning with Riel down to the last man in custody, have a fair and impartial trial.\"\n\nAgain the hon. gentleman says:\n\n\"The court will first decide whether these men are guilty or not.\"\n\nAgain:\n\n\"It is not for the interests of these poor people that a course should be pursued. I say poor people, for those people, whether guilty or not, have been put when they are called upon to stand their trial.\"\n\nThe hon. First Minister, a little later, said this:\n\n\"The General discharged at once, on his own responsibility, the great mass of those who were taken, whose offence was rising in arms, who were not leaders or supposed to lead others into the rising, or to have been guilty of special acts of atrocity. We have exercised that discretion very largely; of course, the Government very readily entrusted that discretion to a man—\n\nThat is, General Middleton—\n\n\"who is equally remarkable for his personal courage, great caution and great humanity.\"\n\nAgain the Minister says:\n\"It is not true. Strict orders were given by General Middleton to the force not to enter any house or touch any property, under pain of severe punishment.\"\n\nIs the Commander-in-chief the only person who was exempt from these orders? Could he honestly tell the common soldiers not to do, in the height of battle, with their passions roused against the men with whom they had just been fighting, that which he felt justified in doing himself, in cold blood, for thirty hours after the rebellion had ended? He stands self-condemned.\" The Minister's reply continued:\n\n\"Official despatches received mentioned nothing about the details asked for. The intention of the Government is to allow the Commanding officer, who knows his duty as a soldier, to look after the troops under his command.\"\n\nI quite agree, that having given these instructions, and assuming that they were to be carried out by the Commanding Officer, the Government were right in the position they took. On the 2nd of July, the hon. member for Hochelaga (Mr. Desjardins) read from a correspondence in the Mail newspaper of the 19th of June, the effect of which was, that the soldiers destroyed much and took away a great deal at St. Laurent and Fish Creek from the Half-breeds' houses, of whom many were loyal, and others were dragged into the insurrection against their will, and that in spite of the strict orders given by General Middleton, the soldiers had robbed and destroyed everything they could lay their hands on; and the hon. member for Hochelaga asked for some report on this statement. The hon. Minister of Militia replied:\n\n\"As to that part which speaks of the most stringent orders being given by General Middleton to prevent such disorder or such confusion, I have received no communication direct from the General stating that he had given the most absolute orders to that effect. I have even called his attention to the fact mentioned, and the General has answered that so far as he had been able to judge of the facts, he did not believe in these reports.\"\n\nI have read from the hon. Minister's reply only an abstract of that which is material to this part of the case.\" Now, Sir, there you find rules laid down—rules consistent with military practice, and consistent with the honor of the Canadian militia—rules especially applicable to this case, in which these few unfortunate, misguided men, but, after all, fellow British subjects, were the persons and whose was the property in question. Now I turn to the General's own action, as stated in his evidence before the Committee. He was enquired of with reference to what took place at Batoche, and he said, on the 19th page of the report of the Committee:\n\n\"In the middle of hard fighting the men found these things, but the private houses and property of loyal people anywhere near the place was not touched. But I did not consider it was my duty to protect the property of the rebels we had just been fighting hard with.\"\n\nI ask whether that is in conformity with the statement I have read. Who was to decide? The rebels did not carry their furs on their backs, or deposit them in their rifle pits. They left them in their houses. Who was to decide at that moment whose property any particular furs were, or was the process of confiscation to be performed by the common soldier, with the prize before him, by awarding to himself the property which he confiscated? We were told that strict orders had been given to prevent pillage and destruction of property; but we find General Middleton saying:\n\n\"But I did not consider it was my duty to protect the property of the rebels that we had just been fighting with.\"\nHe grossly mistook his duty.\n\nAt page 29, with reference to the Batoche furs, the General stated that he did not himself take the furs, but was fortunate enough to obtain furs through some one unknown:\n\n\"My aide-de-camp told me that somebody had put a box on board the steamer and said it was for me. I asked him what it was, and he said it was furs. I said: Who put it on board? and he said: I have not the slightest idea.\"\n\nThe General was asked who put them up for him, and he replied:\n\n\"I have not the slightest idea who put them up for me. I have not the slightest doubt it was done by some men of the force who got them, and they thought it was a nice compliment to pay me, so they put them on board. I did not want to ask about it.\"\n\nThis spontaneous and anonymous present of a bale of furs, known by the General to have been the result of pillage, was placed on board the steamer. He knew, he was satisfied that the men of the force had taken the furs, and he thought they were paying him a nice compliment by making him a present of some of them and putting them on board for him. They put them on board unknown to him. So much virtue must blush unseen; and he himself did not want to ask who should get the credit for it. That is the condition of things with reference to the Batoche furs. As to the Bremner furs, General Middleton was not invested with any power whatever; he was not attempted to be invested by the Government with any power; the instructions of the Government merely were to prevent all pillage and destruction of property; and that was his plain and obvious and sole duty. He was invested with this power only, that of deciding whom he would send down to Regina for trial.\n\nAt page 13 of the report, his own evidence shows that, after Poundmaker had been taken, some half-breeds came from the camp. The General was told that there was some reason to believe some of the men had been rebels, as some of them had been recognized as having been at Cut Knife; and it was reported to him that people were carrying off some of Bremner's furs, and upon that report he ordered these furs to be taken and put in the police barracks for safe keeping. These furs, I think, would have been there safely kept, if he, himself, had not later on ordered them to be taken out from the place where he had ordered them to be put by. But after ordering them to be put in the barracks for safe-keeping, he ordered them to be packed up for himself. But he says that, later on, he got further information that a rifle belonging to one of the men killed at Cut Knife had been found in Bremner's possession. That in itself was, of course, susceptible of satisfactory explanation as to Bremner's innocence, but without seeking such explanation, he ordered all these men, Bremner included, to be sent down to Regina to be tried; and at this same time, when he was reaching this conclusion, Mr. Hayter Reed reminded him of Bremner's furs, and thereupon he ordered them to be confiscated and divided, himself taking the best. The revised letter reads:\n\n\"The General having decided to confiscate the furs now in your charge and taken from rebel, desires that you should make up a select bundle of beaver and fisher for him and a selection also for those of his staff.\"\n\nNow, what was this man's situation? He was, he thought, a dictator. He had the awful power of deciding who should be sent for trial and who should be left in peace. He says:\n\n\"I thought I was the ruling power up there, owing to the state of war, that I could do pretty much as I liked as long as it was in reason.\"\n\nHe knew, however, that he had no power to try Bremner or to determine his guilt. He determined, therefore, to send him on for trial, as to his person; but, at the same time, he determined to condemn and appropriate his property. He determined that there was sufficient evidence against Bremner to warrant his being tried, and he sent him to Regina for that purpose. But as regards the property, the question of innocence or guilt he put in a train of immediate adjudication by himself, and at the same instant that he was ordering the man to be tried by competent authorities as to whether he was innocent or guilty, so far as his person and life were concerned, he judged, without the slightest warrant of authority to be found anywhere, that he was guilty, so far as his property was concerned, and, so judging, he, by one single operation, confiscated and appropriated his goods for himself. He said he fully believed that having directed the confiscation of the furs belonging to a rebel, he was not exceeding his powers in ordering some for himself and some for his staff, his excuse being: \"I did not think it was unreasonable to allow a few of those furs to be taken; and again: \"I might as well have some too.\"\n\nHe directed that Bremner be sent to trial to find out whether he was guilty of being a rebel or not; but, as regards the furs, he tried him in his own mind and adjudged him guilty, and confiscated his property. He could not confiscate Bremner himself, he could not take an eye, or a leg, or a tooth for his share of the booty, and so he sent him to Regina to take his chance. But he thought he could confiscate his furs; and that he did without trial or proof or anything else. While he could not find Bremner guilty of being a rebel, so far as his person was concerned, he decided him to be a rebel to the extent of confiscation, and at the same instant decided to divide the spoil, and to take the lion's, or rather the wolf's share. That seems to me utterly disgraceful. I cannot, I confess, understand how it is possible that any man in the position of General Middleton could, for an instant, have allowed his moral sense to become so far blunted and confused as to have been guilty of the act he has committed. It is said that the plunderer has been plundered—that what he took from Bremner was taken from himself on the boat. I suppose whoever took it, thought he had as good a right to take it as had General Middleton. But that makes no difference. It is the disgraceful course which was taken by the General which has given rise to the whole loss. I am glad the loss has been ascertained; and I hope the Government will see fit to take steps to see that the General makes good the loss and withdraws from our service.\n\nOTTAWA:\nPrinted by Brown Chamberlin, Printer to the Queen's Most Excellent Majesty.\n1890.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001341.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11256, "total-output-tokens": 11135, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4883, 1], [4883, 11835, 2], [11835, 19293, 3], [19293, 26613, 4], [26613, 34039, 5], [34039, 41382, 6], [41382, 45032, 7], [45032, 51456, 8]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]