[{"id": "eac98f0e818375749c6769b88639840ade3e8c28", "text": "MANITOBA\nHISTORICAL AND\nSCIENTIFIC SOCIETY\n\nTRANSACTION NO. 7 SEASON 1883-4.\n\nNavigation of Hudson Bay\nAND STRAITS,\n\nBY\n\nMr. Charles H. Bell,\n\nA paper read before the Society on the evening of 10th May, 1883.\n\nWINNIPEG:\nMANITOBA DAILY FREE PRESS.\n1883.\nThe regular meeting of the Historical and Scientific Society was held Thursday evening, with a good attendance. Rev. Professor Hart presided. At the usual meeting of the Executive Committee, Mr. J. M. MacGregor was proposed as a member, and afterwards duly elected. Mr. Chas. N. Bell was then called upon to read his paper upon the\n\n**NAVIGATION OF HUDSON'S BAY AND STRAITS.**\n\nThis paper is a sequel to Mr. Bell's letter which appeared in the Free Press last Monday, and is as follows:\n\nUntil a year or two ago, the general public were under the impression that the Hudson's Bay and Strait were navigated only by one or two vessels belonging to the Hudson's Bay Company, which carried the trading goods for their annual business from London to York Factory and other posts about the Bay, and returned with the previous year's yield of furs. Even the accounts of the voyages of these vessels were wrapped in an envelope of misty vagueness. Little or no information was obtained through the medium of the press, and the old books of Robson, Ellis, Dobbs, Hearne, Chappelle, Black and others, who had sailed in those waters, or written out the accounts of those who had from 1738 to 1838, are too costly and rare to be found in ordinary libraries.\n\nThe records of the Hudson's Bay Company could only be inspected in London, and even the existence of those records was unknown, except to a very few, and that few seem to have kept their contents to themselves.\n\nProf. Bell was readily and cheerfully supplied with valuable information by the Hudson's Bay Company's people, both in London and at the posts about the Bay, and he has presented it in his annual geological reports.\n\nThat a large number of whaling vessels seek the waters of the Hudson's Bay annually, and take out oil, whalebone, etc., to the ruling market value of $124,000 as an average season's \"catch\" (as we find by the U. S. Government fisheries returns for the past eleven years), seems to have passed unnoticed.\n\nAn examination of the works of the old-time navigators, and a comparison of their statements on the subject of the navigation of these seas with the statements of whalers who now pass each season there, may prove both interesting and instructive.\n\nThe extracts given in this letter are taken directly from the works quoted, and from manuscript copies of the original log-books of whaling vessels sailing from New Bedford, Mass., and New London, Conn.\n\nIt must be borne in mind that all the vessels mentioned in this paper are sailing ships.\n\nMore and more satisfactory evidence is being produced every year to prove that the navigation of the Hudson's Bay and Strait is not as formidable as we have been led to suppose.\n\nIt is now almost considered as a fact that not only does the Bay itself not freeze over, but that the Strait, with its high tides and strong currents, remains open all winter as well.\n\nThat vessels can leave York Factory until at least the first of November, is a fact that is proved by whalers, whose statements are found herewith:\n\nJoseph Robson, in his book published 1752, and who lived at York Factory and Churchill from 1733 to 1736, and from 1744 to 1747, says:\n\n\"As the Straits, then, are never frozen over, nor always unnavigable, even when there is much ice in the Bay, I imagine that a safe passage may be often found in the beginning of June. The beginning of June seems to be the likeliest time in which to expect a free passage. I know that but a few years ago this voyage was thought very difficult and tedious; that the Company's ships almost always wintered in the Bay, and they allowed the captain, if he wintered safely, a gratuity of fifty guineas. But of late this gratuity is withheld from him and given only to those who go out and return the same year, so that what was once represented as absolutely impracticable is now very easily and speedily performed.\"\n\nBylot, in 1615, entered the Hudson Strait on the 27th May, according to Captain Ellis.\n\nTo give some evidence from a people who certainly would not be prejudiced in favor of a \"Hudson's Bay route,\" being practically utilized, but who would, most likely, dislike the idea of a steamship service between the Bay and Europe, it is\nwell to give some extracts from the logbooks of whaling vessels sailing from New England ports. The evidence which I believe has not yet been published, was obtained by a gentleman interested in the future of the Northwest, who sent a person last summer to New Bedford and New London, to inspect personally the logbooks of such whalemen as he could find, who had an intimate knowledge of, and experience in, the Hudson's Bay and straits.\n\nBy telegraphic advices received yesterday from Ottawa to the city press, it would appear that this, or similar evidence, is being presented to the House, embodied in a report.\n\nCapt. J. Tabor, of the ship Northern Light, sighted Resolution Island, at the extreme east of the straits, on the 14th July, 1862, meeting float-ice, which the ship passed through, and on the 31st July was in the Hudson's Bay and chased their first whale. The ship left the bay on the 10th Sept., and was through the straits into the Atlantic Ocean on the 18th.\n\nThis ship again went to the bay in 1863, wintered there, and on the 15th May, 1864, the Log-Book says they began to get ready for whaling and cut loose from the shore ice in the harbor. They left the bay on the 20th Sept., 1864, thus showing over five months' work in the bay that summer, and then leaving at an early date.\n\nThe bark Andrews, from New Bedford, sighted the entrance to the strait 25th June, 1863, and had a good deal of work sailing through ice in the strait, wintered in the bay, and passed out 24th Sept., 1864.\n\nThe ship Ansel Gibbs sighted Resolution Island, bound in, 21st June, 1866, and with little trouble from ice was in the Bay 10th July. They prepared for wintering 24th September, and had cold weather soon after. They passed out of the Bay 11th February, 1867.\n\nThe same vessel sighted Resolution Island on 28th July, 1868, and on 5th August was proceeding up the Bay, having seen little or no ice. They went into winter quarters 25th September, and went out next year in September without trouble from ice.\n\nThe bark George and Mary, from New Bedford, sighted Resolution Island 15th July, 1879, and on the 19th July, four days after, was sailing up Hudson's Bay, having seen no ice to speak of. They did not begin to prepare for winter until 15th September, and the log-book shows that on the 1st October the thermometer registered 20 degrees above zero, and on the 1st November 8 degrees below zero. On May 18th next they sawed the ship out of harbor ice, and on the 29th were sailing north. They went out in August.\n\nThe Abbie Bradford, from New Bedford, was working through the Strait on the 31st June, 1878. Logbook says, no ice of any consequence in sight. On July 20th they spoke the Bark Nile, boiling their third whale of the season.\n\nOn October 27th log-book says, thermometer below zero, for the first time.\n\nNo ice is mentioned on the outward voyage, August 10th, 1879.\n\nIn a conversation, Capt. Tabor, above mentioned, who made two whaling voyages to Hudson's Bay, said:\n\n\"The entrance to the Bay can be made from the 1st to the 15th July, and steamers would have great advantages over sailing vessels, as they could steam inside of all obstructions from ice, water being bold close to shore, tides strong, say 6 to 7 miles, but quite regular.\"\n\n\"There is no trouble about coming out, up to November 1st, and some seasons later. Hudson's Bay is open all winter, and what little ice makes on the shore breaks up with every gale of wind.\"\n\nCapt. St. Clair, of the ship A. Horton, New Bedford, said: \"I entered the Bay 13th June, 1877, and came out 25th September, 1878. Ice did not appear until 12th November, 1878.\"\n\nCapt. E. B. Fisher, who made eight voyages, covering some sixteen years, into Hudson's Bay, said:— \"A steamer can enter and go through the straits sooner than a sailing vessel. Whalers have never had any trouble in coming out. They leave just as soon as the summer whaling is over, and are always out, therefore, by the first of November.\"\n\n\"Ships do come from Cumberland Inlet later than that, and it is farther north.\"\n\n\"The only trouble is in the Hudson's Strait, and that is caused by the ice coming down from Fox's channel and lodging among the islands in the Strait, blocking up the narrowest part, which is midway of its length.\"\n\n\"A steamer could crawl out by keeping close to the rocks inside of the ice, as there is always open water, more or less, between the rocks and the great body of the ice. The tide runs six to seven miles an hour, and at every turn of the same, more or less breaking-up occurs, and a steamer could take advantage of all such chances, when a sailing vessel would be at a standstill if the wind was ahead and blew any way fresh.\"\n\n\"The Bay is open all winter, except a little ice makes near the shore, and that breaks up in every gale of wind.\"\n\nMany other captains of great experience in Hudson's Bay navigation, gave similar information and opinions to the above, and, without doubt, this testimony is the most valuable yet obtained.\n\nThe evidence of the captains of the Hudson's Bay vessels only covers the state of navigation in August, September and October, and therefore is not nearly as valuable as the above.\n\nCaptain McPherson, of the Ocean Nymph, owned by the Hudson's Bay Company, told Prof. Bell, in 1880, when on the voyage from York Factory to London, that the drift ice they passed on the 23rd September was much worse than any he saw on the outward voyage, that he had never seen ice on that part of the track before, and that he thought a steamer would be sure of a passage at any time, by going in close to the shore.\n\nProf. Bell's words are: \"This greatly surprised me, as it did not appear at all formidable, compared with the continuous...\"\nice I have passed through in a steamer going from St. John's, Newfoundland, to Halifax, when it covered the sea completely for the greater part of the distance.\n\nCharles Horetzky who lived at Moose Factory and is well known in Canada, in a letter to Col. Dennis, dated 4th Nov. 1878, says that in 1875 the bark \"Lady Head\" arrived at Moose Factory, in James Bay, on the 20th September, and left again on the 13th October of the same year, and after meeting with an accident in the Bay, reached London in safety, after a 29 days' voyage.\n\nHe also says: \"By the way, reference has been made to the losses sustained by the Hudson's Bay Co. in the shipwreck of several of their ships.\n\n\"They never, to the best of my knowledge, lost a ship of their own, excepting the \"Prince Arthur\" and the \"Prince of Wales,\" in 1864, upon the Mansfield Island, at the entrance of Hudson's Bay. Both of these really fine vessels went ashore one lovely moonlight night at 10 o'clock. The weather was beautiful at the time and the ships were carrying studing sails alow and aloft on both sides. A few hours previous to the accident the captains of the respective vessels had been interchanging visits, the sea being quite calm, sufficiently so at any rate for ship's boats. They were close to the island, consequently should have known danger. No lives were lost and a great portion of the cargoes was saved. In the autumn of the same year (1864) the schooner Martin arrived at Moose Factory from York, about the end of October, just in time to be hauled up out of the fast forming ice.\"\n\nAll authorities agree in stating that the ice forms in James Bay rather earlier than in the portions farther north on account of the shallowness of the water there, and the ice remains fast for a greater length of time for the same reason.\n\nCapt. Ellis, when in search of a northwest passage in 1746; writes in his book that he wintered in the Hayes river at Fort Nelson (now York Factory,) the river freezing on the 31st October. It was quite clear and open, their ships floating on the 16th May of the next spring.\n\nProf. Bell points out the fact that a harbor such as that of Churchill, on Hudson's Bay, would have the advantage over Quebec or Montreal of connecting directly with the open sea, and hence in the autumn vessels would not be liable to be frozen in, as occasionally happens in the St. Lawrence.\n\nIt seems to be the universal belief of sailors, who have a knowledge of the Hudson's Strait, that in May and June there is little or no ice there, but that towards the end of June and in July the ice from the far north comes down Fox's Channel, and as the general prevailing winds in those months are from the northwest it makes it most difficult for sailing vessels to work up against both the head winds and ice. They become helpless as soon as they meet the ice and drift about with it, but steamers could run close into the shores, which show water in plenty, and be in no danger from tides or current. At every rush of the tide, which in the strait is fully thirty feet, the ice coming down Fox's Channel becomes broken up and separated, and steamers could pass through it and the islands which stretch across the entrance to the Hudson's Bay.\n\nEllis says: \"If I have to give any directions for avoiding the thickest of the ice in these straits, it would be to keep near the north shore, for we always observed that side much the clearest, as not only the winds blow mostly from thence, but currents, too, come out of most of those large openings which are on that side.\"\n\nLieut. Chappell, R. N., in command of H. M. S. Rosamond, visited the bay in 1814, and writes: \"It is not to be expected that ships, during their return to Europe, will ever meet with loose ice; therefore, as soon as our ship anchored on York Flats we undid all the preparations which had been made for maneuvering whilst among the ice.\"\n\nProf. Hind refers to this same statement of Chappell's and comments on it as follows:\n\n\"This is a most important consideration in relation to the navigation of the Hudson's Strait in the fall of the year. In fact it reduces ice precautions to the early or summer voyages only, and besides conferring unexpected safety upon the homeward voyage it prolongs the season of navigation, so that steamers may remain at York Factory until the new ice begins to be formed about the harbor or mouth of Nelson River. The use of the magneto electric light on approaching either entrance to the Straits, or the establishment of land signal stations there, provided with powerful electric lights, would greatly assist in promoting safe and speedy navigation during the long nights of the fall of the year. In June and part of July there is little or no night.\"\n\nOut of all the vessels belonging to the Hudson's Bay Company arriving at York Factory between the years 1789 and 1880, a list of which was procured by Prof. Bell in London in 1880, not one arrived there before the 2nd August, and in many cases it was as late as the 28th of September.\n\nThe dates of sailing for England range, I find, all the way from the 25th August to the 7th October.\n\nThe list shows 133 visits of vessels of the Hudson's Bay Co. from England to York Factory within the years 1789 and 1880.\n\nTo show that the ships did not suffer greatly as the result of the passages through the ice, it is well worth noticing that the names of some of the vessels appear in the list over a score of times, and are presumably of the same vessels. Out of these 133 vessels, only the two mentioned above were lost, and they through gross carelessness.\n\nBy this accurate statement of the dates of arrivals and departures of the H.B.Co.'s vessels, we have a means of comparing the value of the evidence of their captains, regarding the length of the open season of\nnavigation with that of the whalemen who have pushed through the Strait at all dates between May and November. The ships of the Company appear only in August, September and October. Those of others during parts of May, June, July, August, September, October and November.\n\nProf. Hind says: \"We do not know how many British whalers have been through the Strait into the Bay.\"\n\nThe United States Government returns show that from 1861 to 1874 forty-nine voyages direct to Hudson's Bay were made by American whalers, and four vessels were lost. None of these four were lost in the Strait; all were lost in the northern part of the Bay. When it is remembered that by all sailors the scene of danger in the whole passage from England to York is placed in the Strait, it is rather peculiar that no vessels have been lost there, and would lead one to conclude that the ice may delay sailing vessels, but is not actually so dangerous as to destroy them. That some 750 vessels recorded as passing through the Strait into Hudson's Bay should get there without any serious damage is, a point that is well worth considering.\n\nProf. Hind in speaking of navigating the strait later than the 1st of October, says: \"No ice interferes to prevent a passage. The only trouble is the passage being comparatively narrow, the late season of the year renders it dangerous to a certain extent on account of storms, but by means of the magneto-electric light and lighthouses on two or three points in Hudson's Strait you would effectually provide against any mishapance.\"\n\n\"It appears certain that some of the popular impressions respecting the icy character of Hudson's Strait and Bay have arisen from the accounts which have been published from time to time of the climate and coastline of the Northern Labrador, which is not unfrequently neared in entering the strait. But the coastline of Northern Labrador is the unfortunate recipient of the combined effects of no less than three separate Arctic or sub-Arctic ice streams.\"\n\n\"These are the East Greenland ice stream, the Baffin's Bay and Davis' Strait ice streams, and the Hudson's Strait ice stream. All of these ice-encumbered currents meet in the summer on the coast of Northern Labrador, and are the cause of its exceptionally cold climate.\"\n\nAn objection to Hudson's Bay navigation often advanced is that as the harbors at Churchill and York are closed so early in the autumn, it makes the season of navigation extremely short in consequence.\n\nTo disprove this statement, it is only necessary to turn to the table showing the dates of the opening of Hayes River, at York Factory, for a term of 53 years ending 1880, given in Prof. Bell's geological report of 1880, and which was obtained at York by him from the records of the Factory.\n\nOnly once in 53 years did the river remain closed until the end of May or first of June and in the winter of 1880-81 it did not freeze over at all. The average opening for 53 years is the 15th May.\n\nOnce (in 1878) the river closed as early as the 3rd November, but the average closing is about the 20th November.\n\nAbout the Nelson Harbor, I will give the authority of Prof. Bell, that 'most of its estuary becomes dry at low tide, but a channel runs through its centre, as far as the head of tide water.' Soundings made showed two fathoms. In continuation of the channel running down the estuary, a \"lead\" of deeper water extends out into the bay, forming the \"York Roads,\" with excellent anchorage.\n\nThe Churchill, unlike all the other rivers, has a deep, rocky and comparatively narrow mouth, which can be entered with ease and safety by the largest ships at all stages of the tide.\n\nIt is a common belief apparently that the passage through the Strait is extremely dangerous, and that few vessels ever find their way through, but where this report arises it is impossible to say, and those who credit the truth of such a statement are unable, I believe, to give any authority for making it. So far as I can find, from lists of vessels entering the Bay, works on the subject, and other sources, only one vessel ever tried the passage and failed to make it, and the captain of that ship was frightened by the ice.\n\nWhen a Hudson's Bay Company's ship-captain says directly that he believes there is always plenty of open water along the shores of the Strait, it would seem as if opponents of the \"Hudson's Bay route\" must look to other sources than the Hudson's Bay Company for their arguments, and it is difficult to say where they can get support for their statements.\n\nThe substance of this paper, compiled as it is from the best authorities and most credible sources which are open to the writer, is laid before you so that you may draw your own conclusions and inferences from the facts and statements submitted.\nHudson's Bay Country.\n\nIts Climate, Soil, Timber, Minerals and Fisheries.\n\nTo the Editor of the Press Press.\n\nI believe it to be the opinion of most people, even of those in our own Dominion of Canada, that the territory in the neighborhood of the Hudson Bay is an arctic, sterile, unproductive, unprofitable country, and entirely useless for any purpose but that of supplying a few furs for the trade of the Hudson Bay Company. Our ideas on this subject have generally been formed from fur traders reports and casual views of maps, which show us, only, bare stretches of paper crossed here and there by a network of lines of latitude and longitude, occasional rivers and lake shores, and having a scattering of old English and Indian names at irregular intervals. Hence we are apt to lose sight of the fact that the Hudson Bay itself extends between the 51st and 63rd degrees of north latitude, is about 1,000 miles in length by 600 in width, and has an area nearly equal to two-thirds the size of the Mediterranean Sea. The north of Scotland is as high as the 58th degree, showing that 7 degrees length, at least of the Bay is in the same latitude as from the English Channel to the north of Scotland.\n\nIf your readers only kept in their minds the very vague ideas they entertained of what this Province of Manitoba was like as short a distance of time back as ten years ago, I think most of them will remember that Manitoba was then classed with the Hudson Bay itself in being only fit for habitation by the Eskimo, Northern Indians and fur traders. We inhabitants of the Northwest are particularly interested in the climate and resources of the Hudson Bay country. It is very clear to intelligent men at this date that the employes of the Hudson Bay Company are the last people to whom we must look for practical information of the navigation of the Hudson Bay and Strait, and the resources of its waters and surrounding territories, and it must be borne in mind that their forts or posts are nearly all, in that part of the country, close down to the bay, on the marshy ground that is generally to be found at the outlets of the rivers on which they are built, and I will give evidence further on to show that these spots, as a rule, are the coldest and bleakest in the territory.\n\nJoseph Robson, in his book published in 1752, shows conclusively that the Hudson's Bay Company people did not attempt to navigate except in very limited portions of the summer season, and that they even in those early days frowned upon every attempt made to open up trade in the vicinity of the bay, and as he was at Churchill and York for several years dating from 1733, and made a number of private explorations (on account of which he fell under the great displeasure of the Governor), he knows well whereof he speaks. He writes of \"gooseberries and black and red currants growing near the sea, and marshes and low grounds full of good grass, and a patch of ground which, though exposed to the north and northeast winds, produces good radishes, coleworts, turnips, small carrots and lettuces and other salading. Blackberries also grow upon the beach. The cattle here would live and do well, if the same care was taken of them as is generally taken in England.\" Robson also states: \"In summer when the wind is about west-south-west, it becomes sultry, and if it happens to blow fresh, it comes in hot gusts as if it blew from a fire, and the hardest gusts bring the greatest heats; but this is not the case when the wind blows from any other point.\"\n\nThis was written as a proof that a genial climate and hospitable region lay in that direction, for it must be explained that at that date nothing was known of the interior to the southwest of York Factory, and the Company's governors would not allow explorations to be made by their servants. Prof. Macoun to-day grows eloquent on the subject of the Chinook and other warm winds, that range up to the north from Colorado and Mexico, spreading out as they advance, and these very warm air currents are without doubt those felt at York, and mentioned by Robson.\n\nI have mentioned to the people that the latitude of York Factory is the same as that of Perth in Scotland, and they exclaimed, \"Oh, but then see the influence of the Gulf stream!\" I submit the following in answer:\n\nIn speaking before the Railway Committee of the House of Commons of Canada in 1878, Prof. H. Y. Hind explained about those very warm currents of air of the Northwest, that \"it may be briefly stated that it is the track of the aerial gulf stream of the Northwest which bears a similar relation to the atmosphere of that part of North America, as does the gulf stream to the ocean on its coasts. It is influenced by the same unceasing power, namely the earth's rotation, and it sheds its climatic influence over the area it covers.\"\n\nHe also stated: \"It can scarcely excite\nsurprise that there should be a large tract with a good climate and great depth of drift clays in the vicinity of the valley of the Nelson River, for the following reasons; First, it is the lowest portion of the whole basin of Lake Winnipeg, and is constantly under the influence of the drainage waters from 300,000 square miles of land, lying altogether to the south of the narrow depression, not, perhaps, more than forty miles broad, through which the Nelson River finds its way. The great thickness of drift clays upon several of the rivers, noticed by different observers, on the canoe route from York Factory to Norway House, must necessarily produce a good soil, and the two conditions, soil and a humid climate, concur to sustain an exceptionally fine forest growth for this region, and an abundance of animal life.\n\nAccording to Ballantyne, who wrote so many delightful books on the Northwest, the brigade of H. B. Co. boats leaves York Factory about the end of May, which shows that the rivers are open even in the cold border land of the Bay at that date, and a Rat Portage correspondent of a city paper has reported that this year the Lake of the Woods will not be open before the end of May.\n\nMr. Jukes, who has spent this past winter as head of the surveying party for the Hudson Bay Railway Company at York Factory, in a letter to General Rossier, which was dated 5th March, says that the water was dropping from the trees, the weather was quite mild, and the winter appeared to be breaking up. The ice in the Hudson Bay was such as not to interfere in the slightest with navigation. He was prosecuting his surveys and explorations with success, and had not been compelled through the severity of the weather to cease work a single day.\n\nIn 1742 the Frenchman Joseph la France told Dobbs, the writer, that when within a couple of days journey of York, coming down the Nelson River, the Indians informed him that he would find cold weather at the sea, and he would not believe them, as everything was so pleasant looking and the trees were all in full bloom. This explains in some measure the statements made regarding the country about the Nelson River being under the influence of such a severe climate. The statements are made by persons who lived at the mouth of the river.\n\nExtending through a period of 50 years a record kept at the Albany river, James Bay, shows that the river is open, on an average, for fully six months of the year, and such is the case also in regard to the Hayes River at York Factory for 52 years, which has had an average of 6 months of open water. The Nelson is open for fully 7 months. In the winter of 1880, the Nelson did not freeze across at all for some 40 miles above tide water.\n\nFrom an authentic record of the dates of opening and closing of Hayes River at York from the year 1828 to 1880 I compiled by William Wood, meteorologist at the fort, and a copy which I have, I find that the average closing was 20th November, and opening 15th May.\n\nCapt. Ellis, who wintered at York Factory with the \"Dobbs Galley\" and \"California,\" in the years 1746 and 1747, when he was in search of a Northwest passage, says, in his book published in 1748, as follows: \"If the weather is cold they have an abundance of beaver skins to clothe them and many other conveniences that put them in some measure at least on a level with those who live in a milder climate. But what in this respect will appear much more extraordinary, I dare assert, that people from Europe who have lived here for some years prefer it to all other places, and when they leave it and come home with the ships they grow tired of a more moderate climate.\"\n\nArthur Dobbs, in a most valuable and voluminous work, entitled, \"An account of the countries adjoining to Hudson Bay, etc., published in London, 1741, writes that the \"Hudson Bay posts are all in the most exposed situations near the Bay, and that the general climate is as good as Southern Poland, nothing wanting to make it so but the building of convenient houses with stoves, such as are used in the same climates in Europe.\n\nI copy also the following from his book, \"the reason why the manner of living there at present appears to be so dismal to us in Britain is entirely owing to the monopoly and avarice of the Hudson Bay Company; (not to give it a harsher name,) who, to deter others from trading there or making settlements, conceal all the advantages to be made in that country, and give out that the climate and country, and passage hither, are much worse and more dangerous than they really are, and vastly worse than might be if those seas were more frequented, and proper settlements and improvements were made and proper situations chosen for that purpose. This they do that they may engross a beneficial trade to themselves, and therefore, oblige their captains not to make any charts or journals that may discover those seas or coasts in order to prevent others from sailing to their factories. They also prevent their servants, from giving any account of the climate or countries adjacent that might be favorable and induce others to trade and settle there nor do they encourage their servants, or even allow them, to make any improvements without their factories, unless it be a turnip garden.\"\n\nAnd again he says:—\"In the latitude 56° is a very great and bold inlet to this country into which Capt. Davis sailed 10, and Capt. Weymouth, afterwards 30, leagues. The sea, inlet and coast were full of the finest cod that Davis ever saw. There were great numbers of all sorts of land and water fowl, and the country full of fine woods.\"\n\nThe celebrated Capt. Gillam, wintered in James Bay in 1688, it was September before he got there, and he found that the Rupert River did not freeze until the 9th December, and in April next year the cold was almost over. In 1670 the river froze over November 6th, and in the fol-\nlowing spring it was clear on the 20th April.\n\nRobson speaks of the lead and copper mines and says the Hudson Bay Company explained the possession by the Indians of copper, by saying, that they had broken it off from the cannon of some vessel wrecked on the coast, in some unknown place, not condescending to explain how cannon brass could be hammered into fine copper.\n\nScores of authorities and writers who are well known in British history as celebrated, as well as clever and experienced navigators and adventurers, might be quoted from their books, now lying before me to support the data already given, and when it is known that over 750 voyages have been made into the Hudson Bay through the much-advertised-as-being-dreadful straits, and that few accidents have happened to these old-fashioned, ill-shaped vessels from either wind or ice, it will be seen that the generally accepted idea of the dangers to navigation is rather erroneous, and altogether over-estimated.\n\nAll the early discoverers speak of the black whales seen, and Robson says he saw at one time a school of forty in the bay. White whales were seen in plenty. Ellis speaks of the value of the whale fisheries in many parts of his work and of seeing whales in different quarters of the bay.\n\nTo support directly the statements made as above, by the United States Government Fisheries report of whaling vessels sailing from United States ports to the Hudson Bay, I may say, that in the eleven years ending 1874 the value at ruling market prices, of oil and whalebone brought from the Hudson Bay by United States whalers was $1,371,023.36; and it is known that this does not cover the whole \"catch,\" as whalers come down from Cumberland Inlet into the bay, whale there, and then report their whole cargo as from Cumberland Inlet.\n\nIn case your readers should be inclined to doubt the veracity, or knowledge, of old-time navigators like Ellis, Hearne, Davis and Gillam, as against the \"prevalent erroneous idea\" I will give a short account of the modern discoveries in this field for exploration.\n\nOn the 13th September, 1880, Prof. Bell, of the Geological Survey of Canada, sailed from York Factory for England on the Hudson Bay Company's sailing vessel the \"Ocean Nymph.\" He passed through the Strait on the 8th October. In his report to the Government he speaks in very decided and concise terms as to the value of the woods, mines, and fisheries. Amongst the products of these he mentions oils, furs, whalebone, sawn lumber, tallow, isinglass, lead ore, ivory, &c. He says the Indians and Eskimo find a variety of fish for their own use, and fine salmon abound in the rivers of Hudson Strait. From, one of these rivers salted salmon is actually now being exported every year. Water fowl and large game is in plenty. But the most important of the undeveloped resources of the country around the bay are its soil, timber and minerals. Among the woods are white, red, pitch and jack pine, black and white spruce, tamarack, fir, balsam, aspen, larch, white cedar and white birch. The numerous rivers, which converge towards the head of James' Bay offer facilities for driving timber to points at which it may be shipped by sea-going vessels. He found himself or had specimens direct, from rich iron stone, inexhaustible supplies of good manganeseiferous iron ore, and promising quantities of galena. Traces of gold, silver and copper were noted on the east main coast, traversed by Prof. Bell himself. Lignite, gypsum and petroleum bearing limestone, are also reported, while \"small quantities of anthracite and various ornamental stones, and some rare minerals were collected. Soapstone is abundant as well as iron pyrites. A cargo of mica is said to have been taken from Chestesfield inlet, at the extreme north end of the Bay, to New York, and valuable deposits of plumbago are reported to occur on the north side of the Strait.\n\nProf. Hind states that from inspection of a long range of dates he finds that salmon fishing commences at Churchill before it begins at Sandwich Bay, on the Southern Labrador, which is a distance of 5 degrees south of it, and when the Indians and traders are fishing for salmon on the northwest coast of Hudson's Bay at Churchill the entire coast of Labrador is blocked by ice and is inaccessible to fishermen.\n\nDobbs speaks of the cod in Hudson's Bay, so does Prof. Bell, the Bishop of Moosonee, and the great explorer Hearne. It is well known that caplin occurs in immense quantities in Hudson Bay, and this is the favorite food of the cod, and the value of the Bay for such a fishing ground must not be lost sight of. Good, sound logs of white spruce, upwards of two feet diameter and showing from 100 to 140 lines of growth, were seen by Prof. Bell on the Hayes and Nelson Rivers. Jack pine two feet in diameter at the butt, with straight trunks about seventy feet in height, and nearly free from branches for the first twenty or thirty feet, were seen by Prof. Bell in large groves on the Albany River, likely the same described by Capt. Davis a hundred and fifty years ago, when he says that the country (James Bay) was full of fine woods.\n\nWith the object of giving some information to those of your readers who have no other sources of obtaining it than through the medium of the press, and to gather such information in return as better informed persons than myself are able to give, I venture to hand you these lines; with a hope that some of our people who have given the matter attention will give us the result of their study and observation.\n\nI will endeavor to hand you shortly some dates of the navigation of the Hudson Bay and Strait, with the distances from Churchill to points in the interior, the effect that the opening of a Hudson's Bay route to Europe would have on the value of agricultural products for export, and the transportation rates on both imports and exports.\n\nYours truly,\n\nCHAS. N. BELL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001119.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 22922, "total-output-tokens": 9004, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 253, 1], [253, 253, 2], [253, 4467, 3], [4467, 4467, 4], [4467, 10201, 5], [10201, 10201, 6], [10201, 16010, 7], [16010, 16010, 8], [16010, 20801, 9], [20801, 20801, 10], [20801, 25689, 11], [25689, 25689, 12], [25689, 31590, 13], [31590, 31590, 14], [31590, 37517, 15]], "primary_language": ["en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]