[{"id": "325dfbd686e2fd86d1a654559090e28ff6e2f927", "text": "THE VIEWS\nOF A\nLEADING CONSERVATIVE\nIN THE NORTH-WEST\nON THE LATE REBELLION.\n\nAt a banquet given in honor of Mr. Jackson of Qu'Appelle, a member of the North-West Council in January, 1886, and [as he says in his speech] a follower of Sir John Macdonald for Twenty-five years, he gave utterance to the following severe denunciation of the policy of the Administration of Sir John Macdonald, in connection with the North-West.\n\n\"The Indian Commissioner (Mr. Reed) has taken every opportunity—and he took an opportunity in his recent speech at the Council Board—of twisting the people of Fort Qu'Appelle with encouraging the File Hill Indians to give the Government trouble, or to cause a disturbance to keep the soldiers here. (\"No, no,\" and \"It's false.\") You who knew the danger there was of an Indian uprising throughout the country; who knew the means that had to be used by men of influence to keep the Indians from rising, know how dastardly false such an assertion is. (Hear, hear, and cheers.) Nothing of the kind was ever done. He became very anxious about the File Hill Indians. What has he done with them because of their turbulence, because they showed a disposition, perhaps, to rise up and join the Indians of the North in fighting? He has reduced them at the present time to that state that, in the case of one Indian (I am prepared to prove this, and to give the name of the man, too), within two months seven of his children died because they had not the necessaries of life. (Cries of \"Shame!\") I tell you what I know to be a fact. The Indians on the File Hill reserve believe that if one of their number fall sick there is no use in trying to make him get well, they have not sufficient nourishing food and they must let him die. The man I speak of came down to the fort the other day absolutely in rags, with his two squaws, and said to a man in Fort Qu'Appelle (I do not mention his name now, but at the proper time, if necessary, I can produce this man):—\"What can I do for anything to eat? We are dying of starvation.\" He was told:—\"You had better go to Regina, and the Lieut.-Governor may be able to do something for you.\" (\"Oh Oh.\") The old squaw had an old piece of tea-chest wrapping, which you could\nthrow hailstones through, to serve as a blanket. These are the wards of the Government! The man was so thinly clad that he was\n\nFROZEN BELOW HIS KNEES,\n\nand yet he was going to Regina to try and move the heart of that man whose heart is stone—to move the heart of that man to give something to keep life in him (\"Shame.\") Is such the proper conduct of the man who has charge of the wards of the Government. Why, he deserves to be booed and hissed, and driven out of the country. (Loud cheers.) I charge further, that the Commissioner had a knowledge of the Indian uprising, that he knew the Indians of the north were discontented. In August last, when Big Bear had a pow-wow at Duck Lake, he said he would make the people of Canada suffer through the settlers of this country, and make the settlers suffer through their children. What did that mean? That they would commence a war of extermination; that they would strike at the white people through the children and make them feel the power of the Indian. And why? Because\n\nTHE TREATY OBLIGATIONS HAD NOT BEEN CARRIED OUT.\n\nI charge that Hayter Reed knew about this at that time or soon after; he knew that that statement was made, and that can be proved on oath. Notwithstanding the Indian Commissioner comes down and reads a number of letters from Mr. Quinn, Mr. Gowanlock, and others, I can prove to you by letters that were sent down on August 8th, when Mr. Reed came; on the 12th when he held a meeting; on the 14th when Poundmaker and some of the other Indians were present; on the 21st and 25th, September, 3, 5, 7, 24, 25 October, 6, 9, 17, 25, 27, 30 November, December, January, February, March. In the month of December, Supt. Gagnon, Major Crozier, Sergeant Keenan, Inspector Deacon, and other members of the N.W.M.P. continually warned the Government of an uprising; still the Indian Commissioner comes down and says—\"Everything is quiet, there is no danger.\" I say, that if the Indian agents were not in a position then to tell what was\n\nTHE STATE OF THE INDIAN MIND\n\nat that time, then they were unfit for the position they held; and a stronger argument that the Chief of the Department was not fitted for his post, I do not want than that he allowed his Indian agents to persuade him that everything was peaceable and quiet while the whole thing was a seething volcano, ready to burst forth at any moment, and Mr. Dewdney was the only innocent man in the country. That shows that things in the Indian Department are rotten to the core, and should be weeded out. (Hear, hear.) Had he exercised his proper functions and done what was expected of him, the Government would have been induced, because of the gravity of the situation, to deal with the matter, and thus have averted this great rebellion. He failed to do that, and if the Government care anything\nat all for the feelings of the people of this country they will sweep away that which is\n\nROTTEN AND DESPICABLE\n\nand place an honest man, who will fulfil his duties, in the position of Lieut.-Governor. (Cheers.) I have shown you that he had neglected his duties and prostituted his position as Indian Commissioner; that he has allowed people to starve to death. I can show you, that he said at Qu'Appelle Station that the Indians of the north might give trouble, but that he felt sure the Indians of Treaty No. 4 would give no trouble to the Government. If that is the fact, and if he allowed men, women, and children to go to their death without a warning, that man was accessory before the fact. (Loud cheers.) Gentlemen, these are all facts. At the session of Parliament, I think 1882-3 or 1883-4, when Sir John Macdonald\n\nWHOM I HAVE FOLLOWED FOR TWENTY-FIVE YEARS,\n\nand who has always found me an active supporter, got up in his place as Premier of the Dominion, and said that Mr. Dewdney was one of the best appointments he ever made, I confess it completely knocked the wind out of me. (Laughter.) The man that I pinned my faith to, whom I fought for, who I felt was doing the best for the interests of this country, who had done the best to achieve Confederation, constructed the C. P. R., who gave the people of Canada a fiscal policy that has done so much to place her in the proud position she occupies today, the man with whom I was in active political sympathy—for that man to say that the present Lieut.-Governor of the N. W. T. was\n\nTHE BEST APPOINTMENT HE EVER MADE\n\nin the whole course of his political life, makes me feel that I don't know when to have faith in a public man. I know that in Canada, from one end of the country to the other, the public press is ringing with condemnation of the man, and has been for the last four years. To say it is confined to Fort Qu'Appelle is not true. At Calgary, Moose Mountain, McLeod, Cypress Hills, Edmonton, and Prince Albert he is detested. A white man never believes in him. The Indian thinks of him as a man who does not tell the truth today, but might tomorrow; but that tomorrow never comes. (Laughter.) He is a man who has\n\nMISREPRESENTED THE HALF-BREEDS ON EVERY OCCASION;\n\nand the other day, when he twittered me with being a Half-breed representative, I enjoyed the compliment; but when he stated that he always received loyal manifestations from them, I should say that he is satisfied with very little exhibition of loyalty. (Laughter.) I never heard that man's name mentioned by a Half-breed unless accompanied by a curse. They know the man who has trampled on them, driving their brothers in blood to the death—I mean the Indians, and I fear.\nHave you any idea at all; have you ever sat down to think what that man has cost the country? In hard cash I think it will cost the Dominion of Canada not short of between $8,000,000 or $9,000,000. This is from the best information obtainable. In addition to the $8,000,000 or $9,000,000 it will cost the Government, he has raised a bitter feeling that will not be eradicated for generations; he has taught the Indians to fight against the Government; he has prostituted both position and power. The Winnipeg Times, speaking of Mr. Dewdney, once said: \"For the first time in the history of the British nation the representative of the Queen is known to the savage as a liar.\" I say that in addition to the cost he has incurred, he has cast a reproach and an odium upon public officials for whom we should have respect. Throughout the Territories, where he should receive the respect due to a representative of Her Majesty the Queen, he is held in the supreme contempt, and in some places where he goes he is met with almost open insult. Should there be anything more in the way of emolument coming to Mr. Dewdney, for the sake of the future peace and prosperity of the country let them give it to him out of the public chest, and rid the North-West Territories of him. (Loud and prolonged cheers.)\n\nThat speech was delivered by a gentleman residing in the territory, having a personal acquaintance with the facts; and uttered with all the responsibility attached to the representative position which he occupied as a member of the North-West Council. In the face of the bold charges formulated and proved by Mr. Jackson, how can the Dominion Government claim, with any regard for decency, that their \"cruel and calous neglect\" had not tended towards dissatisfaction and rebellion in the North-West Territories?", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001468.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 2382, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2226, 1], [2226, 5050, 2], [5050, 7768, 3], [7768, 9578, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]