[{"id": "12f1d574ac73d7539ee4179b42452902dd7d2247", "text": "DISCOURS\n\nSUR LA\n\nQUESTION RIEL,\n\nPRONONCÉ\n\nLE 22 MARS 1886, A LA CHAMBRE DES COMMUNES\n\nPAR\n\nL'HONORABLE S. D. THOMPSON,\nMINISTRE DE LA JUSTICE, OTTAWA.\n\nM. THOMPSON (Antigonish): Bien qu'il ait déjà été dit beaucoup dans le cours de ce débat, comme l'honorable député de Durham-Ouest (M. Blake) insinuait, vendredi soir, que le temps était venu où la Chambre devait entendre l'officier de la justice du gouvernement, et que je devais me lever, si toutefois j'avais l'intention de le faire, il convient que j'accepte la proposition de l'honorable député, et que je fasse à cette phase du débat, quelque tard que cela puisse paraître, et quelque fastidieux qu'ait déjà été le débat, il convient, dis-je, que je fasse un exposé des faits se rattachant directement à la part prise par mon département dans cette affaire. Je suis peiné, M. l'Orateur, surtout vu que je suis comparativement étranger dans cette Chambre, que mon premier devoir dans cette occasion, soit d'exprimer mon regret sur la manière dont cette discussion a été conduite, et sur la manière dont elle a été amenée devant la Chambre.\n\nQuelques députés: Ecoutez, écoutez.\n\nM. THOMPSON (Antigonish): On a dit, M. l'Orateur, et les applaudissements venant des honorables membres de la gauche comportent, je suppose, une affirmation de la déclaration que le gouvernement a choisi le mode et le temps convenable pour discuter cette question, et, comme l'a dit l'honorable député, le gouvernement a limité l'acte d'accusation. Même si cela était vrai—mais ce ne l'est pas, M. l'Orateur—je demanderai aux honorables députés qui viennent de manifester leur approbation, comment ils échapperont à la responsabilité qui doit peser sur eux pour la manière dont ils ont conduit cette discussion jusqu'à présent? M. l'Orateur, on a répété plusieurs fois dans le cours du débat, et cela a été généreusement admis, l'autre jour, par l'honorable député de Brockville, (M. Wood) comme argument seulement, je suppose, mais combattu fortement par l'opposition, on\ndit que le droit de discuter cette question à chaque pas, à chaque phase, appartenait au parlement précisément comme si le parlement siégeait en cour d'appel.\n\nM. MILLS : Ecoutez, écoutez.\n\nM. THOMPSON (Antigonish) : Je demanderais à l'honorable député qui a dit \"Ecoutez, écoutez,\" à ceux qui l'ont imité, et à tous ceux qui ont pris part à la discussion ou y attachent quelque intérêt, de signaler un précédent qui justifie l'opposition. J'aimerais qu'ils pussent signaler un seul cas dans tout parlement de l'Empire britannique où un homme portant la responsabilité de membre du parlement, dirait \"Ecoutez, écouter,\" à une proposition telle que celle-là. Non seulement on a soutenu que le parlement devait être une cour d'appel devant laquelle la preuve entière devait être faite et scrupuleusement examinée par les avocats de chaque côté de la Chambre, mais nous avons eu chaque jour des discours pour la défense. Nous n'avons pas seulement eu une discussion comme cela aurait eu lieu dans une cour d'appel, mais des orateurs ont parlé avec des dossiers scrupuleusement préparés, des analyses de la preuve, et des autorités, et la Chambre doit donner son opinion et sa décision. Je n'ai qu'à exposer le cas tel qu'il est pour amener la Chambre à la conclusion que ce n'est pas un tribunal convenable, que le caractère spécial d'une législature composée de deux partis activement hostiles n'est pas un endroit où peut être discutée convenablement l'administration de la justice dans tout cas particulier. On ne nous a pas seulement soutenu que le parlement était une cour d'appel pour juger une question comme celle-ci, mais que si le parlement en venait à une fausse conclusion, le peuple déciderait au bureau de votation.\n\nSi nous avons réchauffé ici des controverses et des sentiments de parti qui empêchent la Chambre d'arriver à une conclusion judiciaire telle que dans une cour d'appel, j'aimerais à demander aux honorables membres de la gauche ce qui arrivera aux bureaux de votation ? Est-ce que l'esprit de parti, pour la première fois dans l'histoire du pays, sera alors mis de côté ? Est-ce que le peuple au bureau de votation fera un examen calme et sérieux du mérite de la cause en particulier, du sort d'un condamné ; et dans ce cas, les honorables messieurs de la gauche s'imaginent-ils que lorsque la cause sera soumises à la considération, des électeurs, il n'existera pas à notre avantage des passions, des sentiments de parti sur d'autres grandes questions, la politique nationale, le chemin de fer du Pacifique Canadien et toutes les questions qui ont divisé les partis depuis dix ans ? Je n'ai pas besoin de meilleure confirmation de la protestation contre une telle discussion sur une motion de ce genre devant le parlement, que la tentative faite par les honorables membres de la gauche pour nous empêcher de délibérer froidement sur cette question. Le député de Durham-Ouest, lui-même, en commençant son discours, vendredi, condamna tout ce qui ressemble à du sentiment. Il déplore l'introduction dans la discussion de questions et considérations politiques passées, et le son de sa voix s'était à peine éteint dans l'expression de ses sentiments lorsqu'il déclara d'un ton qui fut entendu d'un bout à l'autre de la Chambre, qu'il avait l'intention de tenir le gouvernement responsable de chaque vie perdue, de chaque peine soufferte, et de chaque dollar dépensé.\n\nM. BLAKE—Ecoutez ! Ecoutez !\n\nM. THOMPSON (Antigonish) : J'aimerais que l'honorable député pût dire comment, après une telle assertion, comment, après la déclaration de l'honorable député derrière lui, qui proclama trois fois dans le cours de cette discussion, que les ministres sur les bancs du trésor de cette Chambre\nétaient plus criminels que l'homme qui est mort sur l'échafaud de Régina, j'aimerais, dis-je, à lui demander comment, après de telles expressions lancées dans ce débat, il s'attend que la Chambre arrivera à une conclusion dans le sens qu'une cour d'appel déciderait dans tout cas particulier.\n\nNon seulement on a fait cette tentative pour nuire à la discussion, mais les honorables députés se sont plaints amèrement du procédé employé pour empêcher l'introduction de toute autre question pouvant embarrasser le jugement de la Chambre. L'honorable député de Durham-Ouest (M. Blake) parlant l'autre jour sur une résolution interlocutoire, déclara qu'il était contraire à la saine politique de proposer la question préalable. Si cette question doit venir devant le parlement comme devant une cour d'appel, d'après quel principe serait-il permis aux honorables députés d'introduire d'autres questions ? L'honorable député eut la bonté d'avouer, avant la fin de son discours sur cette motion, qu'il n'espérait pas, même dans le cas où des amendements auraient été proposés, les faire adopter, parce que, dit-il, nous devons à tout événement en venir à cette résolution. Alors il aurait simplement eu l'avantage de voir la Chambre arriver à une décision sur cette question avec un jugement aveuglé et des préjugés de parti, soulevés par la discussion de questions sur lesquelles l'opposition cherche à renouveler contre le gouvernement les accusations lancées dans cette Chambre pendant cette discussion au sujet d'autres transactions.\n\nJ'ai dit, M. l'Orateur, que je sentais de mon premier devoir d'exprimer cette opinion en Chambre, et je suis heureux de savoir que quelques honorables députés de la gauche pensent comme moi. L'honorable député qui a fait en Chambre, vendredi soir, un discours si long et si élaboré a rempli les fonctions que j'ai l'honneur de remplir aujourd'hui. Il connaît les grandes difficultés qui incombent au ministre de la justice en conseillant la clémence de la couronne. Et il y a à peine trois mois l'honorable député disait dans une grande assemblée :\n\nJe sais combien ces difficultés sont aggravées par la discussion populaire et animée de l'esprit de parti, dans laquelle des vues fausses et des appréciations imparfaites des faits sont censées prévaloir.\n\nAprès cette franche admission je supposerais que si cette question devait être soulevée en Chambre, comme elle l'a été par l'autre côté de la Chambre, comme une question de confiance, nous n'aurions pas eu, au moins, ces appels populaires et de parti fait dans le but d'empêcher que la Chambre se prononçât sur la vraie question qui est devant elle. Laissez-moi pour un instant attirer l'attention de la Chambre sur la manière dont ces questions sont considérées, dans le pays où ce parlement passe pour un modèle. Je ne veux pas discuter le droit d'un honorable député, encore moins de la Chambre, de blâmer la conduite du ministre de la justice dans le moment quant au moyen qu'il aurait dû conseiller à la couronne sur le cas d'un condamné ; mais je recuse la propriété d'exercer ce droit de la manière dont il l'a été dans ce cas-ci. Le 20 juillet 1877, M. Gathorne Hardy, qui remplissait la charge de secrétaire de l'intérieur, disait :\n\nIl espérait que le temps ne viendrait pas où la Chambre refuserait de se reposer sur l'Exécutif, soit pour l'exercice de la prérogative de la clémence, ou pour l'exécution de la loi dans toute son étendue.\n\nIl disait aussi :\n\nJe suppose que les dossiers soient produits, la Chambre irait-elle refuser le procès en s'appuyant sur ces dossiers, sans voir les témoins ? Ce serait là un procédé extraordinaire, auquel on ne doit avoir recours que dans les cas de doute de corruption ou de partialité.\n\nM. Gladstone dans le cours du même débat, disait :\n\nIl me semble si désirable qu'en matière de ce genre la prérogative de la clémence soit laissée entre les mains de la Couronne pour être exercée sur le conseil donné par qui de droit\nque je ne voudrais, que dans les cas extrêmes, appuyer une motion qui ferait intervenir le jugement de la Chambre dans le but de critiquer le jugement de la Couronne.\n\nEt M. Gladstone s'abstint de voter sur la question qui était alors devant la Chambre. Dans une autre occasion, en 1870, dans le cours d'un débat, dont une partie a été lue à la Chambre par l'honorable député de Durham-Ouest (M. Blake), M. R. N. Fowler disait :\n\nDe telles causes doivent être laissées entièrement entre les mains des honorables membres de l'autre côté de la Chambre. La Chambre, sur des questions de cette nature, est l'endroit le plus mal choisi pour considérer convenablement la culpabilité comparative d'un membre, car c'est une assemblée législative et non un corps exécutif.\n\nLe 3 juillet 1874, M. Trevellyn disait :\nJe regrette beaucoup que l'on soit arrivé à cette décision.\n\nLa décision de l'Exécutif de ne pas commuer la sentence.\n\nJe regrette beaucoup que l'on soit arrivé à cette décision, mais nous avons cru que cela était notre devoir, et je ne considère pas que la Chambre soit le lieu convenable où l'on puisse refaire les procès.\n\nSir William, dont on a parlé l'autre jour comme d'un grand homme d'État, disait :\n\nC'est une chose très sérieuse de considérer de nouveau en matière de ce genre, la décision d'un tribunal. Bien que je ne veuille pas un instant nier aux membres du parlement le droit d'amener devant la Chambre des questions de ce genre, cependant je dis qu'il est très difficile, et presque impossible pour cette Chambre, sur des documents \"ex parte,\" ou même sur une argumentation de la cause, d'arriver à une décision convenable. Nous ne pouvons régler des questions de ce genre par un débat dans une assemblée populaire, même si ce débat était soigneusement conduit et avec sang-froid.\n\nM. Trevellyn dit encore :\nLa discussion a prouvé combien il est peu convenable de juger de nouveau une telle cause dans la Chambre des communes, car l'honorable député qui vient de parler a réellement jugé la cause de nouveau—\n\nJe puis appuyer sur ces paroles, en faisant allusion au discours que nous avons entendu vendredi dernier :\n\n—non sur une nouvelle preuve produite par lui, mais sur un argument en rapport avec une cause jugée dans Manchester il y a quelques années, et dans laquelle on prouve qu'il y avait un cas d'identité erronée........Je crois que l'on devrait admettre en autant que possible le principe que la question d'exercer la clémence de la couronne ne devra pas devenir une matière de discussion dans cette Chambre.\n\nS'il doit en être ainsi, si une discussion politique doit suivre l'action de l'Exécutif, chaque fois que la clémence sera accordée ou refusée, on peut facilement comprendre quelle confusion nous faisons entrer dans l'administration de la justice criminelle dans ce pays. Le plus grand criminel condamné par les tribunaux conservera l'espérance de voir jeter sa cause sur l'arène politique, et pour citer le langage de Riel à Batoche, \"la politique me sauvera.\" Il signalera le fait que, il y a quinze ans, un parti politique de ce pays fit un effort désespéré pour arriver au pouvoir en faisant appel aux passions publiques au sujet d'une grande tragédie qui était arrivée, et que n'ayant pas réussi dans son entreprise, quinze ans après il crut pouvoir monter au pouvoir par les sentiments soulevés par une autre tragédie—d'abord cherchant fortune sur le sort de la victime, et ensuite sur le sort du meurtrier. Il résulterait, M. l'Orateur, que l'Exécutif, surtout s'il était faiblement appuyé par cette Chambre et le pays, devrait s'efforcer de faire, non seulement ce qui est juste, non seulement ce qui est l'accomplissement de la loi, mais ce qui est le plus populaire dans le pays, en vue du fait que la cause peut être recommencée dans la Chambre des communes comme cour d'appel, et qu'elle peut être jugée ensuite au Bureau de votation.\n\nPlus que cela, ou nous a déjà indiqué un résultat plus sérieux encore. Ce n'est pas seulement que l'administration de la justice serait mise en\ndiscrédit, non seulement que sa juste exécution deviendrait douteuse, mais que, si l'Exécutif tentait de faire exécuter la loi, alors non seulement par rapport à l'Exécutif lui-même, mais au peuple qui appuie sa politique et à tous ceux qui croyaient voir dans son action l'accomplissement d'un devoir et l'exécution de la loi, il s'éleverait un cri de vengeance, comme l'a dit mon honorable ami de Kent (M. Landry). Alors non seulement l'administration de la justice sera dégradée, mais, comme au mois de novembre dernier, on verrait les cris de la guerre civile se répéter dans nos rues, après s'être éteints sur les rives de la Saskatchewan.\n\nÀ cette phase du débat nous avions entendu crier après les documents. Je ne me propose pas d'examiner ce qui s'est passé dans la Chambre à la dernière session, bien que j'aie eu entier accès aux procès verbaux ; mais j'ai remarqué cette année que plus on produit de documents plus on en demande. On a d'abord crié que le dossier n'était pas complet. Nous avons livré à la publicité et nous avons déposé sur le bureau de la Chambre tout ce qui constitue, techniquement, le dossier dans les causes criminelles—tout ce qu'on soumettrait à une cour d'appel—tout ce qu'on devrait demander ici si ce parlement doit être considéré comme une cour d'appel. Il y avait même davantage dans le livre bleu que nous avons fait imprimer et livrer à la circulation ; mais à peine nous étions-nous réunis qu'on nous a dit qu'il nous fallait tous les arguments invoqués dans la controverse au sujet de la remise de la cause, bien que tout cela se réduisit à une entente entre les avocats en vertu de laquelle toute l'affaire a été enlevée à la considération du tribunal.\n\nCes papiers ont été produits, et l'on a crié encore avec plus d'insistance pour obtenir d'autres documents. On nous a dit qu'il y avait eu des plaidoiries contradictoires lors du procès, sur la question de savoir s'il serait permis à Louis Riel de se défendre lui-même tout en étant défendu par ses avocats—\"produisez cela.\" Nous l'avons produit et les clamours sont devenues encore plus fortes pour en avoir davantage encore.\n\n\"Nous n'avons pas eu l'adresse du juge ici,\" a-t-on dit, et l'un des honorables membres de cette Chambre a prétendu que nous n'étions pas même en état de dire ici que l'adresse du juge avait été soumise à la cour d'appel du Manitoba, bien que le livre bleu qu'il tenait à la main contienne la décision de ce tribunal, où l'un des juges a dit qu'il était heureux de pouvoir déclarer qu'il avait lu toute l'adresse et que chaque mot avait son approbation. Eh bien, nous avons produit l'adresse du juge et la clamour est devenue encore plus forte. L'un disait que tous les papiers demandés n'avaient pas été déposés, un autre se plaignait de ce que nous eussions produit plus de documents qu'il n'en avait été demandé, simplement pour la raison que ceux qui ont été produits ne satisfaisaient pas ces messieurs aussi complètement qu'ils l'auraient désiré. Qu'il me soit permis d'appeler l'attention de la Chambre encore une fois sur la pratique qui prévaut sur cette question dans le parlement anglais. Je crois pouvoir dire que j'ai examiné tous les cas qui se sont produits dans ce parlement depuis vingt-cinq ans, et il m'a été impossible de trouver un seul cas où les papiers se rapportant à une cause criminelle aient été soumis au parlement.\n\nLa question s'est quelquefois soulevée sur la motion demandant la formation de la Chambre en comité des subsides, quelquefois au sujet d'une question à laquelle le secrétaire d'État pour l'intérieur doit répondre, mais jamais sur une motion de non confiance, jamais lorsqu'on a demandé la production de documents. Mais, si je n'ai pu trouver un dossier qui ait été soumis au parlement, dans une circonstance analogue, j'ai pu\nconstater que la chose avait été refusée, car le 17 mai 1878, dans la discussion qui s'est faite au sujet du procès de Georges Bromfield, les rapports concernant la folie de l'accusé ont été demandés, et M. Assheton Cross, le secrétaire d'État pour l'intérieur, a dit que \"toutes les communications faites au secrétaire d'État dans l'affaire étaient d'une nature confidentielle et que conséquemment il ne pouvait consentir à les produire.\" Je crois qu'aussitôt que les papiers qu'il reste à soumettre auront été déposés sur le bureau de la Chambre, le besoin qu'ont les honorables députés d'avoir des documents deviendra encore plus pressant que jamais. Ils n'aimeront pas plus les documents qu'il y a à produire que ceux qui ont déjà été déposés, et quand ils les auront tous vus, l'honorable député de Durham-Ouest (M. Blake), dira : \"Ce ne sont pas là du tout des documents,\" et il demandera les papiers qui sont restés pliés dans nos bureaux. Comme exemple du caractère déraisonnable des quelques unes des demandes qui nous ont été faites, laissez-moi appeler l'attention de la Chambre sur un seul cas. Le 17 mars, un député a proposé :\n\nQu'une adresse soit présentée à Son Excellence le gouverneur général demandant un rapport complet du procès de Thomas Scott, accusé de simple trahison à Régina ; donnant la preuve faite par la couronne et par la défense ainsi que les plaidoiries des avocats et adresse du magistrat stipendiaire. Le rapport du procès et la sentence des prisonniers métis qui ont subi leurs procès à Régina pour trahison, avec la preuve faite devant la cour du magistrat stipendiaire en vue d'obtenir l'adoucissement de la sentence, et les plaidoiries des avocats des accusés.\n\nCes papiers se rattachant aux procès qui ont eu lieu par la suite, n'avaient guère de rapport avec la cour ; mais ce que je veux établir en ce moment, c'est que lorsqu'on a demandé une adresse à cette Chambre, le 17 mars, pour avoir ces papiers, ils étaient déjà sur le bureau depuis 48 heures. Nous n'avons peut-être pas l'avantage de ce côté-ci, d'entendre tout ce qui se passe dans la Chambre, mais on peut imaginer, par cet exemple et par quelques faits venus à notre connaissance, combien est juste cette remarque d'un spectateur au sujet de cette demande de documents :\n\nM. — m'a bien amusé aujourd'hui, il était à tancer le gouvernement pour m'avoir pas produit les documents. \"Où est le journal de Louis Riel ?\" Crain-il, et se penchant vers Laurier. \"Est-ce que cela est produit ?\" \"Non,\" souffla Laurier. Alors M. — est devenu furieux parce que ce document n'était pas produit.\n\nJe pense qu'à une période moins avancée du débat le député de Bellechasse (M. Amyot) a vu la difficulté dans laquelle la Chambre se trouvait en examinant une question de ce genre, et en agissant d'après la doctrine que cette Chambre devait être une cour d'appel ; car l'honorable député a déclaré, presque en propre terme, que lui et ses amis étaient justifiables de traiter cette affaire comme un cas exceptionnel, vu que la chose venait des territoires du Nord-Ouest ; et l'honorable député a lu à la Chambre une disposition de la loi prescrivant que le rapport d'un procès criminel fait dans les territoires du Nord-Ouest doit être soumis à l'Exécution.\n\nM. MILLS : Attention, attention !\n\nM. THOMPSON (Antigonish) : Je vais lire—vu surtout qu'un membre de ma profession siégeant à la gauche dit \"attention, attention\"—deux paragraphes de la loi—celui portant sur les procès instruits dans les territoires du Nord-Ouest et celui portant sur les causes instruites dans les diverses provinces, et je demanderai où est la différence. La loi générale, formulée dans l'acte de 1873, s'appliquant à toutes les provinces du Dominion, prescrit :\n\nLe juge devant qui tel accusé aura été trouvé coupable fera un rapport de la cause, devant être transmis au secrétaire d'État du Canada, pour l'information du gouverneur, et\nQuand une personne est trouvée morte, le magistrat stipendia\n\nLa mort est un fait naturel qui ne peut être évité. Le corps de la victime doit être examiné par un médecin pour déterminer la cause de la mort. Si la mort est due à une maladie ou à une blessure, le médecin doit établir un rapport officiel. Si la mort est suspectée d'être due à une cause criminelle, le médecin doit faire appel à la police.\n\nLe médecin doit également examiner les vêtements et les objets de la victime pour identifier tout indice qui pourrait aider à résoudre l'enquête. Si des preuves sont trouvées, elles doivent être conservées en sécurité.\n\nEnfin, le médecin doit informer le procureur de la mort et de toutes les informations recueillies pendant l'examen. Le procureur doit alors décider si une enquête officielle doit être ouverte ou si la mort doit être classée comme accident ou suicide.\n\nSi une enquête officielle est ouverte, elle doit être menée par une équipe de policiers et de procureurs. Ils devront interroger les témoins, examiner les lieux de la mort et collecter toutes les preuves possibles. Si une cause criminelle est suspectée, les policiers devront également interroger les suspects et chercher des indices supplémentaires.\n\nLa mort est un sujet sensible et il est important de traiter ces situations avec respect et professionnalisme. Les médecins, les policiers et les procureurs doivent travailler ensemble pour assurer que justice soit faite.\ndu conseil du Nord-Ouest. Je jure sur la constitution que ce projet, si convenable que cela fasse, ne sera pas adopté tant que nous ne serons pas les honneurs de la France. Je ne peux pas faire une promesse que je ne peux pas tenir.\n\nLe général de Gaulle se leva et alla vers la fenêtre. Il regarda le ciel et murmura une plainte.\n\nIl retourna à sa place et continua sa réunion.\n\nLa discussion fut longue et intense. Les juges se disputèrent sur les points de détail. Le général de Gaulle resta silencieux, observant attentivement les débats.\n\nEn fin de compte, le projet fut adopté. Le général de Gaulle se leva et quitta la salle de réunion.\nM. Vanlangenhuys et M. Burgess de comparaître devant le tribunal, et nous avons l'assurance que tout avocat ayant le nom de l'honorable député de Durham (Gouverneur Blake), qui a dit qu'une éventuelle preuve était inadmissible dans le procès.\n\nC'est pour cette raison seulement que le recours de la couronne refuse d'approuver à M. Vanlangenhuys et à M. Burgess de faire preuve, et nous avons une de l'honorable député de Durham (Gouverneur Blake) qui a déclaré qu'il ne pouvait être question de faire preuve de façon inadmissible dans le procès avec un homme de profession en arabe selon la loi à cette chambre. Je démontre que l'exception des deux hommes les démontrent qu'ils trouvent assez pour trouver une chose qui n'était pas une preuve à l'exception des trois témoins pour lesquels ils demandent une audience ou non pas les tribunaux. Alors si la couronne veut encore faire une telle chose, elle devrait être en mesure de faire une telle chose. Nous avons maintenant voir comment affirmer de nouveau une telle chose. Nous devons être à l'abri de tout ce qui est ou n'est pas possible.\n\nLe Dr Fitzpatrick au juge\n\nIl est clair que le juge a été obligé de faire une déclaration des pouvoirs très limités. Déposez-vous sur le fait que le juge a été obligé de faire une déclaration des pouvoirs très limités.\n\nL'avocat de la défense étant arrivé à une entente avec l'avocat de la Couronne, envoie au tribunal et nous de faire cette question. Je vais maintenant faire tourner à la chambre et je vais faire cela même après quelques semaines car la situation est très grave et après avoir fait un arrangement de ne pas remettre immédiatement et complètement. Le 21 juillet 1893, le ministère de la Justice de l'Ontario a envoyé un télégramme au Dr Clark et Horwood.\n\nOn a besoin de vous ici, mercredi, comme membre de la défense au procès de Riel. Les dépenses seront payées par la Couronne.\n\nM. Lemieux et M. Thibodeau ont reçu le télégramme envoyé au Dr Roy.\n\nLe Dr Roy répondit le 22 juillet\n\nLe Dr Roy a répondu à votre télégramme. Le Dr Clark est également intéressé de faire de l'argent de cette manière et nous avons demandé. Dites-le à Lemieux et Thibodeau.\n\nLa réponse suivante fut envoyée\n\nLe télégramme a été envoyé à votre domicile mais ne peut pas être lu. Car il est impossible de lire le télégramme sans l'aide de la police.\n\nLe même jour, le Dr Howard télégraphia à sir John A. Macdonald pour dire que le télégramme est daté du 21 juillet et que le juge partira immédiatement. Mais le Dr Howard fut plus tard, le 21 août, comme le député de Montréal-Centre M. Laurier, et trouve incapable de faire rendre le voyage vers le sud-ouest un honneur de\nLa député de Durham-Chambly, M. Michel dit qu'il regrette que la Commission ait refusé de louer le bâtiment.\n\nL'honorable député est sans doute l'explication que je suis sur le point de donner. Il est évident que nous devons faire quelque chose pour aider le gouvernement quand même ce qui a été fait est réaliste. Bien que M. Le Howard refuse de céder à Mégan et à moins qu'un projet fasse l'objet de la justice en cas de refus de payer est honnête, même si c'est au trésor de la défense pour le désavantage de mon prédécesseur.\n\nM. Le Howard refuse de participer à une discussion sur ce sujet. Le sénateur est un homme de confiance et il doit être respecté.\n\nLe texte suivant fut envoyé à Ottawa pour mettre fin au règne de M. Howard. La commission fut composée du commandement de tous les étrangers et du personnel d'importance.\n\nLe ministre de la Justice a été appelé à agir selon les instructions données. Le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\n\nLa commission a été formée de manière à être officielle et le ministre a été chargé de faire des observations sur cette affaire et de donner une réponse appropriée.\nPourquoi est-ce nécessaire de donner des conseils à l'État, et la question de la\nprotection de la vie humaine ne devrait-elle pas être résolue par les mêmes\nméthodes que celles qui ont été utilisées pour protéger d'autres aspects de la vie\nhumaine ? La protection de la vie humaine doit être une priorité absolue, et cela\nimplique que nous devons agir immédiatement pour mettre fin à cette tragédie.\n\nLa situation actuelle est extrêmement préoccupante, et il est temps que nous\nagissions ensemble pour trouver des solutions durables. Nous devons faire preuve\nde solidarité et de compassion envers tous ceux qui sont touchés par cette\ntragédie. Il est important que nous travaillions ensemble pour trouver des\nsolutions qui protègent non seulement la vie humaine, mais aussi la santé et le\nbien-être de toutes les personnes concernées.\n\nEn conclusion, la protection de la vie humaine doit être une priorité absolue,\net nous devons agir immédiatement pour mettre fin à cette tragédie. Il est temps\nque nous travaillions ensemble pour trouver des solutions durables qui protègent\nnon seulement la vie humaine, mais aussi la santé et le bien-être de toutes les\npersonnes concernées.\nVoilà, homme dont on nous a dit qu'il devait être considéré comme un loyal sujet parce qu'il avait eu l'occasion de boire un verre de liqueur à la table de la reine. Voilà l'homme qui — si je bien comprends ce que dit l'homme — est le député de Québec Est M. Laurier, autrefois le plus grand représentant de la population de Saskatoon ceux qui vont voter.\n\nD'où vient-il qu'il est venu dans le pays en s'adjoignant sur sa position, avec l'idée qu'il serait encore traité comme un accusé pourtant, dans l'espoir qu'il profiterait encore de la clémence de la couronne, que quinze ans auparavant, après l'outrage aux pieds et outrage à la force qui appuie le gouvernement de Sa Majesté et qui représente la loi du pays et les droits des colons devait être complètement bafouée.\n\nLe récit de cette affaire est une leçon de moralité pour tous ceux qui ont été impliqués.\n\nLa situation est extrêmement préoccupante et il est temps de faire quelque chose pour mettre fin à cette situation.\n\nL'agitation constitutionnelle, ainsi que ces mesures, des pétitions, des demandes de membres, la fondation d'un journal, de tout ce qui peut aider à résoudre cette situation.\n\nTous ceux qui ont été impliqués devraient être mis au pas.\n\nChaque jour, un journal se répand.\n\nQu'est-ce que cela signifie pour vous, à votre adresse ? Il faut, il faut, par-dessus tout, que chacun de nous se souvienne de la promesse faite au peuple.\n\nPour voir le passage dans lequel il est dit que le témoignage était si peu de sang dans les veines qu'ils pouvaient le mettre dans une cuillère.\n\nLe dernier mot, le dernier mot de l'histoire de l'homme est l'offensive de sang qui a permis de mettre en place une Constitution une structure qui est là.\n\nMais comment quelles ont été les sommations qu'il envoyait à Port-Cartier ?\n\nVoici l'affirmation :\nM. J W Asiley dit :\n\nM. Thompson dit :\n\nIl ne fait pas de doute que le peuple de cette terre, le ne serait pas de manque le peuple du monde en général attiré à une telle tempête de l'Europe, doit se réjouir ou pour être à l'abri.\n\nVoici l'histoire de la grande époque qui a été dans le temps où nous avons pu être présents de manière à faire le mieux de nos efforts pour démontrer la nature et les forces de nos esprits. La préfecture catholique défend sur le cœur de nos âmes et nous une proclamation de nos bonnes et saintes pratiques l'harmonie de ces gens en disant : \"La préfecture est en paix tout.\"\n\nAprès une mention à la presse que les membres de la gauche sont le plus nombreux tous à être allés dans la province, à la province de la France, et à la province de l'Allemagne (1873), elle pourra être de la cause des hommes à être à proprement parler parmi nous et qu'il était nécessaire d'agir ainsi, et à commencer par le fait que...\nsentence est-elle prononcée ?\nLe Père Fourment dit de plus\n\nLe Père André est dans une situation, partant d'Emmanuel Champagne\nQuant à Baptiste Vandal, il dit :\nIl a reçu une lettre de sa femme à Riel, en quoi elle a fait que nous l'aidions de la manière qu'il le demande.\n\nQuant à Joseph Dufresne, il dit :\nCe n'est pas par la force et les menaces qu'on l'a obligé à participer à la rébellion.\n\nQuant à Alexandre Létourneau, il dit :\nJ'ai été amené et entraîné à sa suite.\n\nQuant à Joseph Pilote, il dit :\nJ'ai été ordonné de venir au camp et les autres qui y sont entrés ont été amenés par des amis ou par le professeur Piérola qui était là pour nous donner de l'aide. Rien ne pouvait être fait sans nos instructions.\n\nLe père André parle ainsi du cas des frères Teuroid :\n\nL'abbé Thibault, après de nombreuses tentatives, a réussi à convaincre le juge de faire appel, mais ce dernier a refusé. Il a été arrêté et emprisonné, mais il a été libéré après quelques semaines.\n\nParlant des procédures en général, il dit :\nIl est impossible de faire une déclaration de cette nature sans être entendu par le juge et être examiné sur le fond de la situation. Si une telle déclaration est faite, elle doit être examinée par le juge et être examinée sur le fond de la situation.\n\nVoici les déclarations de personnes, qui, comme je le dis, n'ont pas été entendues :\n\nLe docteur Lebel, quant à lui, a été entendu et a été libéré après quelques semaines.\n\nA ma honneur l'Orateur quitte le fauteuil.\n\nÉtats du soir\n\nM. THOMPSON (Anagnorisis) : J'ai encore quelques observations à faire quant à la profondeur de la criminalité que révèlent la preuve et les documents soumis au gouvernement. Je devais, en fait, être le témoin de mes arguments avant une décision de votre majesté qui a été rendue. Je veux parler des arguments qui ont été déposés à propos de la loi que Riel a été un réfugié. On a dit, c'est la première offense à être considérée lorsque l'on est agi de commettre une infraction contre la loi à cause de deux raisons, il a été établi pour la première offense de croire que toute personne qui a fait des choses légales s'interdit, après un moment de réflexion que cette manière d'apprécier les conséquences d'une première condamnation n'est pas juste au point de vue légal. Quant à ceux qui n'ont pas eu l'avantage de faire des études légales, je crois, M. l'Orateur, qu'ils admettront, après une quelques explications que j'ai à donner, que cette manière de voir serait déraisonnable et contraire à la philosophie, quand même elle ne serait pas irréelle aux yeux de la loi. L'usage de\nSir William Harcourt dit\n\nJe prendrai\nLa classe des officiers politiques, qui est toujours faible, dû à la réticence de la population dans les pays civilisés et composée de ces officiers qui sont nommés par le gouvernement pendant une période de temps plus ou moins longue, est considérée par le corps électoral comme un groupe de personnes qui ont été choisies pour leur compétence et leur expérience. Ces officiers politiques sont choisis pour leur compétence et leur expérience, ainsi que pour leur loyauté envers la nation.\n\nLeur rôle est de représenter les intérêts de la nation et de faire en sorte que les décisions prises par le gouvernement soient justes et équitables. Ils sont également chargés de veiller à ce que les lois soient respectées et appliquées de manière équitable.\n\nLa classe des officiers politiques est donc une classe importante de la société, car elle joue un rôle crucial dans la gestion de l'État et la représentation des intérêts de la population.\nL'application de cette méthode est une opération qui doit être faite avec soin et précision. Il est important de bien comprendre le principe de cette méthode avant de la mettre en œuvre.\n\nLa méthode consiste à diviser le problème en plusieurs parties, chacune de ces parties étant ensuite traitée de manière indépendante. Cela permet de simplifier le problème et de le résoudre plus facilement.\n\nIl est également important de garder à l'esprit que cette méthode ne peut pas être appliquée à tous les problèmes. Elle doit être utilisée de manière appropriée et adaptée au problème en question.\n\nEn conclusion, cette méthode est une outil puissant pour résoudre des problèmes complexes. Elle doit être utilisée de manière judicieuse et intelligente pour obtenir des résultats satisfaisants.\nTaylor sur la dictée\n\ns'est état d'esprit ou: lui permettrait d'employer\nchange et le fait tout à fait évident, même d'après ce qui a été avancé pour la défense, qu'il serait en sa faveur au cours du parti comprenant la mort qui l'attendait. Il a été pour cette faute une préparation que le ministre du culte de son choix pouvait lui donner. Il a pu mettre les circonstances de l'acte qu'il était dans un état d'esprit, même pas que serein, à comparer devant le jury.\n\nL'honorable député de Durham (M. Blake) a dit l'autre soir quelque chose de semblable, alléger la confiance que mérite un des médecins qui ont le rapport. I est naturel que le public de l'expérience de ces hommes, le mieux que nous puissions connaître, quan il est en question de leur ne pas croire qu'il est tout à fait, tous le dire que c'est une maladie ou une condition qui peut être aggravée ou protégée. Nous avons donc eu à considérer avec bien plus de diligence le rapport de M. Blake et de faire le travail de M. Blake (ce qui, avant depuis que je n'ai pas pu faire). Nous avons trouvé une réponse adéquate à la réponse formulée par le médecin qui a examiné M. Blake. Ce sont des choses qui nous ont fait dire que nous devions être plus que le docteur Blake, que la compétence, mais le temps qui a passé ne peut pas être ramené. Ainsi, l'impression sur la Chambre, l'honorable député de Durham demande à prouver les documents et rapports de M. Blake, et nous nous sentons que nous devons discuter de cet aspect du problème. L'honorable député de Durham nous a dit que nous devrions être plus que le docteur Blake, que la compétence, mais le temps qui a passé ne peut pas être ramené. Ainsi, l'impression sur la Chambre, l'honorable député de Durham demande à prouver les documents et rapports de M. Blake, et nous nous sentons que nous devons discuter de cet aspect du problème.\n\nVoici une excellente lettre de M. Blake, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\n\nL'honorable député de Durham, monsieur\nvis à des allégations de ce genre\npour agir ainsi.\nL'homme doit être jugé par le gouvernement, non pas par une commission de juges, mais par un jury de citoyens. Le jugement doit être rendu sur la base des faits et des preuves, et non sur des considérations politiques ou idéologiques.\n\nLe jury doit être composé de citoyens représentatifs de la société, de manière à ce que le verdict soit le plus juste possible. Le nombre d'hommes et de femmes doit être égal, afin de garantir l'équité.\n\nLa justice doit être impartiale et indépendante, et le jury doit être choisi de manière aléatoire pour éviter toute influence extérieure. Le verdict doit être rendu après une délibération sérieuse et réfléchie.\n\nEn conclusion, le jury est une institution essentielle de la démocratie, car il permet de garantir la justice et la liberté de chacun.\nions d'exercer la justice\nEXTRAITS DU RAPPORT DU PROCÈS DE LOUIS RIEL.\n\n[Traduction.]\n\nSaint-Antoine, 21 mars 1885.\n\nAu major Crozier,\n\nCommandant de la police montée à Carlton et à Battleford.\n\nMajor,—Les conseillers du gouvernement provisoire de la Saskatchewan ont l'honneur de vous communiquer les conditions suivantes en matière de reddition. Vous devez abandonner complètement la position où vous avez placé le gouvernement canadien à Carlton et à Battleford, en même temps que toutes les propriétés au gouvernement.\n\nSi vous acceptez, vous et vos hommes serez libres, sur votre parole d'honneur de garder la paix, et ceux qui voudront quitter le pays seront fournis de voitures et de provisions pour se rendre à Qu'Appelle.\n\nSi vous refusez, nous avons l'intention de vous attaquer, quand demain le jour du Seigneur sera pas et de commencer sans délai une guerre d'extermination contre ceux qui sont montrés hostiles à nos droits.\n\nMM. Charles Nolin et Maxime Lépine sont nos représentants avec qui vous devrez traiter.\n\nMajor, nous vous respectons. Que la cause de l'humanité vous soit une consolation dans les revers que la mauvaise administration du gouvernement vous aura causés.\n\nLouis \"David\" Riel,\nBrovede.\n\nRené Parenteau, Président\nCharles Nolin,\nGabriel Dumont,\nMoise Ouellette,\nAlbert Monkman,\nBaptiste Boyer,\nDonald Ross,\nAmable Jobin,\n\nJean-Baptiste Parenteau\nPierre Hébert,\nAlbert Delorme,\nDam. Carrière,\nMaxime Lépine,\nBaptiste Boucher,\nDavid Tourtoul.\n\nPh Garnot, Secrétaire.\n\n---\n\nAux Métis,\naux Sauvages,\n\nAux Métis et aux Sauvages du fort Bataille et des environs,\n\nChers frères et chers parents,—Depuis que nous avons écrit, il s'est passé des choses importantes. La police est venue nous attaquer. Nous l'avons rencontrée et Dieu nous a donné la victoire. Trente Métis et cinq sauvages ont soutenu le combat contre 130 hommes, et après 35 ou 40 minutes, ils ont pris la fuite. Bénissez Dieu avec nous du succès qu'il a eu et la charité de nous accorder. Souvenez-vous, faites face à l'ennemi, et si vous le pouvez, prenez le fort Bataille, détruissez-le, sauvez toutes les marchandises et les provisions et venez nous rejoindre. Le nombre que vous êtes peut vous permettre de nous envoyer un détachement de quarante à cinquante hommes. Tout ce que vous ferez pour l'amour du bon Dieu, sous la protection de Jésus-Christ, de la Sainte Vierge, de Saint Joseph et de Saint Jean Baptiste et soyez certain que la loi fait des prodiges.\n\nLouis David Riel, Brovede.\n\n---\n\nChers parents et amis,—Nous vous conseillons de faire attention, tenir vous prêts à tout. Prenez avec vous les sauvages, ramassiez-les de tous côtés. Prenez toutes les munitions que vous pourrez, en quelques magasins que ce soit. Murmurez, grognez, maudissez, soulevez les sauvages, mettez, avant tout, la police du fort Pitt et du fort Bataille dans l'impossibilité.\nChers parents et amis,—Si vous n'avez pas encore appris, nous vous apprendrons quels sont les raisons qui nous portent à prendre les armes. Vous savez que, de temps immémorial, nos pères ont défendu au péril de leur vie ce pays qui était le leur et qui est le nôtre. Le gouvernement d'Ottawa s'est emparé de notre patrie, voilà quinze ans qu'ils se moquent de nos droits et qu'ils offensent le bon Dieu en nous accablant de milles et milles injustices. Les employés sont toutes sortes de crimes. Les gens de là par les montées scandalisent tout le monde par leurs mauvais discours et leurs mauvaises actions. Ils sont tellement corrompus que nos sentiments et nos intérêts ne se trouvent plus en sécurité dans leur voisinage. Les lois d'honnêteté ne sont plus pour eux que des sujets de railleries. O mes frères et mes amis, tout nous invite à avoir confiance en Dieu, mais aujourd'hui, que le mal est rendu à son comble, nous avons un besoin particulier de nous recommander à Notre Seigneur. Peut-être votre voix est-elle une des mêmes que nous. Si nous voilà notre pays, si ensuite on le gouverne tellement, mais que si nous laissions faire nous serions bientôt impossibles d'être sauvés. Les Métis anglais de la Saskatchewan sont avec nous franchement. Les Sauvages nous arrivent et nous rejoignent de tous côtés. Achetez toutes les munitions que vous pourrez. Allez vous en procurer, si le faut, de l'aide des lignes. Tenez-vous prêts. N'écoutez pas les offers que le gouvernement d'Ottawa va vouloir vous faire. Ces offers sont des offers de trahison. Ne signez pas ni papiers ni pétitions, fiez-vous sur le bon Dieu.\n\nLes Métis français membres du gouvernement provisoire de la Saskatchewan se sont séparés de l'Église de Rome, et la grande masse du peuple en a fait autant.\n\nSi nos prêtres consentent à nous aider jusqu'à ce jour nos prêtres ont refusé d'abandonner Rome.\n\nIls désirent nous gouverner dans un sens opposé à nos intérêts, et ils désirent continuer à nous gouverner selon les ordres de Léon XIII.\n\nChers frères en Jésus-Christ, pour l'amour de Dieu, venez à notre aide, afin que nos efforts contre Rome soient couronnés de succès, et en retour, nous ferons tout en notre pouvoir pour assurer nos droits politiques.\n\nChers parents,—Nous avons le plaisir de vous annoncer que le 26 du mois dernier, Dieu nous a donné une victoire sur la police montée.\n\nTrente-cinq Métis et quelques cinq à six sauvages Cris, ont rencontré cent vingt hommes de police et volontaires.\n\nGrâce à Dieu, nous les avons défait. Vous-mêmes, chers parents, soyez courageux. Faites ce que vous pourrez. Si ce n'est pas fait, emparez vous des magasins, des provisions et des munitions. Et sans délai venez ici en aussi grand nombre que possible. Envoyez-nous des nouvelles.\n\nLouis \"David\" Riel,\nEscoyda,\n\nMonsieur Ouellette,\nJ. Baptiste Boucher,\nDonald Ross,\nBaptiste Parenteau,\nMaxime Lepine,\nCharles Trottier.\n\nLa police montée se prépare à une attaque; elle se rassemble en force, aucun débat ne devrait avoir lieu. Venez nous renforcer.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001551.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 72, "total-input-tokens": 102730, "total-output-tokens": 18155, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2010, 5], [2010, 5722, 6], [5722, 9684, 7], [9684, 13721, 8], [13721, 17521, 9], [17521, 21428, 10], [21428, 22880, 11], [22880, 22880, 12], [22880, 22880, 13], [22880, 23524, 14], [23524, 23524, 15], [23524, 23524, 16], [23524, 23524, 17], [23524, 26188, 18], [26188, 30691, 19], [30691, 31870, 20], [31870, 31870, 21], [31870, 31870, 22], [31870, 31870, 23], [31870, 33684, 24], [33684, 34628, 25], [34628, 34628, 26], [34628, 34628, 27], [34628, 34628, 28], [34628, 34628, 29], [34628, 34628, 30], [34628, 34628, 31], [34628, 34628, 32], [34628, 34658, 33], [34658, 34755, 34], [34755, 37216, 35], [37216, 37254, 36], [37254, 37254, 37], [37254, 37254, 38], [37254, 38195, 39], [38195, 38195, 40], [38195, 38984, 41], [38984, 38984, 42], [38984, 38984, 43], [38984, 38984, 44], [38984, 38984, 45], [38984, 39057, 46], [39057, 39057, 47], [39057, 39057, 48], [39057, 39057, 49], [39057, 39057, 50], [39057, 50492, 51], [50492, 50492, 52], [50492, 50492, 53], [50492, 50526, 54], [50526, 50543, 55], [50543, 50543, 56], [50543, 51330, 57], [51330, 51330, 58], [51330, 51356, 59], [51356, 51356, 60], [51356, 54191, 61], [54191, 57224, 62], [57224, 57224, 63], [57224, 57224, 64], [57224, 57224, 65], [57224, 57224, 66], [57224, 57224, 67], [57224, 57224, 68], [57224, 57224, 69], [57224, 57224, 70], [57224, 57224, 71], [57224, 57224, 72]], "primary_language": ["fr", "None", "None", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None", "None", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "en", "fr", "fr", "fr", "es", "None", "None", "None", "None", "fr", "es", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "es", "fr", "fr", "fr", "fr", "None", "fr", "en", "fr", "fr", "es", "fr", "fr", "fr", "es", "fr", "fr", "fr", "es", "fr", "fr", "None", "None", "None", "None", "None", "None", "None", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, true, true, false, false, true, true, false]}}]