[{"id": "876e0fed6f15a666ad449031ff0ac801c1bf938e", "text": "NORTH-WEST ADMINISTRATION.\nNORTH-WEST ADMINISTRATION.\n\nSPEECH BY HON. THOMAS WHITE,\n\nAT\n\nWESTON, ONT., WEDNESDAY EVENING, DECEMBER 16TH, 1885.\n\n(From THE GAZETTE, Montreal.)\n\nNORTHWEST ADMINISTRATION\n\nThe Government's Policy Towards the Half-Breeds.\n\nTHEIR CLAIMS CONSIDERED.\n\nThe Pretension that Grievances Existed Exposed as a Sham.\n\nTHE HON. DAVID MIL'S METHOD\n\nOf Dealing with Representations and Petitions of Half-Breeds.\n\nThe following is a full report of the speech delivered at Weston, Ont., on Wednesday evening, the 16th December, 1885, by the Minister of the Interior, on the occasion of the banquet to Mr. N. C. Wallace, M.P. for West York:\n\nTHE HON. MR. WHITE,\n\nwho was received with continued applause, said:—Mr. Chairman and gentlemen, I can assure you that I have the very greatest pleasure in being here to-night to join with you in doing honor to my worthy friend, your representative, Mr. Wallace. I have known Mr. Wallace ever since he entered public life. We entered Parliament at the same time, and I am sure that, without flattery to him, I may fairly say that highly as he stands in the estimation of his constituents, among his colleagues in Parliament he stands no less highly, because of the sterling qualities which they have recognized in him, both as a man and as a representative of the people. Gentlemen, from my study of public life and after a thirty years' attendance of the sessions of Parliament, I am convinced that there is nothing which strengthens a representative so much—nothing enables him so well to perform his duty—nothing which better gives him the influence he ought to possess, than the fact that he stands well with those whose mandate he bears and who have entrusted him with the representation of their interests in the councils of the country. It is, therefore, a gratification to me, and to all public men, to know that a gentleman who stands so highly as Mr. Wallace does in the estimation of his friends in Parliament stands equally high in the estimation of his immediate neighbors—the men who sent him to Parliament. (Applause.) Gentlemen, I do not propose to-night to make a general political speech. You have listened to Mr. Wallace, who has dealt in general terms with the politics of the country. You have listened to my respected and honored colleague the Minister of Agriculture, who has in his interesting and eminently practical address given you a number of suggestions as well as a number of facts which are worthy of consideration; and I think under those circumstances that I will best meet your wishes and best fulfill the duty which I\nowe to the party to which I belong, if I deal somewhat closely with the question which at this moment is the prominent question before the people of this country. (Hear, hear.) I am not, gentlemen, going to deal with the Northwest rebellion. I am not going to deal with the question of whether the execution of\n\nTHE UNFORTUNATE CRIMINAL, RIEL,\n\nwas wisely carried out or not. But, I think, it might not be out of place to deal with the particular subject which our political opponents are this moment pressing upon the attention of the public. In Ontario, especially, the Liberal press, headed by the Toronto Globe, does not venture in a very open way—although I am bound to say that they are fast getting to that point—to condemn the act of the Government in issuing a warrant for the execution of Riel, but they have lit upon a scheme by which they hope to be able to unite what have always been regarded as discordant elements in this country, that is the French-Canadian Conservatives of the Province of Quebec and the clear Grits of the province of Ontario. They tell us that the Government is to be condemned not, perhaps, because Riel was executed, but because it is responsible for the outbreak which occurred in the Northwest, and, therefore, responsible for all the unfortunate consequences, including the execution of Riel, which have followed that outbreak. I propose, therefore, gentlemen, to deal simply with the one question—how far the Government of the Dominion are responsible for the outbreak; how far they, by their want of policy, by their want of haste and attention, provoked the outbreak which occurred in our Northwest Territories. I may in the course of what I have to say refer incidentally to\n\nTHE POLICY OF OUR PREDECESSORS\n\nin office, the Mackenzie administration, and I want at the very outset to say to you that if I do so I shall not do it as justifying any mistakes which we may have made, if mistakes were made, or justifying any delays which we have permitted, but I refer to them simply as matters of record and as showing at least that it does not lie in the mouths of those who preceded this administration in office to make the charges which today they are disposed to make against us. (Applause.) I for one, as a public man and as a member of the Government, would despise myself if I based my claim upon public support upon the mistakes of other men in office. I have no desire to do anything of the kind. Let every tub stand upon its own bottom. The Government is either blameable or not blameable, and we are neither more nor less blameable because of anything which our predecessors may have done—except in so far as their action interfered with execution of that policy which was decided upon by the Conservative party before the Liberals took office, and thus retarded and embarrassed the settlement of the questions arising out of the transfer of the territories to the Dominion. (Hear, hear.) Therefore when I refer to what was done by our predecessors do not imagine that I wish to relieve this administration from blame because of it, but I refer to them simply as mere matters of history. Now, gentlemen,\n\nTHE CLAIMS OF THE HALF BREEDS\n\nof the Northwest, in so far as the Government which is now in office is concerned, or in so far as stated to that Government, had relation only to two subjects. The one was the question of surveys; the other was the question of lands in extinction of what is known as the \"Indian title.\" Other claims had been made in the past. The revered and respected Bishop Grandin—and I speak of him with the highest respect as a man who has devoted his whole life to missionary work, wrote to Mr. Mills, or to the Government which Mr. Mills represented in the Department of the Interior, a letter, in which he set forth a number of claims—such as lands for school purposes, lands for orphanages and hospitals, lands for public institutions, grants in aid of settlers, grants for the purchase of agricultural implements, and a number of such matters. All these claims were dealt with by Mr. Mills at the time, and they were dealt with in terms which I think are worthy of quoting, as showing the principle upon which the late government considered that all the matters affecting the half-breeds of the Northwest should be dealt with. Mr. Mills, in his letter, in reply to the claims set forth by Bishop Grandin said: \"The application of the petitioners to be aided by the Government with seeds and agricultural implements in their farming operations, I confess I am not disposed to view favorably. I do not see upon what grounds the half-breeds can claim to be treated in this particular differently from the white settlers in\nthe territories. The half-breeds who have in some respects the advantages over new settlers in the territories should be impressed with the necessity of settling down in particular localities, and directing their energies towards pastoral or agricultural pursuits, in which case lands would no doubt be assigned to them in the same way as to white settlers, but beyond this they must not look to the Government for any special assistance in their farming operations.\" (Laughter.) Now, gentlemen, that was the principle laid down by Mr. Mills as that which should govern the action of the administration in dealing with the half-breeds of the Northwest. I will not discuss here whether it was not a wise principle, but I think I may very fairly, as dealing with the charges which are now made against the Conservative administration, assume it, at any rate for the purpose of the argument which I am about to present to you, as at least a reasonable principle of action to be followed in dealing with the half-breeds of the Northwest. This was the principle adopted by the Grit Government, and it was adopted in opposition to the recommendation of the chief executive officer of the government in the Northwest. These people asked for seed to plant, that they might have the result of the planting in the harvest which they looked forward to. The Hon. Mr. Laird, the lieutenant-governor appointed by the Mackenzie Government of the N. W. territories, wrote to Mr. Mills on this subject, recommending the prayer of the petition: \"With respect to the prayer for assistance to procure seeds and implements to commence farming operations, it is similar to the request made to you by the half-breeds of Bow River during the Blackfeet treaty negotiations and which I forwarded to you and commended to the favorable consideration of the Government.\" So that you will see the\n\nDECISION ARRIVED AT BY MR. MILLS,\n\nand which I have quoted to you from his own pen, was arrived at in spite of the recommendation of his own officer, Mr. Laird, who commended the petition of the half-breeds to the favorable consideration of the Government. (Hear, hear.) Those half-breed claims I have referred to were the earlier applications that were made. However, since Sir John Macdonald came into office, only in relation to the matter of surveys, and the matter of lands in extinguishment of the Indian title, has there been a demand made on behalf of the Metis to the Government. Now, how have the Government dealt with those two subjects? In the first place, Mr. Pearce, who is one of the most efficient officers we have in the Northwest, a gentleman who was employed in the survey branch of the Department of the Interior during the time that Mr. Mills was in office, was summoned to Ottawa in December last year because he was supposed to be familiar with the whole system of surveying in the Northwest, for the purpose of arranging with the Government as to what should be done in view of the course the half-breeds who had settled on more lands after survey, within the previous two years, wished to have pursued. Mr. Pearce came down here and had a conference with my respected predecessor, Sir David Macpherson. And here let me say to you, gentlemen, after careful inquiry into the Department of the Interior, after a careful study during the short time I have been in office of what has been done, that no more conscientious minister than Sir David Macpherson ever was at the head of a department. (Applause.) At that conference with Sir David Macpherson Mr. Pearce and he discussed the whole question, and instructions were sent to the agent, reaching him on the 4th of February last year, to arrange the question of surveys, so far as they still remained to be arranged, in accordance with the wishes of the half-breeds. (Applause.) I am treating of matters for which, not being in office, I am not personally responsible except as to that technical and constitutional responsibility which rests upon every minister who accepts office in a Government for the acts of the Government of which he becomes a member. But I think you will see that the Conservative Government, in dealing with the matter of surveys, at the time went very far indeed from dealing with it on the principle laid down by Mr. Mills, that the half-breeds should be\n\nTREATED LIKE THE WHITE SETTLERS\n\nand without any more consideration. Actually on the fourth of February last, the half-breeds, who having settled after survey had no claim to demand a change in the manner of survey, had the information from the Government that their lands would be surveyed in the manner they desired them to be surveyed, and that this difficulty would be removed from them altogether. That was some weeks before the shots were fired at Duck Lake which\nprecipitated the unfortunate outbreak. It is important to remember that the surveys of that district practically all took place under the Government which is today in power. And, gentlemen, the instructions to surveyors from the first were that whenever they found any number of settlers in a particular locality along the banks of the Saskatchewan or the other rivers of the Northwest, if these half-breed settlers so desired, the instructions to the surveyor were, in every case, to survey the land on the river lot principle instead of on the rectangular principle. In this the half-breeds could have whatever they wished. For instance, gentlemen, in Battle river, southeast of Bear hills, at Edmonton, at St. Albert, Fort Saskatchewan, Victoria, Prince Albert and St. Laurent, the river lot principle of survey was adopted because of the fact that there were half-breed settlers there when the surveyors went, and they carried out their instructions from the Government to meet the wishes of the people. (Hear, hear.) Now if we had taken the ground which Mr. Mills took, we were not bound to do that. What were the facts regarding those surveys? As far back as 1871 the system of rectangular surveys was determined upon by the Government, and embodied in an act of Parliament to be applied to the whole of the Northwest territories. We might, had we chosen, have sent our surveyors there not to survey on the river lot principle, but by the rectangular system according to the law followed by both administrations, and which was applicable to all white settlers who chose to go into the country. But we did not do that. If we had adopted the principle of Mr. Mills, if we had said the rectangular survey is the system according to law, if you choose to settle in the country you must conform to it, if we had done this the half-breeds would have been deprived of the benefit of their own system of surveys, and there might have been a grievance. In 1871, previous to the adoption of the rectangular system of surveys, there were only twenty half-breeds at St. Albert, fourteen or fifteen at Victoria, about six at Edmonton, and, except two or three at Q'Appelle, these were all the half-breed settlers in all those territories outside of Manitoba. Except those few people, we might have dealt with all the other half-breeds on the principle laid down by Mr. Mills, that, although they had claims for consideration on the Government, they would have to be treated as the white settlers.\n\nGentlemen, a complaint which is often made, and which is said to have caused a great deal of heartburning and trouble amongst the half-breeds of the Northwest is\n\nTHAT ENGLISH SURVEYORS WERE SENT there to survey the land; that these English surveyors of the lands of the Saskatchewan and other parts of the country had ignored improvements made and houses built by settlers, and that they had run lines through their property irrespective of those improvements; not speaking their language and treating the half-breeds in a spirit of hauteur and indifference which caused irritation amongst them. The fact is, gentlemen, that eighty per cent. of all the lands surveyed in the district in which the outbreak took place were surveyed by French Canadians (laughter) and the remaining twenty per cent. were surveyed by English surveyors speaking the French language or accompanied by assistants who spoke French. This, gentlemen, is the fact regarding this matter. (Hear, hear.) Then, gentlemen, there is another point on which we should expect half-breeds to do as others are required to do—that is that half-breeds should take precautions to enter their lands at the office of the agents. But the fact is that, although the half-breeds ought to have made entries within three months after surveys were made, twelve months afterwards in that district not 40 per cent. of the whole of the half-breeds had gone to the land office to make the entry of their lands. Let me give you a striking illustration of the\n\nPRACTICAL INDIFFERENCE OF THOSE PEOPLE, notwithstanding that we gave them every instruction as to how they should enter for their lands. I find that in the neighborhood of Duck Lake the land was surveyed and open for entry in August, 1881. At the beginning of 1883 none of the half-breeds having come to make their entries, the Government was so anxious to provide for them that they sent the assistant agent at Prince Albert into the Duck Lake district to give further information to the half-breeds and to point out the lands to which they were entitled, and to advise them to make their entries. Yet, at the time the rebellion broke out, not 25 per cent. of those people had taken the trouble to go to Prince Albert and make those entries. (Hear, hear.) Yet we are told that the Government should be held responsible for the outbreak in connection with this matter. (Cries of \"No.\") Again it is claimed that, notwithstanding all those precautions, delays\nexisted in connection with the surveys. All I have to say about this is that whatever just complaint may be made against the Conservative Government, they were at all events not responsible for delays or laxity in the matter of the surveys. (Applause.) During the whole time the Mackenzie Government held office there were surveyed throughout the whole of the Northwest territories only about two millions of acres. And since the Mackenzie Government went out and the Macdonald Government came into office, upwards of\n\nSIXTY-FIVE MILLIONS OF ACRES\n\nhave been surveyed. (Applause.) When those half-breeds petitioned Mr. Mills on the matter of surveys his answer was:—\"As regards the application of the petitioners for an early survey of the settled lands along the principal rivers, I have to request you to inform the petitioners that the surveys of such land has been carried out to some extent,—only to some extent, mark you, and I have told you what a small extent—'and will be prosecuted as rapidly as the funds at the disposal of the department will permit.\" That was the answer of Mr. Mills to the half-breeds when they asked to have the lands surveyed. Two million acres was the extent of their surveying enterprise for five years. So much for surveys; and now as to the matter of the lands. The lands to which those half-breeds were entitled were lands under what we call the extinguishment of the Indian title. Those people would not be entitled to lands, except as ordinary settlers taking up homestead and preemption titles like any one else, except for the fact of their having Indian blood in their veins. The Government held they were entitled to have their Indian title extinguished. The policy of Sir John Macdonald, when he acquired possession of the territory in 1870 from the Hudson's Bay company, was to extinguish this title at once, and as there were only in the Northwest the few half-breeds I enumerated, viz: about forty, he laid out 1,400,000 acres of land for the extinguishment of the Indian title in the half-breeds of Manitoba. A good deal of discussion, you will remember, took place in Parliament at the time, and the opponents of the Government censured them for setting aside so much for this purpose. The Riel trouble of that day had just taken place. Mr. Blake had secured the reins of office in Ontario by declaring that Mr. Sandfield Macdonald, who had no more to do with the matter than the man in the moon, had not hanged Riel. Mr. Blake succeeded in arousing the feelings of the people by portraying the iniquities of the half-breed leader, and when the Conservative Government proposed to lay aside 1,400,000 acres for the extinguishment of the Indian title in those men who were denounced as rebels, they were attacked in Parliament by the leaders of the Liberal party as guilty of an act wholly indefensible in its character. Sir John Macdonald recognized that these people, whether favorable to the connection with Canada or not, had a right to this 1,400,000 acres. But he proposed to extinguish\n\nTHE INDIAN TITLE OF THE HALF-BREEDS\n\nat the same time that the treaties were being made with the Indians themselves. If the policy of Sir John had been pursued the whole question of lands to the half-breeds would have been settled in 1875 and we would have heard nothing about it since that time. (Hear, hear.) But Mr. Mackenzie had a little game of his own. He wanted to give office to a couple of gentlemen—Mr. Matthew Ryan, of Montreal, and Mr. Macar, of Kingston. He set aside the enumeration of Governor Archibald, stopped all proceedings taken by him under the authority of the Conservative Government; and brought about all those difficulties which have resulted in such delay and embarrassment since that time. There were some difficulties in the way of getting rid of this Indian title, and I notice that the Northwest council have recently passed a resolution, embodied in the address in answer to the speech of the Lieutenant-Governor from the throne, in which they censure the Government for not having paid more earnest attention to the suggestions made by them in previous representations to the Government. Gentlemen, I have the highest possible respect for the Northwest council as a representative body which is becoming more representative every day. It is the only body which in any true sense can speak for the whole of the Northwest Territories. I sincerely hope that the growth of population in that country will be such that in a short time, under the operation of the law and in the interests of the people, the Northwest council will be wholly representative, and that there will be no person in it except those\nwho are elected by the people to represent them. That is my earnest desire in connection with the Northwest council. (Applause.) I do not wish that anything which I say should be considered as reflecting on that body, for whom I have the highest possible respect. Let me, however, review the action of the Northwest council. In August, 1878, there had been a petition presented to them by a number of people of the Northwest—half-breeds chiefly—in relation to a number of subjects, and the council made a representation to the Governor-General in council setting forth what should be done for those half-breeds. The half-breeds themselves claimed that there should be territory set aside for them exclusively to the extent of 150 miles long, along the international boundary line and 50 miles deep. This is somewhat the same, though not so extravagant, as the demands made by Riel for the half-breeds. Here was the answer of the Northwest Council to this demand, dated August 2nd, 1878 and embodied in a memorial to the Governor-General in Council:\n\n\"1. That it would be injudicious to set apart reserves of land for the half-breeds of the Northwest Territories, or give them negotiable scrip.\n\n\"2. That in view, however, of the fact that grants of land or issues of scrip were made to the half-breeds of Manitoba towards the extinguishment of the Indian title to the lands of that Province, there will undoubtedly be general dissatisfaction among the half-breeds of the said Territories unless they receive some like consideration.\n\n\"3. That this consideration would most tend to the advantage of the half-breeds were it given in the form of a non-transferable location ticket for, say, one hundred and sixty acres to each half-breed head of a family and each half-breed child of parents resident in the said Territories at the time of the transfer thereof to Canada, the ticket to be issued immediately to any half-breed eighteen years of age or over, on furnishing evidence of claim and to every child on arriving at that age, and furnishing the necessary evidence.\n\n\"4. That each half-breed holding such a location ticket should be allowed to locate it upon any unoccupied Dominion lands, but the title of the land so entered shall remain in the Crown for ten years; and if, at the expiration of three years after such entry the half-breed locatee have made no improvement on the land, his claim thereto shall be subject to forfeiture.\n\n\"5. To induce those half-breeds who now procure their livelihood by hunting on the plains to abandon their present mode of life and settle on their locations, by which course it alone appears possible to arrest the great destitution with which they are threatened, owing to the imminent early extinction of the buffalo, that aid in agricultural implements and seeds be allowed them for three years, but only once for each family that may settle within that time.\n\n\"6. That half-breeds who have shared in the Manitoba distribution of lands and scrip should not be entitled to receive location tickets in the Territories, though now resident therein.\n\nI have shown you that Mr. Mills had already refused to give them seed or farm implements. Now, gentlemen, in 1883 the Northwest council sent in another petition to the Dominion Government in which they referred to a number of matters connected with the Northwest, and in the course of the memorial occurs the following: \"Your memorialists further pray that those half-breeds in the territories, who have not participated in the arrangement to extinguish the half-breed claims in Manitoba, should enjoy the same rights as accorded to the half-breeds in that province.\" I am not wrong in saying that that simple reference in a report which covers two closely printed pages of the returns brought down to Parliament, must be interpreted in the light of the more elaborate suggestions made by the council in their previous representation; and what were those proposals? Why, gentlemen, it was proposed by the Northwest council that those half-breeds who had claims upon the Government, that those people who had rights, were actually to be treated worse than if they had no Indian title and took up land in the ordinary way. Any man\n\nGOING TO THE NORTHWEST TERRITORY\n\ncan get 160 acres of land as a homestead, and if he settles on it and performs the ordinary settlement duties within three years, he will then get his title to it. The magnificent and magnanimous suggestion of the Northwest council, which now ventures to censure the Government for not acceding to their suggestions, was that a half-breed should get 160 acres, and if he did not perform his duty within three years the land should be forfeited; if he did perform his duties as any white settler, he was not to have his patent for ten years—seven years longer than in the case of a white settler. (Hear, hear.) Archbishop Tache, who has always taken the most kindly interest in the welfare of the half-breeds, and who has devoted himself with great energy to the promotion of their welfare recommended that the half-breeds should get their lands but they should be inalienable for three generations. While the Northwest council suggested that the half-breeds\nshould not get their land patents for ten years, His Grace Archbishop Tache suggested that they should not get them for three generations. Now, gentlemen, what would have been the result of this? I venture to say and I will give you proof of it, that had the Government accepted the suggestions of the Northwest Council or of His Grace Archbishop Tache, it would not have satisfied the half-breeds of the Northwest Territory, and we would still have continuous trouble in connection with them. Then, gentlemen, as regards the\n\nCOMMISSION WHICH ISSUED THIS YEAR,\n\nwe are told that it was not issued until it was found the rebellion had broken out. Nothing could be farther from the truth than this statement. We learn from the testimony of Father Andre that the news that the commission had been appointed and the order-in-council passed had reached him on the 4th of March last, while the battle of Duck Lake did not occur until the end of March. It cannot, therefore, be said that the action of the Government in appointing the commission resulted in any way whatever from the actual outbreak of hostilities in that province. (Applause.) After the commission had been issued and while it was sitting at Qu'Appelle, a matter occurred which will show how far the suggestions of his Grace and of the Northwest Council would have met the demands of the half-breeds. Mr. Street, the chairman of the commission, telegraphed to Sir David MacPherson as follows:\n\nQU'APPELLE, 6th April.\n\n\"Important conference to-day with influential half-breed delegation; all difficulties removed excepting two. First—All children will refuse money scrip, demanding certificate for 240 acres land instead, like Manitoba; several bishops and priests support this demand. Second—Half-breeds having homes on small front unacceptable; to buy these at one dollar per acre and free grant 160 acres from nearest vacant lands additional to allowance to extinguish Indian title.\"\n\nBoth those demands were conceded to the half-breeds by Sir David Macpherson. I took the trouble to get a memorandum from the clerk of the commission and here is the result. At Qu'Appelle there was the statement that these people would take nothing but the land and that they would not take the scrip. Well, this is the result: \"Out of 143 half-breed children residing in the Qu'Appelle valley, who had the option of receiving a certificate for scrip for either $240 or 240 acres of land, only two have elected to take land, all the others preferred to take money scrip instead.\" So that while we are blamed for not adopting the suggestion of the Northwest council, which was that those people should only get 160 acres of land, (and we offered them 240,) only two took the land, the others took the scrip, sold it at a sacrifice to the brokers who were on hand, and bought gew-gaws and other things with the money. That was the result as regarded the half-breeds. (Cheers.) There is another important fact. You will see by the recommendation of the Northwest council, to which I have just referred, that the Government were asked to decide that those half-breeds who had been settled with in Manitoba should not receive any consideration in extinguishment of the Indian title, although now residing in the Northwest Territory. Now, gentlemen, what are the facts? The rebellion broke out on the Saskatchewan, and nearly all the people settled there were men who had had their half-breed title extinguished in Manitoba. (Laughter.) Out of all those engaged in the rebellion only twenty-three came before the commission to say they were entitled to any land in consideration of the Indian side of their character, and of those twenty-three all but one swore positively that they were not consenting parties to the rebellion, but, under terror and forced by Riel's armed men, they joined the rebels for fear they would be banished, have their property destroyed or their families rendered destitute. The localities in which the half-breeds had claims were not in rebellion at all. The place where the half-breeds rebelled was a place where the men had gone who had already had their land matters settled in Manitoba. And they had no claims on any account whatever. There are\n\nTWO CLASSES OF HALF-BREEDS\n\nin the Northwest. The one class are men who had moved from Manitoba to the Saskatchewan, and who before leaving received their scrip or their land, and the other class are the plain-hunters, and a few people who had gone from Manitoba to the N.W. Territory without having their title extinguished. But the men who rebelled were not the latter class. (Hear, hear.) A good deal has been said about all the petitions which came to the Government in relation to these land matters. An examination was made of one of those petitions, and it was\nfound that out of ninety-one names, seventy-eight were of half-breeds whose Indian titles had been extinguished in Manitoba. Now, let me again refer to the course which Mr. Mills pursued in regard to these. I ventured the other night, when speaking in Peterboro, to quote from a letter of Mr. Matthew Ryan to the agent of the Government at Winnipeg, in which he pointed out that great dissatisfaction would follow if he was not permitted to hunt up half-breeds, who go from one place to another, to settle their claims. In answer to this Mr. Mills, across the letter of Mr. Ryan, in his own handwriting, which I have seen, wrote: \"Those people, if they have any claims, should look after them themselves; it is not our business to hunt them up.\" (Cheers.) More than this, I examined yesterday a list sent down by Mr. Codd, the agent of the Department of the Interior in Winnipeg at that time, and which list contained a schedule of the half-breeds who claimed to have the right of scrip or a grant of lands. These half-breeds were known as traders. They were engaged in hunting in the territories, but returned at stated periods to Manitoba, where their families were supposed to reside, with a view of selling their furs, the produce of the chase. I venture to think that, under the order-in-council passed by Sir John in 1872, in which it was declared that the most liberal interpretation with regard to the term resident should be given in dealing with the half-breeds, these men were entitled to their claims. Well, out of those fifty-three claims only four were admitted by Mr. David Mills, and forty-three were absolutely rejected in this way: by writing after each name \"No, D. M., \" \"No, D. M.\" and so on. (Laughter.)\n\nA voice—He didn't go to much trouble anyway.\n\nThe Hon. Mr. White—That was Mr. Mills' style, and the \"No, D. M.\" was in his own handwriting. It was in the curtest possible way with a view, if possible, of doing as little for the half-breeds as could possibly be done. (Hear, hear.) Gentlemen, I am not attacking Mr. Mills. He may have been quite right in acting as he acted; but what I do say is this, that having so acted he should have at least the decency to hold his tongue at a time like this and not attack the administration for so-called delays or remissions. (Cheers.) Gentlemen, the\n\nLATEST CHARGE MADE AGAINST THE GOVERNMENT\n\nis what seems to be considered the climax of Conservative iniquity. It is said that not only did they delay the surveying of the lands; not only did they delay settling those land claims and giving those people their scrip, but that they actually sold the land over the heads of those half-breeds, and that they gave the lands to a colonization company, which has acquired recently some little notoriety, to the detriment and injury of those unfortunate half-breeds. The Prince Albert Colonization company you have, I dare say, heard a good deal about recently, as well as about the Hon. Mackenzie Bowell (cheers) and his son-in-law. I am not going to insult you or Mr. Bowell by entering a defence for him in a matter of this kind. Mr. Bowell's character is well enough known in this country not to require any defence. I am not going to defend his integrity and honor as a minister of the Crown, for his character is above reproach. (Cheers.) Before I deal with this latest charge, let me say en passant something about colonization companies generally. Large quantities of land were given to colonization companies. Any one who went to Ottawa and chose to select certain lands, and chose to pay the price upon them, and to undertake the very severe conditions which the Government exacted with regard to settlement of those lands—anyone I say who chose to do this could get lands under the colonization system. I had the pleasure when in the Northwest of meeting my good friend, Mr. Armstrong, in his own domain, surrounded by his friends—men from whom I have had dozens of letters since my return—and you will be glad to know that they speak in the highest possible terms of praise of Mr. Armstrong and the manner in which he manages their affairs. I had the pleasure of going through the lands of the Colonization company, which adjoins the York Colonization company, \"The Saskatchewan Land and Homestead Company,\" and of hearing from the settlers how much they were indebted to the Colonization company and its managers for the measure of success they had met with since their settlement in the Northwest. These colonization companies may have been a mistake in some of the details connected with them; but I will tell you this, gentlemen, that, but for their expenditure and their efforts, there are large tracts\nof the Northwest, which are now well settled and which have prosperous homes, which would be a desert today as far as settlement is concerned, were it not for the colonization companies. (Applause.) To-day we have a considerable population in the Northwest, and we owe it in great part to the colonization companies. The projectors of\n\nTHE PRINCE ALBERT COLONIZATION COMPANY went to Ottawa like any other, and they got their lands on the 11th April, 1882. They got eight townships, or fractions of townships, and they paid the first instalment of the money, which, if I mistake not, was $20,000. At the time the Prince Albert company got these lands the townships were not surveyed; the earliest survey took place in March and the latest in September, 1883, and when the surveys were made there was not a single settler on the land. In May, 1883, the company applied for a change in one of the townships, namely township 43, range 27, west of the second meridian, for south part of township 45, range 27. The survey of this latter took place in July, 1882, and of the four settlers found upon it at that time there was only one French—if we are to judge by the names—a man named Boucher, the other three being English. When Mr. Stephenson, the inspector of colonization companies, went there in 1884 he found that there were twenty-seven settlers upon this township. These persons had gone in after the survey was made, and under the principle laid down by Mr. Mills, that the half-breed should be treated no better than the white settler, and squatting on surveyed land not being permitted according to law, those twenty-seven persons were entitled to no consideration. They had built eleven houses and made some little improvement, such as cultivating three or four acres. But those settlers did not run any risk in consequence of the Colonization company taking the land. To show how careful the Government has been, I may tell you that they never give lands to any railway or colonization company or to any individual taking a large tract of land, without making a provision in the contract that settlers found there must be protected in their possession. (Cheers.)\n\nEven in the leases we give to ranching companies, who are developing an enormous cattle interest in the Northwest, we provide that settlers may take up homesteads on lands leased, the homesteads being at once withdrawn from the operation of the lease to the ranching company, so careful is the Government that the settlers' claims shall have the first consideration. (Cheers.) Let me read you the clause in the Prince Albert company's agreement bearing on this:\n\n\"Should any portion or portions of the lands forming the subject of this agreement be now occupied by any person or persons who may have settled thereon, such person, and those claiming through them shall not be disturbed in their possession by the company, unless with the consent in writing of the Minister of the Interior; and the Minister of the Interior may, if he think it expedient to do, from time to time, give to the company written notice that the lands in possession of such persons respectively, and such adjoining lands as he may deem proper (but not exceeding in the whole 320 acres for each separate settler), are withdrawn from the operation of this agreement, and thereupon such lands shall become withdrawn and this agreement shall thereupon cease and determine with respect thereto.\"\n\nThere was not a single settler disturbed by the Colonization company, for the reason that settlers' claims were thus absolutely and in express terms protected. But, gentlemen,\n\nTHE JOKE OF THE WHOLE MATTER is in the fact that while the order-in-council was passed transferring this special south part of a township to the Colonization company, the transfer never took place at all, and the company never took possession of the land. (Laughter.) That, gentlemen, is the truth about the Prince Albert Colonization company. (Applause.) I have shown you, so far as the surveys were concerned, that the surveyors complied with the wishes of the half-breeds in every way, and I have shown you, in so far as the lands were concerned, that the commission was issued before the outbreak of the rebellion, and I have shown you that, more liberal than was recommended by prominent authorities in the Northwest, such as Archbishop Tache and the Northwest council, the Government offered the half-breeds the land without any question of settlement duty whatever and with absolute title from the first. The enormous proportion who took scrip and afterwards sold it showed how little they regarded the grievances that we are told caused them to rebel. I have said that these were the only two claims which came to the Government from the Northwest, but this statement must in some degree be qualified. A petition, or rather a draft petition, was sent down to the Government by\n\nMR. JACKSON, RIEL'S SECRETARY, and accompanying it was a note saying that\nas soon as this petition had been signed by the half-breeds it would be sent to the Secretary of State in due course. Now, gentlemen, I think you will agree with me that this was not a document of which the Government should take cognizance. The document, as promised, never reached the Government, for the reason probably, as stated by Mr. Astley in a recent letter, that Riel was unwilling that any representations from half-breeds should reach Ottawa. The document, however, is so important, as embodying the views of those who prepared it, that it is worth while reading it in full, as follows:\n\nTo His Excellency the Governor-General of Canada in Council:\n\nWe, the undersigned, your humble petitioners, would respectfully submit to Your Excellency-in-council the following as our grievances:\n\n1. That the Indians are so reduced that the settlers in many localities are compelled to furnish them with food, partly to prevent them from dying at their door, partly to preserve the peace of the territory;\n\n2. That the half-breeds of the territory have not received 240 acres of land each, as did the Manitoba half-breeds;\n\n3. That the half-breeds who are in possession of tracts of land have not received patents therefor;\n\n4. That the old settlers of the Northwest Territory have not received the same treatment as the old settlers of Manitoba;\n\n5. That the claims of settlers on odd numbers prior to survey, and on reserves prior to the proclamation of such reserves, are not recognized;\n\n6. That settlers on cancelled claims are limited to eighty acres homestead and eighty acres of pre-emption;\n\n7. That settlers are charged more than one dollar per acre for their pre-emptions;\n\n8. That settlers are charged dues on timber, rails and firewood required for home use;\n\n9. That customs duties are levied on the necessaries of life;\n\n10. That settlers are not allowed to perform the required amount of breaking and cropping on their pre-emption, in lieu of their homestead, where, as frequently happens in the vicinity of wooded streams, it is convenient to have farm buildings and grain fields on separate quarter sections;\n\n11. That purchasers of claims from bona fide settlers who have not completed the required time of actual residence, do not get credit for the term of actual residence, by sellers.\n\n12. That contracts for public works and supplies are not let in such a manner as to confer upon Northwest producers as large a benefit as they might derive therefrom, consistent with efficiency;\n\n13. That public buildings are often erected on sites little conducive to the economical transaction of public business;\n\n14. That no effective measures have yet been taken to put the people of the Northwest in direct communication with the European markets, via Hudson's Bay.\n\n15. That settlers are exposed to coercion at elections, owing to the fact that votes are not taken by ballot;\n\n16. That while your petitioners wish to give the Eastern Government every credit for the excellent liquor regulations which obtain in the N.W.T., yet they must express their anxiety lest those beneficial restrictions should be loosed, more especially as the country is sparsely settled and the Indians numerous and dissatisfied.\n\n17. That they may humbly state their case; without intending to intermeddle with the affairs of Manitoba and other parts of the N.W.T., your petitioners respectfully submit:\n\n(a) That in 1870, when, on invitation of the Dominion, the delegates of the N.W. arrived in Ottawa, claiming the control of its resources as one of the conditions of the entry of the territory into Confederation, they were arrested.\n\n(b) That after releasing those delegates, at the interposition of the imperial authorities, after explicitly acknowledging and receiving them \"as the delegates of the Northwest,\" the Dominion treated with them amid preparations for war, and despatched to the Northwest an expedition of federal troops while the negotiations were pending;\n\n(c) That a commissioner of the then Governor-General and of his Government having averted the conflict which he saw would be the consequence of these hostilities by giving his word of honor as commissioner that, however threatening the outlook of the situation might appear, Canada would act in good faith, the response to that peace preserving act was repudiation;\n\n(d) That an understanding having been thus arrived at with the delegates, subject to the consent of the Northwest, the order-in-council by which the Queen annexed the Northwest Territory and Rupert's Land to the Dominion of Canada bears date 23rd June, 1870, at which time that consent had not been obtained;\n\n(e) That, having thus dispensed with one of the most important conditions of the \"Union\" the Imperial Government seems to have followed ever since a policy calculated, in the opinion of your humble petitioners, to make of the Northwest a mere appendage to Canada;\n\n(f) That although the existence of the above-mentioned word of honor an extraordinary treaty has been established four years after, by special request of the House of Commons of Canada, supported, another year later, by the Government, and recorded in the most conclusive official documents, there are nevertheless to-day, in that part of the Northwest called Manitoba, extant proofs of their continual violation;\n\n(g) That although by the last clause of the \"Manitoba act,\" Rupert's Land and the Northwest Territories were to have been under temporary government until the 1st of January, 1871, and until the end of the session then next succeeding, those Territories are nevertheless to-day under a Government which has remained temporary for fifteen years, and which\nby the nature of its constitution is destined to remain temporary for an indefinite period:\n\n(h.) That the Northwest Territories, although having a population of 60,000, are not yet granted responsible government, as was Manitoba when she had less than 12,000 of a population;\n\n(i.) That the Northwest Territories and its premier province are not yet represented in the Cabinet, as are the eastern provinces;\n\n(j.) That the Northwest is not allowed the administration of its resources as are the eastern provinces and British Columbia;\n\nIn submitting this as a fundamental grievance your petitioners would disclaim any intention of defrauding the Federal Government of the monies which they may have contributed to the improvement of the Northwest.\n\nIn conclusion your petitioners would respectfully state that they are treated neither according to their privileges as British subjects nor according to the rights of people and that consequently as long as they are retained in those circumstances, they can be neither prosperous nor happy;\n\nYour humble petitioners are of opinion that the shortest and most effectual methods of remedying these grievances would be to grant the Northwest Territory responsible government with control of its own resources and just representation in the Federal Parliament and Cabinet;\n\nWherefore your petitioners humbly pray that your Excellency-in-Council would be pleased to cause the introduction, at the coming session of Parliament, of a measure providing for the complete organization of the district of Saskatchewan as a province and that they be allowed as in 1870, to send delegates to Ottawa with their bill of rights; whereby an understanding may be arrived at as to their entry into Confederation, with the constitution of a free province, and your humble petitioners will not cease to pray.\n\nNow, gentlemen, the first point to which I desire to draw your attention in connection with this petition is that there is in it not one word of complaint about the surveys, and not one word of complaint about the terrible colonization company which, in the estimation of the Grits of Ontario and the Rouges of Quebec, constitutes the real live grievance justifying the rebellion. (Cheers). The complaints, so far as they refer to the acquisition of the territory in 1870, were complaints which could have been removed, if they were considered as just complaints, by Mr. Mackenzie's government during its five years of office. (Hear, hear.) As a matter of fact they were not just complaints. The references to the land laws and the features of them which are the subject of discussion, about these there is difference of opinion, but in relation to them it certainly cannot be said that they justified rebellion. The question of the Indians may be answered by the fact that the Government of Canada spends a million dollars a year upon the Indians, and that the expenditure of so much money has been made a ground of attack upon the administration, session after session of Parliament, by the Opposition. The statement that patents could not be procured is an incorrect statement, as I have shown you, the real difficulty being with the half-breeds themselves who neglected, although urged to do so, to comply with the law by making their entries at the land office in Prince Albert. But the feature of this whole petition which is noteworthy is the fact that its prayer is confined to a demand for responsible government for the territories and representation in the Parliament of Canada. (Hear, hear.) As to the first, the Northwest council affords a system of self-government which meets, in the meantime at any rate, at comparatively small cost, the wants of the territories in so far as local self-government is concerned. Under the operation of the law, as it stands, the nominated members, essential in the inception of the system, will soon disappear, and the council will then be a wholly representative body. And as to representation, the Government have taken the first step, by ordering a census, to the accomplishment of that result. But to say that the claims made in this draft petition, carefully prepared as it was, and embodying all the demands of the people, as it might be presumed to do, justified a resort to arms, or even palliated such a resort, is to insult the intelligence of the people. (Cheers.) Now then, gentlemen, it will be asked\n\nHOW THEN DID THE REBELLION OCCUR?\n\nHow was it that if those things were settled this rebellion broke out? I believe it broke out because of the action of the Government, and not because of its inaction. It broke out, as Mr. Astley has stated in his letter, and which information he got from Riel himself—because Riel, seeing that the Government had taken action, and that the half-breed claims, such as they were, were about to be settled, believed that his little game would be spoiled, and he hurried on the conflict which led to the unfortunate results which followed the Duck lake fight. He felt that it was a good time for him to play his game; he believed that at that season of the year it would be impossible to put troops in the field. But the valor of our volunteers upset his plans; and I venture to say that those same volunteers will resent the insults which are now being\nheaped upon them by the organs in the press of those whom the Clear Grits of Ontario are not ashamed to call their allies. (Cheers.) Those insults are of the grossest kind. In the Rouge press the volunteers are described as persons who \"assassinated wounded Metis, insulted their women, burned and ruined their houses.\" (Cries of \"lies\" and \"shame.\") They are called \"thieves and robbers, scoundrels, murderers and wild beasts, who went to Batoche to assassinate wounded men and frighten women.\" (\"Shame.\") This is the language used today by the Rouge allies of the so-called Liberals of Ontario. There can be but one feeling throughout the country; that of the strongest indignation at such expressions. Our volunteers at the call of duty entered upon the forced marches, over the dreary waste north of Lake Superior and into the Northwest Territories, taking their lives in their hands to maintain the integrity of the country and to vindicate its laws. (Cheers.) That today in the interests of a cabal, as disgraceful as it is almost unprecedented, they should be thus treated by men calling themselves Canadians and British subjects, is a crying shame which will be resented from one end of this wide Dominion to the other. (Loud cheers.) The Liberals will find that in this, as in many of their previous efforts, they have made a terrible mistake. For years they have resorted to every means to defeat the Conservative party. They hope now that a momentary outburst of annoyance on the part of a portion of the French people of Quebec at the execution of Riel will secure them in their object; but they will be mistaken. (Hear, hear.) The people of Ontario are not likely to misunderstand the underlying motive for all this excitement; and although the Grits dare not openly avow that they condemn the Government for executing Riel, they fondly hope that they may be sustained in allying themselves with men whose only objection to the Government is that Riel was executed. They pretend that the Government is to be condemned, because they say it is responsible for this rebellion. The facts which I have given you, and which are the result of a careful examination of documents in the Department of the Interior, show how utterly untrue that charge is. (Cheers.) Whatever faults the Government may have committed—and being human it is not without its faults—no candid man carefully looking over the record and recognizing the difficulties of the position will charge them with having failed in fully recognizing all the reasonable claims of the half-breeds of the Northwest. (Cheers.) I trust that the electors of West York will in the future, as they have done at the last two elections, rally around the Conservative banner and sustain the party which is now being condemned because guilty of the heinous offence of maintaining the laws of the country and of vindicating British rights and British justice. (Loud and continued cheers.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001561.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 23382, "total-output-tokens": 12041, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 27, 1], [27, 27, 2], [27, 2608, 3], [2608, 7312, 4], [7312, 12106, 5], [12106, 17062, 6], [17062, 21742, 7], [21742, 26955, 8], [26955, 31744, 9], [31744, 36427, 10], [36427, 41403, 11], [41403, 47087, 12], [47087, 52375, 13], [52375, 55319, 14], [55319, 55319, 15]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]