[{"id": "70b210e79b3165569281860eee4b6c5be059d490", "text": "DEPARTMENT\nOF\nMILITIA AND DEFENCE\nOF THE\nDOMINION OF CANADA.\n\nCONTINUATION OF\nAPPENDIX No. 4\nTO THE\nREPORT\nOF 18TH MAY, 1886,\nON MATTERS IN CONNECTION WITH THE SUPPRESSION OF THE\nREBELLION IN THE NORTH-WEST TERRITORIES, IN 1885.\n\nFINAL REPORT OF WAR CLAIMS COMMISSION.\n\nPRESENTED TO PARLIAMENT.\n\nOTTAWA:\nPRINTED BY MACLEAN, ROGER & Co., WELLINGTON STREET,\n1887.\nTo His Excellency the Most Honourable Sir Henry Charles Keith Petty-Fitzmaurice, Marquis of Lansdowne, in the County of Somerset, Earl of Wycombe, of Chipping Wycombe, in the County of Bucks, Viscount Calne and Calnstone, in the County of Wilts, and Lord Wycombe, Baron of Chipping Wycombe, in the County of Bucks, in the Peerage of Great Britain; Earl of Kerry and Earl of Shelburne, Viscount Clanmaurice and Fitzmaurice, Baron of Kerry, Lixnao and Dunkerron, in the Peerage of Ireland; Knight Grand Cross of the Most Distinguished Order of Saint Michael and Saint George; Governor General of Canada, and Vice Admiral of the same, &c.\n\nMy Lord,—\nI have the honour to forward to Your Excellency the accompanying continuation of Appendix No. 4 to the Special Report presented on the 18th May, 1886, on the suppression of the insurrectionary movement in the North-West Territories, consisting of a final Report of the Commission on War Claims against the Department of Militia and Defence, which is respectfully submitted.\n\nI have the honour to be, my Lord,\n\nYour Excellency's most obedient servant,\n\nADOLPHE P. CARON,\nMinister of Militia and Defence.\n\nDepartment of Militia and Defence,\nOttawa, 1st January, 1887.\nContinuation of\n\nAPPENDIX No. 4\n\nto the Special Report of the Department of Militia and Defence, of 18th May, 1886, upon matters in connection with the suppression of the Rebellion in the North-West Territories, in 1885.\n\nMEMORANDUM re remuneration to Edmonton Volunteer Co., St. Albert Mounted Infantry and Scouts, and certain claims from Edmonton district, for supply of beef and hiring of teams, in reply to enquiry from Department of the Secretary of State, No. 3976, on petition of H. W. M'Kenny et al, dated Edmonton, Alberta, 25th January, 1886.\n\n1. There is no claim from the Edmonton Volunteer Co. The petition says the men enlisted in other corps, and engaged to run flat boats down the river with Major General Strange's column. This service was paid for at high rates through the Hudson's Bay Co.\n\n2. The St. Albert Mounted Infantry and Scouts had been paid in full, the cheque having been sent through the Revd. Father Lestane.\n\n3. There is a small pay list of six names for two different services. There is no place designated, nor anything to show where the services were performed, nor where the men live; but they are supposed to be at Edmonton. As men have sometimes been returned in two capacities on same dates, and drawn pay through the Hudson's Bay Co., this has been looked on as a doubtful claim, and so no action taken upon it.\n\n4. Edmonton Home Guard.—Home Guards have not been paid. In this instance the captain drew pay as a supply clerk, at $3.50 per day, and it is understood the men were employed at high rates, building boats for General Strange's column. A copy of the report of the Commission on this case is attached.\n\nTeams were paid $8 per day, up to 1st June, after which the rate was reduced to $6 per day on the Calgary trails, and to $5 per day on the Qu'Appelle and Moose Jaw trails; in both cases teamsters and horses were rationed by the Government.\n\nThe price of beef was calculated on the basis offered by I. G. Baker & Co., at Calgary, at 6 cents per lb., live weight, and about 2 cents additional to drive to Edmonton in herds of about 100 head. Gallagher supplied beef at Battleford (where it is more difficult to procure) at 17 cents per lb. Mr. Strachan reported beef selling at Edmonton, by retail, at from 14 cents to 18 cents per lb., the latter price being for choice cuts.\n\nApproved.—A. P. O., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D. A.G.,\nChairman.\n\nEDMUND B. HOLT, Secretary,\nOTTAWA, 2nd March, 1886.\n\nEXTRACT from Report of the Commission on War Claims dated 5th November, 1885, on W. C. No. 291, Edmonton Home Guard's pay list, $557.24.\n\nIt is observed that the officers and some of the men were in receipt of pay in Supply, Department, and moreover, if this claim were allowed, all of the Home Guard's, similarly organized, including one at Winnipeg, would be entitled to claim pay.\n\nRejected.\nREPORT No. 112.\n\nOTTAWA, 2nd March, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 763.—Letter from Rev. Geo. Lloyd, Penetanguishene, late Chaplain Queen's Own Rifles, asking to have his rank recognized from date of General Orders (24th April, 1885) authorizing the selection of chaplains by the respective corps, and for permanent pension on account of severe injuries received on service.\n\nMr. Lloyd was a graduated-divinity student, fully licensed to read and preach. At the outbreak of the rebellion, on the 28th March, 1885, he volunteered for service in the University Company, and in addition to doing duty as private, by permission of his commanding officer, and the desire of the men, he also discharged the duties of chaplain.\n\nOn reaching Winnipeg, after having been severely wounded at Cut Knife, he was ordained, which goes to show he was fully competent to discharge the duties as contemplated by the General Order referred to, which gives each battalion power to make the selection regardless of qualification.\n\nOfficers of various ranks were appointed by commanding officers as occasion required during the campaign, who were invariably paid from date of appointment, although not qualified or gazetted.\n\nIt therefore appears no more than just and reasonable that the Rev. Mr. Lloyd's appointment should be recognized from the 24th April, 1885, and that he should be paid as chaplain from that date, which is most respectfully recommended; any pay which he may have received while in the discharge of other duties to be deducted.\n\nWith regard to the other questions raised, it is understood the G. O. C. has made recommendations which meet the case.\n\nAs the wound appears much more serious than at first contemplated, it is further most respectfully recommended that the Rev. Mr. Lloyd may be permitted again to go before the medical and military boards, for further examination, after the period for which a gratuity may have been granted shall have expired, with the view of determining whether or not his name should be put upon the permanent pension list.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D.A.G., Chairman,\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 113.\n\nOTTAWA, 13th March, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 236.—North-West Navigation Company. Claim for detention of two steamers and three barges at Grand Rapids, awaiting arrival of troops from Prince\nAlbert, $11,651.50. After having consulted with the General Officer Commanding, the following is respectfully submitted:\n\nThe telegrams sent from Fort Pitt on 22nd June, by Major-General Sir F. Middleton, only asked if the company could have steamers sent him in ten or twelve days (not eight days).\n\nOn the strength of this message William Robinson telegraphed Sir Frederick, at Fort Pitt; on the following day, 23rd, that steamers would meet him in eight days. On the 24th the General asked, from Fort Pitt, if the steamer \"Glendevon\" could not be sent with the other two, which shows that no orders for the transport had then been given.\n\nNotwithstanding this Mr. Robinson hurried off the boats, knowing well that the troops could not reach Grand Rapids for several days after the arrival of the \"Colville\" and \"Princess,\" which shows the anxiety for having the boats placed in commission, with the object, no doubt, of drawing, if possible, a large sum from the Government to make up for a season's business which had been almost, if not altogether, nil. It is believed the usual practice of these boats is to leave Selkirk for Grand Rapids, on being advised by telegram of departure of steamer from Prince Albert, by which (except through stress of weather) close connection is made.\n\nOn July 8th Sir Frederick telegraphed Capt. Robinson, from Prince Albert:—\n\n\"Leave this place at noon; hope to be at Grand Rapids in three days.\" This is the first definite information on which any business man could act. Consequently the boats ought not to have left until this date, which would have given ample time to meet the troops as required.\n\nIt appears, however, the troops did not reach Grand Rapids until the 12th July, one day after that specified by the General, consequently if demurrage is admitted, only one day can be claimed.\n\nThe claim, as originally presented, covering everything connected with the trip, in one lump sum, amounted to about $14,000.\n\nLt.-Col. Whitehead considered this charge excessive, and returned the account, requesting that the items be inserted. The claim was then returned with items, making up the enormous sum of $21,069.\n\nIn this account full first-class fares ($9 each) are charged and allowed for 145 officers, although two-thirds of the number were on the barges with their men, in a very uncomfortable position; and full second-class fares ($5 each) for 1,440 men, although a great part of them were packed in barges as close as sardines. One hundred dollars also was allowed for conveying the wounded from Selkirk to Winnipeg, a distance of about twenty-three miles; also all other claims for damaged bedding, extra passengers, &c.\n\nThe Commission having taken all these circumstances into consideration, and knowing there was no commercial trade during the season for these boats, and further, having been informed by a prominent official of the company that out of the amount already paid by the Government, a profit of about $5,000, or over 100 per cent., had been made on the one trip, considered that the company had been amply, and, in fact, over paid for the service performed.\n\nIt is customary for all transport companies to carry troops for two-thirds the regular rates, which, owing to the large number, pays much better than ordinary traffic. It was therefore, considered by the Commission that by allowing the above liberal rates which have already been paid, no claim for demurrage could be entertained.\n\nReport approved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n(By telegraph from Fort Pitt, 22nd June, via Straubenzee.)\n\nTo Drummond Bros.,\nNorth-West Navigation Company,\nWinnipeg.\n\nI hope to be soon moving troops to Winnipeg by the lake. Can you have steamers to meet them, say in about ten or twelve days from this? Probable number of troops, roughly given, a thousand men and fifty horses. I suppose I must ration the men for the trip?\n\nFRED. MIDDLETON,\nMajor-General.\n\n(Copy of telegraph sent Major-General Middleton.)\n\nWINNIPEG, 23rd June, 1885.\n\nTo Major-General MIDDLETON,\nFort Pitt.\n\nThree barges and two steamers will meet you in 8 days, at Grand Rapids, and await arrival of troops. Would prefer not to board more than 200 men. Reply if this will answer?\n\nWM. ROBINSON,\nGeneral Manager.\n\n(By telegraph from Fort Pitt, 24th June, 1885.)\n\nTo WM. ROBINSON,\nGeneral Manager Navigation Company.\n\nCan you not arrange to have the steamer \"Glendevon,\" as well as your own two and barges? All I want is, that the men may have arrangements for cooking tea, &c. Can you arrange to have the cooking for officers done? Number of officers will be given you in a few days.\n\nFRED. MIDDLETON,\nMajor-General.\n\nREPORT No. 114.\n\nOTTAWA, 26th March, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 749.—Boyd & Crowe, Winnipeg, for conveying 348 officers and men from Saskatchewan Landing to Clark's Crossing, at $20 each—$6,960.\n\nThis firm had a contract for conveying stores by the ton down the river. The Government sent men, lumber and other material required for the construction of temporary or rough scows from Winnipeg to Swift Current by special train, at great expense, for the benefit of this firm. This same material was also transported by teams paid for by the Government, from Swift Current to Saskatchewan Landing.\n\nTen or twelve scows were built in the cheapest possible manner, just sufficiently strong to make one trip and to carry 20 tons each.\n\nThese were loaded with 23 tons each, and were manned by the 7th Battalion, 261 strong (not 348 as stated in claim), who worked the scows down the river. This arrangement was made by Major-General Laurie; and, as the contract had been arranged partly through the Hudson's Bay Co., Mr. Wrigley, the Commissioner, when here a few weeks ago, stated it was understood no charge was to be made for the transport of the men, as they did all the work and went through great hardships in being in the water daily to float the scows, which were almost constantly running aground on account of the loads being largely in excess of their tonnage.\nThis caused great loss to the Government, as the stores had to be frequently thrown overboard or left on the bank, where they were not recovered.\n\nIt was also understood by Maj.-Gen. Laurie that no charge was to be made for the transport of the men, as they were to work their passage.\n\nIt may be mentioned here, that Boyd & Crowe were paid by the ton for the quantity loaded on the scows, regardless of the great shortage when delivered at Clark's Crossing.\n\nThis claim was informally laid before the Commissioners just as they were adjourning.\n\nThey were unanimous in declaring it most unreasonable, and would recommend its rejection in the strongest terms.\n\nReport approved, 29-3-'86.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 115.\n\nOTTAWA, 26th March, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 648.—Boyd & Crowe, Winnipeg, for lumber and material used in constructing two grain shoots at Saskatchewan Landing, $135.25.\n\nThis lumber and material were sent from Winnipeg to Swift Current, for this firm, by special train, with the lumber, &c., used for construction of scows, and by Government teams from Swift Current to Saskatchewan Landing (29 miles by waggon), at great expense to the Government. This firm had a contract to convey freight by the ton from Saskatchewan Landing to Clark's Crossing.\n\nIf these shoots were constructed for the purpose of loading the scows, which is believed to be the case, they cannot be chargeable against the Government. If for other legitimate purposes outside the tonnage contract, the actual value of the articles at Winnipeg, and the cost of labor, could only be recommended after receipt of proper vouchers, as to number of days' work in building the shoots, and value of material at Winnipeg; all of the charges being considered excessively high.\n\nReport approved, 29-3-'86.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 116.\nOTTAWA, 2nd April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 245.—Thomas Hastings, for services as storeman at Red Deer River; balance of claim, $85. This amount having been deducted from his original claim of $247.50.\n\nMr. Alex. McGibbon, who was supply officer at Calgary, states in a letter attached, dated 6th March, 1886, that he engaged Hastings at $3 per day; other men could have been got cheaper, but knowing Hastings to be a reliable man, he was selected.\n\nWhen this claim was considered by the Commission, $3 a day was thought too high, as compared with rate paid other men occupying similar positions in that and other parts of the country, and was cut down accordingly to $2 a day.\n\nMr. McGibbon's letter shows some grounds for the claim, and if too high, that officer is responsible, and not the claimant.\n\nThe Chairman does not feel at liberty to report differently to what was submitted by the Commission, without their consent; but, under the circumstances, it would appear to be a fair case for the favorable consideration of the Honorable the Minister.\n\nPay.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\n121 MANSFIELD STREET,\nMONTREAL, 6th March, 1886.\n\nMY DEAR MR. OGILVIE.—Yours of the 5th instant came duly to hand. Regarding Mr. Hastings' matter, I have to say, that when the Company of the 65th, who had charge of the Red Deer Station, was ordered home, I had to send out a man to take charge of the stores there, and as it was important that a most reliable man be sent, I considered I was particularly fortunate in securing Mr. Hastings, whom I knew to be, and in whom I could place the utmost confidence. Mr. Hastings was getting $3.50 per day from the Canadian Pacific Railway, and I promised him $3.00, which, with rations, would be equal to $3.50. Mr. Hastings went to Red Deer, and fulfilled the duties to my entire satisfaction.\n\nWhen the Commission came to settle claims, Mr. Hastings' account was cut down $1 per day. I explained to Col. Whitehead that I considered he was entitled to the full amount, but it was not allowed. I am of opinion that he is fairly entitled to be paid the extra dollar, and I intended mentioning this to Sir A. P. Caron, but had not an opportunity.\n\nI could have got men to go for two and a half dollars a day, but they probably would have stolen far more than the difference. You know Red Deer is 100 miles from Calgary, and I could not keep supervision unless I had a good man.\n\nI think when the Minister has these facts explained, he will at once put the matter right.\n\nI am, yours very truly,\n\nALEX. MCGIBBON.\n\nREPORT No. 117.\nOTTAWA, 6th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 706.—Donald McLeod, of Edmonton, N.W.T., $100, for 4 carts said to\nhave been taken by the 65th Battalion, at Peace Hills, for the purpose of hauling water and material for barricades.\n\nThere being no officer's certificate to the claim, it was referred to Lieut.-Colonel Ouimet, who submits a report (hereto attached) from Captain L.J. Ethier, who commanded the detachment at Peace Hills, by which it will be seen that two carts only were taken. These were in bad order and required considerable repairing before they could be used, and afterwards frequently broke down, necessitating further repairs which were made by the troops; notwithstanding this care the two carts were quite used up when the detachment left the post.\n\nCaptain Ethier further states that there were some carts behind the house which were claimed and taken away by half-breed freightors; the Indian agent having knowledge of this at the time, it might be naturally inferred that he knew who the owners were. In any case the militia ought not to be held responsible for property taken in this way.\n\nThe sworn evidence of the claimant attached, shows that, although he has been at the Peace Hill farms frequently since the carts were taken, he has not made enquiries or search for those he claims as his property.\n\nCaptain Ethier also says that the price is exorbitant; but it may be inferred from the evidence of McLeod, who is thoroughly acquainted with the value of such articles in that part of the country, that the amount charged is fair for carts in their condition when taken.\n\nIt is therefore respectfully recommended that the sum of $50 be paid for the two making a reduction of $50 on claim.\n\nApproved—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nOTTAWA, 3rd April, 1886.\n\nDeposition of Donald McLeod, of Edmonton, Freighter:\n\nI had the carts at Government Farm, Peace Hills: there were thirteen of them altogether; I saw three of them in possession of the 65th, at Peace Hills forty miles from Edmonton. They were used to haul earth to make barricades, and haul water; the officer in command there paid me $30 for one cart, independent of this lot; they paid me for this cart and a horse they took at Battle River, by a voucher which I got cashed by the Hudson's Bay Company; the 4th cart, the box had been broken up, and the wheels were afterwards smashed; the barricades were erected on the Government Farm, at Peace Hills; I made a demand for the carts when I saw them in use, and was positively refused; I have passed the place frequently, and saw nothing of the carts, and made no inquiry about them; they were all iron-bound carts, and cost $35 on the line of railway. I purchased them in 1883.\n\nJ. O. Kilebhl, who made the affidavit on my claim, was a clerk in the Indian Department, at Peace Hills, and in charge at the time.\n\nDONALD McLEOD.\n\nOn Claim of D. McLeod.\n\nHOUSE OF COMMONS, CANADA,\nOTTAWA, 5th April, 1886.\n\nMR. EDMUND B. HOLT,\nSecretary Commission on War Claims.\n\nDEAR SIR,—According to your request I have asked for a report from Captain Ethier, who was in command of the post at Peace Hill, and I have now the honor to transmit herein his said report.\n\nTruly yours,\n\nJ. A. OUIMET.\n\nMONTREAL, 31st March, 1886.\n\nTo Lieutenant-Colonel Ouimet,\nCommanding 65th Battalion, M.R.R.\n\nI have just received your letter enclosing an account from Mr. Donald McLeod, of Edmonton, for the sum of one hundred dollars, for the use of four carts by the detachment of the 65th Battalion in garrison at Peace Hill Government Farm, North-West Territory, during the last rebellion. In reply I have the honor to submit you the following report:\n\nOn arriving at Peace Hill, I found there in the camp, behind the hills, a certain number of carts,\nsuch as are used on the prairie, all more or less used, the proprietors of which were unknown even to the Indian Agent. I had to use two of these carts which I have repaired the best I could, one to carry water from the river, the other to carry earth to make fortifications for the fort. I must say that at the end of the campaign, these two carts, in spite of being repaired very often, were of very little use on account of frequent breaking; one of them could not be used at all. The others were claimed by half-breed freighters, who have declared through the Indian Agent to be the proprietors and have authority to take them, and the agent did not object. A man whom I believe to be Mr. McLeod, afterwards came to claim the four carts in question. I told him the above facts; I had no objection to sign for him a requisition, as Commanding officer, for the two old carts which we were still using—the price claimed is certainly exorbitant, because the carts were very much worn when we took them. I am surprised that Joseph Killdell, alias \"Big Joe,\" had signed and approved this account, when all the facts above mentioned were known to him. I did not know that this affair had ever been settled. These few observations will be sufficient, I think, for you to value with justice the indemnity which Mr. Donald McLeod ought to have.\n\nLEANDRE JOS. ETHIER, Captain,\nCommanding Detachment 65th Battalion,\nAt Peace Hills, North-West Territories.\n\nREPORT No. 118.\nOTTAWA, 13th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 762.—Lyman, Sons & Co., of Montreal, $319.41 for medicines supplied Montreal Garrison Artillery; $21.53 for articles furnished the Field Hospital Corps, total, $340.94. These claims are accompanied with voluminous correspondence, all of which go to show that the articles were actually delivered, and the balances left, after close of the rebellion, turned into Government stores. It is therefore respectfully recommended that the amount be paid in full.\n\nW. C. No. 715.—James Collinge, M. D., Fort Qu'Appelle, $25, for attendance and medicines supplied Pte. Gayfer, 91st Battalion.\n\nOn 22nd July, 1885, when the 91st, or Lt.-Col. Scott's Battalion, left Fort Qu'Appelle to return to Winnipeg, Pte. Gayfer, who was suffering from an attack of sunstroke, and confined to bed, had to be left behind.\n\nDr. Seymour, the Surgeon, arranged with Dr. Collinge to take charge of the patient, whom the latter attended up to 11th August, after which Gayfer returned to Winnipeg, where he continued on the sick list until he was sent to Montreal. The latter facts are well known to the Commission. The account is certified by Lt.-Col. Scott, and the charge is exceedingly reasonable. It is therefore respectfully recommended for payment in full.\n\nReport approved.—15-4-'86—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 119.\nOTTAWA, 13th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW.C. No. 779.—M. M. & D., A. 3,427 and 2,303.—Claims of troopers of Governor General's Body Guards for injuries, &c., to horses on service:\n\nNo. 1.—Trooper Daniel O'Connell, for injury to horse, $50.\nNo. 2.—Trooper Geo. C. Pearsall, for injury to horse received on the cars when returning from the North-West, $35.\n\nNo. 3.—Trooper D. McIntyre, for horse, died from injuries received while returning from the North-West, by cars running off the track, $125.\n\nA Board was assembled in the usual way, by Lt. Col. Denison, Commanding the Corps; evidence was taken, and payment of the above sums recommended in full.\n\nAs the officers who composed the Board are of undoubted high character, and fully acquainted with the value of horses, there appears to be no doubt of the justness of the several claims.\n\nIt is, therefore, respectfully recommended that the first two claims be paid in full, and the third be reduced to $100, that being the limit allowed for a trooper's horse by R. and O., making a reduction of $25 on this latter claim. It is further recommended that the cheques be sent through the Officer Commanding the corps, to ensure the receipt of the money by the owners of the horses.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 120.\n\nOTTAWA, 15th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 761.—M. M. and D., A. 3,311.—A. J. Horsey, M.D., Surgeon late Midland Battalion, $80, for a horse lost or stolen when the Corps was at Prince Albert.\n\nA Board was assembled in the usual way, on the 23rd May, 1885. Proceedings attached to claim.\n\nThe evidence shows that the usual precautions were taken for the safety of the horse, and after he was missed diligent search was made, and a reward offered for his return, both of which proved fruitless.\n\nAfter considering the evidence, the Board recommends the payment of the claim, as being a reasonable one. The proceedings and papers show that everything has been done in accordance with R. and O., and as $80 is a reasonable price for an officer's charger, it is respectfully recommended that the claim be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 121.\nOTTAWA, 15th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT:\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 799.—M. M. & D., A. 3,355.—Corporal Thomas, No. 3 Company, Winnipeg Light Infantry.\n\nI remember a man whose name I have forgotten, and Thomas is presumed to be the one having presented himself, showing his pass and applying for a requisition to return to Calgary.\n\nAs soldiers on leave are not entitled to travel at Government expense, a requisition could not be granted. The man referred to stated he had paid $35, fare from Calgary to Winnipeg, and had no money to pay for the return trip; that his wife had sufficiently recovered to allow him to rejoin his Corps, which he was anxious to do, but for the want of means, as before stated, was unable to do so. As he appeared perfectly honest and straightforward, I extended his pass from time to time. The Corps having in the meantime proceeded north, when communication was almost impossible, and the expense of one man rejoining would have been very great, with no certainty of finding the Corps, which was almost constantly on the move; under these circumstances, it was only fair the man's pass should have been extended from time to time, to prevent him from being considered a deserter. It was for this purpose he occasionally called at the Brigade Office, and for no other, neither was he in daily attendance.\n\nIf this is the same man, I think he should be paid up to the time his pass was extended.\n\nAfter that, I frequently saw him working in different parts of the city. As he would have been entitled to return trip had he continued with his Corps, I think it would not be unreasonable to pay him back the $35 paid for conveyance from Calgary to Winnipeg. Should there be a balance left in the hands of the Paymaster, after paying those sums, it should be returned to the Government, with report showing the transaction in detail.\n\nIt may be further stated this man appears justly entitled to the land grant same as other active militiamen.\n\nAll of which is respectfully submitted.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 122.\nOTTAWA, 16th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 760.—M. M. & D., A 3,308—Wm. Barnes, near Fort Qu'Appelle, $51 for care of sick horse left with him, by order of Lieut.-Col. Denison, Commanding Governor General's Body Guard.\nIt appears this horse was unfit to travel when the corps left that part of the country to proceed to Humboldt, consequently he was left with Barnes for safekeeping and such attendance as the horse might require; but, as rest was the principal thing needed, Col. Denison presumes he was simply on grass during the period of about five weeks.\n\nWhen Trooper Chadwick went for the horse he found Barnes working him; consequently it is presumed the horse was worked more or less during the whole period. The account of $51 was sent to Lieut.-Col. Denison, who considered it exorbitant, and informed Barnes if he would send a reasonable claim, payment would be recommended. The claim, however, was sent direct to the Commission, who referred it to Col. Denison for report, which is herewith attached, the payment of $25 or $30 being considered as ample.\n\nIt is therefore most respectfully recommended that $30 be paid in full of claim, making a reduction of $21.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nHEWDON VILLA,\nTORONTO, 4th August, 1885.\n\nMr. Wm. Barnes,\n\nDear Sir,—I received your letter here. I did not certify to your bill for care of Chadwick's horse, as I thought the amount too much, considering that most of the time all the horse wanted was pasture, and that you were using the horse for your own purposes. If you send me an account for a reasonable amount, that I would be justified in recommending to the Government for payment, I will certify to it and return it, and the Paymaster will pay it. Please send it in duplicate.\n\nYours truly,\n\nGEORGE T. DENISON,\nLieutenant-Colonel.\n\nWAR CLAIMS COMMISSION,\nOTTAWA, 27th February, 1886.\n\nLt.-Col. Geo. T. Denison,\nCommanding Governor General's Body Guard,\nToronto.\n\nSir,—Application has been made to the Commission by a Mr. T. D. Jackson, of Fort Qu'Appelle, regarding fate of a claim of one Wm. Barnes, for care and keep of a sick horse of Trooper Chadwick, $51, made up as follows:\n\n- 8 weeks at $5 per week ................................................................. $40\n- Paid to veterinary surgeon .................................................................. 8\n- Medicine ......................................................................................... 3\n\nThe correspondence shows that the bill for this service was sent to you by Mr. Barnes, and you declined to certify to it, as you considered the charges excessive. Will you be good enough to forward the said bill here with any remarks you think well to make upon it, and also state if the horse was left with Barnes, or did Trooper Chadwick get possession of it, and if so, what has become of the horse.\n\nAn early reply is requested.\n\nI have, &c.,\n\nEDMUND B. HOLT,\nSecretary.\n\nSir,—In reply to above I enclose the demand made upon me by Mr. Barnes. The horse gave out with Chadwick, at Barnes', and was left behind while Chadwick moved on with the Corps to Humboldt, 160 miles distant. I had no means of sending for it for about eight weeks, and when Chadwick was sent for it, he found Barnes was using it for his own purposes. As the horse only wanted pasture for most of the time, and was used by Mr. Barnes, I thought the charge excessive. I would have certified a bill of $25 or $30 for his trouble and expense. The horse came home with us.\n\nGEORGE T. DENISON, Lieutenant-Colonel,\nCommanding G. G. Body Guard.\nREPORT No. 123.\n\nOTTAWA, 16th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. Nos. 537 and 581.—John Ross, jun., for loss of horses and mules and freighting supplies. Reported upon on 2nd December, 1885, but by order of the Honorable the Minister of Militia, the papers and contract were submitted to the Honorable the Minister of Justice, for an opinion as to the liability of the Government for the several claims. By this legal opinion (copy attached) it appears that the contract is different from those entered into by the Hudson’s Bay Company for other similar services; and under the terms of this contract, the Government is liable for horses or mules ordered to be shot or dying from disease contracted from insufficient food or overwork. In the report of 2nd December, these items for dead horses and mules were rejected. Boards of officers were appointed in the usual way, and their reports which are attached, recommend payment as follows:\n\n| Item                  | Amount |\n|-----------------------|--------|\n| For 1 bay horse       | $200   |\n| 1 black mule          | 200    |\n| 1 do                  | 250    |\n| 1 pair of mules       | 450    |\n| 1 do                  | 400    |\n| 1 do                  | 450    |\n\nTotal...........................................$1,950\n\nAs the officers who composed the Board had a knowledge of the country, it is supposed that the values placed on the animals are correct. The amounts are, therefore, respectfully recommended for payment.\n\nThe Honorable the Minister of Justice also decides the contract was cancelled as shown by Mr. McGibbon’s report. A reduction in the price of teams was made on or about 1st June, when the contractors and teamsters were told they could either continue at the reduced rate of $5 for 2 horse and $9 for 4 horse teams per day, or take their discharge.\n\nMr. Ross agreed to the reduction, and was paid for the service through the Hudson’s Bay Company, consequently no further payment can be recommended on this item.\n\nAs to the claim for transport of stock by rail, the contract makes no provision for such a charge, which could not be recommended by the Commission.\n\nThe sum of $1,928 having been paid already, in connection with these claims, it is now most respectfully recommended that $1,950, as detailed above, be paid in full settlement of all claims arising out of this contract.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nOTTAWA, 7th March, 1886.\n\nSir,—With reference to previous correspondence on the subject of the contract with Mr. Ross, for the supply of teams, &c., dated 27th April, 1885, and the liability of the Government thereunder, to pay for dead horses and mules, I have the honor to report:\n\nThe clause of the contract governing the liability of the Government, in respect of such losses, is as follows:—\"The Government to assume all risks incurred, and to pay for all loss and damage sustained, ordinary wear and tear excepted.\" In my opinion this contract is clearly distinguishable from that entered into with Messrs. Armit & Kelly, through the Hudson's Bay Company, with respect to which an opinion was given by the Deputy Minister of Justice on the 23rd January last.\n\nThere is in the present case a distinct assumption, by the Government, of all risks and liability for loss and damage, \"ordinary wear and tear excepted.\"\n\nI am, therefore, of opinion that the Government, under the terms of the contract, would be liable for horses and mules ordered to be shot or dying from disease contracted from insufficient food or overwork.\n\nThere is another point not mentioned in the reference, but as to which Mr. Ferguson, who acts for Mr. Ross, asks for a decision in his letter to the Minister of Militia and Defence, dated the 1st ultimo, which is with the papers, viz.:—It is claimed by Mr. Ross that the written contract, being a continuing one, terminable by notice in writing, he is entitled to full rates thereunder, until such written notice of termination be given. That this is the proper construction of the terms of the contract, there can be no doubt. I see, however, that it is stated by Major McGibbon, that Mr. Ross agreed to a reduction of rates. That is, of course, a question of fact. Major McGibbon's report would, in my opinion, show that another agreement was substituted for the written contract, and Mr. Ross could only claim the rates under the latter agreement.\n\nI return all papers connected with Mr. Ross' claim; also a copy of the contract with Armit & Kelly.\n\nI have, &c.,\n\nA. POWER,\nfor the Deputy Minister of Justice.\n\nWINNIPEG, 17th November, 1885.\n\nSir,—With reference to the claim of John Ross, I beg to report as under:\n\nClaim No. 1.—The amount for dead animals, I notice, Mr. Ross has reduced from $2,700 (which he formerly claimed) to $2,000. The evidence in these cases are attached to the documents I sent down, but I have no personal knowledge of them.\n\nThe amount of $1,928 for teaming. I can find no entry in the books of these teams going out, and no report of any kind, unless an entry made by Captain Hamilton, on his return from the front, which was irregular, as stated in my note attached.\n\nClaim No. 2.—The first item in this claim is $5,208 for teaming. The amount of teaming on this occasion was $3,224, for which Mr. Ross got a voucher, and was paid at Hudson Bay Company. This was according to my agreement with Mr. Ross, at $9 and $6 a day. Mr. Ross now claims $12 and $8, as per contracts. But I distinctly told him that if he loaded, it must be on the reduced rate, viz., $6 and $9. This was accepted by him. His teams were loaded accordingly; and on their return Mr. Ross was paid in full, as before stated, $3,024.\n\nThe second item of $2,025, for transporting stock from the mountains, is a new one. I never heard of this before. I don't see that the contract provides for any such expense, and it certainly should not be entertained.\n\nThe difference of extra pay, therefore, between $5,208 and $3,024 on teaming in claim No. 2, is $2,184.00\n\nAnd the amount for transporting stock, as above, $2,025.00\n\n$4,209.00\n\nMr. Ross has no claim.\n\nThe amount for dead stock................................................................. $2,000.00\n\nAnd the amount for teaming, as per claim No. 1........................................... $1,928.00\n\nonly remain for the Commission to deal with. As regards the teams, Mr. Ross must furnish evidence. There is no entry of their having gone out on the dates mentioned, although the other teams which Mr. Ross got settled for are regularly registered in the books.\n\nALEX. McGIBBON,\n\nTo Lt.-Col. WHITEHEAD,\nWinnipeg.\nMemorandum of Captain Ross' Teams:\n\n| Date       | Single | Double |\n|------------|--------|--------|\n| April 23, 1885 | 32     | 1      |\n| May 2, 1885   | 11     | 3      |\n| Total        | 43     | 4      |\n\nVouchers granted and paid for single: 43\nDouble: 4\n\nTotal: 47\n\nWhen the above teams returned they were dismissed excepting:\n(4) Four double teams Returned 3rd June.\n(12) Twelve single do do do\n(3) Three single do do do 30th June.\n\nThese were returned at the reduced prices, viz., $6 and $9, and limited to 24 days to make the trips, voucher for which service was granted and paid, amounting to $3,024, but which Mr. Ross wishes now to claim $5,208, as per his original contract, but which he is not entitled to, as he was distinctly told that loads were only given at the reduced rate. Mr. Ross objected at the time, but after waiting three or four days, he finally accepted my terms.\n\nALEX. McGIBBON,\nT. & S. O.\n\nTo Lieut.-Colonel WHITEHEAD,\n&c., &c., &c.\n\nProceedings of a Court of Enquiry, held on the 13th July, 1885, to enquire into the case of two mules and one horse, the property of John Ross, dead on service.\n\nH. F. SMITH.—I am waggon master for John Ross, who owns the animals in question; they started on Government service from Calgary, about 27th April last, in good condition and health; at Red Deer River, through forced marches and exposure to snow storm; one of them, a black mule, contracted sickness; it is since dead; the value of this animal was $200.\n\nAt Fort Pitt, a bay mare died from distemper, contracted at Frog Lake, through wet, exposure and forced marches. She was worth $225.\n\nAt Peace Hills, a black mule was abandoned unfit to proceed further through foot disease, contracted through wet, exposure and forced marches; value, $250.\n\nThe Board having considered the above evidence, and having all personal knowledge of the circumstances under which they were disabled, are of the opinion that the animals should be paid for at the following rates, viz.:\n\nOne bay horse .......................................................... $200.00\nOne black mule .......................................................... 200.00\nOne black mule .......................................................... 250.00\n\nG. W. HATTON,\nMajor, President.\n\nJ. K. OSWALD,\nCapt. and Adjt.\n\nJOHN D. LAUDER,\nLieut.\n\nApproved.\nE. B. STEEL,\nMajor Commanding Column.\n\nCorrect.\nH. HAMILTON,\nCapt. S. O.\n\nProceedings of a Board of Enquiry, held at Calgary, N.-W. T., on 20th July, 1885, to enquire into the loss of one team of mules, the property of Captain John Ross, said mules being employed on Colonel Osborne Smith's column.\n\nEvidence of Captain John Ross:\nI am the owner of the mules in question; on or about the 2nd June, while the mules were being driven in Col. Osborne Smith's column, they contracted disease which appeared to be \"farcy,\" through exposure to wet and overwork; Colonel Osborne Smith ordered them to be sent back to Calgary, and\nI received them here myself; having to go back to the mountains I left them in the charge of Chief of Police John Ingram, there being no military officers in Calgary at the time. The value of the team was $400, and they were in good order and health when engaged by Government.\n\nJOHN ROSS.\n\nEvidence of Chief of Police INGRAM:—\nThe mules in question were handed over to me by Captain John Ross, about the first week in June; I had them examined by V. S. Scott, and he reported that they had contracted \"farcy,\" and were so sick that he did not think they would recover; fearing infection to other stock, I ordered them to be shot, which was done.\n\nJOHN S. INGRAM,\nChief of Police.\n\nEvidence of EDWARD MORRISON:—\nI was the teamster engaged by Capt. John Ross to drive the team of mules in question; when I left Calgary with them, attached to Colonel Osborne Smith's column, they were in good condition and health; about two days before arriving at the Red Deer River they commenced to get sick and could not work, owing to exposure, cold from wet and over work; I had to carry troops over sloughs repeatedly, and the mules caught severe cold on that account; I was ordered by Col. Osborne Smith to take the mules back to Calgary; on arrival at Calgary I reported to Captain John Ross, the owner, and he instructed me to hand them over to John Ingram, Chief of Police; the mules were in such a state that they could not recover; they would not eat or drink; their necks and joints were all rotted away and swollen, and they could barely draw the empty waggon as far as Calgary; I am satisfied they could not have lived.\n\nE. MORRISON,\nTeamster.\n\nThe Board having made enquiry into the loss of the mules in question, believe the facts, as stated, to be correct. They consider that the owner is entitled to the value of the team, viz., $400.\n\nG. W. HATTON,\nMajor and President.\n\nJ. K. OSWALD,\nCapt. and Adjt. Cavalry.\n\nJOHN D. LAUDER,\nLieutenant.\n\nApproved.\nA. B. STEEL,\nMajor Commanding.\nCorrect.\nH. HAMILTON,\nCaptain and S. O.\n\nProceedings of a Board of Enquiry, held at Calgary, N. W. T., on 25th July, 1885, to enquire into the loss of mules, the property of Captain John Ross, said mules being employed on Colonel Osborne Smith's column.\n\nEvidence of H. SMITH, waggon master:\nOn the 27th day of April, the mules in question left Calgary with Colonel Osborne Smith's column; they were then in good order and health; at Red Deer River, while hauling Major Hatton's baggage, they were taken sick, from exposure, and ordered to be left there; since then both mules have died; the disease they contracted was \"farcy;\" I consider the team value for $450; the teamster was Charles Sheeper.\n\nI hereby corroborate the above evidence.\n\nH. SMITH.\n\nCHARLES SHEEPER,\nTeamster.\n\nThe Board having made careful enquiry into the loss of the mules in question, and two of their number having a personal knowledge of the facts, consider that the owner is entitled to the full value of the team, viz., $450.\n\nGEO. W. HATTON, Major,\nPresident.\n\nJ. K. OSWALD,\nCapt. and Adjutant Cavalry.\n\nJOHN D. LAUDER,\nLieutenant.\n\nApproved.\nS. B. STEEL,\nMajor Commanding.\nCorrect.\nH. HAMILTON,\nCapt. and S. O.\nProceedings of a Board of Enquiry, held at Calgary, N.W.T., on 20th July, 1885, to enquire into the loss of one team of mules, the property of Captain John Ross, said mules being employed on Captain Dudley Smith's column (supposed to be a convoy) A.F.F.\n\nEvidence of O. G. Dennis, Supply Officer:\nOn the 7th day of May, the mules in question left Calgary, with Captain Dudley Smith's column (supposed to be a convoy); they were in good order and health; owing to exposure to wet, over-work, and pulling through muskegs, one mule died at the Lone Pine, the other died between the Lone Pine and Scarlett's, on the march back; I consider the team valued at $450; I was in charge of the column (supposed to be a convoy) and saw the mules from time to time.\n\nO. G. DENNIS,\nSupply Officer in charge.\n\nThe Board having made careful enquiry into the loss of the mules in question, and knowing the facts, as stated, to be correct, considers that the owner is entitled to the value of the team, viz., $450.00.\n\nGEO. W. HATTON, Major,\nPresident.\n\nJ. K. OSWALD,\nCaptain and Adjutant Cavalry.\n\nJOHN D. LAUDER,\nLieutenant.\n\nApproved.\nS. B. STEELE,\nMajor Commanding.\n\nCorrect.\nH. HAMILTON,\nCaptain and S. O.\n\nI, John Ross, contractor, of British Columbia, hereby declare that I was the owner of nine head of stock, the same having been produced before a Board of Officers from time to time; I contracted with the Government to place my teams on the line of march, and through exposure and over work, the above number died and were lost to me; the values stated are under the cost of purchase.\n\nJOHN ROSS.\n\nDeclared before me, this 25th day of July, A.D. 1885.\n\nJ. K. OSWALD,\nJ.P.\n\nCertified,\nH. HAMILTON,\nCaptain and S. O.\n\nREPORT No. 124.\nOTTAWA, 17th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nSUPPLEMENTARY REPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nWith reference to the following claims of contractors for balances due on teams furnished the transport service, viz.:\n\nW. C. 255.—B. C. Corbett; W. C. 380.—Jas. H. Ross and Thos. Bull; W. C. 402.—D. McGregor, W. R. Robertson, D. H. Gillespie and J. G. Turiff, recommended for payment in Report of 28th January last (hereto attached), it may be further explained:\n\nThat S. L. Bedson, Transport Officer, with Major General Middleton, telegraphed to W. R. Bell, Transport Officer, Qu'Apelle, on or about 8th April, 1885, to engage teams, but not to pay more than $8 per day. On the strength of this telegram Bell engaged teams of horses at $8, and ox teams at $6 per day, from the above named parties, stipulating that they were not to pay the owners of the teams less than $7 for horse and $5 for ox teams (vide Bell's sworn evidence, 17th November, 1885) allowing a profit $1 per day per team to the contractors.\n\n(Bell's evidence vide page 226, Report upon the Suppression of the Rebellion in the North-West Territories, 1885.)\nThe whole of these claims are certified correct and recommended for payment by Bell for Bedson. On examining the accounts closely, however, it has been discovered that several of the claimants have hired teams at a lower rate than authorized by Bell, consequently it would be but fair that the Government should receive the benefit of this reduction by limiting the claimants to $1 per day profit on each team. Many clerical errors have also been discovered in auditing the several accounts. The following amounts being correct, in accordance with the adjustment:\n\nB. C. Corbett, per Chas. H. Newton ........................................... $ 412.00\nJas. H. Ross .................................................................................. 1,577.00\nThos. Bull, per J. W. Smith, Assignee ............................................. 6.00\nDavid McGregor ............................................................................... 45.00\nW. R. Robertson .............................................................................. 3,113.00\nD. H. Gillespie, per T. G. Smith, Attorney ....................................... 2,618.00\nJ. G. Tariff ....................................................................................... 256.00\n\n$ 13,156.50\n\nMaking a total reduction from the original claims of $1,923.25.\n\nWhen the Commissioners made their report on these claims the errors referred to had not been discovered, otherwise, no doubt, a similar reduction would have been recommended.\n\nIn order to make sure as to the legality of these claims, the Chairman submitted the question to Aikens, Culver & Hamilton, barristers, &c., of Winnipeg; and by direction of the Honorable the Minister of Militia, the same question was submitted to the Honorable the Minister of Justice here. Both of the opinions are attached, by which there appears to be no doubt that the claimants are entitled to payment, which is now most respectfully recommended in accordance with the respective amounts as shown above.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nDEPARTMENT OF JUSTICE, CANADA,\nOTTAWA, 6th April, 1886.\n\nSir,—With reference to your letter of the 17th February, asking to be advised as to the legality of the claim of D. H. Gillespie, under the circumstance mentioned in your letter, I have to report:—\n\nI understand from the reference that Mr. Bell was authorized by Mr. Bedson, Chief Transport Officer, to engage teams at a price not to exceed $8 per day; that Mr. Bell, in his turn, instructed Gillespie and others to hire teams from third parties in no case at less than $7 per day; the middle men under no circumstances to receive more than $1 per day on each team. I understand the reference not as calling for an opinion as to Mr. Bell's liability for his conduct in the matter, but simply as to the validity of the claim of the middle men.\n\nI have the honor to say that in my opinion, unless collusion could be clearly established against Gillespie and the other middle men, the facts, as stated, afford no legal grounds for rejecting their claims.\n\nA. POWER,\nFor Deputy Minister of Justice.\n\nWINNIPEG, 5th December, 1885.\n\nLieutenant-Colonel JACKSON,\nChairman of Commission,\nWinnipeg, Man.\n\nDear Sir,—We have a further memo., herein, in which you state that Mr. Bedson (who was the duly appointed agent for that purpose) authorized Major Bell to engage teams for transport service. That Bell accordingly agreed with McGregor and others that he would pay them $8 per day for teams\nwhich, at his request, they were to provide. He also stipulated that they should pay not less for teams of others which they might employ, than $7 a day. That is, the middle men were not to make more than $1 per day on the teams of other persons.\n\nIf there was a direct bond fide contract between the Government, acting by Bell, and McGregor and others, that they should furnish teams for which the Government should pay $8 per day, and they did furnish the teams, then the contractors should be paid.\n\nThe latter part of the arrangement is somewhat unaccountable.\n\nWe are, &c.,\n\nAIKENS, OULVER & HAMILTON.\n\nREPORT No. 125.\n\nOTTAWA, 20th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 780.—M. M. & D., A. 2,224.—J. Eakins, M. D., $67 for medically examining 67 men of the 15th Battalion, at Belleville, previous to their joining the Midland Battalion for active service, in compliance with regimental orders issued by Lieut.-Col. Henderson, on 29th March, 1886, and certified by Lieut.-Col. Lazier, in accordance with Regulations and Orders, paragraph 676. It appears, however, by the list of names attached, only 57 officers and men were examined. It is therefore respectfully recommended $10 be deducted, and the balance, $57, paid.\n\nW. C. No. 782.—M. M. & D., A. 3,458.—Peter Ballandine, Battleford, for transport of stores for \"A\" Battery, $137.41 on a requisition given by Major F. C. Wilson, and certified by the Deputy Adjutant-General of the district. The claim appears to be in accordance with the agreement, and as Peter Ballandine has since died, it is respectfully recommended the claim be paid in full to the legal representative or representatives of the estate.\n\nW. C. No. 789.—M. M. & D., A. 2,167.—Capt. C. W. Drury, \"A\" Battery, $225, for a horse injured on service in the North-West, and rendered unserviceable. A Board was assembled, according to regulations, at Battleford, on 30th May, 1885, and the amount now claimed recommended. There appears no doubt this was an excellent and valuable charger, and probably worth the price claimed; but, as the value of officers' chargers is established by Regulations and Orders, paragraph 1,004, it is respectfully recommended $125 be paid, making a reduction of $100.\n\nW. C. No. 784.—M. M. & D., A. 3,546.—Canadian Pacific Railway Telegraph Company, $64.81, for telegraphing in Manitoba and the North-West, during the month of November, 1885. This account having been examined, there appears no doubt of its correctness. It is therefore respectfully recommended for payment in full.\n\nW. C. No. 795.—M. M. & D., A. 3,559.—H. Workman, of Lindsay, Ont., $5 for horse hire in connection with calling out Capt. Hunter's Company, the quota of the 45th Battalion, to complete the Midland Battalion for active service. This claim is certified by Lieut.-Col. Deacon, and as the charges appear reasonable and the service necessary, it is respectfully recommended the claim be paid in full.\n\nW. C. No. 797.—M. M. & D., A. 2,675.—G. H. Campbell, Agent Canadian Pacific Railway, Winnipeg, $34.80 for tickets said to have been issued to H. McCleneghan and C. C. McNab, telegraph operators, and W. McLimont, line-repairer, from Winnipeg to Qu'Appelle.\n\nThese three men were in Government employ west and north of Qu'Appelle, and were entitled to transport; but a requisition was issued and used by C. C. McNab, on 13th April, 1885, the date on which this claim is made; and the amount of\nthis fare is charged in Canadian Pacific Railway account, but no requisition appears to have been issued for the other two. It is therefore most respectfully recommended the claim for McNab's ticket, $11.60, be deducted, and the balance, $23.20, paid.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 126.\n\nOTTAWA, 21st April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 759.—Winnipeg and Western Transportation Company, fare and meals for W. R. Pringle, of the Field Hospital Corps (who was wounded), from Prince Albert to Grand Rapids, $25.50.\n\nFare and meals for Mrs. Dobbs and three children (widow of Arthur Dobbs who was killed in action), from Prince Albert to Grand Rapids, $51. Making the total claim $76.50.\n\nW. R. Pringle was entitled to his return transport, and the Honorable The Minister of Militia, had telegraphed that Mrs. Dobbs and family were to be returned to their friends in Ontario. It is therefore respectfully recommended the claim be paid in full.\n\nW. C. No. 784.—M. M. & D., A 2,714.—No. 1, Major J. Fraser, $122; No. 2, Sergeant A. Touby, $30.50, extra pay for services.\n\nWhen the force was ordered out for active service, March, 1885, the Deputy Adjutant-General, at Kingston, had no Brigade Major or Sergeant to assist in discharging the duties, which were very considerable during the organization of the Midland Battalion; and while the Fort and other works at Kingston were garrisoned by Companies of Militia, the Deputy Adjutant-General, finding it absolutely necessary to have assistance, appointed Major J. Fraser to act as Brigado Major, and Sergeant A. Touby to act as Brigade Clerk.\n\nHe testifies to the valuable services rendered, and strongly recommends payment of $1 per day to Major Fraser, and 25 cents per day to Sergeant Touby. As the sums are extremely reasonable for the arduous duties performed, it is respectfully recommended the respective claims be paid in full.\n\nW. C. No. 787.—Lieut.-Colonel Deacon, Major of the late Midland Battalion, $100, for a horse lost while on service in the North West. By order of Major General Middleton, under date of 29th June, 1885, a Board was assembled at Fort Pitt, on the 30th June, to inquire into and take evidence in the matter.\n\nThe proceedings appear to be regular, and there being no doubt as to the facts set forth, the loss does not appear to have occurred through any negligence of the claimant, who made extended search and offered a reward for the recovery; and, having heard the statement of Lieut.-Colonel Smith, who succeeded to the command of the corps after the decease of Lieut.-Colonel Williams, there appears no doubt the claim is a just one. It is therefore respectfully recommended the sum of $100 be paid in full.\n\nW. C. No. 781.—A. McDonald, of Winnipeg, $5.50, for one pair of boots purchased from Murray Hayne, of Prince Albert, for Trooper John B. Ormsby, of Boulton's Mounted Infantry.\nMajor Boulton certifies to the correctness of the claim, which has been endorsed over to A. McDonald, and explains that this man was enlisted at Prince Albert, where the issue of boots was a necessity. It is therefore respectfully recommended the claim be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 127.\n\nOTTAWA, 27th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 54.—Geo. Murdock, of Calgary, $150.50, for belts and rifle slings supplied to \"Steele's Scouts.\"\n\nIt appears by the correspondence, after the return of the troops these stores were handed over to the Government Auctioneer, at Calgary, and sold; the arms were supplied this corps by the Government, the belts and slings being necessary to make them complete. It is therefore respectfully recommended the claim be paid in full.\n\nW. C. No. 115.—Trooper W. R. Hunt, of \"Steele's Scouts,\" $125, for one horse taken over at Fort Pitt by Veterinary Surgeon Duncan, on behalf of the Government, by order of Major-General Middleton, and according to a certificate by Sergeant A. E. C. McDonell, N. W. M.P., sold by auction on Government account at Battleford.\n\nOwing to deficiencies in the papers, considerable correspondence has taken place regarding this claim. The proceedings of a Board with evidence are attached, and letters from Major-General Strange, Captain Oswald, and others, appear to leave no doubt the horse was taken over on Government account; Hunt's evidence shows he paid $0.00 for the animal, but thinks it was worth $25 more after having been broken. The Regulations and Orders allow only $100 to be paid for a trooper's horse, consequently it is respectfully recommended that sum be paid, making a reduction of $25 on the claim.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nMOOSE JAW, N.W.T. OF CANADA,\n7th April, 1886.\n\nTo the Chairman,\n\nWar Claims Commission,\nOttawa.\n\nSir,—I have the honor to report for your information as follows:—At Fort Pitt, on 29th June, 1885, by order of Major-General Middleton, I received possession of four disabled horses, the property of Steele's Scouts, the animals being unable to go forward. On the 25th August, succeeding, these horses were sold at public auction at Battleford, by order of Lieut.-Col. Otter, a sorrel gelding, the former property of W. R. Hunt, realizing $55.50.\n\nI have the honor to be, Sir,\nYour obedient servant,\n\nJOHN A. DUNCAN, M.D., V.S.,\nLate Veterinary Surgeon to Forces.\nREPORT No. 128.\n\nOTTAWA, 27th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 357.—No. 12, Manitoba Cartage and Wharf Company, $975, for horses said to have died while employed transporting supplies under contract with the Hudson's Bay Company.\n\nThis, with many other similar claims, were fully considered by the Commission, on the 15th October, 1885, and rejected subsequently by order of the Hon. the Minister of Militia and Defence. The contract and papers were referred to the Hon. the Minister of Justice, whose opinion confirmed the correctness of the action of the Commission, by deciding the Government is not responsible, under the contract, for dead horses; consequently no further recommendations can be made in this case.\n\nReport approved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 129.\n\nOTTAWA, 27th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 685.—J. A. Pelley, of Winnipeg, $250, for a tent sent to Red Rock, by order of the Acting Mayor of Port Arthur; and it is stated the tent was used as a stable by teamsters.\n\nNo military authority has been produced for the issue.\n\nThe Canadian Pacific Railway arranged to provide all necessary transport for the troops crossing the gaps north of Lake Superior, and that company having been paid for the service a certain sum per mile per man, the Government has nothing whatever to do with paying expenses connected therewith.\n\nThis claim was fully enquired into and considered by the Commission on the 1st February, 1886, and rejected.\n\nReport approved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 130.\n\nOTTAWA, 28th April, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 791.—M. M. & D., A 3,097—Geo. H. Douglas, of Chatham, $126.05, for expenses proceeding to and returning from the North-West.\n\nIt appears Douglas was a member of the Queen's Own Rifles; he went to Chatham to see his parents previous to departure, but on returning to Toronto he found the corps had left a few hours before. He then purchased certain articles of outfit and proceeded through the States to Winnipeg, where he arrived several days before the Queen's Own. He proceeded with the regiment to Qu'Appelle, where he was told by the Commanding Officer he could not be taken on, presumably because the quota was full; but he was given permission to join Boulton's Scouts. This he did, but meeting with an accident by being thrown from a horse, could not proceed with the troop. After recovery, Boulton's Troop was too far north for him to reach. He says he was then ordered to join the Yorkton Company, which he did, and served until the close of the campaign, as certified by Major Watson, who has recommended payment of the expenses called for.\n\nDouglas appears to be an enthusiastic soldier, and acted in a most patriotic manner. He has been conscientious enough to charge only second-class rates, although he travelled by Pullman.\n\nIt is therefore respectfully recommended he be paid, as a special case, $116.30, a reduction of $9.75 having been made for revolver, holster, belts and ammunition, which, as a private, he was not entitled to.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nOTTAWA, 1st May, 1886.\n\nMEMORANDUM for the Honorable the Minister of Militia and Defence in re W. C. 179.—M. M. and D., A 2,277.—Calvin P. Moore, of Calgary, for expenses from Ottawa to Calgary.\n\nMoore (although a resident of Calgary, where he should have returned after close of the campaign) came to Ottawa with the troops at Government expense. Capt. J. Wright, under whom he served, says: \"Moore came down of his own accord, and not by order.\" He was paid up to 31st July, which gave him ample time to reach his home.\n\nThe Commission on 30th September gave this claim careful consideration, but were unable to recommend payment.\n\nThere being no new features in the case, there does not appear to be any grounds for further action.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nREPORT No. 131.\n\nOTTAWA, 4th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 26.—Captain John Stewart, re claims in connection with outfit of the Rocky Mountain Rangers, re-considered by instructions from the Honorable the Minister of Militia and Defence, 20th April, 1886.\n\nThese claims had been previously considered, and amounts disallowed, because there appeared to be no authority for the several expenditures; but an order of Major-General Strange, dated Calgary, 19th April, 1885, having been produced, directing Captain Stewart to purchase great coats and hats for immediate service, there is no longer doubt as to the regularity of the transaction. Captain Stewart explains that rubber coats were the only ones available, and they were more suitable for the service than any others. He also explains that the tent, and the whole of the articles, are now safely stored with the N. W. M. P., at Fort McLeod. It is therefore most respectfully recommended that the following amounts be paid, viz.:\n\nTweed & Ewart, Fort McLeod, N. W. T.:\n15 rubber coats at $5.80 .................................................. $ 87.00\n1 tent ................................................................................. 30.00\n\nTotal .................................................................................. $117.00\n\nW. Winder, Fort McLeod, N. W. T.:\n50 waterproof coats at $5.24 .................................................. $262.00\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 132.\n\nOTTAWA, 4th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 810.—Claims forwarded by J. P. Fisher, barrister, of Ottawa, on behalf of Joseph A. Dunn, 2nd mate of the steamer \"Alberta;\" Joseph H. White, engineer of the steamer \"Marquis,\" and Wm. M. Caldwell, engineer of the steamer \"Alberta;\" all of whom served on their respective boats, on the north and south branches of the Saskatchewan River, during the North-West rebellion, in 1885.\n\nThere is nothing to show what these claims are for, nor are any specified sums claimed; but it is presumed the claims are put forward with the view of having the parties recognized as serving in the militia, for the purpose of obtaining land grants and other advantages to which the troops are entitled.\n\nThe Government employed these steamers by the day, for which a very large sum was paid.\nThe proprietors or companies owning the boats furnished officers, crews, fuel and all requisites for running them, no payments of any kind having been made by the Government to the crews.\n\nAll employés shipped as ordinary sailors knew the service in which they were to be engaged.\n\nThey were not enrolled as militiamen, nor did they serve in that capacity.\n\nArms and ammunition appear to have been served out to them for their own protection, the same as was done with the teamsters on the different trails.\n\nUnder the above circumstances it does not appear that these men have any claim against the Government.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nWAR CLAIMS COMMISSION.\n\nMEMORANDUM—Re Scouts.\n\nFifteen scouts were employed at Swift Current, by General Laurie, to accompany supplies to Battleford, for Lt.-Col. Otter's column.\n\nThese men claim $5 per day. I referred the matter to General Middleton, who authorized $4 per day where the men furnished their own horses; consequently I deducted $1 per day from those who rode Government horses.\n\nThe pay-lists show that all were paid $4 per day except one.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 133.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 768.—M. M. & D., A.3,322.—G. S. Hobart, of Kingston, Ont., for medical supplies to 14th Battalion, $74.85.\n\nThe 14th Battalion were ordered out for duty, on the 1st April, 1885, and occupied Tête du Pont Barracks and Fort Henry. They were reduced from time to time till the 31st July, when the last detachment was relieved from duty.\n\nIt appears that no medicine was in Government store at Kingston; consequently it became necessary to procure the medical supplies, as required, from the claimant.\n\nThe account is certified by the Surgeon of the corps, fully explained and recommended by the G. O. C. It is therefore respectfully recommended that the claim be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 134.\n\nOTTAWA, 10th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 629.—C. B. Rouleau, of Battleford (now of Calgary, N.-W. T.) for hay, $48, and pigs, $50; in all $98.\n\nOn requisition of Lieut.-Colonel Otter, the claimant supplied the troops at Battleford with three tons of hay, at $16 per ton, and two pigs, at $50 for the two; the receipt for which is certified by Lieut.-Colonel Otter. These claims have been held over pending explanations regarding other claims paid to Judge Rouleau. His letter attached, as well as one from the accountant of the Hudson's Bay Company, to collect the money and apply it to his credit. It is respectfully recommended that the full amount, $98, be paid to the Hudson's Bay Company for his account as requested.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nHudson's Bay Company,\nNorthern Department Office;\nWINNIPEG, Man., 20th November, 1885.\n\nSir,—I have the honor to enclose you a letter from Judge Rouleau, assigning to the Hudson's Bay Company the amount of the two vouchers handed by me this afternoon to Lt.-Col. Forrest. I shall be obliged by your attaching this to the vouchers, and advising me when they have been dealt with.\n\nI have, &c.,\n\nE. K. BEESTON.\nAccountant.\n\nLt.-Col. JACKSON, P. S. & P. O.\nMilitary Staff Office,\nWinnipeg.\n\nBATTLEFORD, 26th July, 1886.\n\nADAMS, Esq.,\nHudson Bay Company,\nWinnipeg.\n\nDear Sir,—Enclosed I forward you two accounts, which you will be kind enough to collect for me, from Lt.-Col. Jackson. Please place the amount to my credit, and I shall take some goods later from your store for same.\n\nYours truly,\n\nCHAS. B. ROULEAU.\n\nVouchers, 2 pigs ................................................................. $50.00\nVouchers, 3 tons of hay ...................................................... 48.00\n\nTotal ................................................................. $98.00\n\nCALGARY, N.-W. T., 1st May, 1886.\n\nMy Dear Colonel,—I just got your letter, and I see there is a misunderstanding about my account with the Department.\n\nI was paid two accounts before. To wit: One certified by General Laurie, through the Hudson's Bay Company, for services of my man and horses, between Swift Current and Battleford. Lt.-Col. Otter paid me also an account for lumber, horse blankets, &c., which he personally got from me; but this account for $98, certified by Lt.-Col. Otter, and transferred by me to the Hudson's Bay Company.\nnever was paid. At the time I transferred that account, the Hudson's Bay Company were authorized by the Militia Department to pay the same. But soon after that authorization was withdrawn, and that is the reason it was not paid. Therefore, I think after these explanations you will have no difficulty conscientiously in paying the amount to the Hudson's Bay Company.\n\nYours truly,\n\nCHAS. B. ROULEAU.\n\nLt.-Col. Jackson,\nOttawa.\n\nREPORT No. 135.\n\nOTTAWA, 11th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 519.—Reverend Canon McKay, $360, for special scouting service.\n\nThe claimant was chaplain of the Winnipeg Light Infantry during the campaign, and received for service:\n\nPay ................................................................. $265.08\nField allowance .................................................. 70.00\n\nTotal ................................................................. $335.08\n\nHe also appears to have received, through the Hudson's Bay Company, $150.\n\nMajor-General Strange telegraphed to Captain Hamilton, from Ottawa, 31st July, 1885:\n\n\"McKay pay for ninety days; deduct one hundred and forty-five dollars for horse from Major Butler.\"\n\nIt also appears an order was left by Canon McKay at Hudson's Bay Company's office, at Edmonton, on Captain Bossé, Paymaster 65th Battalion, for $65, which amount Captain Bossé paid Hudson's Bay Company, on the 13th May, 1885. It therefore appears by the foregoing, Reverend Canon McKay has received the sum of $695.08. On this account the Commission concluded an error had been committed in rendering this claim, and directed it should be placed among the doubtful ones.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nOTTAWA, 11th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nMEMORANDUM re claim of Hugh Munro, of Calgary, $400, for two injured horses.\n\nMunro has been paid $800 for hire of his horses, the original claim valued the horse at $200 (W. C. 115), but a Board of Officers recommended only $25, which sum was approved by Major Steele and Major-General Strange. This, with many other similar claims, were considered by the Commission; and, as the Deputy Minister of Justice decided the Government was not responsible, all were rejected. This horse was not shot, but simply got a nail in his foot when crossing a bridge. There is nothing to show more than one horse was injured.\n\nApproved—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nREPORT No. 136.\n\nOTTAWA, 15th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 123.—R. B. O'Donoghue, 16 days' service in Quartermaster's Department of the Winnipeg Light Infantry, at $2.50 per day, $40.\n\nThis claim was reported upon by the Commission, on the 16th October, 1885, and rejected, on the ground there was Quartermaster and Quartermaster-Sergeant under pay from the commencement of the organization of the corps (in March, 1885,) who should have discharged all the duties connected therewith. If further assistance were required, men of the corps should have been detailed for the duty, and not an outsider called in. It has not been shown why this man was required, or what service he performed.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 137.\n\nOTTAWA, 17th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 115.—Trooper Benoit, of Steele's Scouts, $100, for injury to horse. Reported upon by the Commission, on 24th September, 1885, and rejected, with many other similar claims, on the ground that the pay of $2.50 per day, with rations and forage, was sufficient to cover risks of this nature, being $1 a day more than ordinary cavalrymen received.\n\nThe facts of the case are these: Trooper Steele makes the claim on behalf of Benoit; and, as he says, gives evidence by power of attorney for Benoit, a most unusual proceeding. This is the only evidence produced, from which it would appear the horse got a \"snag\" in his foot, which produced lameness. Notwithstanding this, he returned with the troop to Calgary, and like most of the horses, appears to have been run down and required rest. Major General Strange made the following memo. on the papers:—\"No Veterinary Surgeon's certificate—referred to Major Steele to state if whole amount of $140 was deducted from Trooper Benoit's pay.\" No certificate or further report has been received.\n\nMembers of this Corps drew large sums of money, through the Hudson's Bay Company, and many of these payments appear irregular. The agreement under which the enlistment was made promised from $2 to $2.50 per day, the men to supply their own horses and outfit.\n\nIn the face of this agreement, Major General Strange authorized the Hudson's\nBay Company (statement No. 7, vouchers 317 and 318) to pay Trooper R. E. Steele—\n\n7 days, at $2.50 per day .................................................. $ 17.50\n17 days, at $5.00 per day .................................................. 335.00\n\nAnd rations which had been issued to this man's family\nand charged to him, amounting to $35.10, were sub-\nsequently repaid to him by order of Major General\nStrange ........................................................................... 35.10\n\n$387.60\n\nmaking an average of $5.24 per day.\n\nTrooper R. E. Steele appears to have received special favors; and the inference\nmay be drawn that he is now interested in this claim of Benoit, as the Board recom-\nmended payment through Trooper Steele.\n\nThe proceedings of the Board, in accepting evidence of the nature referred to, is\nnot in accordance with the usual custom of such Boards. No further recommenda-\ntion can therefore be made regarding the claim of Trooper Benoit.\n\nApproved.—A. P. C., M. M., & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 138.\n\nOTTAWA, 25th May, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT.\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 806.—M. & D., A 1,567.—Capt. F. G. Tremayne, 12th Battalion (part\nof York and Simcoe.)\n\nNo. 1.—March 31, 1885, paid transport of three men from\nMarkham to Sutton ......................................................... $ 2.70\nTelegraphing and horse hire ................................................ 2.85\nJuly 22, 1885, paid hire of steamer \"R. B. Kendrick\" for\nconveyance of twenty-two men from Lefroy to Sutton,\nwhen returning from the North-West .................................. 10.00\n\nTotal ............................................................................. $15.55\n\nNo. 2.—Lieut. M. S. Chapman, 12th Battalion, paid fares of\nthree men from Toronto to Markham, including horse\nhire .............................................................................. $4.20\n\nThese expenses were incurred by the York and Simcoe Battalion during their\nperiod of active service. The correspondence attached to claims explains fully\nthe circumstances. As the expenditure was necessary, and the charges appear\nreasonable, it is respectfully recommended that the said claims be paid in full.\n\nApproved—A. P. C., M. M., & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 139.\n\nOTTAWA, 1st June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 812.—M. M. & D., A 3,519.—Rev. Father LeBret, of Fort Qu'Appelle, for services rendered to soldiers at that station and Troy. No rum stated.\n\nThe officers, late and now in command at those stations, having been communicated with, it appears that some twelve or fifteen men were marched to the church at Fort Qu'Appelle, to attend the regular services of the church, say for a period of about three and a-half months.\n\nAlthough the Rev. Father does not appear to have been put to extra expense, nor was he appointed a chaplain, it would appear reasonable to allow him some remuneration, $25 is therefore recommended for this service.\n\nThe Rev. Father also drove twenty-two miles to Troy, eighteen times, to hold service for the men of \"A\" Battery. In all probability this is one of the mission stations, where service would have been held even if the troops had not been there; but it is only reasonable remuneration should be given, say $75, to cover pay, transport and personal expenses, making a total of $100, which is respectfully recommended to be paid in full of claim.\n\nW. C. No. 310.—M. M. & D., A 2,433 and 2,575.—Geo. S. Armstrong, M. D., of MacKay's Harbor, Port Arthur Post Office, $216, for attending sick soldiers left at this station on the north shore of Lake Superior.\n\nThere were only six men in all, for which there is a uniform charge of $3 per day per man. The services were performed between 4th April and 26th May, 1885. Total number of days, fifty-three. There being never more than two or three men present at one time. This claim having been referred to the officers commanding the respective corps to which the men belonged, they certify to the service having been performed; but for the number attended the charge appears high, particularly as Lt.-Col. Ouimet states that the hospital was kept by the Canadian Pacific Railway. It is therefore respectfully recommended that Dr. Armstrong be paid the net pay of an assistant surgeon, viz., fifty-three days at $2.43 per day, making a total of $128.79 in full of claim, showing a reduction of $87.21.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 140.\n\nOTTAWA, 9th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 774.—Thos. Bull, of Pense, N.-W. T., $141, (said to be assigned to J. W. Smith, of Regina) for railway fare of teamsters, and freight on teams and wagons proceeding to Moose Jaw, on transport service.\n\nAll teams supplied by the Hudson's Bay Company received free transport to and from, and it appears to have been the understanding that all teams engaged were to\nhave free transport—Government requisitions being generally used. In this case, however, requisitions were not used, the claimant having paid cost, as the papers show. Payment in full ($141) is therefore recommended.\n\nW. C. No. 775.—M. M. & D., A. 3639.—George Gunn, of Manitou Post Office, Assiniboia, N.-W. T., $2,260, for lumber, use of barge, and value of barge. This claim is again sent through John Secord, barrister, &c., of Regina, N.-W. T., reduced to $1,070. The papers show that the contract was entered into by Lieut. Leonard, Transport Officer, by authority of Maj.-Gen. Laurie. Mr. Leonard is a civil engineer and surveyor by profession, and has spent considerable time in the North-West with surveys and railway construction, and is fully competent to estimate the value of such articles as rough scows, &c.\n\nHis report attached shows that the scow or barge as it is called, was engaged by him from Gunn for one trip (about five days), at $10 per day, to take a load of stores from Saskatchewan Landing to Clark's Crossing. Mr. Leonard thinks that if the barge was not taken up the river again, it would be fair to pay the value of it, say $100. A new barge of the kind could be built at Medicine Hat for a much smaller sum.\n\nIt is therefore respectfully recommended that the following amounts be paid in full of this claim:\n\n- 250 feet lumber at $40 per thousand feet ........................................ $10 00\n- 5 days' hire of barge at $10 per day .................................................. 50 00\n- Value of barge, which, it appears, was not returned ................................ 100 00\n\nTotal ........................................................................................................ $160 00\n\nmaking a reduction on the original claim of $2,100.\n\nKemptville, 26th March, 1886.\n\nEDMUND B. HOLT,\nWar Claims Commission,\nOttawa.\n\nSir,—Your letter of 16th inst. received. Mr. George Gunn came down the Saskatchewan from Medicine Hat about the end of last April, as pilot on the \"Minnow.\" He had with him in tow a small scow about 20 feet by 12 feet. The steamer stopped at Saskatchewan Landing, and General Laurie authorized me to hire the barge to take down a load of supplies to Clark's Crossing, it being understood the barge was to be hired for the trip (about five days), and to be brought back by one of the steamers on the return trip. The price agreed upon was, I believe, $10 per day. I believe Mr. Gunn was the owner of the barge. If the barge was not taken up the river again, I think it would be fair to pay Mr. Gunn the value of it, say $100. A new barge of the kind could be built at Medicine Hat for a much smaller sum.\n\nThe bill of timber is correct, and I gave him a receipt for it.\n\n250 feet B. M., at $40 per M., $10. The lumber was required for flooring another barge. The whole transaction is to be found, I have no doubt, in General Laurie's papers.\n\nI am, Sir,\n\nYour obedient servant,\n\nR. W. LEONARD,\nLieutenant.\n\nW. C. No. 754.—F. F. Tims, Swift Current, N.-W.T., $15.50, for soap and tobacco supplied. D. L. S. Intelligence Corps, and $1,344, for demurrage by teams waiting for freight when hauling by the hundred pounds. This last item, $1,344, has been already reported on by the Commission, and rejected. (See W. C. 164, Report, 29th September, 1885.) As Capt. Dennis certifies to receipt of the supplies, it is respectfully recommended that $15.50 be paid.\n\nW. C. No. 643.—M. M. & D., A. 2,780.—Thos. Hourie, of Prince Albert, N.-W.T., for one grey horse captured and used by Boulton's scouts, and subsequently sold by Mr. Metcalfe, Government Auctioneer, as shown by Major Boulton's letter attached. Hourie claims pay for the use of the horse, 83 days, and also the value of the animal, the sums not being stated. It would appear unreasonable to pay for the horse as\nwell as the hire of him; and, as Hourie made no claim, as owner, while with Major Boulton, hoping thereby to draw pay and get the horse back, it is respectfully recommended that $100 be paid in full of claim.\n\nHourie's claim of $125, for a brown horse, and $200 for hay taken by Indians and rebels, appears to be a matter of adjustment by the Department of the Interior. It is recommended that Hourie be notified accordingly, so that he may present his claim to that Department, if he has not already been settled with by the Commission appointed for the settlement of such claims.\n\nLt.-Col. JACKSON, Chairman,\nWar Claims Commission,\nOttawa.\n\nSir,—I have the honor to acknowledge the receipt of your letter in reference to Hourie's horse. The horse in question was one my men captured after the battle of Fish Creek, and not having any claimant for it we brought it home with us, and it was sold for sixty dollars, and the money given to the wounded. Hourie was with us throughout the whole campaign, and all he had to do was to lay a complaint before the General, or report to me that we had one of his horses, and he would have got it back then. I can only suppose that his reason for not doing so was, that he might get paid for the use of his horse through the campaign, and then get his horse back; but the day we were ordered to leave Fort Pitt on our return journey he was away at Cold Lake, and he did not return till Colonel Smith's Battalion returned, when we had disbanded, and the horse was sold, and he reported it to me for the first time then.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nC. A. BOULTON, Major,\nLate Boulton's Mounted Infantry.\n\nW. C. 770 and No. 394.—M. M. & D., A 3,332.—R. J. Molloy, telegrapher, of Clark's Crossing, N.W.T., $235.75 for board and lodging of telegraph operators and couriers.\n\nThis man had already rendered a claim for some $600, which it was found on enquiry was fictitious, as shown by a report from Capt. Hudson, supply officer at that station, and by Mr. Clarke and others, putting in claims covering the same charges; consequently it was naturally supposed that this claim would be of a similar character and was referred to J. Lanskail, a most reliable man, and one of the parties who lodged with Molloy. He says, when asked what the charge would be, he was informed there would be no charge, as General Middleton had given him (Molloy) an order to draw rations from the supply office there; consequently lodging would be all he would be entitled to for the men who put up at his house. It is a well known fact that there were no provisions or forage of any consequence in the country, except those sent by Government for the troops, which were served out to settlers, half-breeds and Indians. It is therefore respectfully recommended that 50 cents per day be allowed for telegraph people, and 50 cents for horses, and $1 per day for couriers, as lodging money for selves and horses, the rations and forage, no doubt, having been drawn from Government supplies, making a reduction on this claim of $159.75. The balance, $76, is recommended for payment.\n\nW. C. No. 394—Molloy. This claim having been previously reported (see Report of 26th October, 1885,) and Mr. Molloy paid what he was entitled to, viz., $25, the papers are now attached to the previous docket.\n\nW. C. No. 657.—W. K. Dickson, of Parkdale, Ontario, Agent of the Temperance Colonization Company, Saskatoon, N.W.T., $650 for use of scow (called a barge) taken by order of General Middleton.\n\nAs Mr. Dickson incurred no expense with this scow after it was taken, if the value of it be paid, that should be considered all the claimant is entitled to.\n\nCaptain Hudson, who was Supply Officer at Clark's Crossing, says that a similar craft, in Ontario, would cost about $100; and, after considering the increased value of the material and labor at Saskatoon, he thinks $350 ought to be considered the outside limit of its cost.\nLieut. Leonard, a civil engineer and surveyor, and well acquainted with the country, has stated in reference to the value of a similar barge, that it would cost at Medicine Hat less than $100. Consequently, it is respectfully recommended that $350 be paid in full of this claim, making a reduction of $300.\n\nW. C. 720.—Samo party, $82, for forty-one telegraph poles used at Clark's Crossing, by the 10th and 90th Battalions, for fuel. Capt. Hudson, Supply Officer at the station, saw the supply of poles not used, and stated verbally to the Commission that they were \"poplar, about 15 feet long, and very small; not worth more than fifty cents each.\"\n\nLt.-Col. McKeand says \"they were worth $2 each, or any price that might be placed on them, as they were only used when no other wood was obtainable.\"\n\nTaking these valuations at the extreme each way, and considering the small size and poor quality, there appears no reason why they cannot be replaced for $1 each. It is, therefore, respectfully recommended that $41 be paid on this claim, making a reduction of $41. The total amount payable to W. R. Dickson, Agent of the Temperance Colonization Company, being $391, including the amount awarded on the previous claim No. 657.\n\nW. C. No. 674.—George S. Orton, M.D., Surgeon 90th Battalion, Winnipeg, $245; subsequently reduced by Dr. Orton, and rendered at $171.60, for pay and keep of horse and loss of services for two months. It appears that this horse was injured when returning from Prince Albert, on or about the 28th May, 1885, and was left at Bedson Station, returning to Winnipeg on 21st July. A certificate from W. J. Himmon, Veterinary Surgeon, says the horse was unfit for work up to 21st September. There should have been a Board to report upon the facts. This would have been impracticable where the horse was injured, but it might have been carried out at Winnipeg. The claim is for $1 a day for the loss of the use of the horse, and $55.60 for keep and Veterinary Surgeon's attendance. Dr. Orton having drawn pay with his corps for horse up to 31st May, there is an error of four days over charged, making a reduction of $4. The balance, $167.60, is respectfully recommended for payment, on Dr. Orton accounting for the $200 advanced to him, by the Department at Ottawa, on 26th June, 1885.\n\nW. C. No. 516.—M. M. & D., A 2,712.—Alfred Mills, of Leading, N.W.T., for meals to couriers and feed to horses, $206.75.\n\nBy order of Major-General Strange, a line of couriers was established going south from Calgary. The claim is certified by Major Boultan and H. Hamilton, Supply Officer; and, as rendered, is a difficult one to check. The rate for forage appears high even in that dear country. The Rocky Mountain Rangers foraged their own horses for 50 cents per day, consequently $1 per day would be a large sum in this case. It is therefore respectfully recommended that 50 cents per meal per man, and 33 cents per feed of hay and oats per horse, be authorized, making a reduction of $23.25. The balance, $183.50 is recommended for payment.\n\nW. C. No. 792.—D. A. Ross, of Winnipeg, $104, for hire of horse and buggy used while the Winnipeg Infantry (Lieut.-Col. Scott's Battalion) was being organized, the charge being $6 a day for a single horse and buggy, and $2 a night, for four nights, up to 12 o'clock. Lieut.-Col. Scott certifies to the claims; but the rate charged is exorbitant, and should be reduced at least one-third; and the night trips, which appear to have been made with the same conveyance, should not be allowed, as all engaged in the service worked nights as well as days. It is therefore respectfully recommended that $4 a day be authorized for 16 days, $64, which amount is recommended for payment, making a reduction on the claim of $40.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\nREPORT No. 141.\n\nOTTAWA, 14th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 698.—M. M. & D., A 2,939.—W. Hope Hay, of Boulton's Mounted Infantry, Shoal Lake, Man., $125, for a lost horse. The claimant was wounded and disabled at the capture of Batoche, and while in the hospital at Prince Albert, his horse, which was his own property, and left with the Troop, was lost. A corporal in the Mounted Police, at Prince Albert, appears to have made diligent search for the animal without success. The facts are certified to by Major C. A. Boulton, who says the horse was worth about $125. As the Regulations and Orders establish the value of Trooper's horses at $100, that amount is respectfully recommended for payment in this case.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 142.\n\nOTTAWA, 16th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nIt is respectfully recommended that the following claims be transferred to the Department of the Interior for adjudication by the Commission on Rebellion losses, viz.:\n\nW. C. 367.—Jno. G. Bastedo, owner of teams, $265; and Fred. Hagen, driver, $23.50, for losses by raid of Poundmaker's Band of Indians.\n\nW. C. 730.—M. M. & D., A 3,103.—Superintendent Herchmer, N.W. M. P., for damage by troops to household effects, $540.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 143.\n\nOTTAWA, 17th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 33.—M. M. & D., A 2,471 and 2,615.—Charles King, of Beulah, Man., $19, for damage to crops by horses of Boulton's Corps. It appears by Major Boulton's\ncertificate that, while the horses of his corps were being herded, awaiting the Government auction sale, three strayed away and got into King's crops, and were lost about three weeks. The damages were assessed, in accordance with the municipal regulations, by Mr. Hooper, and placed at $19, which sum is respectfully recommended for payment.\n\nW. C. No. 181.—M. M. & D., A 1,496 and 2,651.—Robert W. MacLellan, of Red Deer River, N.W.T., $250, for rent of dwelling and other buildings. It appears that the troops under Major Perry, going north from Calgary, reached Red Deer about 1st May, 1885, at which time Major Perry entered into an agreement with MacLellan for the rent of his house, outhouses and stables, for the use of the Department of Militia and Defence, at the rate of $50 per month. There is no certificate showing how long the property was occupied; but as the dwelling was loop holed, stables demolished, and the whole entrenched by the 65th Battalion, which rendered them uninhabitable, and as the stores appear not to have been removed until in September, rent would be payable up to the end of that month. It is therefore respectfully recommended that the claim, $250, be paid in full.\n\nW. C. No. 668.—M. M. & D., A 2,936.—Captain G. Campbell, late of Boulton's Mounted Infantry, $119.56, for horse hire and eight days' pay.\n\nMajor Boulton reports that Captain Campbell had two horses throughout the campaign, and did much extra duty on scouting service, frequently riding sixty miles a day, by which the services of a scout were saved. It also appears that Captain Campbell received no pay for the eight days occupied going from his house to Fish Creek, where he joined the corps.\n\nMajor-General Middleton testifies to the good services rendered by Captain Campbell, and Major Boulton's letter shows the claim to be a just one, and in accordance with agreement. It is therefore respectfully recommended that the claim, $119.50, be paid in full.\n\nTo the Honorable\n\nThe Minister of Militia,\n\nOttawa.\n\nSir,—In reference to an agreement that I made with certain of my officers who brought their horses with them on the late expedition, and with whom I agreed to allow $2.50 per day, and which was cut down by you to the regulation of $1 per day, I have the honor to apply for an exception to be made in the case of Captain G. Campbell, on the ground that throughout the whole campaign he had two horses with him in constant use on the expedition.\n\nThis officer joined my troop at Fish Creek, having followed us. In settling with him, I only allowed him from the date that he joined at Fish Creek, and I only allowed him pay for one horse.\n\nAs the regulations have been strictly adhered to, I beg to enclose this, my application for $1 a day for each of the two horses, and also for eight days' pay from the time of his leaving home until he joined my corps, which will enable me to fulfil my agreement with him, made upon his joining.\n\nThis officer rode many days sixty miles a day, and General Middleton can testify to the value of his services.\n\nI have, &c.,\n\nO. A. BOULTON,\nMajor.\n\nForwarded.—I can fully bear out what Major Boulton says of Captain Campbell, who did such service, riding such distances, that the services of a scout were saved, which would have cost much more than is now asked for, and which I recommend should be given.\n\nFRED. MIDDLETON,\nMajor-General.\n\nW. C. No. 793.—J. G. Hargrave, Winnipeg, $131.66, for blacking brushes, tobacco, soap, &c., furnished to the Winnipeg Infantry on order of Lt.-Col. Scott.\n\nThe nature of the service was such as to necessitate the men being supplied with these articles, and although they may not be strictly in accordance with the Regula-\ntions and Orders, the generality of the corps drew such necessaries through the Hudson's Bay Company, the value not having been stopped from the men.\n\nIt is therefore respectfully recommended that this claim, $131.66, be paid in full as a special case.\n\nApproved—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEDMUND B. HOLT,\nSecretary.\n\nREPORT No. 144.\n\nOTTAWA, 25th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 574.—M. M. & D., A 3,864.—Edwin A. Hayes, of Calgary, $18, for 8 saddle blankets for use of Steel's Scouts. This claim is certified by H. Hamilton, Transport and Supply Officer, and Captain Oswald of the corps. It is therefore respectfully recommended for payment in full.\n\nW. C. No. 709.—M. M. & D., A 3,788.—C. P. Strang, Assistant Supply Officer at Edmonton, $336, as pay from 1st July to 20th October, 1885. Mr. Strang was paid through the Hudson's Bay Company, up to 30th June, at the rate of $3.50 per day, the present claim being for $3 per day. Mr. J. K. Strachan reports the claimant as being in charge of the stores at Edmonton up to his arrival, when Strang's services were continued, to assist in transferring the large quantity of stores to the Department of the Interior or other Departments. The claim being recommended by Lieut.-Col. Whitehead, who managed the transfer of the stores, and as service appears to have been rendered, it is respectfully recommended the claim be paid in full.\n\nW. C. No. 711.—M. M. & D., A 3,788.—D. McDougall, of Edmonton, $33.15, for meat delivered, as rations, to Assistant Supply Officer Strang and Storeman Tetu.\n\nAs claims for meat from that station previously presented have been reduced to 15 cents per pound, and this sum having been recommended by Lieut.-Col. Whitehead (Mr. Betts, a trader from the Territories, says 15 cents is a large price for beef at Edmonton), it is therefore respectfully recommended $8.28 be deducted, and the balance, $24.87, be paid.\n\nW. C. No. 809.—M. M. & D., A 3,788.—Martin Bros., of Calgary, $49.50, for necessaries supplied J. K. Strachan, when proceeding to clear up the stores left on the Edmonton trail.\n\nStrachan had authority from Lieut.-Col. Whitehead to make necessary purchases; and as the latter officer recommends payment, and that Strachan be called upon to account for the articles, it is respectfully recommended the claim be paid in full, and Mr. Strachan called upon, through Lieut.-Col. Peebles, to pay for all articles unaccounted for. If necessary for the recovery to make it a stoppage against Mr. Strachan's pay.\n\nW. C. No. 821.—I. G. Baker & Co., of Calgary, $90, for 9 months' storage of biscuit. The building was repaired at considerable expense to the Government. Ten dollars per month was considered sufficient for the whole store, when previous\nclaim was made and paid. As the arms, ammunition and tents were removed to the Mounted Police Barracks immediately after former payment, the charges should be reduced at least one-third. It is therefore most respectfully recommended that $49.67 be deducted, and the balance, $11.33, be paid.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nThe agreement of I. G. Baker & Co., dated Calgary, 29th September, 1885, having been discovered since this report was made, the rent is reduced to $5 per month in accordance therewith.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 145.\n\nOTTAWA, 26th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 239.—M. M. & D., A 2,547.—H. Taylor, of Fort McLeod (letter from Duncan Campbell, June 15, 1886) $56, for rent of cook stove used by 9th Batt., reported on by the Commission on 9th October, 1885, and rejected.\n\nThe 9th Batt. was on service in the field, the same as the other corps, were provided with camp equipment, and the officers were in receipt of field allowance, and had no right to live in barracks. If they incurred unnecessary expense of this nature, it was a personal matter, consequently the Government ought not to be held responsible. No further recommendation can be made in the case.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 146.\n\nOTTAWA, 30th June, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 796.—M. M. & D., A 3,544.—Thomas Welsh, Qu'Appelle Station, $200, for team said to have been lost on 12th May, 1885, near Batoche.\n\nIt appears Welsh was engaged as blacksmith, at $13.50 per day, he to furnish team to carry outfit; after the horses were lost he was supplied with another team by Mr. Bedson, Transport Officer; but after returning home the owners of the\nhorses claimed and took them by process of law. It is presumed the $13.50 per day was paid all through the campaign, and until his return home, which sum would pay for the horses several times over.\n\nThe Minister of Justice having decided the Government is not responsible for claims of a similar nature, payment in this case cannot be recommended.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D. A. G.,\nChairman.\n\nREPORT No. 147.\n\nOTTAWA, 9th July, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 825.—M. M. & D., A 3,908.—W. M. Herchmer, Superintendent N. W. M. Police, $102.\n\nBy order of the General Officer commanding, Lieut. Col. Herchmer reported for duty to Lieut.-Col. Otter, on 12th April, 1885, at Swift Current, when he was appointed Chief of Staff, in which capacity he served up to 31st May, and now asks for the difference between the pay of superintendent and the pay and field allowance of a lieutenant-colonel (which rank he holds), viz., $2.04 per day.\n\nLieut.-Col. Otter testifies to the valuable services rendered, and as several officers of the N. W. M. Police have been paid on this basis, it is respectfully recommended that this amount be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 148.\n\nOTTAWA, 3rd August, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 833.—M. M. & D., A 3,979.—McLauglan & Sons, Owen Sound, $10.27, for biscuit and cheese supplied the 9th Battalion. Lieut.-Col. Amyot's letter attached explains that owing to an accident on the railway, the Corps when returning from the North-West, was detained all day at Owen Sound. Breakfast was had on the steamer before disembarking, but no other meal was procured until after reaching Toronto, the biscuit and cheese having been used during the day.\n\nLieut.-Col. Amyot certifies the account is correct and reasonable. It is therefore respectfully recommended for payment in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nQUEBEC, 2nd August, 1886.\n\nLt. Col. JACKSON,\nPresident, &c.,\nOttawa.\n\nMy Dear Colonel,—In answer to your letter of 31st ult., concerning the account of Messrs. McNaughton & Son, for provisions furnished the 9th Battalion, I beg to inform you I remember the facts as follows:\n\nHaving arrived at Owen Sound by the steamboat, we then proceeded by the Canadian Pacific Railway; we had previously taken our breakfast on board the steamer.\n\nOn arrival of the Battalion it embarked on the first train, which train was either thrown off the rails, or some accident happened to the engine. We returned to Owen Sound and remained there until the evening, my Battalion having had nothing to eat all that day, and, in fact, had no regular meals until reaching Toronto.\n\nI was obliged to authorize buying biscuit and cheese for their lunch. This was on Sunday, and by the courtesy of the Mayor of Owen Sound, the shops were kept open for us.\n\nI find the account reasonable, and recommend the payment in full. My Quartermaster also approves of it, which will be a sufficient guarantee to the Department to pay it.\n\nYours, &c.,\n\nG. AMYOT, Lt.-Col.,\nCom'g 9th Battalion, V.Q.\n\nREPORT No. 149.\n\nOTTAWA, 4th August, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C., No. 820.—M. M. & D., A 3,821.—John A. Cameron, near Houghton, N.W.T., $40, for hay.\n\nThe papers set forth the original voucher given by D. A. McArthur, Depot Clerk at Houghton, was forwarded to Major Bell, and became lost. A duplicate voucher, declaration by Cameron, and letters from Bell and Bedson, respectively, leaves no doubt as to the delivery, and non-payment of hay.\n\nIt is therefore respectfully recommended the claim be paid in full. Cheque to be endorsed to care of William Smith, Notary Public, Fort Qu'Appelle, N.W.T.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nQU'APPELLE VALLEY FARMING COMPANY (LIMITED),\nBELL FARM,\nINDIAN HEAD, N.W.T., 30th July, 1886.\n\nTo Lieut.-Colonel JACKSON, D.A.G.,\nOttawa.\n\nDear Sir,—When in Ottawa, you spoke to me of an account for hay delivered at Houghton Station by John Cameron.\n\nEnclose you will find a voucher from D. A. McArthur, Depot Clerk, which I found in a bunch of old papers this morning.\n\nThere is no doubt that this is all right and should be paid.\n\nI have the honor to be, Sir,\n\nYours truly,\n\nW. R. BELL.\nMANITOBA PENITENTIARY,\nSTONY MOUNTAIN, 8th June, 1886.\n\nM. M. & D.\nA 3,821.\n\nTo Col. Panet,\nDeputy Minister of Militia and Defence,\nOttawa,\n\nSir,—I have the honor to enclose you herewith, a letter from one named W. Smith, referring to a claim of $40, for hay sold to the Government for behalf of Transport Service, by John Cameron.\n\nAs I have sent you on a former occasion all papers in connection with this claim, I should be glad to hear that something has been done in the adjustment of the same.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nS. L. BEDSON.\n\nREPORT No. 150.\n\nOTTAWA, 21st August, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 808.—M. M. & D., A 3,746.—John F. Snow, of Winnipeg, pay as Lieutenant of the 92nd Battalion (Winnipeg Infantry) and Dominion Land Surveyors' Intelligence Corps, $116.92; expenses going from Ottawa to Winnipeg, $61.75; and field allowance, $53.28. Total claim, $231.95.\n\n1st. Pay, $116.92.—Mr. Snow went to Winnipeg with Lieut.-Col. Scott, expecting a Lieutenancy, which Lieut.-Col. Scott says he was not certain he could give until after reaching Winnipeg. Snow acted as Lieutenant up to 11th April, at which time, on the advice of Lieut.-Col. Scott, and being a Dominion Land Surveyor, he enlisted with Captain Dennis in the Intelligence Corps, in which Surveyors ranked as Lieutenants. He proceeded with the Corps to Qu'Appelle, and subsequently to Swift Current. On about 23rd April he was invalided, and returned to Qu'Appelle, and by Lieut.-Col. Scott's orders went into camp with the Winnipeg Infantry, under the care of Surgeon Seymour, where he speedily recovered, and continued to serve as Lieutenant and Intelligence Officer up to 9th June. It appears, therefore, the claimant did duty 73 days as Lieutenant (one day less than claimed for), at $1.58, $115.34. Recommended.\n\n2nd. Expenses, $61.75. It appears, by the papers, claimant accompanied Lieut.-Col. Scott from Ottawa to Winnipeg, for the purpose of accepting a Lieutenancy in the Winnipeg Infantry. Lieut.-Col. Scott, however, says:—\"But was not certain could give him a Lieutenancy until arrival in Winnipeg—found I could not.\" There is nothing, to show Lieut.-Col. Scott had authority to take Mr. Snow with him, and as the latter appears to live in Manitoba or the North-West, he would not be entitled to transport and expenses en route. Rejected.\n\n3rd. Field allowance, $53.28. It appears Mr. Snow acted as Lieutenant, under Lieut.-Col. Scott, from 29th March to 10th April, inclusive; then enlisted in the Intelligence Corps, in which he served until the 23rd April, inclusive. On account of sickness he was unable to proceed with the Corps from Swift Current, where he had accompanied it. He then returned as far as Qu'Appelle, when Lieut.-Col. Scott took him on as Intelligence Officer, in which capacity he served to the 9th of June, making 73 days in all (one day less than claimed), at 62 cts., $15.26. Recommended.\n\nIt is therefore respectfully recommended the following amounts be paid:\n\nPay ................................................................. $ 115.34\nField allowance .................................................. 45.26\n\nTotal ................................................................. $ 160.60\nmaking a reduction of $71.35.\nWINNIPEG, 13th August, 1886.\n\nSir,—I have the honor to inform you, that in March last I sent in to Minister of Militia, certificate of service of Lieut. Fred. Snow, in 95th Batt., as follows:\n\nJoined 26th March, but was not certain I could give him Lieutenantcy until arrival in Winnipeg. Found I could not. He served as such, however, until he joined Intelligence Corps, 11th April; was granted sick leave at Moose Jaw, 23rd April. On arrival at Qu'Appelle Station he had improved, and I attached him to the Regt. until he would be able to join his own Corps. Captain Dennis was moved on at once to the front, and it was difficult for him to join. He remained with me as Intelligence Officer until 24th July, and rendered good service. I supposed he had been kept on the strength of Captain Dennis' Corps.\n\nI have, etc.,\n\nTHOS. SCOTT,\nLt.-Col., 95th.\n\nTo Lieut.-Col. Jackson, D.A.G.,\nOttawa.\n\nW. C. 837.—Lieut.-Col. Scott, of the Winnipeg Infantry (now 95th Battalion), for transport and expenses going from Ottawa to Winnipeg, $59.\n\nThe Honorable the Minister of Militia and Defence authorized Lieut.-Col. Scott to proceed to Winnipeg and organize a Battalion for service in the North-West, which he did. As other officers who went up for a similar purpose were paid their expenses, it would appear but right this officer should also be paid; but, as there are errors in the charges as compared with what other officers who went on the same train paid, it is respectfully recommended the following sums be paid:\n\nTicket, Ottawa to Winnipeg ........................................... $ 47 25\nPullman, three nights at $2, one night at $3 ......................... 9 00\nMeals .............................................................................. 9 00\n\nTotal ............................................................................. $ 65 25\n\nmaking a reduction of $3.75.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 151.\n\nOTTAWA, 23rd August, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 837.—Gallaher, Sons & McGregor, of Winnipeg, $209.61.\n\nThe claimants were contractors with the Hudson's Bay Company, to furnish fresh beef to the troops on the line of march, at seventeen cents per pound. It appears by the sworn testimony of Sydney Swindford, Assistant Commissary with the troops, countersigned by Captain H. Swindford, Commissary, this beef was issued to the troops and transport on the first day of the fighting at Batoche. Owing to the excitement at the time, no requisition was given or receipt taken. The delay in presenting the account was because Swindford and others who were present and witnessed the delivery were absent from Winnipeg.\n\nIt is therefore respectfully recommended the claim be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nREPORT No. 152.\n\nOTTAWA, 24th August, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 769, $20; No. 814.—M. M. & D., A 3,722, $101; No. 815, $72; total $193. Hudson's Bay Company, Winnipeg.\n\nNo. 769, $20. This sum was paid Louis Paternaud by order of Lieut.-Col. Osborne Smith, C. M. G., for conveying despatches from Fort Pitt to Lake of Islands and Red Deer River, on 30th July, 1885. The vouchers being correct, payment is respectfully recommended.\n\nNo. 814, $101. The Hon. the Minister authorized this sum to be expended by Captain Young in securing the graves of dead soldiers at Fish Creek. This authority was telegraphed to Capt. Young, at Prince Albert, by the Major-General Commanding, on 30th April, 1886. On this authority the Hudson's Bay Company paid $100, 1 per cent. commission being charged, making $101, which is respectfully recommended for payment.\n\nNo. 815, $72. This is a claim for money paid Isaac Laidman, for time occupied by one team going from Portage la Prairie to Qu'Appelle, and two teams returning, three days each. Under date of 2nd June, 1885, Lieut.-Col. Whitehead authorized the Hudson's Bay Company to pay all teamsters, where not included in time check, a sufficient number of days to cover time occupied in going from and to the points of shipment on the Canadian Pacific Railway. The Hudson's Bay Company certify this as a case in point, and there is no doubt the teams moved as stated (weigh bills attached to claim), but the time notes are so indefinite, it is difficult to check the exact service covered. Major W. R. Bell, Transport Officer, stated before the Chairman, that in many instances the railway journey was not included in pay rolls. As this claim appears to be well established by documentary evidence, payment is respectfully recommended, making a total on these claims of $193.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt. Col., D.A.G.,\nChairman.\n\nREPORT No. 153.\n\nOTTAWA, 13th September, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT FOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. 801.—M. M. & D., A 3,411.—F. N. Gisborne, Superintendent of Telegraph Service, on behalf of the claimants, viz.: Sub-Agent Voulindeburgh, Touchwood, $50; Sub-Agent Anderson, Humboldt, $50; Agent Molloy, Clark's Crossing, $50; Repairer McFarlane, Battleford, $100; Repairer Latimer, $100; Chief Operator Richardson, Battleford, $150; and District Superintendent Hartley Gisborne, Battleford, $200. Total $300.\n\nF. N. Gisborne, Superintendent of Government Telegraph Service, recommends the above, on account of the continuous day and night service frequently performed under the most hazardous circumstances, the different stations being in the heart of the rebel stronghold. All admit the efficiency of the service, which was frequently\nperformed under very trying circumstances; and as all Government employees engaged in suppressing the rebellion were paid in excess of their ordinary salary, it would appear but just and right those men should receive some remuneration.\n\nAs a recognition of the different grades, the following would probably be fair. Sub-Agents and Repairer, $1; Agents, $1.50; Chief Agent, $2; and District Superintendent, $2.25 per day.\n\nIt is therefore respectfully recommended the following amounts be paid:\n\n- Sub-Agent Voulindeburgh, 18 days at $1: $18.00\n- do Anderson: $18.00\n- Repairer McFarlane, 41 days at $1: $41.00\n- do Latimer: $41.00\n- Agent Molloy, 41 days at $1.50: $61.50\n- Chief Operator Richardson, 41 days at $2: $82.00\n- District Superintendent H. Gisborne, 41 days at $2.25: $92.25\n\nTotal: $353.75\n\nmaking a reduction of $446.25 on the several claims.\n\nRejected.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 154.\n\nOTTAWA, 21st September, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 845.—Thomas Logan, of Birtle, Manitoba, $14.50.\n\nThis claim is certified and recommended by Major C. A. Boulton, late Commander Boulton's Mounted Infantry, and is for ferrage and other expenses incurred by Logan and two others in going round by Prince Albert to fetch horses left there. As Major Boulton's certificate should be accepted for this sum, it is respectfully recommended for payment in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 155.\n\nOTTAWA, 22nd September, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nMIG. W. C. No. 836.—M. M. & D., A 3,179.—Capt. E. P. Leacock, Paymaster, Winnipeg Light Infantry, Winnipeg, $125, for a horse.\nIt appears the claimant took a horse with him when going on service. Paymasters are not entitled to a horse; but it would appear Lieut.-Col. Smith disregarded the regulations and allowed the irregularity, which cost the Government a large sum for transport and forage. Captain Leacock left his horse at Fort Pitt, and brought with him to Winnipeg one of the Mounted Police horses, which was subsequently claimed and returned to Inspector John Allen. Captain Leacock says his horse was sold on Government account. There is nothing to substantiate this except the certificate of Lieut.-Col. Smith. The statement is presumed to be correct. It is therefore respectfully recommended the claim be paid in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 156.\n\nOttawa, 24th September, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 766.—Geo. A. Gibson, of the town of Qu'Appelle, N. W. T., for ten tons of hay at $12, $120.\n\nIt appears the claimant delivered this hay on the 29th, 30th and 31st March, 1885, immediately after the arrival of the troops at Qu'Appelle, and before a proper organization of the Commissariat branch, consequently the books which were subsequently opened do not show the transaction.\n\nThe affidavits and statements attached to the claim, leave no doubt about the delivery; and, after a careful examination of vouchers for hay delivered during the first month of the campaign, no payment of the kind can be found. It is therefore respectfully recommended for payment in full.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nCANADA,\n\nNorth West Territories,\n\nTo wit:\n\nI, Archibald McDonald, of Fort Qu'Appelle, in the North-West Territories, a Chief Factor in the Hudson's Bay Company, do solemnly declare.\n\n1. That I have read over the statements of George A. Gibson, of Qu'Appelle Station, made under oath, on the 4th day of February, 1886, in support of his claim for payment of ten tons of hay supplied to the transport service of the North-West Field Force, in the latter part of the month of March, 1885.\n\n2. That so far as statements contained in paragraph 4 and of Gibson's affidavit are concerned, I know the same to be true.\n\n3. That I am positive, no receipts, for the ten tons of hay in question, ever came to my hand, and there is no record in my office of any such receipts having been transmitted. And I make this solemn declaration conscientiously believing the same to be true, and by virtue of an Act passed in the 37th year of Her Majesty's reign entitled: \"An Act for the suppression of voluntary and extra-judicial oaths.\"\n\nARCHIBALD McDONALD.\n\nDeclared before me, at Fort Qu'Appelle, this second day of July, A.D. 1886.\n\nHUGH A. J. MACDOUGALL, Notary Public in and for the North West Territories.\nCANADA,\nNorth-West Territories,\n\nTo wit:\n\n1. William E. Jones, of the town of Qu'Appelle, in the North-West Territories, Gentleman, make oath and say—\n   1. That I recollect during the latter part of March, 1885, in my capacity of Chief Clerk, Transport Service, North-West Field Force, having received several tons of hay from George A. Gibson, for which I granted receipts to him in the ordinary way.\n   2. I have no memoranda by which to ascertain the exact quantity of hay delivered by Gibson, but I believe it was in the neighborhood of fifteen or sixteen tons in all.\n   3. At Mr. Gibson's request I accompanied him to Mr. Swinford's office, who was there to be Supply Officer, to try and obtain a settlement from him, but Capt. Swinford informed me that the receipts had been forwarded by him to the Hudson's Bay Company, at Fort Qu'Appelle.\n   4. I am aware that Gibson left here on the Transport Service a few days afterwards, and returned some time early in July, when he again called on me, and I was surprised his account had never been settled.\n   5. I then wrote to Captain Swinford, at Winnipeg, enquiring about the matter, and he replied by letter requesting me to see Major Rickards, who had the books and should be in a position to settle the claim.\n   6. I then interviewed Major Rickards at his office, who told me he knew nothing of the claim, and I asked him to make enquiry as to the facts of the case, but do not know whether he did so or not.\n\nSworn before me, at the Town of Qu'Appelle, in the North-West Territories, this 25th day of June, A.D. 1886.\n\nW. E. JONES.\n\nLeslie Gordon,\nA Notary Public in and for the North-West Territories.\n\nCANADA,\nNorth-West Territories,\n\nTo Wit:\n\n1. Thomas T. Thomson, of the town of Qu'Appelle, in the North-West Territories, Lumber Merchant, make oath and say—\n   1. That on or about 1st April, 1885, George A. Gibson gave me an order on Archibald McDonald, the Hudson's Bay Factor, to collect an account due to him for hay supplied to the Transport Service.\n   2. That I forwarded the said order to my agents at Fort Qu'Appelle, Messrs. Cruthers & Tregant, for collection.\n   3. That Messrs. Cruthers & Tregant advised me, in due course, that Mr. McDonald had refused to pay the said order, because it was unaccompanied by the proper vouchers, and which he said were not in his possession.\n\nSworn before me, at Qu'Appelle Station, in the North-West Territories, this 5th day of July, A.D. 1886.\n\nTHOMAS THOMPSON.\n\nLeslie Gordon,\nA Notary Public, in and for the North-West Territories.\n\nCANADA,\nNorth-West Territories,\n\nTo Wit:\n\n1. George Gibson, of the town of Qu'Appelle, North-West Territories, make oath and say—\n   1. I did, on the 29th, 30th and 31st days of March last, deliver in all ten tons of hay for the Government Transport Service at the town of Qu'Appelle.\n   2. Each load was measured and passed by Mr. W. E. Jones, Transport Officer, who gave me receipts for the same.\n   3. On 31st March, I presented these receipts to Captain Swinford, Supply Officer, who retained the receipts, and told me to call the next day and he would settle with me.\n   4. I called on the following day, and he referred me to Arch. McDonald, Hudson's Bay Factor; I saw Mr. McDonald, who informed me he had not the receipts and could not pay me, but if they had been sent to Fort Qu'Appelle, he would bring them down and settle with me.\n   5. As I was then going on the Transport Service, I left the matter in the hands of Mr. Thomas Thomson, to look after the matter for me, but he was unable to obtain a settlement, as the before mentioned receipts never turned up.\n   6. I came back in July, having been out on the Transport Service during the intervening period, and made application for a settlement to Major Rickards, who was then in charge, but he said \"he had no power to settle the matter.\"\n7. In August, shortly before Major Rickards left, I again saw him about my claim, he then looked up the requisition book and showed me an entry in it (on or about 31st March) of a requisition for sixteen tons of hay, marked unpaid.\n\n8. I have never received any payment, either in whole or part, for the aforementioned ten tons.\n\n9. On the second or third of April, just before going out on the Transport Service, I delivered four tons more, for which I also obtained receipts from Mr. W. E. Jones, and was duly paid by Archibald McDonald's order on Caswell's Bank.\n\nGEO. A. GIBSON.\n\nSworn before me, at the town of Qu'Appelle, in the North-West Territories, this fourth day of February, A.D. 1886.\n\nLeslie Gordon,\nA Notary Public for N.W.T.\n\nREPORT No. 157.\n\nOTTAWA, 1st October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 838.—M. M. & D., A 2,511.—Lieut.-Col. Amyot, commanding 9th Battalion, on behalf of himself and officers, claim for allowance in lieu of rations, while on service in the North-West, $534.32.\n\nOwing to the numerous claims put forth by the officers of this Corps, and the many articles not authorized by the Regulations and Orders, which were purchased by these officers and charged to the Government, necessitated the examination of the whole of the transactions during the period of service, viz., from 31st March to 21st July, 1885. Consequently I had Major Guy, Paymaster of the North-West Forces, examine the various documents and submit a report, which is herewith attached. As this report is compiled from official documents on file in the Department, its correctness cannot be questioned.\n\nIn order that a proper debit and credit account might be prepared, 40 cents per day (the money value) is taken as the cost of rations, notwithstanding the fact that when officers took meals at hotels not less than $1.50 per day was paid by the Department.\n\nWith a view of making this a final adjustment of accounts with the Corps, an account with each officer has been prepared and is contained in the report.\n\nThe closing summary shows the Battalion is indebted to the Department to the amount of $1,478.52, and to nine officers of the Corps whose names, with respective amounts given, $92.90.\n\nIt would therefore appear desirable the Department call upon the officer commanding the Battalion to refund $1,478.52 and account for such rations and forage as may have been issued at Calgary by Mr. McGibbon, for use of the Corps, while en route to Quebec (they having been provided with meals all the way), also to settle with his officers for the respective amounts due them.\n\nAll of which is respectfully submitted. Dockets herewith, M. M. & D., A 2,511, A 2,862, A 3,156, A 4,015 and Guy's report.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nM. M. & D.\n\nA 2511.\n\nW.O.—838.\n\nTo Lieut.-Col. Jackson, D.A.G.,\nP.S. & P.O., &c.,\nOttawa.\n\nSir:\n\n1. In re the claim for rations, &c., by the Officers of the 9th Battalion (V. Q.), I have the honor to state that Lieut.-Col. Amyot is in error in stating \"We were under the impression we had the right to draw money in lieu of rations.\" Our first pay was given in this manner. The fact is, he obtained an advance of $3,700 from the Department before leaving Quebec, from which he deducted the amount of his first pay lists, which covered the period he was under arms at Quebec previous to moving West. The Officers were presumed not to have been furnished with rations and lodgings during that period, hence the pay lists were allowed to pass. But I personally warned the Paymaster of the Corps, when in Winnipeg, in April, 1885, that rations were available, and that they were not entitled to the allowance in lieu of rations and lodgings, under 985, R. & O., 1883. Moreover, the Corps actually drew rations for their Officers at Winnipeg, for 13 days, from the 12th to the 24th April, 1885, inclusive, and were provided with meals en route to the West.\n\n2. I respectfully submit that the matter of drawing rations by the Officers of the 9th, V. Q., while on service in the North-West, was purely a regimental affair, for which the Department is not in any way responsible to the individual Officers of the Corps. The rations were available at the posts at which the Corps served, as evidenced by the fact that the Non-Commissioned Officers and men were furnished with rations or meals at these posts; and the claims of individual Officers now under consideration must establish the fact that the Officer commanding the Corps, or those commanding Detachments thereof, are responsible to the Officers who served under them, for the value of any rations they may have neglected to draw.\n\n3. Lieut.-Col. Amyot's contention, based on a quotation from 985, R. & O., 1883, that the words: \"Except when on actual service,\" removes all doubt is not clear. I presume he means as to his being entitled to a money allowance in lieu of rations. To this I take exception, because 985, R. & O., 1883, says: \"Except when on actual service in the field, Officers are not entitled to rations of any kind at the Government expense.\" The Government provides these rations and Officers to issue them. It is however assumed that the Department is desirous of dealing liberally in this matter; I therefore deal with the individual claims of Officers on the basis of the actual money value of the rations (40 cts. per day) for the period of their service, which I suggest be allowed. Nevertheless it will be borne in mind the Commanding Officer of the 9th is responsible to the Department on account of horses, saddlery, stores, &c., and that the corps was overpaid on account of rations, forage, &c., at Quebec for the month of July by Lampson, in September, 1885; consequently a summary will be found at the end of this report, showing the amounts due to or by each individual Officer, and the balance due to the Department by the Corps, as far as obtainable.\n\n4. The correspondence of the several officers of the Corps is entirely irrelevant, because it asks for information which they should be prepared to furnish the Department when called for, and seeks to hold it responsible for a purely Regimental matter, reflecting on their own apparent want of knowledge of their duty. For instance, see Lieut. Col. Kvanturel's letter, M. M. & D., A 2826, in reply to which I may state that this officer's claim (W.C. 696—M. M. & D., A 2826) is in effect a claim for $92. The amount was not stated by Evanturel; but it amounted to the same thing, as it is obvious that in all such cases, the Commission were bound, on a basis of the period covered, and the nature of the claim, to establish its money value; and I repeat the neglect of duty on the part of any Officer Commanding a corps, detachment, or post, to draw rations, when there was a responsible Officer ready to issue those rations, does not render the Department liable for their value, because it was the Commanding Officer's duty to requisition the Supply Officer for rations for his Officers. The Supply Officer could not issue until he was asked.\n\n5. The only stations about which there seems to be any doubt as to rations or meals being furnished to the Officers of the 9th are Calgary, and on their return from the West at Winnipeg, and the Hudson's Bay accounts seem to indicate the issue of rations to the Officers of this Corps at Calgary. For instance, G. C. King & Co.'s account, butter, 84 lbs. at 30 cts., and 61 lbs. at 25 cts., $40.45; L. G. Baker & Co., for trip to Mountains, $60. The latter was for the Officers, and is additional to the $75.50 referred to in the proceedings of the Commission, Report No. 102, and which it is proposed to charge to the Corps.\n\n6. Lt.-Col. Evanturel's claim. This claim is erroneous and amended. The Corps left Quebec on 2nd April, 1885. Evanturel is entitled therefore to only 3 days (from 31st March to the 2nd of April) allowance in lieu of rations and lodgings, vide 982, R. and O., 1883. Meals were furnished from the 3rd to the 11th April, en route to Winnipeg; from the 12th to 24th, both dates inclusive, rations were drawn at Winnipeg from 25th to 27th, both dates inclusive, meals were furnished en route to Calgary. Meals were furnished from the 7th to the 10th of July, inclusive, en route from Calgary to Winnipeg, and from the 16th to 21st July, both dates inclusive, on the passage from Winnipeg to Quebec. Paymaster Lampson, in September, erroneously paid ration and lodging allowance, &c., from 1st to 21st July. Mr. McGibbon, S. O. at Calgary, reported the 9th Battalion without horses when they went West in April, 1885, that they were provided with horses, saddles and bridles at Government expense, and that forage was provided for these horses at Government expense. Omitting the claim for a horse,\nwhich will be dealt with regimentally, because two are said to have been paid for, but I do not know by whom payment was made, it appears to me the claim should stand thus:\n\nLt.-Col. Evanturel, in Account with Department Militia and Defence.\n\nTo 7 days' allowance in lieu of rations and lodgings, at $1 per day,\nfrom 31st March to 6th April ........................................... $ 7 00\n9 \" meals furnished en route to Winnipeg, from 1st to 5th April,\ninclusive, at 40 cts .................................................. 3 60\n13 \" rations drawn at Winnipeg, from 12th to 24th April, at 40 cts .... 5 20\n3 \" meals en route to Calgary, 25th to 27th April, at 40 cts ......... 1 20\n2 \" board at Calgary, between 28th and 30th April, at 40 cts ....... 0 80\n4 \" meals returning to Winnipeg, 7th to 10th July, at 40 cts ......... 1 60\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts .......... 2 00\n21 \" allowance in lieu of rations and lodgings, from 1st to 21st July, at $1 .................................................. 21 00\n\nGuy's, April, 1885.—V. 119.\nTo 24 days' pay for horse and forage allowance, from 7th to 30th April,\ninclusive, at $1.35 .................................................. 32 40\n7 \" pay for horse at $1, $7; 31 days' forage for May, at 35 cts., $10.85 .................................................. 17 85\n\nForrest, July, 1885.—V. 50, 51.\nTo 30 days' allowance in lieu of forage, 1st to 30th June, at 25 cts ..... 16 50\nLampson, Sept., 1885.\nTo 21 days' forage allowance, 1st to 21st July, at 35 cts .............. 7 35\nAdd to 1 Mexican saddle and bridle, provided at Calgary, not accounted for, say .................................................. 40 00\nOne set driving harness, do vide McGibbon's return .................................................. 45 00\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. & O.,\nfrom 31st March to 2nd April, inclusive, at $1 ......................... $ 3 00\n110 \" allowance in lieu of rations, at say, 40 cts, from 3rd April to 21st July, inclusive .................................................. 44 00\n\nBalance due Department .................................................. $148 50\n\nDepartment Militia and Defence, in Account with Capt. Fages.\n\n7. This account is erroneous, and is amended; on the basis and for the reasons stated in Evanturel's claim, it appears to stand thus:\n\nTo 3 days' allowance in lieu of rations and lodgings, vide 983, R. & O.,\nfrom 31st March to 2nd April, 1885, inclusive, at 75 cts. $ 2 28\n100 \" allowance in lieu of rations, at say, 40 cts. a day, from 3rd April to 21st July, inclusive .................................................. 44 00\n\nCONTRA.\n\nBy 7 days' allowance in lieu of rations and lodgings at 76 cts. a day\nfrom 31st March to 6th April ........................................... $ 5 32\n9 \" meals en route to Winnipeg, from 3rd to 11th April, at 40 cts .... 3 60\n13 \" rations at Winnipeg, 12th to 24th April, at 40 cts .............. 5 20\n3 \" meals en route to Calgary, 25th to 27th April .................... 1 20\n2 \" board at Calgary, between 28th and 30th April, at 40 cts ....... 0 80\n4 \" meals returning to Winnipeg, 7th to 10th July, at 40 cts ......... 1 60\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts .......... 2 00\n21 \" allowance in lieu of rations and lodgings, from 1st to 21st July, at 76 cts. a day .................................................. 15 96\n\nBalance apparently due Fages ........................................... $ 35 68\n\nBut McGibbon reported to me personally that the 9th V. Q. Battalion was provided with two car loads of rations and forage on leaving Calgary, and as they were also furnished with meals en route to Winnipeg, and thence to Quebec, it would appear necessary to have an account of these rations from the corps in order to determine whether the Department is liable, particularly as the men were rationed and forage drawn for horses in addition, from the 11th to the 16th July, inclusive (as appears by my\nJuly, 1885, accounts, vouchers 119, and upwards) while at Winnipeg, returning from the west. McGibbon is responsible in a measure (though not financially) for this double supply of rations to the men, because he should have notified the Commissariat Department that he had issued forage and rations to the corps before leaving Calgary on their return journey, and also that he had given a voucher to an officer of his staff covering meals to the Battalion en route to Winnipeg.\n\n8. Captain Garneau's claim is identical with that of Fages, and he appears to be entitled to $10.60, provided the rations referred to are accounted for.\n\n9. Captain Frenette's claim is also the same as that of Fages. He appears, with the same proviso, to be entitled to $10.60.\n\n10. Captain LeVasseur's claim is also the same, and, with the proviso stated, he appears to be entitled to $10.60.\n\n11. Paymaster Dugal's claim is somewhat different, and appears to stand thus:\n\nTo 3 days' allowance in lieu of rations and lodgings, vide 983, R. and O., 31st March to 2nd April, at 90 cts. $2.70\n\n110 allowance in lieu of rations, at 40 cts. a day, 3rd April to 21st July, inclusive $44.00\n\n$46.70\n\nCONTRA.\n\nBy 7 days' allowance in lieu of rations and lodgings, vide 983, R. and O., from 31st March to 6th April inclusive, at 90 cts. $6.30\n\n9 \" meals en route to Winnipeg, from 3rd to 11th April, inclusive, at 40 cts. $3.60\n\n13 \" rations at Winnipeg, 12th to 24th April, at 40 cts. $5.20\n\n3 \" meals en route to Calgary, 25th to 27th April, at 40 cts. $1.20\n\n2 \" board at Calgary, between 28th and 30th April, at 40 cts. $0.80\n\n4 \" meals returning to Winnipeg, from 7th to 10th July, at 40 cts. $1.60\n\n5 \" meals returning to Quebec, from 16th to 21st July, at 40 cts. $2.00\n\n21 \" allowance in lieu of rations and lodgings, from 1st to 21st July, at 90 cts. $18.90\n\n$39.60\n\nApparently due Dugal. $7.10\n\nWith the proviso stated previously in the case of Fages.\n\n12. Captain Perrault's claim is identical with that of Fages. With same proviso, Perrault appears to be entitled to $10.60.\n\n13. Lieut.-Col. Amyot's claim is, with some additions, similar to that of Evanturel's. It requires to be reversed, and appears to stand as quoted over leaf.\n\nLieutenant Colonel Amyot, in account with Department of Militia and Defence.\n\nTo 7 days' allowance in lieu of rations and lodgings, at $1 a day, from 31st March to 11th April, inclusive $7.00\n\n9 \" meals en route to Winnipeg, from 3rd to 11th April, inclusive, at 4 cts. $3.60\n\n13 \" rations at Winnipeg, from 12th to 24th April, at 40 cts. $5.20\n\n3 \" meals, en route to Calgary, 25th to 27th April, at 40 cts. $1.20\n\n2 \" board at Calgary, between 28th and 30th April, at 40 cts. $0.80\n\n4 \" meals, returning to Winnipeg, 7th to 10th July, at 40 cts. $1.60\n\n5 \" meals, returning to Quebec, 16th to 21st July, at 40 cts. $2.00\n\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at $1. $21.00\n\nGuy's, April, 1885 — V. 119.\n\nTo 24 days' pay for horse and forage, 7th to 30th April, at $1.35. $32.40\n\n31 \" allowance in lieu of forage, 1st to 31st May, at 35c., $10.35\n\nForrest, July, 1885 — V. 50, 51.\n\n7 days' pay for horse, in May, $1. $1.75\n\n30 \" allowance in lieu of forage, 1st to 30th June, at 35 cts. $10.50\n\nLampson, Sept., 1885, account.\n\nTo 21 days' allowance in lieu of forage, 1st to 21st July, at 35 cts. $7.35\n\nAdd — Mexican saddle and bridle provided at Calgary, not accounted for, say $40.00\n\n$150.60\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. & O., 31st March to 2nd April, inclusive at $1. $3.00\n\n110 allowance in lieu of rations, from 3rd April to 31st July, inclusive, at say 40 cts. $44.00\n\nBalance due Department $103.50\n13. Lieutenant LaRue's claim does not appear to be admissible. It is not certified by his Commanding Officer or his Paymaster, and is not presentable. Nevertheless I have examined it, and find it should stand thus:\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983. R. & O., from 31st March to 2nd April, inclusive, at 72 cts. $ 2 16\n\n110 \" allowance in lieu of rations, from 3rd April to 21st July, inclusive, at 40 cts ........................................... 44 00\n\n$ 46 16\n\nCONTRA.\n\nTo 7 days' allowance in lieu of rations and lodgings, at 72 cts., from 3rd March to 6th April, inclusive .................................. $ 5 04\n\n9 \" meals, en route to Winnipeg, 3rd to 11th April, at 40 cts. ......................................................... 3 60\n\n13 \" rations at Winnipeg, 12th to 24th April, at 40 cts ............................................................... 5 20\n\n3 \" meals, en route to Calgary, 26th to 27th April, at 40 cts ......................................................... 1 20\n\n2 \" board at Calgary, between 28th to 30th April, at 40 cts ............................................................ 0 80\n\n4 \" meals, returning to Winnipeg, 7th to 10th July, at 40 cts ............................................................ 1 60\n\n5 \" meals, returning to Quebec, 16th to 21st July, at 40 cts ............................................................ 2 00\n\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at 72 cts .............................................. 15 12\n\n34 56\n\nBalance apparently due LaRue ........................................... $11 60\n\nWith the proviso stated in re rations in the case of Fiset.\n\n14. Captain Talbot's claim is erroneous and stands thus:\n\nBy 3 days' allowance in lieu of rations and lodgings, from 31st March to 2nd April, at 76 cts ........................................... $ 2 28\n\n110 \" allowance in lieu of rations, at say 40 cts., 3rd April to 21st July, inclusive ........................................... 44 00\n\n$46 28\n\nCONTRA.\n\nTo 7 days' allowance in lieu of rations and lodgings, at 76 cts., from 31st March to 6th April ........................................... $ 5 32\n\n9 \" meals, en route to Winnipeg, 3rd to 11th April, inclusive, at 40 cts ......................................................... 3 60\n\n13 \" rations drawn at Winnipeg, 12th to 24th April, at 40 cts ............................................................... 5 20\n\n3 \" meals, en route to Calgary, 25th to 27th April, at 40 cts ......................................................... 1 20\n\n2 \" board at Calgary, 28th to 30th April, at 40 cts ............................................................... 0 80\n\n4 \" meals, returning to Winnipeg, 7th to 10th July, at 40 cts ............................................................ 1 60\n\n5 \" meals, returning to Quebec, 16th to 21st July, at 40 cts ............................................................ 2 00\n\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July ............................................................ 15 96\n\n35 68\n\nApparently due Talbot ........................................... $10 60\n\nBut this officer being the Quartermaster is specially responsible through his Commanding Officer, for the rations and forage issued by McGibbon to him at Calgary, for the use of the Battalion returning East, and these are not accounted for in any way.\n\n15. With reference to Captain Fiset's claim, M. M. & D., A 4,015, A.G. 15,895, that officer was paid $5 less than the amount of his Company's pay-list for June, by Forrest, in July, 1885. I assume, however, inasmuch as this officer has not sent in his claim for rations, that he was on detachment, I, therefore, now propose to deal with all officers who have not sent in claims.\n\nCaptain Fiset, No. 2 Company, in account with the Department:\n\n(Assumed to have served on Detachment.)\n\nTo 7 days' allowance in lieu of rations and lodgings, at 76 cts., vide 983. R. & O., 31st March to 6th April, inclusive ........ $ 5 32\n\n9 \" meals, en route to Winnipeg, 3rd to 11th April, inclusive, at 40 cts ......................................................... 3 60\n\n13 \" rations, at Winnipeg, 12th to 24th April, inclusive, at 40c. ......................................................... 5 20\n\n77 \" meals or rations, 25th April to 10th July, from leaving until return to Winnipeg, at 40 cts ......................................................... 30 80\n\n5 \" meals, returning to Quebec, 16th to 21st July, at 40 cts ............................................................ 2 00\n\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at 76 cts ......................................................... 15 96\n\n$62 88\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. & O., 31st March to 2nd April. $2 28\n\n110 \" allowance in lieu of rations, 3rd April to 21st July, inclusive, at 40 cts. 44 00\n\nAmount under paid by Forrest in July on account of Company pay for June. 5 00\n\nBalance due to Department. $11 60\n\nMajor T. Roy, in Account with the Department.\n\n(Assumed to have been on Detachment)\n\nTo 7 days' allowance in lieu of rations and lodgings, from 31st March to 6th April, at $1 per day. $7 00\n\n9 \" meals en route to Winnipeg, 3rd to 11th April, inclusive, at 40c. 3 60\n\n13 \" days' rations, at Winnipeg, 1st to 24th April, at 40c. 5 20\n\n77 \" Meals or rations paid for or drawn, from 25th April to 10th July, from leaving to return to Winnipeg. 30 80\n\n5 \" meals, returning to Quebec, from 16th to 21st July, at 40c. 2 00\n\nTo 21 days allowance in lieu of rations and lodgings, 1st to 21st July at $1 a day. 21 00\n\nGuy's April, 1885.—V. 119.\n\nTo 24 days pay for horse and forage allowance, from 7th to 30th April, inclusive, at $1.35. 32 40\n\nForrest, July, 1885.—V. 50 and 61\n\nTo 31 days' allowance in lieu of forage, 1st to 31st May, at 30 cents. $10 85\n\n7 \" pay for horse in May, at $1. 7 00\n\n30 \" allowance in lieu of forage, 1st to 30th June, at 35 cents. 10 50\n\n21 \" to 21st July. 7 35\n\nLampson's acct., Sept., 1885.\n\nAdd 1 Mexican saddle and bridle provided at Calgary, not accounted for, say. 40 00\n\n177 70\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. & O., 31st March to 2nd April inclusive at $1. $3 00\n\n110 days' allowance in lieu of rations, 3rd April to 21st July inclusive, at say 40 cts. a day. 44 00\n\nBalance due Department. $130 70\n\n17. Captain and Adjutant Casgrain, in Account with Department.\n\n(It is assumed this officer served at Calgary.)\n\nTo 7 days' allowance in lieu of rations and lodgings, from 31st March to 6th April, inclusive, at 90 cts. $6 30\n\n9 \" meals provided en route to Winnipeg, from 3rd to 11th April, inclusive, at 40c. 3 60\n\n13 \" rations drawn at Winnipeg, 12th to 14th April, at 40c. 5 20\n\n3 \" meals en route to Calgary, 25th to 27th April, at 40c. 1 20\n\n2 \" board at Calgary, 28th to 30th April, at 40c. 80\n\n4 \" meals returning to Winnipeg, 7th to 10th July, at 40c. 1 60\n\n5 \" meals returning to Quebec, 16th to 21st July, at 40c. 2 00\n\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, vide 983, R. & O., at 90 cts. a day. 18 90\n\nGuy's April, 1885.—V. 119.\n\nTo 24 days' pay for horse and forage allowance, 7th to 30th April, inclusive, at $1.35. 32 40\n\nForrest, July, 1885.—V. 50 and 61.\n\nTo 31 days' pay for horse and allowance in lieu of forage, 1st to 31st May, at $1.35. 41 85\n\n30 \" pay for horse and allowance in lieu of forage, 1st to 30th June, at $1.35. 46 50\n\n21 \" pay for horse and allowance, 1st to 21st July. 28 35\n\nLampson, Sept., 1885.\n\nAdd 1 Mexican saddle and bridle provided at Calgary, not accounted for, say. 40 00\n\n$222 70\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. and O.,\n31st March to 2nd April, inclusive, at $1......................$ 3 00\n110 \" allowance in lieu of rations, from 3rd April to 21st July,\ninclusive, at say 40 cts. a day............................. 44 00\n\nBalance due Department...........................................$175 70\n\n18. Surgeon A. De Blois, in Account with Department of Militia and Defence.\n(Assumed to have served with Headquarters at Calgary.)\n\nTo 7 days' allowance in lieu of rations and lodgings, from 31st March\nto 6th April, vide 983, R. and O., at $1 per day.................$ 7 00\n9 \" meals provided en route to Winnipeg, from 3rd to 11th April,\nat 40 cts.......................................................... 3 60\n13 \" rations drawn at Winnipeg, 12th to 24th April, at 40 cts.... 5 20\n3 \" meals en route to Calgary, 26th to 27th April, at 40 cts...... 1 20\n2 \" board at Calgary, between 28th to 30th May, at 40 cts...... 0 80\n4 \" meals returning to Winnipeg, 7th to 10th July, at 40 cts.... 1 60\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts...... 2 00\n21 \" allowance in lieu of rations and lodgings, from 1st to 21st\nJuly, at $1....................................................... 21 00\n\nGuy, April, 1885.—V. 118.\nTo 24 days' pay for horse and allowance in lieu of forage, to 20th\nApril, at $1.35.................................................. 32 40\n\nForrest, July, 1885.—V. 50 and 51.\nTo 31 days' pay for horse and allowance in lieu of forage, 1st to 31st\nMay, at $1.35.................................................. 41 85\n30 \" pay for horse and allowance in lieu of forage, 1st to 30th\nJune, at $1.35.................................................. 40 50\n\nLampson, Sept., 1885, account.\nTo 31 days' pay for horse and allowance in lieu of forage, 1st to 21st\nJuly, at $1.35.................................................. 28 35\nAdd 1 Mexican saddle, provided at Calgary, not accounted for, say.... 40 00\n\n$225 50\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. and O.,\n31st March to 2nd April, inclusive, at $1......................$ 3 00\n110 \" allowance in lieu of rations, 3rd April to 21st July, inclusive,\nsay 40 cts. a day............................................. 44 00\n\nBalance due Department...........................................$178 50\n\n19. Rev. Father Faguy.\n\nNo claim made, but his account is the same as that of Captain Talbot; with the proviso in\nrations unaccounted for by the Battalion, Father Faguy is entitled to receive the sum of $10.60.\n\n20. Lieut. Hamel, No. 1 Company, in Account with Department.\n(Assumed to have served on Detachment.)\n\nTo 7 days' allowance in lieu of rations and lodgings, from 1st March to\n6th April, inclusive, at 72 cts..................................$ 5 04\n9 \" meals provided en route to Winnipeg, 3rd to 11th April, at\n40 cts.......................................................... 3 60\n77 \" meals or rations, 25th April to 10th July, from leaving to\nreturn to Winnipeg, at 40 cts. a day........................ 30 80\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts...... 2 00\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July,\nat 72 cts....................................................... 15 12\n13 \" rations drawn at Winnipeg, 12th to 24th April, at 40 cts.... 5 20\n\n$61 76\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, vide 983, R. and O.,\n31st March to 2nd April, inclusive, at 72 cts..................$ 2 16\n110 \" allowance in lieu of rations, from 3rd April to 21st July,\ninclusive, at 40 cts........................................... 44 00\n\nBalance due Department...........................................$ 15 60\n21. Lieutenant Casgrain, No. 2 Company, in Account with Department.\n\n(Assumed to have served on Detachment.)\n\nTo 7 days' allowance in lieu of rations and lodgings, 31st March to 6th April, at 72 cts ........................................... $5.04\n9 \" meals en route to Winnipeg, 3rd to 11th April, inclusive, at 40 cts .................................................. 3.60\n77 \" meals or rations, 25th April to 10th July, from leaving to return to Winnipeg, at 40 cts .................................. 30.80\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts ............ 2.00\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at 72 cts .................................................. 15.12\n13 \" rations drawn at Winnipeg, 12th to 24th April, at 40 cts ............ 5.20\n\n$61.76\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, 31st March to 2nd April, at 72 cts ........................................... $2.16\n110 \" allowance in lieu of rations, 3rd April to 21st July, at 40 cts ......... 44.00\n\nBalance due Department ........................................... $15.60\n\n22. 2nd Lieut. D. W. Maurice, No. 2 Company, in Account with Department.\n\n(Assumed to have been on Detachment)\n\nTo 7 days' allowance in lieu of rations and lodgings, at 69 cts ........................................... $4.83\n9 \" meals provided en route to Winnipeg, at 40 cts .................................. 3.60\n13 \" rations drawn at Winnipeg, 12th to 24th April, at 40 cts ............ 5.20\n77 \" meals or rations, 25th April to 10th July, at 40 cts .................. 30.80\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts .............. 2.00\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at 69 cts ........................................... 14.49\n\n$60.92\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations and lodgings, 31st March to 2nd April, inclusive, at 69 cts ........................................... $2.07\n110 \" allowance in lieu of rations and lodgings, 3rd April to 21st July, at 40 cts ........................................... 44.00\n\nBalance due Department ........................................... $14.85\n\n23. Captain Chouinard returned home from Mattawa when en route for the West, and was paid and subsisted to 12th April.\n\n24. Captain Drolet, No. 3 Company, in Account with Department.\n\n(Assumed to have been on Detachment)\n\nTo 7 days' allowance in lieu of rations and lodgings, 31st March to 6th April, inclusive, at 76 cts ........................................... $5.32\n9 \" meals provided en route to Winnipeg, at 40 cts .................................. 3.60\n13 \" rations at Winnipeg, 12th to 24th April, at 40 cts .................. 5.20\n77 \" meals or rations, 25th April to 10th July, at 40 cts .................. 30.80\n5 \" meals returning to Quebec, 16th to 21st July, at 40 cts .............. 2.00\n21 \" allowance in lieu of rations and lodgings, 1st to 21st July, at 76 cts ........................................... 15.96\n\n$62.88\n\nCONTRA.\n\nBy 3 days' allowance in lieu of rations, 31st March to 2nd April, at 76 cts ........................................... $2.28\n110 \" allowance in lieu of rations, 3rd April to 21st July, at 40 cts .......... 44.00\n\nBalance due Department ........................................... $16.60\n\n25. The account of W. D. Baillaigé, of No. 3 Company, stands the same as that of Lieutenant Casgrain, No. 2 Company. There is a balance due the Department of $15.60.\n26. The account of Lieutenant Labranche, No. 4 Company, is the same as Casgrain, No. 2 Company. Balance due Department, $15.60.\n\n27. The account of Lieutenant Fiset, No. 4 Company, is identical with that of 2nd Lieutenant Maurice, No. 2 Company. Balance due Department, $14.85.\n\n28. The account of Captain F. Pennie, No. 5 Company, is similar to Drolet's. He owes the Department $16.60.\n\n29. Lieutenant F. V. Dupuis, No. 5 Company, is identical with that of Labranche, of No. 4. Due to Department, $15.60.\n\n30. 2nd Lieutenant A. Dion's account (No. 5 Company) is the same as that of Maurice, of No. 2 Company. Balance due to the Department, $14.85.\n\n31. The account of Lieutenant A. Shehyn is identical with that of Lieutenant Casgrain, No. 2 Company. Balance due Department, $15.60.\n\n32. The account of Captain Pinault, No. 7 Company, is identical with that of Captain Drolet, No. 3 Company. Balance due Department, $16.60.\n\n33. The account of Lieutenant Pelletier, No. 7 Company, is identical with that of Lieutenant Casgrain, No. 2. Balance due Department, $15.60.\n\n34. The account of 2nd Lieutenant Routhier, No. 7 Company, is identical with that of 2nd Lieutenant Maurice, No. 2. Balance due Department, $14.85.\n\n35. The Corps being supplied with rations for the men, and forage for their horses, I have charged the forage to the individual officers, charge against the respective Companies the money drawn at Quebec, from Lampson, on account of one day's subsistence of the men at Quebec, in July last. It will be borne in mind that up to the date the Corps was relieved from duty, no account whatever was given of the two cars of rations and forage issued to the Battalion, on leaving Calgary for the East, by Mr. McGibbon.\n\nNo. 1 Company, 29 non-commissioned officers and men, at 40 cts. $11.60\n\n|   |   |\n|---|---|\n| 1 | 30 | $12.00 |\n| 2 | 22 | $8.80 |\n| 3 | 25 | $10.00 |\n| 4 | 27 | $10.80 |\n| 5 | 24 | $9.60 |\n| 6 | 32 | $12.80 |\n| 7 | 14 | $5.60 |\n\nOvercharge to the Department... $31.20\n\n36. I do not know the value of the three horses unaccounted for, and chargeable to the Battalion, but it is within the bounds of reason to assess their value at $100 each, or $300 in all; because, even if they cost less, the officers of the Corps who brought them East, were aware of the fact that they had no further use for them when ordered home, and that they should have returned them to the Supply Officer, at Calgary, before leaving. Of the five horses originally furnished the Corps, two it appears have been accounted for since it reached Quebec; and it is doubtful whether I should allow the Corps the option of settling for the remaining three horses, without adding the cost of the transport from Calgary to Quebec of the five. I suggest, however, the $300 be allowed to pass, because McGibbon knew these horses were Government property, and neither notified the Commissariat Department at Winnipeg, nor took any steps to recover them; nor even mentioned the matter until it came up in connection with the present claims. Say due the Department for 3 horses, $300.\n\n37. With reference to the proceedings of the Commission on War Claims, under date 25th January last, I requested Lieutenant-Colonel Amyot, on account of War Claim No. 811, Mrs. Shearer, Fort McLeod, making palliasses, &c., for 9th Battalion, $48, to make a refund of that amount in accordance with the Minister's decision. The refund has not been made, and the charge remains against the Battalion $48.\n\n38. Report No. 102, War Claims Commission, Statement No. 6, Hudson's Bay account, Voucher No. 416: \"Subsistence of Officers of 9th Battalion while on a pleasure trip to the Rockies; $77.50.\" The Commanding Officer of the Corps should be called upon to refund to the Department. Balance due Department, $77.50.\n\n39. Report No. 102, Statement No. 13, Hudson's Bay Company's account, Voucher No. 711, Calgary—Strew hats and helmets, $100.77, for the 9th Battalion. Supply Officer Woolsey paid for one lot of helmets, and the Corps (including Officers) was supplied from Government Stores, Winnipeg, with white helmets by order of the Director of Stores. The Officer Commanding the 9th Battalion should be called upon to refund the amount to the Department. Due to the Department, $100.77.\n\n40. There is also a quantity of stores, referred to in my letter to you under date 1st June last, to be accounted for by the 9th Battalion—with the exception of the saddles and bridles which I have charged in this statement.\n\n41. From the foregoing it is evident the 9th Battalion owes the Department for a car of rations at least. That is assuming the forage to have been used, though the forage was drawn on the return journey when at Winnipeg. Due the Government one car rations (food) for men, value not known.\n\n* Should read 2nd Lt. Beique, and his account similar to that of 2nd Lt. Maurice, Balance due Dept. $13.65.\n### 42. SUMMARY.\n\n**The 9th V. Q. Battalion, in Account with Department.**\n\n| Name          | Amount Due |\n|---------------|------------|\n| Amyot         | $13        |\n| Fiset         | $16        |\n| Roy           | $18        |\n| Oasgrain      | $17        |\n| De Blois      | $18        |\n| Hamel         | $20        |\n| Oasgrain      | $21        |\n| D. W. Maurice | $22        |\n| Drolet        | $24        |\n| Baillarge     | $25        |\n| Labranche     | $26        |\n| Fiset         | $27        |\n| Pennie        | $28        |\n| Dupuis        | $29        |\n| Dion          | $30        |\n| Shehyn        | $31        |\n| Beique        | $32        |\n| Pelletier     | $33        |\n| Routhier      | $34        |\n\nOn account of allowance in lieu of rations for the men of the 8 companies, overdrawn, at 40 cts. *Vide Sec. 35, this Report*.\n\nAmount due Department on account of 3 horses. *Vide Sec. 36, this Report*.\n\nWar Claims 611. *Vide Sec. 37, this Report*.\n\nWar Claims Report 102. *Vide Sec. 38, this Report*.\n\nCar of rations (food for Corps). *Vide Sec. 41, this Report*. Value not known.\n\nStores to be accounted for through the General Officer Commanding, *Vide Sec. 40, this Report*. Value not known.\n\n---\n\n**CONTRA.**\n\n| Name          | Amount Due |\n|---------------|------------|\n| Garneau       | $8         |\n| Frenette      | $9         |\n| Le Vasseur    | $10        |\n| Dugal         | $11        |\n| Pinault       | $12        |\n| La Rue        | $13        |\n| Talbot        | $14        |\n| Father Faguy  | $19        |\n| Chouinard     | Nil.       |\n\n---\n\nBalance due Department ........................................... $1,478.52\n\n---\n\n43. The want of a statement from the Officer Commanding the Battalion, which should have accompanied these claims for rations, and shown the names of the officers, stations, and periods at each station, during their term of service in the North-West, has caused me to assume the officers who have not sent in claims served at stations as stated by me in this report. Hence some objection may be taken with regard to the latter; but the report is, on the basis stated; correct.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nGEORGE GUY, Major, &c.\n\nP. M. N.-W. Forces.\n\n[Papers returned herewith M. M. and D., A 2,511; A 2,838; A 3,516 and A 4,015.]\nREPORT No. 158.\n\nOTTAWA, 8th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 851.—M. M. & D., A 6,029.—Allan Melvor, of Birtle, by E. P. Leacock (no amount given), for services of himself and son, proceeding to interview the Indians at Pelly, N.W.T.\n\nNo claim for this service had previously been presented, neither is there a report from Major Boulton on the subject. The Hudson's Bay Company's accounts, however, show A. McIvor was paid on behalf of the Government on order from Major Boulton:\n\n| Item                                      | Amount |\n|-------------------------------------------|--------|\n| Cash for expenses                         | $10.00 |\n| One pair of boots, $6.50; one pair of socks, $1.50 | 8.00   |\n| Tobacco, 50 cents; hat, $1.25; shirt, $2 | 3.75   |\n| Paid two men, trip to Pelly, ten days, $1.50 | 30.00  |\n| Hire of horse, ten days                   | 25.00  |\n| do eight days                             | 20.00  |\n| Use of bob sleigh, left on road           | 5.00   |\n| Board at Pelly                            | 5.25   |\n| do at Boggy Creek                         | 1.50   |\n| do at Asserl                              | 1.35   |\n\n$109.85\n\nAs there appears no doubt these payments were made in connection with the services rendered by the two McIvors, as set forth in Mr. Leacock's letter, and as the men were apparently employed ten days, the payment of $109.85 appears to be a most liberal one, consequently no further sum can be recommended.\n\nApproved—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 159.\n\nOTTAWA, 8th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 598.—M. M. & D., A 3,989.—Courtney A. Saunders, late of Boulton's Mounted Infantry (now of Saltram House, Torquay, England), $25, in lieu of clothing and kit. This claim was reported on 8th August, 1886; and rejected on the ground:\nthe corps had been liberally supplied on Government account, through the Hudson's Bay Company, which the following issues show:\n\nHudson's Bay Co., statement No. 1, Voucher 120, Qu'Appelle—\nPants, underclothing, &c. .................................................. $ 391 80\n\nHudson's Bay Co., statement No. 1, Voucher 172, Qu'Appelle—\nJackets, boots, socks, &c. .................................................. 25 00\n\nHudson's Bay Co., statement No. 1, Voucher 32, Ellice—\nJackets, boots, shirts, socks, &c. ........................................... 147 05\n\nHudson's Bay Co., statement No. 4, Voucher 1, Qu'Appelle—\nClothing and underclothing .............................................. 2,232 09\n\nHudson's Bay Co., statement No. 4, Voucher 1, Swift Current—\nClothing and underclothing .............................................. 781 00\n\nHudson's Bay Co., statement No. 4, Voucher 59, Ellice—\nDuck coats and helmets .................................................. 474 35\n\nHudson's Bay Co., statement No. 4, Voucher 65, Ellice—\nBoots, clothing, &c. .......................................................... 40 90\n\nHudson's Bay Co., statement No. 5, Voucher 214, Winnipeg—\nSix dozen of socks ............................................................ 28 80\n\nHudson's Bay Co., statement No. 4, Voucher 61, Ellice—\nAllowance in lieu ............................................................. 25 00\n\nTotal ................................................................. $4,145 99\n\nIn addition to this large expenditure of $4,145 99; for clothing, &c., tobacco to the value of $73.30, was issued also, making a total per man of $48.49.\n\nThe 90th Battalion went through the campaign without having been properly supplied by the Department, but were subsequently paid $13.95 per man, which was considered a fair amount.\n\nIf Major Boulton made any special promises to his men, it was a personal or regimental matter, an exceptionally high rate of pay for use of horses having been granted that officer, by authority of the Minister, to enable him to meet exceptional engagements; but, in any case, no further payment on account of clothing can be recommended, either individually or to the corps.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 160.\n\nOTTAWA, 13th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 816.—M. M. & D., A 3,734.—Certain Chippaweyan Indians, at Beaver River, and Onion Lake, N.W.T., for twenty-six head of cattle, taken and slaughtered for use of the troops when north of Fort Pitt.\n\nNo weight or price was given when the claim was rendered, consequently a large amount of correspondence has taken place with the Assistant Commissioner of Indian Affairs and Supply and Transport Officers, with a view of obtaining such information as would enable the Commission to arrive at a just conclusion, so as to\nrecommend paying these loyal Indians fully what they are entitled to. Mr. Hayter Reed, Assistant Commissioner of Indian Affairs, has given an approximate value, which appears very much higher than is warranted by the report of Sergt.-Major J. S. Benn, Assistant Supply Officer, who gives the weight of animals slaughtered, and received by him; but as steers and calves were weighed together, it is difficult to arrive at the different values. Being desirous of recommending a liberal payment, on request, a competent person has kindly given a valuation of each, and after having compared these with prices paid for oxen at Fort Pitt, and considered the other valuations, payment of such prices are recommended as follows, which may be considered very liberal, as the cattle were taken alive; in recommending these sums, the value of the hides and tallow are included.\n\nCertificates given by Major General Strange and Rev. Father L. Legoff, appear to leave no doubt as to the number of cattle taken, and the latter gives the names of owners with the respective animals.\n\nIt is therefore recommended that the following sums be paid:\n\nJacquot Janvier—\n2 steers, 3 years' old, at $60..................................................$120 00\n2 do 2 do at $40.................................................................80 00\n4 do 1 do at $25.................................................................100 00\n5 calves, 2 and 3 months old, $12...........................................60 00\n\n$360 00\n\nNarcisse Issiaciage—\n1 steer, 2 years' old, at.........................................................$ 40 00\n1 calf, 1½ months old, at.......................................................10 00\n\n$50 00\n\nAntoine Janvier, sen.—\n1 steer, 1 year old.............................................................$ 25 00\n\nBaptiste la Grosse-Tête—\n1 heifer, 1 year old............................................................$ 30 00\n1 bull, 1 year old...............................................................25 00\n1 calf, 1 month old..............................................................8 00\n\n$63 00\n\nLaurent Dy-Enake—\n1 heifer, 1 year old............................................................$ 30 00\n\nLouis Janvier—\n1 calf.................................................................$ 12 00\n\nJean Tcho—\n1 calf, 6 months' old..........................................................$ 18 00\n\nBaptiste Grandbois—\n1 steer, 2 years' old............................................................$ 40 00\n\nMichel Montaghairs—\n2 calves at $10 each..........................................................$ 20 00\n\nNabatoche Vieux—\n1 ox, 6 or 7 years' old.........................................................$ 90 00\nMaking the total payment of $708, showing a reduction of $217 on approximate value of Mr. Reed.\n\nIt is recommended these payments be made through the Indian Commissioner, copy of respective valuations and names of claimants to accompany cheques.\n\nThe Minister has authorized the payment of this claim, reduced to $708.\n\nC. EUG. PANET, D. M. M. & D.\n\n6-11-86.— W. H. JACKSON, Lt.-Col., D.A.G.\nChairman.\n\nTo the Secretary,\nWar Claims Commission,\nOttawa.\n\nSir,—At this distance of time, and in the absence of documents and of the Supply Officers, I cannot certify to detail of cattle killed for rations for Force on Beaver River, especially as some were used by General Middleton's Force, but I believe the number stated to be about correct.\n\nI would suggest your applying to Captain Wright, 43rd Regiment Supply Officer, or Mr. Benn, Assistant Supply Officer, now in Post Office Department, Ottawa.\n\nYour obedient servant,\n\nT. B. STRANGE,\nMajor-General,\nlate Commanding Alberta Field Force.\n\n(Extract.)\n\nI, the undersigned Missionary Priest, certify that the above claims are correct and according to fact.\n\nI know all the Indians, and I am certain that they have really lost all that they claim, with the exception of \"Michel Montagnais,\" who was absent; therefore I do not know the exact number of cattle that the Troops took from him.\n\nI feel I am right in marking the two calves opposite his name.\n\nThe Montagnais assure me that they saw these two calves when they drove the herd to General Strange's Camp, and they did not see them afterwards.\n\nI have not marked down a cow which the above mentioned Michel has also lost, although my Montagnais are certain she was eaten by the Troops.\n\nL. LEGOFF,\nPriest.\n\nIn addition—\n\nAmable Tu Caa—1 horse .......................................................... $75.00\n\nBaptiste Sargent—1 mare ......................................................... $60.00\n\n1 foal ........................................................................... 20.00\n\nL. LEGOFF,\nPriest.\n\nREPORT No. 161.\n\nOTTAWA, 15th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 850.—M. M. & D., A 6,071.—O. E. Hughes & Co., Prince Albert, agent for Stobart, Sons & Co., presented by Macdonald, Tupper & Phippen, of Winnipeg, for 10 cords of wood, at $3.50, $35.\nIt appears by a certificate of J. H. Underwood, Commissariat Officer, when General Middleton's column reached Prince Albert, they took the wood and used it, without giving a requisition, and as the price appears reasonable, it is respectfully recommended for payment in full, the cheque to be forwarded through Macdonald, Tupper & Phippen, Winnipeg.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A.G.,\nChairman.\n\nREPORT No. 162:\n\nOTTAWA, 22nd October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 822.—W. H. Trounce, of Saskatoon, three items, viz.: 2½ days' board of Thomas Fawcett, and horse, of the Intelligence Corps, at $6 per day, $15; two days each for two men driving cattle from Fish Creek to Saskatoon, $3 each, $12; and one team, four days, going to Elbow and return, at $8 per day, $32. Total, $59.\n\nFawcett gave a receipt for 2½ days' board of self and horse, without naming any sum. As the charge of $6 per day is exorbitant, it is recommended $2 per day be paid, making $5.\n\nThe second item of $3 per day, for men driving cattle, is also considered too high. It is therefore recommended that $2 per day per man be paid, making $8.\n\nThe third item of one team, four days, at $8 per day, is also excessive, as the claimant (Trounce) furnished teams, 4th June, to Deputy Surgeon-General Roddick, for conveying medical supplies from Moose Jaw to Saskatoon at $5 per day, and for conveying convalescents from Saskatoon to Moose Jaw at the same price. It is therefore recommended $5 per day be paid for this service, making $20.\n\nS. L. Bedson certifies to the last two items, and Fawcett's receipts show the board and horse feed were had. It is therefore respectfully recommended the total sum of $33 be paid in full of claim, showing a reduction of $26.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 163.\n\nOTTAWA, 26th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 855.—Lieut.-Col. A. Peebles, of Winnipeg, the difference between his pay of $41.66 per month, and $4.87 per day, the pay of his rank, 321 days, to 30th September, 1886; $1,229.\n\nLieut.-Col. Peebles is Superintendent of Stores and District Paymaster, at a salary of $500 per annum, and when appointed it was understood he was to have free\nhouse and garden in Fort Osborne, and fuel for his office, and as this office was a room in the dwelling, the fuel assisted largely in warming the house.\n\nOn the formation of the Mounted Infantry School Corps, the claimant was compelled to give up his quarters and rent a dwelling at $360 per annum; and as he now receives no fuel, nearly, if not all, his salary goes to pay this additional expense.\n\nThe \"A\" and \"B\" Batteries having been continued in the North-West after the Rebellion, Col. Peebles had to pay these Corps, together with all contractors' claims, as well as perform a similar service for the Mounted Infantry School Corps; and the calling into store of large quantities of equipment distributed throughout Manitoba and the North-West Territories during the troubles, has necessitated constant and laborious duties. As Paymasters making similar payments, where permanent Corps are located, receive extra remuneration, and as the claimant has previously been paid $3.50 per day for extra services in connection with the North-West Forces, I would most respectfully recommend a similar payment now, making a total of $1,123.50, showing a reduction of $105.50.\n\nRejected.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 164.\n\nOTTAWA, 28th October, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE:\n\nW. C. No. 34.—M. M. & D., A 2,471.—John Cottingham, $678.50, for saddlery supplied the Troops, Calgary; previously reported on, and rejected on the ground the claims were all against Steele's Scouts, and should be paid for by the men who received the goods. The correspondence shows some of the articles were for the Alberta Mounted Rifles, and the Alberta Field Force, which were returned and sold by auction on Government account, as stated by Major-General Strange in his letter of 3rd July, 1886.\n\nCaptain J. K. Oswald, late of Steel's Scouts, now Lieutenant, Mounted Infantry School Corps, Winnipeg, in letter of 16th February, 1886, says he has in his possession $244.75 which was stopped from the pay of men belonging to Steel's Scouts to pay for articles furnished by Cottingham.\n\nIt is therefore most respectfully recommended Captain Oswald be required to refund that sum to the Department, and Cottingham's claim be paid in the usual way; $50 was advanced by the Department to the claimant on 26th August, 1885, and three saddles ($99) appear to have been charged twice, they having been included in a payment made by the Hudson's Bay Co. These sums ought therefore to be deducted from the claim, which would be as follows:\n\nTotal claim.................................................. $678.50\nLess paid by Department................................. $50 |\nThree saddles charged................................. 99 }\nBalance recommended for payment..................... $529.50\nLess paid by Captain Oswald, as per his letter, 20th November, 1886, and Cottingham's receipt 10th March, 1886. 194.75\n\n$334.75\n\nApproved—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nMILITARY COLONIZATION RANCH,\nP. O. Gleichen, Alberta, 8th July, 1886.\n\nTo Sir A. P. Caron, K.C.M.G., &c.,\nMinister of Militia\n\nSir.—The account for saddlery, &c., due to Mr. John Cottingham, furnished by him for Alberta Field Force on my order, acting on your authority to assume command, has not been paid.\n\nI notice in the report (Blue Book) for 1886, a recommendation signed by you that Mr. Cottingham should be paid by me, or Major Steele, commanding the Corps, to whom the saddlery was supplied.\n\nYou cannot be aware that the saddlery in question was returned into Government charge and sold by their order by Mr. Metcalfe, Auctioneer for the Government at Calgary, on the disbandment of the Force.\n\nAt the time the saddlery was ordered there was no means of any other supply. I had urgent orders from General Middleton to march north as soon as possible, to relieve Edmonton. Not only had Mr. Cottingham my authority, but also that of General Middleton, to whom Mr. Cottingham applied personally, at Qu'Appelle, being furnished by me with a letter to General Middleton, in which the prices were stated.\n\nGeneral Middleton directed Mr. Cottingham to supply, as quickly as possible, as there was no available saddlery suitable for the North-West in store at that time, nor procurable at short notice.\n\nAs you are now in possession of the above facts, I have no doubt you will see the justice of Mr. Cottingham's claim, and its exceptional character, and that you will order payment.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nT. B. Strange, Major-General,\nLate Commanding Alberta Field Force.\n\nWINNIPEG, 16th February, 1886.\n\nTo Lt.-Col. Houghton, D.A.G.,\nWinnipeg.\n\nSir,—I have the honor to acknowledge receipt of your memo. regarding certain papers and vouchers forwarded to you by the Militia Department, and handed to me by you for explanation, said documents being accounts claimed by John Cottingham, saddler, late of Calgary, N.W.T., from Government and \"Steele's Scouts.\"\n\nThe items due by \"Steele's Scouts\" are the following:\n\n| Item          | Amount |\n|---------------|--------|\n| Sergt.-Major Wilson | $17.50 |\n| Trooper Miller   | 10.00  |\n| Williams         | 4.00   |\n| Benoit           | 60.00  |\n| Smith            | 7.00   |\n| Fisk             | 10.00  |\n| Alley            | 9.50   |\n| McQuarrie        | 65.00  |\n| Kendig           | 3.50   |\n| Simons           | 4.75   |\n| Paton            | 50.00  |\n\nThis total of $244.75 I hold, and have done so since July last, having deducted the amount from the men's pay. Cottingham left Calgary before our return from the front, and I could not find him or the vouchers—I am prepared to pay the amount on receiving the enclosed receipt and discharge issued by Cottingham, with the vouchers attached cancelled and delivered up.\n\nThe sum of $50 advanced by the Militia Department, I will deduct from said total of $244.75, and credit in my account submitted to the President of Commission on War Claims on the 7th December last.\n\nWith reference to the balance of Cottingham's account, the items representing said balance were ordered by General Strange, for the use of his Column, and charged against Government. None of the articles were issued to my men, except gun slings, which were issued with the rifles belonging to Government, and returned into store with said rifles, at Calgary, on our arrival back from the front. Three spare saddles were carried in some of the transport waggons; and I know one was stolen at Fort Pitt, and two were lost on active service. Major Hatton got another spare saddle, that was left in my orderly room, before we left for the front; the others were issued to Couriers and Alberta Mounted Rifles, I understand, but not to any of \"Steele's Scouts.\"\n\nI was most particular, after our return to Calgary, in seeing all property of the Government, in the possession of \"Steele's Scouts,\" returned into store before I commenced paying the men. All said property was sold by the Government Auctioneer.\nI must remind the Department, after the wholesale stealing at Fort Pitt, it was next to impossible to account for all Government property; we recovered what we could, but not only was Government property taken away from there, but my own men, on their return from Loon Lake, found nearly all their personal baggage stolen, for which they have never yet received compensation.\n\nI herewith return all the documents.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nJ. K. OSWALD, Capt. and Adjt.,\n\"Steele's Scouts Cavalry, A.F.F.\"\n\nMOUNTED INFANTRY BARRACKS,\nFORT OSBORNE, WINNIPEG, 20th November, 1886.\n\nTo Lieut.-Col. JACKSON, D.A.G.,\nChairman War Claims Commission,\nOttawa.\n\nSir.—I have the honor to acknowledge receipt of your favor of 3rd instant, and now beg to enclose copy of receipt from John Cottingham (certified correct by Lt. Col. Taylor), for $244.75. I cannot part with the vouchers, as they are the only evidence I hold for the money paid out. They have already passed through the Militia Department and the Adjutant General's office, as well as the receipt. I trust this will be sufficient to satisfy you as to what has been paid, and allow of your getting the balance of the claim. You will note that there are several vouchers paid that are not mentioned in your letter.\n\nMy letter of 16th February, 1886, to Lieut.-Colonel Houghton, D.A.G., fully explains the question re the voucher of $335.25. None of these saddles were for officers of the Corps. They had their own saddlery, which they paid for themselves.\n\nI have &c.\n\nJ. K. OSWALD, Capt. and Adjt.,\nLate \"Steele's Scouts Cavalry, A.F.F.\"\n\nReceived this 15th day of March, A.D. 1886, from J. K. Oswald, Captain and Adjutant, \"Steele's Scouts of Cavalry, A.F.F.\", the sum of two hundred and forty-four dollars ($244.75) less the sum of fifty dollars ($50.00) advanced me by the Militia Department. The said amount of $244.75 being payment in full for saddlery and other articles purchased from me by certain members of \"Steele's Scouts,\" as per vouchers attached, which are hereby cancelled and delivered up.\n\n$244.75.\n\n(Signed) JOHN COTTINGHAM,\n\nWitness,\nP. O'LEARY, P.M.,\nP. H. HEALY,\n10th March, 1886.\n\nTrue copy,\n20th November, 1886.\nJOHN B. TAYLOR, Lt. Col.\nCommandant S. M. I.\n\nREPORT No. 165.\n\nOTTAWA, 3rd November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 758.—The Canadian Pacific Railway Company, $852,331.32, subsequently rendered by the Railway Company, after the passage of the Order in Council, 30th January, as $759,361.69, and again increased through errors in the account, discovered during the audit by $1,286.44, making the amended claims $760,648.13, to be settled on the basis of the Order in Council above referred to.\n\nA careful audit having been made, the different charges compared with the terms authorized, and the annotations for corrections having been submitted from time to time to the officials of the Company, for consideration and reply, as shown by the\ncorrespondence attached, by reference to which it will be observed the most liberal construction of the Company's claim has been given, resulting in the following adjustment, which is respectfully recommended as a final settlement:\n\nTo amount paid on account ........................................... $700,000 00\nTo amount of reduction as per papers A, B, F, and G ........................................... 21,744 00\nBalance recommended for payment .................................... 38,903 87\n\nTotal ........................................................................... $760,648 13\n\nShowing reductions as follows:\nAs agreed by the Railway Company .................................. 92,969 63\nAs shown on paper \"G\" .............................................. $31,744 26\nLess amount added on paper \"G\" ..................................... 1,286 44\n\nTotal ........................................................................... $113,427 45\n\nOr on the various claims ................................................. $114,713 89\n\nThe charge for meals being so much in excess of what it should have been for the Troops, the Commanding and Supply Officers were called upon for a return showing the number taken by the respective Corps. All gave returns showing exact number of meals taken at the respective stations, except Lieut.-Colonel Oswald, commanding Montreal Garrison Artillery, who said he was unable to do so, but that he gave receipts in all cases which the Railway Company should produce. This they failed to do. So, in order to deal liberally, the whole number charged to this Corps have been allowed, notwithstanding the absence of vouchers. There can be no mistake about the correctness of the number of meals allowed for other Corps. As we have the correct returns as above stated. It may be said in relation to this matter, no intention of wrong is attributed to the Railway Officials. As when the service was performed it was the intention to charge all expenses against the Government, consequently meals for the teamsters, and forage for their horses were no doubt included with those given to the Troops, and so returned by the Railway people who had charge of subsistence north of Lake Superior; but, after the Order in Council, 30th January, 1886, establishing a rate per mile to cover all expenses, except the subsistence of the Troops, necessitates the rejection of all expenses in connection with teaming. The large sum of sixty cents per meal has been allowed, and great care has been exercised in order to give the Railway Company credit for every one consumed; and throughout the most liberal construction has been given to the Order in Council affecting the items which make up the claim, with the view of giving the benefit of all doubts in favor of the claimants.\n\nW. C. No. 830.—$9,222.54 for services rendered subsequent to what are contained in the foregoing, and not all chargeable to North-West expenditure. In making the audit, a list has been prepared showing the different branches to which the various services are chargeable; that for the North-West being the only one we could check as to rates, the other items being connected with the ordinary service, and in the absence of any contract, the charges had to be accepted as correct, but it would appear desirable that an Order-in-Council should be passed establishing a rate similar to that given to the Grand Trunk and other railway companies, for future guidance. After deducting $9.95 for tickets for Sergeant McGuire, for which there is no voucher, the balance, $9,212.59 is respectfully recommended for payment, subject to being charged against the respective branches of service to which the items belong.\n\nThe report dated 19th July, 1886, is hereby cancelled, the amounts therein recommended being included in this as a final settlement.\n\nW. H. JACKSON, Lt. Col., D. A. G.,\nChairman.\nG\n\nAMENDED Statement of the Canadian Pacific Railway account, based on revision of audit made under terms of Order in Council, dated 30th January, 1886.\n\n1886. To Amount of account as rendered under terms of:\nOrder in Council............................................. $759,361 69\nUndercharge on voucher 212, paper \"A\"........... 667 44\n\" \" 227, \" \" \" A \" \" 382 00\nSpecial guide and baggage claim...................... 237 00\n\nCONTRA.\n\nJuly, 1885. By Amount paid by Department.................. $400,000 00\nMarch, 1886. \" Paymaster Guy.......................... 300,000 00\n\" Allowed by Company as\nper paper \"A\"............$4,674 06\n\" Disallowed to Company\nas per paper \"A\"....... 7,510 89\n\" Disallowed to Company\nas per paper \"B\". ...... 12,905 44\n\n$26,090 39\n\nLess credited to the Company as\nper paper marked \"F\"........ 3,603 01\n\nBy amount disallowed the Company as per\npaper marked \"F\"......................... 256 88\n\nBalance due to the Company............................. $721,744 26\n\nTotal......................... $760,648 13\n\nSubmitted.\n\nBy order,\n\nGEORGE GUY,\nMajor, and P. M. N.-W. Forces.\n\nTo Lt.-Col. JACKSON, D.A.G.,\nP. S. and P. O.,\nOttawa.\n\nREPORT No. 166.\n\nOTTAWA, 6th November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 831.—Dr. P. W. Rolston, of Birtle, late Surgeon of Boulton's Mounted Infantry, $82, for surgical instruments taken by the enemy at Fish Creek.\n\nAfter the fight, Dr. Rolston was left in charge of the wounded, in the temporary field hospital tents, while the new Camp was being prepared. The wounded were removed as fast as possible by waggon. When the last load was going, Dr. Rolston desired to have two medical boxes and instruments taken; but the Officer in charge refused, saying: \"Another waggon would be sent to take tents and all other appliances.\" They did not arrive, and as the rear guard were retiring, Lieut.-Col. Montizambert ordered Dr. Rolston to join his Corps, which he did, leaving all stores behind. On the following day, when the boxes were recovered, they had been broken open and the instruments gone; supposed to have been taken by the enemy. Major Bolton certifies to the correctness of this statement, and there appears no doubt the occurrence took place.\n\nIn order to make sure of the value of the instruments, the claim was referred to Dr. Roddick, the Deputy Surgeon General, who values them at $57.25, as subsequently rendered by the claimant, which sum is respectfully recommended for pay-\n\n64\nment, less $17 paid by the Hudson's Bay Company to Dr. Rolston for examining seventeen recruits, 6th April, 1885, he having drawn pay as Surgeon of the Troop from the 4th of same month, consequently the examination of recruits would form a part of his duty. Balance recommended, $40.25, making a reduction of $24.75, and $17 previously paid; total, $41.75.\n\nApproved.—A. P. C., M. M. & D.\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 167.\nOTTAWA, 8th November, 1886.\nWAR CLAIMS COMMISSION.\n\nREPORT\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE\n\nW. C. No. 856.—Deputy Surgeon General, T. G. Roddick, $659.95, for various expenses in connection with Dr. Boyd, representative of the Princess Louise, necessaries for sick and wounded, transport and board of nurses' dressers, &c.\n\nDy. Surgn. Genl. Roddick's position appears to have required considerable travelling. He says he was instructed by the Hon. the Minister, to pay particular attention to Dr. Boyd, who had been sent from England by H. R. H. the Princess Louise, with a large and valuable lot of hospital supplies, many of which are now in store at Ottawa. During the hurry and difficulty of procuring written particulars in that sparsely settled portion of the Dominion, vouchers were not procured by the claimant, but as there appears to be no reason to doubt Dy. Surgn. Genl. Roddick's statement, the payment is respectfully recommended, less $15 paid for driving looted horses and cattle from Fish Creek to Saskatoon, there being nothing to show the Government received any benefit from these animals.\n\nClaim $659.95 less $15, balance recommended for payment $644.95.\n\nApproved.—A. P. C., M. M. & D.\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 168.\nOTTAWA, 8th November, 1886.\nWAR CLAIMS COMMISSION.\n\nREPORT\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 839.—Dr. E. E. King, of Toronto, late Field Hospital Corps, for pay, field allowance, rations and instruments.\n\nThis claim has been reported upon by the Deputy Surgeon-General, and pay as Surgeon from August 15th to September 3rd, 1885 (which of course covers rations, or an allowance of $1 in lieu), while doing duty attending wounded and sick soldiers in the Hospital at Winnipeg, also for a case of surgical instruments used up while in the field.\n\nAs Dr. King volunteered for and went out as a dresser, but was subsequently promoted to Surgeon, and drew pay as such, from the date of starting to the date of\npresent claim, and was also supplied with rations, the same as others connected with the Field Hospitals; payment of field allowance and rations cannot be recommended. The following sums, however, are respectfully recommended for payment:\n\n19 days pay at $3.65 .................................................. $69.35\n19 days in lieu of rations .............................................. 19.00\nPocket case instruments and one hypodermic syringe ........... 25.00\n\nTotal ............................................................................. $113.35\n\nMaking a reduction of $239.25.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 169.\n\nOTTAWA, 8th November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 39.—M. M. & D., A 3,103.—B. B. Lariviere, of Wakapa, Manitoba (merchant at Moose Mountain, N.W.T.), $60.50, for provisions purchased by Captain White, commanding Moose Mountain Scouts, for distribution among the Indians; previously reported upon September 15th, 1885, and by direction of the Honorable the Minister of Militia and Defence, referred to the Department of the Interior; referred by the Department of Interior to the Commission on Rebellion Losses, and again returned to the Department of Militia and Defence.\n\nSimilar claims incurred by Lieut.-Col. Thomas Scott and other officers, having been paid, on the principle that a few presents to the different tribes had a beneficial effect on their conduct, it is respectfully recommended this claim be paid in full, and more particularly if one of our officers committed an error; the person furnishing supplies had no knowledge of such, and ought not to be the loser.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D. A. G.,\nChairman.\n\nREPORT No. 170.\n\nOTTAWA, 9th November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 181.—M. M. & D., A 3,015.—W. R. McClellan, of Red Deer, N.W.T., balance of claim, damage to property by the 65th Battalion, $1,395.75.\n\nIt appears Major Perry, Inspector of Mounted Police, in command of Troops in conjunction with Police, rented this property at a high rate, $250 having been already paid therefor. On the arrival of the Detachment of the 65th, the building was loop-holed, a stockade and ditch constructed around the dwelling, and the two\nstables demolished. Mr. J. K. Strachan, employed clearing up the stores, left on this trail, viewed the premises, and says all the charges are exorbitant, except $150 for the two stables; and the lumber left on the premises is of considerable value. The claim has been referred through Lieut.-Col. Onimet to Capt. Normandean, the Officer in Command, and under whose supervision the alterations and work were performed. He reports the claim ought not to be paid, as the material left by the Detachment exceeded in value the damage done by occupation. This appears to apply to the dwelling only, but as the two stables were entirely demolished, $150 is respectfully recommended for payment, the claimant to retain the material left, making a reduction of $1,245.75. It may further be said, other bills for rent, household effects, supplies, services, timber, transport, &c., amounting to $1,675.25, including the $250 previously referred to, and already paid, with the sum now recommended, makes a total of $1,825.25, exclusive of the large quantity of material left upon the premises, which will have been paid to the claimant.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nEdmonton, N.W.T., 17th September, 1885.\n\nSir,—Enclosed I forward claims of Mr. W. R. McClellan, of Red Deer River, for damages, &c., to his property, and for rent of the same, with agreement signed by Major Perry attached.\n\nWith regard to the first claim, I may say that I went over the premises and found that the place (as it is at present) has been virtually rendered useless as a dwelling house. It is surrounded by a stockade or fence about eleven feet high, port holes made on every side of the house (above and below), a large and deep entrenchment on the outside, and his stables completely removed. Of course there is a large amount of material, including pine logs and planks, but of such a length as not to be suitable for building purposes, yet of some value. There is also a quantity (about 1,100 feet) of 2-inch plank, besides large iron hinges, which are not marketable.\n\nIn my opinion the item of $650, as damages to dwelling house, is excessive.\n\nThe other two items of $425 and $170.75, I also think excessive.\n\nThe last item appears to me reasonable.\n\nI am, Sir,\n\nYour obedient servant,\n\nJ. K. STRACHAN.\n\nMajor Guy,\nChief Transport Officer,\nWinnipeg, Manitoba.\n\nTo the President of the North-West Claims Commission.\n\nSir,—In accordance with the request of the Commission I have the honor to make the following report on the subject of Mr. W. R. McClellan's claims.\n\nIn my opinion this claim ought not to be allowed, because the material left by my detachment exceeded in value the damage done by the occupation of the house by the Government troops.\n\nThere remained on the spot many thousand feet of wood quite sound, which had not been in any way damaged, but was quite fit for building purposes.\n\nWhen the item for taking down the old fence is made I cannot see why payment should be granted him, it was far from causing any damage, but on the contrary gave the property a value which it never had before.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nCAPT. NORMANDEAU,\nEx-Commander Red Deer.\n\nTo Lieut.-Colonel JACKSON.\nREPORT No. 171.\n\nOTTAWA, 16th November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 805.—R. G. Macdonnell, Cluny Station, Alberta, $19, for powder and cartridges taken from him by Captain McIntosh, of the Winnipeg Light Infantry.\n\nMajor-General Strange issued an order that all powder and ammunition in stores on Blackfoot Reserves should be taken possession of by the troops, so as to prevent it falling into the hands of Indians; consequently this powder, and 375 centre fire cartridges, were taken possession of, for which a receipt was given, but as the weight of the powder is gross (as shown by Capt. McIntosh's receipt) five pounds are deducted for the weight of the package, making a reduction of $2.25, the balance, $17.55, is respectfully recommended for payment.\n\nApproved.—A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 172.\n\nOTTAWA, 24th November, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. Nos. 6, 7, 283, 702, 750, 818.—M. M. & D., A 4,094, 2,940.—The Qu'Appelle Valley Farming Company:\n\n1. Balance for hire of teams........................................... $4,900 00\n2. Horses said to have been killed, but no proof is presented.................................................. 1,200 00\n3. Ambulance waggon said to have been lost...................... 175 00\n4. Difference in value of horse purchased.......................... 25 00\n5. For use of water tank.................................................. 39 00\n\n$6,339 00\n\nWith the exception of the ambulance and water tank, these claims have previously been reported upon, and now stand as follows:\n\n1. The claimants supplied nearly one hundred teams for the Government transport service, for which they were paid, from about 28th March to 1st May, 1885, the sum of $10 per day for each team; from 1st May until close of operations, $8 per day, with free rations for the teamsters and forage for the horses.\n\nA large number of teams were hired on 8th April, for $6.50 per day.\n\nBell, Lewis & Co., when hauling freight by the ton, hired teams on or about 23rd May, 1885, to carry out the contract, for from $3.50 to $4.50 per day, with restrictions for hauling very much larger loads, and travelling longer daily distances than the Government day teams were doing.\n\nContractors engaged constructing the South-Western and North-Western Railways in Manitoba, during the same summer, were, I have been informed, paying\nabout $3 per day for teams engaged on those works, consequently the claimants have been already paid nearly three times the sum other people were getting for similar service.\n\n2. The claim for dead horses is made under the general contract entered into between the Hudson's Bay Company and contractors furnishing teams. This contract has been submitted to the Honorable the Minister of Justice, who has given an opinion that the Government are not responsible for dead or injured horses. This decision confirmed the action of the Commission in rejecting this and similar claims.\n\n3. The claim for a lost ambulance has not been supported by any evidence. The matter has been referred to officers who were north of Fort Pitt, where, it is alleged, the waggon was left, but they appear to know nothing about it.\n\n4. The claim for balance on horse purchased, is for a reduction made in accordance with the estimated value by J. H. Metcalfe.\n\n5. The claim for water tank (said to have been used by 91st Battalion.) Lieut.-Col. Scott told the chairman verbally, there were no grounds for the claim whatever, he having refused to certify when the claim was presented to him by the secretary of the company, Mr. Ebberts.\n\nW. C. Nos. 300, 375, 397, 475, M. M. & D., A 4,095, W. R. Sinclair:\n\n1. Shortage charged on delivery of oats ........................................... $3,271 06\n2. Overcharge on rations and forage .................................................. 1,539 97\n3. Demurrage for not giving 8 days' notice of termination of contract ................................................................. 1,344 00\n4. Demurrage at Battleford .............................................................. 672 00\n5. do Humboldt ............................................................................. 300 00\n6. Balance for transport, 7th Fusiliers .................................................... 770 00\n7. Hauling supplies from Telegraph Coulee to Battleford and Fort Pitt, balance ................................................................. 115 00\n8. Transport 92nd Battalion from Battleford to Swift Current, balance ................................................................. 1,490 00\n\n$4,502 03\n\nAlso eleven horses price not given.\n\nThere are claims for services rendered, under a contract made on 27th June, 1885, between Major-General Middleton and the claimant.\n\nThe principal number of these claims were previously reported upon by the Commission, after having given them a most careful consideration, the awards being considered very liberal towards the claimant, the grounds of reduction being as follows:\n\n1. Shortage on oats delivered.\n   The amount was arrived at by comparing the shipping receipts with the delivery receipts, and in order that no injustice might be done the claimant, ten per cent. of the deficiencies, 18,172 pounds, were not charged.\n\n2. Overcharge on rations and forage.\n   The prices charged for the various articles were the lowest wholesale prices at Winnipeg, nothing having been added for the freight, which would have largely increased the value at Clarke's Crossing, and other stations where they were received.\n\n3. Demurrage on account of eight days' notice not having been given to terminate the contract.\n   The Major-General and other officers who knew anything about the contract, had left the country. The contractor was perfectly aware, when the stores at the different stations were all cleared up by his teamsters, there was no further freighting to be done; consequently, this claim was rejected.\n\n4. Demurrage at Battleford.\n   The original claim shows this occurred in August, after all the stores had been hauled. Sinclair knew there was no further work for his teams; consequently, he\nis not justified in making this claim. The matter was fully considered by the Commission, and rejected.\n\nThe men who actually owned the teams and did the work have not filed any claim on account of these redactions. It is inferred by a letter sent by James Hoey, that Sinclair sent an agent to compromise with the teamsters and pay them off at a reduced price for all work performed, notwithstanding his profit had been excessive.\n\nThe claimant after having received payment, stated to the Paymaster he was perfectly satisfied by the awards made him by the Commission.\n\n5. Demurrage for going to Humboldt for supplies and returning empty. The claimants' teams had previously cleared up all stores at this station, and could only have returned with the object of being continued under pay, which the Commission refused to recommend.\n\n6. Transport of 7th Fusiliers from Clarke's Crossing to Moose Jaw. The teamsters were ordered to proceed half way, when they were to transfer their loads to teams sent from Moose Jaw, by Ross and Riddell. Several of the teamsters did return; others insisted on continuing, contrary to orders, (some, if not all of them, were returning home; for which they would receive pay for the days actually occupied in doing so, under their original day work agreement.) Ross and Riddell claiming for and receiving $1,400 for their service by consent of Sinclair, in addition to what was paid the latter.\n\nThe number of days allowed for the trip was three in excess of the time in which John Stewart's teams performed the journey, when freighting by the ton; consequently this item is not a just claim.\n\n7. Balance for hauling supplies from Telegraph Coulee and Battleford to Fort Pitt.\n\nThe amount claimed, $115, is for reductions made for over time charged; custom has established a certain number of days for freighting over all the trails in the North-West, consequently the Commission allowed full and sufficiently liberal time to perform the journey which caused this reduction to be made.\n\n8. Transport of 92nd Battalion from Battleford to Swift Current. Balance, $1,400.\n\nThe established number of days occupied by ordinary teamsters were allowed, for which $4,010 have been paid on the recommendation of the Commission, which was considered a liberal sum, and full pay for the time which should have been charged.\n\n9. Eleven horses, for which no sum is named.\n\nThis is supposed to be for horses alleged to have been lost while teaming by the day, under a general contract with the Hudson's Bay Company. The Honorable the Minister of Justice having decided the Government is not responsible under that agreement, this claim, like other similar ones, could not be entertained.\n\nThe Commission on War Claims was appointed by Order in Council, under the laws of the Dominion, which gave them certain power to investigate and report upon these claims, and to make such recommendations as they considered just and equitable, which, when approved by proper authority, except in very exceptional cases, ought not to be subject to revision by the Board of Arbitrators.\n\nThese respective claimants now pray that His Excellency may be pleased to grant his fiat to authorize the filing of a petition of right in the Court of Exchequer, claiming from the Government the several sums referred to.\n\nIn dealing with all claims laid before them, the Commission made the most liberal recommendations on behalf of the claimants, the sums part having been largely in excess of the highest ordinary values of similar articles or services in that part of the country.\n\nShould His Excellency be pleased to grant his fiat, a precedent will thus be established, which will encourage others who have, or will present exorbitant claims, with the hope of obtaining through the chances of law, and the general impression that the subject will receive more favorable consideration than the Crown, some portion at least of what they put forth as a claim, to petition for a similar favor, which,\nif continued and sanctioned, will undo the work of the Commission, and frustrate the Government in their laudable effort to guard the Exchequer against those unpatriotic subjects, who would take advantage of their country's difficulties for their own aggrandizement, and to the detriment of their fellow subjects.\n\nApproved, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nP.S.—Copy of contract with W. R. Sinclair attached.\nNo written contract with the Qu'Appelle Valley is known of.\n\n\"A\"\n\nTHIS AGREEMENT, entered into this Twenty-seventh day of June, A.D. 1885, between THE GOVERNMENT OF THE DOMINION OF CANADA, hereinafter called the Government, of the First Part, and WILLIAM R. SINCLAIR, of the city of Winnipeg, in the County of Selkirk, and Province of Manitoba, Contractor, of the Second Part.\n\nWITNESSETH—\n\nThat whereas the said Government of the Dominion of Canada, have asked for tenders for the freighting of a large amount of stores from Clarke's Crossing, of the south branch of the Saskatchewan River, in the North-West Territories, of the said Dominion, to Battleford, in said North-West Territories, the estimated distance by trail being one hundred and twenty miles.\n\nAnd whereas the party of the Second Part, hath duly tendered for freighting of said stores, from said Crossing to the said town of Battleford, on the terms hereinafter set forth, and said tender has been, and is hereby accepted by the said Government—\n\nNow this agreement witnesseth, that the party of the Second Part, for himself, his heirs, executors, administrators and assigns, in consideration of the covenants of the said Government of the Dominion of Canada, hereinafter set forth, covenant and agree as follows:\n\n1. To freight, convey and deliver, all stores for the North-West Field Force, of the said Dominion of Canada, now stored at Clarke's Crossing, aforesaid, on the south branch of the said River Saskatchewan, or which hereafter may be stored there, for said Field Force, from the east bank of the said River Saskatchewan, at Clarke's Crossing aforesaid, to Battleford aforesaid, there to be delivered to such officer or officers of the Government, as may, from time to time, be authorized to receive the same, at and for price or sum of three dollars and fifty cents per hundred pounds of freight, so delivered as aforesaid.\n\n2. The party of the Second Part, shall keep constantly on hand, for the proper carrying out the above mentioned contract, not less than sixty teams, with the proper equipment for same.\n\n3. The party of the Second Part, shall freight and convey, on each and every trip, from Clarke's Crossing to Battleford, not less than two thousand pounds of stores per team, and shall make on an average, not less than twenty-five miles per day, and shall commence freighting said stores within three days, from the date hereof.\n\n4. The party of the Second Part, shall supply his own forage and provisions for said freighting.\n\n5. The party of the Second Part, shall together with two sureties to be approved of by the said Government, forthwith, enter into a good and sufficient bond, with said Government, for the faithful performance by the party of the Second Part of said agreement; hereby by him entered into, said bond to be for the sum of three thousand dollars.\n\n6. The party of the Second Part, shall exercise due diligence and caution in the freighting of said stores, and shall be responsible for the loss of, or damage to any stores lost, or damaged through the negligence, or carelessness of him, the party of the Second Part, his agent or agents.\n\n7. The party of the Second Part, shall carry free of cost, either to the Government, or to the party or parties carried, all and every sick, or wounded member or members of the said North-West Field Force, who at any time, during the continuance of this contract, may apply to him for passage, from Battleford to Clarke's Crossing aforesaid, or to or from any intermediate point on such return trips, together with such person or persons' personal luggage, and fuel sufficient for cooking purposes; provided however, that the team or teams of the party of the Second Part necessary therefor, shall neither be overloaded nor unnecessarily delayed.\n\nIn consideration whereof, the said Government of the Dominion of Canada, hereby covenant, and agree with the party of the Second Part, to pay to him the party of the Second Part, his executors, administrators, or assigns, for every one hundred pounds of stores so freighted, or conveyed from Clarke's Crossing, aforesaid to Battleford, aforesaid, and duly delivered over to such officer or officers, agent or agents, as may by the said Government from time to time be authorized to receive the same, the sum of three dollars and fifty cents, payable in monthly estimates, on the first day of each and every month, during the continuance of this contract, the first of such monthly estimates to become due, and be paid on the first day of August next; provided, however, and it is hereby expressly understood and agreed, that the party of the Second Part shall be obliged to produce duly certified vouchers of the officer or officers authorized to receive such stores at Battleford, as aforesaid, of the delivery of such stores, and shall only be paid the amount represented by such vouchers. Provided always, that...\ntwenty per cent. of the amount earned by the party of the Second Part, under this agreement, shall be retained, by the said the Government, from each and every of such monthly estimates, until the final completion and fulfillment by the party of the Second Part, of the covenants by him herein entered into:\n\nIn the event of the party of the Second Part, at any time, not being able to supply forage for his teams, or provisions for himself, his agent or agents, engaged in freighting said stores, he may by requisition to the proper officer or officers, receive from the stores of the Government sufficient of the same to last him until he can obtain a supply of the same for himself, whereupon the party of the Second Part shall have the option of replacing the stores so requisitioned at the place where the same were by him received, or of paying the Government, the actual cost price thereof laid down.\n\nShould the Government require a team or teams for work, other than contract work, the party of the Second Part, shall supply the same forthwith, and shall receive therefor the sum of five dollars per day, together with forage and rations from the Government.\n\nShould the teams, outfit or equipment of the party of the Second Part, at any time be damaged or destroyed through the acts of the enemy, the Government shall make good such loss to the party of the Second Part, provided the party of the Second Part, shall establish that proper precautions had been taken by him to prevent such loss.\n\nThe party of the Second Part shall, under this contract, be given the whole of the freighting the Government may require of said stores, and the Government shall constantly keep in store at Clarke's Crossing sufficient freight to employ at least fifty teams, required to be kept on hand by the party of the Second Part as aforesaid; provided however, that the Government may upon giving to the party of the Second Part, ten days' notice of their intention so to do, limit the number of teams to be employed by the party of the Second Part to any number not less than thirty.\n\nProvided further, that the party of the Second Part, shall be paid the sum of four dollars per day for each and every team that shall be kept idle through the failure of the Government, to supply sufficient freight at Clarke's Crossing to keep the same employed, and shall during such delay supply forage and rations, for such teams and men as may through such failure be kept idle.\n\nProvided always, and it is hereby expressly understood and agreed by and between the parties hereto, anything herein to the contrary notwithstanding, that the said the Government shall have the power to cancel this agreement at any time upon giving to the party of the Second Part, notice that at the expiration of eight days thereafter, they the Government will require the party of the Second Part to freight no further stores, and at the expiration of such eight days, this contract shall cease, and be determined.\n\nIn witness whereof the parties hereto have hereunto set their hands and seals.\n\nFRED. MIDDLETON. [Seal]\nMajor-General Commanding Forces in N.-W.\nWM. R. SINCLAIR. [Seal.]\n\nSigned, sealed and delivered in presence of\nH. BOLSTER.\n\nKnow all men by these presents that we, WILLIAM R. SINCLAIR, of the city of Winnipeg, in the county of Selkirk, and Province of Manitoba, contractor, WILLIAM J. MCLEAN, of Fort Pitt, in the North-West Territories, of the Dominion of Canada, Esquire, and DAVID MCGREGOR, of the said city of Winnipeg, contractor—\n\nAre jointly and severally bound to, and unto the Government of the Dominion of Canada, and their successors, in the penal sum of three thousand dollars of lawful money of Canada, for payment of which, well and truly to be made, we bind ourselves, and each of us, our and each of our heirs, executors, and administrators.\n\nDated at Fort Pitt, in the North-West Territories of the Dominion of Canada, this third day of July, A.D. 1885.\n\nNow, the condition of this obligation is such, that if the above named William R. Sinclair, do well and faithfully fulfill and perform each and every of the covenants, conditions and obligations by him undertaken and upon him imposed, in and by the contract with the said the Government of the Dominion of Canada, heretofore annexed, and marked \"A\" in the manner, and within the time therein set forth, then this bond shall become null and void, otherwise the same shall remain in full force, virtue and effect.\n\nSealed with our seals this third day of July, A.D. 1885.\n\nWM. R. SINCLAIR,\nW. J. MCLEAN,\nDAVID MCGREGOR.\n\nSigned, sealed and delivered in presence of\nH. BOLSTER.\n\nON BOARD STEAMER \"MARQUIS,\" 6th July, 1885.\n\nMajor-General MIDDLETON,\nCommanding Forces in N.-W. Territories.\n\nSir,—I hereby tender for freighting of all stores of the Government of the Dominion of Canada, now at Telegraph Coulee, on the south side of the north branch of the Saskatchewan River, to\nBattleford, N.-W. T. trail, distance being eighty miles or thereabouts, for the price or sum of three-dollars per hundred pounds of freight delivered, and I further agree to be bound in freighting said stores, by all the covenants and conditions by me agreed to and upon me imposed in and by a certain agreement entered into with you, as representative of said Government, on the 27th June, 1885, for freighting of stores from Clarke's Crossing to Battleford.\n\nThe trail from Telegraph Coulee to Battleford is so uneven that it is impossible to freight more than half a load per trip, and I therefore consider $3 per hundred pounds a low tender.\n\nFreighting of said stores to be commenced forthwith after acceptance of this my tender.\n\nYours, &c.,\n\nWitness,\nH. Bolster.\n\nWM. R. SINCLAIR.\n\nON BOARD STEAMER \"MARQUIS,\" 6th July, 1885.\n\nMajor-General MIDDLETON,\nCommanding Forces in N.-W. Territories.\n\nSir,—I hereby tender for freighting of all stores of the Government of the Dominion of Canada, now at Humbolt, N.-W. T. to Clarke's Crossing, of the south branch of the Saskatchewan River, N.-W. T. trail, distance being sixty miles, or thereabouts, for the price or sum of two dollars and twenty-five cents ($2.25) per hundred pounds of freight delivered; and I further agree to be bound in freighting said stores, by all the covenants and conditions by me agreed to and upon me imposed in and by a certain agreement entered into with you, as representative of the said Government, on the 27th of June, 1885, for freighting of stores from Clarke's Crossing to Battleford.\n\nFreighting of said stores to be commenced forthwith, after acceptance of this my tender.\n\nYours, &c.,\n\nWitness,\nH. Bolster.\n\nWM. R. SINCLAIR.\n\n(Copy.)\n\nWILLIAM R. SINCLAIR, Esq.\n\nSir,—On behalf of the Government of the Dominion of Canada, I hereby accept your tender of this date for freighting of stores of the Government, now at Telegraph Coulee, to Battleford, N.-W. T., upon the terms and conditions therein set forth.\n\nAnd I further accept your tender of this date for freighting of stores of the said Government, now at Humbolt, N.-W. T., to Clarke's Crossing, of the south branch of the Saskatchewan River, upon the terms and conditions therein set forth.\n\nYours, &c.,\n\nFRED. MIDDLETON,\nWitness,\nH. Bolster.\n\nMajor-General Commanding Forces in North-West Territories.\n\nREPORT No. 178.\n\nOTTAWA, 9th December, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 340.—James McDonald, Edmonton, $7, for a box with lock and hinges, for holding papers supplied J. K. Strachan, Supply Officer, while transferring surplus Military supplies to other Departments.\n\nThis claim has previously been reported upon, and reduced one half. The box is now used in the office at Ottawa, and should be paid for. Although the price appears very high, the amount being a petty one, it would be better to pay the balance $3.50, than to have any dissatisfaction; which is respectfully recommended.\n\nApproved, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nREPORT No. 174.\nOTTAWA, 9th December, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 148.—M. M. & D., A-2,489.—Major-General Laurie, $15, for one saddle and two bridles; previously reported upon and rejected, on the ground staff officers should supply their own saddlery.\n\nIt appears the claimant took two saddles and some bridles with him when going on service. Lieut.-Col. Otter and his staff took no saddles. He, however, borrowed one, and two bridles, from Major-General Lorne. After the close of operations these articles were sent, with others, to Moose Jaw, and sold on Government account; consequently, the claim becomes a fair one against the Department. Lieut.-Col. Otter reported verbally, the saddle was second-hand, and considerably worn; the bridles common ones. Maynard, Harris & Co., charge for best English hunting saddles, from £3 5s. to £5; consequently, the sum claimed appears to be above their value.\n\nIt is, therefore, respectfully recommended thirty dollars ($30) he paid in full of the claim, making a reduction of $15.\n\nApproved, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 175.\nOTTAWA, 9th December, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 857.—Surgeon Alfred Codd, for attending sick and wounded of the North-West Field Force, remaining in Winnipeg hospital from 27th November, 1885, to 29th September, 1886, 306 days, at $1.65, $504.95.\n\nDeputy Surgeon-General Roddick placed Surgeon Codd in charge of these duties, after Dr. King (whose pay and allowance were $1.65 per day) had left. The claimant now asks for the difference between his pay as surgeon of the Mounted Infantry School and the above rate. The chairman can testify to the attendance and pains-taking way in which Surgeon Codd discharged these as well as other extra duties, connected with the force at Winnipeg, previous to his leaving, 8th December, 1885, and thinks he would be insufficiently paid if the whole sum were authorized; but as the claimant is entitled to allowances from the school, he would only be entitled to 65 cents per day to make the pay equal to that of a surgeon (the $1 per day being for allowance.) It is therefore most respectfully recommended $198.90 be paid, making a reduction of $306.\n\nRefused, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\nREPORT No. 176.\n\nOTTAWA, 17th December, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 749.—Messrs. Boyd & Crowe, of Winnipeg, $3,960, for conveyance of 348 officers and men from Saskatchewan Landing to Clarke's Crossing, on scows.\n\nThis firm entered into a contract with the Hudson's Bay Company, for the conveyance of 150 tons of military supplies, from and to the points above named, at $80 per ton, for its first 100 tons, and $60 per ton for the balance. The contractors to construct their own scows which were to carry in addition to not less than fifteen tons, twenty men each, and to draw not more than 13 inches of water when fully loaded.\n\nThe Government paid $1,000 for a special train to convey the lumber, other material, and workmen, for construction of these scows, from Winnipeg to Swift Current, and from the latter to Saskatchewan Landing, 29 miles by waggon, free to the contractors.\n\nTwelve scows were constructed and loaded with an average of over 23 tons each, exclusive of the soldiers, who worked the scows down the river (by which Boyd & Crowe's boatmen, excepting two as pilots, who were totally inefficient, were dispensed with, at a great saving to the claimants) during the passage, the troops went through great hardships in being in the water many times daily to float the scows, which were almost constantly running aground on account of the loads being largely in excess of the tonnage. At such times the stores were frequently thrown overboard, or left on the bank where they were not recovered, thereby causing a very great loss to the Government.\n\nIn these loads were included five tons for rations, and twenty tons for soldier's baggage; and although the rations were consumed by the men, full freight was paid, viz.: $2,000 for rations and baggage.\n\nMajor General Laurie and Mr. Wrigley, Commissioner of the Hudson's Bay Company, who made the arrangements, both understood there was to be no charge for conveying the troops, which was fully paid by their working the scows.\n\nIt is inferred from the correspondence, the Hudson's Bay Company at first refused to pay the $18,620 for the 277 tons received on board, but not delivered, as the freight on the large quantity thrown into the river, and left on the bank, should not only have been deducted, but the value thereof should have been charged to the contractors, and which in all probability may still be legally collected.\n\nThe receipt of Lieut.-Col. Deacon, of the Midland Battalion, who was in command at Clarke's Crossing, on which payment of the full freight was made, says:— \"Commissary supplies said to contain 277 tons. The latter was conveyed complete, with the exception of such portions stored on the banks or thrown overboard.\"\n\nWhen Boyd & Crowe were pressing for payment, a letter was written by the law firm of Bain, Blanchard & Mulock, to Mr. Wrigley, Commissioner Hudson's Bay Company, strongly supporting the claim, in which they use as an argument against any reduction: \"We notice also that the barges carried a larger number of soldiers than Boyd & Crowe contracted they should carry, for which no extra charge is made.\"\n\nBoyd & Crowe also gave a receipt on back of contract as follows:—\n\n$18,620.00.\n\nReceived of the Hudson's Bay Company the sum of Eighteen thousand six hundred and twenty dollars in full, of all claims on the within contract.\n\nN. BOYD.\nG. R. CROWE.\n\nWINNIPEG, 29th May, 1885.\nThis claim was laid informally before the Commission, just as they were adjourning. They were unanimous in declaring it most unreasonable, and they would recommend its rejection in the strongest terms, in which I fully concur.\n\nI shall communicate with Major-General Laurie on the subject, should that officer report anything contrary to the foregoing it shall be laid before you.\n\nApproved, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col., D.A.G.,\nChairman.\n\nREPORT No. 177.\n\nOTTAWA, 21st December, 1886.\n\nWAR CLAIMS COMMISSION.\n\nREPORT\n\nFOR CONSIDERATION OF THE HONORABLE THE MINISTER OF MILITIA AND DEFENCE.\n\nW. C. No. 253.—M. M. & D., A 6,303.—J. D. Quail, of McLeod, Alta., $89, for tables, benches, cupboards for 9th Battalion, while in Police Barracks.\n\nThis claim has previously been rendered in the name of Quail & Scott, and rejected by the Commission, on the ground that the 9th Battalion was provided with camp equipment, and should have lived in camp, instead of barracks, when at McLeod; consequently it was a regimental matter, and should have been settled by the officers; but as the North-West Mounted Police took possession of the articles (which appear to be of a permanent character) and still continue to use them, it now appears a fair and just charge against that Corps. It is, therefore, respectfully recommended the claim be transferred to the Comptroller of the North-West Mounted Police for adjustment.\n\nApproved, A. P. C., M. M. & D.\n\nW. H. JACKSON, Lt.-Col. D.A.G.,\nChairman.\n\nThe original claim of Quail & Scott is attached. M. M. & D., A 2,547.\n## INDEX\n\nTO THE\n\nNAMES IN REPORTS OF THE WAR CLAIMS COMMISSION.\n\n| Names                        | War Claim No. | Page |\n|------------------------------|---------------|------|\n| Amyot, Lt.-Col.              | 838           | 45, 48 |\n| Anderson, Sub-Agent          | 801           | 41   |\n| Armstrong, Geo. S., M.D.     | 310           | 29   |\n\n### B\n\n| Names                        | War Claim No. | Page |\n|------------------------------|---------------|------|\n| Baillargé, 2nd Lieut.        | 838           | 53   |\n| Baker, I. G., & Co.          | 821           | 35   |\n| Ballandine, Peter            | 782           | 18   |\n| Barnes, Wm.                  | 760           | 10   |\n| Bastedo, John G.             | 367           | 33   |\n| Beique, Lieut.               | 838           | 53   |\n| Benoit, Trooper              | 115           | 27   |\n| Boyd & Crowe                 | 749           | 4, 75|\n| \"                             | 648           | 5    |\n| Bull, Thomas                 | 380           | 16   |\n| \"                             | 774           | 29   |\n\n### C\n\n| Names                        | War Claim No. | Page |\n|------------------------------|---------------|------|\n| Caldwell, Wm. M.             | 810           | 23   |\n| Cameron, John A.             | 820           | 38   |\n| Campbell, G., Capt.          | 668           | 34   |\n| \"                            | 797           | 18   |\n| Canadian Pacific Railway Co. | 758           | 62   |\n| \"                            | 830           | 63   |\n| \"                            | 794           | 18   |\n| Casgrain, Capt.              | 838           | 50   |\n| \"                            | 838           | 52   |\n| Chapman, M. S., Lieut.       | 806           | 28   |\n| Chippewaian Indians          | 816           | 56   |\n| Chouinard, Capt.            | 838           | 52   |\n| Codd, A., Surgeon            | 857           | 74   |\n| Collinge, Jas., M. D.        | 715           | 8    |\n| Corbett, B. O.               | 255           | 16   |\n| Cottingham, John             | 34            | 60   |\n\n### D\n\n| Names                        | War Claim No. | Page |\n|------------------------------|---------------|------|\n| Deacon, Lt.-Col.             | 787           | 19   |\n| DeBlois, Surgeon             | 838           | 51   |\n| Dickson, W. King             | 657           | 31   |\n| \"                            | 720           | 32   |\n| Names                                      | War Claim No. | Page |\n|--------------------------------------------|---------------|------|\n| Dion, A., Lieut.                           | 838           | 53   |\n| Douglas, Geo. H                            | 791           | 22   |\n| Drolet, Capt.                             | 838           | 52   |\n| Drury, C. W., Capt.                       | 789           | 18   |\n| Dugal, Paymaster                          | 838           | 48   |\n| Dunn, Jos. A.                             | 810           | 23   |\n| Dupuis, Lieut.                            | 838           | 53   |\n| Eakins, J., M. D.                         | 780           | 18   |\n| Edmonton Home Guard                       | 291           | 1    |\n| “ Scouts                                  | 626           | 1    |\n| “ Volunteer Co.                           | 291           | 1    |\n| Evanturel, Lt.-Col.                       | 696,838       | 46,47|\n| Fages, Capt.                              | 838           | 47   |\n| Faguy, Chaplain                           | 838           | 51   |\n| Fiset, Capt.                              | 838           | 49   |\n| “ Lieut.                                  | 838           | 53   |\n| Fraser, J., Major                         | 784           | 19   |\n| Frenette, Capt.                           | 838           | 48   |\n| Gallagher, Sons & McGregor                | 837           | 40   |\n| Garneau, Capt.                            | 838           | 48   |\n| Gibson, Geo. A.                           | 766           | 43   |\n| Gillespie, D. H.                          | 492           | 16   |\n| Gisborne, V. N., Supt.                   | 801           | 41   |\n| “ H., Dis. Supt.                          | 801           | 41   |\n| Governor General’s Body Guard             | 779           | 8    |\n| Gunn, Geo.                                | 775           | 30   |\n| Hamel, Lieut.                             | 838           | 51   |\n| Hargraves, J. G.                          | 793           | 34   |\n| Hastings, Thos.                           | 245           | 6    |\n| Hay, W. Hope                              | 698           | 33   |\n| Hayes, E. A.                              | 574           | 35   |\n| Herchmer, Supt.                           | 730,825       | 33,37|\n| Hobart, G. S.                             | 768           | 24   |\n| Horsey, A. J., M.D.                       | 761           | 9    |\n| Hourie, Thomas                            | 642           | 30   |\n| Hudson’s Bay Co.                          | 769,814,816   | 41   |\n| Hughes, O. E., & Co.                      | 850           | 58   |\n| Hunt, W. R., Trooper                      | 115           | 20   |\n| King, Chas.                               | 33            | 33   |\n| “ E. E., Surgeon                          | 839           | 65   |\n| Names                        | War Claim No. | Page |\n|------------------------------|---------------|------|\n| Labranche, Lieut.            | 838           | 53   |\n| Larièvre, B. B.              | 39            | 66   |\n| La Rue, Lieut.               | 838           | 49   |\n| Latimer, Repairer            | 801           | 41   |\n| Laurie, Major-General        | 148           | 74   |\n| Leacock, E. P., Capt.        | 836           | 42   |\n| LeBret, Rev. Father          | 812           | 29   |\n| LeVasseur, Capt.             | 838           | 48   |\n| Lloyd, Geo., Rev.            | 763           | 2    |\n| Logan, Thomas                | 845           | 42   |\n| Lyman, Sons, & Co.           | 762           | 8    |\n| Macdonell, R. G.             | 805           | 68   |\n| MacLellan, R. W.             | 181           | 34, 66 |\n| Manitoba Cartage and Warehousing Co. | 387 | 21   |\n| Martin Bros.                 | 809           | 35   |\n| Maurice, Lieut.              | 838           | 52   |\n| Molloy, R. J.                | 770, 894      | 31   |\n| Moore, C. P.                 | 179           | 22   |\n| Mills, Alfred                | 516           | 32   |\n| Munro, Hugh                  | 115           | 26   |\n| Murdock, Geo.                | 64            | 20   |\n| McClellan, W. R.             | 181           | 34, 66 |\n| McDonald, A.                 | 781           | 19   |\n| “ Jas                       | 340           | 73   |\n| McDougall, D.                | 711           | 35   |\n| McFarlane, Repairer          | 801           | 41   |\n| McGregor, D.                 | 402           | 16   |\n| McIntyre, D.                 | 779           | 9    |\n| McIvor, Allan                | 851           | 55   |\n| McLauglan & Sons             | 833           | 37   |\n| McLeod, Donald               | 706           | 6    |\n| McKay, Rev. Canon            | 519           | 26   |\n| North-West Navigation Co.    | 236           | 2    |\n| O'Connell, Daniel            | 779           | 8    |\n| O'Donoghue, R. B.            | 123           | 27   |\n| Orton, Geo. T., Surgeon      | 674           | 32   |\n| Pearsall, Geo. O., Trooper   | 779           | 9    |\n| Peebles, Lt.-Col             | 855           | 59   |\n| Pelletier, Lieut.            | 838           | 53   |\n| Names                          | War Claim No. | Page |\n|-------------------------------|---------------|------|\n| Pelley, J. A.                 | 685           | 21   |\n| Pennie, F., Capt.             | 838           | 53   |\n| Perrault, Capt.               | 838           | 48   |\n| Pinault, Capt.                | 838           | 53   |\n| Qnail, J. D.                  | 253           | 76   |\n| Qu'Appelle Valloy Farming Co. | 6, 7, 283, 702, 750, 818 | 68   |\n| Richardson, Chief Operator    | 801           | 41   |\n| Robertson, W. R.              | 402           | 16   |\n| Roddick, Deputy Surgeon General | 856         | 65   |\n| Rolston, P. W., Surgeon       | 831           | 64   |\n| Ross, D. A.                   | 792           | 32   |\n| \" James H.                    | 380           | 16   |\n| \" John                        | 537, 561      | 12   |\n| Rouleau, C.B.                 | 629           | 25   |\n| Routhier, Lieut.              | 838           | 53   |\n| Roy, Major                   | 838           | 50   |\n| Saunders, C. A.               | 598           | 55   |\n| Scott, Lt.-Col. T.            | 837           | 40   |\n| Scouts                        |               | 1, 24|\n| Shehyn, Lieut.                | 838           | 51   |\n| Sinclair, W. R.               | 300, 375, 397, 475 | 69   |\n| Snow, John F.                 | 808           | 39   |\n| St. Albert Mounted Rifles     | 446           | 1    |\n| Stewart, Capt. John           | 26            | 23   |\n| Stobart, Sons & Co.           | 850           | 58   |\n| Strang, C. P.                 | 709           | 35   |\n| Talbot, Capt.                 | 838           | 49   |\n| Taylor, H.                    | 239           | 36   |\n| Thomas, Corp.                 | 799           | 10   |\n| Tims, F. F.                   | 754           | 30   |\n| Touhy, Sergt.                 | 784           | 19   |\n| Tremayne, Capt. F. G.         | 806           | 28   |\n| Trounce, W. H.                | 822           | 59   |\n| Tarriff, J. G.                | 402           | 16   |\n| Tweed & Ewart                 | 26            | 23   |\n| Voulindeburg, Sub-Agent       | 801           | 41   |\n| Welsh, Thomas                 | 796           | 36   |\n| White, Joseph H.              | 810           | 23   |\n| Winder, W.                    | 26            | 23   |\n| Winnipeg and Western Transportation Co. | 759         | 19   |\n| Workman, H.                   | 795           | 18   |\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001383.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 86, "total-input-tokens": 128362, "total-output-tokens": 68414, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 362, 2], [362, 362, 3], [362, 1575, 4], [1575, 1575, 5], [1575, 4430, 6], [4430, 6990, 7], [6990, 10561, 8], [10561, 13163, 9], [13163, 15219, 10], [15219, 18165, 11], [18165, 21874, 12], [21874, 25184, 13], [25184, 27315, 14], [27315, 29857, 15], [29857, 33274, 16], [33274, 35830, 17], [35830, 40034, 18], [40034, 42997, 19], [42997, 46172, 20], [46172, 49072, 21], [49072, 52635, 22], [52635, 56152, 23], [56152, 59201, 24], [59201, 61845, 25], [61845, 63676, 26], [63676, 66200, 27], [66200, 68758, 28], [68758, 70921, 29], [70921, 73480, 30], [73480, 76043, 31], [76043, 78464, 32], [78464, 80908, 33], [80908, 83768, 34], [83768, 87609, 35], [87609, 91565, 36], [91565, 95445, 37], [95445, 97350, 38], [97350, 101063, 39], [101063, 103937, 40], [103937, 105937, 41], [105937, 108098, 42], [108098, 110514, 43], [110514, 113876, 44], [113876, 116804, 45], [116804, 119682, 46], [119682, 121543, 47], [121543, 124433, 48], [124433, 128286, 49], [128286, 131128, 50], [131128, 137132, 51], [137132, 141174, 52], [141174, 144877, 53], [144877, 149643, 54], [149643, 152587, 55], [152587, 156331, 56], [156331, 159821, 57], [159821, 164716, 58], [164716, 167045, 59], [167045, 169079, 60], [169079, 172042, 61], [172042, 174782, 62], [174782, 177140, 63], [177140, 179572, 64], [179572, 182666, 65], [182666, 186677, 66], [186677, 189723, 67], [189723, 193624, 68], [193624, 196167, 69], [196167, 198677, 70], [198677, 201132, 71], [201132, 204387, 72], [204387, 206958, 73], [206958, 210722, 74], [210722, 214717, 75], [214717, 220079, 76], [220079, 225014, 77], [225014, 228114, 78], [228114, 230586, 79], [230586, 234069, 80], [234069, 235643, 81], [235643, 238088, 82], [238088, 240989, 83], [240989, 243286, 84], [243286, 245761, 85], [245761, 245761, 86]], "primary_language": ["None", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false], "is_diagram": [true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]