[{"id": "07d77d232eeb1c505b2768a6f152c16138b68e44", "text": "EXPERIENCES\n\nOF THE\n\nHalifax Battalion\n\nIN THE\n\nNORTH-WEST.\n\nBY ROBERT A. SHERLOCK,\nLate Royal Artillery.\n\nPRICE 25 CENTS.\n\nHALIFAX, N. S.:\nPRINTED BY JAS. W. DOLEY, 145 ARGYLE STREET.\n1885.\nEXPERIENCES\n\nOF THE\n\nHalifax Battalion\n\nIN THE\n\nNORTH-WEST.\n\nBY ROBERT A. SHERLOCK,\nLate Royal Artillery.\n\nPRICE 25 CENTS.\n\nHALIFAX, N. S.:\nPRINTED BY JAS. W. DOLEY, 148 ARGYLE STREET.\n1885.\nINTRODUCTION.\n\nIn presenting this brief account of the experience of the Halifax Battalion in the North-West, I trust my readers will not harshly criticise this my first attempt. True, in most cases I have not given dates, simply because it is written from memory and not from diary. I feel satisfied that all who accompanied the Battalion will admit that it is penned from experience and not from hearsay.\n\nRespectfully yours,\n\nROBERT A. SHERLOCK.\nEXPERIENCES OF THE HALIFAX BATTALION\nIN THE NORTH-WEST.\n\nBY ROBERT A. SHERLOCK.\n\nOn the morning of the 11th April, 1885, the Halifax Battalion ordered on active service in the North-West paraded in the Drill Shed, Spring Garden Road, at 7 o'clock, in accordance with orders issued the evening before. On the roll being called, it was found there were only two absentees, whose names I will not mention. The Battalion was composed of two Companies of the Halifax Garrison Artillery, three Companies 63rd Rifles, and three Companies 66th Princess Louise Fusiliers, numbering in all 382 Officers and Men, under command of Lieut.-Col. J. J. Bremner. At 8 o'clock the command \"Fours\" was given; \"Advance in successive Companies by fours from the front\"; \"No. 1 Company, left wheel; quick march\"; many amongst us, if not all, disregarding the fact that we were probably marching off that parade ground for the last time. Our country required our service, and, like true Nova Scotians by birth and adoption as we were, we obeyed its call regardless of consequences. We were headed by the Bands of the Royal Irish Rifles, H. G. A., 63rd and 66th Regts., who played lively airs along the route to North Street. Never before were greater crowds seen on the streets of Halifax. Old and young, rich and poor, mothers, wives, sisters and sweethearts, fathers, brothers, sons, uncles and relations of all degrees of affinity, as well as those who were not relations at all, were there to bid us God-speed on our journey; but the most pathetic scene was the last goodbye as we boarded the cars at North Street. Strong men who would have manfully stood in front of any enemy were unable to hold up on the occasion of that last farewell, and had to hide their faces, for a time at least, in order that no\nweak point should be discovered; but after all we cannot call it weakness, it is simply one of nature's laws. Does not\n\n\"One touch of nature make the whole world akin\"?\n\nAt 12.45 p.m. our train steamed slowly out amidst the firing of torpedoes, blowing of whistles, ringing of bells, and the cheers of that vast multitude which had assembled to witness our departure. At Richmond we had a slight mishap which detained us for some time; at length we got under way, and proceeded on our 4,000 mile journey. After passing Bedford we began to realize that there was quite a journey ahead of us before we changed cars, and most of us made ourselves as comfortable as possible under the circumstances. As we passed the various stations, the people all turned out to give us a good send-off, showing how well our actions were appreciated. Those marks of approval from our countrymen helped to take our thoughts from the scene at North Street, and which it would be well to think of as little as possible, for a time at least.\n\nWe arrived at Truro about 3 p.m., where large crowds were in attendance to greet us, whilst the band played as we disembarked for dinner, and during the time we were partaking of the much-needed meal, having eaten nothing since early morning. After dinner the N.C. officers and men were granted permission to go and purchase whatever they might want for the journey. The buglers were ordered to sound the Assembly in the streets about 6 o'clock, and immediately after the blue-coated Artillerymen, green-coated Riflemen and red-coated Fusiliers could be seen making for the cars in double-quick time. \"All aboard\" was shouted, and we once more started, leaving the City by the Sea farther behind us. It is needless for me to inform Nova Scotians that Truro is a beautiful town; but as this little book may be read by strangers, for their information I will say it is one of the prettiest I ever saw, although I have travelled a great deal. After passing Truro, the men settled down to what they knew were stern realities: songs were sung, such as \"When the Half-breeds were at hand,\" \"Who will wear my roller skates?\" etc. Others tried to read, but I am inclined to think did not succeed very well.\n\nAt Spring Hill Junction we were met by all the miners from Spring Hill Mines, who had been waiting from 3 o'clock in the afternoon to wish us God speed on our\njourney. The brass band was also in attendance. After watering and coaling engines we made another start. Bonfires were burning all along the road, and every devisable method used to prove to us that we had the good wishes of our own people—a wish, readers, which stimulate men to noble deeds.\n\nOrderly Sergeants were called, when orders were given to them to convey to their Companies that we would have supper at Moncton. Each man was duly served with a cup of coffee at this place, and a sandwich, which was highly appreciated, and some of us obtained the Moncton Times of 11th April, which many of us were not satisfied with, from the fact that whilst it praised some portions of our Battalion, it accused others of being insignificant, misbehaved, and almost disloyal, thereby throwing dirty water over their shoulders at a portion of the Battalion, which it claimed too much could not be said in praise of. I thought at the time, Well, it is very agreeable to read columns in newspapers which are flattering to one's self, yet it is disagreeable to know that the very same flattery attacks one's friends. What I at that time thought and knew to be friends, were the people of Nova Scotia, from Halifax to Aulac, in the direction which we were travelling, from east to west. North to south of this province, the character of its people were at stake. From the day the Halifax Battalion left Old Chebucto, until it returned, thank God, our actions cast no reflections upon them, as is to be seen in my further feeble attempt at describing their encounters and difficulties.\n\nOur next place of stopping was Campbellton, where we refreshed the inner man. At Trois Pistoles we did likewise. Also at Richmond, where we did ample justice to a good meal; but probably we would have done better had we known our next was so far ahead.\n\nShortly after passing Richmond, some of the rear cars became disconnected, and it was not until we travelled some distance that the engineer was brought to the consciousness that he was only bringing one-half his cargo. He at once reversed Stephenson's power, and we backed about seven miles before we again made connection with our lost ones, whose services we could not afford to lose at the time. \"All right\" was shouted, and again we bounded along as fast as civilization could carry us.\nNothing unusual happened on our way to Montreal, beyond the fact that we were all pleased to know that a good meal was ahead of us at that place. Oh! but oh how sadly disappointed, when, on reaching the \"Tanneries Station,\" we were ordered to parade in light marching order, in front of the cars, for the inspection of the Mayor and Corporation, who were accompanied by Colonel Oswald of the Montreal Garrison Artillery. After inspection, we were addressed by the Mayor, who complimented us on our appearance, assuring us that he felt heartily sorry that we had to leave his hospitable city without partaking of the splendid repast prepared for us, which made us feel all the worse; and, to add insult to our appetite, we could hear the officers popping the champagne and rattling their knives and forks, whilst poor Tommy Atkins had to content himself with sucking his thumbs. After the usual toasts had been given and responded to, Col. J. J. Bremner told the engineers all was ready and on board, with the exception of Sergeant Reynolds and the four men of the 63rd who were left behind at Richmond. I think they must have had a forecast of the length of time between meals, else they would not have got left.\n\nAgain we started, hungry and sorry for it. Fairly under way, we consoled ourselves with the fact that if all went well, Ottawa would be reached some time before Parliament prorogued, and that if we got no meal there we would make our grievance known to the Minister of Marine and Fisheries—the Hon. A. W. McLellan—a true Nova Scotian, who always carefully endeavors to make wrong right. Alas! we were doomed to disappointment. On our arrival there we were ordered to change all baggage, ourselves included, to the C. P. R. cars, which meant a two-hours' fatigue on a hungry stomach. We were glad even of that, from the fact that our legs were cramped and our arms numb, having been stowed in the cars of the Intercolonial for over sixty hours, forty men to each car. Most of my readers know how forty men with knapsacks and accoutrements must have felt in a second-class Intercolonial all that long journey. After the luggage had been carefully stored, we were informed that, owing to some matters having been misunderstood, we would or could not dine until we reached Carlton Place, but all those off duty could witness the presentation of colors so kindly purchased by the Nova Scotian Members\nirrespective of party. Any of us who were strong enough did go, and were quite repaid. The Hon. Mrs. McLellan presented them in well-chosen words, which were ably responded to by Lieut.-Col. Bremner. The Governor-General's Foot Guards formed the Guard of Honor, the Colors were escorted on board the train, and, although we did not feel fuller, we felt prouder men, from the fact that we had gilded colors to flourish in the wind, if we had no music to remind us of the girls we had left behind; and with those consoling feelings we started off again.\n\nWhen we arrived at Carlton Place a good meal was in readiness, and, if ever justice was done to a meal, it was done to that one. Here we lost our Captain—Captain Curren—which we did not discover until we were some distance on the road. He evidently thought as Sergt. Reynolds and his men did, and consequently waited for them. All along our journey the Colonel received telegrams, \"We are coming,\" and they did come. At Pembroke, Ontario, the ladies sent all sorts of delicacies on board in baskets, etc., each basket or box containing a note. The basket which came to our car contained a note which read as follows:\n\nBrave Halifax Volunteers:\n\nGod speed you on your long journey! May the right arm of the Lord fight with you and for you, is the wish of a niece of the late Professor King, formerly of Halifax.\n\nI kept no diary of the journey, but committed this to memory. You will excuse me if her note is not in full. Here there were thousands of people on the platform, and the band of the 42nd discoursing sweet music. Col. Bremner thanked the people of Pembroke, and the ladies especially, for their kind thoughtfulness of the Halifax boys, after which Col. C. J. Macdonald addressed the ladies in particular. He was well suited to the task, for he is quite a lady's man.\n\nBiscotasing was the next place where we halted for meals, a place of small note except that it had formerly been the headquarters of the C. P. R., but is passing into the past quickly. We dined in log huts, and were compelled to take whatever they were willing to give us. When the usual bugle call sounded, we all boarded the cars again, and made tracks, knowing that delays were dangerous. We rolled along until dusk, when we halted for two hours, lit camp fires and made coffee. Here it was that Col. Sergt. Kaizer\nwas lost in the woods. After travelling seven or eight miles we stopped and sent back for him, the party rejoining us on a trolley. He being placed safely on board, we got up steam again and rolled along slowly, arriving at the end of the line next morning. At this place there was a large number of sleighs in attendance; each sleigh was to carry some bags and knapsacks, as well as a certain number of men who were baggage escort. Before we reached Maggie, the first place where our colors were unfurled, we discovered the sleighs could not carry the baggage, much less the men. One old soldier whose knapsack fell over and got slightly damaged, said, \"I have carried one on my back twice the distance and never got it hurt, and, in order to keep it from further abuse, I will carry it again;\" and so saying, he buckled it on and would not trust it to the care of the teamsters. We arrived at the end of our march about 9 30 p.m., where the men who arrived on the first teams had coffee prepared for us, thanks to Capt. Corbin and his indefatigable exertions. Large fires were also burning, which served to revive our feelings. The coffee having been drank and each man warmed, we were ordered to march to the cars. \"What cars?\" asked we of each other—(although I had travelled a great deal, it was the first time that I ever travelled as a soldier on a flat car). \"The flat cars,\" shouts a voice from above, somewhere around the engine. As we were so far away, we could not properly ascertain; and to this day I cannot tell who it was. We got on board the flat cars—as they were called, and our first night on them will be remembered by us as long as we live. Next morning we woke up stiff, wet, hungry and footsore. Remember, readers, this night of which I speak the thermometer was 7 degrees below zero. We made out as best we could, but the tug of war came off when we marched that twenty-seven mile across Lake Superior. It came hard enough upon me and the likes of me, but how must it have been with those poor young men who never experienced any hardships? I had always entertained notions that delicate and pampered people were liable to degenerate, but such is not the case with Nova Scotians, or Canadians in general. The blood of the Celt and Saxon is there and will forever remain intact, slow to anger, but when roused are lions. Finally, we reached Red Rock, where the C.P.R. cars were awaiting us—not flat cars this time, but good comfortable sleepers.\nWe revived the inner man with coffee and hard tack, after which we started, reaching Port Arthur in time for a square meal. The hardships of the gaps were forgotten, and the boys had a jolly good time. Myself and another Artilleryman, a sergeant named Lowrie, did not go ashore here. I forgot to mention that Capt. Curren, Sergt. Reynolds and the other four men, overtook us at Red Rock. As soon as they were sighted, the men of their Companies ran to meet them; the Captain was lifted off his feet and carried to Company, whilst the other men were cheered and re-cheered for the pluck and determination they had shown in following us up so determinedly against all odds. When all hands felt satisfied, we were ordered to advance for the Prairie City. Nothing of note took place until we reached Rat Portage, where poor Marwick died. We heard the sad news of his death as we were returning to the cars from supper. It cast quite a gloom over the Battalion.\n\nWe reached Winnipeg on Wednesday morning the 22nd April, having completed the journey in 10 days and 16 hours—the distance from Halifax through United States territory being 2,561 miles, distance as travelled by Halifax Battalion, 2,973 miles. At the Station we were met by a delegation of Nova Scotians, who welcomed us in the name of the resident Bluenoses of that city. We dined at the C. P. R. dining-room, after which we paraded in heavy marching order and proceeded to Knox Hall (headed by the bugle band) to await orders. As soon as everything was put in order, we settled down to regular barrack life, drilling in the hall, in the streets, in the highways and byways. The Friday after our arrival we were entertained in Selkirk Hall by the Winnipeg Nova Scotians; and when I call it an entertainment I simply nickname it. It was beyond an entertainment, something which language fails me to describe. After justice had been done to the repast prepared by the ladies, and the tables cleared, songs, readings and addresses were given. Mr. Ptolemy rendered \"Rule Britannia\" in a manner which he only knows how to give it. Rev. Mr. Pitblado and others spoke at some length, Cola. Bremner and McDonald and several of the officers replying in a suitable and appropriate manner. The singing of \"God save the Queen\" brought a happy evening to a close, and one to be long remembered. On the following Sunday the Battalion paraded for Divine service, the Catho-\nlies attending St. Mary's, and the Protestants Selkirk Hall, where the Chaplain of the regiment, Rev. Mr. Pitblado, preached an able sermon. He reminded us that the eyes of this Dominion were closely watching our actions, particularly the province from which we came, whose character was at stake. He felt sure, if called face to face with the enemy, we would be no discredit to that province which had produced such illustrious men as Sir Fenwick Williams, the Hon. Joseph Howe, Sir Chas. Tupper and others. But we were to remember that it was not only before the enemy we could bring disgrace or credit upon the province by the sea, but by our every-day actions. Dear reader, judge for yourself how carefully we tried to follow his advice. Sunday afternoon, orders were received to proceed to the front. To our sad dismay, they were again countermanded. Finally they came, and we started for Swift Current, N.W.T. We arrived there on Thursday evening. When passing through Brandon, the ladies of that place came through the cars and supplied each man with luxuries and delicacies of all kinds. Previous to leaving Winnipeg, each of us received a pound of tobacco from Tuckett & Co., tobacco manufacturers, of Montreal, which proved to be a substantial gift before we saw Winnipeg again. We disembarked on the morning after our arrival and pitched our tents alongside of the 7th Fusiliers of London, Ont. The following day we were inspected by Major-General Laurie, commanding the base and lines of communication. He expressed his pleasure at having us under his command, remarking that he had commanded and drilled our fathers in many cases as well as ourselves. He told us that a regiment second to none lay alongside of us, from which we could learn much, and in return they could learn much from us. On Sunday we paraded for Divine service—the whole Brigade, including the 7th Fusiliers and portion of the Midland Battalion. Rev. C. B. Pitblado preached an eloquent sermon appropriate to the occasion. The troops were formed in square and the drums were placed in the centre, which answered as a stand for the Bible and prayer-books. After service, all those who were off duty were allowed to roam and admire the prairie, but were not allowed to go out of hearing of the bugle call, as we at any moment might be required for immediate service. On Monday morning reveille sounded at 5 A.M., parade 6, from which time we drilled until 8.\nA fatigue party was detailed to go and unload supplies which had arrived the night previous,—a task which, although laborious, was most cheerfully performed. A few days afterwards, an order was received for the 63rd to proceed to Maple Creek. They struck tents, or at least they were struck for them out of respect by Capt. Curren’s Battery of Artillery; but, before they had put their luggage on board, an order came that they were not to go, but, instead, the 66th were ordered to go to Medicine Hat. About 8 p.m. the train steamed out of the station, carrying with her the 66th Princess Louise Fusiliers, as fine a body of soldiers as ever wore Her Majesty’s uniform. The Artillery, 63rd and 7th Fusiliers cheered our brave comrades as long as they could be seen, for which of us knew that ever we would see them again? We returned to camp feeling as sorrowful as we had done since leaving our own dear Halifax. A few days later the 7th Fusiliers were ordered to the front, which left only the Companies of Rifles and two of the Halifax Garrison Artillery. We still felt lonelier than ever. Surrounded on all sides by hostile Indians, we knew not when our little band would be attacked; but the loss of our comrades was more keenly felt by us than the fear of attack—in fact, that we courted rather than shunned. Two days later, and the order came for the two Scotch Companies of the 63rd to proceed to the Landing—Saskatchewan Landing, I mean. We bid a last farewell when about two miles away from us. They were on top of the hill at the back of Swift Current, when a cheer was given which we plainly heard in camp, and we returned it with three times three. That night our sentries had less steps to take, as their posts were shortened, but their vigilance was awakened. The hardships which the two Companies of Rifles endured can be better imagined than described: carrying hay, oats and all other kinds of supplies, towing scows up and down the river, doing guards with one and two nights in bed, in a most dangerous position, fed on hard tack and bully beef; yet they did it without a murmur. They were commanded by that gallant soldier, Major Walsh, who was ably assisted by Capt. Cunningham and Hechler.\n\nAt Moose Jaw that laborious and irksome duty, fatigue, was carried on under the direction of that genial commander, Col. C.J. Macdonald, ten hours each day, as many men as could be furnished. Our total strength had dwindled\ndown to 113 non-commissioned officers and men. This 113\nmen had to furnish 50 men daily for fatigue, 20 for guard,\nand 20 for inlying picquet, which left 23 for regimental\nfatigue, officers, servants, cooks, etc., no allowance being\nmade for casualties. Nevertheless it was done faithfully\nand well. Col. Macdonald was not without competent offi-\ncers to help him. There was Capt. Curren, a man who is\nrespected by all who know him; Capt. McCrow, a gentle-\nman who had served in the Imperial service, whose word\nwas as good as his bond. The duties of Acting Adjutant\nwere ably carried out by Captain Fortune. Those officers\nwere in turn assisted cheerfully by the officers, non-commis-\nsioned officers and men of their respective Companies. One\nnight at Moose Jaw, shortly after \"lights out\" had sounded,\nwe were all alarmed by the firing of shots. The guard and\npicquet turned out at once, whilst the remainder were held\nin readiness. The picquet under command of the Field\nOfficer of the day (Capt. McCrow) searched the ravines and\nplaces where Indians were likely to be secreted. After a\nfruitless search they returned, saying they could see nothing\nin the shape of Indians. Gunner Buckland stated that as\nhe was crossing the ravine, two shots went over his head.\nThe shots were heard plainly, but most of us concluded it\nwas teamsters who were out shooting prairie wolves, which\nwere quite numerous around there at the time. We all felt\nsatisfied that it was no signal for attack, and turned in to\nenjoy our night's rest as best we could. That you could\nnot do very well, as the sentries called the No. of their post\nand the \"All's well\" every half hour during the night.\nThe routine observed at guard-mounting was as follows:\nThe dress sounded at 8 30 A.M., fall in at 9 o'clock. They\nwere then inspected by the Battalion Sergeant-Major, then\nby the Officer of the day, then by the Acting Adjutant,\nafterwards by the Staff Adjutant, and finally by the Field\nOfficer. Any man whose name was taken for being impro-\nperly dressed, had to do extra drill; so that all hands tried\nto present as soldier-like an appearance as possible, in order\nto avoid any extras. Most of us thought we had quite\nenough to do as it was. We often wondered how the boys\nwere faring at Medicine Hat. From what we could hear,\nthey were not having a very easy time. Trench digging and\ndrill, we were given to understand, was the order of the\nday. The appearance of the 66th, on re-joining the Bat-\ntalion, proved beyond all doubt that they had been well drilled. No two better drilled Infantry officers could be found in the Canadian militia than Col. Bremner and Adjutant (Captain) Kenny, to whose indefatigable exertions the high state of discipline attained by the Battalion was due.\n\nWell, to return to the daily routine at Swift Current, we continued to do all fatigues which fell to our lot on the base of supplies there, until an order was received from Gen. Middleton that the Brigade Field Hospital Base of Supplies and Detachment Halifax Battalion was to move to Moose Jaw. On Saturday the 23rd May we bid good-bye to Swift Current.—some of us caring little if we never again see it, unless to pass through it on our way to some other place. We arrived at Moose Jaw about 4 p.m., just too late to see Reil, who had only passed through that morning. We pitched our tents about half a mile from the town. We moved closer in after a few days stay, as the doctors considered the water was not fit for use. Our stay at Moose Jaw was much more agreeable than at Swift Current. The Monday after our arrival we paraded in Review order, and went through the motions of firing a feu-de-joie in honor of the anniversary of her Majesty's birth, after which three cheers were given for our Gracious Sovereign Queen Victoria. We were inspected by Gen. Laurie, who highly complimented us, and only regretted the remainder of our Battalion were not present. He stated that the corps to which we belonged were worthily represented by us, as well as the city and province from which we came. He also felt satisfied that the portions of our corps at home would have done likewise had they the opportunity. The same routine was carried out here as at Swift Current, only the monotony was taken off, from the fact that we were more amongst civilization.\n\nThe inhabitants of Moose Jaw paid us every attention, so much so, I thought more of the Battalion would have remained there; and as the killed and wounded who were sent home passed through, as well as those who remained here in hospital; we had something to interest us, and many opportunities of proving that we were all one common family. On several occasions we acted as escort to the remains of the brave boys who lost their lives in the defence of their country; and also opportunities were given us to cheer and comfort those who were invalids far from their kindred, and God grant we may not have lacked any of those qualities\nwhich are essential to the proper embracement of the opportunities which I speak of. Shortly after our arrival at Moose Jaw, there came from Toronto three Sisters of the Church of England, also three trained lady Nurses of the same denomination, whose lady-like manners, refined education and tender care, endeared them to all with whom they came in contact. I hope if they never reap their reward in this world, they will in the next, where rewards are not temporary but permanent. On the 8th June a grand Powwow was held, of which I gave an account in the Evening Mail. We had several Rifle Matches with the Moose Jaw Guards, Base Hall and other social contests, which tended to create and promote good feeling. We at last heard the 63rd were coming from the Landing—news which gladdened our hearts beyond imagination. The evening they arrived, all of us off duty met them at the Station to escort them to our camp ground. They were as eager to join us as we were to receive them. A few days later, Col. McDonald received a telegram from officer commanding at Medicine Hat, that the Battalion was to concentrate at Moose Jaw preparatory to proceeding to Winnipeg. I cannot begin to describe the hilarity of the camp on promulgation of this order. It is more than I could do. Some little disappointment was felt when it was announced that the Battalion would not start until the Colonel returned off leave. The Colonel informed Captain Weston that he was to go on to Moose Jaw with the Headquarters and 66th Regiment, at which place he would join the Battalion. True to his word, he was with us a week before we left for Winnipeg. That week was entirely devoted to drill. Our Battalion being all together, the Colonel and Adjutant had an opportunity of seeing what we were like. On the third parade he said he felt satisfied that when we got to Winnipeg we would compare favorably with any other troops taking part in the review. On Sunday the Battalion paraded for Divine service. The Protestants, forming a three-sided square, with several of the gentry behind, were addressed by the Rev. C. B. Pitblado, who preached an eloquent sermon from the 6th chapter of Galatians and 5th verse: \"For every man must bear his own burden.\" During our stay at Moose Jaw, the spiritual wants of the Church of England portion of the Artillery and Rifles were attended to by the Rev. Mr. Sargeant, Rector of St. John's, a gentleman who endeavored to meet\nrequirements. The Presbyterians and Methodists were looked after by their respective pastors, whilst the Roman Catholics always had Sunday services conducted by the senior officer present of that denomination. On Monday, Col. Bremner received a telegram from Gen. Middleton, informing him that the Battalion was to leave for Winnipeg on Thursday, 9th July. On that day we struck tents at 10 o'clock, by order of Capt. Kenny, but he evidently was acting under instructions from Capt. Doull, the Quarter-master of the Battalion. At 4.45 we paraded and marched to the Station, where the cars were in waiting for us.\n\nDear reader, please excuse me for carrying you back for a moment or two whilst I describe, as well as I am able, the way in which we celebrated Natal Day. On Sunday morning, the 21st June, the car with the kind presents arrived at Moose Jaw. Immediately a fatigue party was dispatched to unload and sort what was for each place, and, after being re-placed on board, the lot which fell to the share of the Department at Moose Jaw was taken to camp. After Church was over, that which was directed to individuals was distributed. Many expressions of gratification were heard, and those who did not express in words, did so in appearance. Sunday being duly observed, Monday was the day set apart for the celebration of the anniversary upon which the Britons came over, and right royally it was celebrated. The camp was beautifully decorated in honor of the day. Flags, banners and mottoes were displayed appropriately. The tents were all named thus: \"The Boozer's Den,\" \"The Hotel de Peace and Plenty;\" \"The Residence of Loyal Nova Scotians;\" \"The Hotel de Grab-All;\" \"The Halifax Horse-Shoe;\" \"The Three Gophers;\" \"Our Prairie Home,\" and several other peculiar titles. In the afternoon the camp ground was visited by Rev. Mr. Sergeant and family, the Presbyterian and Methodist clergymen, and also by the ladies and gentlemen of Moose Jaw, as well as by the trained lady nurses from the Brigade Field Hospital. No. 1 Company invited the convalescent patients of the various regiments to spend the day in camp, an invitation which was gracefully accepted. In the evening we were honored with the presence of Gen. Laurie, also Mrs. and Miss Laurie, who visited each tent, and were highly pleased with everything they had seen. Several games were indulged in—horse-racing; or, as I should call it, Indian pony-racing,\nbase ball, pow wow, and finally a tug of war between the two Companies of the H. G. Artillery, which was witnessed by General, Mrs. and Miss Laurie. It was well contested. Dancing was kept up until midnight, when the men called for cheers for General Laurie, which were given with a will. Col. McDonald and Officers of the detachment, His Honor the Lieut. Governor of Nova Scotia, His Worship the Mayor of Halifax, the people of Nova Scotia, were all toasted on the prairie, on Natal Day, 1885, with three hearty cheers, after which God save the Queen was sung, and a pleasant day was brought to a close. Pardon me, my dear reader, for carrying you back and detaining you to describe our celebration. As I am writing this from memory and not from diary, I feel sure you will forgive me.\n\nBut we will go back to the platform where Jock Patterson is playing his farewell from the pipes to Moose Jaw. All having got on board, we started for Winnipeg, bidding good-bye to the great North-West—a country, parts of which I have seen is second to none; its climate is healthy, not subject to epidemics of any kind; in summer the days are warm and the nights cool. Good water is easily obtained by digging from six to ten feet; in most parts of the prairie ponds and lakes are to be found. The soil is rich, black, agrillaceous mould or loam, from two to four feet deep on a very tenacious clay subsoil. The prairie grass is very fattening to cattle of any kind. Seeding can be done in April and May. The cost of living, east of Swift Current, is little if any more than in Nova Scotia. Provisions and goods of all kinds can be purchased at reasonable prices. The further you go east of Moose Jaw, until you reach Winnipeg, the richer you will find the soil. The prairie abounds with duck of every variety. The eye never rested on a finer country than is to be seen from Moosomin to Winnipeg. All that is required to make the North-West a great country is population and capital. Our trip from Moose Jaw to Winnipeg reminded us very much of the time we had coming out. Owing to some misunderstanding, we had to wait until we got to Winnipeg before we got anything to eat, with the exception of a lunch on the cars, in the shape of two loaves and some canned fish amongst forty of us. Those who even saw the loaves or fish were fortunate. I tell you when we got into the C. P. R. dining-room at Winnipeg, we made up for lost time, and don't you forget it. After\ndoing justice to the inner man, we paraded in heavy marching order, and marched through Main Street, which was gaily decorated in honor of the returning Volunteers from the front. We were headed by the bugle band and Jock Patterson, both of which seemed to be admired. We marched above two miles, when we arrived at our camp ground. Tents were pitched, and the usual guards and picquets posted. Leave was granted and several of the boys availed themselves of the opportunity to go and visit their friends and acquaintances. On Saturday morning we drilled as usual, preparing for the Review. Sunday we attended Church in Selkirk Hall, the Catholic portion attending Mass at St Mary's. Rev. C. B. Pitblado preached a beautiful sermon, referring chiefly to the conduct of the Halifax Battalion—informing us that so far we had been true to our trust—that Nova Scotia had reason to be proud of the conduct of the Halifax Battalion. After the Battalion came back to camp and had dinner, visitors were allowed within the lines, and in a short time many ladies and gentlemen were to be found within the enclosure of the Halifax encampment. On Monday the usual drills were carried out under Capt. Kenny, a gentleman who was very fond of parades, and without doubt thoroughly understands how to handle a regiment on parade. The Montreal Garrison Artillery were the first troops to arrive in Winnipeg after ourselves. Their camping ground was a little to the north of us. When they arrived, our boys turned out and pitched their tents, after which the Montrealers with their band turned out and gave three cheers for the Halifax Battalion, the band playing \"They are jolly good fellows.\" The Montreal Garrison Artillery is commanded by Col. Oswald, who spares neither time or money to bring his Brigade to a high state of efficiency. I am saying little in their favor when I say that they are the finest Brigade of Militia Artillery I ever saw either in Canada or any other country. Of that branch of the service I claim to know a little, having spent the best part of my life in that noble old corps, the Royal Regiment of Artillery. On Wednesday the 9th Voltigeurs of Quebec and the Halifax Battalion paraded to receive the Major-General commanding the whole Brigade under command of Col. J. J. Premner. We were headed by the band of the Montreal Garrison Artillery. Main Street was crowded with thousands of people. We marched\nthrough the arches in fours. As soon as we cleared them, the command \"Front form Companies\" was given; the Battalion then proceeded to the depot in that style; and if ever the Halifax Battalion looked to advantage, it was on that occasion. There was prolonged applause, with shouts, \"Well done, Halifax!\" \"Hurrah for Halifax!\" etc. The 6th Regt. did not try the marching in Companies; they formed up on the east side of Main Street, and we were on the opposite side. After considerable delay the Major-General landed. He passed between both regiments. We gave the general salute during the time he was passing. He seemed to notice all that was going on. We then formed fours and marched back through Main Street some distance, when we were halted. After some consultation between the authorities, we were marched back again to the station. We remained there another hour, when the order was given to march to camp. We went back through Main Street in the same order that we came, reaching camp about 6 o'clock, when we had tea. We were thankful to get relieved, as we had been six hours on parade without an opportunity of falling out.\n\nThat evening the Toronto Grenadiers, the Queen's Own Rifles, the York and Simcoe Foresters, the 90th Battalion and Governor-General's Foot Guards, arrived in Winnipeg. Our sojourn with those corps was not of sufficient duration to enable us to judge much of them. Their actions speak for them. I noticed that the Royal Grenadiers of Toronto looked more like a regiment of regulars coming off a long campaign than anything I've seen since the Ashantee war. The Queen's Own Rifles are a fine looking body of men, who march with a bold swinging gait. The greatest excitement prevailed when the 90th made their appearance, headed by Gen. Middleton. It was one continual cheer.\n\nOn the following day there was to have been a parade of all the troops in Winnipeg for the purpose of holding a Review. It's an old saying, \"Man proposes, but God disposes.\" All that night it rained as it only can rain in Winnipeg. The next morning everything was floating in the tents. We could not move. Our bedding and clothing were wet through and through, and, if we made any attempt to move, we went into the mud up to our knees. Unfortunately for us, our tent was pitched on a roadway, which made it worse. Everyone was feeling out of sorts, in our tent at least, when\na gentleman by the name of Winters, formerly an Armorer Sergeant in the Royal Artillery, placed a vacant house at our disposal. His offer was accepted with many thanks. After moving into our new quarters we felt somewhat better, but then we could not cook any food, it was raining so hard outside. A great many of the men went out in town to get dinner, as there was not much probability of getting one in camp. But thanks to our energetic cook, Gunner D. Cohn, we were furnished with a good dinner. In the afternoon the sun burst through the clouds; it ceased raining; and, what made it more pleasant, the order was received that we were to leave for home that evening. Our tents were left standing or were handed over to the Barrack Department; also our blankets and waterproof sheets. At 5 p.m. we paraded in heavy marching order, and, after some delay, marched off. The streets were thronged with soldiers and civilians bidding good-bye and wishing us a pleasant journey. At the Station it was almost impossible to move. The band of the 90th serenaded us whilst we dined in the C.P.R. dining-room. After dinner or supper, whichever you wish to call it, we boarded the cars, but it was not until after midnight the train steamed slowly out amidst tremendous cheering from the crowds which had patiently waited to witness our departure. Owing to some misunderstanding regarding the stopping of the train outside of the Station, Col. McDonald was left behind, which was not very pleasing to many of us.\n\nNothing of very great importance occurred on the road to Port Arthur beyond the fact that Private Kiley of the 66th got left at Rat Portage, from which place he sent a telegram to Col. Bremner, which read as follows:—\"Left. Yours truly, KILEY.\" We arrived in Port Arthur at midnight. Flags and banners were displayed across the streets in honor of our return. We at once disembarked and marched down to the wharf, where the steamer \"United Empire\" was in waiting to convey us to Sarnia. When the baggage was got on board and everything ready, the order was given to cast off. As we moved away from the wharf, we gave three cheers for Port Arthur, which compliment was returned by those on shore by giving three cheers for Halifax and the Battalion. We could not see much until daylight. When I went up on deck to look around this immense inland fresh-water sea, steamers were plying to and\nfro in all directions, towing schooners of different sizes laden with mineral ore, coal, lumber, etc. We were told that trout weighing 80 lbs. were caught in Lake Superior. As to the veracity of this statement I shall not vouch. On Sunday morning we went up the river Sault Ste Marie and passed through the Loch which connects Lake Superior with Lake Huron. We touched the American shore, and several of the men jumped ashore just to say they had been on American territory. As we passed the Fort where the American soldiers were stationed, they waved their caps and handkerchiefs until we were lost to sight. At 11 o'clock all hands paraded on the weather deck, where service was held. It was a magnificent sight to look around on the placid waters of Lake Huron, and to hear the voices of 380 Canadian soldiers singing in unison, \"Nearer, my God, to Thee.\" In the evening, service was held in the after-saloon, and was attended by all the cabin passengers, as well as all of the Battalion. After service the choir sang \"For those in peril on the sea,\" \"On our way rejoicing as we homeward move,\" and several other selections from the Church Hymnal. We sighted Sarnia about 8 o'clock Monday morning. As soon as seen, our approach was signalled by the blowing of whistles, ringing of bells and playing of bands. A steamer loaded with citizens met us some distance down the harbor and escorted us to the wharf, where a Guard of Honor from the Sarnia Artillery was waiting to receive us. They presented arms as we touched the wharf. Higher up was another from the 27th Battalion. Whilst the 27th Battalion band played several beautiful selections, we disembarked at once, piled arms, took off our knapsacks, and, headed by the 27th band, marched through the principal streets, which were beautifully decorated in honor of our visit. The Battalion was formed up in front of the City Hall. When the Mayor and Corporation were ready, His Worship read an address to Col. Bremner and the officers and men of the Battalion, which was suitably replied to by the gallant Colonel. We then piled arms and marched in by Companies to partake of the splendid repast prepared for us by the fair ladies of Sarnia. After justice had been done to the inner man, all were called to order. We were told to fill our glasses. We did so, with ice-cold lemonade. The first toast was that of our Sovereign the Queen, the Governor-General of the Dominion, General Middleton and the Vo-\nlunteers of Canada, which were all responded to in a most appropriate manner. Col. Bremner then proposed the health of the Mayor and Citizens of Sarnia, which was drank with a will. Col. C. J. McDonald was next called upon. He had a large bouquet in his button-hole, and looked every inch an officer and gentleman, as well as a ladies' man. He proposed the health of the ladies of Sarnia, which was duly honored, after which three cheers were given for them. Various addresses were given and replied to, the National Anthem was sung, and the Battalion reformed outside. I might add a nice satin badge was pinned on the breast of each member of the Battalion by the bandsmen of the 27th band. The following inscription was on the badge: \"27th Battalion Band, Sarnia, welcome return of the Halifax Battalion from the North-West, July 21st, 1885.\"\n\nWe un-piled arms and marched through the remaining streets of the city, then to the Station, where the emigrant sleepers were in readiness. We left Sarnia amidst the greatest enthusiasm, and with pleasant recollections of our entertainment. At London we were also banqueted by the citizens. Addresses were presented and everything possible done to make us feel happy. Everywhere along the road the people were trying who could do the most—at Hamilton, Niagara Falls, and all the places we came to. Niagara Falls heralded our arrival by grand displays of fireworks. We remained here for the night. Every one was granted an opportunity of visiting the Falls—a sight never to be forgotten. After having breakfast next morning, we turned right about for Hamilton. After remaining there some time and partaking of their kind hospitality, we started for Toronto. On our arrival we were met by the band of the Royal Grenadiers, and the men who had been wounded and sent home from Moose Jaw, whom many of us knew. The Queen City looked its gayest, and the Torontonians turned out in thousands to greet the Haligonians. We were served with a splendid dinner, nothing stronger than lemonade being allowed on the table. Whilst one portion of the Battalion was at dinner, the remainder was in the Drill Shed. We piled our arms on the Market Square. On the \"fall in\" being sounded, each man fell into his place. Arms unpiled, we marched to the cars, the band playing lively tunes. Some of the men could not be found, and the train was consequently delayed. Finally, we started, giving three\ncheers for the Queen City and its inhabitants. On our way to Montreal nothing happened to mar our pleasure. The men who were left behind overtook us at Coburg. When we arrived at the Tanneries Station, we were met by the Mayor and Corporation, Colonel Stephenson, and all the military and civil dignitaries of the city. The Mayor welcomed us in the name of the City of Montreal. A splendid breakfast was provided for us, the military men acting as waiters. The pipers of the Royal Scots played during the time we were eating, which helped to make our appetite keener. At one end of the room was posted, in large letters, \"Well done, Halifax!\" Immediately breakfast was over, we boarded the steamer and went down the Lachine Rapids, the band of the Victoria Rifles playing alternately with the pipers of the Royal Scots; passed under the Victoria Bridge, and landed about one o'clock. A salute was fired by the Montreal Field Battery. The Cavalry and Field Battery acted as an escort. We marched off headed by the band of the Victorias. Our appearance was the signal for a long and continued ovation. Cheer upon cheer rent the air. The decorations were beautiful. We marched to the Field Battery Drill Shed, where arms were piled, after which we had lunch at the hotel, where busses were waiting to take us up Mount Royal. At 5 o'clock we paraded at the Drill Shed and marched back to the Tanneries, headed by the Mayor and Corporation. Tea was ready for us here, or, I should say, dinner, for a genuine dinner it was. About 8 o'clock we got under way, but stopped again to allow a train to pass. The crowds were tremendous. Each man was presented with a flag. I forgot to mention, at the City Hall the Mayor presented an address to Col. Bremner. A bouquet was pinned on each man's breast by the ladies of Montreal. Cheers were called for the Queen, the Ladies of Montreal, the Mayor and Corporation, all of which were given in a right royal manner. Our reception in Montreal was far beyond all expectations.\n\nOn the following morning we arrived at Point Levi, where we had breakfast. The people of Quebec were not aware that we were to pass through that way. From Point Levi to Moncton our progress was slow, owing to breakdowns, axles catching on fire, etc. At Moncton each man received coffee and sandwiches. Our stay there was not of any great duration, nor did we wish it to be. We got fresh-\nengines at this place, and rolled along quickly from there to Dorchester. Passing through Aulac, Amherst and all the stations on our road home through Nova Scotia, the people extended us a cordial welcome.\n\nAt Truro we were met by the Mayor and Reception Committee, who furnished each man with an invitation card and a card of welcome. At Oakfield we were met by Gen. and Mrs. Laurie. On their being seen, cheers went up in all directions. Mrs Laurie presented each one of us with a bouquet, through the Captains of Companies. We started off again feeling as if we were in Halifax. Very little delay was made until we arrived at North Street. The scene which awaited us there was one never to be forgotten. We could scarcely realize the fact that we were home again, getting welcomed by our own relatives and friends, who, on the 11th April, bid us God-speed at the same place. Halifax looked its gayest as we marched through the streets. It looked like a transformation scene. Those who saw inside the Exhibition Building that night would join me in saying it paid us for all we went through. There was wealth and beauty which the world could not outstrip, coaxing the Volunteers to partake of some more of the good things which the kind mothers of Halifax had prepared for us. After supper Col. McDonald called the Battalion together, when he asked for three cheers for the ladies of Halifax. It was three times three, and then three tigers. We were then marched to the Drill Shed, the same that we marched out of, nearly in the same place, our ranks thinned but little. There were two absent from us who never again shall fall in in the ranks of the parades here below, but we trust they will on that vast parade ground beyond. They shall forever live in the memories of their comrades. Our arms returned, we fell in and dismissed.\n\nNow I trust, dear reader, that you will say with me, whilst we had no opportunity of bringing home honors to our city and province, we tried to maintain its reputation as best we knew how.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001541.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 25, "total-input-tokens": 33542, "total-output-tokens": 12128, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 191, 1], [191, 191, 2], [191, 382, 3], [382, 831, 4], [831, 2619, 5], [2619, 4998, 6], [4998, 7323, 7], [7323, 9733, 8], [9733, 12083, 9], [12083, 14553, 10], [14553, 16971, 11], [16971, 19412, 12], [19412, 21851, 13], [21851, 24327, 14], [24327, 26807, 15], [26807, 29249, 16], [29249, 31675, 17], [31675, 34128, 18], [34128, 36547, 19], [36547, 38934, 20], [38934, 41329, 21], [41329, 43788, 22], [43788, 46212, 23], [46212, 48609, 24], [48609, 50633, 25]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]