[{"id": "3ee2447a7b005ef9079d62914a0705fcc8138fd9", "text": "THE\n\nHistorical and Scientific Society\n\nOF MANITOBA.\n\nINAUGURAL ADDRESS,\n\nDELIVERED BY THE PRESIDENT,\n\nMR. CHARLES N. BELL, F.R.G.S.,\n\n28th FEBRUARY, 1889.\n\n(TRANSACTION No. 34.)\nAt a regular monthly meeting of the Manitoba Scientific and Historical Society, President C. N. Bell delivered the following inaugural address to the officers and members:\n\nThis being the first meeting of the society since the annual election of officers, I take the opportunity afforded me of addressing you on the subject of what should be our lines of work during the coming year. The avowed object of the existence of our society is \"to collect and maintain a general library of scientific and popular literature, also to embody, arrange and preserve a library of books, pamphlets, maps, manuscripts, prints, papers and paintings; a cabinet and museum of minerals, archaeological curiosities and objects generally illustrative of the civil, religious, literary and natural history of the lands and territories north and west of Lake Superior; to rescue from oblivion the memory of the early missionaries, fur traders and settlers of the aforesaid lands and territories, and to obtain and preserve narratives in print, manuscript, or otherwise, of their adventures, labors and observations; to ascertain, record and publish, when necessary, information with regard to the history and present condition of the said regions, and the society may take steps to promote the study of history and science by lectures and otherwise.\"\n\nThe society has not been idle during the years of its existence, having collected a large number of books, pamphlets, papers and manuscripts, with a very fair museum, in addition to publishing thirty-three papers read by members and friends at our monthly meetings. Much has been done, but we have a wide and fertile field of research to labor in, and I desire to suggest some definite lines of work that call for our prompt attention, in the hope that members will be induced to take an interest in them, and afterwards give us the result in the form of papers for publication.\n\nThe Ethnology of the Indian tribes of the Northwest is a field that has attracted, as yet, but few active workers. The rapid advance of civilization is quickly removing opportunities for observing and recording data relating to the languages, social life, dress, dwellings, utensils, medicinal preparations, mortuary customs and legends of the natives. If we do not grasp the opportunity which is present, members in future years will justly accuse us of negligence and want of foresight. During the past three years the American Bureau of Ethnology has expended large sums in collecting the surviving legends of the Seven Nations people, diluted as they must be by the intrusion of modern reasoning and coloring. A strong and active effort on our part at this time, by soliciting those brought into contact with the Indians, to secure for us the legendary and other data mentioned, should not be barren of results. What may be called a kindred subject is the movement of the Indian tribes in the Northwest. We have available a certain amount of information to be found in the books written on the country now included in Canada, during the past 200 years, but much should be learned from the traditional stories related by the different Indian peoples. I believe that to a great extent the recession to the west of the buffalo was followed by a general disturbance of the then understood boundaries of the Indian countries. In the first days of the present century it is known that the Iroquois from Lower Canada, accompanying the white fur-traders, had penetrated to the Saskatchewan and even to the Pacific coast. So in the case of the Saulteaux, who followed their near relatives, the Crees, into the Saskatchewan country and to some extent lost their peculiar \"wood Indian\" customs and habits in living near or on the great plains for the purpose of hunting the buffalo. The Assiniboines, who gave their name to one of our rivers, in the early part of this century inhabited a part of the territory now in Manitoba, and to-day they are collected in the Battleford district. So far as has come to my notice, little or nothing is known of the religious customs of the Crees and Northern Indians prior to the advent of the white missionaries. This is a subject that might be investigated with some hope of success, and as French Jesuit missionaries accompanied La Verendrye in his travels into this prairie country in 1734, it would be most interesting to learn if Fathers Provencher and Dumoulin in 1818, on their arrival in Red river, found any Christian religious observances practiced by the Indians as the result of the spiritual work of the first missionaries. It is true it would be difficult to distinguish the work done by these original fathers, when we know that after they left the country the Indians had associated for a long term of years with the white fur traders, some of whom, judging from their written journals, were men of Christian character.\n\nA complete history of religious work in this country since the appearance of missionaries, with the statistics of the churches built, and attendance, would be valuable. The material for such a paper is likely obtainable.\n\nThe history of education in the Northwest would give scope enough to some active member, for presenting an important contribution to our list of papers. Some\nletters recently brought to light will supply information on the educational facilities offered in the Red River Settlement in 1825-33.\n\nAn explanation of the different forms of government that have prevailed in the Selkirk Settlement would be an important addition to our papers on the history of the settlement.\n\nAs each journal, kept by the early fur-traders, is discovered, we find mention made of forts and trading posts not referred to elsewhere. While a list of some of these old establishments has been published by the society, many additions have been made to our store of knowledge during the past two years, and it is important that the latter information should be placed in print.\n\nSpeaking in a general way, with the exception of some papers in the French archives, Mackenzie's voyage to the Frozen Sea and the unpublished journal of John McDonald, now in my own keeping, we are without information as to the history of the Northwest from 1736 to 1800. Every effort should be made to obtain possession of the journals of Sir A. McKenzie and Col. A. N. McLeod which, it is understood, are still in existence.\n\nThere are certain historic spots in or near this city, such as the old Fort Garry Gateway and the sites of Fort Douglas and of the fight between Governor Semple of the Hudson's Bay Co. and the Bois-Brulez in 1816, on the main road at Inkster's Creek, which should be secured or marked in some way as pertaining to important epochs in the history of the country. There is reason to believe that a move of this kind would be popular.\n\nTo members who are of a geological turn of mind there is a rich field to explore. Our museum bears evidence of the fact that within a short distance of these rooms there is an abundance of material for the palaeontologist to collect and study. The daily papers frequently contain items of information regarding the revelations made of earth and rock formations in the boring of wells throughout the Province, and with but little labor and inquiry sufficient data can be collected, on this subject, to form the basis of a paper of practical value. Papers on mineralogy dealing with the gold, silver, lead, iron, asbestos and other deposits of the Lake of the Woods and Lake Winnipeg districts; the marble, gypsum, salt and petroleum formations of the region surrounding lakes Manitoba, Winnipegosiss, Dauphin and Swan, and the coal beds of the Souris and Saskatchewan will be timely and welcome as agents for drawing attention to the mineral resources of this vast territory.\n\nMeteorology should prove to us a fruitful subject. The Government's records, as published, do not extend to beyond the year 1871, but there are within reach journals and books which give more or less information covering odd portions of the present century. Important data of the areas affected by early frosts, with the degree of severity experienced in the elevated plateaus and lowlands, the wooded and plain districts, the land adjoining lakes and rivers and on the open prairie, the light and heavy soils, etc., might be collected and turned to practical benefit in the future. The cause of extraordinary high water in our rivers, resulting at times in floods, is to be investigated and placed on record, while the periodical rise and fall of the water in lakes like Manitoba and the Lake of the Woods, if described and the causes explained, would be instructive.\n\nThe action of frost on soils in Manitoba has received some attention from members of this society, but extended observations must be made, during a series of years, to obtain sufficient material to found any trustworthy conclusions upon. The botanical field is almost a virgin one. As the dairy interests of this Province are becoming a prominent feature of the country's sources of wealth, a carefully prepared paper on the native grasses and the vegetable growths injurious to animals, or inimical to the production of high grade dairy produce, is one that would be well received and bring the society's practical usefulness to the notice of the public.\n\nSome of our medical members have probably given attention to the medicinal preparations in use among the Indians, as well as their forms of application. The result of their observations and enquiries in this direction would prove a fitting subject for a paper. That we have Seneca root, collected by Indians and exported from the Province to the United States, of a value yearly of several thousands of dollars, is well known. A list of our trees and shrubs, the ascertained limits of their growth, and details of the wild fruits indigenous to Manitoba, would be of service. We have enthusiastic mushroom hunters as members. Will one of them not give us a paper on the edible fungi of the Province? So little is known of the value of this form of food, in a country producing spontaneously such a large number of varieties, that really good services would be rendered by the publication of an article plainly describing the forms and their usual places of growth. Wheat, barley and oats have been raised in the Red River Valley during the greater part of the present century. Where did the seed come from, and did resowing year after year result in any distinct change of quality or yielding power? It is a well known fact that farmers in this province, living even but a score or two of miles apart, find that an exchange of seed now results in an improved yield and quality. As being a matter of extraordinary consequence to a great grain growing district like ours, this question, in all its bearings, is one well worthy of investigation by the society.\n\nEntomology will offer many inducements to members who take an\ninterest in it—and there is much need of their services being utilized. The grasshopper visitations to this region, while few in number, can be traced, and if full information regarding them is collected and recorded it may be of service. While singularly free so far from the ravages of insect pests, we can scarcely hope to escape them altogether in the future, and all items of interest relating to them should be gathered and kept on file. Largely dependent, as the people of Manitoba are, on the successful growth of grain, anything liable to affect the growing crops should be closely observed and studied.\n\nThe habits and resorts of the wild animals of the Northwest ever forms an instructive and interesting line of study, and it is to be observed that the advance of civilization is surely driving away animals abundant but a few years ago. The grizzly bear figures as a leading feature in the \"prairie tales\" of twenty-five years back. The traders' journals written at posts on the Saskatchewan contain almost daily entries of encounters with these enormous animals, but passengers in the comfortable sleeping cars now glide smoothly along through the depleted hunting grounds without obtaining a sight of one of these monarchs of the prairie. Sixteen years ago, in the country now traversed by the Canadian Pacific Railway west of Medicine Hat, standing on a hill, I saw, as far as the eye could reach, great moving masses of buffalo, and now the only remnant left of these countless tens of thousands, are less than two hundred animals existing in the wooded fastnesses of the Athabasca and Peace Rivers. The curious demarcation in the ranks of the northern rabbits every eight or ten years offers a subject for investigation. The fur returns of the Hudson Bay Company, during a wide range of years, reveals the fact that every ten years the catch of lynx drops off suddenly from hundreds of thousands to one-tenth of that number, and as the lynx depends for food mainly on the rabbit supply, there is evidently some connection between the periodical disappearance of both. The effect produced on the prairie soil by the excavating and deep plowing propensities and power of the badger, gopher and mole, indulged in for a long succession of years, is known to have been considerable, and has been the subject of remark and discussion. With ample opportunities for observation, is it too much to ask a member of our Natural History section to study up this matter and give us the result of his research? None of the society's publications deal with the fishes found in the lakes and rivers of the Northwest. In Lake Winnipeg alone there are said to be 17 varieties, and it appears that there is some confusion in the names locally given to families of the pike and whitefish varieties. A difference of opinion now exists as to whether our lake fisheries are being injured by overfishing, and a very important point to be taken into consideration, in getting at the truth of the situation, is the extent to which fish migrate from one part of the lake to another, and the cause of their appearance and disappearance in certain portions of the lakes in different years. I have no doubt but that very important evidence on these points may be obtained by inquiry.\n\nNorthwest birds have already received attention at the hands of the society, but there is plenty of room for ornithologically inclined students to work in yet.\n\nSo far as I know, reptilian life in this country has not been investigated and reported on. Who will undertake to identify the frog members of the orchestra that make melody during the summer evenings. The well-known \"snake hole\" at Stony Mountain, with notes of the annual autumn gathering of the reptiles, would alone furnish ample material for an interesting paper.\n\nOur museum is sadly lacking in collections of fresh water and land shells. A paper on the varieties found in this Province might enlist the services of a corps of collectors.\n\nWhile the National museum of the United States has a very extensive and valuable collection of birds' eggs, gathered in Manitoba and the Territories by correspondents of the Smithsonian Institute, our museum is without one identified specimen—who of our members will undertake to make a collection for our own museum?\n\nThe moundbuilders' remains in Manitoba have by no means all been examined or studied. There is a circular embankment a few miles north of Gretna that awaits exploration, and on the Assiniboine near Virden several mounds are situated which should receive attention before the plowshare destroys them. Excavations made at Point Douglas and Port Rouge have revealed the remains of animals and charred wood at from six to twelve feet below the surface of the ground, and as time passes other \"finds\" of like nature will undoubtedly occur. Every effort should be made to secure reliable information concerning them, to place on record in our archives for future use.\n\nIt is a matter of speculation with all of us as to where and why were chosen some of the names of counties, parishes, electoral divisions, cities, towns, villages, post offices and physical features in this Province. It is not too late to collect information on the subject which would be authentic and of great historical importance in future years.\n\nI would earnestly press the library committee to extend, as far as possible, our list of exchanges. New societies of similar character to our own are being instituted every week. There are 102 geographical societies scattered over the world, and we exchange with but two of them. Established in a portion of America but\nrecently opened to settlement, Old World societies are always glad to hear from us, and receive our transactions as coming from a new field of observation and work.\n\nThe history of Manitoba is being made from day to day, and every pamphlet, prospectus, report of public speeches issued from the printing press, which relates to this Province, should be secured and properly catalogued for future reference. Our efforts in this direction have not been as great as they might have been. Many old works on the Northwest are yearly becoming more difficult to obtain and increasing in market value. The recommendation to the council, made at the annual meeting, that so far as is possible additions should be made to our special collection of Northwest books, during this year, must be borne in mind.\n\nIn my opinion, in view of the fact that the society receives some slight amount from the Provincial Government, one of the prime objects to be held in view by our members is the securing and distribution of information of a practical character which will be beneficial to the people of the whole Province.\n\nCHARLES N. BELL,\nPresident.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001763.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 3769, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 179, 1], [179, 179, 2], [179, 5438, 3], [5438, 11118, 4], [11118, 16752, 5], [16752, 17883, 6]], "primary_language": ["en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]