[{"id": "d50dcf8f42e8ee577fc9b1e8be40e88eb3a3baf9", "text": "Speech\nof\nMr. Wilfred Laurier\non the\nRiel Question.\nMr. Laurier, who rose midst cheers, said: Since no one on the other side of the House has the courage to continue this debate, I will do so myself. The Minister of Public Works stated that the Government were ready and anxious to discuss this question, and this is an evidence of the courage they pretend to possess. Sir, in all that has been said so far, and that has fallen from the lips of hon. gentlemen opposite, there is one thing in which we can all agree, and one thing only—we can all agree in the tribute which was paid to the volunteers by the Minister of Public Works when he entered into a defence of the Government. The volunteers had a most painful duty to perform, and they performed it in a most creditable manner to themselves and the country. Under the uniform of a soldier there is generally to be found a warm and merciful heart. Moreover, our soldiers are citizens who have an interest in this country; but when they are on duty they know nothing but duty. At the same time it can fairly be presumed that when on duty the heart feels and the mind thinks; and it may be fairly presumed that those who were on duty in the North-West last spring, thought and felt as a great soldier, a great king, King Henry IV of France, thought and felt when engaged in battle for many years of his life in fighting his rebellious subjects. When over his sword inflicted a wound he used these words: \"The King strikes thee, God heal thee.\" It may be presumed that perhaps our soldiers, when fighting the rebellion, were also animated by a similar spirit, and prayed to God that he would heal the wounds which it was their duty to inflict, and that no more blood should be shed than the blood shed by themselves. The Government, however, thought otherwise. The Government thought that the blood shed by the soldiers was not sufficient, but that another life must also be sacrificed. We heard the Minister of Public Works attempting to defend the conduct of the Government, and stating that its action in this matter was a stern necessity which duty to our Queen and duty to our country made inevitable. Mr. Speaker, I have yet to learn—and I have not learned it from anything that has fallen from the lips of gentlemen opposite—that duty to Queen and country may ever prevent the exercise of that prerogative of mercy which is the noblest prerogative of the Crown. The language of the hon. gentleman was not the first language of the same nature. This was not the first occasion when responsible or irresponsible advisors of the Crown attempted to delude the public, and perhaps themselves as well, into the belief that duty to Queen and country required blood, when mercy was a possible alterna-\ntive. When Admiral Byng was sentenced to be shot for no other crime than that of being unfortunate in battle, there were men at the time, who said to the King that the interests of the country required that the sentence should be carried out, though the court which had convicted him, strongly recommended him to mercy. Those evil counsels prevailed, and the sentence was carried out; but the verdict of history, the verdict of posterity—posterity to which hon. gentlemen now appeal—has declared long ago that the carrying out of the sentence against Admiral Byng was a judicial murder. And I venture to predict, Mr. Speaker, that the verdict of history will be the same in this instance.\n\nIn every instance in which a Government has carried out the extreme penalty of the law, when mercy was suggested instead, the verdict of history has been the same. Sir, in the Province to which I belong, and especially amongst the race to which I belong, the execution of Louis Riel has been universally condemned as being the sacrifice of a life, not to inexorable justice, but to bitter passion and revenge. And now, Sir, before going any further, it is fitting that, perhaps, I should address myself at once to the state of things which has sprung up in Quebec from the universal\n\nCondemnation of the Government,\n\nnot only by their foes, but by their friends as well. The movement which has followed the execution of Riel has been strangely misconceived, or I should say, has been wilfully misrepresented. The Tory press of Ontario at once turned bitterly and savagely upon their French allies of twenty-five years and more. They assailed them, not only in their action but in their motives. They charged them with being animated, not with any honest conviction of opinion, but with being animated with nothing less than race prejudices; they not only charged their former friends, but the whole French race as well, that the only motive which led them to take the course they did in the matter of Riel, was simply because Riel was of French origin. They charged against the whole race that they would step between a criminal and justice, the moment the criminal was one of their own race. They charged against the whole French race that they would prevent the execution of the law the moment the law threatened one of their own. Mr. Speaker, on this matter I am not desirous of following the example which has been set before us by hon. gentlemen opposite of citing copious newspaper extracts, although I could cite extracts of the most bitter nature that ever was penned, of the Mail newspaper and other Tory organs against French Canadians. I will not import into this debate any more acrimony than can be avoided, but I will simply quote a single paragraph from the Mail—and one of the most moderate—which will show the general spirit of the attacks made upon us. On the 7th of December last, the Mail wrote as follows, speaking of the French Canadians:\n\n\"Their leaders are paying us back at the present time by asserting that they should have the right of suspending the operation of law against treason whenever they choose to demand its suspension in the interests of a traitor of French origin, even though he may have been twice guilty.\"\n\nSir, I denounce this as a vile calumny. I denounce this as false. I claim this for my fellow-countrymen of French origin that there is not to be found anywhere, under heaven a more docile, quiet and law-abiding people. I claim this for my fellow-countrymen of French origin—and I appeal to the testimony of any of those who know them and have lived amongst them—that whatever their faults may be, it is not one of their faults to shield, conceal and abet crime. It is true that upon the present occasion the French Canadians have shown an unbounded sympathy for the unfortunate man who lost his life upon the scaffold on the 16th November last. But if they came to that conclusion, it was not because they were influenced by race preferences or race prejudice, if you choose to call them such. They were no more influenced in their opinion by\nrace prejudice, than were the foreign papers which\n\nDepreciated the Execution\n\nof Riel. It is a fact that the foreign press, the American press, the English press, the French press, almost without any exception, have taken the ground that the execution of Riel was unjustified, unwarranted, and against the spirit of the age. Certainly, it cannot be charged against that press that they were influenced by race feelings or prejudices, if you choose to call them such. And in the same manner, I say, the French Canadians, in the attitude which they took, were not impelled by race prejudices, but by reasons fairly deducible and deduced from the facts of the case. But if it had been stated that race prejudices, that blood relations had added keenness and feeling to a conviction formed by the mind, that would have been perfectly true. I will not admit that blood relations can so far cloud my judgment as to make me mistake wrong for right, but I cheerfully admit and I will plead guilty to that weakness, if weakness it be, that if an injustice be committed against a fellow-being, the blow will fall deeper into my heart if it should fall upon one of my kith and kin. I will not admit anything more than that. That race prejudices can so far cloud my judgment as to make me mistake wrong from right, I do not believe to be true. Before I go further, I desire to say this: It has been stated, time and again, by the Mail newspaper and by other Tory organs, that it was the present intention of the French Canadian leaders to organise a purely French Canadian party, to lay aside all party ties and to have no other bonds of party in this House but that tie of race. I protest against any such assertion. Such an assertion is unfounded, it is calculated to do harm, it is not founded on truth. It would be simply suicidal to French Canadians to form a party by themselves. Why, so soon as French Canadians, who are in the minority in this House and in the country, were to organise as a political party, they would compel the majority to organise as a political party, and the result must be disastrous to themselves. We have only one way of organising parties. This country must be governed and can be governed simply on questions of policy and administration, and French Canadians who have had any part in this movement have never had any other intention but to organise upon those party distinctions and upon no other. In order to lay this question at rest, I cannot do better than to quote the language of the hon. member for Hochelaga (Mr. Desjardins) at a meeting that took place recently at Longueuil. That meeting took place in January, I believe. Mr. Benoit, the hon. member for the county, had been invited, but had not put in an appearance, and the fact had been commented on, by some speakers who had addressed the meeting. Mr. Desjardins spoke as follows:\n\n\"Mr. Benoit has perhaps done well to hesitate, because I have myself hesitated, seeing at the head of the invitation I received, 'Parti National.' If it be understood by 'Parti National' that it is a party other than those already existing, I am not of that party; but if it be understood that Liberals and Conservatives shall unite in the same idea and present a united front when their national interests may be imperilled, I am of that party. In our movements we have not desired that a criminal should escape death because he was a French Canadian, but because as regards Jackson and Riel, if the first had his life saved, the second should have had it also. We do not want any more privileges, we are strong enough, but what we want is justice for all.\"\n\nA Single Life Valuable.\n\nIt has been said by sober-minded people that the execution, even if unjust, of the man who was executed and who is believed to have been insane by those who sympathise with him, does not make this a case for the outburst of feeling which has taken place in Quebec on the occasion of Riel's execution. I differ from that view. In our age, in our civilisation, every single human life is valuable, and is entitled to protection in the councils of the nation. Not many years ago England sent an expedition and spent millions of her treasure and some of her best blood simply to\nrescue prisoners whose lives were in the hands of the King of Abyssinia. In the same manner I say that the life of a single subject of Her Majesty here is valuable, and is not to be treated with levity. If there are members in the House who believe that the execution of Riel was not warranted, that under the circumstances of the case it was not judicious, that it was unjust, I say they have a right to arraign the Government for it before this country, and if they arraign the Government for it and the Government have to take their trial upon it, it must be admitted as a consequence that certain parties will feel upon the question more warmly than others.\n\nIt is not to be supposed that the same causes which influenced public opinion in Lower Canada acted in the same manner with all classes of the community; that the causes which actuated the community at large were identical in all classes of the community. Some there were who believed that the Government had not meted out the same measure of justice to all those that were accused and who took part in the rebellion. Others believed that the state of mind of Riel was such that it was a judicial murder to execute him; but the great mass of the people believed that mercy should have been extended to all the prisoners, Riel included, because the rebellion was the result of the policy followed by the Government against the half-breeds. That was the chief reason which actuated them, and it seems to me that it is too late in the day now to seriously attempt to deny that the rebellion was directly the result of the conduct of the Government towards the half-breeds. It is too late in the day to dispute that fact. Yet we have heard it disputed in this House. By whom? By the last man who, I should have expected would have disputed it—by the hon. member for Provencher (Mr. Royal). He gave us the other day his version of\n\nThe origin of the trouble.\n\nEverybody is responsible for the rebellion except one body. The Globe is responsible for it; the Farmer's Union is responsible for it; the white settlers are responsible for it. Everybody you can conceive of is responsible for it, except the Government. The Government is perfectly innocent of it, as innocent as a new-born child! Such was the statement made by the hon. member the other day. But if the hon. member is now in earnest as to that matter, how is it that the half-breeds alone have been prosecuted? If the Globe is the cause of that rebellion, the Globe should have been the first to be indicted. If the white settlers were the instigators, the white settlers should have been indicted also. There is more than that. The counsel for the Crown received authority and even instructions specially to proceed against the instigators of the rebellion, the white settlers, who certainly would have been more guilty than the half-breeds whom they had instigated to rebellion. Here is part of the instructions given by the late Minister of Justice to the counsel for the Crown:\n\n\"It must be, and from the information which the Government have, it seems probable.\"\n\nIt seems the Government share the opinion of the hon. member for Provencher, and they profess to act accordingly.\n\n\"It must be, and from the information which the Government have, it seems probable that the rebellion has been encouraged actively by whites, particularly in Prince Albert. Nothing in the whole duty entrusted to you is, I apprehend, more important than that we should, if possible find out some of the men who, with far better knowledge than the half-breeds, stirred them up to rebellion, and your special attention is asked to this point.\"\n\nThe hon. member for Provencher (Mr. Royal) does not seem to have given any help to the counsel for the Crown, notwithstanding the knowledge which enables him to say on the floor of Parliament, with the responsibility attaching to his utterances, that the white settlers are responsible for the rebellion. If they are, how comes it that no white settler has yet been indicted—that every white settler is at large? What are we to infer from this? Are we to infer that the Government has receded from the position which was here taken by Sir Alexander\nCampbell? Or are we to infer that the statement of the hon. member for Provencher is only one of those wild assertions made as a last expedient in the defense of acts otherwise indefensible? The hon. gentlemen went further. He not only charged the white settlers, the Farmer's Union, and the Globe newspaper, but he also held responsible the Mackenzie Administration. He said that the Administration of that Government, from the time that they took office to the time they left, had been a perfect blank. Well, Mr. Speaker, it is a charge which cannot be made against the present Administration. Their Administration was not at all one blank. Blood, blood, blood, prisons, scaffold, widows, orphans, destitution, ruin—these are what fill the blank in the Administration of this Government of the affairs of the North-West. Mr. Speaker, there might be something to say, as the hon. gentleman will appreciate, upon the Administration of the hon. member for East York (Mr. MacKenzie) of the affairs of the North-West Territories, but the present would not be a seasonable time, and the occasion may arise hereafter. Let me however tell this to the hon. gentleman: If the Administration of Mr. Mackenzie was blameable for its treatment of the affairs of the North-West, if they were remiss in their duties, how much more blameable must be\n\nThe present Administration, which have not yet done that which should have been done by their predecessors! But I forget; the hon. gentleman has nothing, or, at least, very little, to say against the present Government. It may be possibly that they have not been altogether diligent in the duties they had to perform, but still they have shown a great deal of good will—at least, so says the hon. gentleman. Here is what he says:\n\n\"In 1880 Sir John Macdonald took the first opportunity he had, in order to bring in a Bill in this House—he himself, the leader of the Conservative party, introduced a Bill in Parliament to extend the same privileges and rights to the half-breeds in the territories as those enjoyed under the Manitoba Act by the half-breeds in the Province of Manitoba.\"\n\nThis statement is correct, except with regard to the date which should have been 1879 instead of 1880. Sir John Macdonald, as he says, introduced a Bill to extend to the half-breeds of the North-West Territories, the same privileges as had been granted to those of Manitoba. That was done in 1879, and the Act which I hold in my hand reads as follows:\n\n\"That the following powers are hereby delegated to the Governor in Council to satisfy any claims existing in connection with the extinguishment of the Indian titles preferred by the half-breeds resident in the North-West Territories, outside the limits of Manitoba previous to the 14th day of July, 1870, by granting land to such persons to such extent and on such terms and conditions as may from time to time be deemed expedient.\"\n\nThe provisions of this statute were repeated in the Act of 1883. But before we proceed farther, it may be important to at once define what were those privileges and rights which were extended to the half-breeds of Manitoba. By the Act of 1870 it was decreed as follows:\n\n\"And whereas it is expedient towards the extinguishment of the Indian title to the lands in the Province to appropriate a portion of such ungranted lands to the extent of 1,400,000 acres thereof for the benefit of the families of the half-breed residents, it is hereby enacted that under regulations to be from time to time made by the Governor General in Council, the Lieutenant Governor shall select such lots or tracts in such parts of the Province as he may deem expedient, to the extent aforesaid, and divide the same among the children of heads of families residing in the Province at the time of the said transfer to Canada.\"\n\nAnd by a further Act, the Act of 1874, the same privileges were extended, not only to heads of families but to minors, the children of half-breeds, as defined in section 32 of that Act. These Acts, as they were administered, assigned, first, to each head of a family the plot of land of which he happened to be in possession at the time of the transfer, to the extent of 160 acres; and, besides that,\nThe Half-breeds were also granted,\n\nfor the extinguishment of the Indian title, 160 acres of land or scrip for 160 acres of land; and each minor, 240 acres or scrip for that quantity. In 1879 the First Minister took power to extend the same privileges to the half-breeds of the North West. It will be seen that the half-breeds of Manitoba were treated as a special class. They were not treated as Indians; they were not treated as whites, but as participating in the rights of both the whites and the Indians. If they had been treated as Indians, they would have been sent to their reserves; if they had been treated as whites, they would have been granted homesteads; but as I have said, they were treated as a special class, participating in both rights of whites and Indians; as whites they were given a homestead of 160 acres on the plot of land of which they happened to be in possession; as Indians, they were given scrip for lands to the extent of 160 acres for each head of family, and 240 acres for minors. In 1879, as I have said, the Government passed a statute similar to the statute of Manitoba. Did they act upon it? When did they act upon it? When was the first thing done by the Government of Canada to put in force the Act of 1879? The first thing ever done by the Government of Canada to put in force the Act they themselves had passed, was on the 28th January, 1885. Six long years elapsed before they attempted to do that justice to the half-breeds, which they had taken power from Parliament to do, at the time. During all that time the Government was perfectly immovable. The hon. member for Provencher (Mr. Royal) told us the Government had done their duty by the half-breeds. Sir, if the Government had done their duty by the half-breeds, how is it that the half-breeds so often petitioned the Government to grant them their rights? How is it that they so often deluged the Department with petitions and deputations? How is it that they so often appealed to the hon. member for Provencher himself? How is it, for instance, that on the 19th of November, 1883, Maxime Lepine, now a prisoner in the Manitoba penitentiary, Baptiste Boucher, wounded in battle, Charles Lavallée, wounded in battle, Indore Dumas, killed in battle, and several others, addressed Mr. Duck, the agent at Prince Albert, asking him to try and induce the Government to grant them their rights, representing at the same time that they had petitioned, and that their petitions had been supported by prominent men, amongst others the Hon. Mr. Royal, the member for Provencher, and all without avail? How is it that these men, in order to obtain\n\nThe rights which were denied them,\n\nhave gone through such an ordeal as they have, if the Government did justice by them? An agitation was going on all the time in the North-West, and the Government were perfectly immovable. The hon. member for Bellechasse (Mr. Amyot) stated the other day that the Government during all those years were slumbering and snoring. I believe the expression was none too strong, because we have evidence of its truth in the Government's own blue book. Would you believe it, Mr. Speaker, we have evidence that the Department had forgotten the law which they themselves had placed on the Statute book; we have evidence that the Government actually forgot that the half-breeds were entitled to special privileges. The thing is almost incredible; yet here is the evidence of it. There was a meeting held at Prince Albert of the settlers of the locality, to take into consideration their own grievances and the grievances of the half-breeds as well; amongst the resolutions carried was the following, the third one:\n\n3rd.—\"Moved by Mr. Miller, seconded by Mr. Spencer, and carried unanimously:—Whereas the Indian title in this district or territory has not become extinct, and the old settlers and half-breed population of Manitoba were granted scrip in commutation of such title, and such allowance has not been made to those resident in this territory—Resolved,\"\nthat the right hon. the Minister of the Interior be requested to grant such scrip to such settlers, thus placing them on an equal footing with their countrymen in Manitoba.\"\n\nThis resolution simply asked that the half-breeds of the North-West should be treated just as\n\nThe Half-breeds of Manitoba were treated—just as the hon. member for Provencher said they should have been treated; and what was the answer of the Department? The answer of the Department will show precisely what I have stated, that the Department at that time in 1881, had forgotten the tenor of the statute they had placed on the Statute book before. Here is the answer addressed to the Hon. Lawrence Clarke, who had transmitted the petition:\n\n\"Department of the Interior, Ottawa,\n22nd Nov., 1881.\n\n\"Sir,—By direction of the Minister of the Interior, I have the honor to acknowledge the receipt of memorial handed in by you, of certain resolutions passed at a meeting of the inhabitants of the district of Lorne (which you represent in the North-West Council), held at Prince Albert on the 18th October, 1881.\n\n\"In reply to the questions involved in the several resolutions contained therein, I am to say as follows:\n\n\"Resolution No. 3. As by treaty with the Indians their title to any portion of the territory included within the district of Lorne has been extinguished, this resolution would need explanation.\"\n\nHere was a resolution calling upon the Government to give effect to a law passed by themselves—to give the half-breeds the special rights to which by law they were entitled, and yet the Government declares that this resolution requires explanation. Well, the explanation came, and it was not long in coming. Mr. Clarke answered as follows:\n\n\"Carlton, N.W.T., 25th January, 1882.\n\n\"Sir,—I have the honor to acknowledge the receipt of your letter of the 22nd November last, embodying the reply of the right hon. the Minister of the Interior to a memorial, handed in by me, of certain resolutions passed at a meeting of the inhabitants of the district of Lorne, held at Prince Albert on the 18th October, 1881.\n\n\"With regard to resolution No. 3, it is remarked that:\n\n\"As by treaty with the Indians, their title to any portion of the territory included within the district of Lorne has been extinguished, this resolution would need explanation.\n\n\"I would respectfully submit that the Indian title no doubt, has been extinguished, but evidently not that of the half-breed residents of the North-West Territories.\n\n\"The Government of the Dominion of Canada, have repeatedly acknowledged the right in the soil of the half-breed inhabitants, as is proved by the Parliament of Canada, in 1870, 33 Vic., chap. 3, section 31, as follows:\n\nThen he recites all the acts by which the Parliament of Canada had declared, time and again, that the half-breeds were entitled to compensation for their Indian title; and goes on:\n\n\"It will be seen, therefore, that from the first enactment, in 1870, to the last, in 1879, the rights in the soil of the half-breeds, have been recognised by the government, and provision made for the extinguishment of their title.\"\n\nThis explanation was certainly clear enough, but the Government at once relapsed into the state of immovability in which they had been living, and the Minister fell again into the state of repose which he had been enjoying, for so many years before.\n\nThe Half-breeds petitioned again they sent their friends upon delegations to Ottawa; they sent the hon. member for Provencher; yet the Government never took any action in the matter until the 28th of January, 1885, when the Minister felt his seat shaken by the first waves of the tempest that was soon to sweep over the country. Too late! Too late! Too late. When the seeds of discontent have long been germinating, when hearts have long been swelling with long accumulating bitternesses, and when humiliations and disappointments have made men discontented and sullen, a small incident will create a conflagration, just as a spark dropped on the prairie, under certain circumstances, will kindle a widespread and unquenchable fire. When the Government moved, but it was too late. The incident occurred—\nwhat was it? The hon. member for Provencher told us what it was. After the Government had announced a commission, a man had the imprudence to say that a commission would not come, but that bullets would come instead; and this statement of the hon. gentleman is corroborated by a statement of Archbishop Taché in a letter published in December last, in which, speaking of the commencement of the rebellion, he said:\n\n\"The assurance that a commission would be sent was not accepted. People preferred to believe a rumor which went to show that instead of granting them their rights, the authorities were to send irons for their leader, and bullets for those who would protect him. That conviction produced the result which was to be expected. The half-breeds thought they would resist and defend themselves. Badly armed, without ammunition or provisions, they took possession of the stores in the vicinity. The unfortunate attack made against them at Duck Lake was a declaration of war.\"\n\nIt will strike many minds now that there is a great analogy between the origin of this rebellion and the origin of the rebellion in Lower Canada in 1837. An agitation had been going on in Lower Canada for many years, as it had been going on in the North-West for many years, and it was when the Government attempted to arrest the leaders of the movement that the rebellion broke out; and without going any further, I am glad to recall the fact that, deplorable as was this rebellion in Lower Canada, it secured at once to the Lower Canadians the rights which they had been vainly seeking for so many years, and it secured this further result: That although the population had been hitherto in favor of rebellion they at once became\n\nThe most faithful subjects England ever had. In the same manner, though the last result has not yet been obtained, it may be and will be obtained, I have no doubt, in the North-West, because the immediate result of the rebellion there has been to secure to the half-breeds the rights which had been denied to them up to that time. I have charged the Government with not only having been negligent in the duty they owed to the half-breeds, but with denying to the half-breeds the rights to which they were entitled. I charge them again with, not ignoring only, but actually refusing, of design aforethought, the rights to which the half-breeds were entitled.\n\nThe first order the Government passed under the statute was that of the 28th January, 1885. What was that order? Its provisions are important to consider, in view of the charge I have just preferred against the Government. The order runs as follows:\n\n\"On a memorandum dated 26th January, 1885, from the Minister of the Interior, submitting that it is desirable, with a view of settling equitably the claims of half-breeds in Manitoba and the North-West Territories, who would have been entitled to land had they resided in Manitoba at the time of the transfer and filed their claims in due course under the Manitoba Act, and also of those who, though residing in Manitoba and equitably entitled to participate in the grant, did not do so, to ascertain the number of such half-breeds, and recommending that he be authorised to obtain an enumeration of them, and to employ three persons to make such enumeration.\"\n\nThe provisions of the order, you see, were first, to cause an enumeration to be made of the half-breeds who were entitled to compensation, in order to settle equitably the claims of those half-breeds. What was to be that equitable settlement? The order is vague upon that point; it is not only vague, it is silent. Was the settlement to be that which was granted to the half-breeds of Manitoba, as was insinuated the other day by the hon. member from Provencher (Mr. Royal)? I say no; I say that the settlement that the Government then contemplated, and which is called equitable, was not the settlement which had been made in favor of the half-breeds of Manitoba. I may here recall what was the latter settlement. The half-breeds of Manitoba were given, first, a free grant of the plots of land which they occupied, to the extent of 160 acres each, as whites; they were given, in the second place, in\n\nExtinction of the Indian title, land to the extent of 160 acres\nfor each head of family, and land or scrip to the extent of 240 acres for every minor. Was this to be the settlement which was to be given by the Government under order of 28th January? I say it was not; and I call to witness upon this point the language spoken by the First Minister himself on the 26th March last, when this matter came before this House. On that occasion he said:\n\n\"As a whole the half-breeds have been told that if they desire to be considered as Indians there are most liberal reserves that they could go with the others; but that if they desired to be considered white men they would get 160 acres of land as homesteads. But they are not satisfied with that; they want to get land scrip of equal quantity—I think upwards of 200 acres—and then get, as a matter of course, their homesteads as well.\"\n\nYou see, therefore, that the Government, on the 26th March, 1885, was not disposed to treat the half-breeds of the North-West Territories as they had treated the half-breeds of Manitoba. If they had been disposed to do so, the First Minister would have said: We will give them, as we have given the half-breeds of Manitoba, the plots of land on which they reside, as free grants of 160 acres each, this to be their rights as homesteaders; and as Indians we will give them, in extinguishment of their rights to the Indian title, land scrip to the extent of 160 acres for each head of family and 240 acres to each minor. No; the language of the First Minister shows that he was opposed to their being treated in this way. He said: \"If they wanted to be treated as Indians, they could go on the reserves; but if they wanted to be treated as whites, they could have a homestead like other whites.\" Therefore\n\nI charge the Government with this, that when they passed the order of 28th January, 1885, it was not their intention to afford the same justice to the half-breeds of the North-West Territories that had been afforded to those of Manitoba. The intentions then expressed in the language I have just quoted from the First Minister were carried out four days later, on the 30th March, when another Order in Council was passed, and how did that Order in Council read? It read as follows:\n\n\"The Minister of the Interior is of the opinion that it is expedient that those claims should be satisfied by granting: First, to each half-breed head of a family resident in the North-West Territories, outside of the limits of Manitoba previous to the 15th July, 1870, the lot or portion of land of which he is at present in bona fide and undisputed occupation by virtue of residence upon, and cultivation thereof, to the extent of 160 acres, and if the lot or portion of land for which he is in bona fide occupation as aforesaid, should be less than 160 acres, the difference to be made up to him by an issue of scrip, redeemable in land, at the rate of one dollar per acre, and in case of each half-breed head of a family residing in the North-West Territories previous to the 15th day of July, 1870, who is not at present in bona fide occupation of any land, scrip be issued, redeemable in land, to the extent of $160.\"\n\nThe same provision is thereafter made for the minors. Let us examine this Order in Council. What does it provide for? It provides simply this, that the half-breed shall get a grant of 160 acres as settler or homesteader, but that nothing shall be given him in extinguishment of his Indian title. If the half-breed is in possession of a plot of 160 acres, he is to receive a free grant of it—nothing more; if his lot is not 160 acres, he is receive the difference—nothing more; so that it is manifest at that date, under this Order in Council, it was not the intention of the Government to give to the half-breeds of the North-West Territories the same rights that had been given to the half-breeds of Manitoba. The commission being issued under this order, it was not possible for the commissioners to do otherwise than to carry out the provisions contained in the order. They had no authority to go to any greater length than they were authorised by that order.\n\nThe commission was issued to Mr. Street, Mr. Goulet and Mr. Forget, and as soon as they came to the North-West, as soon as they came to\ninvestigate the matters involved; they shall know that this proposed settlement would be no settlement at all; that the half-breeds would be still dissatisfied; and, upon the 4th April, Mr. Street telegraphed to Mr. Macpherson, the Minister of the Interior, as follows:\n\n\"If desired by half-breeds, would it not be advisable to grant scrip, one sixty or two forty dollars, permitting them to acquire title to lands in occupation through possession? Otherwise, Government really gives nothing for Indian title. Do you wish me to give notice that commission will take evidence of claims other than those of half-breeds? Please concur in first suggestion.\"\n\nHere is the telegram in which the commissioner at once points out that, if he carries out the Order in Council, the Government gives nothing to the half-breeds for the extinguishment of the Indian title. Then the next day, a letter followed up the telegram from Mr. Street, and it is still more significant:\n\n\"My Dear Sir, Driscoll.—We arrived here early this morning, and I met my fellow-commissioners at the Dominion Lands Office at 10 o'clock. They introduced the subject as to which I telegraphed you yesterday, and spoke very strongly as to its being one which was likely to be a serious stumbling-block in our dealings with the half-breeds. Last you should not fully have understood my telegraph if you had not seen the point. Suppose we find that half-breeds have been upon, and since, 16th July 1870, in occupation of a parcel of say, 160 acres, under circumstances which, if he were a white settler, would entitle him to a grant of the land under the homestead clauses under the Dominion Lands Act; under the authority we now possess we could, if he were the head of a family, allow him nothing more than the 160 acres; we could allow him nothing for his claim as a half-breed, and, inasmuch as the Government haven't been purposing to deal with the half-breeds if they had some general rights beyond those of ordinary incoming settlers, my fellow-commissioners say that great dissatisfaction and disappointment will be created if we refuse to occupy half-breeds only that which any ordinary settler claims and nothing for the extinguishment of his Indian title. Mr. Pease discussed the matter very fully with us and concurred in the advisability of our obtaining, if possible, the power to enable us to allow the half-breed to claim the land occupied by him under the homestead provisions, and in addition to give him his scrip for the $160 or $240, as the case may be, for his Indian title.\"\n\nThere was the policy which was suggested by Mr. Street as soon as he had commenced to investigate this matter, and what was the answer? The very following day there was this telegram which should have been sent six or seven years before at least:\n\n\"W.P.R. Street, Q.C., Chairman Half-breed Commission, Winnipeg.\n\n\"No objection to your suggestion to give scrip, and allow occupiers to acquire title through possession when desired by them.\"\n\nAt last justice had been given to these people. For seven long years they had petitioned, and petitioned in vain. On the 26th March, the Prime Minister in his place in this House gave it as his policy that these men were not entitled to any special privileges; that they had no such rights as were given to their compatriots in Manitoba, that they were to be treated \"not as half-breeds, not as a special class,\" but either as Indians or whites. At last justice was coming to them. At last they had been petitioning for so many years was coming to them, and what was the cause? In ten days from the 26th of March to the 6th of April, the Government had altered their policy and had given what they had refused for years! What was the cause? The bullets of Diefenbaker; the rebellion in the North-West. The Government had been refusing for years, and at last these men took their lives and liberties in their hands; and at last the Government came down and gave them what they were entitled to. I appeal now to any friend of liberty in this House; I appeal not only to the Liberals who sit beside me, but to any man who has a British heart in his breast, and I ask, when subjects of Her Majesty have been petitioning for years for their rights, and those rights have not only ignored, but have been denied, and when these men take their lives in their hands and rebel with anyone in this House against these men, when they got their rights\nIf criminals there were,\nin this rebellion, are not those who fought and bled and died, but the men who sat on those Treasury benches? Sir, rebellion is always an evil; it is always an offense against the positive law of a nation; it is not always a moral crime. The Minister of Militia, in the week that preceded the execution of Riel, stated his sentiments of rebellion in these words: \"I hate all rebels; I have no sympathy, good, bad, or indifferent, with rebellion.\" Sir, what is hateful—I use the word which the hon. gentleman made use of—what is hateful is not rebellion, but is the despotism which induces rebellion; what is hateful are not rebels, but the men who, having the enjoyment of power, do not discharge the duties of power; the men who, having the power to redress wrongs, refuse to listen to the petitions that are sent to them; the men who, when they are asked for a loaf, give a stone. The hon. gentleman hates all rebels, he says. I wonder if he will extend his hatred to the great rebel whose proud statue stands against my arm's length. I venture to say that if that man whose statue has been erected here by the Canadian Government had been living today, and had occupied his place on the Treasury benches, he would have remembered that he was once a rebel. I have seen the day when the Minister of Militia had not for rebellion the horror he now professes. I have seen the day when the Minister of Militia had great sympathy in his heart for rebellion, when he had deep sympathy in his heart for the very rebel whom he had in his mind, and whose death knell he was in advance ringing, when he was proclaiming his hatred of rebellion at Winnipeg. Riel was once before a rebel; he was indicted before, not for rebellion, but for murder connected with rebellion.\n\nThe hon. gentlemen who vote for such a hateful and rabid speech on that occasion. Resolutions often introduced into this House on certain occasions to extend an amnesty.\n\nExtend an Amnesty\n\nfor all offenses connected with the rebellion and to all offenders, Riot Act and a few others excepted, and granting an amnesty even to them, but with certain restrictions. The hon. gentleman spoke on that occasion. Did he then proclaim, as he now does, his hatred of rebellion? Did he speak the language which he spoke lately in Winnipeg? Did he say he hated all rebels? I have a hatred of all rebels; I have no sympathy, good, bad, or indifferent with rebellion.\" No; but this is what he said:\n\nMr. Caron said that he will vote against the resolution because it does not afford a complete solution of the North-West difficulty. Having voted against the expulsion of Riel from this House, he cannot vote for the punishment from the country. A complete amnesty is the only practical solution, and he is sure that the same difficulties will recur next year.\"\n\nMr. Speaker, that was the sentiment of the hon. gentleman at that time. Well, if on that occasion Riel was entitled to a full amnesty, was he not entitled, at least, to a commutation of sentence on this occasion, when this last rebellion had not been darkened by such acts as darkened the pages of the first rebellion? The hon. gentlemen in those days stated again and again that the first rebellion was justified. If the first rebellion was justified, was not the second rebellion equally justified? Would there be the half-breeds today if it had not been for this rebellion? Would they have obtained the rights which they now enjoy? I say, Sir, the Canadian Government stands convicted of having yielded only to rebellion, and not to give just representation to the half-breeds, and of having actually forced them into insurrection. Mr. Speaker, such were my sentiments, and I spoke them aloud. I appeal upon this occasion as I did elsewhere, to every friend of liberty to\nall those who, during this twenty-five years past, have felt their hearts thrill whenever a struggle for freedom was going on in any corner of the world; with the Italians, when they delivered their country from the yoke of Austria; with the Americans, in their stupendous struggle for national unity and for the suppression of African slavery; with the Mexicans, in their successful attempt to resist the foreign domination which the French Emperor sought to impose on them; with the French themselves in their generous though often misguided efforts to establish amongst themselves the bulwark of freedom, parliamentary and responsible government; with the Danubian populations, when they attempted to rid themselves from the degrading domination of the Turks; and when at last—at last—a section of our own countrymen rose in arms to claim rights long denied them, rights which were immediately acknowledged to be just, as soon as they were asked with bullets, are we to have no sympathy with them? Though, Mr. Speaker, these men were in the wrong; though the rebellion had to be put down; though it was the duty of the Canadian Government to assert its authority and vindicate the law, still, I ask any friend of liberty, if there is not a feeling rising in his heart, stronger than all reasoning to the contrary, that these men were excusable? Such were, Mr. Speaker, my sentiments. I spoke them elsewhere. I have had, since that time, occasion to realise that I have greatly shocked Tory editors and Tory members. Sir,\n\nI know what Tory loyalty is. Tories have always been famous for preaching loyalty to others. Tories have always been famous for being loyal, as long as it was profitable to be so. Under the reign of James, the Tories were gushing in their loyalty as long as the tyranny of the king fell upon Whigs and Dissenters; but when at last the tyranny of James fell upon the Tories themselves and the Church of their heart, their slavish notions received a most salutary shock. They took side with the Whigs, and horror of horrors, they shouldered the musket, joined the Prince of Orange and put him on the throne; and I believe that to this day the Tories will say that it was a happy day for England when that rebellion took place. If we pass from England to this country we have the same tale to tell. In 1849 the Tories were gushing in their loyalty as long as they expected the Governor General to be disloyal to the people, but when they found the Governor General was loyal to the people, their own loyalty oozed out of their bodies and vanished into thin air. They did not shoulder the musket—that would have been too noble a weapon—but with eggs and stones they pelted the representative of Her Majesty. They did not shoulder the musket, but with pen and ink they wrote and signed annexation manifestoes. And, Mr. Speaker, if we continue the story, even down to the days since this Government has been in power, we find that when they introduced the National Policy, and when it was objected that that policy was unfair and ungenerous to England, and that it might possibly endanger British connection, the cool Tory answer was: \"So much the worse for British connection.\" Sir, this is Tory loyalty. Ready they are to-day to sacrifice British connection, if British connection stands between them and their selfishness; ready they are to-day to sacrifice British connection if it stands between them and their enjoyment of power; ready they are to sacrifice British connection for mere sordid greed, but they affect, forsooth, to be shocked when we profess sympathy for men who, in the west, have been vindicating their rights long denied. Sir, I will not receive any lectures on loyalty from men with such a record. I am a British subject, and I value the proud title as much as anyone in this House. But if it be expected of me that I shall allow fellow-countrymen unfriended, undefended, unprotected and unrepresented in this House, to be trampled under foot by this Government, I say that is not what I understand by loyalty, and I would call that slavery.\nI am a British subject, but my loyalty is not of the lips. If hon. gentlemen opposite will read history, they will find that my ancestors, in all their struggles against the British Crown in the past, never sought anything else than\n\nTo be treated as British Subjects,\n\nand as soon as they were treated as British subjects, though they had not forgotten the land of their ancestors, they became amongst the most loyal subjects that England ever had. Sir, since our loyalty has been impugned by hon. gentlemen opposite, I am inclined to quote the sentiments of my race and of my party, as they were expressed by my hon. friend from Megantic (Mr. Langelier) on an occasion which was not political. Last summer certain delegates from boards of trade in France visited Canada. They were entertained by the Corporation of Quebec which presented them an address, and the hon. member for Megantic, in his quality of mayor, spoke as follows:\n\n\"The fate of arms has decreed that our political destinies should be united with the destinies of England, and when we consider all the advantages which we have reaped from that state of things, our regret at being separated from France is not without compensation. When we can establish with France extended commercial relations, nothing more shall we want. We preserve a political regime of which we are proud, and we obtain at the same time the satisfaction of preserving our interests and sentiments.\"\n\nThis is the loyalty of the French Canadians today. They are true to their ancestors. And who should object? We speak the French language, and if you look at it from a purely utilitarian point of view it is a great disadvantage, because we have afterwards to learn a foreign language to take our part in the national movement of this country. Everyone must learn to speak it the best he can in his own poor way. It would perhaps be best, from a utilitarian point of view, to have only one language; but the French is the language of our mothers, the language which recalls to our minds the most sacred associations which first dawn on the heart of man and which can never die out, and so long as there are French mothers the language will not die. Yet these sentiments are quite consistent with our loyalty to England, and loyal we are to England; and if I were called to illustrate it, I could not do so better than by quoting the remark of a French Canadian lady to Mr. De Belvèze, who, in 1855, visited Canada by order of Napoleon III.: \"Our hearts are with France, but our arms are to England.\" But loyalty must be reciprocal. It is not enough for the subject to be loyal to the Crown; the Crown must also be loyal to the subject. So far as England is concerned she has done her duty nobly, generously; but this Government has not done its duty towards the half-breeds. The Government are shocked, and their friends profess to be shocked, because those men claim their rights and demanded them with bullets. Have the Government been loyal to those half-breeds? If they had been loyal to the half-breeds no such trouble would have occurred. If the Government do not respect the law themselves, and if afterwards men, to vindicate their rights, take weapons in their hands and brave the laws, I say the Government are bound to search their consciences and see if they have given occasion for rebellion, and if they have, to give the benefit to the guilty ones. This is what we, in Lower Canada, have been claiming, and this is one of the reasons why we have felt so warmly on this question. Such is not, however, the doctrine of the Government.\n\nThe Doctrine of the Government is not put in that way in the memorandum which was issued some time after the execution of Louis Riel. Shortly after that execution the Government thought it proper, and I do not blame them for it, to put their defence before the country. They did it in a very able paper signed by the late Minister of Justice, Sir Alexander Campbell. In the very first words he speaks as follows:\n\n\"The opponents of the Government have asserted that the rebellion was provoked, if not justified, by their mal-administration of...\"\nthe affairs of the North-West Territories and inattention to the just claims of the half-breeds. With this question, which has been made one of party politics, it is not thought becoming to deal here. Upon such a charge, when made in a constitutional manner, the Government will be responsible to the representatives of the people, and before them they will be prepared to meet and disprove it.\n\nThat the Government should be compelled to submit their reasons for having so acted, goes as a matter of course. They were to give their reasons—they were responsible to the people. This is a matter of course. But this is not what is contended here. The contention laid down is that when the people of Canada are to examine the action of the Government in executing Riel, the question whether or not the rebellion was provoked, is not to be taken into consideration. Was there ever a more unconstitutional, more intolerable doctrine propounded? I say it is contrary to the true doctrine; for if there is any occasion when the Government is bound to search into the matter to see if provocation has been given for the commission of an offence, which has involved the death penalty, it is when the offence charged is purely a political one. It is always, with regret I am sure, that the Minister of Justice finds himself unable to report in favor of the commutation of a death sentence. Whenever in this country a sentence of death is passed upon any of our fellow beings, it is the duty of the Minister of Justice to inquire into the causes of the crime in order to see if the requirements of the law would not be equally met if the death sentence were not carried out. Nothing is left behind that can lead to that desired end. And yet we are told here that when a man is charged with a political crime, the Government are not to consider whether there was provocation or not by the Crown? With the Government all rebellions are alike, whether provoked or not, and they have all to be treated in the same way. You are to look at all rebellions as utterly bad. You have to look upon the rebellion of Junius Brutus and the attempted rebellion of Cataline as equally bad. I say, on the contrary, that this is one of the grounds on which I arraign the Government. It was their duty when they came to consider, whether or not the death sentence should be carried out on Riel, to consider whether he had received provocation for the deed which brought him into that situation; and having failed to do so, the Government, on their own confession, stand guilty of having failed in a duty, which is one of the most sacred that ever can fall upon man. The doctrine of the Government is so untenable that they could not adhere to it to the last. Even before Sir Alexander Campbell had reached the end of his factum, he abandoned his theory, for in the very bottom lines, he says:\n\n\"Whether rebellion alone should be punished with death is a question upon which opinions may differ. Treason will probably ever remain what it always has been among civilised nations, the highest of all crimes; but such conviction for that offence must be treated and disposed of by the Executive Government upon its own merits, and with a full consideration of all the attendant circumstances. In this particular instance, it was a second offence, and, as on the first occasion.\"\n\nThe ex-Minister of Justice commenced by saying that we should not look into the causes which had induced the rebellion; he had conveniently left aside looking into the causes, but he no less conveniently looked into the fact that this was a second offence. So it was, and for the second time the Government was guilty of that rebellion; for the second time Riel was a rebel, and was a rebel on account of the conduct of the present Government. Sir, I am not of those who look upon Louis Riel as a hero. Nature had endowed him with many brilliant qualities, but nature had denied him that supreme quality without which, all other qualities, however brilliant, are of no avail. Nature had denied him a well-balanced mind. At his worst he was\n\nA subject fit for an asylum, at his best he was religious and political\nBut he was not a bad man—\nI do not believe at least that he was\nthe bad man that he has been represented\nto be in certain press. It is true that\nat the trial a most damaging fact was\nbrought against him; it is true that he\nhad offered to accept a bribe from the\nGovernment. But justice to his memory\nrequires that all the circumstances connected\nwith the fact, should be laid\nbefore the House. If he accepted\nthis money, it is evident that in\nhis own confused mind it was not with a\nview of betraying the cause of his fellow\ncountrymen—\n\nSome hon. MEMBERS. Yes, yes.\n\nMr. LAURIER. Why, Mr. Speaker,\nI do not expect that the members who\nnow interrupt me, would deal in the\nsame manner, but, Sir, I give them the\ncredit of having better balanced minds\nthan Louis Riel. In his own dazed\nmind it is evident that if he accepted the\nmoney, it was not with a view of betraying\nhis fellow countrymen—it was with\nthe view of working for them in another\nway—since he said he would start a paper\nin the United States and raise up the\nother nationalities.\n\nAn hon. MEMBER. Another re-\nbellion.\n\nMr. LAURIER. I grant that if\nthat reasoning had been made by a man\nin his senses, such as an hon. gentleman\non the other side, it would be enough to\nstifle any sympathy we could have for\nhim; but we must make due allowances\nfor the fact that it is proved that if he\nwas not actually insane, no man can deny\nthat upon this subject of politics\n\nHis mind was not right or sound;\nand of course in the case of a mind un-\nsound or insane we cannot apply the\nsame tests that we should apply to a\nreasonable mind—it would be unfair to\ndo so. That he was insane, seems to me\nhowever, beyond the possibility of contro-\nversy. When the reports first came here\nlast spring and in the early summer, of his\ndoings and sayings in the North-West,\nwhen we heard that he was to establish\nmonarchies in the North-West, that he\nwas to depose the Pope and establish an\nAmerican Pope, those who did not know\nhim believed he was an impostor, but\nthose who knew him knew at once what\nwas the matter with him. In the Prov-\nince of Quebec there was not an instant's\nhesitation about it. Almost every man\nin that Province knew that he had been\nseveral times confined in asylums, and\ntherefore it was manifest to the people of\nQuebec that he had fallen into one of\nthose misfortunes with which he was\nafflicted. When his counsel were engaged\nand commenced to prepare for his\ntrial, they saw at once that if justice to\nhim and only justice to him was to be\ndone, their plea should be a plea of in-\nsanity.\n\nIt has been said that the Trial\nwas a fair one.\n\nI deny it. I will not go over some of\nthe arguments which have been put for-\nward on this subject, but I ask the special\nattention of the House to this fact: This\nman asked for a month's delay for his\ntrial; he obtained eight days. Was that\njustice? Was that British justice? Was\nthat giving fair play to the accused?\nWhen he swore that justice to his case\ndemanded a delay of one month could\nthere be any public reason that militated\nagainst that demand? Could there be\nany public reason why such a request as\nthat should not have been granted?\nand yet it was refused. Again,\nwhen he asked for witnesses, was\nthe request granted him? No, it\nwas again refused. I again recall the\nattention of the House to the affidavit\nwhich Riel gave, that he wanted several\nwitnesses, amongst others Gabriel Dumont,\nand Michel Dumas and others. I grant\nat once that to bring Gabriel Dumont\nand Michel Dumas to this country, both\nof whom were fugitives from justice, was\nhardly possible; but remember that he\nasked as an alternative a thing which was\nperfectly feasible, and it was denied him.\nHe asked this alternative under oath:\n\n\"That unless the Government of this coun-\ntry or this honorable court do provide the\nmeans with which to secure the attendance\nof the above-named witnesses before this court, it is essential to my defense that the various papers, writings and documents taken from me at the time of my surrender to General Middleton, and taken by him and his officers from my house subsequently, should be placed in the hands of my counsel for their examination and consideration, previous to being put upon my trial.\"\n\nRiel's unfair treatment.\n\nSir, you see the treatment of the accused on that occasion; he asked one of two things. He said either procure me the attendance of certain witnesses, Gabriel Dumont and Michel Dumas and others, or if you cannot or will not do that, give to my counsel the papers taken from me at Batoche. Was there ever a more moderate or reasonable petition presented to a court of justice? When this man simply said: I do not ask those witnesses if you cannot give them to me, but there is one thing you can give to me; you can give me communication of my papers which were taken from me at Batoche. Why were they not given? Reasons of State! Why, these papers have been moved for in this present Session, and the Government granted the motion without any objection. There could not, therefore, be any reason of State. True, they have not been brought down yet, but the reason of State which was invoked at the trial is not brought forward in this House, and why? Because such a reason would never have stood discussion in this public Parliament. Yet with this imperfect trial the jury recommended him to the mercy of the court.\n\nThe Minister of Public Works said the other day that it was nothing unusual for juries to bring in verdicts with recommendation to mercy. No, it is not unusual, but what is very unusual is that the Government should give no heed to this recommendation. That was the unusual thing done on this occasion. After the trial was over the conviction was so deeply seated in the minds of many friends of the Government that ample and full justice had not been done, that they at once petitioned the Government to issue a commission to examine the prisoner, to see\n\nWhether he was sane or insane in mind. This petition was made, as I am informed, by friends of the Government, to the Government, again and again. The Government did not refuse, but treated it simply as the petitions of the half-breeds were treated—put off, put off, until the very week that preceded the execution. And then the commission—was it a commission? I do not know what kind of a thing it was, what kind of instructions were given we do not know. But we do know that upon the 8th November, 1885, just a week before the execution, two medical gentlemen from the east were at Regina and examined the prisoner. Were those gentlemen sent to Regina with the object of advising the Government whether or not the sentence should be commuted? I say emphatically, no. I charge this against the Government again, that when they sent this so-called commission to Regina to examine the state of mind of Louis Riel, it was not with a view of determining the question whether the sentence should be carried out or commuted, but it was to throw dust in the eyes of the public and enable the Government to say afterwards, we have consulted specialists and they have reported in favor of sanity. But, Mr. Speaker, we have it on record that when this commission was sitting in Regina, when on the 6th, the 7th and the 8th of November, Dr. Lavell and Dr. Valade were examining Riel to see whether he was insane or not, at that time the Government had determined to hang Riel; and this fact stands to the shame of the Government, perhaps more than anything else, because at that time they were simply playing a comedy; they were not acting with a view to justice; they were simply attempting to blindfold the people—to deceive the people. Why, Sir, the Order in Council containing the decision of the Government was passed on the 12th of November, but long before that time the Government had come to their conclusion. The hon. Minister of Militia about\nthat time made a trip to the North-West. He arrived at Winnipeg on the 7th or 8th of November, so that he must have left Ottawa about the 3rd or 4th, or the 2nd of November; and before the hon. gentlemen had left Ottawa for Winnipeg, the sentence, if not recorded, had been decided upon by the advisors of His Excellency. We have the\n\nEvidence of the Premier himself as to that. Here is a letter which was sent by the hon. Prime Minister to the hon. Minister of Militia:\n\n\"OTTAWA, 20th November, 1885.\n\n\"My Dear Caron,—You say you are charged with having left Ottawa before the decision of the Governor in Council was arrived at with respect to Louis Riel, and as if for the purpose of avoiding being party to the decision.\n\n\"This is not the case, the Council had come to the conclusion that it was necessary, in the interest of justice, that the sentence should be allowed to be carried into effect, in your presence as a Member of the Council, before you left for Winnipeg.\"\n\nSir, we must give the Minister of Militia his due; he has had a full share in the hanging of Louis Riel; let him have what really appertains to him. Before he left Ottawa, the sentence had been decided between him and his colleagues. Let him have his full share of the merit, if merit there be, or the shame; let him have also his full share of the comedy which was afterwards played before the public. For, I ask it of any man in his senses—I ask it of any man on the Opposition benches; I ask it of any man in this country—was there ever a more\n\nShameful thing enacted by a Government,\n\nthan—after they had decided to execute for the purpose of blinding the public, to send a commission to enquire whether the convict was insane or not? What was the object of enquiring whether he was insane or not, if the Government, at that time, had made up their minds and decided that he should be hanged? The object was to do what has since been done—to say to the people of Canada: We have consulted medical officers, and they have reported, and upon their report we have acted. Sir, it was not upon this report that they acted; this report was a false note, and they did not act upon it, because when they got it their decision had been arrived at; and upon this I arraign the Government of the country, not only as being guilty of a cruel act, but as being guilty of an attempt to deceive the people of this country. Sir, if the Government had been desirous of learning whether Riel was insane or sane, there was no need of sending a commission to examine him. It would have been sufficient to look at his history; it would have been sufficient even to look at this record in the rebellion. We have it now as a fact of history that while Riel was inducing that rebellion, he chose as his chief adviser and secretary, a man notoriously insane, William Joseph Jackson, who signed his letters and Orders in Council. Will it be pretended by any man that if Riel had been in his senses, if he had had a sane and discerning mind, he would have accepted an insane man as his chief adviser? Why did this not strike hon. gentlemen opposite? One of the things which we in Lower Canada have felt as deeply as we have ever felt anything, is that we have believed that the measure of justice which was extended to Louis Riel was not the same measure of justice which was extended to William Joseph Jackson. Jackson was put upon his trial, and I am bound to say this, in duty to the Crown prosecutors, that upon that occasion they did their duty. They acknowledged at once the insanity of the prisoner and directed an acquittal. The trial of Jackson took place on the 24th of July last. Mr. Osler, counsel for the Crown, in opening the case, spoke as follows:\n\n\"The prisoner is charged with having participated in the recent rebellion, with having acted in the capacity of private secretary to Louis Riel, the leader of the rebellion. He is charged here now formally with this crime, but it is understood that the counsel for the prisoner, Mr. McArthur, will be able to give\nyou satisfactory evidence of the insanity of the prisoner, and that he is not really responsible, and was not responsible for the acts committed by him. The Crown do not propose to contest that contention on the part of the prisoner's counsel. The evidence, in fact, comes from the medical men who have examined the prisoner on the part of the Crown, and evidence that has come to the knowledge of counsel for the Crown, during the course of preparation for other trials, is conclusive that, at the time he committed the acts, he was not responsible for them.\n\nEvidence of Intermittent Insanity.\n\nNow, Sir, it is important to look at the evidence which was adduced on that occasion. Dr. Jukes was examined:\n\n\"By Mr Osler—Q. Is he so insane that it would be unfair to say he was not responsible for his acts?—A. There are occasions when I would consider he would be quite responsible; today he spoke and reasoned with me in a manner that was very clear, but only three days ago he was dazed. His mind seems to be dazed. I do not think that, to bring him at a moment's notice, he would be capable of conducting his trial, or of doing justice to himself in any manner.\n\n\"Q. To a considerable extent, your opinion is, that he could not control his actions?—A. I have never seen anything about him to give me the impression that his actions were uncontrollable. It is rather his mental hallucinations, his ideas. He holds peculiar ideas on religious matters in connection with this trouble, and in connection with the new religion of which he thinks that Louis Riel is the founder, and which he thinks it is his duty to sustain.\n\n\"Q. Would this be consistent with his committing crime?—A. If he spoke rationally I would think so, but he does not.\n\n\"Q. Then you would not hold him responsible for acts done in connection with these ideas?—A. If he committed any acts in the condition he is now, I would not hold him responsible. The slightest excitement produces a great effect upon him.\"\n\nWell, Mr. Speaker, I ask any fair-minded man if this applies to William Joseph Jackson, would not every line of it apply equally to Louis Riel? Is it not a fact that these two men were deluded on the same subjects? Jackson spoke rationally, but he had hallucinations, just as Riel had; and yet one of these men is acquitted, is sent to an asylum, and is then allowed to escape, while Louis Riel is sent to the gallows. Jackson is free today, and Riel is in his grave. I therefore cannot come to any other conclusion than that upon this occasion the same measure of justice which was extended to one man was not extended to the other. I do not want to raise national prejudices, but prejudices are not always the outgrowth of ignoble passion; sometimes they are simply the outgrowth of a noble passion; national prejudices may be the outgrowth of national pride, and when the people of Lower Canada found that the one prisoner was treated in one way and the other in a different way, there was occasion, at least, why they should feel as they did upon this matter. But we never knew, until the Minister of Public Works spoke the other day, what was the true reason of the execution of Riel. We have it now; he has spoken and we know what was the true inwardness of it. The Government had written a pamphlet in order to justify themselves. The utility of that pamphlet is gone; it never had any; not one of the reasons it gave for the execution of Riel was the true reason. It never had any usefulness at all, except, perhaps, as affording to the Government job printing to\n\nSettle the Wavering Consciences of some of their followers. But now we know the true reason why Riel was executed, and here it is in the language of the Minister of Public Works:\n\n\"We had this before us, we had the fact that Louis Riel had, fifteen years before this, committed an act which was considered at the time one that should have been punished in the most severe way. The prisoner, Louis Riel, at that time was not condemned to a severe punishment; he was allowed to remain out of the country for five years, and he was not brought before a tribunal to be tried, and punished or absolved, for the death of Thomas Scott.\"\n\nHere is the reason—the death of Thomas Scott. Since I have named Thomas Scott, let me pause a moment. The Minister of Public Works said the other day that those who sympathised with Riel could not condemn the Government for\nhis execution, because they excused him for the execution of Scott, and the only defence made in his favor was that the act was done by a de facto government. This was not the true reason. Whether the government of Riel was a de facto government or not, is a question upon which there may be considerable difference of opinion. The death of Scott has not been prosecuted for other reasons, to which I shall come presently, but since I have spoken of the death of Scott, I must say that I have always held the view that it was one of the most painful tragedies that has ever occurred in the life of any country; it was one of those acts for which there could be no possible excuse, unless the excuse we now have, that the man's mind was unsound. I cannot conceive that any one of sound mind could have committed so cruel an act. Whether the death of Scott was the act of a de facto government or not, does not matter. De facto governments are sometimes guilty of judicial murders, as we know today. Whether the act of Riel was the act of a de facto Government or not, if that man had been responsible for his acts, as gentlemen on the Treasury benches are responsible for theirs, then the execution of Scott would be a stain on the memory of Riel, just as the execution of the Duke D'Enghien is a stain on the memory of Napoleon, as the execution of Louis XVI is a stain on the records of the French Convention, as the execution of Admiral Byng is a stain on the English Government of that day, as the execution of Mary Stuart is a stain on the memory of Queen Elizabeth, and as the execution of Riel will be a permanent stain and\n\nShame on the present Government.\n\nThe death of Scott is the cause of the death of Riel today! Why, if the hon. gentleman thinks that the death of Scott was a crime, did he not punish Riel at the time? Scott was executed in the early days of 1870, the Government remained in power until the fall of 1873, yet they never did anything to bring that man to justice, who had committed such a crime as they say now he committed. 1870-71-72-73, almost four full years, passed away, and yet the Government, knowing such a crime as it has been represented here had been committed, never took any step to have the crime punished. What was their reason? The reason was that the Government had promised to condone the offence; the reason was that the Government were not willing to let that man come to trial, but, on the contrary, actually supplied him with money to induce him to leave the country, and Sir, I ask any man on the other side of the House, if this offence was punishable, why was it not punished then? And if it was not punishable then, why should it be punished now? The language of the hon. gentleman is obvious, it is plain, it is transparent; it was spoken with the view of reaching the feelings of a certain section of our countrymen; but I recall to hon. gentlemen the language which was spoken by the Minister of Militia, who showed that this offence should have been fully pardoned at the time. Well, if the offence was to be fully pardoned at the time, is it fair to bring it as a charge against the offender now? Is it now fair to base a condemnation of death against him, upon it? Sir, I say it is one of the greatest mistakes—not a mistake alone, but one of the gravest wrongs against the rights of mankind that ever was perpetrated by any Government. Yet I must say I was not altogether surprised at the language of the hon. Minister of Public Works. We had heard something of that before. The Secretary of State visited his county in the month of January, and he also spoke of this event and the execution of Louis Riel. The Minister of Public Works would not meet his accusers except upon the floor of Parliament. The Secretary of State did not object to meet the people, but not his accusers. Still, he went to Terrebonne, and here is the manner in which he spoke of\nThe Death of Scott:\n\n\"I have my sympathies for the half-breeds, and I have proved it, I have proved it before today. In 1874, when Ambroise Lepine was accused of murder, I travelled over 2,000 miles to defend him. I did not go round passing my hat for subscriptions to pay me for defending the accused. I did it willingly, without any hope of reward. (Cheers.) The insurrection of 1870 had a color of an excuse. Men higher than I am in politics have gone so far as to say that there was justification for the rebellion of that day. It was the assertion of the rights of nationality against the cession of territory by supreme power. I defended my client and during that defense I had proof, and the best proof, too, that the killing of the unfortunate Scott, was one of the most atrocious murders ever committed. That atrocious murder was without the connivance and without the approval of Lepine, but it was the result of the selfish vengeance of the then dictator of the North-West—Louis Riel.\"\n\nSuch was the language spoken by the hon. gentleman on that occasion. He was speaking something like ten years after he had gone to the North-West to defend Ambroise Lepine, and after he had acquired that knowledge which enabled him to say that the murder of Scott was one of the most atrocious murders ever committed. Yet, scarcely a few weeks after his return from Winnipeg, where he had defended Lepine, the hon. gentleman moved in the Legislature of Quebec, a resolution, in which he thus characterises the act which he now represents as one of the most atrocious murders ever committed:\n\n\"The troubles in the settlement of the Red River, now the Province of Manitoba, in 1866-70, unfortunately produced a conflict of such a nature as to develop into a rising of considerable magnitude. The leaders of that movement then constituted themselves into a government, and one act to be deplored, perpetrated under the assumed authority of that government, was the execution of one of the subjects of her Majesty. While bowing to the verdict rendered against one of the actors in the movement above mentioned, public opinion in that remote Province of Manitoba, as well as in other Provinces of the Dominion, and even in England, has been strongly impressed with the idea that the deplorable act of violence is so interwoven with the political events of that unhappy period as to render it impossible to assimilate it to ordinary cases of murder.\n\nWith the view of satisfying such sentiment of clemency, and of realizing the ideas of conciliation, peace and tranquility, which presided over the establishment of the Confederation, and further, with the view of removing all causes of divisions and hostile sentiments from among the various nationalities of the country, and especially with the view of giving effect to the recommendation to mercy which the jury coupled with their verdict, your Excellency is humbly prayed to be pleased to exercise, in favor of Ambroise Lepine, now under sentence, the royal prerogative of mercy, by extending to him grace and pardon.\"\n\nNow, if in 1874, the hon. gentleman, just fresh from Winnipeg, where he had just defended Lepine, represented this act as one \"so interwoven with the political events of that unhappy period as to render it impossible to assimilate it to ordinary cases of murder,\" in order to obtain the life of one man, is it fair and just now to represent the same act as an atrocious murder in order to take the life of another man? Sir this issue of the death of Scott has long been a buried issue, and it should not have been brought up again for political consideration. There was a time when it was a living issue, too living an issue, before the people of this country. When the Administration of my hon. friend the member for East York (Mr. Mackenzie) came into power, that had been for years a living, burning issue before the public. Scott had been executed in the early days of 1870.\n\nAn amnesty had been promised by the men who now sit on the Treasury benches, but they never had the courage to carry it out; they never had the courage to stand by their word and deal to the offenders in that rebellion, what they had promised to them. They allowed years and years to pass, and, in the meantime, passions were getting more and more bitter. There are prejudices in Ontario, and there are prejudices in Quebec, and upon such a question the people of Ontario took one view and the people of Quebec took the other view. The people of Ontario demanded that the law should\ntake its course; the people of Quebec demanded that the promises of the Government should be carried out; and between the two Provinces the Government had not the courage to do anything, and they allowed this bitterness of feeling to grow until it became a public danger, which they had not the courage to face. But when the Government of my hon. friend the member for East York came into power, they grappled with the difficulty and settled it in a way which must over be a credit to them. They asked their followers from Ontario and their followers from Quebec each to give up a certain portion of their pretensions for the common weal, each to sacrifice upon the altar of their country something of their pretensions and to unite upon a common course; and upon that they united, and the result has been what was stated by the hon. member for Rouville (Mr. Gigault), that at last peace prevailed which had been unknown for many long years. This issue of the death of Thomas Scott has been long dead, and now it is raised by whom? It is raised by members opposite—the last men who should ever speak of it. Sir, we are a new nation, we are attempting to unite the different conflicting elements which we have into a nation. Shall we ever succeed\n\nIf the Bond of Union is to be Revenge,\n\nif we are to rake up the old sores and launch them at the heads of one another? I am sorry that the Government upon this occasion did not take a leaf from the book of our friends to the south of us. After the civil war was over, there were men who, when they then fully learnt of the outrages at the Andersonville prison and other places, demanded that, if an amnesty was given to political offenders, at least those who were guilty of those outrages should be brought to justice; but\n\nNot a Drop of Blood was Shed,\n\nnot a trial was had, and it is manifest today that the nation is the greater for it. I am sorry also that the Government did not take another leaf from the book of the American nation. I believe there was a reason—a reason adequate to my mind, at least why they should have granted, if not an amnesty—I do not say that—at all events a commutation of sentence. On the 13th May, the day after the battle of Batoche, General Middleton, the commander of the forces, wrote as follows to Louis Riel:\n\n\"Mr. Riel,—I am ready to receive you and your council, and to protect you until your cause has been decided upon by the Canadian Government.\n\n\"FRED. MIDDLETON.\"\n\nRiel surrendered. Did he or did he not surrender in virtue of that letter, of that invitation of General Middleton? On that point there can be no better evidence than that of General Middleton himself:\n\n\"May 15th.—I sent out parties of mounted men, under Major Boulton, to scour the woods. In the afternoon two scouts—Armstrong and Hourle—who had been sent out with Boulton, and had moved away by themselves, came upon Riel, who gave himself up, producing my letter to him, in which I summoned him to surrender and promised to protect him until his case was considered by the Canadian Government.\"\n\nSir, is there not evidence here that Riel then surrendered by virtue of the invitation given by General Middleton? If such is the case, then I submit it to any man's sense of justice and honor if the Canadian Government were justified afterwards in executing a man, their prisoner upon their own invitation? It may be that legally speaking Riel could not bring this as a bar in his trial to any indictment against him, but it seems to me that it is repugnant to anyone's sense of honor and justice that a man whom you have invited to become your prisoner in order to avoid the death of a soldier upon the battle field, should afterwards be hanged to a gibbet.\n\nThe Letter of General Middleton was undoubtedly dictated by the most humane sentiments and not only that, but it is evident also that the course was politic. We see by the report\nof the General that, after the capture of Batoche, one of his objects was the capture of Riel. We can easily understand that. As long as Riel was in the field the rebellion was not ended, and there was a possibility that he might organise guerilla bands, and more lives and treasure would have to be spent before the rebellion was suppressed. The General states in his report:\n\n\"May 14th—We marched for Lepine's Crossing. Having halted for dinner, I received information that Riel was somewhere in the vicinity, so determined to make for Guardapui, or Short's Crossing, which was some miles nearer, and camp for the night.\n\nYou see the General is obliged to alter his course, because Riel is in a certain direction which he had not anticipated. Then when Riel surrendered, the least the Government could do, was not to treat him as they would have done if he had been taken on the field of battle. We have in this matter the precedent of General Lee and General Grant. On the 2nd April, 1865, Richmond, which had so long withstood the Union forces, surrendered, and General Lee commenced his retreat with the object of joining his forces with those of General Johnston. He was followed closely by the victorious army, and, on the 7th of April, General Grant sent him a letter, not inviting, but simply suggesting to him to surrender. General Lee refused, and continued to fight; but, two days afterwards, finding that this situation was hopeless, he sought a conference with General Grant, and accepted the invitation to surrender. General Grant dictated his terms, and here they are:\n\n\"APPOMATTOX COURT HOUSE, VIRGINIA,\n9th April, 1885.\n\n\"GENERAL,—In accordance with the substance of my letter to you of the 8th instant, I propose to receive the surrender of the army of Northern Virginia on the following terms, to wit: Rolls of all the officers and men to be made in duplicate, one copy to be given by an officer designated by me, the other to be retained by such officer or officers as you may designate. The officers to give their individual paroles not to take up arms against the Government of the United States until properly exchanged, and each company or regimental commander to sign a like parole for the men of his command. The arms, artillery and public property to be packed and stacked, and turned over to the officers appointed by me to receive them. This will not embrace the side arms of the officers, nor their private horses or baggage. This done, each officer and man will be allowed to return to his home, not to be disturbed by the United States authority so long as they observe their paroles and the laws in force where they may reside.\"\n\nU. S. GRANT.\n\nGeneral R. C. Lee.\n\nThere you see that the surrendered army were paroled. They were not confined, but allowed to go at liberty so long as they did not take up arms again and violate the laws of the United States; but some authorities in the United States held that this did not prevent the Government from prosecuting the leaders for treason; for guilt of treason they certainly were. The new President of the United States, Andrew Johnson, took steps to bring General Lee, and several of the most prominent officers to trial. This was steadily opposed by General Grant.\n\nThe magnanimity of General Grant's character then came out, and he threatened to resign his position in the army if General Lee and the other prisoners of war were tried for treason. A few months afterwards a committee of Congress sat upon the question. General Grant was brought before the committee and gave this evidence:\n\n\"I frequently had to intercede for General Lee and other paroled officers, on the ground that their parole, so long as they observed the laws of the United States, protected them from arrest and trial. The President, at that time, occupied exactly the reverse grounds, viz., that they should be tried and punished. He wanted to know when the time would come when they would be punished. I told him not so long as they obeyed the law and complied with the stipulation.\n\n\"Eldridge.—You looked on that in the nature of a parole, and held that they could only be tried when they violated that parole.\n\n\"Grant.—Yes, that is the view I took of the question.\"\n\"Eldridge.—Did you consider that that applied to Jefferson Davis?\"\n\n\"Grant.—No, Sir, he did not take any parole. It applied to no person who was captured—only to those who were paroled.\"\n\n\"Eldridge, Did the President insist that General Lee should be tried for treason?\"\n\n\"Grant.—He contended for it......I insisted that General Lee would not have surrendered his army, or given up their arms, if he had supposed that after surrender, he was going to be tried for treason and hanged.\"\n\nNow, is it not manifest, as was stated by the hon. member for West Huron the other night, that if Riel had supposed that in surrendering he would meet with the same fate as if he was taken prisoner, he would never have surrendered, but would have done as Gabriel Dumont and several others did? Recurring to the American case, who can doubt that of those two men, Andrew Johnson and General Grant, the true statesman, the true patriot, was the\n\nOne who advocated clemency?\n\nYou see the result to-day. Scarcely twenty years have passed away since that rebellion, the most terrible that ever shook a civilised nation, was put down, and because of the merciful course adopted by the victors, the two sections of that country are now more closely united than ever before, more closely even than they were when fighting for their independence. The Canadian Government should have followed this example, and I repeat again that we cannot make a nation of this new country by shedding blood, but only by extending mercy and charity for all political offences. The Government say they were desirous of giving a lesson. In the last paragraph of their written defence, they say:\n\n\"In deciding for the application for the commutation of sentence passed upon the prisoner the Government were obliged to keep in view the need of exemplary and deterrent punishment committed in a country situated in regard to settlement and population as are the North-West Territories; the isolation and defenceless position of the settlers already there; the horrors to which they have been exposed in the event of an Indian outbreak; the effect upon intending settlers of any weakness in the administration of law, and the consequences which must follow such a course in a country if it came to be believed that such crimes as Riot's could be committed without incurring the extreme penalty of the law, by and one who was either subject to delusions, or could lead people to believe he was so subject.\"\n\nIndeed the Government have convinced all the people here mentioned, the half-breeds, the Indians, the white settlers, that their arm is long and strong, and that they are powerful to punish. Would to heaven that they had taken as much pains to convince them all, the half-breeds, Indians and white settlers, of their desire and their willingness to do them justice, to treat them fairly. Had they taken as much pains to do right, as they have taken to punish wrong, they never would have had any occasion to convince those people, that the law cannot be violated with impunity, because the law would never have been violated at all. But to day, not to speak of those who have lost their lives,\n\nOur prisons are full of men who, despairing ever to get justice by peace, sought to obtain it by war, who, despairing of ever being treated like freemen, took their lives in their hands, rather than be treated as slaves. They have suffered a great deal, they are suffering still; yet, their sacrifices will not be without reward. Their leader is in the grave; they are in durance, but from their prisons they can see that that justice, that liberty which they sought in vain, and for which they fought not in vain, has at last dawned upon their country. Their fate well illustrates the truth of Byron's invocation to liberty, in the introduction to the Prisoner of Chillon:\n\n\"Eternal Spirit of the chainless mind! Brightest in dungeons, Liberty thou art! For there thy habitation is the heart—The heart which love of thee alone can bind; And when thy sons to fetters are consigned—To fetters and the damp vault's dayless gloom, Their country conquers with their martyrdom.\"\n\nYes, their country has conquered with their martyrdom. They are in durance to-day; but the rights for which they\nwere fighting have been acknowledged. We have not the report of the commission yet, but we know that more than two thousand claims so long denied have been at last granted. And more—still more. We have it in the Speech from the Throne that at last representation is to be granted to those Territories. This side of the House long sought, but sought in vain, to obtain that measure of justice. It could not come then, but it came after the war; it came as the last conquest of that insurrection. And again I say that their country has conquered with their martyrdom, and if we look at that one fact alone there was cause sufficient, independent of all others, to extend mercy to the one who is dead and to those who live.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001480.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 39572, "total-output-tokens": 21332, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 52, 1], [52, 52, 2], [52, 2753, 3], [2753, 6837, 4], [6837, 11069, 5], [11069, 15263, 6], [15263, 19479, 7], [19479, 23506, 8], [23506, 27692, 9], [27692, 31950, 10], [31950, 36184, 11], [36184, 40623, 12], [40623, 44435, 13], [44435, 48521, 14], [48521, 52657, 15], [52657, 56817, 16], [56817, 60672, 17], [60672, 64691, 18], [64691, 68725, 19], [68725, 73137, 20], [73137, 77055, 21], [77055, 81584, 22], [81584, 85484, 23], [85484, 89713, 24], [89713, 93958, 25], [93958, 94678, 26]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]