[{"id": "35929fe10e2565437a70e5cf88d503edfa615e0d", "text": "RETURN\n\n(139)\n\nTo an ORDER of the HOUSE OF COMMONS, dated 1st March, 1882:—For a Return of all Papers concerning the granting of a Charter to the Hudson Bay Company, to construct a Tramway around the North Shore of the Grand Rapids of the Saskatchewan, and any information to shew if the Tramway can be used by the public on paying certain Tolls.\n\nBy Command,\n\nJ. A. MOUSSEAU;\nDepartment of the Secretary of State,\nSecretary of State.\n\nApril 1st, 1882.\n\nMemorandum.\n\nDEPARTMENT OF INTERIOR, DOMINION LAND OFFICE, OTTAWA, 26th July, 1877.\n\nSIR,—Referring to the letter of Mr. Duncan Sinclair, D.L.S., written from Grand Rapids, Saskatchewan, dated the 6th instant, the undersigned has the honor to report to the Minister, as follows:\n\nTracts A. and B. see sketch annexed, containing 50 acres each, were surveyed by the Hudson Bay Company and at their expense, in 1872.\n\nThe Company having subsequently built a steamer to navigate the Saskatchewan, found that on account of the Grand Rapids, they could not have a landing on B. without risking the loss of their steamer, and applied to be allowed to change the site of the 50 acre plot B. further north to a point indicated by the dotted red lines including C.\n\nIt was not thought expedient to allow the Reserve to be changed as asked for, but the Company (see Order in Council of the 24th November, 1876, page 547 of the Orders in Council Dominion Lands) was allowed eight acres, or thereabouts at C. for wharf and warehouse purposes.\n\nThe undersigned took advantage of Mr. Sinclair, D.L.S., passing this point in surveying Indian Reserves, to have this eight acres surveyed. Hence Mr. Sinclair's letter.\n\nIt is for the Minister to say whether, in his opinion, Mr. Sinclair's letter establishes the expediency, in the interests of the Government, of allowing the change of the 50 acre Reserve asked for by the Company, so as to include C, or whether matters shall stand as they are at present.\n\nThe undersigned begs to express the opinion that it would be more in the interest of the Government to allow the Reserve B. to stand as originally surveyed for the Company.\n\nRespectfully submitted.\n\nJ. S. DENNIS, Surveyor-General.\n\nThe Hon. Minister of the Interior, Ottawa.\n\nGRAND RAPIDS, SASKATCHEWAN, 6th July, 1877.\n\nSIR,—I arrived here this morning, and I have had another interview with Mr. Matheson, the local agent for the Hudson Bay Company here. He thought that they were to have the upper fifty acres which had been surveyed by Mr. Gore, D.L.S., moved up.\nI have examined the locality, and I am decidedly of the opinion that if the Company ask leave to move these upper fifty acres, they should be allowed to do so by the Dominion Government, because there is 880 yards between the upper line of the tract B, to the lower side of the tract C, the new piece they want.\n\nBecause the lower line of their block B comes out at the chutes of the Grand Rapid, it would be well to move it up 500 yards beyond the present upper northerly line of B.\n\nIf even the Dominion Government wish to canal this chute as the survey stands, a portion of the land required will have to be purchased back from the Company. It is a beautiful site for a town. I purpose going on to the survey of the Reserve at Moose Lake and expect to be back again in three or four weeks, and will delay this survey for the Company until I shall have surveyed Reserve No. 84, in order to give time for additional instructions on this point.\n\nYour obedient servant,\nDUNCAN SINCLAIR, D.L.S.\n\nThe Hon. Minister of the Interior.\n\nHudson Bay House, Montreal, 1st December, 1876.\n\nSir,—I have the honor to acknowledge your letter (3,376) of the 30th ultimo, informing me, by direction of the Minister of the Interior, that an Order in Council had been passed authorizing:\n\n1. A grant to the Hudson Bay Company of a piece of land on the Saskatchewan River, at the place asked for, at the head of the Grand Rapids, and more particularly described in your present communication and in that you addressed to me, 15th ult., the area of this lot being about 8½ acres.\n\n2. A lease to the Company for a period of twenty-one years, at a nominal rental of $10 per annum, with a renewal of the same at the option of the Company for a further period of twenty-one years, on such conditions as may appear reasonable, of a strip of land for a right of way for a tramway between the landing at the mouth of the Saskatchewan River and that above the Grand Rapids. The Government reserving to themselves the right of resuming possession of either property, should the public interests require it, on reimbursing the Company the original cost of the land so taken, and paying them the value of any buildings, docks or other works which they may have erected thereon, including, of course, the materials used and expenses incurred in construction of the tramway.\n\nThe tariff of charges for the conveyance of goods and passengers across the portage to be subject to the approval of the Governor in Council.\n\nI have, &c., &c.,\nDONALD A. SMITH.\n\nLieut.-Col. J. S. Dennis, Surveyor-General, Ottawa.\n\nDepartment of the Interior, Dominion Lands Office,\nOttawa, 30th November, 1876.\n\nSir,—Referring further to your application on behalf of the Hudson Bay Company for a piece of land for wharf and warehouse purposes on the north-east side of the Saskatchewan River, a short distance above the Grand Rapids, also for permission to build a tramway across the portage connecting the steamboat landing at that point with the landing at the mouth of the said river, I am directed to inform you that the same has received consideration by the Government, and that an Order in Council has been passed authorizing as follows:\n\n1. A grant to the Company of a piece of land at the place asked for, that is to say, at a point on the east side of the Saskatchewan River, 1,170 yards or thereabouts north of the northerly limit of the Company's reserve, as laid out under the\ndeed of surrender, at the west end of the Grand Rapids Portage, at which point is situated the present steamboat landing above the Grand Rapids, this land so granted to be 600 feet front on the river by a corresponding depth and assumed to contain 8\\(\\frac{2}{10}\\) acres, at the price of one dollar per acre.\n\n2. A lease to the Company for a period of 21 years, at a nominal rent of $10 per annum, such lease to be renewed if required by the Company at the termination thereof, for a further period of 21 years, upon such conditions as may then appear reasonable to the Government, of a strip of land for a right of way for a tramway between the landing at the mouth of the Saskatchewan River and that above the Grand Rapid.\n\nThe above grant and lease to be subject to the following conditions, that is to say:\n\n1. As to the lease, the right of way not to be allowed to prevent such ordinary crossing over the same as may be in future required for settlement roads.\n\n2. Both the grant and lease to be subject to a right reserved by the Government to take possession of either property or of any part thereof, should the public interests require it, the Company in such cases to be reimbursed the original cost of any land taken, and to be paid the value of any buildings, docks or other works which they may have erected thereon.\n\n3. The tariff of charges for the carriage of goods and passengers across the portage by the Company's tramway, to be subject to the approval of the Governor in Council.\n\nI have the honor to be, &c., &c.,\nJ. S. DENNIS, Surveyor General.\nHon. D. A. SMITH, M.P., Chief Commissioner Hudson Bay Company, Montreal.\n\nCopy of a Report of a Committee of the Honorable the Privy Council, approved by His Excellency the Governor General in Council, on the 24th November, 1876.\n\nOn a Memorandum, dated 23rd November, 1876, from the Honorable Mr. Scott, acting in the absence of the Minister of the Interior, submitting an application made by the Hon. Donald A. Smith, on behalf of the Hudson Bay Company, for a piece of land for wharf and warehouse purposes on the north side of the Saskatchewan River near the head of the Grand Rapids, for the right to construct a tramway for the carriage of goods and passengers across the portage leading from the steamer landing at the mouth of said river at Lake Winnipeg to connect with the above proposed wharf and warehouse:\n\nThe Honorable Mr. Scott states that considering the value in development of settlement and trade of the Territories by the Company's present and prospective operations, on the line of the Saskatchewan, he recommends the application now made to the favorable consideration of the Privy Council.\n\nHe suggests that the Company may be granted a piece of land for wharf and warehouse purposes, as the place asked for of 600 feet front on the river, with a corresponding width, containing eight acres and eight ore-hundredths of an acre (or thereabouts) at the ordinary price of Dominion Lands, and that with respect to tramway, that they receive a lease for a nominal consideration (say ten dollars per annum) for a strip of land fifty feet wide for a right of way across the portage, such lease in view of the probable expense (placed by Mr. Smith at $20,000) involved in the construction of the tramway, to be for a period of twenty-one years, and if required by the Company to be renewed at the end of that time for a further similar term, upon such conditions as may then appear reasonable to the Government—such right of way not to be held to prevent ordinary crossings over the same for settlement roads.\n\nHe further suggests that both the grant and lease be subject to a right reserved by the Government to take possession of either property or any part thereof should the public interest require it, the Company in such case to be reimbursed the original cost of any land taken, and to be paid the value of any buildings, docks or other works which they may have erected thereon.\nThe tariff of charges for the carriage of goods by the Company to be subject to the approval of the Governor in Council.\n\nThe Committee concur in the foregoing recommendation and suggestions, and submit the same for Your Excellency's approval.\n\nCertified,\n\nW. A. HIMSORTH, C. P. C.\n\nMemorandum.—On reference to the Hon. Mr. Scott, he informs me that this provision only refers to charges for conveyance on the tramway.\n\nJ. S. D., S. G.\n\n29th November, 1876.\n\nHudson Bay House, Montreal, 20th November, 1876.\n\nSir,—I have the honor to acknowledge the receipt of your letter No. 6,339 of 15th inst., intimating that the acting Minister of the Interior has been pleased to assent to the request made by me on the part of the Hudson Bay Company to have patented to them a sufficient extent of ground, say about 600 feet frontage on the River Saskatchewan, by an equal depth embracing the present steamboat landing, the same being at a point 1,170 yards north of the northerly lines of the 50 acres reserve laid out for the Company by Mr. Gore, D.L.S., at the head of the Grand Rapid, and that a lease shall be given to the Company at a nominal rental to cover the proposed tramway at that point, subject, however, to the right of the Government to resume possession of the said lands or any part thereof, should the same be required for public purposes, in such case the Company to be paid the value of the buildings, &c., docks or works which may be thereon.\n\nI shall feel obliged, if you would be good enough to inform me for what number of years the lease referred to will be given, and trust the Honorable the Minister will decide that it shall be for a lengthened period as the expense of constructing the tramway will be very considerable.\n\nI have the honor, &c.,\n\nDONALD A. SMITH.\n\nLieut.-Col. J. S. DENNIS, Surveyor General, Ottawa.\n\nDepartment of the Interior, Dominion Land Office, Ottawa, 15th Nov., 1876.\n\nSir,—I am directed by the acting Minister of the Interior, referring to your letter of the 18th August last, on the subject of the site for the Company's wharf, warehouses, &c., at the upper end of the Grand Rapid, Saskatchewan, also respecting the tramway which the Company proposes to build across the portage at that point, to inform you that the same having been considered, a sale will be made to the Company at the ordinary price of Dominion lands, of a piece of land six hundred feet frontage on the River Saskatchewan, by an equal depth, embracing the present steamboat landing, the same being at a point about 1,170 yards north of the northerly limit of the fifty acres reserve laid out for the Company by Mr. Gore, D.L.S., at the head of the Grand Rapid, and as regards the proposed tramway, a lease at a nominal rental will be given the Company to cover the necessary right of way therefor, such sale and lease respectively however to be subject to the right of the Government to resume possession of the said land or any part thereof should the same be required for public purposes; in such case the Company to be paid the value of the buildings, docks, &c., or works which may be thereon.\n\nI have the honor to be, Sir,\n\nJ. S. DENNIS, Surveyor General.\n\nHon. DONALD A. SMITH,\nChief Commissioner Hudson Bay Company, Montreal, Quebec.\nOFFICE OF THE MINISTER OF PUBLIC WORKS, OTTAWA, August 16th, 1876.\n\nMy Dear Mr. Meredith,—I enclose a letter from Mr. D. Smith which refers to a conversation we had in Mr. Dennis' presence a few days ago.\n\nI agree, as he says, that the Company should be allowed to select another piece of ground at the head of the rapids for warehouse and wharfage, and that we would allow a tramway to be constructed across the frontage, with the condition that the frontage on the river would be limited to what is necessary for the specific purpose mentioned, and that neither its location or the tramway should be allowed to stand in the way of the Government, if it should be found that we require the lands. I don't apprehend any difficulty, however, neither does Mr. Dennis.\n\nPerhaps you would see Mr. Dennis and have a letter written to Mr. Smith according the rights asked for on these conditions.\n\nThe tramway will be very useful for ourselves; and will in fact save us the cost of building one.\n\nYours faithfully,\n\nE. A. Meredith, Esq. A. Mackenzie.\n\nThe Company may purchase a piece 600 feet square at the head of the rapids, and authority may be given for building a tramway. The Government to have the right to take the land at any time required for public purposes paying the Company only the value of buildings and docks.\n\nNovember 15th, 1876.\n\nR. McL.\n\nHUDSON BAY HOUSE, MONTREAL, 15th August, 1876.\n\nMy Dear Sir,—Will you allow me to remind you, that on my bringing to your notice at Ottawa, on the 21st ultimo, that the Hudson Bay Company desired to be accorded permission to make a tramway between the landing places at the Grand Rapids, Saskatchewan River, you were good enough to say that the Government would consent to their doing so, as well as that the Company would be assured in possession of the sites on which they might erect any warehouses or other buildings for the purposes of their business, at a point at the upper end of the proposed tramway, some distance above their own reserve, the latter proving inconvenient as a landing place. To this permission would attach the condition that the Government might on giving due notice to the Company take over both the tramway and buildings, or either, on paying what might be adjudged a fair valuation for the same, and the Company being also furnished without further charge, other land suitable for their warehouses, near to that assumed by the Government.\n\nYou were then pleased to say that you would address me officially to this effect, and I shall feel greatly obliged if you will kindly cause this to be done as soon as convenient, as the cost of the tramway will probably be some $15,000, and the Company's officers are unwilling to proceed with the work, until officially in possession of the sanction of the Government to it.\n\nI intended being in Ottawa to-morrow, on my way to Winnipeg, to confer with Mr. Laird about some selections of river lots, he proposes being made during my visit to Manitoba, but having just got a telegram intimating that he leaves to-night for the West, and will be absent some days, I shall defer my departure for Fort Garry for a few days, in hopes of meeting the Minister, as without a definite understanding as to what shall be considered unoccupied lots, I fear it would be of little use to attempt making a selection.\n\nI have the honor to be, faithfully yours,\n\nDonald A. Smith.\n\nHon. Alexander Mackenzie, Prime Minister, Ottawa.\nOTTAWA, August 16, 1876.\n\nMy Dear Sir,—I beg to acknowledge the receipt of your note of this day's date, addressed to Mr. Meredith, with accompanying letter from Mr. D. Smith, relative to the selection, by the Hudson Bay Company, of another piece of ground at the head of the Grand Rapids, Saskatchewan River, for warehouses and wharf, and their desire for permission to construct a tramway across the portage.\n\nMr. Meredith is absent at present for his holidays.\n\nI shall, however, see Mr. Dennis as you direct, and request him to write to Mr. Smith according to the rights asked on the conditions described in your letter.\n\nYours respectfully,\n\nHon. A. MacKenzie.\n\nL. D. VANKOUGHNET.\n\nDEPARTMENT OF THE INTERIOR, DOMINION LANDS OFFICE,\nOTTAWA, 16th August, 1876.\n\nSir,—I am directed by the Minister of the Interior to acknowledge the receipt of your letter of yesterday, addressed to the Hon. Mr. MacKenzie, on the subject of your application on behalf of the Hudson Bay Company, for permission to make a tramway across the portage between the landing places at the Grand Rapids of the Saskatchewan River, and further to be assured in the possession of the sites on which they may erect any warehouses or other buildings for the purpose of the Company's business at the upper terminus of the proposed tramway some distance above the Company's reserve as at present laid out, the latter having proved inconvenient as a landing place, and in reply, to inform you that the Company is at liberty to construct such tramway, and to erect any warehouses or other buildings it may consider necessary, provided that the frontage, occupied by the Company, on the river, be restricted to what is necessary for the specific purpose mentioned, and that neither the location of the buildings or of the tramway shall be allowed to stand in the way of the Government should it be found that the land be required hereafter for public purposes.\n\nI have, &c., Sir, your obedient servant,\n\nJ. S. DENNIS, Surveyor General.\n\nHon. Donald A. Smith, Chief Commissioner of the Hudson Bay Company, Montreal, Que.\n\nHUDSON BAY HOUSE, MONTREAL, 18th August, 1876.\n\nSir,—I have the honor to acknowledge the receipt of your letter of the 16th instant conveying to me, by direction of the Hon. the Minister of the Interior, the sanction of the Government to the construction by the Hudson Bay Company of a tramway between the landing places at the Grand Rapids of the Saskatchewan River; and the assurance that the Company will be secured in the possession of the sites on which they may erect any warehouses or other buildings for the purposes of their business at the upper terminus of the proposed tramway, above their reserve as at present laid out; also stating the conditions on which this permission is accorded to the Company.\n\nI shall deem it a favor to be informed, if I am right in assuming that at the interview given me on the 21st ultimo by the Honorable the Premier, and the Minister of the Interior, the proposition I then made, that the Company should receive fair compensation for the expense incurred by them in constructing the tramway and buildings, in the event of either or both of these being hereafter required for public purposes, was assented to.\n\nI have the honor to be, Sir, your obedient servant,\n\nDONALD A. SMITH.\n\nLieut.-Col. J. S. Dennis, Surveyor-General.\nDEPARTMENT OF THE INTERIOR, DOMINION LANDS OFFICE,\nOTTAWA, 10th May, 1875.\n\nSir,—Referring to your letter of the 9th January last, enclosing an extract from\none sent you by James A. Graham, Esq., chief officer in charge of the Hudson Bay\nCompany's commercial affairs in the North-West Territories, requesting a re-adjust-\nment of the outlines of the Company's reserve, as laid out by Mr. Gore, D.S., at\nGrand Rapids, Saskatchewan, the change asked for being set forth by the description\nand sketch in the said extract, I am directed by the Hon. the Minister of the Interior\nto say that the same has been under consideration.\n\nIn reference thereto I am to state that inasmuch as the land taken for the Com-\npany's claim at this point was selected and surveyed by themselves, and in such wise\nas to embrace both extremes of the Portage Road, and, moreover, as the Department\nof Public Works reports that the place to which the Company desires permission to\nremove, or to change their reserve, is required for public works immediately about\nto be undertaken, he regrets to feel obliged to decline to recommend the proposed\nchange.\n\nI have the honor to be, Sir, your obedient servant,\n\nJ. S. DENNIS, Surveyor-General.\n\nHon. D. A. SMITH, Chief Commissioner, Hudson Bay Company,\nHudson Bay House, Montreal.\n\nExtract of a Letter from Mr. Alexander Matheson.\n\nCUMBERLAND HOUSE, 1st September, 1874.\n\nThe claim surveyed for the Company at the upper end of Grand Rapids Saskatche-\nwan is too near the rapid to be of any use for a steamboat landing place, or for putting\nup any buildings thereon, and Captain Aymond has decided upon a spot for that pur-\npose, which is 1,170 yards above the boundary line of the survey. It will be well to\nhave a couple of chains more allowed for, so as to be certain of a good place. The\nriver at this particular spot flows pretty nearly in a straight north and south line,\nand the annexed rough sketch will convey some idea of the lay of the place selected.\n\nMONTREAL, 9th January, 1875.\n\nSir,—I have the honor to enclose a copy of a letter sent me by James A.\nGraham, Esq., chief officer in charge of the Hudson Bay Company's commercial\naffairs in the North-West Territory, requesting a re-adjustment of the outlines of the\nCompany's reserve, as laid out by Mr. Gore, Deputy-Surveyor at Grand Rapids,\nSaskatchewan, and to request that you will be so good as to give instructions to have\nthe description for the patent for the reserve at that point made to cover the land\nrequired. The additional quantity may be deducted from the balance of the 50,000\nacres remaining for selection by the Company.\n\nI have the honor to be, Sir, your obedient servant,\n\nDONALD A. SMITH.\n\nHon. DAVID LAIRD, Minister of the Interior, Ottawa.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001039.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11440, "total-output-tokens": 5511, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2511, 2], [2511, 5946, 3], [5946, 9917, 4], [9917, 13176, 5], [13176, 16614, 6], [16614, 19973, 7], [19973, 22719, 8]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]