[{"id": "468a964ecbb80686024032fcee0d6bf50afa0493", "text": "L'ABSOLUTION\n\nAVANT LA BATAILLE\n\nDEDIÉ\n\nAUX\n\nBRAVES DE LA BUTTE-AUX-FRANÇAIS\n\nPAR\n\nG. L. DESAULNIERS\nG. L. DESAULNIERS\n\nL'ABSOLUTION\n\nAVANT LA BATAILLE\n\nDÉDIÉ\n\nAUX\n\nBRAVES DE LA BUTTE-AUX-FRANÇAIS\n\nMONTRÉAL.\n\nIMPRIMERIE DE \"L'ÉTENDARD\" 37 RUE ST-JACQUES\n\n1886\nEnregistré conformément à l'acte du Parlement du Canada, en l'année mil huit cent quatre-vingt-six, par G. L. DÉSAULNIERS, au bureau du Ministre d'Agriculture.\n\nDroit de reproduction réservé.\nHOMMAGE\n\nAUX\n\nBRAVES DE LA BUTTE-AUX-FRANÇAIS\n\nLt.-Col. G. A. HUGHES.\n\nMajor J. ROBERT. Major H. PREVOST,\nAdjudant C. STARNES. Major Chirurgien PARÉ,\nCapitaine Q. M. LAROCQUE.\nAumônier Rev. PÈRE PROVOST, O. M. I.\nInstructeur LABRANCHE,\n\nCapt. E. BAUSSET. Capt. A. ROY.\nCapt. G. VILLENEUVE.\nLt. J. T. OSTELL. Lt. Z. HÉBERT.\nSERGENTS :\n\nN. GAUVREAU, J. B. DUSSAULT, AVILA BEAUDIN,\nL. LABELLE, J. DUBORD, EUGÈNE HOULD,\nP. VALIQUETTE, A. LUPIEN, A. D'AMOUR,\nS. G. BENNETT. LAPIERRE.\n\nCAPORAUX :\n\nE. LESPRANCE, A. BROWNING, J. A. MARTIN,\nA. BRAIS, R. VALLÉE, E. O. POULIOT,\nE. BARRY, J. E. BARRÉ, J. STANTON,\nJ. TELLIER.\n\nCLAIRON :\n\nT. ROBICHAUD.\n\nSOLDATS :\n\nEdouard Soulière. Napoléon Beaulne.\nPierre HéSarazin. A. Fafard.\nJoseph Gaudette. Télesphore Dufresne.\nDavid Forgue. L. Rose.\nAlbert Sauriol.\nJoseph Deglandon.\nEugène Maillet.\nUrgel Viau.\nAlfred Boisvert.\nEdouard Houle.\nAlphonse Merineau.\nAimé Laviolette.\nArthur Gagnon.\nJoseph Marcotte.\nAlexandre Richer.\nJoseph H. Chartrand.\nAuguste Chamard.\nRegis Huot.\nMarc A. Prieur.\nErnest Brais.\nJoseph Octave Corbeil.\nJoseph Deslauriers.\nCélestin Gravel.\nArthur Moussette.\nGustave Tessier.\nFerdinando Carli.\nJoseph Martineau.\nBenjamin Rodier.\nA. Dagenais.\nC. Clairmont.\nA. Bertrand.\nO. Bertrand.\nE. Chalifoux.\nX. Larin.\n\nChas. Grenier.\nF. X. Pouliot.\nDavid Traversé.\nEphrem Lemay.\nAlphonse Dumont.\nSamuel Gascon.\nJean Roy.\nArsène Lebel.\nXavier Lortie.\nOlivier Paquette.\nNapoléon Léger.\nArthur Dreyfus.\nAdolphe Wilscam.\nRomuald Lécuyer.\nL. Jutras.\nA. Desroches.\nJ. Morin.\nJ. Gauvreau.\nW. Roarty.\nU. Valois.\nJ. Despatie.\nL. Leduc.\nA. Marceau.\nW. Beauchamp.\nJ. Lavoie.\nH. Langlois.\nD. Dansereau.\nH. O. Rochon.\nE. Allard.\nN. Doucet.\nL'ABSOLUTION\n\nAVANT LA BATAILLE\n\nLe désert s'enfonçait bien avant dans les cieux.\n\nÉchangeant leurs pensers et leurs craintes entre eux,\nCoupant les horizons qu'un horizon efface,\nCalmes sous le soleil qui leur hâlait la face,\nEt secouant au vent la poudre des chemins,\nForts comme des Gaulois, fiers comme des Romains,\nCent braves s'avançaient, joyeux, front haut, stoïques ;\nLeurs pieds meurtris prouvaient leurs courses héroïques.\n\nUn soir brumeux et froid—arrachés brusquement\nAux caresses sans nombre, au long embrasement\nDe mères qu'effrayait le cliquetis des armes,\nD'épouses qui baisaient, au milieu de leurs larmes,\nLeur uniforme sombre et leurs humbles galons—\nIls avaient dû partir. Sans but et sans jalons,\nPar un climat d'avril, par des neiges fondantes,\nLe jour dans la prairie, et la nuit sous des tentes\nDont parfois la rafale ébranlait les sommets,\nIls gagnaient l'inconnu sans se lasser jamais.\nIls allaient, s'attardant quelquefois sur les routes,\nInterrogeant l'espace et l'oreille aux écoutes,\nCar la savane est grande et grands sont les déserts,\nEt repartaient, de pluie ou de neige couverts\nSans vivres, sans souliers. Par moments la tempête,\nCrevant l'âpre nuage au dessus de leur tête\nEt se répercutant dans les lointains échos,\nSe dressait sur son aile et criblait leurs shakos ;\nMais que leur importait le vent et ses colères,\nIls se disaient, domptant les éléments polaires :\nLa vie est dure ici, mais la gloire est au bout.\nEt si quelqu'un tombait, ils-lui criaient : debout !\n\nJamais un mot de blâme et jamais de murmures !\nComme un chêne géant aux rugueuses ramures,\nIls restaient forts devant l'ouragan qui passait.\nQue dis-je, à leur insu leur âme grandissait.\nEt quand, malgré cela, parce que leur épée\nÉtait encore vierge et n'était pas trempée\nDans le sang, dans ce sang peut-être où nos aïeux\nPlongèrent si souvent leur glaive audacieux,\nIls eurent à subir un insulteur, un drôle,\nUn vil menteur payé pour ternir l'auréole,\nDont la clarté sans tache éblouissait leur front.\n—Eux qui devaient plus tard relever cet affront—\nJamais ces fiers enfants, un moment ne faiblirent.\nDevant leurs pas hardis les routes s'aplanirent;\nSans que de leur pays le souvenir charmant\nNe vint leur apporter le découragement.\n\n***\nMaintenant le clairon sonne halte.\n\nC'est l'heure\nOù le zénith flamboie, où la terre qu'effleure\nUn chaud rayon d'été par l'air pur attiédi\nOffre sa lèvre vierge aux baisers du midi.\nLe vieux Saskatchewan, roulant ses flots sauvages,\nEmplissait de rumeurs les bois et les rivages ;\nEt la plaine sans fin, dans les horizons bleus,\nÉtalait sa splendeur auguste sous les cieux.\n\nDieu les avait conduits, seuls, à travers l'espace\nLà, tandis qu'autour d'eux, comme un lion qui passe,\nEt dont la voix grondante épouvante les airs,\nLe peuple sanguinaire et fauve des déserts\nLes guettait. Rien n'avait, pendant la route morne\nQui s'offrait au départ sans issue et sans borne,\nDe leur figure hâve et de leur front d'airain\nTerni le caractère énergique et serein.\nIls sentaient, qu'au delà de l'immense prairie,\nQuelqu'un les regardait fixement : la Patrie.\nPourtant une pensée amère torturait\nLeur cœur, et quand les monts que le soleil dorait\nDe loin leur indiquaient les tours de Notre-Dame,\nQuelque chose de grand s'éveillait dans leur âme.\nDescendants de ces prieux qu'Hébert de son burin\nExhume d'un passé sans tache et souverain,\nIls voulaient, eux aussi, de ces grands bois farouches\nRéveiller les échos au bruit de leurs cartouches.\n\nIls voulaient recevoir leur baptême de sang.\n\nOr, tandis qu'ils faisaient ce rêve éblouissant,\nQui leur ouvrait déjà le temple de la Gloire\nEt burinait leurs noms au socle de l'Histoire,\nTandis que leur regard voyait dans l'avenir\nLes drapeaux de Lévis à leur drapeau s'unir,\nRiantes visions de longues nuits passées\nÀ suivre lentement le cours de leurs pensées,\nVoilà que tout à coup du fond des bois touffus\nUn murmure d'abord demi-vague et confus\nComme un bruissement d’algues vertes s’élève ;\nPuis le son devient grave et profond, de la grève\nIl monte et s’agrandit en se répercutant,\nEt le soldat, bronzé par les soleils, entend\nUne voix lui crier, foudroyante et terrible :\n“Aux armes !”\n\nL’ennemi, jusqu’alors invisible,\nQue nul ne sent marcher et nul ne voit venir,\nDe ses taillis obscurs s’apprêtait à bondir.\n\nPas un mot, pas un cri, ni plainte, ni surprise.\nSentant battre du cœur sous leur étoffe grise,\nEt voulant conserver sans tache leur blason,\nIls fixèrent muets l’insondable horizon.\nPeut-être qu’au hasard quelques mains se pressèrent,\nQue des pleurs à travers quelques cils se glissèrent,\nMais ce fut tout. Chacun comprit qu’en ce moment,\nLe spectre de Montcalm, sous son granit dormant,\nSe dressait, et qu’il ne faut pas que l’on souffle\nPar une lâcheté son glorieux squelette.\nLe courage chez eux ne se refroidit point ;\nMais avant d'engager, la carabine au poing,\nEt les haillons au vent, leur première bataille ;\nAvant que dans les airs la sanglante mitraille\nEut sifflé, décrivant un arc-en-ciel de feu,\nLeur dernière pensée ici-bas fut pour Dieu.\nCar ces vaillants enfants, grandis dans les alarmes,\nA leur brave aumônier présentèrent les armes,\nEt, pareils aux roseaux souples des prés jaunis\nQui, lorsqu'un vent, chargé de parfums inouïs,\nPasse en rasant le sol de son aile et se glisse\nLéger comme un brouillard et frais comme un calice,\nSe penchent sans effort, aspirant les senteurs\nQui s'échappent des flots, des feuilles et des fleurs ;\nDe même ces soldats, pour recevoir du prêtre\nLe signe du pardon et le dernier peut-être,\nCourbèrent leurs fronts nus au soleil d'or brunis,\nEt mirent un genoux à terre.\n\nO mon pays !\nLe sang de tes aieux gonfle encor tes artères,\nEt tes fils d'aujourd'hui sont dignes de leurs pères !\nUn siècle de repos n'a pas pu le rouiller\nTon glaive, et les rayons qu'il faisait scintiller,\nEblouissent encor nos ardentes prunelles.\nTes batailles d'hier ont déployé leurs ailes,\nEt toutes, accourant au son de leurs tambours,\nSoufflent dans nos clairons l'esprit des anciens jours.\nO mon pays, tu sais allier au courage\nTa foi, ce don divin, ce splendide héritage\nQue trois cents ans vaincus, mais de gloire remplis,\nNous ont transmis intègre et si pur dans leurs plis.\nEt quand revient encor la lugubre mêlée,\nQuand sous les cieux, la mort, livide, échevelée,\nVoltigeant au dessus des sombres bataillons,\nDans leurs rangs épaisse trace d'effreux sillons,\nTu sais, ô mon pays devant qui l'on s'incline :\nDevant le Dieu de Jeanne et le Dieu de Bouvine,\nDevant Celui qui fixe et règle les combats,\nTu sais te prosterner le jour où tu te bats.\n\n***\n\nLe prêtre alors leva sa main de pardon pleine :\n\n*Ego vos absolvo*, dit-il.\n\nEt de la plaine\nPendant qu'il prononçait ces paroles qui font,\nMystère auguste et saint, tomber du ciel profond\nLa clémence divine-en céleste rosée,\nMonta comme un encens vers la voûte irisée.\n\nOn eut dit qu'une haleine ineffable passait.\nEt les grands bois perdus où le jour se berçait,\nEt le flot déferlant sur le sable, et la feuille,\nEt tout ce qui fleurit, chante, vole ou s'effeuille,\nEt les monts et la brise et la plaine et les cieux\nSaluèrent cette aube étrangère pour eux.\n\nEt, comme une mystique et légère bruine,\nSur les soldats, baissant leur front sur leur poitrine,\nEt que l'astre du jour de lumière inondait,\n\nLentement le pardon suprême descendait.\nPuis quand le ciel se fut refermé sur leur tête,\nTroublant de ces déserts la profondeur muette,\nEt de l'ombre, porté sur les ailes du vent,\nOn entendit ce cri formidable :\nEn avant !\n\nGONZALVE J. DÉSAULNIERS.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001430.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 26576, "total-output-tokens": 3872, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 101, 2], [101, 101, 3], [101, 260, 4], [260, 452, 5], [452, 775, 6], [775, 1232, 7], [1232, 2126, 8], [2126, 2126, 9], [2126, 2446, 10], [2446, 3432, 11], [3432, 4374, 12], [4374, 5224, 13], [5224, 6059, 14], [6059, 6908, 15], [6908, 7958, 16], [7958, 8807, 17], [8807, 9457, 18], [9457, 9666, 19], [9666, 9666, 20]], "primary_language": ["None", "fr", "None", "fr", "fr", "fr", "fr", "fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false]}}]