[{"id": "64ee64f2085b88071000d567fd157db341206a57", "text": "Grandin (mgr Vital),\n\nUn suprême appel. L'évêque du Nord-Ouest supplie tous les amis de la justice au Canada de l'aider à protéger ses oreilles contre les tyrans d'Ottawa.\n\n4 pp. Q. s.l., s.d.\nUN SUPREME APPEL.\n\nL'ÉVEQUE\n\nDu Nord-Ouest supplie tous les amis de la justice au Canada de l'aider à protéger ses ouailles contre les TYRANS D'OTTAWA\n\nIl y a quelques mois, on a livré à la publicité un document d'une extrême importance. C'était un appel énergique de Mgr GRANDIN, ÉVEQUE DES TERRITOIRES DU NORD-OUEST. Cette pièce a produit dans le temps une vive commotion dans les cercles sociaux et politiques, par suite des vives révélations qu'elle comportait.\n\nCet appel, malheureusement, ne pouvait avoir à cette époque aucun effet pratique, vu que les amis de la justice étaient impuissants à intervenir et à mettre fin à l'ignoble persécution qui est révélée dans ces lignes émouvantes de Mgr GRANDIN. Mais aujourd'hui que l'heure des redditions de comptes a sonné, et que les tyrans sont à la barre, appelés à rendre compte de leur conduite, c'est le tour du peuple d'intervenir, de frapper les coupables et de protéger les victimes.\n\nPersonne ne lira sans une poignante émotion ce terrible réquisitoire, du VENERABLE ÉVEQUE du Nord-Ouest. Nous le signalons à l'attention, non-seulement des Canadien-français et des catholiques qui devront se sentir le sang fouetté dans les veines en voyant tant de leurs frères ainsi tyrannisés, mais également à toutes les âmes justes, à quelque croyance, à quelque race qu'elles appartiennent, à tous ceux qui placent les lois sacrées de l'humanité au-dessus des liens de parti ou des divergences d'opinion sur les questions religieuses.\n\nIl doit y avoir, Dieu merci, au Canada, un grand nombre d'Anglais protestants imbues des idées de Gladstone, de ce grand libéral qui, l'autre jour encore, en plein parlement anglais, bravait le fanatisme de ses coreligionnaires qui formaient plus que les trois quarts de l'Angleterre, et revendiquait, au nom de l'honneur de sa race, l'émancipation des catholiques anglais.\n\nQuant à nous, nous n'hésitons pas à proclamer publiquement que, si un groupe de nos concitoyens anglais, quelque restreint qu'il fut, était extrêmement contrarié de voir nos coreligionnaires du Nord-Ouest, nous frapperions sur les tyrans avec la même ardeur que nous faisons à dénoncer aujourd'hui les oppresseurs de nos coreligionnaires du Nord-Ouest.\n\nSAINT-SULPICE\nEVECHÉ DE SAINT-ALBERT, 20 NOVEMBRE 1889.\nAlberta, T. N.-O., Canada.\n\nÀ Son Eminence Mgr TASCHE-\nREAU, Cardinal-Archevêque de\nQuébec, et à Messeigneurs les Ar-\nchevêques et Evêques de l'ancien-\nne Province ecclésiastique de\nQuébec\n\nEMINENCE et RÉVÉRENDISSIME et VÉNÉRÉS SEIGNEURS,\n\nPermettez à un de vos humbles frères dans l'Episcopat, succombant aux peines et inquiétudes qui l'accablent, de se tourner de nouveau vers votre charité, espérant que vous pourrez l'aider au moins de vos prières et de vos conseils, et que même le Seigneur vous inspirera quelque plan pour le secourir.\n\nDepuis l'annexion de notre territoire au Canada, dans la partie colonisable de mon diocèse, les misères physiques d'autrefois ont bien diminué, elles ont même disparu dans certaines localités ; mais, je dois l'avouer, les peines morales qui leur ont succédé, celles que nous prévoyons surtout, nous forcent à regretter le temps passé. Lors de l'annexion, les Canadiens et Métis français étaient, on peut dire, les seuls colons du pays qu'avaient découvert leurs pères. Ils vivaient paisiblement avec les seuls commerçants de la Cie de la Baie d'Hudson, et quelques rares colons anglais récemment établis. Après l'annexion, les immigrants vinrent en grand nombre, et je n'oserais assurer que sur cent il se trouvât dix catholiques ; la population anglaise et protestante augmenta donc rapidement, et en quelques années, nous dûmes nous résigner à n'être plus qu'une minorité. À Dieu ne plaise que je veuille accuser d'une manière générale cette nouvelle majorité de vouloir nous maltraiter ! il y a parmi les nouveaux venus bien des familles respectables et honnêtes qui déplorent la guerre que l'on nous fait. Cette guerre, Messieurs, on ne l'avouera pas, mais moi je le certifie à Votre Eminence et à Vos Grandeur, c'est le gouvernement fédéral, qui, par le personnel d'un département indien, nous l'a faite le premier, et d'autant moins loyalement, que de sa part, il n'y a pas eu de déclaration de guerre, et que, chez nous, ne pouvant supposer le mal, nous n'avons, dans le principe, opposé aucune résistance. Dès que les Indiens ont conclu le traité avec le gouvernement, toute l'administration du département indien fut, dans mon diocèse du moins, généralement et exclusivement composée de protestants de langue anglaise.\n\nPour des raisons qu'ils n'ayourent jamais, ces messieurs contraignirent nos sauvages chrétiens à s'éloigner de nos établissements que nous fûmes, par ce fait, obligés d'abandonner. Cette manière d'agir était aussi opposée aux conditions du traité qu'aux intérêts physiques et moraux des sauvages. Quand, après cela, à la demande des sauvages, nous avons voulu nous établir chez eux, vous ne sauriez croire toutes les difficultés qu'on nous a suscitées. Sans égard à la foi religieuse et au désir des sauvages, on leur a exclusivement imposé des écoles protestantes, et les pauvres Indiens ont été poussés, menacés même, pour qu'ils envoyassent leurs\nensuite à des écoles où leur foi n'était pas respectée. À part une école industrielle, il n'y a pas dans mon diocèse, une seule école catholique que nous n'ayons établie nous-mêmes, souvent devant une vive opposition, et supportée en partie dès le principe. En novembre 1887, on m'avait positivement assuré à Ottawa qu'on allait cesser d'en agir ainsi ; je dois certifier que la persécution, je puis me servir de ce mot, est plus accentuée que jamais. Malgré cela, vous n'en serez pas surpris, nous sommes les coupables, en bonnes brebis, nous devrions nous laisser tondre et égorger sans même béler.\n\nC'est une maladie épidémique, ce fanatisme s'est communiqué des réserves à certains centres civilisés. On poursuit nos écoles. C'est un crime pour nous de profiter de nos lois scolaires pour nous faire aider par le gouvernement ; on étudie nos rapports, on épilogue sur tout, afin de pouvoir nous accuser et nous faire enlever des secours auxquels nous avons droit. Bien qu'étant la minorité, nous pourrions cependant envoyer deux représentants à la Chambre, on a réussi à nous rendre la chose impossible. J'en accuse encore le gouvernement fédéral qui, en formant les districts électoraux, a divisé les deux centres catholiques français de manière que nous sommes dans l'impossibilité de nous faire représenter. Aussi, vous savez ce qui se passe aujourd'hui à Regina. Malgré les efforts de l'honorable J. Royal, lieutenant-gouverneur du Nord-Ouest, et de l'hon. juge Rouleau, tous nos représentants, dont pas un n'est catholique, demandent, à l'exception de deux, l'abolition de notre langue et le changement de nos lois scolaires, pour nous imposer de prétendues écoles neutres, qui ne sont autre chose que des écoles anti-catholiques, si même elles ne sont pas des écoles sans Dieu. Jugez quelle en sera la conséquence dans un pays nouveau, un pays sauvage. Ces demandes s'adressent à Son Excellence le gouverneur-général au nom des habitants du Nord-Ouest. On n'ignore pas assurément combien nous y sommes opposés, mais nous ne comptons aux yeux de ces messieurs.\n\nCe mépris affecté pour la population française catholique a déjà en de bien tristes résultats. Bien que les Métis n'aient rien gagné en se révoltant, ils n'en sont pas pour cela plus insensibles au mépris. Rien ne serait facile comme de mettre aujourd'hui le feu aux poudres. Qu'un de ces prétendus loyaux, si disposés à trouver, notre loyauté et notre patriotisme en défaut, suppose qu'une nouvelle révolte lui profitera, il lui sera d'autant plus aisé de soulever notre population, que nos catholiques n'ont plus dans le clergé la confiance qu'ils avaient autrefois. On leur a tant dit que nous sommes généreusement rétribués par le gouvernement fédéral pour le supporter contre eux, qu'ils ont fini par le croire. Assurément, nous l'avons soutenu, comme nous soutenons toujours l'autorité ; mais il nous faut le reconnaître, nous en sommes bien mal récompensés, et ceux qui, pour cela, nous ont blâmés, se trouvent jusqu'à un certain point justifiés.\n\nCependant, ce parti catholique français qu'on ne voit plus, a des droits qu'on ne peut lui ravir sans injustice, il en a même à la reconnaissance de ce parti fort et puissant qui a tenu à l'opprimer. Ne sont-ce pas, en effet, les Canadiens-français et les Métis qui ont rendu possible la colonisation du Nord-Ouest, qui ont facilité les rapports des blancs avec les sauvages, qui sont encore aujourd'hui le vrai trait d'union entre les uns et les autres ? Mais la reconnaissance, le souvenir même d'une obligation n'est pas, paraît-il, la vertu des plaisants ; il faut, nous, minorité, nous résigner à ne plus compter dans la société, trop heureux s'il nous permet de vivre comme des parias et des vaincus. Malgré une certaine dose d'humilité que je m'efforce de cultiver en moi, il m'est échappé cependant,\npour moi et pour les miens, de me résigner à vivre à ces conditions. Il faudrait, me répétez-vous toujours, organiser vers le Nord-Ouest une émigration française et catholique. C'est bien la vérité, mais que puis-je faire dans ce but ? On ne peut rien sans argent, et il me manque ; notre population est pauvre.\n\nSi je m'adresse dans ce but à votre charité, vous me direz sans doute comme plusieurs diocésains que je ne blâme pas pour cela : il ne faut pas dépeupler la province de Québec pour peupler cet immense Nord-Ouest. Très bien, messieurs, mais sans vous affaiblir, accordez-nous au moins les miettes de votre table. Combien de milliers de vos diocésains passent chaque année, aux États-Unis, où ils perdent trop souvent la santé de l'âme et du corps, et sont en outre perdus, non seulement pour votre province, mais encore pour la Dominion, à moins qu'on ne suppose qu'ils préparent l'union du Canada aux États-Unis. Vous et moi, Messieurs, avons d'autres vues et d'autres espérances.\n\nSi seulement depuis dix ans, le quart de ceux de vos diocésains qui ont passé à l'étranger fussent chez nous, nous serions peut-être encore la majorité, ou au moins nous serions une puissante minorité avec laquelle il faudrait compter, et contre laquelle il ne serait pas question de forger des lois d'exception.\n\nOn nous envoie pour peupler ce territoire, pour peupler nos terres, dirai-je avec les sauvages, les Métis et les Canadiens-français auraient même un certain droit à user de cette expression, car ce sont les Canadiens qui ont découvert cette immense contrée, ce sont les Canadiens et les Métis qui l'ont ouverte à la religion, à la colonisation et à la civilisation : on nous envoie, dis-je, pour utiliser nos terres des gens de toute nation, de toute religion, et trop souvent des gens sans foi et sans religion ; on va chercher bien loin des Mennonites, on reçoit même des Mormons qu'on semble vouloir donner comme exemple à nos Pieds-Noirs, et on laisse partir chaque année, une foule de Canadiens honnêtes et laborieux, mais trop pauvres pour venir s'établir ici. Ne trouvez-vous pas, Messieurs, que c'est là un mal sérieux ? Est-ce qu'on ne pourrait pas y trouver un remède ? Puisque notre gouvernement ne semble pas vouloir s'en occuper, il me semble qu'aidés par votre patriotique et dévoué clergé, vos pieux et éclairés et souvent influents laïques, avec la généreuse charité et le concours de tous, vous procureriez à ces braves Canadiens les moyens de venir s'établir convenablement au Nord-Ouest.\n\nVous obtiendrez du gouvernement fédéral et des compagnies de chemins de fer, les moyens de conserver au Canada de bons et honnêtes citoyens, et la province de Québec n'en souffrirait pas, mais se fortifierait en étendant son influence, et protégerait en même temps de pauvres Canadiens qu'on veut sur leurs terres réduire à la condition de parias. Je vous en supplie donc, Eminence et Vénérés Seigneurs, tant en mon nom qu'au nom de mes missionnaires, du parti catholique et français du pays, au nom surtout des intérêts de l'Eglise dans le Nord-Ouest, voyez dans votre sagesse ce que vous pourrez faire, et de grâce, au nom de Dieu, agissez en conséquence :\n\nEn vous demandant pardon de mon importunité, je vous prie Eminece et Révérendissime et Vénérés Seigneurs, de croire au profond respect de votre dévoué et reconnaissant serviteur et frère.\n\nVITAL,\nÉVEQUE DE ST-ALBERT, T.N.O.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001784.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 7150, "total-output-tokens": 3690, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 193, 1], [193, 2422, 2], [2422, 5386, 3], [5386, 9220, 4], [9220, 12620, 5]], "primary_language": ["fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]