[{"id": "18cfe8dd09c81a8ccacc312331d787311f94d5f0", "text": "THE\n\nALBANY SETTLEMENT,\n\nQU'APPELLE VALLEY,\n\nCANADA, N.W.T.\n\nColonial Profits with Home Comforts.\n\nLAND AGENTS IN LONDON:\nMESSRS. ELSWORTH AND KNIGHTON,\n6 EXHIBITION ROAD, SOUTH KENSINGTON.\n\nBANKERS:\nTHE COMMERCIAL BANK OF MANITOBA.\n\nBANK AGENTS IN LONDON:\nMESSRS. BOYLE, CAMPBELL, BUXTON, & Co.,\n80 LOMBARD STREET.\n\nPRICE TWOPENCE.\n\nLONDON:\nGEORGE KENNING,\nTHE FREEMASON PRINTING WORKS, 16 GREAT QUEEN STREET,\nLINCOLN'S-INN-FIELDS, W.C.\n1886.\nA Bird's-eye View of the arrangement proposed for the Albany Settlement is now being Exhibited in the Canadian Section of the Colonial and Indian Exhibition, at South Kensington, near the Agricultural Machinery.\nTHE ALBANY SETTLEMENT,\n\nQU'APPELLE VALLEY, CANADA, N.W.T.\n\nTo those who seek conditions of greater prosperity than now exist in England, and who object to sever themselves from the Imperial Flag, the Albany Settlement offers many advantages. To migrate from the centre of Imperial power, and to break from the ties of Home and kindred, has frequently demanded many heavy sacrifices. These are, however, no longer necessary, for the conditions under which this Settlement has been established mark a new era in the history of emigration work. To enter Canada, is to pass into a region of the most intense loyalty to the Throne, to find there conditions of prosperity which prudently used lead on to happiness and wealth, and yet we are able to enjoy these advantages within the range of an easy and agreeable pleasure trip from the shores of England. The concerted system of settlement which has now to be described was originally proposed by Professor Tanner, of South Kensington, London, who, with an extended knowledge of the Canadian North-West, selected this location as being that which is best adapted for carrying his plan into successful operation. The general objects which are sought to be gained under this concerted settlement are:\n\nFirst.—Securing to each and every family opportunities for the observance of the Sabbath, educational advantages for the young, medical care, facilities for the sale of farm produce, and for the purchase of household requirements.\n\nSecondly.—Making provision for social intercourse, neighbourly co-operation, and the grouping of friends.\n\nThirdly.—Facilities for securing more or less land according to the varying requirements of different individuals, whether it be the workman who desires to have his 3 or 4 acres, or the farmer who prefers 640 acres, or those who wish for intermediate quantities for agreeable residences, or for profitable occupation.\n\nBefore the lands in the Canadian North-West had been surveyed and mapped by the Dominion Government surveyors, an arrangement was made whereby the Qu'Appelle Valley Farming Company should select 100 square miles of the best wheat-growing land of the district, in one solid block. Through the centre of this\nland the Canadian Pacific Railway had to pass, and a station had to be constructed upon the property so secured. The selection was very ably made by Major Bell, and the lands which were chosen represent some of the richest agricultural soils in the district. It will be seen from the following quotations made from the reports of some well-known visitors, that these lands have been greatly improved for colonisation purposes. The time has now come when the preliminary operations are sufficiently advanced to enable these lands to be utilised advantageously for settlement purposes, and the owners have approved of Professor Tanner's plan for the establishment of the Albany Settlement, under conditions which it is hoped may even render it in some degree worthy of the great and honoured name by which it is to be distinguished.\n\nMuch of the soil of the Settlement is a rich dark loam, resting upon a clay subsoil. It is easily worked, and has been proved to possess the properties requisite for the production of wheat and other cereals in their highest perfection. Root crops are cultivated with very great success, and of the highest feeding character, and the grasses are of exceptionally good quality. The climate is extremely healthy for all kinds of farm stock, and they are profitably kept with very little trouble. A reference to the map of the Settlement shows that the Canadian Pacific Railroad—the future Imperial highway from Great Britain to India, Australia, and the East—passes through the lands of the Settlement. The station of Indian Head is fully three miles within its eastern boundary, whilst the station of Qu'Appelle is about two miles beyond the western boundary. The Albany Agricultural College is situated about half-a-mile from Indian Head station, and there also the Corn Elevator and Steam Corn Mills belonging to the Bell Farm are in full operation. The town of Indian Head is steadily becoming more important in its character. It has a church, school, stores, and hotels, &c. A Masonic lodge is also being established there. Around Qu'Appelle station is a still more important town, possessing many of these conveniences in a fuller degree. It is intended to establish a village centre somewhere about midway between Qu'Appelle and Indian Head, so that the northern portions of the Settlement may also secure the great advantages of church services, schools, stores, &c. At this point it is intended to give facilities for establishing a village hospital under efficient medical care, and to secure locations for tradesmen and workmen. Application has been made for giving to this Settlement special municipal powers, and its own magisterial authority. The telephone, which has already been established on the Bell Farm, will no doubt be\nestablished throughout the Settlement, so that by its aid conversations may be held between the various residences, and also along the line of railway. Amusements will depend upon the taste of different individuals. In the autumn the sportsman will find on water, and on the land, ample diversion. Small game, such as wild fowl, including all varieties of geese, the mallard, red head, pintail, canvas back, blue bill, and other duck abound in the neighbourhood. Prairie chicken are abundant, whilst antelope, moose, and cariboo are obtainable without much difficulty. Salmon fishing in British Columbia and the lake fishing of the district are exceptionally fine. During the winter months there is the sleigh drive to the neighbour, and the dance at night, the snow-shoe tramp, and the toboggan slide down the steep incline. Music never fails, whilst whist and crib maintain their full sway. Life in the North-West is essentially social, and the exuberant spirits arising from redundant animal vigour find no end of amusement on all sides. The chief duty of the farmer during the winter is limited to the sale and delivery of his wheat, and to the care of his live stock; the latter, however, require only ordinary oversight and food supplies—open shedding, some hay stacks, and a water supply being all the requirements which are needed to supplement the strong nourishing grasses of the prairie pasturage. Under such conditions, cattle, horses, and sheep enjoy the perfection of health, and cause no anxiety to the owner. The live stock may therefore be safely entrusted to the farm servants, with the occasional oversight of a neighbour, should the proprietor desire to pay a visit to the Carnival scenes in Montreal, or to trip across to spend his Christmas in the old country. The profits from a farm of 400 or 500 acres permit of a yearly trip into the more active centres of life in Eastern Canada, and justify an occasional visit to England. The local advantages of the Albany Settlement will go far to render such changes of scene purely optional, and the Albany Agricultural College within the Settlement, as well as St. John's College, established six miles off by the Right Rev. Dr. Anson, Bishop of Qu'Appelle, will advance the educational and social advantages of the neighbourhood. In the city of Winnipeg there are Universities and Colleges for male and female students, and degrees in Medicine, Science, Art, and Theology are conferred upon those worthy of such distinctions. One-eighteenth of all lands in the North-West have been set aside for elementary school purposes.\n\nThe knowledge of farm practice, which is actually necessary for securing successful results in the North-West, may soon be\nacquired. Experience and practical skill are just as valuable here as elsewhere, and naturally command still higher success, but for the ordinary course of farming, the surrounding conditions of a fertile soil and a favourable climate make the cultivation of the land, a pleasant and easily profitable occupation. Although it is desirable that every farmer should have some knowledge of farm work, it is an error to think that the master should personally devote himself to the daily labours of the farm. If the master's eye, and his powers of thought, are not of more value than a dollar-a-day workman, it indicates but a small measure of ability on the master's part for successful management. There will be cases in which the farmer will prefer taking his regular position amongst his workmen, but such a limitation of his control will rarely prove to be judicious. The opposite policy of neglect and indifference would be a still greater error. The happy medium line, by which master and helpers properly discharge their respective duties, is beyond doubt the wisest and the best.\n\nGenerally speaking, it may be said that in addition to the obvious advantages arising from the selection of fertile land in a good climate, and with excellent railway accommodation, this Settlement offers the opportunity for a renewed grouping of old friends, and for securing a bright and happy social intercourse. Under such conditions Colonial life may be rendered brighter even than those existing in England, for the happiness of the home circle may be intensified by prosperity in the business affairs of life.\n\nThe advantages to be secured are:\n\n- Fertile lands at a cheap rate, and near a good railway.\n- Grouping of friends for mutual help and agreeable association.\n- Churches, schools, stores, medical care.\n- An Agricultural College, and experimental research.\n- Profitable farming and the pleasures of sport.\n\nTERMS AND CONDITIONS FOR THE SALE OF LAND.\n\nTitle.—The Qu'Appelle Valley Farming Company (Limited) hold title from the Crown, the Canadian Pacific Railway Company, and the Hudson's Bay Company direct, and will grant a deed in fee simple.\n\nPrice.—The price of each section is given in the schedule opposite its number, and applies to the whole or any even portion thereof—a half or a quarter—and includes ten per cent. of the land ploughed and prepared for seeding operations. It is only fair to state that before the details of Professor Tanner's concerted settle-\nment were made known to the Company, prices were at his request affixed to the several sections of land. These prices were determined according to the respective qualities of the soil, and with due regard to the expenditure for buildings and tillages which had been made. This was done in order that those who settled upon the land should secure for themselves the improved value which must arise from their occupation of the property under a well regulated system.\n\nTerms.—Except, as hereinafter mentioned, one-third to one-fifth of the purchase-money is required in cash; the balance may be paid at such stated annual periods, not extending over more than five years, as the purchaser may elect, to be secured by a mortgage on the land, bearing six per cent. interest payable with each instalment. If any purchaser is desirous of decreasing the amount of \"cash down\" for one or two years, he may pay one-tenth portion of the purchase-money and enter into an agreement to make substantial improvements in the way of buildings, &c. The Company will agree for title on the first payment being made, taking security as before. The whole time, however, not to extend beyond five years, and interest on the unpaid purchase-money to run from date of agreement, and be payable yearly.\n\nAdvantages.—(a) The land surrounds and is in the immediate vicinity of the Bell Farm, where the latest and best machinery and implements are employed, and the best mode of cultivation adopted.\n\n(b) Instruction will be freely and fully imparted to purchasers, or their foremen on request, by the General Manager or his deputy, and a general supervision given for one year free of charge.\n\n(c) Purchasers may have their buildings erected at the lowest possible price under the inspection of the General Manager, who will take every care that the moneys placed in his hands for expenditure in that direction will be laid out to the best advantage. This obviates any fear of imposition, or extortionate charges for work or material.\n\n(d) All implements, machinery, or stock, may be purchased through the General Manager at the very favourable prices paid by the proprietors, a saving of generally 25 to 40 per cent. from the ordinary purchases of the general farmer. He will also place at the disposal of the purchaser the latest crop quotations and advise as to sales.\n\n(e) Purchasers desirous of locating near each other for company sake and social intercourse, have the opportunity of acquiring lands adjoining each other.\n(f) The lands are within a range of six miles from Qu'Appelle or Indian Head. At the latter station the Company have erected and have in operation a first-class full roller process, steam flouring mill, and an elevator, thereby offering, at all times, every facility for the purchase of breadstuffs and food, and for marketing or shipping grain or stock.\n\n(g) The towns of Qu'Appelle and Indian Head are provided with postal facilities, general stores of dry goods, groceries, hardware, furniture, and other shops where all kinds of necessaries, and many of the luxuries of life may be had at reasonable prices. All the various implement factories are represented.\n\n(h) Ten per cent. of the land purchased being prepared for cropping—included in the purchase as before-mentioned—gives the incomer an early start, and he is thereby freed from a great deal of the worry, labour and expense of the first season's residence.\n\n(i) The lands are suitable either for grain growing or stock raising, or for both, according as purchasers may prefer.\n\n### SCHEDULE OF LANDS.\n\n(WEST OF SECOND MERIDIAN.)\n\n| Township | Range | Section | Acres | Price per Acre | Remarks |\n|----------|-------|---------|-------|----------------|---------|\n|          |       |         |       | £ s. d.        |         |\n| 18       | 12    | 5       | 640   | 1 13 6         | Unbroken. |\n| \"        | \"     | 6       | 640   | 1 13 6         | \"       |\n| \"        | \"     | 7       | 640   | 3 3 0          | Cultivated. |\n| \"        | \"     | 8       | 640   | 3 3 0          | \"       |\n| \"        | \"     | 9       | 640   | 4 4 0          | \"       |\n| \"        | \"     | 17      | 640   | 4 4 0          | \"       |\n| \"        | \"     | 18      | 640   | 3 3 0          | Adjoins Indian Head Station. |\n| \"        | \"     | 20      | 640   | 4 4 0          | Cultivated and Buildings. |\n| \"        | \"     | 21      | 640   | 4 4 0          | \"       |\n| \"        | \"     | 32      | 640½  | 4 4 0          | \"       |\n| \"        | \"     | 33      | 637   | 4 4 0          | Part cultivated. |\n| \"        | 13    | 1       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 2       | 640   | 1 10 0         | Unbroken. |\n| \"        | \"     | 3       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 4       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 5       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 6       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 7       | 640   | 1 10 0         | \"       |\n| \"        | \"     | 9       | 640   | 1 13 6         | \"       |\n| \"        | \"     | 10      | 640   | 1 17 6         | \"       |\n| \"        | \"     | 12      | 640   | 3 3 0          | Partly cultivated and a house. |\n| \"        | \"     | 13      | 640   | 4 4 0          | Cultivated. |\n| \"        | \"     | 14      | 640   | 3 3 0          | \"       |\n| \"        | \"     | 15      | 640   | 1 17 6         | Unbroken. |\n| \"        | \"     | 16      | 640   | 1 13 6         | \"       |\n## Schedule of Lands—continued.\n\n| Township | Range | Section | Acres | Price per Acre | Remarks |\n|-----------|-------|---------|-------|----------------|---------|\n|           |       |         |       | £ s. d.        |         |\n| 18        | 13    | 17      | 640   | 1 5 0          | Unbroken. |\n|           |       | 18      | 640   | 1 5 0          |         |\n|           |       | 19      | 640   | 1 5 0          |         |\n|           |       | 20      | 640   | 1 10 0         |         |\n|           |       | 21      | 640   | 1 17 6         | About 50 acres broken. |\n|           |       | 22      | 640   | 3 3 0          | Cultivated. |\n|           |       | 23      | 640   | 4 12 0         | Cultivated and buildings. |\n|           |       | 27      | 640   | 3 15 0         | Cultivated. |\n|           |       | 28      | 640   | 1 17 6         | Unbroken. |\n|           |       | 30      | 640   | 1 5 0          |         |\n|           |       | 31      | 646   | 1 5 0          |         |\n|           |       | 33      | 643   | 1 13 6         |         |\n|           |       | 34      | 642   | 2 2 0          |         |\n|           |       | 14      | 640   | 1 13 6         |         |\n|           |       | 12      | 640   | 1 5 0          |         |\n|           |       | 24      | 640   | 1 5 0          |         |\n|           |       | 36      | 645½  | 1 5 0          |         |\n| 19A       | 12    | 7       | 231   | 3 3 0          | Partly cultivated. |\n|           |       | 9       | 235   | 3 3 0          |         |\n|           |       | 5       | 640   | 4 4 0          |         |\n|           |       | 6       | 650   | 4 4 0          |         |\n| 19        |       | 6       | 565½  | 3 3 0          |         |\n|           |       | 7       | 565   | 3 3 0          |         |\n|           |       | 8       | 640   | 3 3 0          |         |\n|           |       | 9       | 640   | 3 3 0          |         |\n|           |       | 17      | 640   | 2 10 0         |         |\n|           |       | 13      | 711   | 4 4 0          | Cultivated and houses. |\n|           |       | 2       | 644   | 2 10 0         | Cultivated. |\n|           |       | 3       | 643   | 2 2 0          |         |\n|           |       | 5       | 648   | 1 13 6         | Unbroken. |\n|           |       | 6       | 644   | 1 13 6         |         |\n|           |       | 7       | 640   | 1 13 6         |         |\n|           |       | 9       | 640   | 1 13 6         |         |\n|           |       | 10      | 640   | 2 10 0         | Partly cultivated. |\n|           |       | 12      | 587½  | 2 10 0         |         |\n|           |       | 13      | 448   | 3 3 0          |         |\n|           |       | 14      | 640   | 3 3 0          |         |\n|           |       | 15      | 640   | 2 10 0         |         |\n|           |       | 16      | 640   | 2 10 0         |         |\n|           |       | 17      | 640   | 2 10 0         |         |\n|           |       | 18      | 640   | 1 5 0          | Unbroken. |\n|           |       | 19      | 640   | 1 5 0          |         |\n|           |       | 20      | 640   | 1 5 0          |         |\n|           |       | 21      | 640   | 2 10 0         | Partly cultivated. |\n|           |       | 22      | 640   | 2 10 0         |         |\n|           |       | 23      | 640   | 2 10 0         |         |\n|           |       | 24      | 448   | 2 10 0         |         |\n|           |       | 14      | 640   | 1 5 0          | Unbroken. |\n|           |       | 13      | 640   | 1 5 0          |         |\n|           |       | 24      | 320   | 1 5 0          |         |\n\nThe London Land Agents, Messrs. Elsworth and Knighton, 6 Exhibition Road, South Kensington, will be pleased to facilitate an inspection of the property by any intending purchasers.\nQUOTATIONS FROM VARIOUS REPORTS UPON\nTHE BELL FARM,\nQU'APPELLE VALLEY, CANADA, N.W.T.\n\nFrom \"Canadian Pictures,\" by the Marquis of Lorne, K.T.\n\nTHE BELL FARM (quoted from a letter dated 1883).\n\n\"The dwelling house, or head-quarters of the farm, stands about a mile and a half from the railroad. It is a plain substantial building of stone. Surrounding it are a granary and store house, a large stone stable for horses, a blacksmith's shop, a shed for cattle, &c. The granary and store house are capable of holding 30,000 bushels of wheat, besides all the stores and implements for the use of the farm. In one compartment alone of this granary there were 8000 bushels (and then it was not half full) of the finest Fyfe wheat, yellow and pure as gold, without dirt or weed seeds of any kind. This year (1883) when the harvest has been in-gathered there will be 30,000 bushels of the same. The yield of oats will be 70,000 bushels—all the produce of 3000 acres of land this year. There are twenty-six self-binder reaping machines on the farm, and and it is a sight worth beholding, all these machines marching by, as if in battle array, attacking the standing grain, laying it low, gathering it into sheaves, binding it, and then casting it on the ground without a single mishap or failure. They have fifty sulky ploughs, each plough is required to travel twenty miles a day, and then its work is done. Two steam engines are now at constant work; eighty-seven men are employed; there are forty stations on the farm, ninety-nine working horses are owned and sixty head of milch cows . . . . Let me, however, before concluding say a word or two about some samples of grain that Major Bell has been collecting on the farm. One of them is a sample of oats, the product of one single germ seed. It is composed of thirty stalks, more like young canes than oat stalks. It is estimated that there are 10,000 seeds of grain on these stalks. Another is a sample of soft wheat—Red River variety. There are thirty stalks and 1,200 seeds of grain attached to them. A third sample has eighty-three heads of the Fyfe variety, containing 3000 pickles of the finest wheat. The Yankees boast that they can beat all creation, but here is something in the North-West that can beat the Yankees.\"\nFrom \"Successful Emigration,\" by Professor Tanner:\n\nTHE BELL FARM (August 1884.)\n\nHowever striking a visit to this farm may be to a stranger, I am free to confess that its magnitude impresses the mind still more fully during subsequent inspections. It is very difficult to realize clearly on the mind what it is to drive for twenty miles through crops of wheat, oats, and flax, extending as far as the eye can reach. One piece of wheat we carefully examined measured 1500 acres. It had been sown in two days, and at the time of my visit much of it carried thirty-five bushels per acre of magnificent wheat, which under the bright Canadian sun waved like a golden sea. The working power on the farm consisted of 180 horses and 130 men, these, with 50 self-binding reapers, represented a power to cut, bind, and stock 800 acres per day, each binder cutting 16 acres daily. This power is so arranged that within twelve days the whole of the wheat and oats can be cut, and the spring sowing of the wheat and oats was also arranged so that it could be completed in ten days. It appears almost fabulous to talk of 800 or 1000 acres of wheat being sown on a single day, and yet this only represents what was done on this farm in the spring of 1884. Every farmer will see the great advantages which must result from the spring sowing being promptly completed. There is one level start, the growth is even throughout, and the ripening is likely to follow with equal regularity.\n\nWe drove out to see the hay-making arrangements, which were being carried on whilst they were waiting for the corn to be ready for harvesting, and here we found from 1200 to 1400 tons of hay being secured. Here, again, the work was simplicity itself, for the natural grass of certain parts of the unbroken prairie having been cut by mowing machines, was allowed to lie on the surface—on the average four or five hours—and then the horse rakes gathered it for the men to load on the waggons and send to the stack. In making the hay-ricks, care was taken to shape the top into a roof-like form, which would throw off the rain without the expense of thatching. A small loss is occasionally made consequent upon defective protection, but that loss is unworthy of consideration in comparison with the large expenditure for thatching, which is avoided.\n\nIn the regulation of this great undertaking, there is a rigid discipline observed. An order being given, it must be performed, for its neglect entails dismissal. Without this—almost military—regularity, confusion would soon reign, and good management\nwould be an impossibility. Major Bell, from day to day, inspects the operations going on upon the farm, and is now aided by one general foreman and four foremen of sections. At eight o'clock in the evening all gather to the telephone, which extends from Major Bell's residence into each of the four sections of the farm. The orders are then given to each sectional foreman, in the hearing of the others. Any doubt is at once cleared up, and all retire to rest subsequently with full instructions for the morrow. No change is permitted without authority from headquarters, which, by the aid of the telephone, is always obtainable, in case of necessity, by night or day.\n\nThe colonisation scheme now being carried out by Major Bell possesses one marked peculiarity, for the area of the farm represents 64,000 acres, or 100 square miles, the whole of which lies within its own continuous boundary. There is no intervening land, except one square mile given up for the town of Indian Head, and for the line of railway which passes through the centre of the farm. In May, 1882, Major Bell had free scope for the selection of this unbroken block of land. It was then 200 miles from the nearest railway station. It is a curious fact, illustrative of the rapid development of the Canadian North-West, that his men and teams, with their various requirements for establishing themselves on the selected lands, took five weeks in journeying from Brandon to their destination; and yet within one month of their arrival there, Major Bell went back to Winnipeg in a sleeping car on the Canadian Pacific Railway.\n\nFrom \"Canada and through it,\" by Professor Sheldon.\n\nTHE BELL FARM (Sept. 1884).\n\n\"Though the farm was started only in the spring of 1882 there were this year some 7000 acres under crop in wheat, oats, and flax. From 190 to 200 horses were on the farm, and these are reaping the grain, and would plough 14,000 acres for the crops of 1885. So soon as the harvest is cut, the threshing machines, driven by straw burning engines, are set to work. At convenient centres about the farm, wooden granaries are erected, and to each of these two threshers are appointed, one on either side, until the granary is full of grain. We saw eight of these threshers, so that four granaries were being filled simultaneously, and the machines move from one to another till all the granaries are filled and the threshing is over. Red Fyfe wheat is the only variety grown, and the seed produced on the farm is used. The growing crops as we saw them certainly\npromised to yield Major Bell's estimate of 20 to 25 bushels an acre of wheat, and on some parts of the land we saw what I should estimate as a yield of 40 bushels. The stems tiller out to an extent I have not elsewhere seen, and I have by me a root, plucked by myself, from which 31 stems spring. I might have found a still more prolific root if I had searched, no doubt.\"\n\nFrom \"Canadian Agriculture,\" by Professor Fream.\n\n\"My visit to the Bell Farm was made on September 14th, 1884. Major Bell, who was exceedingly kind, gave Sir Richard Temple, Professor Sheldon, and myself seats in his waggonette, and obligingly answered the many questions we showered upon him during our tour of inspection. The soil of the Bell Farm is a rich, deep, black loam, with a clay sub-soil. A three-horse team and a sulky plough, working on a 16 inch furrow, and set to a depth of three inches can turn up two acres a day, at a cost of eight shillings per acre. At the time of my visit about 200 horses were being maintained, and all that were not engaged in the harvest work were employed in ploughing. The cost of a good cart horse, weighing 1400 pounds, ranges from £37 to £40. In summer 135 men are employed, and in winter about half this number; but of course as the acreage under crop is year by year enlarged, the number of labourers must correspondingly increase. There were 500 acres of oats ready for cutting; they would yield from 50 to 60 bushels per acre, and are largely used for feeding the horses. A 400 acre field of flax was nearly ripe; it was being grown for its seed, which would sell for three shillings per bushel and the land would go into wheat. Last summer 1400 tons of prairie hay were gathered in; the natural herbage of the prairie is cut by mowing machines, allowed to remain exposed for about six hours, then horse raked, laden on waggons, and stacked. About sixty cows and a few pigs are kept. A good example is being set on the Bell Farm in the planting of trees, some were planted in 1883, and last spring 25 miles of young poplars were set out.\"\n\nFrom \"The Canadian North-West,\" by Professor Tanner.\n\nTHE BELL FARM COLONISATION SYSTEM (August, 1885).\n\n\"The Bell Farm, which is situated in the Qu'appelle district, has attracted much attention by reason of the large extent of land which it contains—about 64,000 acres. It has also received much consideration because of the magnitude and excellence of its tillage...\"\noperations. It is, however, desirable to state that these points of detail are simply incidental to the carrying out of a definite colonisation scheme. In my Report issued in 1883 this system was explained somewhat in detail, and I quote from it the following remarks—\"I have now to report upon a colonisation scheme in which the work is being carried out by a company having the command of a large capital. The general scheme is to bring the land into cultivation, dividing it into 300 farms, each having a comfortable residence, with stabling and shedding enough for its stock. When this has been accomplished, these farms, with the stock and implements upon each, will be fairly valued, and the men who helped to carry out the improvements will each have the offer of his own farm at a valuation price, he paying for the same by a series of annual instalments. In the meantime each man receives wages, and he has his house and one acre of garden ground rent free.\" This colonisation scheme has much to commend it to our consideration, but modifications might be very advantageously introduced whereby gentlemen having some little capital to invest, may also be comfortably settled upon small farms. They might thus establish an agreeable association with other families near, of similar type and character, whilst the produce from their lands—aided by the game and fish of the district around—would practically maintain their households in comfort.\n\nThe discussions which have arisen as regards the relative advantages of large and small farms are somewhat beside the mark, except so far as they render the preparation of the land for colonisation purposes more or less economical. Major Bell is steadily advancing the arrangement for the development of the colonisation scheme, and the systematic operations upon the cultivated portions will greatly favour its success. The rate of wages has again fallen this last season, not only upon this farm, but generally throughout Canada, and its important influence upon the introduction of capital, can only be beneficial. If a capitalist has to pay an unreasonable rate of wages, it naturally checks his success in business. For a time very high wages were paid, and often for an inferior class of workmen, but happily this is now altered. Liberal wages can still be secured by men who are capable of doing good work. Their prosperity in life is far more satisfactorily advanced by moderate wages, with some land of their own on which a cow, pigs, and poultry can be kept, rather than by excessive wages, which check the outlay of capital.\"\nFrom \"Successful Emigration,\" by Professor Tanner.\n\n\"Through the kindness of Major W. R. Bell, of The Bell Farm, whose knowledge of the Canadian North-West ranks very high, I have been supplied with his statement of the expenditure which may be advantageously made by a gentleman in occupying 200 acres of good land, assuming that 50 acres are brought under crop in the first year, 140 acres in the second, and 190 acres in the third year.\"\n\n### Expenditure in First Year\n\n| Item                                      | £   s. d. |\n|-------------------------------------------|---------|\n| 3 Horses and Harness                      | 120 0 0 |\n| Hand Plough                               | 5 0 0   |\n| Harrow                                    | 7 0 0   |\n| Waggon                                    | 16 0 0  |\n| Seeder                                    | 10 0 0  |\n| Self-binding Reaper                       | 50 0 0  |\n| Buckboard                                 | 10 0 0  |\n| Sleigh                                    | 7 0 0   |\n| Cow                                       | 14 0 0  |\n| Labour—1 Man 1 Year                       | 60 0 0  |\n| Extra Man Harvest, 2 months               | 12 0 0  |\n| 60 Bushels Seed, Wheat (40 acres)         | 15 0 0  |\n| 25 Oats (9 acres)                         | 2 0 0   |\n| Potatoes for Planting, 1 acre             | 2 8 0   |\n| Threshing 1500 Bushels                    | 15 0 0  |\n| Oats and Hay for Horses                   | 20 0 0  |\n\nTotal: **£365 8 0**\n\nCottage and Farm Buildings: **£300 0 0**\n\nTotal: **£665 8 0**\n\n### Expenditure in Second Year\n\n| Item                                      | £   s. d. |\n|-------------------------------------------|---------|\n| Labour—1 Man and 1 Boy                    | 84 0 0  |\n| Extra Man, 6 months                       | 36 0 0  |\n| 200 Bushels Seed Wheat, at 80 cents. per Bushel | 32 0 0  |\n| Seed Oats and Feed Oats                  | 36 0 0  |\n| Hay                                       | 15 0 0  |\n| Threshing 4,000 Bushels, at 5 cents. per Bushel | 40 0 0  |\n| Twine for Binder                          | 7 0 0   |\n| Contingencies                             | 20 0 0  |\n\nTotal: **£270 0 0**\n\n### Expenditure in Third Year\n\n| Item                                      | £   s. d. |\n|-------------------------------------------|---------|\n| Outlay as in Second Year                  | 270 0 0 |\n| Extra Cost of Threshing                   | 12 8 0  |\n\nTotal: **£282 8 0**\nWe may now bring these statements of expenditure into contrast with the receipts for the same period, and show the amount of capital required, assuming the whole of the labour is performed by hired workmen.\n\n| Expenditure | Capital Required | Value of Crops |\n|-------------|-----------------|---------------|\n| **First Year:** | | |\n| As per statement | £665 8 0 | £665 8 0 | First Year: |\n| | | | 40 acres wheat | £160 0 0 |\n| | | | 9 acres oats ... | £36 0 0 |\n| **Second Year:** | | |\n| As per statement | £270 0 0 | | Second Year: |\n| Loss cash from first crop | £196 0 0 | | 140 acres wheat | £560 0 0 |\n| | | | 10 acres oats ... | £40 0 0 |\n| **Third Year:** | | |\n| As per statement | £282 8 0 | | Third Year: |\n| Cash from second crop | £600 0 0 | | 190 acres wheat | £760 0 0 |\n| | | | 10 acres oats ... | £40 0 0 |\n| Excess on the year | £317 12 0 | | |\n| Value of third crop | £800 0 0 | | |\n| Receipts over expenditure | £1117 12 0 | | |\n| | | | |\n\nMajor Bell calculates that after the third year, although the capital invested upon the farm has been re-paid, the annual receipts and expenditure may be calculated upon as in the third year, showing a clear annual profit of over £500. But whilst showing the advantages of having a full amount of capital, we must avoid throwing the least discouragement upon men having smaller sums at their disposal. These persons are bound to take a longer time in attaining the same result. In the cases named we have seen the accumulation of profits soon making the receipts greater than the expenditure. Such results are quickly gained, because all the arrangements are thoroughly complete. If the arrangements are less perfectly organised, proportionately more time has to be given for securing any given result. There is, however, one great satisfaction—for if the desired results be delayed, matters roll on comfortably in the interval, and if some patience has to be exercised, it is not demanded under trying circumstances.\"\nThe Albany Agricultural College\n\nON THE BELL FARM,\n\nQU'APPELLE VALLEY, CANADIAN NORTH-WEST.\n\nIt has long been recognised as most desirable for gentlemen who intend to settle in Canada, that facilities should be within their command whereby a good general knowledge of the most successful systems of farm practice may be obtained without their having to cast aside the comforts of an English home. Success, however, demands a far broader knowledge than the best agricultural experience. The conditions of life differ so greatly from those common in England, that if a person would be successful in business, and also thoroughly enjoy \"Life in Canada,\" he must adapt himself to such a prudent course of procedure, as experience has proved to be best suited to the district in which he proposes to settle. The want of such opportunities has caused many a failure amongst young English Capitalists, who by such aid might have become wealthy and prosperous. The establishment of The Albany Agricultural College affords an opportunity for securing these important results.\n\nAny further particulars may be obtained on written application to Professor Tanner, Institute of Agriculture, South Kensington, London.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001565.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 29520, "total-output-tokens": 10160, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 444, 1], [444, 656, 2], [656, 2866, 3], [2866, 5638, 4], [5638, 8354, 5], [8354, 10828, 6], [10828, 13330, 7], [13330, 16357, 8], [16357, 20225, 9], [20225, 20225, 10], [20225, 20225, 11], [20225, 22497, 12], [22497, 25066, 13], [25066, 27604, 14], [27604, 30041, 15], [30041, 32631, 16], [32631, 35104, 17], [35104, 37085, 18], [37085, 37085, 19], [37085, 38288, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, true, true, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, true, false]}}]