[{"id": "0c4963ff50e80c1a34385c642c21abd1d89eda79", "text": "DISCOURS\n\nPRONONCÉ PAR\n\nL'HONORABLE M. MERCIER\n\nDéputé de St-Hyacinthe et chef de l'Opposition.\n\nL'Assemblée Législative de Québec\n\nLE\n\n7 MAI 1886\n\nSUR LA QUESTION RIEL\n\nQUEBEC\nIMPRIMERIE DE L'ELECTEUR\n1886\nDISCOURS\nPRONONCÉ PAR\nL'HON. M. MERCIER\nDéputé de St-Hyacinthe et chef de l'Opposition\nÀ l'Assemblée Législative de Québec, le 7 mai 1886\nSUR LA QUESTION RIEL\n\nM. l'Orateur,\n\nMalgré l'heure très avancée de la nuit, je vais essayer de répondre de suite aux observations qui visent d'être faites par le Procureur général, afin de terminer cette discussion pendant cette séance et de remplir ma promesse de l'autre jour, en prenant le vote cette nuit même.\n\nDÉCEPTION\n\nJe ne cacherais pas, monsieur, la pénible impression qu'a produite chez moi le débat actuel. Je croyais que l'assemblée législative de la province de Québec représentait avant tout une population française et catholique ; je croyais que les auteurs de la Confédération, ceux qui ont fait pour nous ce pacte fédéral, avaient eu au moins la prudence de nous réserver dans le Canada qu'il s'agissait de créer, un asile où pourraient se réunir quelquefois, sans danger et sans menace, les amis de notre nationalité, un asile sacré au sein duquel nous pourrions, à l'ombre protectrice de la nouvelle constitution, parler français et exprimer des sentiments français.\n\nOui, on nous le disait en 1865 : \"La province de Québec restera française et placée au centre de la confédération, dont elle sera le cœur, elle pourra défendre les français dissimulés d'une extrémité à l'autre du pays, et si jamais un des siens est persécuté dans le coin le plus reculé de ce grand pays, elle pourra faire entendre sa voix puissante et écraser l'opresseur.\"\n\nINQUIÈTÉS\n\nNous avions nos inquiétudes, et nous les manifestions hautement.\n\nOn nous répondait : \"Pourquoi craignez-vous descendants des Français ? Aujourd'hui vous êtes noyés dans une province qu'on appelle la province du Canada ; vous êtes faibles dans une union législative ; vous êtes soixante-cinq du Bas-Canada contre soixante-cinq du Haut Canada, et encore, sur les soixante-cinq de votre province, il y en a vingt qui ne parlent pas votre langue, qui ne professent pas votre religion ; mais nous allons vous donner une assemblée...\"\n\"ionale au sein de cette belle province,\n\"une assemblée nationale qui serait de par\n\"la loi et de par la constitution, la vé-\n\"ritable représentation du sentiment\n\"français et du sentiment catholique.\"\nOn ajoutait : \"Dans cette assem-\nblée, vous pourrez, avec succès,\ndéfendre vos institutions ; vous n'y en\ntendrez parler que le langage du\npatriotisme de vos pères et vous ne\nserez pas exposés à vous heurter, à\nchaque instant, contre le fanatisme des\norangistes ou des sectes protestantes !\"\n\"Vous serez chez vous enfin !\" (Applau-\ndissements).\n\nM. l'Orateur, j'étais un de ceux qui\nexprimaient des craintes, j'étais un de\nceux qui croyaient que cette confédéra-\ntion, destinée à garantir nos institu-\ntions, à garantir notre langue et nos lois\net tout ce que nous avons de plus cher\net de plus sacré, que cette confédéra-\ntion tuerait nos dernières espérances,\ndétruirait nos dernières illusions.\n\nPoussé par ces craintes, j'ai laissé le\nparti conservateur avec lequel je m'é-\ntais identifié dans mes jeunes années et\navec lequel je pensais mourir. Ça été\nune des grandes tristesses de ma vie.\nJ'ai abandonné des chefs pour lesquels\nj'avais du respect, et je les abandon-\nnais parce que je croyais dans mon âme\net conscience, que cette confédération\nqu'on disait devoir nous garantir notre\navenir national n'était qu'un piège que\nl'on tendait à notre ignorance des affaires\npolitiques, à notre ignorance du fanatisme de certains hommes de la politi-\nque canadienne. (Ecoutez.) Quand\nje parlais de mes inquiétudes patrio-\ntiques, on cherchait à me retenir en me\nrassurant et l'on me disait : \"Pour-\nquoi craindriez-vous ? Nous allons met-\ntre notre assemblée nationale dans la\nvieille capitale de la Nouvelle France,\ndans la vieille cité de Champlain et\nlà, cette assemblée, asile vénéré des\ngrandes choses du passé, sera protégée\npar les souvenirs des ancêtres, l'Abra-\nham et de Ste Foye ; oyez et ne in-\nquiétez, nos enfants n'entendront à\nl'ombre de tous ces grands souvenirs,\nque des paroles de patriotisme, et ja-\nmais des paroles de trahison !\" (Ap-\nplaudissements.)\n\nHélas ! monsieur, si j'en juge par les\ndébats qui se font depuis dix jours,\nnous avons été bien trompés, nous\navons été bien trahis ! Où nous pro-\nmettait alors la liberté, et aujourd'hui\non nous refuse la liberté la plus sa-\ngrée de toutes, celle de défendre le faible\net l'opprimé. On nous disait alors que\nnotre nationalité serait entourée de tout\nles protections possibles, et aujourd'hui\nle Procureur général nous dit :\n\"Épouvez la voix de votre patriotisme\net taisez-vous ; vos ennemis sont là qui\nvous écoutent et leur haine vous serait\n\"fatale !\" (Honte ! Honte !)\n\"Oni ; honte à ceux qui sont assez lâches\npour nous tenir un semblable langage !\nOni ! honte à ceux qui nous supplient\nde nous taire, de peur de soulever le\nfanatisme des ennemis de notre na-\ntionalité !\"\n\nOù est donc ce patriotisme des\ngrands jours d'autrefois ? Où sont donc\nles traditions du parti conservateur\nqu'on nous a toujours représenté comme\nle véritable parti national ? Quelle hu-\nmiliation, Monsieur, pour deux millions\nde Français ! Le Procureur général\nnous dit : \"N'intervenons pas de peur\nde nuire aux enfants de notre race !\" Et\nlà-bas, à Ottawa, les ministres fédé-\nraux chargés de nous représenter di-\nsaient : \"Ne résignons pas, fear nous\nperdrons nos portefeuilles !\" (Ap-\nplaudissements) C'est-à-dire qu'ici on\nnous dit : \"Ne défendez pas vos natio-\nnaux de peur que le fanatisme ne vous\n\"écrase\" ; et là-bas on disait : \"Lais-\nsons le fanatisme écraser nos natio-\nnaux, de peur de perdre nos porte-\nfeuilles !\" (Ecoutez, écoutez.)\n\nJe proteste au nom du peuple cana-\ndien-français contre cet avilissement na-\ntional qui humilié tous les hommes de\ncœur. Et ma protestation est l'expres-\nsion fidèle des sentiments de tout le peu-\nple, au, seulement, des libéraux, mais\nencore de la grande majorité des conservateurs. Tous seront profondément blessés de la chute dont nous sommes témoins ce soir ; cette blessure, faite au cœur de notre race, saignera longtemps, bien longtemps.\n\nINJURES AUX LIBÉRAUX\n\nLes résolutions patriotiques qui ont été soumises à cette Chambre, et que j'appuie, avec mes amis, ont soulevé une tempête d'indignation ; on a traité les libéraux d'hypocrites ; on a affirmé que nous voulions arriver au pouvoir en passant sur le cadavre de Louis Riel. Mais le Procureur général, qui s'est fait l'écho de ces injures, ignore-t-il que ces résolutions ont été proposées par des conservateurs ? (Applaudissements.) N'est-ce pas le député du comté de Québec, un homme qui n'a pas honte de se dire conservateur, qui a proposé la première de ces résolutions ? [Ecoutez, écoutez.] Or, l'honorable député du comté de Québec est un homme qui a rendu de grands services à son parti, qui l'a défendu dans les plus mauvais jours et qui lui est resté fidèle lorsque bien des âmes vénales et lâches ont fai- bli. [Ecoutez, écoutez.]\n\nL'éton M. Garneau n'est-il pas un ancien ministre conservateur qui a donné les plus grandes preuves de dévouement et qui a passé sa vie, toute une carrière honorable, à défendre ses amis et à les protéger contre leurs adversaires et leurs propres fautes ?\n\nEt ces résolutions ne sont elles pas appuyées par le député d'Hochelaga ? Or je ne sache pas que ce monsieur ait des tendances bien libérales. Le fait est que ses tendances sont beaucoup plus conservatrices que celles des ministres actuels, et l'on sait parfaitement bien que l'on a dit quelque part, et non sans raison, que l'école représentée par l'honorable député d'Hochelaga est la véritable école conservatrice dans ce pays, et que les ministres qui siègent sur les banquettes du trésor sont entachés de l'hérésie libérale. Par conséquent, ces résolutions sont donc de provenance conservatrice ; offertes par un conservateur, elles sont appuyées par un conservateur et défendues par d'autres conservateurs.\n\nVous avez ensuite d'autres propositions qui viennent du député de Trois-Rivières. Or je ne sache pas que ce monsieur se soit avoué libéral. J'ai toujours compris qu'il réclame son titre de conservateur autant que les anciens ministres qui gouvernèrent la province autrefois et que les conservateurs ont été obligés de chasser parce qu'ils ruinaient leur parti. Pourquoi donc venir dire que nous sommes seuls à la tête du mouvement, quand ce mouvement est parti simultanément des rangs des deux partis ?\n\nAu lendemain du 16 novembre, ce n'étaient pas les libéraux seuls qui pleuraient la mort de Louis Riel ; unis aux conservateurs, ils se rencontrèrent dans la rue, sur les places publiques et se donnèrent la main affectueusement comme des frères, s'affligeant du même deuil national ! Ne l'oublions pas : les libéraux de Montréal se sont rendus à l'hôtel de ville de la métropole en compagnie des conservateurs, et les libéraux ont remarqué dans cette occasion solennelle que les conservateurs pleuraient comme les libéraux. Oui, libéraux et conservateurs se sont rendus ensemble à l'hôtel de ville ; ils ne se sont pas demandés s'ils étaient conservateurs ou libéraux ; ils sont partis ensemble, ils sont arrivés ensemble sur les degrés de l'hôtel de ville, confondant leur patriotisme commun, oubliant les divisions du passé et protestant, avec une énergique unanimité contre l'exécution de Louis Riel. Ils n'ont pas cru que c'était un mouvement de parti qui se faisait, mais ont affirmé par leurs paroles et leurs actions que c'était un mouvement national ; et ceux qui nous condamnent aujourd'hui, ceux qui nous critiquent, étaient alors à côté de nous ; ceux qui nous insultent pleuraient alors avec nous. (Applaudissements.)\nAujourd'hui, ces mêmes hommes nous crachent à la figure, parce que nous ne voulons pas traîner dans la boue le pauvre martyr de Régina. Arrêtez, messieurs ! Nous ne vous laisserons point faire. Vous ne renverrez pas ainsi les rôles. Ce n'est pas nous qui serons traînés dans la boue, car nous avons gardé religieusement le sentiment national ; c'est vous qui le serez, parce que vous trahissez ce sentiment, auquel vous avez juré fidélité. (Ecoutez, écoutez). Ce ne sont pas des patriotes, mais des pendards qui seront traînés dans la boue !\n\nDans les quelques observations que j'aurai l'honneur de faire ce soir, je veux démontrer que ceux qui nous combattent aujourd'hui étaient avec nous et qu'ils ont trahi la cause nationale. Nous avons entendu tout à l'heure le Procureur général nous dire que le vote qu'il allait donner dans un instant le ruinerait peut-être ; dans l'opinion publique. Il a eu raison ; c'est un cri de désespoir qu'il a fait entendre là et ce n'est que l'écho du sentiment intime de chacun de nos adversaires dans cette Chambre. Le fait est que c'est l'écho du glas de Régina ! Le Procureur général comprend que la dernière heure a sonné pour chacun de ceux qui vont approuver l'exécution de Louis Riel, et lorsque, tout à l'heure, il disait qu'il voulait remplir son devoir jusqu'au bout, quand même les électeurs le chasseraient aux prochaines élections, il ne parlait ainsi que pour donner un peu de cœur à ses amis, [Honte] car il n'a pas l'intention de se présenter, et il ne sera pas ici après les prochaines élections (Applaudissements) ou s'il y est, il n'y sera pas comme député de Montréal-Est (Ecoutez, écoutez). Les citoyens de cette division sont trop patriotes pour ne pas flétrir le langage qu'il a tenu ce soir. Soyez sûrs que cet homme saura se réfugier prudemment dans quelques grasse sénécies, comme le greffe de Montréal, où il essaiera de cacher la honte de sa trahison.\n\nLES DERNIÈRES ÉLECTIONS\n\nMonsieur l'Orateur, le mouvement se continue. Ce n'est pas un feu de paille, comme on l'a dit, et vous devez vous en apercevoir maintenant, par ce qui vient de se passer dans le comté de Verchères (Ecoutez). Nous avions déjà remporté Lotbinière, Drummond et Athabaska, malgré la corruption la plus effrénée qui ait peut-être jamais été pratiquée, durant ces dernières années du moins. Battu dans ces deux comtés, le gouvernement fédéral a voulu tenter un dernier effort dans Verchères ; il a cru qu'il allait gagner cette élection ; il a cru qu'il allait faire élire un pendard, car son candidat a avoué cyniquement qu'il l'était ; il a avoué qu'il approuvait l'exécution de Riel et qu'il l'accuse même d'avoir dit que s'il n'y avait pas eu de bourreau à Régina, il l'aurait volontiers remplacé et qu'au besoin il aurait tiré sur la corde [Honte, honte]. Le peuple de Verchères a dit qu'il ne voulait pas de pendards, pas plus à Québec qu'à Ottawa, et le peuple de ce comté, qui jusqu'alors avait été indécis, — car on sait que le parti libéral était si faible dans ce comté qu'en 1881 notre ami M. Bernard y fut défait par 36 voix — le peuple de Verchères, dis je, s'est prononcé et M. Bernard vient d'être élu par les mêmes électeurs avec une majorité de 143 voix (Applaudissements).\n\nCONSEQUENCE DU VOTE\n\nMaintenant, il me semble qu'en discutant cette question, j'ai bien le droit de demander à mes collègues quelle sera la conséquence du refus de voter les résolutions du député du comté de Québec et celles du député de Trois-Rivières.\n\nTout en admettant, pour le bénéfice de la discussion, que nous n'avons rien à voir dans cette question du Nord-\nOuest et dans l'exécution de Louis Riel, vous me permettrez bien, monsieur l'Orateur, de vous demander s'il est possible de supposer que le peuple de la province de Québec ignore ces deux propositions soumises à la Chambre ? Y a-t-il un habitant de cette province, quelque petit, quelque humble qu'il soit, qui ignore que nous discutons depuis dix jours une proposition regretant l'exécution de Louis Riel ? Y a-t-il un seul des ennemis de notre race qui ignore ce fait ? Y a-t-il un seul des nombreux orangistes de la province de l'Ontario, qui ignore à l'heure qu'il est, que la seule province française catholique de la Confédération discute par la voix de ses représentants cette brûlante question du Nord Ouest et cette pénible question de l'exécution de Louis Riel ? Et puis, n'y a-t-il pas sur les bords de la Rivière-Rouge, tout près de Saint-Boniface, une famille qui sait que nous, nous nous occupons de ces graves sujets ? Est-ce qu'il n'y a pas là une vieille femme, écrasée sous le poids de l'âge et de la douleur, la mère de Louis Riel, qui sait que dans ce moment-ci l'assemblée législative d'une province française et catholique discute l'opportunité de regretter l'exécution de son fils ? Et si elle le sait, la veuve, la pauvre veuve de Riel, le sait ; les deux pauvres petits orphelins, Jean et Angélique, le savent aussi. Ils savent que leurs grands frères de la province de Québec se demandent s'ils doivent regretter l'exécution de leur père. Eh bien ! M. l'Orateur, si nos compatriotes le savent, si nos ennemis les orangistes le savent, si cette pauvre famille, abîmée dans la douleur, le sait, quels ne seront pas les sentiments contradictoires qui s'empareront d'eux lorsque le télégraphe leur apprendra demain qu'la majorité de cette Chambre a refusé de regretter l'exécution de Riel ? Entendez-vous déjà les hurlements de joie poussés par les orangistes ? Vosyez-vous la tristesse sincère répandue sur les figures de tous vos compatriotes ? Pouvez-vous empêcher de parvenir jusqu'à vous le cri de désespoir parti de la pauvre maison de Saint-Vital, dans laquelle se trouvent le frère, la mère, la veuve et les enfants du martyr de Régina ? [Applaudissements.]\n\nINJURIES À M. GARNEAU\n\nLes ennemis du mouvement national ne sont pas contents de m'insulter, ils ont poussé l'insolence jusqu'à dire que l'hon. M. Garneau n'avait été que mon instrument, en présentant ses résolutions ; et qu'il les avait reçues de mes mains. C'est une infamie calomnieuse, car je n'ai vu ces résolutions qu'après qu'elles eurent été déposées sur le bureau. L'hon. M. Garneau a agi, dans cette occasion, avec indépendance et patriotisme, et c'est calomnier tout le parti conservateur que de dire que rien de national ne peut être exécuté sans l'impulsion du chef des libéraux. Qu'on le sache bien : c'est le parti conservateur qui a pris l'initiative du mouvement dans cette Chambre, en soumettant sa proposition. L'hon. M. Garneau s'est fait l'écho des sentiments de son parti, en dehors de la Chambre. Et si ces sentiments ne sont pas partagés par la majorité des députés, en cette Chambre, c'est parce que cette majorité n'est plus en accord avec ceux qui l'ont envoyée ici.\n\nQuant à nous, libéraux, nous avons accepté la proposition de l'hon. M. Garneau, de même que nous acceptons celle de l'hon. M. Turcotte, comme l'expression vraie des sentiments de ceux que nous représentons ici, et nous les appuierons de nos votes, convaincus qu'en le faisant, nous remplissons un devoir sacré.\n\nMais qu'on le sache bien : ce n'est pas sur nous que pesera la responsabilité du rejet, par cette Chambre, des deux patriotiques résolutions qui sont soumises : au parti conservateur seul la responsabilité de ce crime...\nTous ceux qui parlent ma langue, de ce côté-ci de la Chambre, vont appuyer patriotiquement ces résolutions. Quant à ceux qui ne parlent pas ma langue, s'ils ne votent pas avec nous, c'est leur affaire. Je leur dirai qu'ils ont tort, car ils refusent de se ranger du côté de la justice; mais j'ajouterai qu'ils ont peut-être été entraînés par le triste exemple que leur donnent mes compatriotes de l'autre côté de la Chambre. À ceux-ci, je dirais : Si vous êtes disposés à reprocher aux libéraux, qui ne professent pas ma religion et ne parlent pas ma langue, de ne pas sentir comme moi sur cette question, que devra-t-on penser de vous qui parlez la même langue, qui avez les mêmes traditions, les mêmes aspirations nationales que moi, et qui abandonnez un de vos anciens chefs pour applaudir au fanatisme des orangistes ?\n\nL'\"EXPRESSIVE POWER\"\n\nOn nous dit que n'avons pas le droit de nous mêler de cette question. Mais a-t-on déjà oublié le plaidoyer fait il y a quelques jours par le Solliciteur général pour nous prouver que nous avions le droit d'intervenir dans les affaires d'Angleterre ? Si j'ai bien compris ce discours, on nous a dit qu'il y avait en déchors du pouvoir législatif, inhérent à cette assemblée, un expressive power. Il est bien vrai que cet expressive power paraît être perdu depuis quelques jours et que le Solliciteur général a le soin de le renier aujourd'hui. Et ce soir nous avons vu l'honorable Procureur général mettre la dernière main à l'exécution de ce pauvre expressive power. Il est si bien disparu qu'on le cherche en vain depuis deux jours. [Rires.] Cependant, si l'honorable Solliciteur général veut me le permettre, nous allons tâcher de le retrouver, et voir si, dans les auteurs, il y a une grande différence, quant à cet expressive power, entre les questions irlandaises et les questions canadiennes. [Rires.] Nous allons voir si, d'après ces auteurs, il faut faire une distinction entre les affaires fédérales et les affaires impériales, et si cette Chambre, qui a indubitablement l'expressive power pour se prononcer sur des matières qui sont discutées à Westminster, ne l'a pas pour se prononcer sur des matières qui sont discutées à Ottawa ; et si cette Chambre a le droit d'exprimer un bon sentiment pour nos frères d'Irlande, elle perd ce droit quand il s'agit des pauvres Métis du Nord-Ouest. Nous allons, sans trop retarder la discussion rechercher cet expressive power, dont l'honorable député a si bien parlé. Et pour qu'on le reconnaisse mieux, nous allons en parler en français. L'hon. député nous l'a fait connaître en anglais et c'est pour cela peut-être qu'il est disparu, quand il s'est agi de l'invoquer en faveur des Français. [Rires.] J'ai eu soin de traduire mes citations. Voici ce que l'on trouve dans quelques auteurs, sur ce sujet, et d'abord dans Todd, [1] p. 427 :\n\n\"Le droit abstrait de délibérer et le droit conséquent de prendre action sur ces délibérations, que possèdent inévitablement les deux Chambres du parlement du Canada, à l'égard de toutes les matières qui affectent ou concernent le bien-être du peuple canadien, est de la même manière sujet à limitation et restriction par la loi constitutionnelle de la confédération.\" (p. 427).\n\n\"........Dans le parlement du Canada, la discussion libre de toutes les questions canadiennes constitue un privilège constitutionnel et indisputable, dont l'exercice peut être souvent propre à amener la bonne entente entre des partis en conflit, même à l'égard de questions qui sont indéniablement d'ordre provincial.\" (p. 428).\n\n\"........On a soutenu, avec plus\n\n(1) Todd, Parliamentary government in the British Colonies.\nd'ingénuité que de discernement, qu'il est erroné en principe et contraire à la pratique impériale de désigner sous ce titre un des corps législatifs d'importance minimale qui existent dans tout l'empire et que l'appellation de \"parlement\" devrait être réservée exclusivement au grand conseil de la nation et à ces législatures subordonnées qui [comme le parlement du Canada] ont reçu ce titre par un acte du parlement impérial.\n\nMais cette idée repose sur une fausseté et cette manière de voir n'est pas justifiée par l'usage du gouvernement impérial. (p. 461)\n\nFreeman, qui jouit à bon droit d'une réputation comme autorité en matières constitutionnelles, nous dit que le mot parlement signifie colloque ou conversation.\n\nLe parlement d'Angleterre est ainsi appelé historiquement parce qu'il fut assemblé pour parler, pour avoir avec le roi une grande conversation sur les affaires d'État.\n\nCette dérivation du mot nous porte naturellement à désigner sous le nom de parlement toutes les législatures des possessions anglaises qui jouissent substantiellement du pouvoir indépendant de se gouverner elles-mêmes. En effet, dans leur sphère d'action limitée, elles sont aussi suprêmes que le parlement impérial lui-même et elles s'occupent directement de la considération des questions d'intérêt général particulières à chaque colonie.\n\nDepuis que le parlement impérial a reconnu aux principales colonies anglaises le droit de se gouverner elles-mêmes, il s'est abstenu, comme nous l'avons vu, de toute intervention dans les fonctions appartenant en propre aux législatures coloniales. Ces corps s'assemblent non pas simplement pour passer les lois nécessaires au gouvernement de la colonie, mais aussi pour avoir une grande conversation sur les affaires d'État, avec le représentant de la reine, pour discuter et, au moyen de cette discussion, pour influencer la politique de l'administration locale sur toutes les matières affectant le bien-être de la société.\n\nPar conséquent, ces corps ont autant de droit d'être regardés comme des parlements, dans et pour ces colonies respectivement, que le parlement impérial a droit de l'être, dans et pour tout l'empire.\n\nQue veut dire cette citation ? C'est que nos législatures ont le droit de s'appeler parlements et qu'elles ont le même droit qu'un parlement, dans les limites restreintes d'une colonie ; c'est que nos législatures ne se réunissent pas seulement pour légiférer, pour faire des lois, mais encore, comme le parlement anglais, pour tenir de grandes conversations sur toutes les matières qui intéressent la colonie.\n\nMaintenant, Broom (1) dit :\n\nLe parlement possède trois pouvoirs, observe Sir R. Atkins : (1) Le pouvoir législatif, à raison duquel on l'appelle les trois ordres du Royaume; (2) Le pouvoir judiciaire, à raison duquel on l'appelle magna curia ou la haute cour du parlement; (3) Le pouvoir de conseiller, d'où on l'appelle communs co.:cillum regni\" (836-37).\n\nEt Todd, p. 618:\n\nEn tenant compte des limites constitutionnelles dans lesquelles l'intervention active du parlement est nécessairement restreinte, il est cependant une fonction importante que remplit la législature anglaise, à titre d'écho d'une opinion publique éclairée, qui demande d'être étudiée spécialement. Quand il transpire à l'étranger des événements que, dans l'intérêt de l'humanité ou de la paix et du bon gouvernement du monde, il est désirable que les hommes d'État anglais aient l'opportunité de faire connaître\n\n[1] Broom; constitutional Law (1886]\nleurs sentiments, de leurs sièges en \"parlement, soit qu'en agissant ainsi \"ils ne fassent qu'exprimer, avec le \"poids que donnent à leurs paroles \"leur caractère personnel et leur haute \"position officielle, les sentiments géné- \"raux du pays, soit qu'ils cherchent \"à influencer l'opinion publique, même \"au moyen d'explications intelligentes \"et autorisées des points sur lesquels ils \"possèdent des facilités particulières \"pour éclairer l'esprit public.\"\n\n(Voir observations de Sir Robert Peel et Lord John Russell sur l'intolérance religieuse en Espagne—Hansard, vol. CLXII, pages 2054-2072 ;)\n\n(Affaires du Danemark et du Holstein dans la chambre des Lords, 18 mars 1861 ; Le Pape et le royaume d'Italie, Lords, 19 avril 1861.—Affaires de Pologne, Lords, 19 juillet 1861, Communes 21 février 1863.)\n\nBagehot, English Constitution, dit :\n\n\"La deuxième fonction de la Chambre des Communes est ce que je pourrais appeler une fonction expressive. Il est de son devoir d'exprimer le sentiment du peuple anglais à l'égard de toutes les questions qui viennent devant elle.\"\n\nN'est-ce pas que nous l'avons retrouvé cet expressive power, si habilement caché à nos regards par le Soliciteur général ? Et si ce monsieur veut bien me suivre encore quelques instants, nous ferons ensemble une petite excursion dans le droit des gens : s'il y retrouve encore ce pouvoir qu'il a perdu de vue, pour les besoins de sa triste cause, il pourra se convaincre qu'au-dessus de la loi des hommes, il y a la loi de Dieu, la loi de la nature.\n\nVoici ce que dit Vattel, droit des gens, édition de Paris, 1er vol. p. 91 :\n\n\"La loi générale de cette société est \"que chacun fasse pour les autres \"tout ce dont ils ont besoin, et qu'il \"peut faire sans négliger ce qu'il se \"doit à lui-même : loi que tous les \"hommes doivent observer pour vivre \"convenablement à leur nature et pour \"se conformer aux vues de leur com \"mun créateur.\"\n\nPlus loin, p. 322 : \"Les offices de \"l'humanité sont ces secours, ces devoirs, \"auxquels les hommes sont obligés les \"uns aux autres, en qualité d'hommes, \"c'est-à-dire en qualité d'êtres faits, pour \"vivre en société, qui ont nécessaire- \"ment besoin d'une assistance mutuelle, \"pour se conserver, pour être heureux \"et pour vivre d'une manière convena- \"ble à notre nature. Or, les nations ne \"sont pas moins soumises aux lois natu- \"relles que les particuliers, ce qu'un \"homme doit aux autres hommes, une \"nation le doit, à sa manière, aux \"autres nations. Tel est le fondement \"de ces devoirs communs, de ces offices \"d'humanité, auxquels les nations sont \"réciproquement obligées les unes \"envers les autres. Ils consistent en \"général, à faire pour la conservation \"et le bonheur des autres, tout ce qui \"est en notre pouvoir........... [p. 323]\n\n\"Puis donc qu'une nation doit, à sa \"manière, à une autre nation, \"ce qu'un homme doit à un autre \"homme, nous pouvons hardiment \"poser ce principe général : un \"État doit à tout autre État ce \"qu'il se doit à lui-même, autant que \"que cet autre a un véritable besoin \"de son secours et qu'il peut le lui \"accorder sans négliger ses devoirs \"envers soi-même. Tel est la loi éter- \"nelle et immuable de la nature.......\n\nEt p. 355 : \"Nous avons donc en \"général le droit de faire tout ce qui \"est nécessaire à l'accomplissement de \"nos devoirs. Toute nation, comme \"tout homme, a donc le droit de ne \"point souffrir qu'une autre donne \"atteinte à sa conservation........... \"c'est-à-dire de se garantir de toute \"lésion...........\"\n\nVoilà la loi constitutionnelle, voilà la \"loi naturelle, voilà la loi des \"hommes, voilà la loi de Dieu ! Où est la \"loi maintenant qui nous soustrait à \"l'effet de ces grands devoirs ? Où est le \"statut qui nous empêche d'avoir du\ncoeur ? [Écoutez, écoutez !] Où est le statut qui nous soustrait aux lois de la nature, au droit des nations ? Où est le statut impérial ou provincial qui nous enlève à l'effet de la loi constitutionnelle anglaise ?\n\nL'honorable M. Flynn—L'honorable député voudra-t-il me permettre une observation ?\n\nL'honorable M. Mercier—Certainement.\n\nL'honorable M. Flynn—Je pourrais dire en me servant de mes collègues, Nego majorem. L'honorable député assume comme établi le fait qu'il y a dans la question Riel une question qui intéresse la nationalité canadienne-française. Dans mon argumentation, l'autre jour, j'ai commencé par dire que s'il y avait une question intéressant la majorité de la province de Québec et la nationalité canadienne-française, moi, je serais prêt à intervenir, comme vous. Mais je nie que la question se présente comme une question nationale.\n\nL'honorable M. Mercier—Très bien. Je sais parfaitement bien, et si l'honorable Solliciteur général me le permet, je vais tâcher de prouver qu'il y a un intérêt national, dans cette question là, pour nous. Je vais tâcher de retrouver l'intérêt national aussi bien que j'ai retrouvé l'expressive power. L'honorable Solliciteur général dit :\n\n\"Nous ne nions pas le droit d'intervenir dans une question intéressant la majorité des habitants de la province de Québec et affectant leur nationalité.\"\n\nJe demanderai d'abord au Solliciteur général, si c'est le nom irlandais qu'il porte qu'il lui faisait trouver un intérêt à intervenir, l'autre soir, dans les affaires d'Irlande ? Est-ce pour cela qu'il trouvait que la province de Québec avait intérêt à se mêler des affaires du parlement impérial ? Est-ce que la majorité de la province de Québec est irlandaise ? Si tel est le cas, qu'il ne soit pas surpris de nous voir intervenir, nous qui portons des noms français, dans une question qui intéresse notre race. Il y a 125,000 Irlandais, je suppose, dans la province. Ce sont des citoyens que j'estime, bien qu'ils ne m'aient jamais gâté par leurs faveurs ; ce sont des catholiques qui sont venus rester dans ce pays et dont plusieurs mêmes y sont nés ; ce sont des citoyens pour qui j'ai le plus grand respect. Quant à nous, nous sommes au delà d'un million. Or, si les 125,000 Irlandais qu'il y a dans cette province peuvent faire naître chez mon honorable ami le Solliciteur général la conviction que la question du Home Rule intéresse la province de Québec, je demande en vertu de quel principe il trouvera que l'intérêt national de nos compatriotes étant en jeu, ils ne doivent pas être protégés par les Canadiens-français de cette province ? Y a-t-il deux fois, une pour les Irlandais et une autre pour les Canadiens-français ? Est-ce qu'on doit avoir plus de sympathies pour nos frères d'Irlande qui souffrent que pour nos frères du Nord-Ouest qui souffrent aussi ? Est-ce que la voix du sang ne sera pas aussi forte que la voix de la sympathie ? Nous avons largement accordé notre sympathie aux Irlandais, nous l'avons donnée avec une générosité que nous ne refusions jamais à une cause qui est juste ; mais, pour l'amour de Dieu ! si nous avons du cœur pour les Irlandais, pourquoi n'en aurions-nous pas pour nos compatriotes ? [Applaudissements.] Si c'est la même loi, pouvons-nous dire que ce n'est pas le même intérêt ?\n\nQu'on me permette de dire, sans blesser le Solliciteur général, que je trouve sa conduite bien étrange. Il a été tellement éloquent, l'autre jour, quand il a dissout la question du Home Rule, que je me suis dit : voilà une éloquence de gagnée pour la cause de mes compatriotes du Nord-Ouest. Je me suis dit : le langage qu'il tient ce soir pour les Irlandais, il le tiendra pour nos compatriotes du Nord-Ouest.\nQUI SONT LES MÉTIS ?\n\nPourquoi n'aurions nous pas d'intérêt à protéger les gens du Nord-Ouest ? Si le Solliciteur général entend la voix du sang qui lui parle à travers les mers, qu'il veuille bien croire que nous entendons, nous, la voix du sang qui nous parle à travers les prairies du Nord-Ouest ! Qu'il veuille bien se rappeler l'histoire de notre pays. Que sont les Métis ? Les Métis sont les descendants d'une race forte et vigoureuse, ce sont les enfants des prairies qui sont nés de femmes ou d'hommes de notre race. [Ecoutez ! Ecoutez !] Les Métis descendent des premiers pionniers de ce pays. Vous dites que nous n'avons pas d'intérêt là. Mais pourquoi la France a-t-elle envoyé ses soldats pour civiliser le Nord Ouest ? Pourquoi la France a-t-elle envoyé ses missionnaires pour rougir de leur sang les prairies de ces pays lointains ? Qu'est-ce que ça faisait à la France que les sauvages mourussent dans l'idolâtrie et dans la barbarie ? Qu'est-ce que cela faisait à la France que ces sauvages ne connaissent pas les lois de la civilisation ? [Applaudissements.]\n\nAyons-nous envoyé nos ancêtres dans les plaines du Nord-Ouest pour les ignorer, les abandonner, les oublier ? Nos pères ont-ils été jeter si loin les fondements d'une nation pour que nous, leurs descendants, nous la trahissions sitôt ? Regardez donc quand un Français souffre dans n'importe quelle partie du monde, la France envoie ses soldats pour le secourir, quelquefois le venger. Lorsque un chinois sera mal traité dans n'importe quelle partie du monde, vous verrez le céleste Empire s'émuvoir et demander protection pour le malheureux. [Ecoutez ! Ecoutez !] Et pensez-vous que votre politique de non-intervention va réussir dans ce pays ci ? Vous pouvez prêcher cela : hélas ! dans l'assemblée législative de Québec, et espérer que la majorité de vos collègues vont vous approuver ; mais allez donc mettre la main sur la poitrine du plus humble de nos Canadiens-français, dans les campagnes ou dans les villes, et lorsque vous parlerez de non intervention, son cœur battra comme celui d'un patriote. Il vous dira que c'est toujours l'affaire d'un homme de cœur de défendre son frère. [Applaudissements.]\n\nLe peuple vous dira : \"Nous n'avez pas attendu que vous émettiez vos subtilités légales et constitutionnelles pour nous prononcer ; sans nous occuper de cela et avant que vous vous fussiez assemblés, vous les députés, nous avons réuni nos conseils municipaux : Québec, Montréal, toutes les villes de la province ont parlé. Les conseils municipaux de comtés et de paroisses se sont réunis et ont protesté contre l'exécution de Riel.\" Ces braves gens vous diront encore : \"Le jour de l'exécution de Riel, nous n'avons pas ouvert vos livres de loi pour savoir si nous avions le droit d'intervenir, nous avons consulté notre cœur et nous avons censuré les bourreaux de Riel.\" [Applaudissements.]\n\nPRÉCEDENTS\n\nL'honorable Solliciteur général aime à citer les précédents des libéraux ; qu'il me permette de lui rappeler ce qui s'est passé il y a quelques années, en mil-huit-cent soixante et douze, dans la législature d'Ontario. Ce n'est pas le dernier des libéraux qui a créé un précédent cette fois là. Ce précédent est contre nous, sous certains rapports, mais il reste. Qu'a fait M. Blake en 1872 ? Il était alors, comme il est aujourd'hui, un des premiers hommes de sa province et il a proposé la résolution suivante : \"Que cette Chambre se croit obligée d'exprimer son regret de ce qu'aucune mesure efficace n'ait été adoptée à l'effet de faire juger les meurtriers de Thomas Scott.\"\n\nC'est M. Blake qui a proposé cela.\nM. Blake blâmait le gouvernement fédéral, pourquoi ? parce qu'il n'avait pas pris les moyens d'amener devant les tribunaux les meurtriers de Thomas Scott. Or, si vous avez le droit de blâmer le gouvernement parce qu'un homme n'a pas été pendu, n'avez-vous pas le droit de le blâmer parce qu'il a été pendu ? Que disait M. Blake lorsqu'il faisait cette proposition ? Je trouve ses paroles dans le Chouicle de Québec, du 24 janvier 1872 et elles sont rapportées comme suit :\n\n\"On pourrait dire que cette Chambre en s'occupant de cette affaire, empêcherait sur les privilèges d'un autre gouvernement. Mais je dirais que les fonctions législatives ne sont pas les seules de ce parlement. Ce parlement a le droit de faire des remontrances et de prendre action (take action) sur les matières qui sont en dehors de ses fonctions. Cette Chambre a parfaitement le droit de s'occuper de cette affaire, vu qu'il s'agit de l'honneur d'Ontario et de la vie d'un de ses citoyens.\"\n\nAinsi voilà un homme de la valeur de l'honorable M. Blake qui déclare dans la législature d'Ontario, qu'il a le droit d'intervenir pour blâmer le gouvernement fédéral de ne pas avoir mis la main sur les meurtriers de Thomas Scott. Pourquoi ? Parce que, dit-il, la Chambre n'est pas seulement créée pour passer des lois, mais aussi pour exprimer le sentiment du peuple, et lorsqu'un des nôtres a subi une injustice, c'est non seulement notre droit, mais encore notre devoir d'intervenir. Si M. Blake avait le droit d'intervenir pour satisfaire l'opinion publique dans sa province, en raison de ce que l'on a appelé le meurtre de Scott, pourquoi n'aurions-nous pas le droit d'intervenir pour ce que j'ai le droit d'appeler le meurtre judiciaire de Louis Riel ? [Applaudissements]. Y a-t-il une différence entre les deux cas ? Est-ce que l'autorité de M. Blake n'est pas une autorité assez respectable pour me permettre d'intervenir, moi, député de la province de Québec, comme lui est intervenu dans une circonstance analogue ? S'il a eu le droit de blâmer le gouvernement parce qu'un homme n'a pas été jugé, est-ce que nous n'avons pas le droit de le blâmer parce qu'il l'a été ?\n\nY a-t-il eu des récriminations contre ces résolutions ? A-t-on dit quelque part dans les journaux que la législature d'Ontario n'avait pas le droit d'intervenir ? C'était un gouvernement conservateur qui était à Ottawa dans ce temps-là. Est-ce que la province d'Ontario a été bien écrasée ? Est-ce que la province d'Ontario a perdu son autonomie parce que ces résolutions ont été passées ? Est-ce que la province d'Ontario n'est pas encore aussi respectée aujourd'hui qu'elle l'était alors ? Que dis-je ? Est-ce qu'elle n'est pas plus respectée ? [Ecoutez ! Ecoutez !] Et si nous avons le courage d'exprimer notre opinion, comme ces messieurs d'Ontario l'ont exprimée, nous saurons nous faire respecter, car à l'heure qu'il est, je le dis à regret, la province de Québec n'est pas respectée comme elle devrait l'être. Pourquoi ? Parce que nous n'avons pas assez de courage pour exprimer nos opinions. Si nous avions le courage des gens de la province d'Ontario, nous aurions le respect qu'ils ont su se gagner. Et voyez donc comme Sir John A. MacDonald parle de la législature et des hommes d'Ontario ! Avec quelle préférence, ou plutôt, avec quelle cajolerie il le fait ! Comme il les respecte, comme il les craint ! Si vous voulez vous faire respecter, faites vous craindre. Le lion est plus respecté que le mouton, [Ecoutez !] parce que le lion se fait craindre. Devenez lions quand il s'agit de défendre vos intérêts et vos intérêts seront respectés. (Applaudissements). Qu'a-t-on dit dans le temps de ces résolutions ? J'ai ici l'opinion d'un écrivain, je ne lui ferai pas l'injure de l'appeler un grand écrivain constitutionnel—d'un écrivain qui, autrefois, était patriote, je veux parler...\nde M. de La Bruère : qu'est-ce qu'il dit de ces résolutions dans le Courrier de St Hyacinthe du 25 janvier 1872 ?\n\nÉcoutez !\n\nONTARIO\n\n\"Nos frères des hauts pays se battent bien entre eux quand il s'agit de se disputer le pouvoir ; mais sont-ils appelés à s'occuper d'une question où la nationalité est concernée, leurs juges les font tourner tous autour du même pivot. Ainsi le premier ministre, M. Blake, ayant ramené avant-hier la question de Riel-Scott devant les Chambres, on a vu jusqu'à M. Sandfield McDonald donner la main à celui qui vient de le terrasser.\n\nPourquoi donc la province de Québec, en face de cette politique d'agression de la part du Haut-Canada, ne se réunirait-elle pas aussi pour faire contre-poids à la pression qu'il veut exercer sur les masses et sur le gouvernement fédéral dans le règlement de cette affaire ?\"\n\nC'était dans un temps où l'on n'avait pas encore décidé de mettre de côté le sentiment national.\n\nM. HOLTON.\n\nTout le monde a connu feu M. Holton. Sans vouloir faire injure au Soliciteur général, je me permettrai de lui dire que M. Holton occupait une position bien supérieure à la sienne. Quand on parlait de M. Holton, on disait :\n\n\"C'est une autorité.\" Et ses adversaires le disaient comme ses amis. Quand il se levait en Chambre, son opinion était généralement acceptée ou certainement respectée, même par Sir John, et il était regardé comme l'homme le mieux versé dans le droit constitutionnel que nous eussions.\n\nQu'est-ce que je trouve dans la Mi nerve du 1er juin 1869 ? M. Holton, soulevant à la Chambre des Communes la question de l'église établie d'Irlande, disait :\n\n\"Que la question, quoique en dehors des fonctions législatives de cette assemblée, n'en est pas moins une question de la plus haute importance. Cette assemblée ne siège pas ici seulement pour légiférer, mais aussi pour redresser les torts de quiconque souffre. D'ailleurs, notre titre de sujet britannique nous permet et nous fait un devoir d'élever la voix en cette circonstance et d'exprimer notre opinion. Quant à l'utilité pratique des résolutions, quelque sages que soient les hommes entre les mains desquels reposent les destinées impériales, ils devront être flattés d'avoir l'opinion des habitants d'une aussi large portion de l'Empire. Ce sera un sujet de satisfaction pour les peuples d'Irlande, d'Ecosse et de l'Angleterre, et l'on ne doit pas douter que ces résolutions, si elles sont adoptées à l'unanimité, ne soient d'un grand poids dans la solution de cette importante question.\"\n\nIl n'a pas dit alors : \"Nous ne devons pas intervenir ; ce n'est pas de nos affaires ; qu'avons-nous à faire avec l'église établie d'Irlande ? qu'est-ce que ça nous fait à nous que les catholiques paient la dîme aux ministres protestants ?\" M. Holton était protestant lui-même et il ne payait pas de dîme ; mais ça n'empêche pas qu'il a dit : \"Voilà un principe qui est violé, un principe élémentaire de justice. C'est une honte pour l'Angleterre d'avoir maintenu un tel système. Elle qui prétend tant favoriser la liberté de conscience, elle l'a violée quand elle a maintenu dans son code pénal une loi qui force les catholiques à payer la dîme aux ministres protestants. Nous devons protester contre ce système. Nous devons aider les catholiques d'Irlande à se débarrasser de cette loi infâme et injuste.\"\n\nSir John A. McDonald, qui était là, n'a pas dit que ce n'était pas l'affaire du parlement canadien, il a dit tout simplement, comme disait l'autre jour...\nl'honorable député de Laval : \"Nous allons faire rire de nous.\" Eh bien ! monsieur l'Orateur, on a repoussé les résolutions de M. Holton ; mais ça n'a pas empêché que le débat a eu un effet considérable dans le vieux monde. Cela a donné tant de force aux libéraux anglais que l'année suivante, la dernière main était mise à l'œuvre pour abolir cette loi infâme qui avait tyrannisé pendant des siècles la pauvre Irlande catholique.\n\nIl y a encore un précédent. Ouvrez le \"Herald d'Ottawa de 1852, p. 1108 et vous y trouverez les paroles que voici, de M. Blake :\n\n\"Nous sommes intéressés, comme faisant partie de ce grand empire, comme partageant sa prospérité, comme partageant sa honte, nous sommes intéressés dans tout ce qui tendra à augmenter la force et l'homogénéité de cet empire ; nous sommes intéressés dans toutes les grandes et importantes questions qui se rapportent à la constitution générale et à l'organisation générale de l'Empire tout entier.\"\n\nOn ne peut nier que, à travers l'inconnu et sans système défini, la constitution de l'Empire tend graduellement, de plus en plus, peut-être à être poussée par des forces actives vers l'adoption du système fédératif. Nous sommes nous mêmes un résultat de cette tendance.\n\nNotre position actuelle est due à son développement partiel, sans symétrie et sans raisonnement, mais pratique, et je suis d'opinion que, sans avoir le droit de légiférer, nous avons cependant le droit, comme faisant partie de l'Empire, d'exprimer notre opinion sur cette question.\n\nEn face de ces précédents, que l'on ne vienne pas dire que nous n'avons pas le droit d'intervenir et que ce serait violer la loi que de le faire. Avouez-le franchement : ce n'est pas la loi qui vous préoccupe. Quand on a donné quinze mille piastres à un particulier pour acheter des livres qu'il n'a jamais achetés, ou violait la loi ; mais on ne s'en est pas préoccupé. Quand on a voulu vendre un chemin de fer malgré la loi du pays, on ne s'est pas occupé de la loi. Lorsque, malgré la loi du pays, l'on ne forgait pas les serviteurs publics à rendre compte de leur administration, on ne s'est pas occupé de la loi. Lorsque, cet hiver, on laissait échapper un homme qui avait volé $50,000.00 à la province, l'on savait bien que l'on vio-lait la loi, mais on ne s'est pas gêné de la violer. Ce n'est pas la loi qui gêne le gouvernement, c'est la peur. Le gouvernement ne s'occupe pas de la loi et si, à l'heure qu'il est, il avait intérêt à blâmer le gouvernement d'Ottawa, quand même la loi le lui défendrait, il le blâmerait. (Ecoutez! écoutez!) Si les libéraux étaient au pouvoir à Ottawa, c'est alors que la loi serait mise de côté, (Ecoutez! écoutez!) c'est alors que l'on retrouverait l'EXPRESSIVE POWER, (Ecoutez!) c'est alors que l'on écouterait la voix du sang.\n\nRIEL MON FRÈRE\n\nC'est alors qu'on ne ritait pas de ceux qui appellent Louis Riel \"mon frère.\" Car, il y a des gens qui ont ri de cela, il y a des journalistes qui ont ri de cela, il y a des députés qui ont ri de cela. Il y en a qui ont dit : \"Il y a quelque rapprochement entre le chef de l'opposition et le chef des métis ; l'un s'est vendu pour $5,000.00, l'autre était prêt à se vendre pour $35,000.\" Des journalistes ont dit cela. Eh bien ! monsieur l'Orateur, cette injure à mon adresse a été effacée par les tribunaux, Dieu merci. J'ai mis au front du journaliste qui avait dit cela en caractères ineffaçables, le mot de \"calomniateur.\" Cette question est vidée.\n\nOn m'a reproché d'avoir appelé Louis Riel \"mon frère.\" J'aime mieux appeler Louis Riel \"mon frère,\" que de faire comme certains hommes qui appellent les orangistes \"leurs frères.\"\nJ'aime mieux être parent avec un mé- tis, que d'être parent avec certains hom- mes politiques, qui cherchent à écraser notre race et à détruire notre religion; Et je n'ai jamais eu honte d'un pendu, quand il a été pendu pour l'amour de son pays. Je n'ai jamais eu honte d'un De Lorimier, d'un Duquet, d'un Chenier, je n'ai jamais eu honte de mon père fait prisonnier en 1837 parce qu'il aimait son pays. (Applaudissements).\n\nIl faudrait que je fusse bien dégénéré pour avoir honte d'appeler Louis Riel mon frère. Louis Riel est mon frère par le sang, comme il est le frère de chacun de vous. Vous avez beau chercher à le renier, cet homme là, vous serez tous forcés de vous rappeler qu'il a votre sang comme vous avez le sien : et avant longtemps, vous serez, bon gré mal gré, obligés de défendre sa mémoire; car souvenez vous-en, un jour viendra où vos haines politiques disparaîtront et vous retrouverez alors la place de votre cœur (Applaudissements).\n\nMÎTRE JACQUES CASAVANT\n\nJ'ai entendu l'autre jour quelque chose de bien étrange, lorsque M. Casavant, député de Bagot, se leva en cette Chambre pour expliquer son vote. Il a dit que lui, il était ici comme député et que quand il avait parlé comme citoyen, dans son comté, c'était comme électeur et qu'en entrant ici il avait laissé à la porte ses sentiments d'électeur et de citoyen. Je ne sais pas si l'honorable député a bien réfléchi sur la position qu'il a prise en cette circonstance, mais la voici dans toute son anomalie : le citoyen est patriote, le député ne l'est pas ; le citoyen a des sentiments, le député n'a pas besoin d'en avoir.\n\nCeci me rappelle une scène amusante d'une des comédies de Molière. Je ne sais pas si l'honorable député a jamais lu Molière, mais je lui conseil de le lire. Dans une de ses pièces, l'Avare, qui est un des chefs d'œuvre de cet auteur, il y a une petite scène c'est la scène entre Harpagon et maître Jacques. Maître Jacques est le domestique de Harpagon. Harpagon est un avare. Voici la scène telle qu'elle est racontée. Elle est assez drôle pour être citée textuellement :\n\nHarpagon—Valère, aidez-moi à ceci...\nOr ça, Maître Jacques, approchez-vous; je vous ai gardé pour le dernier.\n\nMaître Jacques—Est-ce à votre cocher, monsieur, ou bien à votre cuisinier, que vous voulez parler ? Car je suis l'un et l'autre.\n\nHarpagon—C'est à tous les deux.\n\nMaître Jacques—Mais à qui des deux le premier ?\n\nHarpagon—Au cuisinier.\n\nMaître Jacques—Attendez donc, s'il vous plaît. [Maître Jacques ote sa casaque de cocher, et paraît vêtu en cuisinier.]\n\nHarpagon—Quelle diantre de cérémonie est-ce là ?\n\nMaître Jacques—Vous n'avez qu'à parler.\n\nHarpagon—Je me suis engagé, maître Jacques, à donner ce soir à souper.\n\nMaître Jacques—Grande merveille...\n\nHarpagon—Maintenant, maître Jacques, il faut nettoyer mon carrosse.\n\nMaître Jacques—Attendez ; ceci s'adresse au cocher. [Maître Jacques remet sa casaque] Vous dites........\n\nAinsi, d'après Maître Jacques, lorsque vous vous adressez au député de Bagot, il vous demandera d'abord : \"Est-ce au citoyen que vous voulez parler ou au député ?\" Et si vous dites que c'est au citoyen, il dira : \"Attendez, je vais aller chercher mon patriotisme.\" Puis il reviendra, revêtu de son patriotisme, et vous dira : \"Maintenant, vous pouvez parler ; je suis le citoyen.\" Et si vous lui dites : \"Maintenant je veux parler au député.\" \"Ah ! dira-t-il, attendez un peu;\" il faut que j'aille ôter mon patriotisme.\" Puis revenant : \"À présent,\" dira-t-il, vous pouvez parler au député.\" [Rires]\nPRÉSIDENT DE M. ROSS\n\nJe me suis amusé à chercher dans les vieux journaux dans quels termes l'hon. M. Ross, notre premier ministre, avait proposé ses fameuses résolutions au sujet de la grâce de Lépine en 1874. C'est intéressant aujourd'hui.\n\nJe veux montrer à ceux qui viennent dire dans cette Chambre que nous n'avons pas le droit d'intervenir, quel langage l'honorable premier ministre a tenu dans cette circonstance.\n\nÀ ce sujet, je suis allé consulter mon ami du Canadien. J'ai cru qu'il allait me fournir tous les renseignements dont j'avais besoin. Je me suis rappelé que M. Tarte était à côté de moi, au Champ de Mars, le 22 novembre dernier, qu'il applaudissait les paroles patriotiques que mon cœur m'inspirait. Je me rappelle même qu'il m'a dit : \"Vous n'avez pas été assez loin.\" Eh bien, monsieur l'Orateur, je me suis dit : Je vais aller le consulter ; j'aurai ce qu'il faut. Voici donc les paroles de l'honorable M. Ross.\n\nMon but, honorables messieurs, est de faire disparaître les causes d'inquiétude, d'irritation et de troubles qui ont existé depuis quelques années dans une des provinces soeurs. Je pourrais dire même dans la Province. C'est d'y faire renaître la paix, le calme et la bonne entente qui sont si nécessaires au bonheur et à la prospérité des nations.\n\nJe voudrais voir la confiance réveillée dans cette malheureuse province de Manitoba, qui a déjà tant souffert et que Notre Gracieuse Souveraine peut y conserver toujours les sentiments de reconnaissance et de dévouement de tous ses sujets, à quelque origine, à quelque croyance qu'ils appartiennent.\n\nJe voudrais que la faute de tous ne fût pas mise à la charge d'un seul, mais que, répartie entre ceux qui ont pris part aux malheureux événements du Nord Ouest, elle soit par là même aussi bien que les motifs qui faisaient agir cette population, diminuée en gravité et réduite à ses justes proportions.\n\nEnfin, ce que je demande et ce que vous demanderez avec moi, c'est la persuasion, c'est l'exercice de la plus belle prérogative de la Couronne, c'est la grâce, c'est le pardon du malheureux Lépine.\n\nLors de l'union des provinces de l'Amérique Britannique du Nord, nous avons jeté les bases d'un grand pays. Dans ce pays devaient être appelés à vivre des hommes de différentes origines, de croyances aussi différentes. Chacun devait pouvoir rendre hommage à Dieu à sa manière, chacun devait y jouir des droits et des libertés que lui promettaient les libres institutions du gouvernement le plus libre de la terre.\n\nTels étaient honorables messieurs, les principes qui formaient la base de cette union, tels étaient les principes qui devaient en assurer le succès. Tels étaient le but et l'intention des pères de la confédération.\n\nMalheureusement, lorsqu'il s'agit de l'entrée du Territoire du Nord-Ouest dans la confédération, tout en ayant de bonnes intentions à l'égard de sa population, on négligea de lui donner les garanties auxquelles il avait droit, et de là, messieurs, l'origine et la cause de toutes les difficultés.\n\nLes métis, croyant leurs droits et leurs libertés en péril, en confièrent le précieux dépôt à quelques hommes qu'ils choisirent pour leurs chefs. Ce fut l'origine du gouvernement provisoire, et Riel, Lépine et quelques autres furent les dépositaires chargés de défendre ce que ce petit peuple avait tant à cœur de conserver.\n\nOr, je vous le demande, honorables messieurs, qu'ont-ils fait, ces hommes, que bien d'autres n'auraient fait à leur place sous l'empire des craintes et des\nfrayeurs qui envahissaient alors leur province ?\n\n\"Je n'ai pas l'intention de faire ici l'historique des événements de 1869, mais je dirai que les métis canadiens-français n'avaient d'autre objet en vue que celui de voir leur province mise sur un pied d'égalité et jouissant des mêmes privilèges que les autres provinces de la Confédération. La preuve de ce que j'avance est dans le fait que du moment qu'ils eurent obtenu les garanties qu'ils désiraient, il se sont empressés de se ranger sous le drapeau anglais, et que depuis cette époque, ils se sont montrés les plus soumis des sujets de Sa Majesté.\n\n\"Quels sont donc ceux qui oseraient blâmer ces motifs ? Seraient-ce les Anglo-Saxons, dont les ancêtres ont lutté pendant des siècles pour arriver à jouir de la plus grande somme de liberté possible ? Seraient-ce les Canadiens-français, qui naguère ont combattu avec toute l'énergie du désespoir pour obtenir les privilèges accordés aux autres sujets du Royaume ? Non, honorables messieurs, il peut y avoir quelques différences d'opinion entre nous sur la gravité de la faute de cette population ; mais il ne peut y en avoir sur les motifs qui l'aimaient ni sur l'opportunité de demander aujourd'hui le pardon et l'oubli de cette faute.\n\n\"Parmi les nations qui figurent glorieusement dans l'histoire, il n'en est pas une qui n'ait eu à enregistrer de ces actes de clémence qui, loin de ternir leur gloire, l'ont rendue plus respectueuse encore, tout en conservant le respect et le prestige de l'autorité souveraine. L'histoire de tous les siècles nous donne de ces exemples, et l'histoire contemporaine nous en fournit plus d'un.\n\n\"J'ai dit, honorables messieurs, que je ne voulais pas faire ici l'histoire des événements de 1869. La Chambre et le pays savent comme moi ce qui s'y est passé. L'acquisition du Territoire du Nord-Ouest, son annexion à la Puis-\nbientôt le mal de Manitoba sera sans remède.\n\n\"Faisons donc, honorables messieurs, tous nos efforts pour que cette flétrissure nous soit épargnée. Tâchons que les premières pages de notre histoire ne soient pas teintes de sang et qu'on n'y imprime pas de ces taches que ni le temps, ni les événements, ni même le plus amer repentir ne sauraient effacer.\n\n\"Honorables messieurs, dans l'intérêt du pays, pour y faire renaître la tranquillité, la paix et la confiance;\n\n\"Dans l'intérêt de la justice, pour que des hommes qui ont combattu pour une cause qu'ils croyaient en péril, ne soient pas immolés;\n\n\"Pour que le Canada ne reste pas en arrière en fait de clémence ou qu'au moins nous suivions l'exemple de tant de pays à la suite d'événements autrement graves que ceux que nous croyons avoir à venger aujourd'hui;\n\n\"Pour ces raisons et pour bien d'autres encore qu'il me serait inutile d'énumérer ici, j'espère que ces résolutions que je propose recevront l'approbation de cette honorable Chambre et qu'elles serviront de base à une requête que nous adresserons au représentant de Notre Souveraine au Canada pour lui demander le pardon du malheureux Lépine.\n\n\"Ai-je besoin d'ajouter que les bénédictions de cette malheureuse famille ne devront pas manquer à ceux qui auront aidé à soustraire son chef à la mort et que ces bénédictions pourraient bien être pour nous un sujet de grande consolation et contribuer à nous rendre légères bien des visibilitudes et des infortunés de cette vie?\"\n\nVoilà ce que disait l'honorable Premier ministre en 1874. [Interruptions.] Je regrette d'être un peu long dans mes observations, mais j'y suis obligé par la nature de ce débat.\n\nAinsi, voilà les paroles du premier ministre. J'ai aussi celles qui furent prononcées par l'honorable M. Charlevoix lorsqu'il proposa ses résolutions. Elles sont dans le même sens et de la même force. Je ne fatiguerais pas la Chambre en les lisant. Ce que je me permettrai de lire, ce sont quelques-uns des extraits des journaux de cette époque, si vous voulez, monsieur l'Orateur, me le permettre. Si j'avais plus de temps, que j'aurais du plaisir, que mon patriotisme serait satisfait en faisant connaître à cette Chambre tous les grands mouvements d'indignation qu'il y a eu à cette époque, non pas parce Riel était pendu, non pas parce que Lépine était pendu, mais parce qu'on ne leur donnait pas leur grâce immédiatement. J'ai ici des extraits de dix à douze journaux conservateurs.\n\nMalgré mon désir d'achever ce débat, je ne puis m'empêcher de citer quelques extraits des journaux de cette époque pour faire voir l'indignation qui s'était emparée des conservateurs, à l'occasion de l'exil de Riel et de Lépine:\n\n\"J'ai vu avant et pendant 1837 et 38, disait le Canadien du 26 décembre 1874, les Fournier, les Letellier, les pères... des braves hommes, ceux-là, combattre dans les rangs de ceux qui demandaient liberté et justice égale pour les Canadiens-français, sauver les Morin et les Tashé des serres des tyrans; maudire les sicaires qui envoyaient sans forme de procès, dans l'exil, et jetaient entre les mains du bourreau, les Lorimier, les Desgagne et autres.\n\n\"Aujourd'hui, je vois leurs fils, sale engeance, laisser poursuivre dans leur lâche complicité leurs frères de Manitoba, parce qu'ils ont combattu, comme nous l'avons fait en 1837, pour obtenir liberté et justice égale,... chasser leur chef de l'assemblée nationale, mettre sa tête à prix, nommer un juge pour faire condamner Lépine à\nmort et forcer Naud, un autre patriote, à rester dans une prison fétide dont l'air le tue lentement et sûrement. Quels sont les plus infimes tyrans, ceux de 1837 ou de 1874 ?\n\n\"Je vois leurs fils trahir, pour un misérable salaire de ministre et pour la satisfaction de leur haine contre nos institutions religieuses, les fiers sentiments dont le peuple les croyait pétris. Je les vois, pâles molles que McKenzie pètrit à sa guise, s'aplaisant devant lui et lui sacrifiant l'honneur et les intérêts de la province de Québec.\n\n\"Je reste froid et dédaigneux devant la lâcheté et la complicité de ces parvenus que des Canadiens français n'ont pas honte d'excuser encore. Leurs jours d'orgie sont comptés ; le peuple du Bas-Canada, qui attendue par tous les hommes respectables et indépendants, qu'un succès éphémère n'éblouit pas, ou la province de Québec, se souvient cette vengeance de son manteau et l'érasant dans sa marque, se placera fidèlement devant le Haut-Canada et revendiquera ses droits et ses intérêts aussi bien que les droits et les intérêts des provinces plus faibles que le fanatisme d'Ontario sourbe sous sa main de fer......l'heure où le Bas Canada, uni pour la lutte et le sacrifice, rallié autour de ses institutions, imposera la loi au Haut-Canada comme il l'a toujours imposé avant l'avènement des rouges au pouvoir.\"\n\nExtrait du Canadien du 18 janvier :\n\n\"Une consultation, à coup sûr, vaut mieux que la mort. Mais nous demandons une fois de plus à nos éminents ministériels de presser avec nous leurs chefs d'employer tous les moyens en leur pouvoir pour obtenir ce à quoi Lepine a droit, c'est-à-dire un pardon complet. S'il n'est pas coupable, comme nous nous accrochons à le dire, pourquoi le laisserions nous sacrifier à la haine des fanatiques d'Ontario ?\n\n\"Nous savons bien que le Globe objecte à un pardon complet, nous avons mis l'autre jour sous les yeux de nos lecteurs l'opinion de M. Brown. Mais nos ministres, appuyés par la province de Québec sans distinction de parti, ne pourraient-ils pas obtenir justice ?\n\n\"Quels que soient les événements, la presse conservatrice a fait son devoir. Elle n'a cessé de réclamer justice et protection. On ne saurait en dire autant des journaux ministériels qui, depuis quelque temps, gardent un silence regrettable.\"\n\nExtrait du Canadien du 23 janvier, 1873 :\n\n\"Comment ! l'on a l'insigne lâcheté de se cacher derrière le Trône ! Et l'hon. ministre de la justice, M. Fournier, exécute l'ordre du Gouverneur général et se charge de conduire la procédure qui condamne Lepine à un perpétuel exil !\n\n\"S'il tentait à dégager sa responsabilité, il devait refuser d'accomplir la tâche dont il était chargé, il devait résigner.\n\n\"Mais... si Messieurs Fournier, Geoffrion et Letellier eussent usé de leur droit d'aviser la Couronne, probablement le représentant de Sa Majesté se fût rendu à leurs conseils. Nos ministres ont fléchi le génou devant M. McKenzie, ils ont troqué leur honneur et la dignité du Bas Canada contre l'or que leur rapportent leurs portefeuilles.\"\n\nExtrait du Canadien du 23 janvier, 1873 :\n\n\"C'est quelque chose d'inouï, d'inconcevable que la conduite de ces représentants du Bas-Canada n'osant pas plaider une cause qu'ils savent chère et sacrée pour leurs compatriotes.\n\n\"Toute la province a demandé sa grâce, à l'exception de messieurs Fournier, Geoffrion et Letellier qui ont refusé de se joindre aux Canadiens-français.\n\n\"Que doivent penser les nationalités avec lesquelles nous vivons ? Quel respect pouvons nous inspirer ?\n\n\"Si, au moins, les trois ministres qui...\"\nnous ont ainsi trahis restaient sans complices. Balayés par le vent du mépris universel; ils tomberaient sous le poids de leur honte et serviraient d'exemple à ceux qui seraient tentés d'imiter leur lâcheté.\n\n\"Mais dans la presse, dans cette grande et noble puissance destinée à conseiller le bien et à combattre le mal, il se trouve des épaisses assez oublieuses de leur mission et de leur devoir pour applaudir à l'iniquité et au déshonneur de notre race.\n\n\"It n'est pas possible que la justice et le droit soient ainsi sacrifiés. Il y a encore, Dieu merci, du patriotisme parmi les Canadiens français... et de l'esprit de justice dans la Puisance.\"\n\nExtrait du Canadien du 28 janvier 1875:\n\n\"Mais, l'affaire de Lepine, personne ne peut le contester, était du domaine des ministres fédéraux. Ils pouvaient la gracier s'ils l'eussent voulu. Nous défions qui que ce soit de le nier. Au reste, ils avaient profité de le faire, donc ils se reconnaissaient les pouvoirs nécessaires.\n\n\"Pourquoi ne l'ont-ils pas fait? Ah! c'est que leurs collègues du Haut Canada s'objectaient à ce qu'un cabinet ou aucun de ses membres ne protégeât Lepine.\n\n\"C'est le moment de faire la comparaison, à notre tour, entre les représentants actuels du Bas Canada dans l'Exécutif et les chefs conservateurs.\n\n\"Puisque M. McKenzie refusait d'intervenir en faveur de Lepine, pourquoi ces collègues de la province de Québec n'ont-ils pas suivi la noble conduite de M. Langevin qui déclara à son chef, Sir John à Mr Taché et à ses partisans, que si l'amnistie n'était pas accordée, il réintégrerait son parti l'année?\n\n\"Dans le cas de Lepine, il s'agissait non d'une amnistie, mais de gracier un condamné qui avait déjà subi une détention assez longue et conséquemment satisfait à la loi pour les torts que ses ennemis lui prêtent.\n\n\"Eh bien! nos ministres n'ont pas même eu le cœur de dire à M. McKenzie: Nous voulons le pardon de cet homme. Il a déjà assez souffert; il faut maintenant que justice lui soit rendue.\"\n\nExtrait du Canadien du 1er février 1875:\n\n\"Qui voudrait prendre la responsabilité devant la Province des bassesses des ministres fédéraux? La presse est unanime à les dénoncer.\"\n\nExtrait du Canadien du 6 février 1875:\n\n\"Puisque nous sommes trahis, sacrifiés et vendus par les ministres qui nous représentent dans l'Exécutif, montrons leur que les Canadiens français connaissent le devoir qui leur incombe.\"\n\nExtrait du Canadien du 9 février 1875:\n\n\"Il s'agit de secourir des compatriotes injustement opprimés, que chacun en appelle à son patriotisme.\n\n\"Sur ce sujet nous sommes unis, donnons-nous la preuve ce soir en réclamant justice et protection.\n\n\"Notre voix sera entendue, soyons-en certains.\n\n\"Lepine a droit à un pardon complet, demandons-le sans crainte.\n\n\"L'amnistie a été promise et la preuve de cette promesse a été faite.\n\n\"Exigeons l'accomplissement de la loi jurée et des engagements contractés.\n\n\"Il y a assez longtemps que la tyrannie la plus odieuse continue son œuvre. Il faut que la justice et que le bon droit aient leur tour.\n\n\"Les Mélus attendent de nous justice et protection, ne trompons pas leurs espérances.\n\n\"Que tous les hommes de cœur s'élèvent en une voix pour demander l'amnistie.\"\n\nIl est bon, en face des lâches trahisons qui s'offrent à nos regards, de rappeler les paroles de M. Tartar, rédac-\nteur du Canadien, dans un discours prononcé à la salle Jacques-Cartier, le 9 février 1875 :\n\nVoici ses paroles :\n\n\"La noble cause au soutien de laquelle vous manifestez de si ardentes sympathies, s'élève au-dessus des considérations de parti. Nos divisions ne sont pas assez profondes pour nous faire oublier que nous sommes des Canadiens-français, c'est-à-dire des hommes de patriotisme, de dévouement et de cœur.\n\n\"L'Amérique a, en ce moment, les yeux fixés sur le million de Canadiens-français qui foulent le sol de la Confédération ; mais les regards sont surtout tournés sur la province de Québec.\n\n\"Ah ! partout l'on comprend que nous ne pouvons rester spectateurs indifférents du drame lugubre qui se déroule à Manitoba.\n\nNous sommes ici dans l'exercice de l'une de nos plus chères prérogatives garanties par la Constitution et nous pouvons discuter ouvertement nos droits et exposer courageusement nos griefs.\n\nLe Bas-Canada a traversé une phase semblable à celle que traverse en ce moment Manitoba...\n\n\"Des têtes bien chères à la patrie rougissent sur l'échafaud pour leur dévouement à leur nationalité. Mais leur sacrifice ne fut pas inutile, car ils nous légèrent cette constitution et ce gouvernement responsable qui sont les remparts de nos libertés. L'un des premiers actes de ce gouvernement responsable fut la cessation des poursuites intentées contre les chefs de l'insurrection de 37-38, entre autres contre M. Papineau. Qui ne sait que pour obtenir cette faveur Sir L. H. Lafontaine menaça Sir Charles Metcalfe, alors gouverneur du Canada, d'abandonner le pouvoir ? On comprenait alors la véritable portée des institutions responsables et l'on avait le courage de demander justice et protection. Nous sommes plus forts, plus nombreux qu'à cette époque. La cause des Métis est aussi juste que celle du Bas-Canada. Pourquoi ne demanderions nous pas justice ? Quel est, dans cette enceinte, celui qui ne veut pas la grâce de Lépine ? Quel est celui qui ne veut pas l'amnistie ? Tous nous l'avons sollicité, et nous rougissons de ne pas l'avoir fait.\"\n\nExtrait du Canadien, du 11 février 1875 :\n\n\"Jamais nous n'avons vu le sentiment public aussi unanime, aussi imposant dans sa détermination d'obtenir justice par tous les moyens constitutionnels fournis par nos institutions.\n\n\"L'on sentait que l'heure est venue d'affirmer nos droits, d'exprimer librement nos opinions, d'exiger le redressement de griefs qui vont toujours croissant. Le peuple, le vrai peuple, plein de cœur et d'amour de la justice, le peuple qui ressent les outrages qu'on lui inflige, s'est montré digne du passé glorieux de notre race ; sa voix a été courageuse, son élan magnifique, son action généreuse.\n\n\"C'est dans de pareilles manifestations que l'on reconnaît le véritable esprit d'un peuple, la vitalité d'une race. Tant que la nationalité canadienne-française s'affirmera avec une telle vigueur, elle imposera le respect et conservera son prestige.\n\n\"Est-il rien de plus digne d'admiration que le spectacle d'une ville entière se levant comme un seul homme en faveur de la justice et du bon droit ?\n\n\"Certes, les événements auxquels nous assistons méritent d'attirer l'attention de tous les hommes bien pensants et si nous cessions laissé consommer l'iniquité sans enregistrer une solennelle protestation, nous cesserions être indignes du rôle que nous avons joué jusqu'ici sur ce sol d'Amérique.\n\n\"Comment ! nos mortels ennemis, les adversaires acharnés de nos institutions civiles et religieuses mettent tout en\nœuvre pour détruire notre influence et nous resterions indifférents !\n\n\"Ils veulent anéantir les Métis parce qu'ils craignent que l'influence française ne prenne des proportions trop considérables au Nord-Ouest.\n\n\"La province de Québec, la seule province catholique du Dominion, doit donc accorder sa protection au Manitoba, sa sœur de race et de croyance.\n\n\"Tous, nous comprenons que dans Riel expulsé de la Chambre, mis hors la loi, traqué comme une bête sauvage par les assassins salariés de M. McKenzie, c'est le Bas Canada que l'on foule aux pieds.\n\n\"Les énergiques résolutions adoptées mardi à l'unanimité feront trembler les méprisables qui trafiquent de l'honneur du pays. Elles auront d'incalculables résultats, et si cette expression si peu douteuse de l'opinion publique ne suffit pas pour obtenir justice, dans tous les comités de semblables démonstrations s'organiseront avec vigueur et enthousiasme.\n\n\"Que l'on ne s'imagine pas que nous nous lasserons.\n\n\"Tant que l'amnistie ne sera pas accordée, tant que Riel, Lépine et leurs compagnons n'auront pas le droit de respirer librement l'air de la patrie, nous continuerons la lutte contre leurs bourreaux et leurs persécuteurs. Nous resterons dans les limites de la constitutionnalité, mais l'agitation ira tous les jours croissante.\"\n\n[Le Canadien, 8 février 1875]\n\n\"La persécution qui règne en souveraine à Manitoba doit avoir un terme.\n\n\"Les métis, nos frères de race et de religion, ne peuvent compter sur d'autres sympathies que celles du Bas-Canada.\n\n\"Cette idée machiavélique de les abandonner dans l'infirmité.\n\n\"Employons tous les moyens que la constitution met à notre disposition pour secourir nos amis de Manitoba.\n\n\"Donnons à Riel le droit de respirer l'air de sa patrie, loin de laquelle il traîne une misérable existence.\n\n\"Est-il une cause plus sacrée que celle de nos compatriotes outragés dans leurs droits, soumis à une persécution barbare ?\"\n\n(Extrait du Canadien du 12 février 1875):\n\n\"Nous ne pouvons concevoir comment des Canadiens-français peuvent se prononcer délibérément et de cœur joie en faveur de ce bannissement que l'on veut faire subir aux malheureux chefs métis.\n\n\"Mais, quel est leur crime ? Nous vous le demandons à vous tous qui acceptez cette humiliation et ce sacrifice d'une cause qui vous devrait être bien chère. Dites nous pourquoi vous voulez que Riel soit chassé du sol britannique. Est-ce parce qu'il a été le champion intrépide de sa nationalité ?\n\n\"Est-ce parce qu'il s'est dévoué pour la race et la conservation des droits de tout un peuple ?\n\n\"Est-ce parce qu'il est l'homme en qui Mgr Taché repose le plus de confiance ?\n\n\"Est-ce parce que à Manitoba il a vaillamment combattu contre les orangistes et les grits qui y conspirent contre la race Canadienne et le catholicisme ?\n\n\"Est-ce parce que depuis plus de deux ans il traîne une vie misérable loin de sa famille et de sa patrie ?\n\n\"Pourquoi veut-on que Lépine soit banni pendant cinq années ?\n\n\"Est-ce parce qu'il a été condamné à l'échafaud par un juge nommé par le chef des libéraux, M. Dorion ?\n\n\"Est-ce parce qu'on a laissé dresser le gibet avant d'apprendre au condamné qu'il avait la vie sauve ?\n\n\"Est-ce parce que la flétrissure lui a été injustement infligée ?\n\n\"Que ceux qui soutiennent la politique de M. McKenzie, que ceux qui approuvent le bannissement de Riel et de Lépine, viennent devant l'opinion di-\nre quels sont les crimes des malheureux dont ils veulent faire des victimes.\"\n\nExtrait du Canadien du 15 février 1875 :\n\n\"Les ministres et leurs partisans dans la Chambre n'ont voulu tenir aucun compte de la population qu'ils représentent et dont ils sont les indignes mandataires.\n\n\"Des requêtes signées par des milliers de leurs constitutants auraient dû les rappeler au sentiment de leur devoir vis-à-vis du Bas Canada.\n\n\"Et puis, comment interpréter le rôle joué dans cette occasion par les ministres de la province de Québec, solidaires au même degré que leurs collègues des autres provinces, des élites et de la politique du gouvernement ? Que devaient-ils faire en présence d'un document qui représentait une manière si cavalière et si dédaigneuse les prières de la population entière de Québec et de tous les groupes de nos nationaux établis au Manitoba, dans Ontario et aux États-Unis ?\n\n\"N'ont-ils pas ressenti, comme nous, la réponse injurieuse que contenait ce document ? N'ont-ils pas compris l'opposition dénigrée que plus d'un million et demi de la population canadienne voulait s'interposer entre la justice et un meurtrier vulgaire pour empêcher ce dernier de recevoir une juste échappée ?\n\n\"L'élément protestant s'unit invariablement contre nous chaque fois qu'une question religieuse ou nationale surgit.\n\n\"On ne pourra pas nier qu'après avoir déclaré par les organes que Rioli et Lépine sont innocents, ils les reconnaissent aujourd'hui coupables en les bannissant.\n\n\"On ne pourra pas nier qu'après avoir exigé l'amnistie pleine et entière, comme nécessité politique et un droit, ils consentent à infliger un long exil à des hommes à qui ils avaient juré protection et fidélité.\n\n\"Mais un plus complet désir de justice n'a été enregistré dans les annales d'une nation.\n\n\"Nous désirons pour notre part, et au nom du parti conservateur dans les rangs duquel nous combattons, enregistrer notre protest contre l'action que viennent d'adopter les Communes de la Puissance. L'histoire, qui se fait vite en ce pays, jugera entre nos adversaires et nous.\n\n\"Ah ! nous pouvons attendre avec confiance le verdict de l'avenir, car nous sommes restés fermes dans le droit, et notre étendard porte dans ses plus glorieux le devoir accompli et la persévérance dans la justice.\n\n\"Nous avons été vaincus, écrasés par le nombre.\n\n\"Mais la lutte n'est pas terminée, il n'y a pas lieu de perdre courage.\"\n\nExtrait du Canadien du 20 février 1875 :\n\n\"L'effronterie des truquiers\n\n\"Nous avons sous les yeux depuis quelque jours le plus affligeant spectacle auquel un peuple puisse assister.\n\n\"L'injustice, la honte, les bassesses, les trahisons, les lâchetés, l'infamie, la dégradation, les flétrissures et les ignominies sont glorifiées et chantées avec une impudence qui n'a jamais eu d'égal en ce pays.\n\n\"Habitons nous une terre où les lumières de la civilisation ne sont pas parvenues pour que l'on croie pouvoir mépriser la vérité et le sens commun au point de les représenter comme le faux et le mensonge ?\n\n\"Riel et Lépine ont-ils été condamnés à cinq années d'exil par le parti qu'il libéral ?\n\n\"Aucun homme sain qui a sa tête à lui n'oserait répondre non.\n\n\"S'est-il trouvé vingt-trois députés\nqui ont voté contre ce banissement des chefs métis ?\n\n\"Qui voudrait nier ce fait aussi patent que l'existence du globe ?\n\n\"Ce qu'aucun homme ne voudrait soulever ouvertement et sous sa responsabilité, la presse libérale le soutient en ce moment avec un cynisme et une effronterie qui dépassent les limites du possible.\n\n\"Espérons-on être cru ? Nous ne le pensons pas ! Non ! Nous refusons de supposer que notre population soit si peu éclairée que d'ajouter foi à ce qui est manifestement faux et mensonger.\n\nNous avons trop de confiance dans l'intelligence de nos compatriotes pour douter un instant de leurs appréciations sur les événements politiques qui viennent de se dérouler à Ottawa.\n\nLe sentiment d'indignation qui règne d'un bout de la Province à l'autre est un indice certain d'opinion, et la presse ministérielle en cherchant à faire croire que le Bas-Canada sympathise avec les hommes déshonorés du pouvoir n'a qu'un but, donner le chargé à ceux qui ne connaissent pas le véritable état des esprits.\n\nQuel est, parmi les Canadiens français, celui qui peut venir devant ces compatriotes déclarer que Riel et Lepine sont des meurtriers ?\n\nCe que vous auriez honte de faire devant vos électeurs, lâches députés, vous l'avez fait en Chambre en affirmant par vos votes que Riel et Lepine sont des assassins et qu'ils méritent l'exil.\n\nNous mettons au défi le député le plus populaire du parti libéral d'expliquer franchement sa conduite devant son comté et de recevoir l'approbation de son vote.\n\nOn pourrait surprendre la bonne foi des populations par des mensonges et de fausses représentations. Mais que la position prise par les deux partis sur cette question soit nettement expliquée, et nous disons, sans crainte de nous tromper, que tous ceux qui ont voté pour les résolutions Mackenzie seront censurés.\n\n\"Prétendre le contraire, c'est dire que le Bas-Canada ne veut pas l'amnistie, c'est dire que toutes les requêtes que nous avons signées en faveur de Riel et de Lepine sont ridicules et n'ont pas leur raison d'être.\"\n\n[Le Canadien, 23 février 1875]\n\nLe devoir\n\nQue reste-t-il à faire ?\n\nFaut-il courber le front devant la trahison triomphante ?\n\nLaisserons-nous les coupables jouir tranquillement du pouvoir dont ils se sont servis pour nous couvrir de déshonore ?\n\nL'injustice est elle irréparable et devons-nous perdre espérance ?\n\nCoulant dans le patriotisme de nos concitoyens, nous répondons hardiment que les droits de Métis à nos sympathies sont à cette heure plus nombreux que jamais, car si la persécution sévit contre eux avec plus de fureur, notre devoir est de leur accorder une plus efficace et plus énergique protection.\n\nAh ! il vient une heure où le devoir outragé prend sa revanche ! Cette heure est sonnée pour cette troupe sinistre de représentants du peuple, infidèles à leur mandat, rebelles à leurs promesses, oubliques de leurs sentiments nationaux !\n\nCe n'est peut-être pas un mal que la morale publique soit insultée ! Elle force les gens honnêtes à s'unir pour revendiquer ses droits.\n\nDans cette entente pour renverser la justice foulée aux pieds, la cause du Nord-Ouest trouvera une puissance irresistible !\n\nQue tous ceux qui n'ont pas en eux les instincts de Judas... se mettent à l'œuvre pour réparer l'injure...\n\nLa lutte sera ardente, difficile. Les coupables feront d'incroyables efforts pour faire triompher leur politique d'écrasement et de destruction à l'égard des\nmétis. Tous les moyens leur sont bons, pourvu qu'ils puissent servir à leurs fins. L'influence que peut donner le pouvoir quand on ne craint pas d'en abuser, sera jetée dans la mêlée.\n\n\" Mais, \" à force d'être désolant, le spectacle finira par être instructif. \" Le peuple justement irrité ne saurait laisser longtemps encore le soin de ses destinées aux prévaricateurs qui viennent de se déshonorer par un acte infamant pour eux et fatal pour le nom Canadien. \"\n\nExtrait du Canadien du 3 mars 1875 :\n\n\"Dans l'affaire du Nord-Ouest, la question qui occupe depuis si longtemps l'opinion est une question de droit et de justice, une question de traité, nous pourrions presque dire une question internationale. Car enfin, les complications qui ont surgi sont les résultats d'une espèce de traité conclu entre le peuple métis et la Puissance du Canada.\n\n\"En refusant d'exécuter les conditions du traité, les promesses faites, les hommes du pouvoir se rendent coupables d'une violation flagrante du droit des nations, en même temps qu'ils donnent au monde l'exemple d'un peuple reniant la foi jurée, donnant à la force la suprématie sur le droit.\n\n\"Quand nous voyons des journaux écrivant au nom d'un parti, essayer de détruire dans l'esprit du peuple ces notions du droit qui sont les sauvegardes des sociétés, notre devoir, comme celui de tous les hommes d'ordre, est de dénoncer les tendances démoralisatrices de ce parti.\n\n\"Ancantissez chez un peuple le respect du droit, il ne reste plus à l'ordre que la garantie insuffisante du châtiment.\"\n\nDiscours de l'honorable Ouimet à la Salle Jaque Cartier, le 11 février 1875 :\n\n\"Oui, il faut que TOUS ceux qui ont voulu revendiquer leurs droits mé-\n\"pleine et entière,\" et vous, libéraux,\n\"vous osez condamner ces gens à un\n\"exil de cinq ans ! c'est une infâme !\" \nEt l'honorable député pour le comté de\nQuébec doit s'en souvenir, de grandes\nassemblées furent tenues à Québec\npour protester contre la politique insi-\nme de M. MacKenzie qui n'accordait\npas une amnistie que Cartier avait\npromise. Et ce n'est pas seulement ici\nqu'on a tenu ces assemblées, on en a\ntenu aussi à Montréal et dans beaucoup\nde paroisses. Je me rappelle qu'au mi-\nlieu de cette agitation, nous avons fait\nune élection dans le comté des Deux\nMontagnes où j'ai été supporter mon ami\nWilfrid Prévost, un des hommes les plus\ndistingués du pays ; et là on avait-tel-\nlement soulevé la population parce que\nl'honorable M. MacKenzie n'avait pas\naccordé une amnistie pleine et entière,\nqu'on fit écraser M. Prévost. Comme\non le voit, il y avait un grand soulève-\nment alors ; et on a vu des prêtres fort\nintelligents, fort dévoués à la cause\nnationale et qui disaient : \"Nous ne\nsommes pas intervenus jusqu'à pré-\nsent dans la politique, mais puisque\nle gouvernement ne veut pas rendre\njustice à ces deux malheureux, il doit\ntomber.\" Vous savez que ça n'a\npas pris grand temps, car ce n'est pas\nseulement la question de la protection\nqui a ébranlé le gouvernement libéral\ndans cette province, mais c'est surtout\nle mouvement qui fut fait ici, au sujet\ndes troubles du Nord-Ouest. Et dans ce\ntemps-là, les honorables messieurs qui\nvont voter contre nous ce soir, étaient-\nils du côté de la corde ou du côté de\nla miséricorde ? Étaient-ils pour le\npardon ou pour l'échafaud ?\nM. Nantel.—On était du côté de\nl'honorable M. Masson.\nL'honorable M. Marchand—Vous\navez bien chargé.\nM. Nantel—Je n'ai pas changé.\nL'honorable M. Mercier—Quelle\nétait donc la cause de ce mouvement-\nlà ? C'était qu'on bannissait Louis\nRiel. Quelle est la cause du mouvement\naujourd'hui ? c'est qu'on l'a pendu.\nEst-ce que l'indignation qui existait à\ncette époque chez les conservateurs\nparce qu'on avait condamné Riel à un\nexil de cinq ans, était plus justifiable\nque notre indignation aujourd'hui, lors-\nque Riel a été pendu ? Puisque dans\nce temps-là, le patriotisme de ces mes-\nsieurs les poussait à dénoncer les libé-\nraux qui n' accordaient pas une amnis-\ntie pleine et entière, comment se fait-il\nqu'ils nous recrochent aujourd'hui de\ndénoncer Sir John A. MacDonald qui\na pendu Riel ? Est-ce que Riel a été\nplus coupable cette fois-ci que-dans ce\ntemps-là ? Lisez donc les procès-\nverbaux de l'assemblée législative de\nManitoba! Lisez donc les procès-verbaux\ndes assemblées des habitants du Nord-\nOuest! Lisez donc les mille pétitions qui\nont été jetées au panier par le ministre\nde l'Intérieur, et vous verrez la Chambre\nde Manitoba protestant contre la\nmauvaise foi du gouvernement fédéral\nau moins dix fois depuis que cette\nprovince est érigée. Vous trouverez des\nmilliers et des milliers de résolutions,\ntant dans le Nord-Ouest qu'à Winnipeg,\nà St Boniface et ailleurs, de partout,\nprotestant contre la manière indigne\ndont les métis et les sauvages étaient\ntraités. Vous trouverez dans ces\npétitions des représentations comme\njamais nos pères n'en ont fait en\n1837. Et c'est après tout cela que Louis\nRiel, qui s'était rendu au Montana,\nrevient dans son pays pour faire rendre\njustice à ses frères du Nord-Ouest, à la\ndemande de qui? À la demande du clé-\ngé! Ceux qui veulent ici encore se couvrir\ncomme en d'autres occasions du man-\nteau de la religion font un acte d'hypoc-\nrisie. Il faut arracher le masque avec\nlequel ils se cachent la figure. On a beau\nle nier, les délégués qui sont allés au\nMontana trouver Riel étaient porteurs\nd'une lettre du Père André. Et que\ndisait le Père André dans cette lettre ?\nEn substance il disait : \"Monsieur\nRiel, nous vous en conjurons, venez à\nnotre secours. Il n'y a que vous qui\n\"rendre justice. Il n'y a que vous qui soyez capable d'empêcher une révolution comme celle qui nous menace.\" Est-ce qu'on a oublié cela ? Et ce pauvre malheureux Louis Riel, écoutant son patriotisme, écoutant l'appel du bon Père André, se rend chez les siens : qu'est-ce qui s'est passé alors, monsieur l'Orateur ? Riel a d'abord employé les moyens constitutionnels et a attendu que justice fût rendue aux siens et au lieu de la justice, on leur a envoyé la police et on a répondu à leurs pétitions par des balles.\n\nOn connaît les événements qui ont suivi ; après une défense héroïque, les braves Métis ont été écrasés, leur chef a été fait prisonnier, a été accusé de haute trahison et a été pendu.\n\nLE PROCÈS DE RIEL\n\nRiel a-t-il eu un procès juste ? Non. Il n'a pas eu la chance de faire sa défense. J'ai deux lettres précieuses qu'on a eu l'obligeance de me remettre et qui prouvent que Riel n'a pas eu un procès juste. Elles sont écrites aux avocats de Riel et elles disent des choses bien graves. Les voici :\n\nD'abord celle de Napoléon Naud:\n\nDakota, St John,\nRollette county.\n\n31 juillet 1885\n\n\"Messieurs, d'après les quelques nouvelles que j'ai vues sur le journal, je vois que M. Riel a l'intention de me faire venir auprès de lui pour lui servir de témoin. Je suis très satisfait de cela, s'il croit que je peux lui être utile et en même temps je crois que je peux lui être utile. J'irai sur le terrain anglais, si le gouvernement Canadien montre de bons papiers qu'il me ramènera ici sain et sauf. Je crois que vous, messieurs les avocats, vous pouvez forcer le gouvernement à agir de cette manière. Je voyais sur le journal que M. Riel disait que j'avais des documents qui lui seraient très utiles. Vous aurez la bonté de lui parler de cela, afin que je puisse être au courant de cette affaire. J'ai confiance que vous me répondrez pour me dire de quelle manière je dois agir. Vous aurez la bonté de saluer mon cher cousin Louis Riel. Je termine en vous saluant ainsi que tous les prisonniers, sans exception. Au revoir donc, chers avocats. Votre ami.\n\n(Siglé) NAPOLEON NAULT.\"\n\nVoici maintenant celle qui est écrite par MM. Carter et Ciayburg, avocats de Helena, Montana, en date du 13 juillet 1885. Je traduis :\n\n\"En réponse à la votre du 6 courant, nous avons le plaisir de vous dire que Dumont est chaudement favorable à la cause de Riel, et si son témoignage pouvait être envoyé d'ici, nous croyons qu'il serait très utile à votre défense.\n\n\"Les déductions générales que nous pouvons tirer des informations de Dumont, en autant que Riel est concerné, sont comme suit :\n\n\"1o Dans l'été de 1884, il fut décidé, à une assemblée de Métis, d'envoyer au Montana pour chercher Riel, qu'ils considéraient connaître les droits qui leur avaient été garantis par traités fait avec le gouvernement. L'assemblée choisit Dumont comme un des délégués qui devaient se rendre à la mission de Saint-Ignace, Montana, auprès de Riel.\n\n\"2o Riel retourna avec Dumont et demeura dans le Nord-Ouest, sans avoir l'intention d'y rester définitivement, mais comme avocat des droits de son peuple, tels que constatés par des traités.\n\n\"3o Riel conseilla toujours des moyens pacifiques et voyant que ces mesures étaient inutiles, il fit connaître trois semaines avant les troubles, son intention de retourner au Montana.\n\n\"4o Le peuple l'a empêché de retourner chez lui.\n\n\"5o La guerre commença et fut dirigée par un conseil de quatorze, dont Riel ne faisait pas partie.\n\n\"6o Dumont avait seul la charge des troupes et était responsable au conseil seulement.\"\n\"70 Riel n'a pris part à aucun engagement, excepté le dernier, quand il fut chassé de sa maison avec le reste de la population.\n\n\"90 Dumais corroborera les dires de Dumont. Tous sont deux ici et très anxieux d'aider leur ami.\"\n\nAinsi Riel a été demandé de se rendre là pour défendre les droits des Métis. Il n'a pas fait un seul acte de rébellion. Le conseil des quatorze est le seul qui ait conduit la rébellion. Dumont, qui était chargé des troupes, relevait du conseil dont Riel ne faisait pas partie. Riel n'a pris part à aucun engagement, excepté à celui de Batoche, quand il lui a fallu sortir pour défendre sa vie. Si ces faits-là sont vrais, il était bien important d'en permettre la preuve et de donner une chance à Riel d'avoir ces documents. Eh bien ! M. l'Orateur, allez-vous dire qu'il a eu un procès juste ? allez-vous dire qu'on l'a traité même comme on traiterait un étranger qui viendrait dans ce pays-ci ?\n\nDepuis vingt-cinq ans que je pratique comme avocat, j'ai été bien souvent appelé à défendre des étrangers que je n'avais jamais connus, pour des crimes quelquesfois odieux. Je ne les défendais pas parce qu'ils avaient trop aimé leurs semblables, je les défendais malgré qu'ils les avaient volés ou tués. Ces gens-là ne parlaient pas la langue de la majorité de la population de cette province ; ces gens-là étaient étrangers ; ils n'avaient pas le parents ici. D'abord la loi était là ; ils avaient droit à six jurés parlant leur langue et ils les avaient. Et quand ils avaient besoin d'écrire à leur famille pour obtenir des renseignements ou de la protection, jamais on ne leur a refusé. Quand ils ont eu besoin de se faire recommander par quelques personnes influentes dans les pays étrangers, j'allais faire mon application aux juges et j'en suis encore en chercher un qui m'ait refusé. Et ces gens-là qui, quelquefois, étaient des misérables, des échappés de prison, étaient placés dans la boîte des prisonniers et demandaient au nom de la constitution anglaise, eux, des va-nu-pieds, des rebus de n'importe quelle société, ils demandaient de placer parmi les douze jurés six jurés anglais, et cela ne leur était pas refusé, parce que c'est la loi dans la province de Québec. C'est aussi la loi du Manitoba, la loi de 1875 passée par les libéraux et dont l'honorable Solliciteur général a parlé l'autre jour. C'est la loi de 1877.\n\n(Une voix à droite) Non ; la loi du Nord-Ouest ne donne que six jurés.\n\nL'honorable M. Mercier—Je ne parle pas de la loi du Nord-Ouest, je parle de la loi du Manitoba.\n\nPourquoi donc Riel n'a-t-il pas été jugé en vertu de cette loi du Manitoba ? Ces messieurs qui sont si savants peuvent-ils nous le dire ? C'est parce qu'en 1830 les conservateurs ont changé la loi. [Non ! non ! à droite.] Vous niez ? Je vais vous en donner la preuve.\n\nL'ORIGINE DE LA LOI ACTUELLE\n\nVoici la loi, telle que passée par les libéraux en 1875—c'est la section 66 du statut 38 Victoria, chapitre 49, qui se lit comme suit :\n\n\"Tout magistrat stipendié des dits territoires, ou le juge en chef, ou tout juge de la cour du Banc de la Reine de la province de Manitoba, aura le pouvoir de faire amener et incarcérer dans la province de Manitoba, pour être jugé par la dite cour du Banc de la Reine, conformément à la procédure des lois criminelles en vigueur dans cette province, toute personne accusée, en aucun temps, de la commission d'une offense contre les lois ou ordonnances en vigueur dans les territoires du Nord-Ouest, entraînant la peine capitale ou l'emprisonnement au pénitencier ; et la cour du Banc de la Reine, ou l'un des juges de cette cour, aura pouvoir et autorité de faire subir le procès à toute personne mise en accusation devant...\"\ncette cour à cet égard, et les lois du jury et les lois de procédures criminelles s'appliqueront à ce procès, sauf que la peine prononcée, sur conviction de l'accusé, sera conforme aux lois en vigueur dans le territoire du Nord-Ouest; et la sentence pourra être exécute dans un pénitencier ou autre lieu de détention dans les territoires du Nord-Ouest ou dans la dite province, comme s'ils se trouvaient dans les territoires du Nord-Ouest.\"\n\nEn vertu de cette section du statut de 1875, Riel aurait pu subir son procès à Winnipeg où il aurait eu un jury de douze, dont six parlant sa langue. Il est vrai que le statut 40 Victoria, chapitre 7, passé par les libéraux en 1877, a changé certaines clauses du statut de 1875, mais ces changements ne touchent pas à la section 66, qui n'a été amendée que par les conservateurs en 1880. Il est donc de fait que le statut qui a privé Riel de l'avantage d'avoir son procès à Winnipeg, devant un juré de douze, dont six parlant le français, il est de fait, dis je, que le statut qui a privé Riel de cet avantage est un statut passé par les conservateurs.\n\nIl est un autre fait qu'il importe de signaler.\n\nLe statut de 1875 et celui de 1877, tous deux passés par les libéraux, pourvoyaient d'un manière spéciale, régulière, au choix et à l'assignation des jurés, au lieu que le statut de 1880, passé par les conservateurs, laissait tout cela à l'entière discrétion du juge. On a vu par la conduite du magistrat Richardson les inconvénients que comporte cette décision, quand elle échoit à un homme comme celui qui a jugé Riel et n'a pas mis un seul français dans le jury.\n\nDonc, quand les partisans de la corde disent que le procès de Riel s'est fait en vertu d'une loi passée par les libéraux, ils disent tout simplement une fausseté et si les conservateurs, par le statut de 1880, n'avaient pas fait disparaître la section 66 du statut passé par les libéraux en 1875, le pauvre patriote métis aurait pu subir son procès à Winnipeg devant douze jurés, dont six parlant le français, et, surtout, devant un juge digne de porter l'hérmine, et non pas devant un ignare valet de Sir John MacDonald, comme le notoire magistrat Richardson.\n\nIl y a plus encore, en ce qui regarde l'équité du procès : la loi même de 1880—43 Victoria, chapitre 25—si informe et si injuste qu'elle soit, n'a pas été observée.\n\nD'après la sous-section 7 de la section 76 de ce statut, le juge qui présidera au procès doit faire prendre par écrit la preuve produite. La raison, la nécessité de cette formalité sont évidentes. La section 77 du même statut permet l'appel à la cour du banc de la reine à Winnipeg et il est bien clair que pour prendre cet appel, il faut que la preuve ait été prise par écrit, car autrement il serait impossible de produire cette preuve devant le tribunal d'appel à Winnipeg.\n\nEh bien ! que voyons-nous dans le procès de Riel ?\n\nLa preuve la plus importante dans ce procès était incontestablement la preuve de la folie de l'accusé, puisque la justification ne saurait être admise en matière de trahison. La preuve de cette folie, elle a été faite par le P. André et le Dr Roy ; par le P. André qui, d'après la lettre exhibée par Sir A. P. Caron, avait fait venir Riel dans le Nord-Ouest, avait été en rapports journaliers et constants avec lui, jusqu'au moment où la rébellion éclata ; par le Dr Roy, qui avait eu Riel sous ses soins à l'asile de Beauport, avait fait une étude particulière de ce cas durant son séjour à Regina ; or cette preuve si importante, si essentielle à la cause, elle n'a été consignée au dossier que d'une manière informe, évidemment incomplète, puisqu'on n'en a donné qu'une traduction, et cela en violation des dispositions de la clause 91 du statut de 1880, décrétant que la\nlangue française est langue officielle et permise devant tous les tribunaux. Mais comme on n'avait pas voulu donner à Riel un seul juré parlant le français et qu'on n'a pris à Régina que des jurés parlant l'anglais, je suppose que cette violation de la clause 94 était regardée comme une affaire à la mode et tout à fait à l'unisson avec le reste des procédures, dans lesquelles ni les Français ni la langue française n'eurent voix au chapitre.\n\nIl est un autre fait qu'il ne faut pas perdre de vue.\n\nTout sujet britannique a le droit d'être jugé par douze de ses pairs, c'est-à-dire au procès par jury, tel qu'il est garanti et consacré par la constitution anglaise et tel qu'il existe en Angleterre. Aurait-on le droit, aujourd'hui, de priver de ce privilège, qui est une des plus belles parties de la constitution anglaise, aurait-on le droit de priver de ce privilège les habitants de la province d'Ontario, de la Nouvelle-Écosse ou du Nouveau Brunswick ? Non, assurément ! Eh bien ! on n'avait pas plus le droit d'en priver les habitants des Territoires du Nord-Ouest, qui n'ont pas de représentants dans le parlement fédéral. Les droits de ce parlement, ses pouvoirs législatifs lui ont été délégués par le parlement impérial, mais cette délégation n'a jamais pu comprendre le droit d'enlever aux habitants du pays le privilège du procès devant douze jurés, qui existe de par la constitution et qui ne peut être restreint que par une disposition législative spécifique, dérogant au droit commun.\n\nCeci est élémentaire et aurait dû guider la décision du tribunal d'appel de Winnipeg, qui n'a tenu aucun compte de cette considération.\n\nIl est un autre point qui démontre encore mieux l'injustice et l'irrégularité du procès de Riel.\n\nEn Angleterre, on a entouré de formalités particulières les procès pour trahison, afin d'assurer aux accusés la plus grande protection possible contre l'injustice, la partialité et la persécution. On a enlevé le choix du jury au shérif, parce que ce dernier est un officier du gouvernement, que le gouvernement pourrait influencer, vu qu'il se trouve partie en cause dans les procès pour trahison, et l'on a mis ce choix entre les mains du juge et du peuple afin de donner toutes les garanties possible à l'accusé et de lui assurer un procès impartial et équitable. [Coke's Institutes].\n\nTelle est la procédure que prescrit la loi anglaise. Est-ce bien la procédure qu'on a suivie à l'égard de Riel ? Est-ce que dans le procès du pauvre chef des métis, on a bien pris ces précautions que prescrit la loi anglaise pour protéger l'accusé contre l'influence du gouvernement, qui se trouve directement en cause dans un procès pour trahison ? Non, monsieur : c'est tout le contraire qui a été fait ; c'est le gouvernement qui a tout organisé, le jury et le procès, pour avoir un verdict en sa faveur et assurer quand même la condamnation de Riel. Le gouvernement a commencé par faire venir à Ottawa le magistrat Richardson, qui n'était pas un juge indépendant, mais l'officier révocable à volonté du ministère. Je ne sais pas ce qui s'est passé dans les entrevues secrètes du magistrat Richardson avec les ministres, mais la manière dont ce magistrat a présidé au procès m'autorise à dire qu'il a dû recevoir des ministres des instructions défavorables à Riel, injustes et iniques à l'égard de ce dernier. En Angleterre, un acte comme celui-là aurait soulevé l'indignation publique et provoqué à bon droit les plus violentes récriminations.\n\nCe n'est pas tout. Après avoir fait venir le magistrat Richardson à Ottawa, évidemment pour lui donner des instructions contraires à la justice et à l'esprit de la loi, le gouvernement a envoyé à Régina un de ses employés, le sous-ministre de la Justice, pour organiser le procès à sa guise. Or cet employé était intéressé personnellement à faire\ncondamner Riel, puisque la rébellion avait été causée par la mauvaise administration du département de l'intérieur, dont cet employé était le chef. Cet homme avait intérêt à faire condamner Riel pour pallier ses propres fautes, il avait intérêt à faire condamner Riel pour dissimuler les fautes des ministres dont il était l'employé et le fait seul qu'il a été envoyé à Regina m'autorise à dire que le procès du chef métis a été organisé avec partialité et fait contrairement aux dictées les plus élémentaires de la justice et de l'équité qui doivent caractériser tous les procès, mais qui doivent surtout caractériser les procès dans lesquels la vie et l'honneur d'un citoyen sont en jeu.\n\nEnfin, M. l'Orateur, on a confié au magistrat Richardson, nommé durant son plaisir, le choix du jury chargé de décider le cas du gouvernement ! Cela en dit assez pour faire voir quelle espèce de procès on a fait à Riel. On a beau dire que ce procès a été fait conformément à la lettre de la loi, il reste acquis qu'il n'a pas été fait d'une manière conforme à l'esprit de la loi par excellence, la constitution anglaise, qui veut que tout accusé soit jugé par douze de ses pairs, en dehors de toute influence, de toute partialité, de tout intérêt sollicitant quand même un verdict de culpabilité. On ne sortira jamais de là et l'histoire impartiale dira que Riel a été jugé d'une manière injuste, partielle et même inique. Voilà ce que l'histoire dira à la postérité !\n\nLe Soliciteur général a parlé d'une invention des libéraux pour écraser les Métis. La voilà, cette invention ! Elle date de 1875 et elle aurait pu sauver Riel.\n\nEt l'invention de vos chefs, c'est la loi de 1830, qui a enlevé à Riel le droit d'avoir un procès à Winnipeg et qui l'a forcé à subir la loi du Nord-Ouest, passée exprès pour écraser les Métis. (Murmures à droite.)\n\nLes honorables députés ont beau faire des signes de tête et dire non,\nprocès devant douze jurés, dont six parlaient sa langue, et quand il s'est agi du procès de Louis Riel, on s'est bien contenté d'un magistrat anglais qui est venu chercher ses instructions à Ottawa, et quand il s'est agi d'envoyer des avocats pour le mettre en accusation, on ne s'en est pas rapporté à ceux qu'il y avait sur les lieux, on a envoyé deux avocats d'Ontario, un avocat de Québec........et le sous-ministre de la justice, pour que toutes les forces du gouvernement fussent à la disposition de la cour. On a réuni toutes les forces de cette immense puissance qu'on appelle le Dominion du Canada contre ce pauvre métis, et on n'a pas seulement eu la justice ordinaire de voir à ce que les dépositions dans sa cause fussent écrites en français! (Ecoutez, écoutez!) Oui ! quand on a porté la cause en appel, il a fallu plaider sur une traduction; on n'avait pas le texte des dépositions. On a violé les principes les plus élémentaires de la justice et l'on vient nous dire que Riel a eu un procès juste et que la province de Québec n'a pas d'intérêt là-dedans! Mais qui donc a payé le Nord-Ouest? Sont-ce les gens d'Angleterre? Ce sont eux qui nous ont fait payer trois cent mille livres sterling, mais c'est nous qui les avons payés! Qui a dépensé quatre cent mille piastres pour le cadastre du Nord-Ouest? C'est vous, c'est moi, ce sont les citoyens de ce pays. Qui va payer les deux cent millions que coûtera le chemin de fer du Pacifique? Ce sont les deux grandes provinces de Québec et d'Ontario. Et nous n'avons rien à faire là-dedans? Qui va payer les dix millions que la guerre va nous coûter? Sont-ce les sauvages du Nord-Ouest? les Métis? L'Angleterre? Non: c'est vous, ce sont les citoyens de Québec et d'Ontario. Et nous n'avons pas d'affaire là? Comment! Voilà un citoyen de nos nôtres qui souffre persécution de la part des orangistes, qui est jugé comme on ne jugerait pas un chien dans ce pays, et nous n'aurions pas d'affaire à intervenir?\n\nRÔLE ET FÉROCITÉ DES ORANGISTES\n\nOn a entendu des députés dire: Qu'est-ce que les orangistes ont eu à faire avec cela? Que les orangistes aient donc le courage de leurs convictions. Puisqu'ils veulent voter contre nous, au moins qu'ils votent à masque découvert et qu'on les voie. Les orangistes ont passé résolutions sur résolutions pour demander la tête de Riel. Si les orangistes veulent nous gouverner, il est bon qu'on le sache. Voici les résolutions que six loges orangistes ont passées demandant la tête de Riel. On va voir si les orangistes qui disent aujourd'hui qu'ils n'ont rien eu à faire avec cela ne s'en sont pas mêlés.\n\nJe prends le résumé suivant d'un excellent discours fait à Ottawa par un député conservateur:\n\n\"L'Orange-Sentinel du 6 août 1885, quelques jours après l'exécution et avant que la question de la folie de Riel ne fût réglée autrement que par ce qui ressortait du procès, disait les paroles suivantes:\n\n\"Nous soutenons qu'il est du devoir du gouvernement de ne pas prendre en considération cette recommandation à la clémence, mais au contraire, dans l'intérêt de la Puissance toute entière de laisser la loi suivre son cours.\"\n\nLa Sentinelle continue à argumenter en faveur de l'exécution de Riel, parce que:\n\n\"Il a commis un meurtre des plus détestables et des plus atroces sur la personne d'un loyal sujet protestant.\" [Le nommé Scott.]\n\n\"S'il l'avait commis sur la personne d'un Papiste, la chose aurait été pour le mieux, mais il l'a commis sur la personne d'un sujet protestant.\n\n\"Le sang de ses nombreuses victimes crie vengeance!\"\nLe 10 du mois de septembre, la Sentinel dit :\n\n\"Riel a subi son procès et a été convaincu d'une manière impartiale et la sentence de la cour doit être exécutée.\"\n\nUn correspondant, qui signe un Deputy Master of Loyal Orange, Loge No 1041, Chatham,\" disait le 29 octobre 1885 :\n\n\"Comme représentant du corps orangiste, je désire rappeler à Sir John Macdonald, qui fait aussi partie de la même société, qu'une grande responsabilité lui incombe, en ce qui concerne le sort de Riel. Si Sir John venait à s'interposer pour obtenir le pardon d'un homme convaincu pour la seconde fois de rébellion et du meurtre de Scott, il ferait de la justice une pure moquerie, etc.\"\n\nLe 29 octobre, le rédacteur du même journal disait :\n\n\"En s'efforçant d'amener le gouvernement à comprendre la nécessité de pendre Riel, lorsqu'éclata la première insurrection sous sa direction personnelle, un homme dont le seul crime était sa loyauté à la couronne britannique, a été égorgé sans l'ombre d'une raison. Le sang de Thomas Scott crie encore justice.\"\n\nLe 6 novembre 1885, le frère Morton, dans une assemblée de la Loyal Orange Lodge, No 821, a dit :\n\n\"Et cet archi-rebel est resté libre, tandis que tant de loyaux orangistes ont arrosé le sol de leur sang pour soutenir l'autorité de la Reine ? Jamais.\" [Vifs applaudissements.] Et le plus tôt le gouvernement de Sir John Macdonald comprendra les véritables sentiments des orangistes sur cette question sera le mieux heureux de voir dans les discours du County Master Senators du County Master Wilson et des frères Graham et Low, la détermination qu'ils ont exprimée, que si le gouvernement\n\n\"permet à Rome de s'ingérer dans cette affaire et de procurer un sursis à cet archi-traitre, le parti conservateur ne doit plus compter sur leurs services, bien qu'ils aient travaillé et voté pour lui depuis de longues années.\"\n\nLe 10 septembre, à une réunion régulière de la Loyal Orange Lodge No 884 tenue à Hamilton, la résolution suivante a été unanimement adoptée, sans une seule voix dissidente :\n\n\"A l'assemblée régulière de la L.O. L. No 814, Merriton, tenue dans ses salles le 2 septembre, la résolution suivante a été adoptée à l'unanimité :\n\n\"Il est résolu que nous, membres de la loge ci-dessus mentionnée, croyons que Riel, l'archi-traitre des Territoires du Nord Ouest, ayant été accusé et convaincu du crime de haute trahison et condamné, la sentence doit être mise à exécution et Riel exécuté, et en autant qu'il sera en notre pouvoir de le faire comme électeurs, nous nous opposerons constitutionnellement à tout gouvernement qui commuera la dite sentence ou interviendra pour l'empêcher d'être mise à exécution.\"\n\nSigné au nom de la loge,\n\nW. J. Smith W. M.\n\nT. W. Wilson Sec.\"\n\nVoilà un ordre pur et simple. La sentence passée contre Louis Riel, juste ou injuste, qu'il soit sein d'esprit ou insensé, doit être exécutée, autrement tous les orangistes de la loge voteront contre le gouvernement. Sans aucune doute cette résolution a été envoyée au frère Sir John Macdonald, qui ajoute à ses autres dignités celle de \"Chevalier de la Pourpre Royale.\" [Knight of the Royal Scarlet.] Il fallait obéir à cet ordre ou y a obéi, et Riel a été pendu en obéissance à cet ordre. Un membre de L.O.L. No 693 écrit à la Sentinel en septembre 1885, et déclare :\n\n\"Que si Riel n'est pas exécuté, les\ncandidats conservateurs perdront presque tous leurs supports dans la péninsule.\"\n\n\"A une assemblée régulière de la L.O.L. No 1457, Nelson Manitoba, il a été résolu :\n\n\"Que nous refuserons de supporter tout gouvernement qui ne verra pas à ce que la justice soit rigoureusement appliquée à tous ceux qui ont été engagés dans la rébellion.\"\n\nLa L.O.L. No. 1505 a adopté, le 22 septembre, la résolution suivante :\n\n\"Que cette L.O. Lodge insiste fortement auprès du gouvernement sur l'importance de mettre ces décisions à exécution sans délai,\" etc.\n\nA une assemblée tenue le 22 septembre, 1885, dans la salle de la loge de la ville de Dunmore (L.O.L. No. 1499), la résolution suivante a été passée :\n\n\"Que nous, comme membres de la L.O.L. No. 1499, voyons avec défiance l'action du gouvernement, par l'emprunt du gouverneur général, en accordant un sursis à cet archi-traitre, Louis David Riel, et que c'est effectivement une tentative faite dans le but de tromper les fins de la justice. Nous refusons, en conséquence, de supporter tout gouvernement qui interviendrait ainsi et permettrait à ceux qui sont impliqués dans la rébellion du Nord-Ouest, d'échapper à la pénalité d'une juste sentence.\"\n\nLa résolution suivante a été passée par la L.O.L. No. 300 :\n\n\"Que nous, comme orangistes, voyons avec un sentiment de crainte et de regret la situation présente de la question Riel, qui bien que condamné à être pendu le 10 du mois dernier, vit encore. Nous recommandons fortement qu'on ne permette aucun subterfuge et qu'aucun délai ne soit accordé qui permettrait à ce chef rebelle, justement condamné, d'échapper au châtiment. Nous désirons aussi formellement que nos frères, par tout le Canada, s'unissent pour empêcher qu'aucun outrage ne soit fait dans cette question à notre Reine et à notre pays, que nous, comme orangistes, nous nous sommes unis pour cherir et protéger.\"\n\nA une assemblée régulière de la L.O.L. No 80 Peterborough, tenue le 3 novembre 1885, la résolution suivante a été passée :\n\n\"Que la L.O.L. No 80 voit avec regret les obstacles suscités dans le but d'empêcher la juste peine d'être appliquée sur l'échafaud au rebelle Riel pour ses nombreux crimes, et que cette loge est d'opinion qu'aucun autre sursis ne devrait lui être accordé, mais qu'il devrait souffrir la dernière pénalité de la loi et être pendu pour l'accomplissement de la sentence portée contre lui, et qu'une copie de la présente résolution soit transmise au Très Hon. Sir John A. Macdonald.\"\n\nW. Jamieson,\nSecrétaire.\"\n\nA une assemblée de la L.O.L. No. 425, tenue le 5 novembre 1885, il a été résolu :\n\n\"Que nous, comme loyaux sujets de Sa Gracieuse Majesté la Reine, croyons qu'il est de notre devoir de nous efforcer de faire comprendre à nos représentants au parlement la nécessité d'une administration de la justice honnête, virile et dénuée de crainte, au sujet de l'exécution de Louis Riel justement jugé, deux fois condamné et ayant subi sa sentence comme archi-rebelle et comme meurtrier.\"\n\nLe temps ne me permet pas de lire toutes les résolutions, même toutes celles qui sont en ma possession. Non seulement j'accuse ce gouvernement d'avoir été influencé par le corps des Orangistes Loyaux, mais encore, et cela à la honte éternelle de cette société, à peine l'âme de Louis\nRiel eut-elle paru devant son Créateur, qu'ils se réjouissaient déjà de l'outrage qui avait eu lieu sur l'échafaud de Régina. À une assemblée régulière de la L. O. L. No 1528, tenue à Moosomin, quatre jours après l'exécution, la résolution suivante fut passée :\n\n\"Que nous, membres de la L. O. L. No 1528, félicitations par la présente le gouvernement d'avoir mis à exécution la sentence de mort passée contre l'archi-rebel et traître Louis Riel et que le sang de notre frère Scott assassiné est enfin vengé après quinze ans ; et que nous nous engageons à soutenir le gouvernement qui a prouvé que justice serait faite à toutes les classes quelle que soit leur croyance, et de plus, si aucun trouble s'élevait grâce à l'intervention des Catholiques Français ou Romains dans l'administration de nos lois où droits, nous supporterons le gouvernement et notre constitution et nos lois, même jusqu'à répandre notre sang pour la défense de ces dernières.\"\n\nNon satisfaits d'avoir exécuté Riel, ils se sont assemblés en un conclave solennel et ont passé une résolution, félicitant le gouvernement sur la tragédie qui venait d'avoir lieu. À une assemblée régulière de la L. O. L. No 1222, la résolution suivante fut passée :\n\n\"Que nous, membres de la Boyne L. O. L. No 1222, ici assemblés, désirons exprimer notre satisfaction de ce qu'on ait permis à la loi de suivre son cours dans le cas de Louis Riel, le chef de la dernière rébellion au Nord-Ouest, qui lundi le 16 novembre a subi la peine due à ses nombreux crimes et qui était responsable de la perte de nombreuses vies d'une grande valeur, parmi lesquelles étaient deux des membres de notre noble ordre.\"\n\nUn manifeste a été lancé par le Royal Black Chapter de Western Ontario, et dans ce manifeste apparaît le langage suivant :\n\n\"Nous croyons qu'à aucune époque de notre histoire comme Grand Black Chapter nos principes de loyauté, d'amour et de dévouement n'ont été plus confirmés que dans le moment présent, alors que des artifices comportant haute trahison sont mis en jeu d'une manière si blessante et alors que le Romanisme s'insinque d'une manière aussi énergique dans nos institutions civiles, et alors qu'un rebelle de ces derniers temps, un traître insigne à notre pays est élevé comme un saint et un martyr, béatifié par une grande partie de la presse libérale, par le Gobe lui-même, essayant de renverser le monde sur l'axe de l'agitation infectée de Riel.\n\n\"Jamais il n'a été plus nécessaire pour nous d'être sur nos gardes, qu'aujourd'hui, à cause de la politique agressive de nos vigilants ennemis, et cela surtout lors que non seulement les hommes sont en danger, mais même nos institutions. Mais nous sommes persuadés que celui qui règne dans les ciels rira, le Seigneur les tournera en dérision.\"\n\nMonsieur l'orateur, je vais plus loin ; j'accuse le gouvernement et le premier ministre de ce gouvernement, le jour de l'exécution à peu près d'intervalle de cet événement (la pendaison de Riel) d'avoir reçu plus d'un témoignage de maîtres de loges orangistes déclarant : \"Bien fait ! bon et fidèle serviteur, nous voterons tous pour vous et pour toujours !\" Vous êtes fier cela ? Le premier ministre ou le ministre des travaux publics le nieront-ils ? Mais ce n'est pas tout. Non seulement les loges orangistes et les Orangistes ont demandé à grands cris le sang de Riel et se sont tous réjouis de sa mort tragique, mais ils ont menacé ceux qui croient qu'un aliéné a été exécuté par ce gouvernement. Voyons ce qu'il a dit :\n\n\"Qu'il ait proclamé que les droits et les libertés des Bretons, dans une\ncolonie anglaise dépendent de la vie d'une race étrangère.\n\n\"C'est-à-dire des Français !\n\n\"Mais les Canadiens anglais ne souffriront pas plus longtemps cette servitude odieuse et le jour n'est peut-être pas éloigné où l'appel aux armes résonnera de nouveau à travers la 'Puissance.'\n\nNon satisfaits de s'interposer en faveur de l'exécution et de s'être réjouis de la mort tragique de Louis Riel, ils menacent ceux qui honnêtement croient que le gouvernement a mal fait d'exécuter un homme aliéné.\n\nLe Mail, l'organe de l'hon. Premier, a dit le 4 novembre 1885 :\n\n\"Qu'on nous permette de leur assurer (aux Canadiens-Français,) que plutôt que de se soumettre à un tel joug, Ontario briserait la Confédération en ses parties originelles, préférant que le rêve d'un Canada uni s'évanouisse pour toujours.\"\n\nCeci est un avertissement à vous donné, Canadiens-français, de prendre garde à vous. Si vous votez contre le gouvernement, si vous votez de façon à les renverser de leur place et pouvoir, pour avoir pendu un homme que honnêtement vous croyez aliéné, nous briserons la Confédération en ses parties originelles.\n\nLe Mail ajoutait plus loin :\n\n\"Comme Bretons, nous croyons qu'on devra se battre de nouveau pour la conquête et le Bas-Canada peut le croire, il n'y aura pas cette fois un traité de 1763. Les vainqueurs ne capituleront pas la prochaine fois. Mais le peuple Canadien-français perdrait tout. Le naufrage de leurs fortunes et de leur bonheur serait rapide, complet et irrémédiable.\"\n\nFaites attention, prenez garde Canadiens-Français ! La loi anglaise, aux yeux du Mail et des orangistes d'Ontario, ne vous protège pas si vous votez contre le gouvernement. Si vous votez avec eux, tout est parfait, mais votez contre le gouvernement qui a pendu un homme que vous croyez aliéné et l'on se battre de nouveau pour la conquête de Québec, et il n'y aura pas cette fois de traité comme il y en eut un en 1763. Cette fois les vainqueurs ne céderont pas à ceux qui furent les vaincus. N'y a-t-il jamais eu rien dans aucun pays, dans aucun parti, dans aucune organisation, de plus scandaleux, de plus outrageant ? Ayant soif d'une soif insatiable, du sang de la victime, se délectant avec une joie féroce sur le cadavre de la victime qui a perdu la vie sur l'échafaud de Régina et ensuite menaçant une province libre de la vengeance des conservateurs d'Ontario, parce qu'ils ont cru convenable de s'opposer à un gouvernement qu'ils ont cru honnêtement avoir fait exécuter un homme qui n'aurait pas dû être exécuté.\n\nJ'avais déjà vu que des sociétés se réunissaient pour demander miséricorde et pardon, mais j'ignorais qu'il y en eût d'assez sanguinaires pour se réunir et demander du sang.\"\n\nJe ne sais pas si l'honorable Procureur général trouve que les orangistes avaient juridiction pour intervenir. Lorsque les orangistes jugeaient à propos de blâmer le gouvernement d'avance, s'il n'exécutait pas Riel, nous nous hésiterions à le blâmer, lorsqu'il l'a exécuté ! Il est bien évident que Riel n'aurait pas été exécuté sans les orangistes. Pourquoi se faire illusion là-dessus ? Est-il un homme dans cette Chambre qui ne soit pas convaincu dans son âme et conscience que, s'il n'y avait pas eu d'orangistes au Canada, Riel n'aurait pas été pendu ?\n\nEst-ce qu'on n'a pas autant de peine de blâmer que les orangistes ? Est-il juste que les orangistes méagent le Canada ? Est-il juste que la province de Québec cède à cette influence néfastes ? On vient nous demander à nous, les citoyens libres de la province de ne pas nous prononcer lorsque les orangistes demandent du sang, de ne pas nous prononcer lorsque le sang d'un\ndes nôtres a été versé uniquement pour assouvir la haine des orangistes !\n\nIl me semble que ce point est parfaitement clair et que ceux qui songent à voter contre nous, sur cette question, devraient réfléchir. Ce sont de braves gens, de bons citoyens, mais en définitive, pourquoi cette alliance entre ceux qui demandent la mort de Riel et ceux qui n’osent pas la blâmer ? Quelle affinité existe-t-il donc entre ceux qui avaient soif du sang et ceux qui n’ont pas aujourd’hui regretter que le sang ait été versé ! — Oui, monsieur, disons-le hautement, c’est parce que le chef du gouvernement à Ottawa est un orangiste, que Riel a été sacrifié. Et on sait très bien — c’est connu — que quand on a fait entrer M. Thomas White dans le cabinet, quelques jours avant la mort de Riel, le sort de ce dernier était décidé. [Ecoutez ! Ecoutez !] Moi même, je l’ai dit à mes amis dans le temps, je l’ai dit aux conservateurs : Prenez garde ! Si John A. Macdonald prend M. White dans son gouvernement, c’est parce qu’il est décidé à sacrifier Riel.\n\nSir John a dit qu’il était orangiste et il a raconté, en ma présence, pourquoi il était entré dans l’ordre. Il a dit que c’était parce qu’il croyait que ces gens-là étaient maltraités dans le Canada. Il s’est vanté d’être orangiste et il a été un orangiste très élevé en grade. M. McKenzie-Bowell, un autre ministre, a-t-il nié qu’il fût orangiste quand il est entré dans le gouvernement de la Puissance du Canada ?\n\nM. Picard — Est-ce que l’honorable membre ne ferait pas mieux de s’attaquer à MM. Cartwright, McKenzie ? [Ordre, ordre !]\n\nL’honorable M. Mercier — Est-ce que ces gens-là sont des orangistes ? Ils ont mal voté sur cette question et je les en blâme, mais ils n’ont pas demandé la tête de Riel. Au contraire, quand ils étaient ministres, ils lui ont fait grâce.\n\nVoyons ! Est-ce que la province de Québec peut ne pas être blessée de ces choses-là ?\n\nOn me permettra, je l’espère, de citer quelques écrits ou quelques paroles, de ceux qui me combattent aujourd’hui et qui auparavant demandaient pardon pour Riel.\n\nMais avant et à propos de cette question des orangistes, je ne voudrais pas blesser personne, mais j’ai bien le droit de demander à ceux qui vont dire dans les journaux que je perds quelques uns de mes partisans sur cette question : Comment se fait-il qu’ils n’en perdront pas eux autres ? Nous sommes sous le rapport de la langue et de la religion dans la même position, et alors comment se fait-il que la politique de ces messieurs satisfasse les orangistes et que la même ne satisfasse point les orangistes ?\n\nL’honorable M. Taillon — Comment se fait-il que l’honorable député attaque tous ces gens-là qu’ils étaient les alliés politiques naturels des libéraux dans la province de Québec ?\n\nL’hon. M. Mercier — Non, j’ai dit au contraire que ce sont les alliés naturels des conservateurs. J’ai toujours compris que les orangistes étaient généralement avec les conservateurs. Il y en a quelquefois qui ont pu voter aye ; nous sur des matières locales, mais c’était quand ils y étaient forcés par la mauvaise administration du gouvernement. (Applaudissements à gauche, murmures à droite). Vous m’excusez bien, mais c’est ce que j’ai compris et ce que je comprends encore. Il y a une chose bien certaine, c’est que dans les comtés de Drummond et Arthabaska, il y a des orangistes et ils ont tous voté pour le candidat de l’honorable Procureur général ! …………\n\nM. Picard — Ils ont tous voté pour Girouard.\n\nL’hon. M. Mercier — L’honorable député de Richmond et Wolfe ignore cela avec tant d’autres choses ; mais je vais lui apprendre que les orangistes sont surtout à South Durham, et là, où\nM. Watts prenait toujours une majorité, nous avons été battus par près de 100 voix.\n\nL'hon. M. Taillon—C'est la paroisse de Préfontaine.\n\nL'hon. M. Mercier—Le jour où M. Préfontaine a été connu comme ayant refusé de signer les résolutions du Champ de Mars, les orangistes ont dit : \"Vous êtes notre homme.\"\n\nL'hon. M. Taillon—Et quand il les a signées ensuite ?\n\nL'hon. M. Mercier—Quand il les a signées, il a dit en votre présence qu'il le faisait pour sauver son élection—cela a été dit en votre présence et en la mienne—laissant comprendre aux orangistes qu'il signait cela comme un truc d'élection. Et ils l'ont cru sans doute, puisqu'ils ont voté pour lui.\n\nM. Picard—Je m'étonne que l'honorable député...........(Ordre, ordre, interruptions—l'Orateur demande l'ordre.)\n\nL'hon. M. Mercier—Je demanderai à cette Chambre un peu de patience. Je regrette bien de l'ennuyer et de la fatiguer; [Pas du tout, continuez, continuez] mais j'ai cru que c'était mon devoir de soumettre ces faits et ces documents, et si cela fatigue mon illustre ami de Richmond et Wolfe, je le prierai d'aller se reposer un peu. On l'avertira quand il s'agira de voter. (Rires.)\n\nJ'ai été quelque peu surpris d'entendre l'honorable Procureur général employer l'argument du...\n\nTU QUOQUE\n\nIl paraîtrait que quand ces messieurs sont rendus à bout d'arguments, quand ils sont incapables de se défendre, ils disent : \"Vous nous accusez, c'est vrai, ce que vous dites, mais nous allons vous accuser aussi !\" Comme si deux noirs pouvaient faire un blanc. (Rires), comme si, en supposant que les libéraux eussent commis tous les crimes imaginables, cela pourrait justifier ces messieurs de voter contre leur nationalité. Mais puisqu'ils emploient cet argument qui m'a paru avoir un peu d'effet sur ceux que je me permettrais d'appeler la partie la moins éclairée de cette Chambre, je rappellerai à mes amis quelques souvenirs sur les événements qui se sont déroulés il n'y a pas encore longtemps.\n\nTOUS UNANIMES LE 16 NOVEMBRE 1885\n\nJ'ai dit tout à l'heure que le 16 novembre nous étions tous unanimes. Je ne ferai pas à ces messieurs de l'autre côté de la Chambre l'injure de croire qu'ils n'étaient pas sincèrement avec nous. Je ne ferai pas à l'honorable député de Bagot l'injure de lui dire que, quand il est venu à Saint-Hyacinthe, dans mon comté, pour revendiquer notre honneur national, il n'était pas sincère.\n\nM. Casavant—Oui, monsieur, j'étais sincère.\n\nL'hon. M. Mercier—Je ne ferai pas non plus à mon ami l'honorable député de l'Assomption l'injure de croire qu'il n'était pas sincère lorsqu'il a écrit au conseil de son comté pour approuver les résolutions qui y avaient été adoptées. Un homme qui était sincère, lui, par exemple, c'est le député de Rouville. À une assemblée de son comté, il a déclaré carrément que le gouvernement avait bien fait de pendre Riel. Ça ne me surprend pas de le voir aujourd'hui avec le gouvernement, mais ce qui m'étonne, c'est de le voir s'accorder si bien avec ceux qui ont dénoncé l'exécution !\n\nQuant à l'honorable député de Richelieu, il m'a applaudi à Sorel, quand j'eus l'honneur d'y adresser la parole, au sein d'une vaste assemblée de citoyens respectables et patriotes. Ce jour-là, ses électeurs, venus de toutes les parties de son comté, ont adopté avec une patriotique unanimité les résolutions du Champ de Mars.\nM. Leduc—Vous avez oublié que j'étais disparu dans ce temps-là.\n\nL'hon. M. Mercier—Du moment que l'honorable député me dit qu'il est parti juste avant l'adoption des résolutions, je suis obligé de le croire ; mais je l'ai vu à mes côtés tout le temps. Il avait l'air de m'approuver, puisqu'il m'applaudissait et je vous assure que je ne parlais pas contre les résolutions du Champ de Mars.\n\nMaintenant s'il y a un homme qui devait être sincère, c'est l'honorable député de Berthier, lorsqu'en présence du député d'Hochelaga, il est venu approuver les résolutions du Champ de Mars.\n\nM. Robillard—Si l'honorable député de St Hyacinthe me permet de donner quelques explications, je dirai que je n'ai pas approuvé les résolutions du Champ de Mars, j'ai fait mes réserves et le député d'Hochelaga ne dira pas le contraire.\n\nL'honorable M. Mercier—Voyons pourquoi nier un bon mouvement ? Ne reniez donc pas un bon sentiment, gardez-le précieusement, au contraire.\n\nM. Robillard—Si l'honorable député de St Hyacinthe veut me le permettre, je demanderai au député d'Hochelaga de dire quelles ont été...\n\nL'hon. M. Beaubien—L'assemblée a demandé à l'unanimité à M. Cuthbert et à M. Robillard s'ils étaient prêts à désapprover les résolutions du Champ de Mars. J'ai demandé à ces messieurs s'ils les approuvaient et ils ont dit que oui...\n\nL'hon. M. Mercier—D'ailleurs, M. l'Orateur, je vais régler cela en deux mots. Je n'étais pas à l'assemblée, mais j'ai le procès-verbal de l'assemblée et il fait dire de très jolies choses à l'honorable député ; et je n'ai pas vu de lettre par laquelle il ait protesté. Non, il n'a pas protesté.\n\nM. Robillard—Voulez-vous citer ?\n\nL'hon. M. Mercier—Il faudrait pour cela lire deux ou trois colonnes ; mais ce procès verbal a été publié dans tous les journaux, il constate que vous avez parlé en faveur des résolutions et vous n'avez pas démenti la chose. Donc, c'est vrai !\n\nLA PROVINCE UNANIME\n\nJ'ai entendu l'autre jour l'honorable Solliciteur général dire qu'il n'y avait pas de preuve que la province de Québec avait été unanime dans sa protestation contre l'exécution de Riel, que dans son comté il n'y avait pas eu de protestations, que dans le comté de Rimouski il n'y en avait pas eu non plus, et qu'il n'avait pas été prouvé que la province de Québec était été aussi unanime que la chose est dite dans la motion de l'honorable député du comté de Québec. L'honorable Solliciteur général doit se rappeler qu'à Matane et à Rimouski, de grandes assemblées ont été tenues où les résolutions du Champ de Mars furent adoptées. Je viens de recevoir une lettre de dix citoyens, qui me disent : \"Rappelez donc cela au Solliciteur général.\" Ce sont les résolutions du Champ de Mars qui ont été approuvées là comme ailleurs et on dit que la province n'a pas été unanime.\n\nJe ne fatiguerais pas la Chambre en lisant la liste de toutes les paroisses où des assemblées ont été tenues pour blâmer l'exécution de Riel. J'en citerais cependant quelques unes : Actonvale, Fraserville, Boucherville, Chambly, Champlain, Deux Montagnes, Hull, Joliette, Laval, L'assomption, Longueuil, Louiseville, Princeville Pointe au Pic, Montréal, Québec, Sault aux Récollets, Sorel, Saint Henri, Sainte Cunégonde, St Christophe, St Malgloire, St Célestin, etc., etc. Il y en a trois colonnes comme cela. Est-ce que ce n'est pas assez pour dire que la province a été unanime ! Combien donc en voulez-vous ? Voyons pourquoi nier la chose ? Dites, si vous le voulez, que l'opinion a été égarée. Dites, comme le Solliciteur général disait l'autre jour, que j'avais réussi à séduire l'honorable député du comté de Québec. J'avoue que c'est le plus grand\ncompliment que j'aie reçu de ma vie. Si je me croyais de force à séduire un homme de la valeur de l'honorable député du comté de Québec, je me prendrais à regretter de n'avoir pas séduit mon honorable ami, le Soliciteur général, lorsqu'il était mon partisan; j'aurais pu l'empêcher de trahir son chef. Pourquoi nier le fait que la province était unanime? Depuis le 16 novembre à aller jusqu'au milieu de janvier, combien y en avait-il ici qui étaient contre nous? Prenez donc l'honorable député de Bellechasse, par exemple. J'ai ici des écrits signés de son nom dans le Canadien, des protestations superbes, dénonçant les Orangistes et disant que c'est la faute des Orangistes si Riel a été pendu, disant qu'il a protesté que 23 membres de cette Chambre ont protesté et que l'honorable commissaire des Terres de la Couronne a protesté. Comment se fait-il que ces protestations ont été faites dans le journal le Canadien à cette époque? Comment se fait-il qu'un télégramme ait été envoyé?—et ce n'est pas un télégramme signé simplement \"Faucher de St Maurice,\" mais \"Faucher de St Maurice, M. P. P.\"\n\nM. Faucher de St Maurice—J'aurais l'occasion d'expliquer à la Chambre, quand l'honorable député de St Hyacinthe aura fini........... [Ordre, ordre!]\n\nL'hon. M. Mercier—J'espère que l'honorable député s'expliquera; il en a grand besoin.\n\nJ'admire son dévouement de ce temps-là; mais comment se fait-il que lui, qui était si prompt à protester dans Bellechasse, ait été si muet dans cette discussion? Comment se fait-il que quand il signait son télégramme: \"Faucher de St Maurice M. P. P.\", il pensait que le député local ne devait pas intervenir?\n\nOn a vu ensuite l'honorable député de Nicolet, qui est venu faire l'autre jour un cours de droit constitutionnel, qui avait le désavantage d'être parfaitement ridicule. C'est lui qui est allé aux Trois Rivières et qui a fait imprimer une circulaire convoquant des assemblées monstrueuses, dans son comté, pour protester contre l'exécution de Riel. Et ces circulaires sont signées \"M. Dorais M. P. P.\" Ce n'était pas le citoyen Casavant qui signait là, c'était le député Dorais!\n\nQuel est donc l'homme qui a inventé cette théorie qu'il y avait trois qualités chez un député qui n'a pas le courage d'en avoir une seule? Je voudrais savoir quel a été l'homme (Rires) assez habile pour inventer cela. On devrait lui donner un brevet d'invention. Ça peut être utile. Ce n'est pas utile dans le moment, mais ça peut le devenir plus tard.\n\nLES JOURNAUX CONSERVATEURS AVANT ET APRÈS LE 16 NOVEMBRE\n\nCes journaux ont été unanimes à demander grâce pour Riel d'abord, et ensuite à blâmer le ministère de l'avoir fait exécuter. Faisons quelques citations pour prouver d'abondance l'unanimité de la province.\n\n(Le Canadien, 21 mai 1885)\n\nRiel est fou...\n\n\"Le Witness\" publie le rapport d'une entrevue que l'un de ses reporters a eue avec un nommé Chaumette, qui aurait été employé à l'asile de Beauport pendant que Riel y fut interné. Cet homme assure que Riel n'a jamais été fou, qu'il a fréquemment conversé avec lui, etc. Si Chaumette a dit cela, il n'a pas dit la vérité. Le chef métis avait complètement perdu la raison; il était atteint de manie religieuse; il devenait, par intervalles, incontroleable, furieux.\n\n\"M. le Dr Roy, M. Vinclette, M. Landry M. P., qui le voyaient tous les jours, pourraient en dire long sur son genre de folie.\"\n\n(Le Canadien, 10 juillet 1885)\n\nLe procès des Métis\n\n\"Le Globe\" dit qu'il est d'opinion que souvent, en Angleterre, le gouverne-\nment a fourni aux prisonniers pauvres les moyens de faire une défense complète. Souvent aussi le juge qui préside une cour fournit un avocat aux prisonniers qui n'ont pas les moyens d'en avoir. Dans ce cas-ci, il faut absolument que les prisonniers soient traités non seulement avec justice, mais ils doivent être traités libéralement, afin que jamais l'on ne puisse dire que, s'ils avaient eu les moyens nécessaires, leur procès se serait probablement terminé par un verdict d'acquittement, mais que, vu qu'ils n'ont pas pu se procurer certains témoins, ils ont été condamnés injustement. La réponse que le comité a reçue du secrétaire d'État équivaut à un refus ; mais il est à espérer que le gouvernement reconsiderera sa décision et qu'il arrivera à la conclusion qu'il est de l'intérêt du Canada de donner aux Métis un procès impartial.\"\n\n(Le Canadien, 24 juillet 1885)\n\nHonte !\n\n\"Pourquoi donc en une circonstance aussi solennelle ne pas donner fair p'ay à Riel comme à bien d'autres qui en ont joui avant lui ?\n\n\"Pouquoi préjuger ainsi tout un pays contre un malheureux qui souffre peut être encore d'une maladie mentale qui a failli l'emporter il y a quelques années ?\"\n\n(Le Canadien, 22 août 1885)\n\nPlus de modestie\n\n\"Le Regina Leader s'élève très fort contre la commutation de la peine de mort portée contre Riel. Il a l'intention de parler avec autorité. \"Nous devons, écrit-il, avoir quelque chose à dire dans cette affaire, nous, habitants du Nord-Ouest.\"\n\n\"Nous trouvons ce langage déplacé, pour ne pas dire ridicule. La rébellion a été fomentée, préparée, désirée par des blancs, habitants du Nord-Ouest, qui ont voulu intimider le gouverne-\n\nment, se venger de griefs vrais ou prétendus. Elle a été réprimée par nous, par les vieilles provinces, qui avons dépensé des vies précieuses et plusieurs millions pour rétablir l'ordre.\n\n\"Voici des faits qui ne peuvent être contestés et qui devraient inspirer au Leader et à ses pairs une attitude plus modeste.\n\n\"Combien nous coûte l'Ouest depuis que nous en avons fait l'acquisition ? Pour la construction du Pacifique seul, nous aurons bientôt payé quelque chose comme cent cinquante millions de piastres. Nous n'insinuons pas que ce vaste territoire ne vaut pas les sacrifices que nous avons faits pour en avoir la possession et l'organiser. Non, mais nous tenons à rappeler à nos amis de cette contrée lointaine qu'ils nous doivent tout ce qu'ils sont et tout ce qu'ils ont, et qu'en conséquence, nous ne nous proposons pas de diriger selon leurs caprices les affaires du pays. Cette question de Riel est du domaine du Canada entier. C'est à ce point de vue qu'elle doit être réglée. Les hommes d'État qui ont en mains le pouvoir, ont d'assez larges idées pour le comprendre; nous en sommes sûrs.\"\n\n(Le Canadien, 15 septembre 1885)\n\n\"Dans l'affaire de Riel, le sentiment de la Province de Québec est, à en pas douter, favorable à une commutation : personne, pas une voix n'a demandé un pardon complet. En maintenant la nécessité de la punition, nous prouvons que nous comprenons l'importance de l'offense commise ; et, en insistant pour une mitigation de la sentence, nous faisons œuvre de civilisation, nous interprétons dans leur portée véritable les idées de miséricorde et de tolérance qui ont cours dans notre siècle ; nous suivons les exemples que nous ont données l'Angleterre, les États-Unis etc. Au fond, l'immense majorité des habitants de la Puissance pensent, comme nous, que l'exécution de Riel serait une\nfaute, un acte barbare dans les circonstances actuelles. Cet homme a été interne trois fois dans des maisons de santé.\n\n\"Les nécessités politiques peuvent seule laisser un instant planer l'idée que Riel portera sa tête sur l'échafaud; le gouvernement parlementaire est sujet à ces difficultés qui ont leur contre-poids dans la sagesse des parties les plus éclairées de l'opinion, qui finissent presque toujours par l'emporter; grâce à la lumière qu'elles font pénétrer dans les masses par la discussion.\n\n\"C'est nous, le Bas Canada, qui avons assuré à ce pays le gouvernement responsable, et chaque fois que l'occasion s'en est présentée, nous en avons revendiqué le plein exercice, nous en avons compris la valeur et les secrets. Nous le mettons aujourd'hui en pratique en nous prononçant courageusement dans le sens de la justice, en prenant une position définitive, tranchée, quand trop de nos concitoyens sont retournés par la peur des préjugés.\n\n\"Nous défendons la constitution en empêchant qu'en son nom, une faute soit commise, faute qui serait une tache dans notre histoire, un remords national. Que dirait-on dans l'avenir d'un peuple de cinq millions d'habitants qui aurait conduit sur la potence un malheureux que la raison chancelante a jeté dans une échauffourée dont nous avons eu raison en un clin d'œil et qui a servi à développer à un haut degré notre esprit national?\"\n\n[Le Canadien, 12 novembre 1885]\n\nGrâce pour Riel! (Faucher de St Maurice)\n\n\"Pourquoi pendre un fou, un homme incoussent même de l'acte de réparation que la société exige de lui? En mourant le 16 novembre,......si toute fois on persiste à infliger le récit de cette lugubre tuerie à notre histoire...\n\nLouis Riel meurt avec la conviction qu'il ressuscitera le troisième jour.\n\n\"En voilà assez pour convaincre n'importe qui, que cet homme est un aliéné, qu'il est attaqué de la plus dangereuse des monomanies, la folie religieuse, la folie des grandeurs et la folie des persécutions.\n\n\"Grâce pour Louis Riel! voilà le cri qui se fait entendre partout où bat un cœur qui aime son prochain et qui sait respecter les droits de la société.\n\n\"Au moment où le corps du supplicié Riel se dérobera sous la trappe et se crispera dans les convulsions de l'agonie, un abîme se creusera entre la province de Québec et la province d'Ontario. Nous, Canadiens français, nous aurons constamment sous les yeux et nous ferons lire à nos enfants les résolutions suivantes que les loges orangistes ont publiées sur ce procès il y a à peine quelques jours.\n\n\"Pourquoi brouiller un pays sur cette question aussi simple? Un fou est un fou; et la potence, quand elle veut du sang, demande que le malheureux qu'elle va supprimer ait la conscience de l'acte de réparation suprême qu'il fait à la société outragée. Or Riel n'est pas dans ce cas.\n\n\"Il est fou.\n\n\"Grâce pour Riel et plus de ces cruels sursis. La loi ne condamne qu'une fois à mort. Or cet aliéné l'a été plusieurs fois.\n\nVoilà le cri des honnêtes gens du Canada, voilà ce que pensent en France, en Angleterre, aux États-Unis, les illustrations et les hommes politiques de ces pays; voilà les aspirations et les volontés de ceux chez qui bat un cœur élevé et convaincu du respect que la justice doit à ceux que la main de Dieu a touchés et qui passent misérablement leur vie dans la mystérieuse et éternelle folie.\n\n\"Chez les barbares, on prenait soin des malades de l'esprit.\"\n\"On avait le respect des obscurs de l'intelligence. Le Canada peut en faire autant sans se déshonorer.\n\n\"Grâce pour Riel.\"\n\n\"FAUCHER DE ST MAURICE.\"\n\n(Le Canadien, 13 novembre 1885)\n\nLouis Riel\n\n\"Toute la presse des États-Unis, de la France et de l'Angleterre s'occupe de cette grave question. L'immane majorité est en faveur de l'internement du chef Métis dans un asile d'aliénés. La presse canadienne française est unanime à se prononcer contre l'exécution. Elle regarde le sursis donné à Riel comme une seconde condamnation et elle a raison.\"\n\n(Le Canadien, du 16 novembre 1885)\n\nLe 16 novembre\n\n\"Cette date sera désormais un jour de deuil et de honte pour nous. On a eu la cruauté froide. Un sursis a été accordé à Riel. On a fait passer le peuple par toutes les anxiétés de la clémence, et au moment où ces lignes seront lues, Riel mourra. De son corps sortira l'âme vacillante qui depuis longtemps s'y meurtrissait et s'y maintenait sur les ailes de la folie comme un oiseau pris au piège.\n\n\"Notre histoire, sans tache jusqu'à présent, n'a qu'à se voiler la face, qu'à mettre un signe de deuil sur la page qui contiendra le récit du meurtre judiciaire du 16 novembre.\n\n\"Ce crime juridique est de plus une insulte nationale. Nous en reparlerons en temps et lieu.\"\n\n(Le Canadien, 16 novembre 1885)\n\nRIEL\n\n\"Si les peuples civilisés punissaient encore de la peine capitale des offenses politiques du caractère de celle qu'il a commise, l'exécution de Riel eût été acceptée par tous comme la juste vengeance de la loi : il s'est rendu coupable de ce que les statuts appellent haute trahison ; il a pris part à un mouvement armé contre l'autorité du Canada, l'une des parties de l'Empire de Sa Majesté la Reine d'Angleterre.\n\n\"Mais la mort a, depuis longtemps, cessé d'être la châtiment de ces offenses, et Riel est pendu parce que les mauvaises passions et les préjugés de race ont exercé une influence prépondérante contre l'exercice de la clémence exécutive.\n\n\"On a traité avec moins de sévérité les auteurs de la sanglante révolution des Cipayes : une amnistie complète fut accordée à tous ceux des insurgés qui n'avaient pas pris directement part à l'assassinat de sujets anglais. Et cette insurrection, qui dura deux ans, avait coûté à la Grande Bretagne des millions de vies : les plus horribles massacres avaient eu lieu ; l'intégrité de l'empire avait été sérieusement menacée. Quelle importance garde la folle aventure de Riel en présence du grand drame des Indes ? La nation britannique pardonna et les Indes rentrèrent dans l'ordre et la fidélité.\n\n\"Le Canada, un jeune pays d'un peu plus de quatre millions d'âmes dissimulées sur un immense territoire, le Canada dont l'édifice national en est à peine aux fondations, dresse des échafauds pour un exalté, coupable d'une série d'actes de démence qui ont abouti à la ruine de la pauvre petite nation à laquelle il appartenait.\n\n\"Le sang est un mauvais ciment, et si la confédération n'en a pas d'autre, le coup de vent qui la culbutera n'est pas loin dans l'horizon. Un pays dans lequel le droit de vie ou de mort s'exerce par l'influence des factions perd le respect de l'étranger et la confiance de ses habitants. Si l'orangisme est l'autorité souveraine... quand il lui plaît... en matière criminelle, la liberté des personnes, la propriété, les institutions publiques sont en péril : il n'y a plus de sécurité.\n\n\"Les loges orangistes ont été ui\ndanger pour la Couronne impériale en plusieurs circonstances : elles ont menacé le trône ; et le parlement anglais, en 1836, demanda au Roi de mettre un terme à leurs menées. Les emplois publics qu'elles avaient séparés depuis 1798, leur furent enlevés, le sentiment national se souleva également contre elles que le duc de Cumberland, leur grand maître général, dut leur donner l'ordre de se dissoudre.\n\n\"Les orangistes du Canada sont en train de briser la confédération, de faire perdre à l'Angleterre ses possessions en Amérique. Toujours ils ont été un élément de haine et de discorde parmi nous. Ils ont failli, à diverses reprises, faire couler le sang dans les rues de nos villes, à propos de la célébration de l'anniversaire de la bataille de la Boyne, célébration qui leur avait été interdite même dans la Grande-Bretagne par autorité de la Couronne.\n\n\"Aujourd'hui ils sont assez forts dans la Chambre des Communes pour faire commettre au gouvernement un acte que l'histoire qualifiera de cruel et détestable, un acte que personne ne demande, excepté ces fanatiques.\n\n\"Une pareille situation réclame la calme, mais ferme attention des habitants du Canada.\n\n\"Pourtant part, nous invitons nos compatriotes à ne pas égarer leur énergie en vaines clamours, à ne pas troubler l'ordre... nos ennemis seraient trop heureux... mais à étudier sans précipitation, les moyens propres à protéger l'avenir.\n\n\"Nous invitons—espérons qu'il n'en est pas nécessaire—les partis politiques à s'élever au-dessus des intérêts d'un jour : reporrons toutes nos volontés vers la question de demain.\"\n\n[Le Canadien, 18 novembre 1885]\n\nL'ASSEMBLÉE LÉGISLATIVE DE QUÉBEC\n\n\"La France de Montréal, a été trompée et met le public sous une fausse impression en disant : 'Nous n'entendons point dégager... la responsabilité... du gouvernement provincial et des députés du gouvernement local qui se sont tenus cois, comme si cette affaire de l'exécution de Riel ne les regardait point.'\n\n\"Le Montreal Star dit à peu près la même chose.\n\n\"Nous ne savons pas si les ministres locaux ont protesté en corps, mais nous apprenons de bonne source que l'hon. M. Lynch, commissaire des terres de la Couronne et député de Brome, a exprimé, par télégramme, son opinion sur l'exécution de Riel, et qu'il a protesté en temps contre ce crime judiciaire auprès d'un ministre fédéral.\n\n\"Nous savons aussi que M. Faucher de St Maurice, député de Bellechasse, a expédié en date du dix, le télégramme suivant à Ottawa, qui a été soumis aux ministres en conseil. Ce télégramme a déjà été publié et se lit comme suit :\n\nQuébec, 10 nov. 1885.\n\nC'est l'opinion d'un grand nombre de députés canadiens-français de l'Assemblée Législative de Québec et la miennne que si Riel est exécuté, ce sera une grande faute politique.\n\nLa grande majorité des électeurs de la plupart des comtés... tous, pouvons-nous assurer... sont de cet avis. Nous vous soumettons respectueusement notre opinion à propos de cette question si importante pour la tranquillité du pays.\"\n\nFAUCHER DE ST MAURICE,\n\nM. P. P.\n\n\"Bellechasse.\"\n\n\"Vingt-trois députés de l'assemblée Législative de Québec ont enregistré leur protest contre le meurtre judiciaire de Riel. Si tous ceux qui comprenaient que le gouvernement fédéral... au lieu de prendre en considération la qualité de belligérant qui avait été reconnue à\nRiel par le général Middleton, la folie, les deux années d'internement de Louis Riel dans un asile d'aliénés, la recommandation du jury à la clémence de la cour, le sursis accordé à cette touchante et malheureuse victime et la ferme persuasion que l'on ne pendait plus pour crime politique... avaient su que Riel serait exécuté, toute l'assemblée législative de Québec se serait levée et aurait protesté comme un seul homme.\n\n\"Nous prions la Presse et le Star de mettre sous les yeux de leurs lecteurs les démarches qui ont été faites en faveur de Riel par l'hon. M. Lynch, par M. Faucher de St Maurice, et par nombre de députés de l'Assemblée Législative de Québec.\"\n\n(Le Canadien, 21 novembre 1885)\n\nLe sentiment public\n\n\"Le cabinet de Sir John A. Macdonald—la majorité du cabinet, pour être, moralement, plus juste et plus vrai, quoique tous ses membres soient constitutionnellement responsables— a mis en danger la paix, l'harmonie, les institutions, le progrès de notre jeune nation. Nous avions droit d'attendre mieux de l'homme d'État dont les cheveux ont blanchi sur notre arène politique. Aussi le sentiment contre sa conduite est-il d'une intensité qui rappelle les jours où nous luttons pour la revendication de nos plus chères libertés. Le peuple romprait comme verre quelconque voudrait y résister.\n\nNe frappons de flétrissure que ceux qui le méritent. Le gouvernement dont ils font partie a perdu la confiance du Bas-Canada; ils ne représentent pas nos opinions à la table du conseil; ils le savent. Nous dirons plus: ils ne représentent même pas leurs propres sentiments; car ils n'ont pas pu vouloir que Riel fut exécuté. C'est là notre franche opinion. Franchement aussi est notre opinion en déclarant qu'ils sont complètement isolés de leur province.\n\n\"L'union est faite contre la politique néfaste dont ils portent le poids.\n\n(Article de M. Faucher, 21 novembre 1885)\n\n\"Il nous fait plaisir de constater en ce moment le rapprochement qui se fait entre les Canadiens-français et les autres nationalités de la province de Québec.\n\n\"En effet, pourquoi ne serions-nous pas unis? Nos intérêts sont les mêmes; nous avons les mêmes aspirations. Donnons-nous la main. Marchons ensemble.\n\n\"Aux États-Unis, Irlandais et Canadiens français donnent l'exemple et fraternisent. Ils s'aident mutuellement. Suivons leur exemple, nous n'en serons que plus forts.\n\n\"Oui, l'heure est venue de faire cette union. Carpe diem. Saisissons l'heure et jetons les bases d'une entente qui sera le salut de la province de Québec.\n\n\"Amis de la patrie, à l'œuvre; ne perdons pas un instant.\"\n\n\"Faucher de Saint-Maurice.\"\n\n(Le Canadien, 28 novembre 1885)\n\nLettre de M. Tarte au Mail\n\n\"Nous avons cru et nous croyons encore que la sentence de mort ne devait pas être exécutée dans le cas de Riel parce que: 1o. Le jury, en le déclarant coupable de haute trahison, l'avait recommandé à la clémence de la cour; Or, la clémence de l'exécutif pouvait-elle s'exercer en une autre manière que par la commutation? 2o. Donc, le jury n'avait pas voulu condamner Riel à être pendu. Sur ce point, il me semble qu'il n'y a pas de doute possible.\n\n\"Et, Messieurs, vous avouerez bien, je crois, que ce n'est pas un procès britannique qui a eu lieu à Régina. C'est à nous de nos pairs que nous avons droit, tous tant que nous sommes. Les\nprocédés qui ont abouti à la condamnation sont légaux : la condamnation est juste, mais le procès n’est pas britannique.\n\n2. À notre époque, les offenses politiques ne sont plus punies de la peine capitale. Dans votre édition de ce matin, vous m’avez dit : \"Mais alors intercédez pour les sauvages qui vont être exécutés le 27 : Riel était plus coupable qu’eux, il était le principal, etc. Permettez-moi de vous répondre en vous citant un exemple essentiellement britannique, l’amnistie proclamée dans la révolte des Indes, à tous les coupables, sauf à ceux qui s’étaient personnellement rendus coupables d’assassinat de sujets britanniques. Riel n’a rien fait de tel : les sauvages ont commis ce crime.\"\n\n3. Êtes-vous bien certains, messieurs, que l’homme monté sur l’échafaud le seize de ce mois, avait la jouissance de ses facultés mentales ? J’ai bien connu Riel quand il fut interné dans nos asiles d’aliénés, et je vous donne ma parole d’honneur qu’il était alors complètement fou. Il n’était pas idiot, bien au contraire ; il parlait avec une éloquence que beaucoup pourraient lui envier ; il écrivait en prose, en vers, en latin, en grec. Mais il était fou ; fou de la folie des grandeurs et des réformes religieuses. Je l’ai vu en communication télégraphique avec Napoléon III, Bismarck, Pie IX, répondant à des dépêches imaginaires, sonnant, et appelant des messagers qui naturellement n’existaient pas, etc.\n\nBien des gens l’ont vu comme ça, et tous dans notre province savent que Riel a perdu à plusieurs reprises la raison.\n\n(Le Canadien, 1er décembre 1885)\n\n[Discours de Faucher de Saint-Maurice à Bellechasse]\n\n[Télégramme]\n\nQuébec, 10 novembre 1885\n\n\"C'est l'opinion d'un grand nombre de députés Canadiens français de l'Assemblée Législative de Québec et la mienne, que si Riel est exécuté, ce sera une grande faute politique. La majorité des électeurs de la plupart des comtés—tous, pouvons-nous assurer—sont de cet avis. Nous vous soumettons respectueusement notre opinion à propos de cette question si importante pour la tranquillité du pays.\n\n\"FAUCHER DE SAINT MAURICE,\n\nM. P. P.,\n\nBellechasse.\"\n\n\"La loi eut son triste cours, et Riel irresponsable, Riel inconscient de l'expiation qu'il accomplissait, fut pendu comme un criminel. [Honte, honte !]\n\n\"Je n'ai pas à apprécier cette sinistre tragédie, comme votre député local ; mais, comme journaliste, je l'ai vigoureusement blâmée, et pour faire la part des responsabilités, j'ai signé tous les articles que j'ai publiés sur cette question brûlante. Vous les connaissez : je n'ai pas besoin de vous en faire part de nouveau, mais ce qui a pu vous échapper, c'est que presque toute la presse de la province de Québec a été unanime dans la réprobation de cette cruauté inexcusable et inutile.\n\n\"Vous, vous avez comme prénom, celui de libéraux. Nous, nous avons celui de conservateurs. En ce jour, il n'y a pas de ces distinctions. Nous sommes en conseil de famille et nous délibérons sous notre véritable nom, celui de Patriotes. [Hurra !]\n\n\"Des résolutions vont vous être soumises... Comme député local, je n'ai rien à y voir : elles ne concernent que le gouvernement fédéral, mais c'est mon droit de vous dire : En ce disant, soyez calmes, soyez sans colère, soyez honnêtes de votre dignité. Efforcez-vous d'être justes, car vous allez vous ériger en tribunal. Vous allez exercer votre prérogative sur les affaires fédérales.\"\n\"Je n'ai pas à empiéter sur le mandat que vous avez confié au colonel Amyot : vous avez confiance en lui et c'est un homme. Mais comme citoyen, comme canadien-français, comme catholique et comme journaliste, j'ajouterai :\n\n\"Visez à la tête de l'orangisme voilà l'ennemi. Il a voulu semer la haine. Il a cru que notre sol se prêtait à la fermentation de cette mauvaise herbe. Il a fait ce travail nocturne, sans nous consulter. Qu'il récolte donc la haine. Prouvez-lui que nous sommes prêts pour la moisson. [Longs applaudissements.]\n\n(Le Canadien, 7 décembre 1835)\n\n[Lettre de M. Tartar au Maître]\n\n\"Monsieur—Les grands intérêts qui sont en jeu—l'harmonie entre les races, et par conséquent le maintien de la Confédération—m'animent. Je crois, à tenter un nouvel effort pour vous démontrer que vous faites erreur sur la nature de l'agitation qu'il se fait dans cette province. Le point que je désire établir, l'opinion que je voudrais vous voir partager, est qu'en demandant la commutation de la sentence de Riel et en protestant contre la peine de mort qui lui a été infligée, la majorité de mes compatriotes exerce un tort que la constitution ne garantit pas. Nous pouvons n'avoir pas raison, mais notre droit strict, si nous croyons avoir raison, est de faire ce que nous faisons.\n\nEn d'autres termes, votre prétention que le Bas Canada se met au-dessus de la loi parce qu'un Canadien était en cause, constitue une grave injustice à notre égard.\n\nLa doctrine constitutionnelle, vous le savez comme moi, est que le cabinet est un comité de la Chambre à laquelle il doit compter de chacun de ses actes. Or, l'exécution de Riel est un acte du gouvernement du Canada, qui n'est responsable au parlement et au peuple de ce pays.\n\nDonc, le droit du premier électeur venu est de condamner le gouvernement pour cet acte, s'il le juge contraire à l'intérêt public. Le gouvernement de Sir John A. MacDonald n'a pas fait ce que vous dites, exécuter la loi. Aucune loi ne l'obligeait à exécuter Riel. Il a décidé et jugé que Riel devait être pendu. Lisez le statut de la Puissance, 43 Victoria, ch. 29 sec. 76.\n\nC'est ce qui a eu lieu dans l'affaire Riel. Le juge Richardson a transmis son rapport, le bon plaisir du gouverneur en conseil s'est manifesté par des repits, et finalement par l'exécution du condamné. Je le répète : la loi n'obligeait pas le gouvernement à exécuter Riel. Il pouvait ou ne pouvait pas l'exécuter.\n\nIl est donc hors de doute que vous méconnaissiez les plus élémentaires principes du gouvernement responsable en nous déniant le droit de condamner, si nous le jugeons à propos, les auteurs de l'exécution de Riel. En ce faisant nous ne nous mettons pas au-dessus des lois, encore moins voulons nous proclamer la suprématie de notre race sur l'élément anglais. Nous sommes dans nos attributions de juges en dernier ressort des actes d'un gouvernement. Nous sommes dans notre droit, et pardonnez-moi de vous le dire, vous êtes dans votre tort en nous déclarant que si nous ne renonçons pas à nos opinions, vous cherchez à nous en punir jusqu'à la guerre civile. Vous ne trouverez pas dans l'empire un seul juriste constitutionnel pour défendre les théories auxquelles vous nous mettez en demeure de nous soumettre.\n\nNotre province n'a pas demandé, n'a pas songé à demander que Riel fût exempt de châtiment. Condamnant au même degré que vous les offenses qu'il a commises, nous nous plaignons que les autorités fédérales lui aiient fait subir une peine qui n'est pas celle appliquée chez les nations civilisées aux crimes de\nla catégorie du sien. Et l'opinion s'est accréditée que la décision du gouvernement n'a pas été dictée par des motifs d'intérêt public. De là l'émotion profonde qui s'est emparée des masses. Dans les mêmes circonstances, toute autre province de la Confédération en eut fait autant.\n\n\"Notre population a cru, de bonne foi, que l'exécution de Riel n'aurait pas eu lieu, s'il n'eût eu du sang français dans les veines. Profondément blessée, elle a fait entendre ses protestations. Vous verrez, je pense, lorsque la question sera discutée devant le parlement, que les députés, du Bas-Canada avaient reçu, concernant le sort de Riel, des assurances qu'ils ont répétées à leurs constituants et qui, l'exécution advenant, ont provoqué une clamour violente. Les électeurs se sont écriés que leurs représentants les avaient trompés ; ces derniers ont répondu, en accusant les ministres de duplicité. Les uns et les autres peuvent avoir été de bonne foi ; mais le fait est là, et j'y appelle votre attention afin que vous vous rendiez bien compte des causes diverses qui ont bouleversé notre atmosphère politique.\n\n\"Ce n'est pas la Couronne qui en est la cause, ce sont ceux auxquels le peuple a confié la tâche de la diriger. Je persiste à penser qu'un châtiment mitigé, quoique sévère, eût mieux servi les intérêts de notre pays et que le gouvernement eût pu s'inspirer avec profit des doctrines que Chitty expose en ces termes, [422].\n\n\"Tout citoyen doit même endurer patiemment les torts qui ne sont pas insupportables plutôt que de violer la paix publique. Un déni de justice de la part du Souverain, ou des délais malicieux, peuvent seuls excuser les transports furieux d'un peuple dont la patience est épuisée, et même les justifier, si l'injustice était intolérable et l'oppression grande et manifeste. Mais quelle devra être la conduite du Souverain à l'égard des insurgés ? Je réponds, en général, une conduite qui en même temps sera conforme à la justice et la plus avantageuse à l'État. Quoiqu'il soit de son devoir de réprimer ceux qui sans nécessité troublent la paix publique, il est obligé d'agir avec clémence envers des infortunés, à qui on a donné de justes raisons de se plaindre et dont le seul crime est d'avoir essayé à se faire justice : ils ont plutôt manqué de patience que de fidélité.\"\n\n[Le Canadien, 21 décembre 1885]\n\n\"L'heure de la clémence\"\n\n\"Un grand nombre de prisonniers métis sont détenus depuis la fin de la rébellion. Ils ne sont impliqués dans aucun massacre, accusés d'aucun meurtre direct. Le gouvernement n'a-t-il pas fait preuve d'assez de sévérité pour songer maintenant à la clémence... l'un des plus beaux attributs de la couronne, et aussi, l'un des plus beaux moyens de pacifier les esprits, dans bien des cas. Nous admettons que la responsabilité du maintien de l'ordre dans ces territoires pèse sur le cabinet, et qu'il est tenu d'agir avec prudence. Mais nous sommes convaincus qu'en mettant en liberté ceux des prisonniers qu'il croira animés du désir de garder la paix, il fera taire plus d'un désir de vengeance.\n\nToutes ces choses ont été écrites dans le journal de M. Tarté, et la plus grande partie par lui.\n\nEt c'est ce monsieur qui m'insulte aujourd'hui parce que j'ai conservé les sentiments que nous avions tous deux alors, parce que je suis resté fidèle au mouvement où il était entré à cette époque.\n\nM. l'Orateur, encore une ou deux citations.\n\nLe 19 novembre, que disait mon honorable ami le député de Bellechasse?\n\n\"Sus à l'orangisme.\"\nSous à l'Orangisme—(Faucher de St Maurice):\n\n\"Un crime politique vient d'être consommé, Riel est mort sur l'échafaud. Ce meurtre judiciaire comporte de plus une injure sanglante à notre race et à notre religion, car dans cette sinistre trahison, c'est l'opinion orangiste qui a prédominé. Disons donc à nos gens ce que sont ceux qui pensent que les Canadiens-français doivent disparaître et qu'il faut les frapper partout où ils se présentent. Disons leur ce que sont ces fanatiques, ce qu'ils ont fait et ce qu'ils prétendent faire.\n\n\"Depuis, la civilisation a marché. On n'écrase plus, on ne tue plus, on ne déporte plus en grand. On ne fait plus que dans le détail. On érige un échafaud au milieu d'une prairie, et on y pend un homme comme Riel, recommandé par un jury à la clémence de la cour. Ce n'est pas aussi enlevant que les cris et les supplications des 7,000 irlandais massacrés en 1795, mais tout de même cela maintient la chaîne des traditions.\n\n\"Hélas ! le 16 novembre 1885, les orangistes ont encore remporté une nouvelle victoire de la Boyne sur nous, les Canadiens-français, cette fois-ci. Ce jour-là, Riel le plus victime est \"étendu à terre sous leur tambour protestant.\" Avant son agonie ils criaient sous cape, ils espéraient voir leur victime trembler devant la mort. Il n'en a rien été cependant.\n\n\"Je n'ai que mon cœur, a-t-il dit simplement, et je l'ai donné à mon pays il y a quinze ans. C'est tout ce que je possède maintenant.\"\n\n\"Puis s'avancant fermement vers l'échafaud : Pardonnez-nous nos offenses comme nous pardonnons à ceux qui nous ont offensés. Merci, Jésus !\"\n\n\"Et ce fut tout.\n\n\"Chez nous voilà comment on sait mourir, même quand on passe pour un aliéné.\n\n\"Voilà le spectacle que les loges orangistes viennent de donner au monde entier.\n\n\"Certes, il ne déshonore ni les métis du Nord-Ouest, ni les canadiens-français.\"\n\n\"FAUCHER DE ST MAURICE.\"\n\n(Murmures, bruits à droite.)\n\n\"L'hon. M. Mercier. Enfin, je comprends que ce n'est pas bien agréable pour quelques-uns de ces messieurs, mais ce n'est pas moi qui ai écrit cela et ce n'est pas moi qui tout à l'heure voterai contre ma conscience.\n\nM. Faucher de St Maurice—Je demande pardon à l'honorable député de St Hyacinthe, ce qu'il fait là n'est pas juste. Vous dites : voilà un article qui a été écrit par un homme qui peut être votera contre sa conscience; J'en appelle à votre cœur, vous n'avez pas le droit de m'intimider et vous n'avez pas le droit de me dire ces choses-là. Mes articles sont signés de mon nom et je les expliquerai à la Chambre dans un instant, car j'entends répondre à l'honorable député.\n\nM. Gagnon—Ça va être drôle !\n\nFaucher de St Maurice—Je n'ai pas de censure à recevoir du député de Kamouraska.\n\nL'honorable M. Mercier—Je n'ai pas dit ce que prétend l'honorable député.\n\nFaucher de St Maurice—J'ai compris cela.\n\nL'hon. M. Mercier—Certainement, l'honorable député ne m'a pas compris. Ce n'est pas que je ne désirerais pas que l'honorable député vote avec nous, et je puis l'assurer d'une chose, c'est que je ne ferai pas plus que je ne fais en ce moment ici pour convaincre mes adversaires. Je n'ai pas dit ce que me prête l'honorable député, j'ai dit que ce n'est pas moi qui voterai tout à l'heure contre mes convictions.\"\nFaucher de St Maurice—Ce que vous venez de lire porte mon nom.\n\nM. Lemieux—Malheureusement !\n\nL'hon. M. Mercier—Le 10 novembre l'honorable député de Bellechasse envoyait un télégramme protestant contre l'exécution de Riel. C'était un peu tard, il faut l'admettre ; mais enfin c'était un bon mouvement.\n\nMaintenant il est ajouté dans l'article qui n'est pas signé par l'honorable député, mais qui est dans le même journal, qu'il y avait 23 députés de l'assemblée législative qui avaient signé un télégramme dans le même sens. J'espère que dans les observations qu'il fera, l'honorable député nous donnera les noms des 23 députés de l'assemblée législative. Il paraîtrait que l'honorable député était informé de bonne autorité que l'honorable Commissaire des terres de la couronne n'avait aussi envoyé un télégramme. Et pourtant l'honorable Commissaire des terres a déclaré que ce n'était pas le cas. J'espère que l'honorable député de Bellechasse nous donnera des renseignements pour nous faire connaître de qui il a su de pareilles choses, afin que l'on sache comment et par quoi il a été trompé—car il a été trompé, évidemment, ou il a trompé le public sérieusement.—Il faut que l'on sache si les 23 députés qu'il dit avoir signé le télégramme en question l'ont trompé ; car ces 23 députés doivent être dans cette Chambre. On doit savoir leurs noms.\n\nLe 18 novembre, deux jours après l'exécution, la Presse de Montréal, avait écrit un article dans lequel elle laissait croire que le gouvernement actuel n'avait rien fait pour sauver Riel. Cette déclaration a tellement blessé l'honorable député de Bellechasse qu'il a écrit ceci :\n\n\"L'Assemblée Législative de Québec\n\nM. Faucher de Saint-Maurice—Est-ce que l'honorable député veut laisser la chambre sous l'impression que c'est mon télégramme qu'il lit ?\n\n[Interruptions, bruits, rappels à l'ordre.]\n\nM. Faucher de Saint-Maurice—Est-ce que c'est mon télégramme ?\n\nL'honorable M. Mercier—Je ne sais pas si l'honorable député a droit d'être aussi chatouilleux que cela. Je lui fais l'honneur de le lire, etc.\n\nFaucher de St Maurice—Vous me faites l'honneur de me lire ?... (Ordre, ordre)\n\nL'honorable M. Mercier—Je suis bien prêt à me laisser interrompre par des personnes qui se conduisent décentement.\n\nFaucher de St Maurice—Je demande tout simplement si l'honorable député... (Ordre, ordre)\n\nL'hon. M. Mercier—Je lis un article du Canadien du 18 novembre intitulé : \"L'Assemblée Législative de Québec\", dans lequel se trouve un télégramme de l'honorable député et les paroles que j'ai déjà rappelées.\n\nFaucher de St Maurice—Je proteste, M. l'orateur, cela est faux.\n\nL'hon. M. Mercier—Ce n'est pas moi qui l'ai dit, c'est dans le \"Canadien\" du 18 novembre. Est-ce vrai ?\n\nFaucher de St Maurice—Où est mon télégramme là-dedans ! [Rires.]\n\nL'honorable M. Mercier—Est-il vrai que 23 députés ont protesté ? Est-il vrai que si la majorité de l'Assemblée Législative avait su que Louis Riel serait exécuté, qu'elle se serait levée en masse, comme vous le dites ici ? Nous allons le voir par le vote. On ne s'en douterait pas par les discours prononcés jusqu'à présent.\n\nM. Faucher de Saint-Maurice—Il va faire croire que c'est moi qui ai demandé la mort de Riel...\n\nM. Gagnon—Non. C'est le citoyen qui a demandé grâce, c'est le député qui approuve l'exécution.\n\nL'honorable M. Mercier—Je n'en lirai pas plus. Maintenant quel est le journal où tout cela a été écrit ? C'est le même journal où depuis quelque temps l'on écrit que je suis un\nmisérable, un homme sans principes, que je cherche à exploiter le préjugé national au profit de mon parti, que l'honorable député du comté de Québec n'est que mon instrument etc. etc. C'est le même journal qui a publié tout cela.\n\nEst-ce que j'en ai dit autant que ce monsieur en a dit ou écrit ? Ai-je été aussi loin que lui, ai-je été aussi sévère ? Non. Comment se fait-il donc que je suis resté dans le mouvement et que lui en est sorti ? Comment se fait-il que cet homme qui était à mes côtés sur le Champ de Mars, à Montréal, et qui m'applaudissait, comment se fait-il qu'il m'insulte aujourd'hui parce que je dis la même chose que je disais alors ?\n\nEst-ce qu'il s'est passé quelque chose depuis pour lui faire changer de conduite ? Est-il arrivé quelque chose d'extraordinaire ? Je ne vois pas comment Riel, qui était malheureux, soit devenu un misérable. Est-ce que ce même Riel ne mérite pas autant de sympathie maintenant qu'il est pendu, qu'il en méritait quand il vivait ?\n\nEst-ce que si ce journaliste a changé d'opinion sur cette question, il ne pourrait pas au moins respecter le cadavre de ce pauvre métis ? Est-ce qu'on ne pourrait pas respecter la mère de ses pauvres orphelins, qui se meurt dans le plus profond des désespoirs ? Est-ce qu'on ne pourrait pas respecter ses pauvres enfants, que la haine des orangistes et la sclérose des nôtres ont rendus orphelins ?\n\nEst-ce qu'on ne pourrait pas au moins respecter ces deux pauvres enfants ? Faut-il que les tergiversations malhonnêtes d'un journaliste sans cœur et sans honneur aillent jusqu'à déshonorer la mémoire du père de ces pauvres petits enfants ? C'est le langage des orangistes qui est tenu aujourd'hui dans le Canada, dans ce même journal qui publiait des articles contre l'orangisme parce que les orangistes demandaient le sang de Riel. C'est lui maintenant qui traîne son cadavre dans la boue et le livre à la vengeance des orangistes qu'il dénonçait naguère.\n\nQu'est-il donc arrivé pourtant changer cet homme ? Mais s'il veut changer d'opinion, s'il veut se déshonorer, au moins qu'il se déhonneure tout seul. Pour l'amour de Dieu, s'il veut se trainer dans la boue, qu'il me permette de ne pas en faire autant. Je ne lui demande pas de m'approuver, mais au moins qu'il me laisse suivre le chemin de l'honneur et du devoir. (Applaudissements.)\n\nM. Vanasse, député de Yamaska et rédacteur en chef du Monde, au cours d'un discours prononcé à Montréal le jeudi, 19 novembre disait :\n\n\"Il proteste contre l'exécution de Louis Riel. IL NE VEUT PLUS SUPPORTER LE GOUVERNEMENT QUI NE MÉRITE PLUS LA CONFIANCE DES HOMMES BIEN PENSANTS. SIR JOHN EMPORTERA DANS SA TOMBE LE DÉSHONNEUR QUI S'ATTACHE À SON NOM. Quant à lui, il est prêt à remettre son mandat, si ses électeurs n'approuvent pas sa conduite.\"\n\n\"Nous dénonçons le gouvernement Macdonald ET DEMANDONS SA \"DECHÉANCE\" (Le Nord du 26 novembre)\n\n\"........Nous n'apprenons rien en disant qu'il se rendra des comptes à la prochaine session. Et nous le jugerons lui (Sir John) comme les autres.\n\n\"Si c'est, comme nous le croyons, le parti orangiste qui a présidé à l'acte impolitique de ce jour, IL Y AURA UN RÈGLEMENT DÉFINITIF ENTRE CE PARTI ET L'NOTRE HORMIS QUE L'ARRÊTE DE COMPTE DATE D'AUJOURD'AUI MEME, CE QUE NOUS SERIONS LOIN DE REGRETTER. Si le gouvernement a eu la main forcée par cette coterie maussade qui vit exclusivement de haine, IL EN SUBIRA LES CONSÉQUENCES.\"\n\n(La Minerve du 16 novembre)\n\n\"La voix de l'humanité n'a pas été\nentendue. Le droit et la force triomphent, c'est vrai ; mais la justice a les mains couvertes de sang. (Le 'Qotidien' du 16 novembre)\n\n\"Nous sommes pour toutes les protestations légales, pour tous les moyens capables de prouver que nous réprouvons l'acte odieux perpétré ce matin.\" [l'Événement du 16 novembre]\n\n\"Nous écrivions hier :\n\n\"C'est pour la Puissance du Canada un jour de deuil que celui où elle voit se dresser un échafaud politique.\n\n\"Nous aurions pu ajouter que, pour la province de Québec surtout, cette date du 16 novembre était une date funèbre.\n\n\"En effet, à Montréal, à Québec, dans tous nos centres populaires, la nouvelle de l'exécution a été accueillie par une explosion de pitié et de colère. Il est clair que la province de Québec attendait une mesure de clémence. Son attente a été trompée, et voilà pourquoi elle s'agit.\"\n\n[Courier du Canada du 17 novembre]\n\n\"L'élément français et catholique a payé son tribut à la haine des sectaires.\n\n\"Ajoutons que le parti conservateur de la province de Québec a reçu la récompense de l'alliance politique qui a permis à cette minorité, méprisée dans sa propre province, de partager avec lui l'honneur du pouvoir.\n\n\"Notre députation a le sentiment du patriotisme et de l'honneur national. Elle a la confiance du peuple. Qu'elle se concerte avec sagesse et agisse avec prudence, et elle peut compter sur l'appui de la province dans tout ce qu'elle fera pour maintenir son prestige et lui assurer des alliances profitables.\n\n\"Car il est inutile de se le cacher, l'orangisme, qui a toujours été un élément désorganisateur dans le parti conservateur, a creusé un abîme entre nous.\"\n\n[Le Nouvelliste du 17 novembre.]\n\n\"Les Canadiens-français unis n'auront jamais un programme injuste envers les autres nationalités.\n\n\"Les Canadiens unis ont obtenu, dans le passé, le gouvernement responsable au pays ; ils ont conquis toutes les libertés politiques, qui font maintenant l'orgueil et la prospérité des diverses races du Canada.\n\n\"Les Canadiens-français, s'unissant de nouveau aujourd'hui, auraient encore pour objectif l'intérêt général, et à cette condition, ils ne manqueront jamais d'alliés pour triompher comme ils ont fait sous les Lefebvre, les Baldwin et autres.\n\n[Le Journal de Québec du 20 novembre:]\n\n\"Tous ces journaux ont successivement tourné et sont redevenus les humbles serviteurs du gouvernement qu'ils avaient maudit.\n\nVoici quels sont les journaux conservateurs qui sont restés jusqu'à ce jour favorables au mouvement national : \"l'Étendard,\" la \"Presse,\" le \"Post,\" le \"Journal des Trois-Rivières,\" \"l'Union des Cantons de l'Est,\" la \"Vérité,\" la \"Presse de Farnham,\" \"l'Impartial,\" le \"Telegraph,\" le \"Pionnier de Sherbrooke,\" et le \"Progrès de l'Est.\"\n\nHonneur à eux !\n\n[De la Minerve du 6 octobre 1885]\n\nLE CAS DE RIEL\n\n\"Nous lisons dans le Nord, de St Jérôme :\n\n\"Tout est tranquille maintenant, ou à peu près ; les têtes sont plus calmes, les espérances plus fortes. On sait que Riel ne sera pas exécuté : c'était décidé depuis longtemps par ceux qui nous gouvernent ; nous pouvons l'affirmer maintenant. Dès que l'on entenait le moindre doute sur la juridiction du tribunal et l'état mental de Riel, on pouvait être sûr qu'un sursis serait accordé au malheureux métis, jusqu'à ce que la certitude la plus\névidente fût acquise sur ces deux points.\"\n\n(La Minerve du 5 octobre 1885).\n\n\"Heureusement que Riel et les métis qui ont eu de véritables amis, qui firent parler la voix du bon sens, du jugement et de la justice, plus haut que les appels à la démagogie et le bon sens, le jugement, la justice ont jusqu'ici triomphé. Riel ne sera pas pendu, les métis seront graciés, mais ils devront leur salut à ceux qui nous représentent à Ottawa, à Royal, à Girouard, à Desjardins, à Ouimet, ces vrais amis du métis, dont nous nous sommes fait un devoir de suivre la ligne de conduite; ils le devront à la Minerve entre autres qui n'a cessé de réclamer justice.\"\n\n[De la Minerve du 14 octobre 1885]\n\n\"........Pauvre Riel, dans les éclairs de raison que lui laissait sa folie, il s'est aperçu qu'il servait de jouet à des intrigants bien ordinaires; il a voulu secourir leur bâti, mais que pouvait-il faire lorsque ces défenseurs quand même étouffaient ses cris d'indignation?\"\n\n(De la Minerve du 13 novembre 1885)\n\nRiel\n\n\"Pas de nouvelles d'Ottawa. Muets comme la tombe. On doit pourtant avoir pris une décision; car il ne reste que deux jours avant l'exécution, et c'est juste le temps qu'il faut pour qu'un messager parti mercredi soit arrivé à temps à Régina avec le mandat annonçant \"c'est le plaisir de Son Excellence que la loi ait son cours.\" Quelle sinistre ironie dans les mots de cette formule! Nous sommes convaincus que le gouverneur-général rendrait bien pour quelques jours à Sa Majesté la \"haute prérogative de miséricorde\" qu'elle lui a déléguée.\n\n\"Son Excellence a célébré hier la fête d'actions de grâce qu'elle a proclamée l'autre jour. C'était un jour de prières et de propitiation. Les rapprochements les plus étranges se produisent autour de cette date lugubre que la justice avait fixée pour une exécution. Les dépêches de Winnipeg nous en apportent un autre. C'était mercredi la date d'un grand banquet offert aux honorables MM. White et Caron. Quel mauvais goût pour ne pas dire quelle inconvenance d'inviter à une réjouissance publique à pareil jour, deux hommes politiques qui ont autant d'attaches dans notre province! On serait porté à croire par les rumeurs qui nous viennent de Régina, que le gouvernement a chargé des médecins spécialistes de s'informer de l'état mental du prisonnier. C'est une sollicitude louable de la part du gouvernement, si la chose a été faite. Refusant cette dernière demande du prisonnier nous paraissait cruel. Quel sera le résultat de cette enquête? Nous doutons fort que des médecins sérieux puissent prétendre que Riel n'est pas atteint de monomanie, au moins quant à ce qui regarde les questions du Nord-Ouest.\"\n\nM. l'Orateur, j'achève mes observations. J'ai entendu l'autre jour avec surprise un honorable ministre venir dire: \"Pourquoi donc faire ici tant de bruit pour Louis Riel. Les Métis ne s'occupent pas de Louis Riel; ils ne le regrettent pas. Il est mort et ils n'en parlent plus.\" Eh bien! M. l'Orateur, voici des résolutions qui ont été passées quelques jours après l'exécution de Riel, pas à Montréal, pas à Québec, mais dans les prairies du Nord-Ouest, où les Métis se sont réunis. Ils se sont transportés de très loin, de distances immenses pour venir protester contre l'exécution de celui qu'ils appelaient leur frère. Ils ont demandé à leurs frères du Canada de reproduire ces résolutions pour prouver que leurs frères du Nord-Ouest ont du cœur. Et l'on dit qu'ils ne s'occupent plus de\nLouis Riel : Est-ce que ces messieurs ont oublié la triste scène des funérailles de Louis Riel ? Riel eut son service funèbre dans l'église de Saint Boniface. L'église de Saint Boniface est à huit ou dix milles de la paroisse où demeurent la femme, la mère et les enfants de Riel, à Saint Vital. Quand cette pauvre femme eut obtenu la permission de faire transporter le cadavre de son mari de Régina à Saint Boniface, on craint un soulèvement. Les Métis sont venus, comme l'attestent des informations que j'ai ici dans mon pupitre, les Métis sont venus de très loin pour veiller le corps de ce pauvre Riel. Et lorsque l'heure du départ fut arrivée, on peut dire que toute la nation métisse était là, à l'exception de ceux qui étaient en prison ou en exil. Et ce sont les Métis qui ont porté à sa dernière demeure le corps de Riel. J'aurais voulu voir là les bourreaux de Riel. J'aurais voulu voir là ceux qui disent que la nation métisse a répudié cet homme. Car, à en juger par les lettres privées que j'ai reçues et par les conversations que j'ai eues avec quelques-uns de ceux qui étaient là, c'était un spectacle réellement touchant et il aurait fallu n'avoir pas de cœur pour ne pas être ému de ce qui se passait en cette circonstance. Ceux-là qui viennent nous dire que Louis Riel était répudié par ses gens en ont menti. Louis Riel a été respecté, vénéré jusqu'à ses derniers moments. Toutes les nouvelles sont dans ce sens-là ; et ceux qui aujourd'hui disent le contraire, parlent pour avoir un prétexte de salir cette réputation nationale. (Ecoutez ! écoutez !) Il n'y a rien de nouveau là-dedans. Est-ce qu'on n'a pas traîné dans la boue nos patriotes de 1837 ? Est-ce qu'on ne s'est pas emparé de la mémoire de Chénier, de Sanguinet et des autres patriotes de l'époque pour la salir de la fange de la calomnie ? N'avez-vous pas vu la Minerve, journal fondé par un grand patriote, M. Duverney, jeter l'injure à la face de ces grandes figures nationales ? Est-ce que vous n'avez pas vu, vous qui avez lu l'histoire, est-ce que vous n'avez pas vu dans la chambre d'assemblée en 1849, au moment où le parlement brûlait, grâce à la torche des orangistes, en 1849, au moment où Sir John Macdonald refusait de laisser passer le bill d'indemnité en faveur des patriotes, n'avez-vous pas vu M. Blake se lever et dire : vous m'insultez aujourd'hui parce que je veux défendre la mémoire des patriotes de 1837, mais avant dix ans le pays rendra justice à ces hommes qui ont sauvé les libertés dont le Canada est fier aujourd'hui ! (Applaudissements.)\n\nM. l'Orateur, c'est l'histoire qui se répète. Tous les grands patriotes ont été traînés dans la boue. Tous les grands hommes ont été insultés par des hommes qui n'étaient pas dignes de détourner les cordons de leurs souliers. [Applaudissements.] Lisiez l'histoire et vous verrez cela.\n\nOn m'a reproché, on l'a dit dans certaines gazettes, d'avoir comparé Riel au Christ. Voici mes paroles, et j'espère que cette fois-ci, on les reproduira telles que je les ai dites. Je suis fier d'avoir prononcé ces paroles et je n'en ai pas honte. \"Riel notre frère est mort victime de son dévouement à la cause des Métis dont il était le chef. Il est tombé victime du fanatisme et de la trahison, victime du fanatisme de Sir John A. Macdonald et de quelques-uns de ses amis ; et comme le Christ il a pardonné à ses bourreaux.\" (Applaudissements). Je n'ai pas comparé Riel au Christ. Je suis un de ceux qui croient à la divinité du Christ, et ma conduite religieuse le prouve : je ne comparerai jamais un homme à un Dieu. Mais quand j'ai dit que Riel avait pardonné à ses bourreaux comme le Christ, j'ai dit la vérité. [Applaudissements].\n\nM. l'amicus—Très bien.\n\nL'hon. M. Mercier—Le Christ est le premier sur la terre qui ait pardonné à ses bourreaux. Avant lui, les\ncondamnés mouraient en les maudissant. Le Christ est le premier qui ait donné ce grand exemple de charité. Et les patriotes de 37 et le patriote de 84 ont suivi l'exemple du Christ. J'avais raison de dire, que, comme de Lorimier, Riel avait donné son cœur à son pays, et que, comme le Christ, il avait pardonné à ses bourreaux. [Applaudissements].\n\nM. l'Orateur, ma tâche est finie. Je sais que j'ai fatigué une partie considérable des membres de cette Chambre. Je suis convaincu qu'il aurait été plus sage de me taire, qu'on me permette de le dire, je suis convaincu que j'ai fatigué mes adversaires sans profit pour ma cause, mais j'ai voulu, avant que le vote fût enregistré, établir notre position d'une manière bien claire et bien définie. L'honorable Procureur général a cru devoir être personnel dans ce débat, je ne les suivrai pas sur ce terrain. Il a cru devoir dire que ce que nous faisions était de l'hypocrisie, que nous n'étions pas sincères, que lui était un ancien condisciple de Riel, qu'il l'avait aimé, qu'il l'avait aidé, qu'il l'avait soulagé. M. l'Orateur, quand Louis Riel est venu en Chambre, en 1873, pour y prendre sa place comme député de Rouencher, à la mort de Sir Geo. Étienne Cartier, à qui s'est-il adressé pour être reçu dans la Chambre ? Il s'est adressé au député de Rouville, et le député de Rouville, c'était moi. [Applaudissements] Il m'a fait demander un rendez-vous chez M. Alphonse Desjardins, député d'Hochelaga. Alors M. Desjardins n'était pas député de la Chambre, il n'a été élu qu'en 1874. Je suis allé le rencontrer dans la vieille maison de M. Paré. Riel était un fugitif, j'étais un libéral. Il est venu à Hull. Il était convenu que j'irais le recevoir à une petite porte latérale pour le faire asseoir, je m'y suis rendu avec l'assistant greffier qui n'est plus là. Malheureusement, au moment où nous allons faire ce qu'il y avait à faire, quelqu'un est arrivé dans la chambre et ce pauvre Riel est parti. L'année suivante, il a réussi à se faire asseoirment d'une manière régulière. Je n'étais pas à la Chambre alors. Mais quand Riel a eu besoin d'un ami, il est venu à Saint-Hyacinthe, dans l'humble étude d'un avocat qui était alors en société avec le juge Bourgeois, des Trois-Rivières. Il est venu me demander de l'hospitalité et il l'a eue loyalement; il est venu demander protection à ce libéral, et il a eu protection. Il est resté dans ma maison, et c'est un des beaux souvenirs de ma vie de l'avoir reçu chez moi. L'honorable Procureur général a bien tort de croire qu'il n'y en a pas d'autres que lui qui ont soulagé ce pauvre malheureux. Non seulement je lui ai donné l'hospitalité, mais j'ai trouvé moyen de l'aider, et il s'en est toujours souvenu. Et, quand plus tard il a été question de faire un mouvement pour Ambroise Lépine, nous n'avons pas attendu que les conservateurs de Montréal commencassent le mouvement. Je me suis mis à l'œuvre avec mes amis de Saint-Hyacinthe et j'ai collecté une somme convenable que j'ai envoyée à Mgr Taché pour la famille de Lépine [applaudissements]. On n'a pas l'habitude de se vanter de ces choses-là, mais ça se fait tout de même et on le fait avec plaisir. Certains hommes ont tort de laisser croire que tout le dévouement est de leur côté. Il me semble que je n'ai jamais reculé quand il s'est agi de dévouement. Il me semble que quand il s'est agi de secourir quelqu'un, quelqu'un de pauvre que je, fusse, j'ai trouvé moyen de le secourir. Aujourd'hui, si je me suis levé pour adresser la parole, et si j'ai parlé si longtemps, je croyais que je devais cela à la mémoire de Riel. L'honorable Procureur général peut croire qu'il a fait plus que moi pour Riel. Mais si l'âme de Riel sait, ce qui se passe dans cette Chambre, elle doit trouver que les temps sont bien changés. Riel doit trouver qu'il a peut-être été trop pressé de dire dans son testament : \"Je pardonne de tout mon cœur à mes ennemis et je remercie les...\"\n\"citoyens de la province de Québec de\nce qu'ils ont fait et de ce qu'ils se pro-\nposent de faire pour moi.\"\n\nOr si j'ai bien compris, celui qui\nm'insulte aujourd'hui dans le Canadien\nparce que je défends la mémoire\ndu père de Jean, le fils\nde Riul, a déclaré lui-même qu'il\nse chargeait de l'éducation de Jean,\nqu'il se chargeait de le faire instruire\ndans un séminaire. Avant de m'insul-\nter, qu'il tienne donc sa parole. Il doit\nà la mémoire du grand patriote, c'est\nune dette sacrée!\n\nM. l'Orateur, ma tâche est finie.\n\nOn a dit que ce mouvement n'était\npas sincère de notre côté. De quel droit\nces gens-là viennent-ils nous juger? Où\nsont donc les preuves de leur dévoue-\nment au pays qui puissent leur permet-\ntre de nous insulter ainsi? Est-ce que\nnos pères n'étaient pas comme les vôtres\nsur les mêmes champs de bataille pour\ndéfendre nos libertés et en conquérir\nd'autres? Est-ce que nos pères ne mar-\nchaient pas la main dans la main com-\nme des frères pour défendre ce pays?\nQui vous donne le droit de nous insul-\nter de cette manière?\n\nEst-ce que nous n'avons pas, nous les\nlibéraux, fait ce que nous devions, dans\nla mesure de nos forces, pour servir\nnotre cher pays? Est-ce que vous n'avez\npas, vous, certains conservateurs, fait ce\nque vous pouviez, dans la mesure de\nvos forces pour perdre et ruiner ce\ncher pays? (Applaudissements).\n\nNous avons commencé ensemble ce\ngrand mouvement national, le 16 no-\nvembre dernier; vous étiez alors avec\nnous, et aujourd'hui vous êtes avec les\nennemis. Nous ne vous avons pas\nalors dit que vous étiez des hyp-\ncrites. Nous avons honte de l'avouer,\nmais c'est vrai: nous vous croyions\nalors. Mais, maintenant, sachez-le,\nnous aurions le droit de vous dire que\nvous étiez des hypocrites alors, comme\nvous êtes des traîtres aujourd'hui, et\nvous n'avez pas eu le droit de vous dire in-\nsultés. Et c'est vous qui osez, dans des\ncirconstances aussi déshonorantes, mettre\nnotre sincérité en doute, lorsque\nnous avons commencé ce grand mouve-\nment ensemble et que la crainte vous\nl'a fait lâchement abandonner.\n\nVous n'avez pas le droit de nous\njuger et nous avons celui de vous con-\ndamner. Nous sommes restés fidèles à\nla cause nationale et vous avez trahi!\n[Applaudissements] Malheur à vous!\n[Frémissements et applaudissements]\n\nQue les paroles brûlantes de notre\npoète national, Louis Fréchette, restent\ngravées dans votre mémoire et vous fai-\nsent regretter votre trahison.\n\n\"Ah! nos-nobles aïeux endormis sous la pierre,\nEn s'éveillant ont dû fermer leur paupière\nQuand ils ont vu des fils parjures à leur nom\nNous laisser outrager sans oser dire non.\nSi leurs regards ont pu suivre ce drame sombre,\nComme leurs coeurs si fiers ont dû saigner dans l'ombre,\nComme ils durent d'honneur vous maudire, hommes faux,\nQui pour les opprimés dressez des échafauds!\nAh! tremblez! ces grands morts, que trouble dans leurs tomb\nLe sang qui coule ainsi des froides hécatombes,\nOnt des voix qui sauront rémuer les vivants,\nLes crimes ont toujours des effets dissolvants.\nNon! l'ère des martyrs n'est pas encore fermée;\nTout vrai penseur le voit et le sent. La fumée\nDes bûchers trop souvent sut propager le feu.\nTremblez! vous dont l'audace ose ainsi tenter Dieu!\"\nTremblez ! bandits sans cœur dont la haine et la rage\nPréparent pour nos fils un avenir d'orage ;\nCelui dont le regard gouverne l'univers\nAvait dans sa sagacité à des peuples divers\nDonné ce sol fécond en patrimoine libre ;\nL'esprit chrétien devait maintenir l'équilibre\nEntre tous les enfants de ce commun berceau ;\nLeur paix dura depuis cinquante ans ; l'arbre seigneur\nEst devenu grand arbre et couvre au loin la plaine ;\nMalheur à ces serpents dont la nefaste haleine\nRépand dans ses rameaux les souffles empoisonnés,\nDes haines, des conflits et des rivalités !\n\n[Applaudissements. Bravos. Ap-]\nplaudissements dans les galeries. La main.\n\nLa séance est suspendue et M. Mercier est", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001500.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 58, "total-input-tokens": 78570, "total-output-tokens": 55511, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 207, 1], [207, 207, 2], [207, 2253, 3], [2253, 6096, 4], [6096, 9869, 5], [9869, 13466, 6], [13466, 17183, 7], [17183, 20823, 8], [20823, 24323, 9], [24323, 28055, 10], [28055, 31759, 11], [31759, 35368, 12], [35368, 39214, 13], [39214, 42697, 14], [42697, 46335, 15], [46335, 49852, 16], [49852, 53354, 17], [53354, 55219, 18], [55219, 58697, 19], [58697, 62258, 20], [62258, 65579, 21], [65579, 69089, 22], [69089, 72473, 23], [72473, 75673, 24], [75673, 79094, 25], [79094, 80787, 26], [80787, 84614, 27], [84614, 88162, 28], [88162, 91856, 29], [91856, 95601, 30], [95601, 99423, 31], [99423, 101331, 32], [101331, 104869, 33], [104869, 108194, 34], [108194, 111465, 35], [111465, 115032, 36], [115032, 118657, 37], [118657, 122314, 38], [122314, 125654, 39], [125654, 129308, 40], [129308, 132819, 41], [132819, 136302, 42], [136302, 139703, 43], [139703, 143113, 44], [143113, 146444, 45], [146444, 149754, 46], [149754, 153152, 47], [153152, 156691, 48], [156691, 160183, 49], [160183, 163428, 50], [163428, 166913, 51], [166913, 170386, 52], [170386, 173673, 53], [173673, 177127, 54], [177127, 180933, 55], [180933, 184863, 56], [184863, 188064, 57], [188064, 188748, 58]], "primary_language": ["fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]