[{"id": "958917a804fb81cd226da1174076002aa2d541fa", "text": "CHARLES MAIR,\nTRADER AND\nGeneral Merchant\n\nRIVER STREET,\nPrince Albert, Sask.\nJ. M. Campbell,\n\nRiver Street,\n\nPrince Albert, Sask.\n\nWholesale & Retail Dealer in\n\nDry Goods, Groceries,\n\nReady-Made Clothing,\n\nBoots & Shoes, Hardware,\n\nCrockery & Glassware,\n\nFlour and Feed, etc.\n\nFarm Produce and Furs Bought and Sold.\nMACARTHUR & KNOWLES,\nCORNER RIVER & CHURCH STREETS,\nPRINCE ALBERT, SASK.\nBankers & General Financial Agents.\nInterest Allowed on Deposits.\nNOTES DISCOUNTED.\nDrafts Issued Available at all Points in the Dominion.\nCollections Undertaken and Promptly Attended to.\nBankers, Merchants' Bank of Canada.\n\nR. B. WAY,\nWatchmaker and Jeweller,\nPOST OFFICE BLOCK,\nRIVER STREET,\nPrince Albert, Sask.\nISSUER OF MARRIAGE LICENSES.\nRight Hon. Sir John A. Macdonald,\nPremier of Canada.\nMcPHILLIPS'\n\nAlphabetical\n\nAND\n\nBusiness Directory\n\nOF THE DISTRICT OF\n\nSaskatchewan, N.W.T.,\n\nTOGETHER WITH\n\nBrief Historical Sketches\n\nOf Prince Albert, Battleford and the Other Settlements in the District.\n\n1888.\n\nPRICE $1.00\n\nQU'APPELLE, N.W.T.:\n\nPRINTED AT \"THE PROGRESS\" BOOK AND JOB OFFICE.\n\n1888.\n\nEntered according to Act of Parliament of Canada, in the year One Thousand Eight Hundred and Eighty-Eight, by Henry Thomas McPhillips, of the Town of Prince Albert, District of Saskatchewan, N.W.T., in the office of the Minister of Agriculture.\nWalters & Baker,\nGENERAL AND\nINDIAN TRADERS,\n\nRIVER STREET,\n\nPrince Albert, Sask.\n\n5653.1\nM24\n1888\nPREFACE.\n\nThe intention of this publication is not only to give as accurate a list as possible of the settlers of the District of Saskatchewan, but also to make known the advantages it offers as a field for settlement, with the hope that some at least of the many who are in search of a suitable place to settle may cast their lot in our midst, and thus share in the prosperity which is attending the pioneers of this district.\n\nWith that end in view brief sketches are also given of the history of Prince Albert, Battleford, and the other settlements. Had circumstances permitted more space would have been devoted to this latter subject.\n\nAdvertisements of the different business interests in the District are also included, and reference is made to the ranching and other industries.\n\nA view of Battleford, I regret to say, is not included among the others, owing to the fact that I was unable to secure a good photograph of that town. Steps will be taken, however, to do Battleford full justice in the next edition of this book.\n\nAs is always the case with the first edition of a work of this kind, a few omissions and typographical errors have occurred. The former consist principally of some facts in the history of Prince Albert and Battleford, and were the result of an effort to condense; the latter are of no consequence.\n\nThose who have spent a number of years in the Saskatchewan district, are conversant with its great natural advantages, and take an interest in its development, cannot fail to look upon this book, with all its shortcomings, as destined to accomplish, to some extent at least, the objects for which it is published. As for myself, I yield to no man in admiration for the Saskatchewan country and in faith in its future agricultural and commercial pre-eminence.\n\nTo our Board of Trade, particularly the worthy President, and other officers; and Mr. James Scott, of Qu'Appelle, Assa., who have rendered me valuable assistance, I beg to tender my sincere thanks.\n\nH. T. McPHILLIPS,\nPublisher Saskatchewan Directory.\n\nPrince Albert, Sask., N.W.T., Feb. 1st., 1888.\nSTEWART BROS.,\nTRADERS AND\nGeneral Merchants\n\nRIVER STREET,\nPrince Albert, Sask.\nVictoria Livery Stables,\nNesbit Street,\nPrince Albert, Sask.\n\nNeilson & McBeath\nProprietors.\n\nOur Stable is stocked with the best horses to be had in the country,\nAnd the cutters and buggies are the best Canada affords,\n\nThe former having been bought from J. B. Armstrong, Guelph, Ont., whose cutters have a world-wide reputation,\nand our buggies from Cober, of Hespeler, Ont.\n\nHaving commenced business only last spring\n\nOur rigs are new & our horses fresh.\n\nSingles, $3 per day,--Doubles, $5 to $6.\n\nReliable man in attendance day & night. Telephone in connection.\nW. SHANNON & CO.,\nDEALERS IN\nBOOTS AND SHOES,\nRubbers, Moccasins,\nTRUNKS, VALISES,\nMitts, Socks and Hosiery.\n\nBoots & Shoes Manufactured to Order.\n\nAll Kinds of Shoe Findings Always on Hand.\n\nCORNER RIVER AND CHURCH STREETS,\n\nPrince Albert, Sask.\nR. C. Wigmore & Co.\n\nRIVER STREET,\n\nPRINCE ALBERT, SASK.\n\nDealers in General and\n\nFine Lines of Dry Goods,\n\nReady-Made Clothing,\n\nHATS, CAPS,\n\nGENT'S FURNISHINGS,\n\nGROCERIES,\n\nGlassware & Crockery.\nINDEX TO ADVERTISEMENTS.\n\nPRINCE ALBERT.\nAgnew, Thos J...........opp. page 78\nAuld, Miss M.............132\nBetts & Gwynne..........69\nBratnober, R. H..........47\nBrown & Pearld..........75\nBusiness Cards..........140\nCampbell, T. N..........back cover.\nCampbell, J. M..........2\nCann, Ed. J..............front cover.\nCarter & Cockrell.......134\nClark, A. H..............51\nDavis, T. O..............80\nDallas, John............opp. 86\nDeacon, R...............133\nDonaldson & Penbridge..29\nEmmanuel College........opp. 46F\nFish, R. W..............79\nGarvin & Holmes.........63\nGoodfellow, R. T........63\nGoodfellow B............134\n\" Bros..................135\nHead, H. A..............opp. 86\nHurd & Baker............88\nJackson, T. E...........opp. 41\nJohnston, J. L.........front cover.\nKnox, Wm...............136\nMair, Chas..............1\nMacarthur & Knowles....3\nMacdonald, John A......70\nMoore & Macdowall......opp. 46B\nMcColl, Isaiah.........opp. 47\nMcDonald, John.........133\nMcDougall, H...........opp. 41\nMcIntosh & Gerrond.....138\nMcLeod, S..............inside front cover\nMcPhail, J. R..........opp. 71\nNeilson & McBeath.....10\nNorthgraves, G. D......28\nOram, Thomas...........opp. 46c\nPage, Charles..........136\nRobertson & Robertson..opp. 70\nRussell & Davis........135\nShannon, W. & Co.......11\nSmith, F. H.............133\nSt. Anne's Convent.....opp. 87\nStewart Bros............8\n\nStobart, Wm. & Son......page 87\nThompson, Chester.......70\nTimes...................opp. 79\nWay, R. B................3\nWigmore, R. C. & Co.....12\nWalters & Baker.........6\nWoodman Bros...........opp. 63\n\nBATTLEFORD.\nArcand, Damase.........115\nClouston, G. H.........104\nDery, Thos..............110\nDill, John..............102\nDulmage, R. W..........112\nGraff, Jacob............105\nHerald..................116\nLarkins, Mrs............110\nLatimer, Wm............111\nLaurie, Wm and R. C....112\nMacdonald, A...........98\nMackay, Dr. A. B.......105\nMahaffy & Clinkskill...101\nMackenzie, A...........112\nMacdonald, R. C........112\nMillie, H. H............109\nPrince Bros............106\nRichard, Edouard.......112\nSayer, Baptiste........111\nThom, A. E.............104\n\nMISCELLANEOUS.\nEmpire..................52\nCaswell, S. H, Qu'Appelle..132\nC. P. R..................139\nDominion Lands Regulations..118\nGrant, G. W., Saskatoon...84\nHodgson, Sumner & Co., opp..62\nJohnstone & Forbes, Regina..112\nJournal, Regina.........137\nLeader, Regina.........137\nLeeson & Scott........131\nM. & N. W. Ry.........117\nN.-W. Land Co.........120\nMcPhillips Bros........112\nMcPhillips, Wilkes & McPhillips, Winnipeg..112\nProgress, Qu'Appelle....141\nStrong, R. Dundas.......112\nWanzer Manufacturing Co...119\n*His Honor E. Dewdney Lieutenant Governor.*\nNORTHWEST TERRITORIES.\n\nThe total area of the three provisional districts into which that portion of the Northwest lying south of the 55th parallel of latitude has been divided, and of which the Hon. E. Dewdney (whose portrait appears on the opposite page) is Lt.-Governor, is 310,000 square miles, almost the whole of which is suitable for settlement, and large areas of which are rich in timber, minerals and grazing lands. Besides this there is a vast extent of territory lying to the north, including Athabasca, as yet almost unknown, of which large areas will doubtless be found to be equally rich in timber, minerals, and well adapted for settlement.\n\nHon. David Laird, of Prince Edward Island, was the first Lt.-Governor of the Northwest Territories, having been appointed on the 7th of October, 1876. Lt.-Col. Richardson (now Chief Justice Richardson), the late Matthew Ryan, and Lt.-Col. J. F. McLeod (now Judge McLeod), Stipendiary Magistrates, together with the Lt.-Governor, comprised the first Northwest Council. A. E. Forget was appointed Clerk of the Council, which position he still holds, and Battleford was chosen as the seat of Government. The first session of the Council was held at Livingstone, Swan River, in March, 1877. The second, third and fourth sessions were held in Battleford, the latter in May and June, 1881.\n\nOn the 3rd of December, 1881, the Hon. Edgar Dewdney succeeded Mr. Laird as Lt.-Governor and the seat of Government was removed to Regina. The fifth session of the Council was held in Regina, commencing on the 20th of August and ending on the 4th of October, 1883. A session has been held each year since.\n\nThe first member of the Council who was chosen by popular vote was Lawrence Clarke, Chief Factor of the Hudson's Bay Co., Fort Carleton, who was elected to represent the District of Lorne (Prince Albert) on the 25th of March, 1881. Since then the elected members have gradually increased, and the necessity for the establishment of responsible government has become so pressing, that the boon is almost certain to be granted at the next session of the Dominion Parliament.\n\nWhen we consider the vast extent of the territories, the comparatively brief time that has elapsed since they became part of the Dominion, and make allowances for the difficulties of opening them up, it must be admitted that their progress has been unprecedented in the history of America. True, the credit of the country has been drawn upon in anything but a gingerly spirit in order to develop them, but the result so far has been, as was expected, to greatly strengthen all the resources of the Dominion, while the future will not fail to convince more than ever all Canadians of the wisdom of acquiring the Northwest Territories.\n\nThe Canadian Pacific Railway has, of course, been the great colonizing agent. Without it settlement would have been impossible, and the Northwest would have remained almost as it was. It, however, is but a very\nindirect assistance to the development of the Saskatchewan country, the best portion of the Northwest. Indeed, but that we are Canadians, and hold national paramount to provincial interests; we might not scruple to complain of its having turned the tide of immigration away from us. It is to be hoped, however, that the government of the Dominion will take steps to secure us railway communication in the near future, not only with the east, but with Hudson's Bay. To this latter the commerce of the Saskatchewan country should flow as naturally as do the waters of the great river from which it derives its name. By the opening of this route also the whole Northwest would be brought into closer commercial relationship with the Old Country. In the words of Punch,\n\n\"Here is our Empire route,\nA right of way whose value to compute\nWould tax the Prophets.\"\n\nSong of the Saskatchewan.\n\nI spring from the mountain's rugged side,\nFrom its snow-capped turrets I leap,\nAnd through forests and prairies wide\nFor thrice a hundred leagues I sweep.\n\nWith the warmth of the summer sun\nI break from my prison of snow,\nAnd I leap, I dance, and I run\nAs on, on to the east I flow.\n\nThrough stately trees in serried ranks,\nThat seem upon all else to frown;\nBy Edmonton, whose lofty banks\nAnd pleasant homes look proudly down.\n\nPast Clover Bar, Saskatchewan,\nVictoria—post of queenly name—\nAnd Pitt, where gallant men were drawn\nTo quell rebellion's bloody flame.\n\nBy the Lone Land's first capital,*\nFit footstool for an earthly king;\nGreat in its youth, proud in its fall,\nTrusting in time its vict'ry to bring.\n\nPast Carlton where, in days gone by\nThe hunters gathered with their gains,\nAnd native revelry ran high\nAmong the children of the plains.\n\nBy Prince Albert, pride of the North,\nNestling closely beneath the hill\nFrom whose summit Justice looks forth\nWith Power, to bend man to its will.\n\nPast A la Corne, past Cumberland,\nNow close confined onward I sweep,\nNow into a lake quickly expand,\nThen down Grand Rapids wildly leap.\n\n*Mattieford. †Courthouse. ‡Barracks.\n\nMingling my waters with the tide\nEver swelling that northern sea\nWhose outlet is the ocean wide,\nWhose ports to untold wealth the key.\n\nI know not the moment when first\nThe sun's rays my fetters unbound,\nAnd forth from the mountains I burst,\nAnd through the broad valleys I wound.\n\nBut this much I know, that I reign\nOf north-western rivers the king,\nAnd from forest, and mine, and plain\nVast wealth to the east I will bring.\n\nThe lords of the forest shall fall\nAnd the mines shall yield up their store,\nWith the one man raise high his hall,\nAnd the other garnish it o'er.\n\nI'll bring of the husbandman's gain\nFrom the fertile fields of the land\nA rich store of its golden grain,\nAnd vast wealth of its golden sand.\n\nAnd the herds that feed on the plain,\nAnd the sheep that revel and feast,\nI will bring in my winding train\nTo the crowded marts of the east.\n\nAnd towns and cities proud shall rise\nAlong the winding shores I lave\nWith waters that leap from the skies\nAnd repel the touch of a slave.\n\nI spring from the mountain's rugged side,\nFrom its snow-capped turrets I leap,\nAnd through forests and prairies wide\nFor thrice a hundred leagues I sweep.\n\nH. T. McPhillips.\nSaskatchewan.\n\nSaskatchewan is the largest of the three provisional districts into which that portion of the Northwest Territories lying south of the 55th parallel of latitude, and west of Manitoba and east of British Columbia, has been divided. Its area is 114,000 square miles, that of Alberta 100,000; and that of Assiniboia 95,000. It is bounded on the east by the Nelson River, Lake Winnipeg, and Manitoba; on the South by Manitoba and Assiniboia, on the west by Alberta, and on the north by Keewatin. It is larger than Manitoba, nearly twice as large as Nova Scotia, New Brunswick and Prince Edward Island combined. It is nearly twice as large as England and Wales, and almost as large as England, Scotland and Ireland, and is capable of sustaining an equal population.\n\nIt derives its name from the Saskatchewan river, the two branches of which take their rise in the Rocky Mountains, and passing through Alberta and Assiniboia, enter the district from the south and west, form a junction about thirty miles east of Prince Albert, and empty their united waters into Lake Winnipeg at Grand Rapids. This river is known to be navigable for boats of light draught as far west as Edmonton on the North Branch, and Lethbridge on the South Branch, and drains a larger area of fertile territory than any river in the Empire.\n\nOf the early history of the country now forming the District it is not necessary to speak at length. Its original inhabitants were the Indian tribes, the descendents of whom are now confined to reserves set apart by the Dominion Government. The first whitemen to enter the country were the French voyageurs and traders, of which latter the Metis are the descendents. With the voyageurs came the French missionaries, who established missions at different points and succeeded in converting many of the Indian tribes. The advent of the Hudson's Bay Company is scarcely less remote, and with its amalgamation with the Northwest Trading Company the whole fur trade of the Great Lone Land passed into their hands. The first trading post established inland was Cumberland, over a century ago. By degrees others were established, until they were scattered throughout the length and breadth of the vast territory, and the Chief Factors exercised a sort of autocratic sway. Within the last quarter of a century, however, the march of civilization has lessened their prestige, and the trading monopoly they formerly enjoyed has ceased to exist, except in the far north, and even there it is being disputed.\n\nThe first settlements formed in the Saskatchewan District, apart from those immediately surrounding Hudson's Bay Company posts, were Prince Albert, in 1866; St. Laurent, in 1873, Battleford, in 1874; and Saskatoon, in 1883. As will be seen, Prince Albert and St. Laurent were established before the Canadian Pacific Railway was undertaken, and were making good progress before that great national highway\ncommenced to divert immigrants to the southern portion of the Northwest. Battleford had no existence previous to the original survey of the Canadian Pacific and its selection as the headquarters of the telegraph constructor. It, however, as well as the other settlements in Saskatchewan, has continued to prosper, though not as rapidly as they would have had not national considerations forced the present Government to change the route of our transcontinental highway.\n\nPhysical Features.\n\nSpeaking of the Saskatchewan country generally, in his pamphlet issued in 1883, Wm. Laurie says:\n\n\"Skirting along the valley of the North Saskatchewan from its source in the mountains throughout almost its entire length the lumberman's eyes are gladdened by the apparent endlessness of the forests of pine and spruce; underlying which are coal-fields far exceeding in area those in the east, and destined to keep the inhabitants of the treeless prairies in fuel for generations yet to come. The agriculturalist has far to seek ere he finds richer or more productive soil than abounds here; nutritious grass of the most luxuriant growth will afford sustenance for the myriad herds of the stock-raiser; iron mines await development; the beds of all our streams abound in gold, while indisputable evidence is forthcoming of the existence in paying quantities of silver, tin and lead; salt springs innumerable produce a finer quality of this valuable mineral than any of the now well known centres; gypsum beds, tar and petroleum springs, and quarries of useful stone are scattered over the country; while in the far north, as yet unpenetrated by civilization, the fur trade is still prosperous. These are things which are known to exist, and when it is considered how long they remained undiscovered, it is but fair to assume that a few years more will reveal other treasures, equally valuable, still hidden from the knowledge of men.\"\n\nThe picture given by Mr. Laurie is not overdrawn. If his knowledge of the country is not all gleaned from actual experience—and he has had a wide experience—it is based on the observations of others, and correct in every particular. But however skeptical some may be inclined to be regarding the variety and extent of the mineral resources of the Saskatchewan—and there are those who will doubt in the face of the most convincing evidence—there can be no question as to its great wealth in timber and its agricultural capabilities. The experience of farmers during the past twenty years in the settlement of Prince Albert, and of those of Battleford and other settlements of more recent date, has fully proved that the soil of the Saskatchewan country is equal in richness to that of any country, and that timber for all purposes exists within easy distances and in inexhaustible quantities.—Every grain, every vegetable, common to Manitoba is produced in Saskatchewan; strawberries, raspberries, cranberries, blueberries, blackberries, gooseberries, currants, and other wild fruit ripen in almost every quarter; flowers of all\nvarieties and colors bloom from early in spring to the end of August. There is no lack of vegetation of every kind, except in dry seasons where the soil is a little too sandy. This rarely occurs, however; besides it is a difficulty any farmer can overcome by a proper system of cultivation.\n\nFrost, Etc.\n\nAs to the climate, the reports so industriously circulated that summer frosts destroy our grain and that winter frosts are so severe that there is neither comfort for man or beast, are as fictitious as Rider Haggard's most fictitious productions. Blizzards may be the offspring of the north winds, but they commit their depredations on the prairie. They pass harmlessly over the wooded Saskatchewan country, and swoop down on the unprotected prairies of the southern country. Frosts we have, but men and beasts live, move and have their being in the midst of winter, and the fact remains to be recorded of either having been frozen in this country where ordinary care was taken, and those that have been frozen under any circumstance are few. Summer frosts! Well, sometimes they strike us in a low spot. But do they never visit southern or eastern latitudes, and if they destroy our grain, and winter frosts deny us comfort, tell us, ye vendors of news, how is that we, who love prosperity and comfort, who are highly cultivated, if you will, continue to linger in this region.\n\nGrasshoppers have never penetrated the Saskatchewan country, and the gophers common to this region are not the destructive pests found in the prairie country. They are what are known as the wood gopher, and live in the wooded districts. They have never touched the crops, nor are they likely to so long as the food they have been accustomed to in the past does not give out, a very improbable occurrence.\n\nThe reader, however, is not required to place explicit reliance on the statements contained in these pages. There are hundreds of intelligent settlers in the district, whose names appear in the directory portion of this book, who can be referred to for information. They have lived here for different periods, follow different occupations, and—the best evidence possible of their prosperity—have gathered their friends around them in a region far removed from a railway; evidently believing that it is easier to face a surplus in a fertile, though temporarily isolated, country, than a shortage in a barren one, no matter how near the railway.\n\nPrince Albert District.\n\nThe developments made, with regard to the Saskatchewan country since the Great Northwest became a portion of the Dominion, and explorers have examined and reported upon it, have effectually exploded the opinion previously held that it was a land of almost perpetual winter, that its summers were too short for cereals to ripen, and that it was only fit for habitation by Indians and wild beasts. I confess that when I first started for this country, some years ago, I was filled with a feeling something akin to dread. I imagined I was going from a land of comfort and\ncivilization to a region of discomforts and hardships. The familiar scenes of my boyhood days in the good old County of York, Ontario, loomed up before me, and I began to fear that I would never view their like again. Its green hills and valleys, its woods and glens, its lakes and streams, its herds of horses and cattle, and bleating sheep, its fields of waving grain and pleasant country homes, seemed to me to have no equal. I was mistaken, however. In this country, I, as well as others who approached in fear and trembling, found not only all that a reasonable man would expect in the way of comfort in a new country, but a great deal more. I found a land far excelling Ontario in richness of scenery and soil; I found pleasant country homes, fields of grain, and herds of horses, cattle and sheep, flowers, shrubbery, trees and immense forests; I found that if cold weather came earlier in the fall, seeding commenced much sooner than in Ontario, and that the hardships of the early pioneers of that Province were much greater than those of this district. Four years have elapsed since then, during which I have been witness of the prosperity and gradual increase of the settlers. Homes have sprung up on every side, fields and cattle have multiplied, and the scene is quite as homelike as in the older settled provinces. Schools have been established in all the settlements in the district, and churches in the most of them.\n\nThe fourth annual exhibition of the Lorne Agricultural Society, which took place last fall in Prince Albert, was much larger than many of the county fairs of Ontario. Thoroughbred stock, sheep, swine and poultry, were numerous, while grain and vegetables of every kind, homemade cheese and butter, were exhibited from the different settlements that would have done credit to any place. Over $1,100 worth in money and prizes were awarded at the exhibition, the most given in the Northwest for a like purpose.\n\nThe settler is safe in locating almost anywhere in this district. As it is easy to secure good land in the vicinity of the town of Prince Albert, however, he would be foolish to locate elsewhere. Shell River, about fifteen miles north-west of this town, is, without doubt, the best field for settlement in the district. But on all sides of this town there is good land, with abundance of grass, timber, and fresh water, and it is always wise to settle as near as possible to saw and grist mills, threshing and crushing machines, stores, banks, churches, etc., and a good market with a prospect of being close by a city in the near future.\n\nPrices are much lower than one would expect, being a very small advance on Winnipeg prices. Everything necessary for a farming outfit can be procured in this town. A settler should, however, bring a yoke of cattle or a team of horses, a wagon, and a few milch cows, poultry, etc. A good log house can be built for a small cash outlay, and timber for fencing and fuel costs next to nothing. This is the country for the man with little means, who wishes to commence farming. It is also the rancher's paradise, where blizzards come not, and the grass never fails.\nBattleford District.\n\nThat there is abundance of good land and that the climate is favourable to the maturity of grain and root crops in the Battleford District, was abundantly proved by the display made at the Agricultural Exhibition held last fall in the town of Battleford. I speak now from personal observation, and as a disinterested witness, save and except as a lover of the truth, I am anxious that justice should triumph, and that Battleford district should be placed before the public in its true light. At the exhibition referred to samples of grain and roots were displayed that would have done credit to any place in Canada. It is true there was not a large amount of grain exhibited owing to the fact that farmers had not concluded threshing, but enough was exhibited to prove that farming can be made a success in the Battleford district. Wheat, oats, barley, peas, and flax, were exhibited, all of which were of first-class quality. The wheat and flax were particularly good, the production of the latter uninjured, thus giving a flat contradiction to the assertion that flax will not, owing to early frosts, come to maturity in the Saskatchewan country. Among the roots exhibited I noticed potatoes, carrots, turnips, mangle-wurtzels, parsnips, pumpkins, beets, onions, cabbage, celery, citrons, tomatoes, etc., all of which spoke more eloquently than I can hope to of the fertility of the soil and the favourableness of the climate for the production of all kinds of field and garden products.\n\nThe display of horses, cattle, sheep, swine and poultry was not large, though some of the exhibits made under these heads were very good. It must be remembered, however, that the farmers are only commencing to recover from the very serious losses they sustained during the spring of the rebellion, many having lost all their cattle, and the most of them being badly crippled financially. There are, however, thoroughbred and other cattle coming in each year now, and soon not only will lost cattle be replaced, but countless herds of improved cattle, horses and sheep will be feeding on the nutritious grass of the valleys, ravines and hills of the Battleford district.\n\nTo find a suitable location the immigrant is not obliged to go outside the present limits of the settlement. Immediately surrounding the town, and within a radius of fifteen miles, farms are to be had. Houses can be built at little cost, fencing and fuel can be had for a mere trifle. It costs very little to keep cattle, as may be seen by reference to the list of ranchers in another part of this book, while the risks are few. The only drawback is the lack of railway communication, and this disadvantage is common to the whole of Saskatchewan. The time is not far off, however, when railway communication will be established with the east, when the cattle reared on the nutritious grass of this region will command a ready sale in foreign markets. In the mean time there is no reason why every farmer should not have more or less improved stock.\n\nEverything a farmer requires can be purchased in Battleford at reasonable prices.\nCrop Report for 1887.\n\nSince the spring of the rebellion, when most the settlers suffered such a severe loss, the struggle has been a hard one. The year of the outbreak no crop was put in, and the next year, unfortunately, was too dry, and only those who pursued a proper system of cultivation—a small proportion of the settlers—had good crops. Last year the yield of different kinds of grain throughout the district of Saskatchewan was greater than in any previous year. The season, contrary to the general rule, was too wet in the early part, which had the effect of prolonging vegetation beyond the usual term, and ripening season too far into the autumn, thus endangering the crops, particularly the wheat seeded upon low ground. Owing to this fact some fields of wheat were frost-bitten. None of the wheat, however, or, at least, a very small portion of it, was rendered unfit for grinding, and the greater portion was secured in a good condition. The yield per acre was also up to the average for this district, and nothing inferior to that of any part of Canada. The yield of oats was in some cases unparallelled by any I remember hearing of in the most favoured of climates. The quality was also excellent. Barley yielded largely, and the sample, as a rule, was as good as could be wished for. Peas—of which there was but a small area sown—were good. The reason there was such a small area of this grain sown was probably owing to the fact that swine, as yet, are not numerous enough to create a market for any quantity.\n\nSome flax was sown in the district, and the result set at rest forever all doubt as to whether that grain would mature in this region, the sample shown at the Battleford agricultural exhibition being pronounced equal to flax produced in any country. There is, in fact, less doubt as to its maturing than almost any other grain, as it can be sown as early and ripens much sooner. The only difficulty in the way of its production is the one that applies to the production of other products in larger quantities than the district requires—no outlet to eastern markets.\n\nFollowing is a statement of the yield per acre of the different grains for the district of Saskatchewan for the year 1887:\n\n| Grain   | Yield | Acres | Total |\n|---------|-------|-------|-------|\n| Wheat   | 831   | 25    | 12,875|\n| Barley  | 1,559 | 30    | 46,770|\n| Oats    | 1,602 | 35    | 52,070|\n\nTotal, 3,996 acres, 111,715\n\nBesides which the Indians had under cultivation about 2,500 acres, the average yield per acre from which area would be about the same.\n\nIn 1885 the total number of acres given as occupied were 505,953; cultivated, 19,545; broken, 10,600; seeded, 5,956.\n\nThe area given as seeded in the latter case includes that devoted to other products than wheat, oats and barley, allowing for which in the former case would bring the total area seeded in 1887 much higher than that of 1885.\nThe area given as seeded last year, however, is only approximated from the amount of seed wheat given out by the Government, with a small allowance made for seed grain from other sources, and, doubtless, is below the mark. What the farmer is most interested in is the average yield of wheat, barley, and oats per acre.\n\nNow I am of the opinion that the average given above, while correct as an average, does not do justice to the soil of Saskatchewan, and I will give my reasons. Farming is more or less a science. The soil may be ever so good, and yet an ignorant, careless farmer will fail to raise anything but a poor crop. He does not properly prepare the soil, he never summer-fallows or studies whether manure is required; he is careless of both the seed and manner of seeding, he lets weeds of all kinds grow among the grain, absorbing nourishment properly belonging to it, and preventing it from ripening much sooner than it would under other conditions. Worse than this, he does not select the field most elevated and affording the longest possible sunlight each day, but seeds in a low or shaded locality. In Saskatchewan there are farmers who never fail to have a good crop of wheat, oats and barley, for the reason that they farm on proper principles. There are many, the great majority, I am sorry to say, who always have poor crops, for the reasons I have given, and when an average is struck from the products of good and bad farming the inevitable result is that the country is placed in a false light before the world. The average yield per acre among the best of our farmers—and even they have room for improvement—last year was fully 25 per cent more than the figures given above. Populate this country with the same class as our best farmers and the result will be that Saskatchewan will stand second to no other in five years as a wheat producing country.\n\nThe yield of vegetables per acre last year was fully up to the average for which Saskatchewan is noted. In this particular class we cannot be surpassed. Potatoes, beets, turnips, carrots, parsnips, cabbage, cauliflowers, pumpkins, citrons, etc., seem to overgrow themselves, yet are perfectly sound. Corn and tomatoes were also raised, and it is only a question of time when their production will be quite equal to the demands of the the country. A little extra care is all that is required.\n\nPopulation.\n\nThe population of Saskatchewan according to the census was 10,595. Prince Albert district was credited with, 5,373; Battleford, 3,603, and Carrot River, 1,770.\n\nIf the increase in population since 1885 has not been very large—not much more than the birth rate—the reasons are not far to seek. Without railway communication with the east we cannot expect immigrants. The increase above the birth rate has been almost confined to the friends of our citizens. It is, at the same time the strongest evidence of the fitness of this country for settlement. People, as a rule, do not encourage their friends to settle in a country where they cannot prosper.\nStock.\n\nBy the census of 1885 the total number of horses and colts in the district of Saskatchewan was 3,061; working oxen, 822; milch cows, 1,985; other horned cattle, 2,893; sheep, 531, of which Battleford was credited 1; swine, 1,394; mules, 22.\n\nThe horses have more than doubled since then; cattle have increased three fold, and sheep more than six fold. Swine have not increased so rapidly as might have been expected, but the indications are that the next few years will witness a large addition to their numbers.\n\nI am happy to be able to state that Battleford district shares very largely in this increase, and that to the one sheep many others have been added.\n\nAnimal Products.\n\nIn the same census the yearly output of dairy products for the District of Saskatchewan was placed at:—Butter, 84,223 lbs.; cheese, 3,557. Of this amount Carrot River, though credited with 61 milch cows, was not credited with producing one pound. Whether the census was correct or not I am not prepared to say. At present however, and during the last two years, I know that a very large percentage of both those products comes from that settlement, and that the output is increasing every year.\n\nThe total increase under these heads throughout the district cannot have been less than one hundred per cent.\n\nIndustries of Saskatchewan.\n\nFollowing is a table showing the number of Industries carried on in Saskatchewan, hands employed, capital invested, total yearly wages, value of raw material, and value of articles produced:—In some cases it is impossible to give anything more than approximate figures. The value of the wheat entering the mills may fairly be taken as the number of bushels multiplied by 75 cents. The value of the flour ground will be the number of bags or barrels of flour multiplied by the market price, which varies according to grade and demand. About $3 per bag is the average. Otherwise the table is compiled from information gathered during my trip through the district last fall and is as correct as it was possible to make it.\n\nAs will be seen, the totals given for 1885 and the totals for 1887 vary materially, thus showing that not only in population, agriculture, and mercantile strength has the district progressed, but that every other industry has rapidly developed.\n\nOf this increase Battleford contributes a very creditable percentage, considering that the town is a shorter period in existence, its population much smaller, and, consequently, the requirements of that district not so great.\n### TABLE OF INDUSTRIES IN THE DISTRICT OF SASKATCHEWAN JAN. 1ST., 1888.*\n\n| INDUSTRIES                        | NO. EMPLOYED | HANDS | CAPITAL INVESTED | TOTAL YEARLY WAGES | TOTAL VALUE PRODUCED | VALUE OF ARTICLES |\n|----------------------------------|--------------|-------|------------------|--------------------|----------------------|-------------------|\n| Blacksmith Shops                 | 7            | 4     | $60,000          | $4,460             | $3,650               | $5,180            |\n| Grist Mills                      |              |       |                  |                    |                      |                   |\n| Saw Mills                        | 4            |       | $98,000          | $4,810             | $15,000              | $20,000           |\n| Printing Offices                 | 2            |       | $8,500           | $21,240            | $350                 | $250,000          |\n| Shirts, Door and Blind Factories | 1            |       | $6,500           | $3,000             |                      | $7,150            |\n| Bakeries                         | 2            |       | $3,000           | $3,000             |                      | $12,950           |\n| Boot and Shoe Manufactures       | 2            |       | $2,100           | $6,038             |                      | $12,876           |\n| Brick Yards                      | 2            |       | $1,000           | $5,100             |                      | $3,000            |\n| Carriage Making                  | 1            |       | $500             | $1,500             |                      |                   |\n| Saddle and Harness Makers        | 1            |       | $1,500           | $3,500             |                      |                   |\n| Tailors                          | 1            |       | $1,500           | $1,500             |                      |                   |\n| Tinsmiths and Sheet Iron Workers | 4            |       | $1,600           | $3,400             |                      | $1,750            |\n| Dress-making and Millinery       | 4            |       | $3,300           | $4,000             |                      | $7,050            |\n| Breweries                        | 2            |       | $3,732           | $5,160             |                      | $13,930           |\n| Photograph Galleries             | 2            |       | $1,300           | $3,650             |                      | $2,300            |\n| Gunsmiths                        | 2            |       | $5,000           | $1,000             |                      | $12,900           |\n| Threshing Machines               | 1            |       | $3,600           | $4,350             |                      | $3,610            |\n| Total                            | 52           |       | $9,600           | $4,168             |                      | $750              |\n\n*The totals by per census of 1885 were; 13 | 88 | 144,200 | 21,030 | 48,320 | 48,800\n\nTotal Value Produced: $376,851\nTHE RANCHING INDUSTRY.\n\nThough the ranching industry of the Saskatchewan country received a very severe check in the spring of 1885, particularly in the Battleford district, within the last two years it has not only recovered itself, but has assumed much larger proportions than most people in this country are aware of. Every year for the last three years there has not only been a natural increase, but there has been a great number imported. There is no longer any question as to this country being adapted for stock raising. The better it becomes known the more its fitness for that purpose becomes apparent. Immense tracts of hay land are not only to be found south of the Saskatchewan, capable of sustaining countless herds, but on the north side, and extending as far as the boundary of the district, are also to be found areas of hay land capable of sustaining all the cattle on the American ranches. Fresh water is also abundant, and the country being more or less wooded, protection is afforded to the cattle. The argument in favour of the south as a ranching country has always been that the winters are warmer and that cattle did not need protection. The results of carrying out that system, however, would seem to lead to the opposite conclusion. We, of course, have no herds comparing in numbers to those turned out on the shelterless plains of the south. Our ranching interest is just emerging from the state of infancy, and donning the garb of youthful healthiness. The experience of our ranchmen so far, however, has proved that while even in this northern country cattle can exist through the winter without any artificial shelter, and without being hay fed, it pays better to erect comfortable sheds and feed hay a couple or three months in the winter. They have found that the difference in the condition of the animals in the spring more than pays for the cost of keeping, and no risks are run from exposure. Indeed, the death of an animal from exposure, under ordinary circumstances, has yet to be chronicled. Whether this system could be adopted successfully with regard to herds of more than two or three hundred may be doubted. The conclusion seems reasonable, however, that if two or three hundred cattle can be successfully wintered by that system, a larger number could be wintered in the same way. The rage for unwieldy herds, in any case, is dying out, ranchmen in the south having learned from bitter experience that stock require to be cared for during winter.\n\nOne pleasing feature, and one which augurs well for the future of the ranching interests of this district, is the fact that large numbers of thoroughbred cattle have been imported, farmers and ranchmen having awakened to the fact that if they would make it pay they must have good stock. It will, of course, take time to improve the stock, every farmer not being able to purchase thoroughbred stock. Speaking on this subject at the dinner given at the Queen's Hotel, Prince Albert, by the Lorne District Agricultural Society, last fall, Mr. Chas. Robertson, President of the Carrot River Agricultural Society, said:—\n\"It is a mistake to suppose that the native cattle could not be improved. My opinion is that the native cattle can be improved much easier than the native cattle of the eastern provinces; that five years will suffice to make them equal to any in the country. We have the fodder in the shape of abundance of luxuriant grass, which can be had for the cutting, while in the older provinces cattle had to be fed on timothy and turnips. I am a pioneer for the third time, first in Quebec, then in Ontario, and thirdly in Saskatchewan, and I have no hesitation in saying that for cattle raising and general farming the Saskatchewan country is superior of either Quebec or Ontario.\"\n\nThis is the opinion of one of the most intelligent and enterprising farmers in the Northwest, and should be a source of encouragement to those who have native cattle. About 1,000 head of cattle are required each year for beef in the district thus affording a good market for steers and other fat cattle.\n\nHorse ranching is, as yet, in its infancy in Saskatchewan, though a number of thoroughbred stallions and brood mares have been imported. Only one ranche has been established, that of McFarlane Bros., a few miles east of Battleford. This firm a couple of years ago imported two Percheron stallions and a number of brood mares, and have now quite a large band of fine general purpose horses. This is the grade of horses best adapted to the country, being useful in the plough, buckboard, saddle or carriage, and easily kept. Horses are cared for during the winter on the ranches the same way as the cattle. Those who have only a few head stable them all the time. A few years will add largely to the number of horse ranches as well as improve the breed.\n\nSheep ranching is an industry which has developed greatly within a very short period in this district. The country is also eminently adapted for that purpose, the grass being rich, and abundance of fresh water being found almost anywhere. The sheep are let run during the fine winter weather, but are housed and fed in low sheds or mere wind-breaks during stormy weather. The cost of shelter amounts to comparatively little, and the cost of feeding them does not amount to more than the value of the wool on each animal. The grade of sheep best adapted for this country, and the grade most numerous here, are the fine-wool Merinos. The number of sheep in the country in 1885 was 534. At the end of last year they numbered 3,000. At this rate of increase in five years there will be 60,000 sheep in Saskatchewan, yielding 250,000 pounds of wool. The loss by death other than by the butcher's knife has been less than a quarter per cent, while in Montana last year it was over fifty per cent, the difference being accounted for by the fact that our sheep are sheltered and fed in severe weather, while sheep in Montana are left to the mercy of the blizzards and cyclones common to that country.\n\nSwine and poultry have not increased very rapidly, and there is room for very large additions to their numbers.\nGENERAL FARMING.\n\nWhile stock raising is a perfectly safe business in the Saskatchewan country to a man of means, general farming is the best adapted to the circumstances of the average settler, and is the best in the general interest. Large herds of cattle mean large areas uncultivated. What is wanted in this country is a population of general farmers, who will make the cultivation of the soil their chief aim, while at the same time they will not forget the advantages to be derived from the possession of a few head of horses, cattle, sheep, swine and poultry. Butter, cheese, eggs, beef, mutton, pork, and poultry are always saleable at good prices. Good prices are also obtainable for grain. Settlers who adopt this system cannot fail to prosper, and they are always independent. They have always enough for themselves and to spare.\n\nWhat capital does it take to commence general farming in this country, is asked? I answer, very little. The best farmers here commenced with almost nothing. Five hundred dollars will go further here than $1,500 in a prairie country. Timber for all purposes is plentiful, and a good log house and stable can be built very cheaply. Fencing costs only the labour. Horses, oxen, cows and sheep, wagons, ploughs, etc., can be purchased in Prince Albert. The immigrant, however, should bring all he requires with him, together with all his friends and neighbors.\n\nG. D. Northgraves,\nWatchmaker and Jeweller,\nDEALER IN\nWatches, Clocks, Jewelry,\nAND SILVER WARE,\nRIVER STREET,\nPRINCE ALBERT, SASK.\nGrand Union Livery Stable,\nNext Door to Queen's Hotel,\nChurch Street,\nPrince Albert, Sask.\n\nDonaldson & Pembridge,\nProprietors.\n\nThe Largest and Best Livery Stable in Prince Albert.\n\nGood Horses, Good Rigs,\nAnd Accomodating Men Always on Hand.\n\nProspectors & Others Cannot Do Better Than Secure Conveyances at the Grand Union.\n\nTerms Moderate.\nNo. 1—The Central Portion of the Town of Prince Albert, looking north.\n\nThe above view is taken from the brow of the hill to the south of the Town and overlooking the valley. To the north of the town, upon which fronts River street, is the North Saskatchewan, a view of which is given in No. 2. The portions of the view on the lower right and left corners are the eastern and western ends, the former showing the H. B. Co. post and other buildings in the dim distance, and the latter T. N. Campbell's and T. J. Agnew's stores. Immediately this side is the residence of Sheriff Hughes. Following the river front from left to right you pass the principal business places. On the right of where the view is taken from, and not shown in this view, is the Courthouse, to the left the new Barracks. The population of the town is about 800. Its yearly trade is greater than that of any place in the Territories, the fur trade alone amounting to about $50,000 a year. The town contains about 200 buildings, a number of which are brick. Its location is charming, and its general appearance homelike.\nTown of Prince Albert.\n\nEvery city, every people, had a beginning, and the greatest of commonwealths have sprung from feeble communities. As with others so with the town of Prince Albert, it had a beginning, and with no misgivings as to its future, no apologies for its past, I propose to give a brief sketch of its history. I may not be correct in all my details, it being no easy matter to be strictly accurate when written records are not to be had and the memory of the \"oldest settler\" is faulty. I hope, nevertheless, to be able to give a not uninteresting outline of its progress from the date of its foundation to the present time.\n\nIn 1866, twenty-two years ago, the late Rev. James Nesbit, a Presbyterian minister from Kildonan, Manitoba, arrived at Fort Carlton, on the North Saskatchewan, then the headquarters of what was known as the trading district of Carlton. The object of his coming was to establish a mission in connection with the church of which he was a minister. In company with him was the Rev. John McKay, now stationed at Assissippi, Shell River, who was conversant with the Cree language, and who was to act as his interpreter. At the time of their arrival the H. B. Co.'s council was in session, and on making known his object he was advised to go further down the river to a temporary trading post the Company then had a short distance east of the third meridian. Acting on this advice the rev. gentleman proceeded to the point indicated, and after a careful survey of the surroundings, took up a claim about two miles further east, or what is now known as river lot 78, Prince Albert survey. The first year he built a mission house, which still stands on the corner of River and Church streets and is occupied as a bankinghouse by Macarthur & Knowles. True to that unyielding spirit of loyalty to the British crown which is characteristic of all Scotchmen in the Northwest, and out of respect for the memory of the late Prince consort, the rev. gentleman called the mission \"Prince Albert.\" A few years later he built the log church now standing on King street and occupied as a High School by the Presbyterian Mission. From 1866 to 1874 every year brought in a few settlers from Kildonan, and others who had been in the H. B. Co.'s service in different parts of the Northwest, until the settlement extended along the river front for about six miles. Among the first to settle near the mission was James Isbister, who was born on the western shore of Hudson's Bay, and was for a number of years in the service of the H. B. Co. Among the settlers who came from Kildonan were the Drevers, McDonalds, McBeaths, McKays, Sutherlands, Andersons, Finlaysons, Spencers, Browns, McIvors, Pritchards, Adams, Halcros, Houries, Turners, Fiddlers, Fletts, Kennedys, Monkmans, Whitfords and others. Thus while to the H. B. Co. is due the fact that Prince Albert occupies the position it does, to the zeal of a Christian missionary, and\nthe descendants of the hardy Scotch pioneers of Manitoba is due the credit of having laid the foundation of what was destined to be the most populous and prosperous settlement in the district of Saskatchewan.\n\nAs may be supposed, very little farming was done by the early settlers, their labours in that direction being chiefly confined to raising enough produce to meet their own requirements, and they were generally absent except during the haying and harvesting season. Some made trips to Fort Garry, while the majority took to the plains in quest of buffalo, which were still to be found close by. In the winter trapping and fishing was their occupation. These were happy days for those who loved the chase, and many an interesting page might be given of the experiences of the pioneers of Prince Albert. In 1873 Capt. W. F. Butler, author of the \"Great Lone Land,\" paid a flying visit to the mission on his way back from Rocky Mountain House and intervening posts, whither he had been despatched by the Dominion Government to examine and report upon the extent of the ravages of the small-pox plague which had broken out among the Indians a couple of years previously. The gallant captain was a great lover of dog trains, and those who have read his very interesting book will doubtless remember how he goes into ecstacies over a train he bought from a Halfbreed at Fort a la Corne. They were, to his fancy, the creme de la creme of the canine race. There is a citizen of Prince Albert settlement, however, whom the captain once met at A la Corne who enjoys many a hearty laugh when he remembers how he palmed off his poorest dog train on that connoisseur of dog flesh.\n\nIn 1874 the first attempt at building a gristmill was made in the settlement, the late George McKay being the chief promoter of the enterprise. The motive power of this very much needed establishment was wind, but the undertaking proved a failure and the remains of the mill are still standing on the hill to the south of the town. In the absence of better the settlers had recourse to two hand-mills owned by W. H. Bartlet, then being run by horsepower on the site where Chas. Mair's store now stands. Up to this time the settlers were almost exclusively Kildonan people and H. B. Co. servants. Now, however, settlers commenced to arrive from other quarters as well, and the honor of contributing the citizen whose enterprise more, perhaps, than that of any other, has conduced to the advancement of the settlement, fell to the lot of the Emerald Isle. While hunting on the plains in that year Capt. Moore paid a visit to the Mission. Perceiving that lumber for the needs of the settlement was being cut by whip-saws, and perceiving, also, that a steammill was not only a necessity at that time, but would become more and more a necessity, he promised to build one as soon as possible. He accordingly returned the following year and let the contract for the mill, leaving again for the east to purchase the necessary machinery. In the summer of 1876 he returned with the machinery, having been two months on the trail between Winnipeg and Prince Albert. With him came Alex. Louden, Thos. Miller, John Mackenzie, and Wm. Lyttle. On inspection of the frame erected for the machinery it was found too light,\nand he was forced to tear it down and rebuild. The mill was completed that fall and lumber cut by steam for the first time in the settlement. In this year also Wm. Hodgson built a grist mill driven by waterpower, on Red Deer Creek, a few miles south-west of the Mission, which is still standing.\n\nIn 1875 Prince Albert acquired another settler who was destined to spend the remainder of his life in the place, and to win a high position in the affections of the people by his zeal as a Christian minister and his enterprise as a citizen. The English church, nothing wanting in its zeal for the spreading of the gospel in the Northwest, and seeing the growing necessity for Christian ministers in the Saskatchewan country, in 1874 erected that region into a Bishopric and appointed the Ven. Archdeacon McLean, of St. John's Cathedral, Winnipeg, to the important and responsible office of Bishop. His Lordship arrived in Prince Albert early in 1875, travelling by dog train. Liking the location of the place and having a firm conviction that it was destined to become a place of some importance, he chose it as his headquarters. He secured what is now known as River Lot 55, and took up his residence in a log house close by. In 1876 he built St. Mary's church, and later on founded Emmanuel College. In this year Joseph Hurd, of Hurd and Baker, and Joseph Coombes arrived. At that time the only ones doing business in the settlement were the H. B. Co., who had previously removed from their trading post to its present location on river lot 83, and R. J. Pritchard and Joseph Stevenson, who had trading posts on river lots 64 and 66 respectively, the latter where Mr. Mair's house now stands. In this year the first Government mail arrived at Fort Carlton and Battleford; the mail carrier being the late Hon. James McKay. In 1877 Prince Albert began to receive a mail every three weeks, by way of Ft. Carlton, the postmaster being Alexander McBeath.\n\nIn 1877 Charles Mair arrived from Portage la Prairie, immediately built a store on river lot 63 and commenced business on eastern principles, putting counters in his store and displaying his wares to the natives. In the following year the H. B. Co. built the eastern wing of their present large premises. Dr. Porter and T. N. Campbell arrived this year, the former purchasing river lot 63 with a view to going into the town-site business, and the latter starting a book and stationery store in a log hut now standing on the south-east corner of River and McKay street, or river lot 79. The next year brought more additions to the settlers, among them being Ashdown & Agnew, Betts & Gwynne, and R. J. McPhail. The former firm commenced business in rented premises on the Porter estate, and the latter firms rented log premises from John A. Macdonald on river lots 81 and 82. In 1879 building operations commenced somewhat lively on the Porter estate, Ashdown & Agnew and several others erecting buildings, until it looked as if the town would be located on the doctor's property. Fortune decided otherwise, however, the Mission authorities, by the advice of Rev. Mr. Seivright, then in\n\nNote—For \"1870\" in the fifth line of the following page read 1879.\ncharge at Prince Albert, and Hurd & Baker, owners of river lot 77, adopting such a generous policy towards merchants and others, as to at once secure the establishment of the town on their property, and effectually prevent the further growth of rivals. The first to build on the Mission property were Betts & Gwynne, in 1879, their example being followed by George T. Brown, Harry Keenan, J. O. Davis, Alex. Stewart, J. L. Johnston, J. M. Campbell, Isaiah McColl and others. A number of buildings were also put up on the Hurd & Baker estate, among them the stores of T. J. Agnew, T. N. Campbell, Wm. Tait, and Walters & Baker. In 1880 Thos. McKay built a sawmill on the river bank just north of Mr. Mair's store. In this year R. B. Way, T. E. Jackson, W. R. Fish, J. M. Campbell, and Col. Sproat arrived. A Freemason's Lodge was organized, Charles Mair was appointed postmaster, the H. B. Co. built a gristmill and Goodfellow Bros., who arrived the year before, a sash and door factory. Not less than $50,000 were expended this year in new buildings and improvements. The next year (1881) brought in R. N. Bratnobeer, W. V. Maclese, Dr. Bain and others.\n\nThis year marks an important era in the history of the Prince Albert district and of the Northwest, inasmuch as it was in this year the principle of representative government was first given effect to in the Northwest, by the election by popular vote, on the 25th of March, of L. Clarke as member for Lorne District in the Northwest Council. A Dominion Lands office was also opened, the late George Duck being the agent, and P. V. Gouvreau, now agent at Edmonton, assistant agent. Goodfellow Bros. built the sash and door factory now standing on McKay-street this year, and about $60,000 in all were spent in improvements. Another event took place this year which resulted in the acquisition of a citizen who was destined to figure prominently among the public men of the Saskatchewan and of the Northwest—the formation of a partnership between Capt. Moore and D. H. Macdowall, now member for Saskatchewan in the Dominion Parliament.\n\nThe next year (1882) Macarthur & Knowles, G. D. Northgraves, A. McNabb, Shannon & McLeod, Stewart Bros., Hugh McDougall and W. R. Gunn arrived. Wm. Stobart & Son established a branch of their business in the old log premises close by the river on the Mackenzie estate, under the management of O. E. Hughes. The Times was established by Messrs. Spink & Maveety, in the log premises now occupied by R. Buckley on the George McKay estate. A Roman Catholic mission was established by Rev. Pere Andre in the old log premises on river lot 75, which formerly belonged to Joseph Finlayson, now Indian agent on Mistawasis reserve. In this year Chief Factor Clarke was removed from Carlton to Prince Albert, and Mr. Turner was removed from the latter place to Ft. a la Corne, Prince Albert thus becoming the headquarters of the H. B. Co., for what was originally known as the trading district of Carlton. Messrs. Moore & Macdowall, finding their mill too small, decided to build a larger one, and sold the machinery to Thos. McKay, who removed it to the river bank in rear of Chas. Mair's store.\nIn this year also Thos. Agnew removed the store erected by him on the Porter estate, to the Hurd & Baker estate, which premises are now occupied by T. E. Jackson.\n\nIn 1883 Moore & Macdowall built their present mill, which has a capacity of 50,000 feet per day, and is the largest in the Saskatchewan country. A brass band was organized under the leadership of Louis St. Louis. The Prince Albert registration district was set apart on the 27th of March, Lt.-Col Sproat, who was for some years member for the south riding of Bruce, Ont., in the Dominion Parliament, being appointed registrar, and on the same day the capital of the Northwest was removed to Regina. This year was rendered somewhat memorable, to the people of Prince Albert, at least, by the squabble that took place over the location of the telegraph office, a good deal of illfeeling having been created between some of the citizens. This feeling, however, soon passed away, and the men who pulled up the poles to the east end and those who had been instrumental in their erection enjoy many a hearty laugh over the many ludicrous circumstances connected with the incipient rebellion. The telegraph office was ultimately located on the Hurd & Baker estate. A timber office was opened, J. D. Waggoner, of Kingston, Ont., being appointed agent. Previous to this Joseph Finlayson acted as deputy-agent, Mr. Anderson, of Winnipeg, being agent for the Northwest Territories. St. Paul's (Presbyterian) church was built. It is a brick structure, and stands immediately opposite Church street, on the south side of Selkirk. On June 5th the second election of a representative for the District of Lorne took place, D. H. Macdowall, now member for Saskatchewan District in the House of Commons, defeating Dr. Porter. Chas. Mair discontinued business, and removed with his family to Windsor, Ont., renting his store to Mahaffy & Clinkskill, who shortly afterwards removed to Battleford. During Mr. Mair's absence R. B. Way had charge of the Postoffice. St. Anne's convent was established by ladies of the order of Faithful Companions of Jesus, in the Roman Catholic Mission buildings, on River street.\n\nIn 1884 A. H. Clark, druggist, arrived, commencing business in a building rented from Lt. Col. Sproat, on River street, and previously occupied for a brief period as a bank by a man named Flood. Stephen Brewster, now of Brewster & McKay, advocates, also arrived. St. Alban's (Anglican) church was built, on the north side of Third street, near the corner of Church street. Since its erection it has been considerably improved and enlarged. Two serious fires occurred this year, resulting in the destruction of the mills of Thos. McKay and the H. B. Co. John McTaggart succeeded the late George Duck as Dominion Lands agent, Mr. Gouvreau, the assistant agent, being appointed agent at Edmonton, and Louis Schmidt assistant agent at Prince Albert.\n\nIn this year the agitation at the South Branch commenced, and a delegation was sent to Montana to secure the assistance of Louis Riel. The exiled chief accepted the invitation, and in due course arrived at St. Laurent, where he shortly afterwards formulated his famous \"Bill of\nrights.\" The agitation continued to increase in strength during that fall and the early part of 1885; until, contrary to the expectations of many, who looked upon the demands made and threats indulged in if those demands were not conceded, as mere bravado, culminated in the seizure early in the month of March of the store of Walters & Baker, at Batoche, and that of Wm. Stobart & Son, at Duck Lake, together with the Indian supplies. Even then it was hoped that bloodshed would be avoided by a settlement of the difficulty on a basis satisfactory to all concerned, but Riel's demands were increased, and a settlement on honorable lines placed beyond a possibility. On the outbreak at Batoche Prince Albert people naturally were alarmed, and measures were at once taken to place the town in a position to resist an attack. Major Crozier who was then in command of the detachment of police stationed at that point, cooperated with Capt. Moore, who commanded the volunteers, and a home guard consisting of all the able-bodied citizens of the place was organized under Lt.-Col. Sproat. On the evening of the 27th of March, the battle of Duck Lake took place between the Metis, and the police and volunteers, the result proving disastrous to the loyal forces, who were obliged to retreat, leaving their dead and wounded on the field. These Riel freely gave up at the request of Wm. Drain, who undertook to ask the rebel leader to grant that favour, in order that the dead might be buried and the wounded properly cared for. Carlton was evacuated and accidentally burned the next day. Crozier and the volunteers returning by the north side of the river to Prince Albert. Col. Irvine, with a large detachment of police, arrived the day after the Duck Lake fight, having avoided the French settlements, and approached Prince Albert by way of Carrot River. The place, however, remained in a state of siege, or, more correctly speaking, in a state of defense; the enemy not yet having put in an appearance. Every man was a soldier. St. Paul's church and parsonage were turned into forts, they being brick buildings, and much better adapted for protection than a rotten ballistrade. The dead were buried, as was their due, with military honors in St. Mary's cemetery, and though no monument marks their resting place, their names are written in imperishable letters upon material more lasting than marble.\n\nAs might be expected, the hasty organization of a home-guard where men having had any military experience were scarce, had its amusing as well as its serious aspects. Men figured as adjutants, captains, lieutenants, etc., who scarcely knew the difference between \"mark-time\" and \"form-fours.\" One of those officers, whose duty it was one night to relieve the guard, was overheard, in a tone of authority, giving the somewhat novel words of command—\"Duck-file!\" \"Slant arms!\" \"Turn your faces to the door!\" Other amusing features of the siege might be given, but lack of space will not permit, suffice it to say that every day had its quota until the town was relieved by the arrival of Middleton and his forces, which occurred in the latter part of May. All danger being now past, farmers returned to their homes, all but neglected up to that time, and business commenced to revive. Building operations also com-\nmenced, the present H. B. Co.'s gristmill having been erected. Prince Albert was incorporated on the 22nd of August, and the first council elected on the first of November, the Mayor being Thos. McKay, and the councillors J. F. Betts, R. N. Bratnober, Andrew Goodfellow and G. T. Brown. J. F. A. Stull was appointed clerk, a position he still holds; A. W. R. Markley, assessor, and J. Hanafin, collector. A rifle association was formed, John Stewart being President. The third election of a representative for the District of Lorne in the Northwest Council took place on the 15th of September, O. E. Hughes defeating Dr. Porter. In the fall of the year E. J. Cann, a member of the 90th regiment, who had not only done some fighting during the campaign, but who also had an eye to business, arrived in Prince Albert and commenced a book and stationery store. Two additions were also made to the legal profession by the arrival of A. L. Sifton, from Brandon, and H. W. Newlands, from Winnipeg. About $35,000 in all were spent in new buildings during this year.\n\nDuring 1886 building operations were carried on somewhat extensively. The courthouse and jail, a brick building with a stone foundation, was erected on the brow of the hill at the south end of Church street, at a cost of about $19,000. The Queen's hotel, a large three-story frame building, was erected on the east side of Church, near River street. Richard Gwynne built a fine brick house on the north-west corner of Church and Third streets, now the property of Judge McGuire. The total amount spent in new buildings was not less than $55,000. The first assessment was made this year, showing the value of real and personal property to be $422,405. The total tax levied was $3,612.90. The third annual exhibition of the Lorne Agricultural Society was held on the 30th of September; money, cups and other prizes to the value of over $900 were awarded. A change took place in the pastorate of St. Paul's Presbyterian church, Rev. Mr. McWilliams retiring and being succeeded by Rev. Dr. R. Jardine, M.A., BD., D.S., for some time previous stationed at Brockville, Ont. Court was held by Judge McLeod on the 3rd of November, in Wm. Tait's store, a libel suit against the Times being one of the principal cases on the docket, the jury returning a non-suit. On the 7th of December the Lord Bishop of Saskatchewan died, to the great regret of all classes of the citizens, and on the 14th he was laid to rest in rear of St. Mary's church with every mark of respect befitting a Christian Bishop and a distinguished and enterprising citizen. An impressive funeral sermon was preached on this melancholy occasion by Ven. Archdeacon Geo. McKay, B. D.\n\nTowards the latter part of this year and during the early part of 1887, a new element of discussion was introduced into Northwest life, the several districts having had imposed upon them the responsible duty of electing representatives to the House of Commons. The town of Prince Albert, being the capital of Saskatchewan district, was the first to take steps towards opening the contest. A Liberal Association was formed in the latter part of January, with John Stewart as President, and the Hon.\nDavid Laird, ex-Lieutenant-Governor of the Northwest Territories, nominated. In the early part of January the Conservatives formed an Association, electing Dr. Bain, now Mayor of Prince Albert, as President, and on the 15th of the same month nominated D. H. Macdowall. Mr. Laird arrived at Batoche on the 7th of February, where he opened the fight, and on the following day arrived in Prince Albert. From that time up to the close of the election political matters were freely discussed by the candidates and their supporters, when victory perched on the banner of the Conservative party, Mr. Macdowall being elected by a large majority.\n\nJames Macarthur was elected Mayor of Prince Albert this year, and Thos. J. Agnew, R. N. Bratnobeer, Dr. Bain and John Stewart, councillors. T. H. McGuire, Q.C., of Kingston was appointed Judge of the Supreme Court for the Saskatchewan District; H. E. Ross, sheriff (since succeeded by O. E. Hughes; Choueill de LaGorgendierre, of St. Albert, Alberta, clerk of the Supreme Court; G. D. Northgraves, caretaker of the Courthouse, and H. E. Ross, Assistant Inspector of Weights and Measures, in the room and stead of H. T. McPhillips. Ven. Archdeacon Pinkham, of Winnipeg, was appointed successor of the late Lord Bishop McLean as Bishop of Saskatchewan, and the Rev. J. H. Howard, late of Edmonton, was appointed Methodist missionary at Prince Albert. A change also took place in the pastorate of St. Anne's (R. C.) church, Rev. Pere Dommeau succeeding Rev. Pere Andre, now of Calgary.\n\nNew police barracks were commenced early in the spring of this year under the supervision of H. J. Peters, an experienced architect sent out by the Government. The work was done by day's labour, all the best mechanics of the town and district having been employed. It consists of a barrack building, 159x28, with wing 87x28; two officers' quarters, 35x24; three extension kitchens, 20x21; one guard room, 43x24; one Quarter Master's store, 60x30; one general store; two stables 75x30; two wings to stables 12x30; one blacksmith shop 24x24; one sergeant's mess 50x26; one extension kitchen 16x28; one sick stable 50x28; one artizan's workshop, 24x28, and five latrines. The best material obtainable was used, and the workmanship throughout has been of a character which reflects credit upon all concerned. The barracks will accommodate 3 officers, 85 non-commissioned officers and men, and 64 horses. It is located on the brow of the hill about a mile south-west of, and overlooking, the town. A more commanding position could not have been selected. Besides the barracks a number of other buildings were erected, among them a fine residence near St. Mary's church by the widow of the late Lord Bishop McLean. An hotel was built by David Pollock on King street, and a store by John Stewart, now occupied by S. McLeod & Co., on the corner of River and King streets. Sergeants Parker and Keenan also erected residences on the hill to the east of the barracks.\n\nThe most convincing evidence of the progress of a town, however, is the development of its educational institutions. In the early days, and up to the formation of Public School Sections Nos. 3 and 10, the children of the town were taught in schools supported by private\nsubscription, and, as a consequence, were not able to make as rapid advancement as they would in schools properly organized and equipped. Since the establishment of public schools, within the past four years, there has been a marked improvement. Not only have the children made rapid advancement, but last year the \"old log school houses,\" so to speak, were superceded by large and commodious brick structures, supplied with all modern appliances. The total outlay in connection with the erection and fitting up of the school in the central portion of the town was $6,200, that of the east end about $3,500. A high school has also been conducted for a number of years in the old log church originally built by Rev. Mr. Nesbit, which stands on King street, by the Presbyterian Mission authorities. This, however, will shortly be merged into the proposed Nesbit Institute, which is to be erected this year on the west side of Church street and immediately north of the Courthouse. The Rev. Mothers of St. Anne's convent have also done their part in the cause of education since their advent, and it is to the credit of the citizens of Prince Albert that they have not allowed religious considerations to prevent their children from enjoying the benefits of a training in that excellent institution. Early last year the Rev. Mothers removed from the Roman Catholic Mission buildings, on River street, to the premises recently purchased by them from Hon. L. Clarke. A Roman Catholic Public School District was organized last year, and a school opened in the building recently occupied by the Rev. Mothers.\n\nThe credit of founding the first educational institution of more than ordinary importance in the Saskatchewan District, if not the Northwest Territories, belongs to the late Lord Bishop McLean, Emmanuel College having been erected by him in 1879. It is a large, square two-storey frame building, and is situated at the foot of the hill to the south of St. Mary's church. Since its establishment regular professors have been employed and a number of native and other missionaries educated. It has done, and is doing good work. Every year more or less improvement has been made to the Collège; in order to keep up to the requirements of the times.\n\nAltogether, the year 1887 may justly be considered to have been the most prosperous in the career of Prince Albert. Over $100,000 were expended in new buildings, including the Barracks, and but for the fact that all the mechanics of the place, or the great majority of them, were employed by the Government architect, and all the seasoned lumber had been secured by the same official, a much larger number of buildings would have been erected. The assessed value of real and personal property for 1888 will be close on $600,000. The taxable income for 1887 was $12,000.\n\nAn important event which should have been mentioned in the preceding page, was the fourth annual exhibition of the Lorne Agricultural Society, which took place on the 29th of September. Owing to the fact that the farmers were still busy in the harvest fields, the somewhat too abundant rains having protracted the period of growth beyond the usual\nterm, the exhibit of cereals was not only small, but did not do justice to the settlement. Had the exhibition been held ten days later a display of cereals would have been made which would have been equal in quality to any made at similar exhibitions in the east. The display of roots and vegetables, as usual, was all that could be desired. The exhibit of cattle, horses, sheep, swine and poultry was also good. In fact no one who knows anything about the Saskatchewan country doubts its fitness for general farming, particularly stock raising. It is the true ranching country. Over $1,100 worth in cups, cash and other prizes, were awarded to successful exhibitors.\n\nSuch, then, is a brief and somewhat imperfect sketch of the rise and progress of Prince Albert. If it has not been as rapid as that of towns along the Canadian Pacific, still, when we take into consideration, the isolated position of the place, and the consequent disadvantages under which the settlers have laboured, its record is one of which there is no reason to be ashamed, on the contrary, every reason to be proud. Its merchants are among the most substantial in the Northwest, its educational institutions of the highest order, its churches well supported, and almost every profession, trade and industry, is represented. Prince Albert is no bloated offspring of boom speculations, but the healthy creation of the industry of its builders. That its future will be characterized by the same energy on the part of the citizens there can be no doubt. The development of the agricultural industries of the country, however, have been so great within the last few years that railway communication must be secured without delay, in order to afford an outlet for the surplus products of the Saskatchewan country, and in order to secure that share of immigration to which the Saskatchewan country is entitled. It is true there have been steamboats on the North Saskatchewan for a number of years, but as they do not commence to run until navigation opens on Lake Winnipeg, which is much later than on the Saskatchewan, and their arrival at Prince Albert is more or less a matter of uncertainty, merchants do not care to bring their goods by way of Grand Rapids, preferring to trust to the overland route from Qu'Appelle. The ox may be slow, but he is sure.\n\nSome Old and New Settlers.\n\nThough, properly speaking, not the oldest resident of Prince Albert, the HON. L. CRARKE,\n\nChief Factor of the H.B.C., has been so intimately connected with the progress of the settlement, both as a resident of Fort Carlton and since he became one of our citizens, that he is entitled to be considered as one of the oldest, if not the oldest, citizen. He is a native of the county of Cork, Ireland. Early in his life he went to the West Indies, where he remained a short time. He then entered the service of the Hudson's Bay Company, and, previous to his arrival at Fort Carlton, spent a number of years in the Peace River and Athabasca districts. On March\nNo. 2.—St. Anne's Convent, formerly the residence of Hon. L. Clarke, Chief Factor of the H. B. Co.\n\nThe above building is situated on Third street, immediately west of the residence of Thos. McKay and to the left, or south, of the cluster of buildings shown in No. 3. This view is taken from the north-east. About half a mile farther south-west, on the brow of the hill, is situated the new Police Barracks. The gentleman with the staff, followed by his faithful Tousser, is our artist.\nT. E. JACKSON,\nChemist and Druggist!\nRIVER STREET,\nPrince Albert, Sask.\n\nA Large Stack of Drugs, Patent Medicines, Fancy Goods, etc., always in Stock.\n\nPRESCRIPTIONS CAREFULLY COMPOUNDED.\n\nMACDOUGALL'S BAKERY,\nRIVER STREET,\nPRINCE ALBERT, SASK.\n\nThe Best of Bread & Cakes\n\nAND\n\nA Choice Stock of Confectionery Always on Hand.\n\nH. MACDOUGALL, Proprietor.\n25th, 1881, he was elected representative for Lorne District in the Northwest Council, and to him belongs the honour of being the first popular representative to take his seat at the Council board. Since his removal to Prince Albert he has taken a lively interest in all movements having for their object the public good. He has always given liberally and ungrudgingly of his means in the interests of charity or any other good cause. Mr. Clarke is, in the truest sense of the word, a self-made man. Possessed of natural talents far above the average, he worked himself up from a servant of the H. B. Co. to the position of Chief Factor. He is gifted to a large extent with the eloquence so characteristic of his countrymen, and had he had the good fortune to receive a collegiate education might have won a name for himself in another sphere than in that of the very honorable service of the Hudson's Bay Company. Some years ago he built a fine residence (see engraving), which he lately sold to the Rev. Mothers of St. Anne's Convent, removing to the east end. He has been twice married, and has a large family. His present wife is a sister of Thos. and Jas. McKay, Prince Albert. One of his daughters married the late Sedley Blanchard, Barrister, of Winnipeg. Another married Dr. Bain, Mayor of Prince Albert, and a third Mr. Frank Wilson, who is in the H. B. Co.'s service at Edmonton. On the formation of the Board of Trade he was elected President. Mr. Clarke is on the upper side of fifty, and though he has experienced all the hardships common to the service in the northern country, is still good for many years of useful life.\n\nCHARLES MAIR, SR.\n\nThe author of the drama \"Tecumseh\" needs no introduction to the people of Canada, much less to the people of Prince Albert. His career, however, is intimately connected with the early history of Manitoba and the Northwest, and so full of incidents more realistic than \"haggard,\" that more than the usual limit of space will be devoted to a sketch of him. He is a native of eastern Ontario, and was born in the village of Bathurst, Lanark County, on the 21st of September, 1840. He was educated in the Bathurst Grammar School and Queen's College, Kingston. His father was a native of the \"Land o' Cakes,\" otherwise known as Scotland, and came to Canada about the year 1828, settling in Ottawa county, where he for many years carried on the square timber business. The subject of this sketch first commenced the study of medicine, but having early in his life displayed a taste for literature and by that means made himself known to the public men of Canada, he was induced by the Hon. Wm. McDougall to make researches in the Parliamentary library, Ottawa, in connection with the question then pending of the transfer of the Northwest Territories to the Government of Canada. From that time he gave up the idea of becoming a physician and making pills and such like. In 1868, when the Government sent out a party of men to open up a road between Lake Superior and the Lake of the Woods, he was appointed paymaster, and the fall of 1869 found him, as\nwell as others, unwillingly enjoying the hospitality of Louis Riel in Fort Garry. Having taken exception to Mr. Riel's bill of fare, and even questioning the right of \"mine host\" to retain him against his will, Mr. Mair was threatened with the guillotine. Not liking the idea of being sacrificed so early in his career, he managed, by the aid of his fellow-guests, to make his escape. Once free, he proceeded to Portage la Prairie, and, under Major Boulton, organized a party, who returned to Fort Garry and compelled Riel to deliver up the prisoners. By treachery, however, Major Boulton, Thos. Scott and others were taken prisoners and Scott put to death. Mr. Mair not wishing to again fall into the hands of the rebels, in company with Sheriff Setter, of Portage la Prairie, started on snow shoes for St. Paul. Their journey to that point was accomplished in thirty days, and was made under great difficulties. Their provisions ran short, and their tobacco, scarcely less necessary to habitual smokers, became exhausted. For four days they were compelled to live on about two ounces of flour per day, and oak bark as a substitute for the \"weed.\" In a famished condition they arrived in St. Paul, where they met Dr. Schultz and Dr. Lynch, and accompanied them to Canada. After the restoration of order Mr. Mair again returned to Fort Garry and endeavored to obtain some manuscripts he had taken with him on his first visit, and which had been seized by the rebels. He was unsuccessful, however, though he offered a large reward, and becoming discouraged at loosing the fruits of so many years of literary labour, he settled down in Portage la Prairie, and took to the fur trade. He remained there until 1876, when he removed to Prince Albert, and established himself as a general trader. From that time until the summer of 1883 he continued in business, building a store and a large dwelling house. In the latter year, foreseeing trouble in the near future, he removed with his family to Windsor, Ont., where he employed his time up to the breaking out of the rebellion at the South Branch in writing the drama \"Tecumseh,\" a literary production which at once placed him in the front rank of Canadian writers. During the second rebellion he acted as Quartermaster for the Governor-General's Foot Guards. In the following year he returned to Prince Albert and embarked again in the general trading business, which he still carries on. Besides the drama \"Tecumseh,\" Mr. Mair has contributed a number of articles to Canadian magazines and published a volume entitled \"Dreamland and Other Poems.\" As he is scarcely fifty years of age, it is to be hoped that he will not \"forget his rhythm and rhyme,\" but that he will still add to his laurels in the noble field of literature. Mr. Mair is postmaster and Vice-President of the Board of Trade, Prince Albert. His wife is a niece of Hon. Dr. Schultz.\n\nBETTS & GWYNNE.\n\nNothing serves better to illustrate the increase of a settlement in wealth and importance than the success of those who are engaged in the mercantile business, more particularly those of that class who commenced with next to no capital, and have, in less than a decade of years, become\ncomparatively wealthy. Of this class are the gentlemen whose names head this paragraph. They arrived in Prince Albert in 1879 with $505 worth of goods, and one fine evening in the month of September in that year, the senior member of the firm might have been seen leading an ox, to which was tethered a cart containing all their available goods, down the hill approaching the Mission. Their first place of business was a log kitchen 12x14, belonging to John A. McDonald. After the lapse of a few months they were forced to rent the brick premises then recently built by Hurd & Baker on the George McKay estate. Business continuing to increase they were compelled to build for themselves on the Mission property. To these premises they have been constantly adding until they now measure, 22x85. In the early days of their business career one of the members of the firm made trips to Winnipeg for goods. Of late years, however, they have employed freighters. The firm have only handled Dry Goods, Groceries and Clothing. Mr. Betts has always taken an active part in public affairs, and was a member of the first council and Acting-Mayor during the greater part of their term, 1886. He was appointed, in company with Mr. Macdowall, the same year to proceed to Ottawa and interview the Government concerning the location of the police barracks, and had the pleasure, along with others, of meeting a highway robber on his return from Qu'Appelle and placing \"hands-up\" at the request of that individual. Mr. Betts was a candidate for the Mayoralty in 1887; but was defeated by a small majority. He is member of the School Board for District No. 3 for the present year. Both members of the firm are married. Mr. Betts occupies a fine brick house on Second street, erected by him in 1885. Mr. Gwynne built a fine brick house in 1886, on the corner of Church and Third streets, which he sold last year to Judge McGuire. Mr. Betts is native of Kingston, and Mr. Gwynne of Gananoque, Ont.\n\nT. J. AGNEW.\n\nAmong the pioneer merchants of Prince Albert who have by perseverance, ability and honorable dealing worked up a large and paying business, stands the above gentleman. He came to Prince Albert in 1879, with A. L. Ashdown as his partner, and opened in the general store on the Porter estate. In 1882 they dissolved partnership, Mr. Agnew going into the hardware business in premises erected for him by the late James Treston on River street, and Mr. Ashdown going to St. Albert with Henry McKenny.—Besides doing a general hardware business, Mr. Agnew carries on the manufacture of tin and sheetiron ware. He was a member of the town council during 1887, and was re-elected for the present year. He is married, is a native of the island of Guernsey, and resides in the west end.\n\nTHOMAS SWANSTON.\n\nThis gentleman, to whom reference should have been made elsewhere, is a retired H. B. Co. officer, and one of the oldest settlers of the Prince Albert district. Previous to settling in Prince Albert he spent a number of years in the far north. He is an Englishman, and the possessor of\na large fortune, of which he has always given liberally for any good purpose. His residence is in the west end, close by St. Mary's church. The grounds surrounding it are tastefully laid out, and its general appearance is suggestive of comfort. Mr. Swanston is a married man and has two children. He is a man of a retired disposition, and takes a great delight in hunting.\n\nHURD & BAKER.\n\nThe history of this firm's connection with Prince Albert commences over ten years ago, Mr. Hurd having arrived in 1876, and his partner a short time subsequently. They erected the first brick building west of Winnipeg, that now occupied by Blain Goodfellow, on the George McKay estate. They also erected a number of buildings for John A. McDonald, among them his residence, Cameron's cottage, and the stores occupied by Walters & Baker, R. C. Wigmore & Co., and a many other buildings. They are also owners of river lot 77, in the centre of the town. Both gentlemen are married. Mr. Hurd owns a fine house on the hill immediately west of the Courthouse and Mr. Baker resides on Selkirk street.\n\nT. N. CAMPBELL.\n\nThis gentleman is a son of James Campbell, publisher, of Toronto, and came to Prince Albert in 1873, starting in the books and stationery business in the old log house on the south-east corner of River and McKay streets. He subsequently removed to the brick premises now occupied by Blain Goodfellow, and from thence to the store now occupied by Russell & Davis, and belonging to G. T. Brown. He then built a store on the Hurd & Baker estate, to which he removed and where he has carried on business ever since. Mr. C. owns considerable property in Prince Albert. He is a young man, unmarried, and, like others in town, often sings with a touch of melancholy—\n\n\"Unwed, unloved, and uncaressed,\nA sad life is a bachelor's best.\"\n\nGOODFELLOW BROS.\n\nAndrew, Robert T. and Blain Goodfellow are natives of Peterboro, Ont., and came to Prince Albert in 1879. They are all carpenters, and on arriving here commenced contracting. In 1880 they built a sash and door factory in the vicinity of the H. B. Co.'s mill, and during that year the two mills were run by one engine. In 1881 they built the present large mill on McKay street, at a cost of $7,000. Besides making doors and sashes they do turning, planing and make all kinds of mouldings. Blain Goodfellow also carries on the furniture business, and R. T. Goodfellow a grocery and confectionery business. Andrew Goodfellow was a member of the first town council, and all are enterprising and respected citizens.\n\nJ. M. CAMPBELL.\n\nThere are few merchants in the Northwest who do a larger trade than this gentleman, while, at the same time there are few who have struggled harder to gain the mercantile prestige he enjoys. During 1874 and 1875\nMr. Campbell bought goods in Winnipeg and sold them in the west. He then took up a farm near the capital of Manitoba, which he continued to cultivate until 1880, when he sold out, bought a stock of goods and again started for the west; ultimately settling down in Prince Albert. He first did business in a tent near where St. Anne's convent stands, afterwards removing to the premises he now occupies. Since 1881 he has gradually increased his business and built a block of three stores (two of which he now occupies), a storehouse, three houses on Third street, two on Selkirk, and a warehouse on McKay street, together with his fine brick residence on the corner of McKay and Selkirk streets. He has also a large farm about twenty miles east of Kinistino, Carrot River. This he has stocked with 75 head of cattle, including a thoroughbred bull, and 150 sheep. The farm is on the proposed line of the M. & N. W. Railway. He is chairman of the School Board for District No. 3, and comes from Goderich, Ont.\n\nJ. R. MCPHAIL.\n\nMr. McPhail came to Prince Albert in 1879 and commenced business in premises rented from John A. McDonald. He subsequently removed to log premises east of the H. B. Co.'s store, and immediately opposite the large store recently erected by himself. He carries a very large stock of hardware, tinware, groceries and clothing. He also manufactures tinware. He has always taken a deep interest in public matters, and is a member of the School Board for Section No. 3, and also a member of the Town Council. He comes from eastern Ontario.\n\nTHOMAS O. DAVIS.\n\nThis gentleman, as may be gathered from his name, is a lineal descendent of one of the ancient Irish kings, and is not without a large share of that love for the Emerald Isle that inspired the illustrious bard of his name. He is a native of Quebec, and came to Prince Albert in 1880. He first turned his attention to carpentering, then he bought out a freighting outfit and freighted for a year between Prince Albert and Winnipeg, when he sold out and went into the knick-knack trade in the same log building in which T. N. Campbell commenced business. Selling toys, however, was too slow a trade for Mr. Davis, and he commenced to deal in larger wares. His business always increasing he was forced many times to seek larger quarters, until he hung out his shingle at his present large premises. He carries a stock of from $10,000 to $15,000 worth of goods and carries many lines not kept in other stores. He is also largely interested in real estate, owning a number of stores and houses. He also has a farm at Island Lake upon which he already has about fifty head of cattle, together with a number of horses and sheep.\n\nTHOMAS E. JACKSON.\n\nTo this gentleman belongs the honour of having started the first drug store west of Winnipeg. He is a native of the county of Peel, Ontario, served his time in Toronto, and subsequently graduated from the Ontario College of Pharmacy. He first did business in Selkirk, Man. In 1880\nhe removed to Prince Albert, where, by close attention to business he has succeeded in working up a large trade. He is a good dispenser and careful and skilful in the compounding of drugs and medicines, his name being a sufficient guarantee that the bottle contains what the doctor ordered. He is unmarried.\n\nR. X. BRATNOBER.\n\nLike other industries in the Saskatchewan country, the manufacture of harness and saddles has rapidly increased. Mr. Bratnober is the pioneer of his business in Prince Albert district, having established himself in the east end in 1882. In the same year he built a store and residence immediately west of the H. B. Co.'s post. He continued to carry on business in the east end until last December, when he removed his building to the east side of Church street. Mr. Bratnober is a Prussian, and, like the most of his countrymen, a good business man. He has always taken a deep interest in municipal matters, and was a member of the town council up to this year. He was also a member of the School Board for District No. 3 up to this year.\n\nLT.-COL. SPROAT.\n\nThere are few men in Prince Albert who are so deservedly popular among all classes of citizens as the gentleman who fills the very honourable position of Registrar for the District of Prince Albert, and who, by virtue of merit and long service as one of Her Majesty's volunteers, writes \"Lt.-Col.\" before his name. He has been in Prince Albert since 1880, and consequently, is entitled to be considered one of the pioneers of the town. He is a native of Ontario, and for some years represented South Bruce in the House of Commons. He was also registrar for the same county for some time previous to coming to the Northwest. Since his advent here he has taken a prominent part in every movement for the advancement of the interests of the place, and has always given liberally of his means in aid of every good cause without respect to religion or nationality. During the rebellion of the spring of 1885 he took a prominent part in perfecting the defenses of Prince Albert. He owns considerable property in the town and district together with the house he resides in on River street. He is by profession a Surveyor.\n\nOWEN E. HUGHES.\n\nNo one is better known in the Saskatchewan District than this gentleman. He is a native of Wales, and is about forty years of age. He came to the Northwest about fifteen years ago, and up to 1885, was engaged in the business of a general trader. In the spring of that year he was elected member of the Northwest Council for the District of Lorne, and at the expiration of his term, in common with the other members, took his seat again during the last session by virtue of an Act passed at the last session of the Dominion Parliament. He was appointed Sheriff of Saskatchewan in the spring of 1887, a position which his wide acquaintance with the people of the district, and his knowledge of the English, French and native languages eminently qualifies him. He\nowns a large extent of valuable real estate within the corporation, together with the large frame building on the corner of Mackenzie avenue and First street, at one time known as the Saskatchewan Club, and now occupied as the Council chamber. He is a married man and has a small family.\n\nJ. L. JOHNSTON.\n\nSince his advent in 1882 this gentleman has been one of the most prominent merchants of the town. He has carried on a general hardware and grocery business, which is increasing so rapidly that his present large premises are becoming too small. Besides being a good businessman Mr. Johnston takes a deep interest in public matters and sports, particularly the \"Roarin' Game.\" He is President of the Rifle Association, and a member of the Town Council for 1888. He comes from Ontario, and at one time lived in Seaforth. He is a young man and is married.\n\nJOHN A. MCDONALD.\n\nThere was not much to be seen in a civilized way around the Prince Albert Mission, when this gentleman arrived about twenty years ago, from Kildonan, Manitoba, and located on the property he now owns, river lots 81 and 82. For some years he farmed extensively, but of late years he has carried on the business of a wholesale and retail butcher. He was chairman of the Board of School Trustees for District No. 3 during 1886. Some years ago he erected a large private residence close by the river, where he resides. His property is favourably located and cannot fail to become very valuable in the near future. Mr. McDonald is a married man and has a large family.\n\nJOHN STEWART.\n\nThis gentleman, who is now the only representative of the firm of Stewart Bros., originally Stewart & Wootton, who established business in Prince Albert in 1882, is a native of Scotland, but has spent the most of his life in Canada. He entered into partnership with his brother William on the retirement of Mr. Wootton in 1884, and a short time previous to the death of the former. He is one of the most public-spirited of citizens, and has been elected a member of the Town Council for two terms. He was also a member of the School Board for District No. 3 during 1886. Besides doing a large business, he has a farm at Island Lake and a large band of grade cattle; also a thoroughbred bull and cow. He is a Liberal in politics, and was the first President of the Liberal Association.\n\nWM. STOBART & SON.\n\nThis firm occupies one of the oldest landmarks in the town, erected many years ago by Samuel Mackenzie, a retired H. B. Co. officer. They first commenced business at Duck Lake, in 1874, under the name of Kew, Stobart & Co., and were the first permanent traders in that district. In 1882 they opened a branch store in Prince Albert, and ultimately made this place the headquarters of their extensive Northwest trade,\nwhich ranks second only to that of the H. B. Co. in the extent of its ramifications throughout the northern districts. Their local trade is also large and constantly increasing. W. H. Mitchell is the manager of the Northwest business of the firm, and R. Oullette the chief clerk at this point.\n\nJUDGE MCGUIRE.\n\nThough only a recent arrival, Judge McGuire has not less by virtue of his many good qualities than by reason of the exalted position he occupies, won the esteem of all classes of citizens. He is a native of Kingston, Ont., where he practised his profession until April 23rd, 1887, when he was appointed Judge of the Supreme Court for the District of Saskatchewan. Shortly after his arrival he purchased the fine brick residence erected by Mr. Gwynne in 1886 on the corner of Church and Third streets. He is a married man, and has a small family. His Honor's great modesty is the apology for this brief notice.\n\nD. H. MACDOWALL.\n\nThe member for the District of Saskatchewan is a native of Ayrshire, Scotland, and was born about the year 1850. He has been identified with the interests of Prince Albert since 1881, when he entered into partnership with Capt. Moore in the lumbering business. In 1882 he was elected to the Northwest Council, defeating Dr. Porter, and on the 15th of March, 1887, he was elected to the House of Commons for the Saskatchewan District, defeating the Hon. David Laird. Mr. Macdowall, besides being a young man, is possessed of means and ability, and cannot fail to make his mark in public life. He has always given freely of his means in aid of any deserving cause, and by his courtesy to political opponents won their esteem, if not their support.\n\nCAPT. MOORE.\n\nThough absent since the year of the rebellion, owing to the serious wound he received at Duck Lake, Capt. Moore is still regarded as a citizen of Prince Albert. And justly so. No one has done more for the advancement of the settlement, and no man was more popular. His connection with the settlement dates back to 1874. He is the pioneer of the milling interests of the place, and was commander of the volunteers at Duck Lake. He is now at his old home in the county of Antrim, Ireland, whither he returned to recuperate after the wound he received. He is a married man and is about 37 years of age.\n\nDR. BAIN.\n\nThe present Mayor of Prince Albert, Dr. Hugh U. Bain, is native of eastern Ontario, and came to Prince Albert in 1881. He is a brother of Judge Bain; of Winnipeg, and a son-in-law of Hon. L. Clarke, Chief Factor of the H. B. Co. at this place. He was a member of the Town Council during 1887, and was elected Mayor for 1888 at the last election. He is also President of the Liberal Conservative Association. He resides in a fine house on the south-east corner of Church and First streets.\nMoore & Macdowall Lumbering Co. Ltd.,\n\nManufacturers of\n\nMatched, Dressed & Undressed Lumber.\n\nContracts for Buildings\n\nEntered into at Lowest Rates.\n\nMill at the East End,\n\nPrince Albert, Sask.\n\nMoore & Macdowall Lumbering Co'y,\n\n(Limited.)\nQUEEN'S HOTEL,\n\nCHURCH STREET,\n\nPRINCE ALBERT, SASK.\n\nThe Largest & Most Comfortable Hotel\n\nIn Prince Albert District.\n\nBoard by Day or Week.\n\nTravelling Public Receive the Best Attention.\n\nTHE BAR IS SUPPLIED WITH\n\nFinest Brands of Cigars, Beer, Cider\n\nAnd Blackwood Bros.' Famous Soft Drinks.\n\nT. ORAM, Prop.\nDR. PORTER.\n\nThis gentleman is the pioneer medical practitioner west of Winnipeg; and arrived in Prince Albert in 1878. So much reference has been made to him elsewhere, that it is only necessary to add that he is a native of Cumberland county, Nova Scotia, and that he has been over the greater part of the Northwest territories. He has a large practice, is a married man, and is a Liberal in politics.\n\nWALTERS & BAKER.\n\nThis firm first commenced business on the west side of the river at Batoche, in September, 1882, and in November of the same year opened a branch store in Prince Albert, in the building now occupied by them. They continued to carry on business in both places until the spring of the rebellion, when the rebels executed a flank movement and captured their Batoche premises. They also took Mr. Walters and J. D. Hannafin in charge and deposited them in a cellar for safe keeping. This put an end to their business at that point, at least as far as a permanent trading post was concerned. Their business in Prince Albert has always been a large one, and is increasing every year. Mr. Walters formerly carried on the China Hall, Brockville, Ont. Mr. Baker is from Belleville, in the same Province, and is a bachelor.\n\nMACARTHUR & KNOWLES.\n\nThe financial institution established by these gentlemen in 1882 supplied a long felt want in the settlement. They occupy the old Presbyterian Mission building, situated on the south-west corner of River and Church streets. By pursuing a liberal policy towards business men and others they have succeeded in working up a large general banking and financial business. Some idea of the business of the district may be formed from the fact that over one million dollars passed through their hands last year. James Macarthur is a brother of Duncan Macarthur, President of the Commercial Bank, Winnipeg, and a native of Nairnshire, Scotland. He was Mayor of Prince Albert during 1887. Joseph Knowles is a native of Toronto and was employed in the Merchants' Bank, Winnipeg, previous to coming to Prince Albert. Both gentlemen are married and are much respected by all classes.\n\nDONALDSON & PEMBRIDGE.\n\nThe proprietors of the Grand Union Livery Stable are the right men in the right place. They are both old settlers, know everybody, and try to meet the wishes of their customers. They keep the best of horses and conveyances. Their stable is next door to the Queen's Hotel. They are both ex-members of the Northwest Mounted Police.\n\nSAMUEL MCLEOD.\n\nThe manufacture of boots and shoes in Prince Albert, formerly in the hands of Shannon & McLeod, as a firm, is now divided between those gentleman as independent prosecutors of that trade, the above gentleman having recently established himself on the corner of River and King streets. Being a good business man and well known he should not fail to succeed.\nCHESTER THOMPSON.\n\nFor enterprise this gentleman has few equals. He arrived in 1879, and first took to carpentering, then to the manufacture of brick and lumber. He also has a portable machine for sawing wood, a threshing machine and a grain crusher. But not only is he an enterprising and successful business man, but he has always taken a deep interest in school matters in the east end, being a member of the School Board for District No. 10 for a number of years. He also brought in the first cab.\n\nG. D. NORTHGRAVES.\n\nThe above gentleman is a watchmaker and jeweller, and comes from Eastern Ontario. He has been here since 1882, though he has been as far west as Edmonton. Last year he was appointed caretaker of the Courthouse and jail. He is a married man, and is much respected.\n\nWALTER R. FISH.\n\nAmong the citizens of Prince Albert who have risen from a clerkship to the proprietorship of a flourishing business stands this gentleman. He is a son of the late W. B. Fish, of Winnipeg, and a native of Montreal. He came to Prince Albert in 1889, and for some time was engaged as a clerk for J. O. Davis & Co. He then commenced business for himself in the premises now occupied by John A. McDonald, wholesale butcher. Last year he removed to larger premises just west of the banking house of Macarthur & Knowles. Mr. Fish is a young man and unmarried.\n\nHUGH MCDougall.\n\nThis gentleman came to Prince Albert in 1882, and observing that the people were growing tired of bacon and hard-tack, commenced the bakery business. His first shop was in the east end, where he carried on business until 1886, when he purchased and fitted up his present premises, immediately east of J. M. Campbell's store. He does a large trade, working up about one thousand bags of flour, principally native, a year.\n\nA. H. CLARK.\n\nThe subject of this brief paragraph came to Prince Albert in 1884 and opened a drug store in the premises he now occupies. He is a graduate of the Ontario College of Pharmacy, and previous to coming west had considerable experience in his business in Toronto, Montreal, Winnipeg, and other places. By his straightforward dealing and gentlemanly bearing towards customers he has gained the confidence of everyone, and does a large and paying business. From the organization of the Lorne District Agricultural Society, in 1884, up to last fall he filled the position of Secretary-Treasurer, and to him more than any other member of the Society is due the success which has attended the annual exhibitions. Mr. Clark is a young man, and a bachelor.\n\nMCINTOSH & GERROND.\n\nThe manufacture of hop beer in the Territories has become quite an industry of late, and the above firm are perhaps the largest manufacturers in the Saskatchewan country. Their brewery is on Third street, near the corner of McKay. Both are good men and their beer is not only pure and refreshing, but non-intoxicating.\nR. B. WAY.\n\nThis gentleman arrived in Prince Albert from Trenton Ont., in 1880, and commenced the business of watchmaker in premises rented from Charles Mair. Subsequently he was appointed deputy-postmaster, a position he has held ever since, and the duties connected with which he has performed with credit to the Department and to himself. Mr. W. is a good mechanic, and a trustworthy man. He is married, and so eager is he to get other men in the same fix, that he sells marriage licenses.\n\nRICHARD C. WIGMORE.\n\nAn apology is due this gentleman for not having mentioned in the sketch of the town that he arrived in 1884 in company with Mr. McTaggart and family. He is a native of London, Ont., and is the resident member of the firm of R. C. Wigmore & Co., dealers in Dry Goods, Groceries, Clothing, etc. Since establishing business Mr. Wigmore has, by strict attention, established a large trade. He is a young man, and a bachelor.\n\nWM SHANNON.\n\nIn 1882 this gentleman established business in Prince Albert in company with Samuel McLeod, the name of the firm being Shannon & McLeod. They continued to carry on business together until last fall, when the partnership was dissolved, Mr. McLeod commencing business for himself, and Mr. Shannon remaining in the old stand. Mr. S. carries a large stock of Boots, Shoes, etc., and also manufactures, being himself a good workman. He is married.\n\nEDWARD J. CANN.\n\nWhen the rebellion broke out in 1885 this gentleman was a member of the 90th regiment, and went forth to victory with the rest of his comrades, passing through Prince Albert on his way to Fort Pitt. Being a shrewd business man and on the look-out for a good place to establish a book and stationery business, he picked on Prince Albert. Since his arrival in the fall of 1885 he has been very successful. He keeps a large stock of everything in his line. He is a native of Hamilton, Ont., and served his apprenticeship to his business with Parsons & Ferguson, Winnipeg.\n\nNEILSON & MCBEATH.\n\nThese gentlemen are the proprietors of the Victoria Livery Stable. Both are old citizens, particularly Mr. McBeath. Graham Neilson is a carriage maker, and carries on that business as well as the livery. Their livery outfit is quite equal to that of the other livery stables; and they spare no pains to give satisfaction to customers.\n\nROBERTSON & ROBERTSON.\n\nThis firm are the successors of James Sinclair in the tailoring business, and recent arrivals. They carry on the business in the premises formerly occupied by the latter gentleman on the corner of Church and Nesbit streets. They manufacture all kinds of clothing, making a specialty of wedding suits.\nWOODMAN BROS.\n\nThese gentlemen carry on a livery stable and a hop beer brewery in the east end, and a billiard saloon on River street. Chas. Woodman was assessor for 1886, and collector last year, and is a trustworthy citizen.\n\nG. T. BROWN.\n\nMr. B. is one of the oldest of our citizens and was a member of the Town Council during 1886. He is a native of Ontario, is a bricklayer, and has built most of the brick houses in this place, in company with H. Peard. He owns considerable property here, is a bachelor and a Liberal.\n\nTHE CLERGY.\n\nThe clergy of Prince Albert, past and present, are too important a factor to be forgotten. Among those who successively occupied the position of Presbyterian missionary after Rev. James Nesbit were Revds. Johnstone, Duncan, Seivwright, McWilliams and Campbell. Dr. Jardine, MA., B.D., D.S., is the present worthy incumbent of St. Paul's and Rev. Alexander Campbell, missionary.\n\nSt. Mary's and St. Alban's (English) incumbencies are respectively occupied by Ven. Archdeacons J. A. Mackay, D.D., and George McKay, B.D. Revds. Canon Flett and A. H. Wright have charge of outside missions. The Prince Albert District missions were founded by the late Lord Bishop McLean.\n\nSt. Anne's (R.C.) was founded by Rev. Pere Andre, O.M.I., now of Calgary. The present missionary is Rev. Pere Dommeau, O.M.I.\n\nThe present Methodist missionary is Rev. J. H. Howard.\n\nTHE BAR.\n\nThe first lawyer to arrive here was W. V. Macrise, Crown Prosecutor, who arrived in 1881. After him arrived the late Fitzgerald Cochrane, George Watson, now of Edmonton; Skeff Elliott and Napier, killed at Duck Lake; W. R. Gunn, M.A.; W. McGillivray; since left; S. Brewster, W. H. Newlands, A. L. Sifton, B.A., LL.B., and James McKay, now of Brewster & McKay. The well known modesty of the legal profession and want of space prevents a more extended notice of these gentlemen.\n\nAmong others who deserve more than a passing notice, but lack of space prevents, are Isaiah McColl, blacksmith, one of our oldest and best citizens; Carter & Cockrill, Garvin & Holmes, C. Hamilton and William Knox, carpenters and contractors; Joseph Oram, the genial proprietor of the Queen's Hotel; D. Pollock, proprietor of the Central Hotel; J. D. Maveety, editor and proprietor of the Times (noticed elsewhere); R. Buckley, auctioneer; John McTaggart and Louis Schmidt, of the Dominion Lands office; G. S. Davidson and J. R. Hart of the H. B. Co.; W. Lourden, manager of the Moore & Macdonald Lumbering Co. (Limited); Douglas Peterson, Joseph Coombes, J. L. Hannafin, Deputy-Sheriff; H. E. Ross, Assistant Inspector of Weights and Measures; C. de Lagorgendierre, Clerk of the Supreme Court; James Sanderson, millowner, and one of the old-timers; Russell & Davis, wholesale butchers; and last, but not least, Mr. Thomas McKay, our first Mayor and one of our first citizens; who insisted on being left unmentioned, but who cannot be forgotten.\nEmmanuel College\n\nESTABLISHED 1879 BY\nThe First Bishop of Saskatchewan.\n\nVISITOR AND PRESIDENT OF COUNCIL,\nTHE BISHOP OF SASKATCHEWAN.\n\nWARDEN AND DIVINITY PROFESSOR,\nVEN. ARCHDEACON J. A. MACKAY, D.D.\n\nASSISTANT PROFESSOR,\nREV. CANON FLETT, B.D.\n\nThe College was founded to train and fit natives of the country for work as Interpreters, School Masters, Catechists and Pastors.\n\nA Boarding and Day School\n\nIs carried on in connection with the college, where the ordinary branches of an English and Classical Education are taught.\n\nFor full particulars as to terms, etc., apply to\n\nTHE WARDEN,\nEmmanuel College,\nPrince Albert.\nR. H. BRATNOBER,\nCHURCH STREET,\nPRINCE ALBERT, SASK.\nSaddle & Harness Maker.\n\nA LARGE STOCK OF\nHarness & Saddlery Always on Hand,\nAnd Orders Promptly and Neatly Executed.\nTERMS REASONABLE.\n\nISAIAH MCCOLL,\nGeneral Blacksmith,\nCHURCH STREET,\nPRINCE ALBERT, SASK.\n\nALL KINDS OF\nBlacksmithing Done in First Class Style\nAnd at Moderate Rates.\nRanches in Prince Albert District.\n\nAmong those engaged in stock raising in the Prince Albert District who will not be referred to elsewhere, are:\n\nChas. Robertson & Sons, Carrot River—One of the first to settle in Carrot River, some ten years ago, was James Robertson, who was joined shortly afterwards by his father, Mr. Charles Robertson, and his brother, John Robertson. Finding that the country was well adapted for stock raising they imported a number of grade heifers and a thoroughbred bull, and have kept increasing and improving their stock until they have accumulated about one hundred head of high grade cattle. They have taken several valuable prizes at the Lorne District (Prince Albert) Agricultural Exhibitions, against strong competition, and last year they took the Merchant's Challenge Cup—a trophy worth $75—for the best herd of cattle, and the first prize for the best two-year-old thoroughbred heifer. They also took several prizes for sheep. Besides stock raising last year they cropped thirty acres, the yield per acre being very large, and the quality in all respects equal to grain produced in any country. Their herd of sheep numbers about seventy-five, and consists of Schrop Downs, Leicesters and Cotswolds, among them being a thoroughbred ram. They also manufacture cheese. Mr. Robertson, sr., has pioneered in Quebec, Ontario and Carrot River and considers the latter place superior to the two former for stock raising and general farming. The cost of hay being very low and the wintering season being not more than two months. Mr. R. was President of the Carrot River Agricultural Society last year, is a Liberal in politics, and a native of the vicinity of Montreal.\n\nThomson Bros, Halcro—Messrs. James and John Thomson started their ranche three years ago. They have at present forty-five head of cattle, six of which are thoroughbred shorthorns and the rest are from thoroughbred bulls and high grade cattle. The shorthorns consist of one bull, two cows, one year-old heifer, and two bull calves. The brothers commenced with thirteen heifers and one bull, and during the three years that have elapsed they have sold enough cattle to pay the original cost of the thirteen and have forty-five head left. They also have a large drove of sheep, crossed between Leicesters and Schrops, starting three years ago with five ewes and one ram. Eight head sold during that time brought $300, one ram selling for $80. Last year they took second prize at the Lorne Agricultural Exhibition for a thoroughbred bull, and first prize for a thoroughbred year-old heifer. They also took three first prizes and two second prizes for grade cattle, and five first prizes for sheep. The brothers stable their stock during the winter, feeding hay, believing that the difference in their condition in the spring more than pays for the expense of feeding, a couple of weeks on the fresh grass making their steers ready for market. Their stables are large and warm,\nand the cattle are always comfortable. Hay, of course, is put up very cheaply, not costing more than $2 per ton. The brothers are from Hamilton, Ont., and are thoroughly posted in the cattle business.\n\nW. H. Mitchell, Duck Lake—This gentleman established his ranche in 1882. He has at present about one hundred head of cattle among which are two pedigree bulls, one grade bull, and ten pedigree cows. Last fall he imported eleven West Highland cattle, which, though a small breed, are considered the hardiest in existence, while they make the best of beef and come earlier than any other cattle. Mr. Mitchell has also a number of horses among them being a thoroughbred Percheron stallion, imported from Quebec in 1886. He only stables young and poor cattle during the winter, letting the rest feed out and take shelter at the stacks. Mr. M. is an Englishman, but has been in the Prince Albert district for a number of years as manager for Wm. Stobart & Sons. He also owns a grist mill at Duck Lake.\n\nCarswell Bros., Clarke's Crossing—These gentlemen are from Palmerston, Ont., and took up their present location, in the Temperance Colony, in 1883. They have about sixty head of thoroughbred and grade cattle. Their thoroughbreds consist of one three-year-old bull, four cows and three calves, all Shorthorns. The latter took first prize at the Lorne Agricultural Society exhibition held in Prince Albert in 1886. Last year they did not exhibit owing to the distance they have to drive their cattle being too great. They, however, secured a number of prizes at the Saskatoon Agricultural exhibition last year. Situated, a long distance from a good market, the brothers labour under a great disadvantage. A few years, however, will make a change for the better and reward them for their pluck and perseverance under many difficulties.\n\nWm. Tait, Prince Albert—This gentleman's ranche is situated about four miles north of Prince Albert. He has one two-year-old thoroughbred Shorthorn bull, purchased from James Hunter, of Alma, Ont., and seventy head of grade and native cattle. This year he intends bringing in a number of grade and native cattle and expects to have the best stocked ranche in the Prince Albert country in a few years. The locality chosen by Mr. Tait for his ranche abounds in hay, fresh water and shelter. He, however, stables his cattle all winter, believing that it pays better, the steers becoming fit for market after a couple of weeks on the new grass. Mr. T. is a thorough business man, and has both the capital and the energy to make ranching a success. He is an ex-member of the Mounted Police, and of the first to enter the service.\n\nR. J. Pritchard, Prince Albert—This gentleman's ranche is about nine miles north of Prince Albert. He has one pedigree bull (Duke of York), two pedigree cows, one ten-months old bull calf (Duke of Regina), and four pedigree cows, all Shorthorn Durhams. He has besides seventy head of grade cattle. At the last Lorne District Agricultural Exhibition he secured three first prizes and one second prize for thoroughbred cattle, and two second prizes for grade cattle. He considers the country\nwhere his ranche is located as equal to any in the Northwest for stock-raising. He wintered cattle there in 1886-7 at a cost of $3 per head. Three of his herd were out all that winter and returned in the spring in good condition. He, however, does not believe in letting his cattle run during winter, the cost of stabling being very little, and the difference in their condition in the spring more than paying for the cost wintering. Mr. Pritchard is an old settler in the district, and a native of Kildonan, Manitoba.\n\nHenry Smith, Saskatoon—This gentleman has a herd of Jersey cattle consisting of a bull and twelve cows, together with a number of grades. The number may not seem large, but it is a very good beginning. The Jerseys took the first prize at the last year's Agricultural exhibition. Mr. Smith stables his cattle during the winter, hay being very plentiful and cheap.\n\nJohn Sanderson, Carrot River—Besides being a general farmer Mr. Sanderson has about fifty head of cattle, and a number of sheep and hogs. He has been in the Carrot River district a number of years, and wants no better country for stock raising and general farming. He is from Dunville, Ont., and is President of the Carrot River Agricultural Society.\n\nGeorge Connors, Carrot River—This gentleman took up a farm in Carrot River some years ago, and has carried on general farming ever since. He has a herd of about forty head of cattle, and carries on the manufacture of cheese, for which a ready market is found in Prince Albert.\n\nD. & E. Dinsmore, Carrot River—The brothers have between them about thirty head of cattle, twenty-five sheep and a thoroughbred ram. They have been in the district about six years, commencing with very little means, and gradually working their way to the front.\n\nEllis & Son, Carrot River—These gentlemen have about thirty head of grade cattle. They also carry on general farming.\n\nThere are some other farmers who, while they do not claim to be ranchmen, have large herds of cattle, among them being Thos. McFadden, of Colleston; Thos. McKay and Wm. Miller, Prince Albert; Thos. Scott John McNiven and Alex. Stansfield, Red Deer Hill, and Chas. Adams, Halcro.\n\nSHEEP RANCHES.\n\nThis is a branch of the ranching industry which is rapidly developing in the Prince Albert district. A few years ago sheep were very scarce, not numbering more than a few hundred. Last year there were not less than three thousand, and it is safe to say that that number will be more than doubled before the end of the present year. Among those who make sheep ranching a specialty are James Macarthur, of Prince Albert, and Wm. Diehl and Gilbert Carter, of Carlton.\nJames Macarthur, Prince Albert—This gentleman commenced a sheep ranch a few miles south-east of Prince Albert in 1884, bringing in that year 450 ewes from Montana, which, added to fifty he already had, made 500. Owing to the rebellion of the following spring the lambs were not cared for as they otherwise would have been, and the increase was not more than forty per cent. In the following year, under more favorable circumstances, the increase was 126 per cent. Since establishing his ranch he has sold 500 sheep. He sold 6,000 lbs. of wool in the last three years, over and above what was kept and made into yarn; for which he received 15c per lb. in Winnipeg. He expects this year's crop of wool to be over two thousand lbs. His sheep are all fine wool Merino grades, experience convincing him that fine wool sheep are best adapted for the district, and the most profitable. All that is required for winter protection is a low log stable built at a trifling cost, in which the sheep are fed all they can eat for about two-thirds of the winter. One ton of hay to four sheep, and one ton to five of mixed flocks of ewes and lambs suffices. Hay costs him $1.25 to $1.50 per ton and he has little doubt that hay will yet be procurable in sufficient quantity for from $1 to $1.25. His loss of sheep has not been one per cent, while the loss in Montana last year was fifty per cent. Mr. Macarthur secured eight first prizes at the last Lorne Agricultural Society Exhibition.\n\nWm. Diehl, Carlton—In 1870, this gentleman commenced a sheep ranch about five miles south-east of Carlton, on the Battleford trail, bringing in a number of sheep that year, and building a house and stables. His flock continued to increase year by year until the spring the rebellion broke out, when the rebels, who evidently had a tooth for mutton, confiscated his woolly retainers. Last year he again commenced a sheep ranch, bringing in 129 Leicestershire sheep, of which number 102 are ewes, 25 wethers, and two thoroughbred rams. He built a shed, or wind-break, in which to feed the sheep when the snow is too deep, and to protect them in wet or stormy weather. During the fine weather, winter and summer, the sheep are let run and feed on the buffalo grass which grows upon the sides of the numerous ravines in that locality, and the bottoms of which abound in fresh water springs. Mr. Diehl has not, as a rule, had to feed hay more than two months in each year, the cost of which has been more than met by the wool on each animal. So far he has only lost one animal, that one dying from exhaustion shortly after its arrival. Mr. Diehl is a married man and has a comfortable house on his ranch.\n\nGilbert Carter, Carlton—This gentleman commenced a sheep ranch last year a short distance south of Mr. Diehl's. His flock, as yet is not very large, but next year he intends importing a large number. Mr. Carter considers the country where he is located as unexcelled for sheep ranching. Mr. C. for a number of years carried on the furniture business in Prince Albert.\nH. H. CLARK,\nChemist & Druggist,\nRIVER STREET,\nPrince Albert, Sask.\n\nA Large and Well Selected Stock\nOF\nDRUGS,\nPATENT MEDICINES!\nFANCY GOODS,\nPerfumery, Combs, Brushes, Etc.\nALWAYS ON HAND.\n\nPrescriptions Carefully Compounded.\nSatisfaction Guaranteed.\nCanada's Greatest Newspaper\n\nThe Empire,\n\nTORONTO, CANADA.\n\nThe Advocate of Canadian Nationality and Progress.\n\nCOMPLETE AND RELIABLE\n\nCable & Telegraphic News\n\nFROM ALL PARTS OF THE WORLD.\n\nIts Local, Legal, Political and Dramatic News always Fresh, Crisp & Readable.\n\nThe Sporting Page is Unequalled in any other Paper in the Dominion.\n\nThe Commercial Page is Relied on by Every Business Man in Canada.\n\nTHE DAILY EMPIRE, $5.00 per annum in Advance.\nTHE WEEKLY EMPIRE, $1.00 per annum in Advance.\n\nADDRESS, THE EMPIRE,\nToronto, Canada.\nMission de Battleford commencée solennellement par le P. André, fin de mois 1877, en réalité par le P. Lévesque qui y arriva le 3 décembre de la même année. Pâques 1878, l'abbé Y. est déjà parti au Sinaï. Le P. Lévesque le 2 août 1879, sans église ni cloche, faisant le tabernacle tout seul dans une maison, tantôt dans une autre. Ces années là 16 familles dont 8 d'adultes (indigènes), deux maritages et deux abjurations. Servite dûment dans la congrégation de l'Étoile, il est toujours à l'éducation ; sur la fin de cette année, nous avons été heureux de voir le P. Scott, régulièrement pour les Territoires du Nord-Ouest excellent catholique. M. P. Pouget, alors secrétaire du gouvernement et professeur du Conseil du N.O., fut élu à la séance publique de l'Assemblée et le P. Hall, qui arrivera dans l'automne de 1878. Le P. Lévesque suit à ce point de cette année avec des victoires qui coulent de l'abondance du confluent des rivières de la Pièce et de la Verte, laissant en pleine foi que son Pouget, le 24 mai 1879, le P. Lévesque se révélait encore à Battleford et consacra dans le baptême de la mission les quelques détails qui précèdent.\nIn a pamphlet published in 1883 by Wm. Laurie, now of the Indian office, Battleford; descriptive of the Battle river valley, that gentleman thus sketches the early history of the town of Battleford:\n\n\"In 1874 the engineers of the Canadian Pacific Railway passed through the Saskatchewan valley, crossing the Battle River about two miles from its mouth, and shortly afterwards the contractor for the construction of the telegraph line sent through large parties of men to carry on the work he had undertaken. Struck with the beauty of the place the crossing of the Battle river was chosen as the contractor's headquarters, under the true western appellation of \"Telegraph Flat.\" Next came the selection of the crossing as the seat of Government for the Northwest Territories, on account of its central situation, and the name was changed to the appropriate and more euphonesous one of Battleford. In due course the men in the employ of the Department of Public Works appeared upon the scene, and proceeded with the erection of buildings for the accommodation of the officials of the Northwest Government. A troop of Mounted Police was stationed here, and barracks erected. The public works, employing as they did, large numbers of men, naturally attracted several traders, and speedily the nucleus of a small town was formed.\"\n\nThe town to which the writer refers is now known as South Battleford, and was situated partly in the valley, and partly on the high ground to the south of the Battle river. It consisted of the buildings above alluded to, H. B. Co. trading post, the stores of A. Macdonald & Co. and Mahaffy & Clinkskill, the Herald office, Roman Catholic and English churches, telegraph office, and several boarding houses and private residences. The future of the little town seemed bright. Being the seat of Government for an immense territory, and being on the line of the Canadian Pacific Railway, why should it not? Disappointments were in store for it, however. The route of the C. P. R. was changed, and on the 27th of March, 1883, the seat of Government was removed to Regina. Thus the people who had settled in Battleford and the surrounding country with the understanding that they would be in the vicinity of the capital and on the line of railway found their hopes blasted. Having a firm faith in the country, however—a faith based on its great natural advantages, its rich soil, its luxuriant grass, pure water, timber and coal—they did not desert their newfound homes, and instead of the settlement decreasing in population it gradually increased.\n\nIn 1883 a rival town was commenced by A. Macdonald on the high plateau between the Battle river and Saskatchewan, and about a mile north of the former. The superiority of the new site was beyond dispute. It was not only picturesque, but it was closer to the navigable waters of the Saskatchewan, upon which a fleet of steamboats had been placed.\nAs a consequence the old town not only ceased to grow, but gradually lost its old time prestige. At the beginning of the year—1885 the new town had developed to considerable dimensions. Though somewhat irregular and scattered, its appearance from the surrounding hills was exceedingly striking, and the observer could not help but feel that if ever there was a spot marked out by nature for the foundation of a city that spot was where Battleford stood.\n\nBut if fate had dealt harshly with the old town previous to 1885, that year was destined to have recorded in its annals a calamity the effects of which were felt by all the settlers of the district. Early in the spring of this year Riel raised the standard of revolt at Batoche, and his faithful ally Poundmaker marshalled his over-fed warriors and attacked the town of Battleford. The history of the events connected with the Indian uprising is too well known to need detailing in these pages. The old town was almost destroyed, the cattle of the settlers of the district were driven off and many of their houses burned. Many lives were also lost. When the Indians had been driven to their reserves, and the smoke of battle cleared away all that was left of the old town was the Government buildings, the registry office, the Herald office, and the residences of Mr. Nash, P. G. Laurie, Frank Cotton and a few others. Since that time there has been little change excepting the improvement made to the old Government buildings and the opening of the Industrial School. The new town has gone on developing, the buildings destroyed in the old town being replaced in the new on a larger scale. Almost every profession and business is represented, and though there would seem to be a lack of trade, businessmen are generally prosperous, only one failure having taken place since the commencement of the settlement. Morally, socially and intellectually Battleford people compare favourably with the citizens of any place in the Northwest. If they err it is on the side of over-generous hospitality—an evil leaning to virtue's side, and characteristic of western towns.\n\nThe population of the town, including, of course, South Battleford, is about five hundred, divided about equally between French, Metis and English. The\n\n**Mercantile Interests**\n\nof Battleford are represented by A. Macdonald (formerly Mahoney & Macdonald, the pioneer merchants of the settlement), the H. B. Co., which previous to the settlement of Battleford had a temporary winter trading post a few miles northwest of that point; Mahaffy & Clinkskill, who commenced business in 1883, all general merchants; Dr. A. B. Mackay, chemist and druggist; H. H. Millie, watchmaker and jeweller; Macgregor & Gallagher, butchers; Mrs. Larkins, milliner and dressmaker, and P. G. Laurie, editor and publisher of the Saskatchewan Herald. The general merchants all carry large stocks and are among the most substantial firms in the Northwest.\nThe Manufacturing Interests\n\nof the town are represented by Prince Bros., proprietors of the Battleford grist and flour mills; D. L. Clink, who is fitting up a sawmill, which he expects to have ready for operation by the opening of navigation; Eugene Brunel, Alex. Mackenzie and Wm. Latour, blacksmiths; Jacob Graff and Robinson & Cline, brewers; Thos. Dewan, brickmaker; R. C. McDonald, J. H. Sully, contractors; Geo. Clouston, cabinetmaker, Robert Dulmage, tinsmith, and Louis Dery, baker.\n\nHotel Accommodation\n\nBattleford has three large hotels, all of which are well kept, and in every way a credit to the town. The cost of accommodation is within the reach of the poorest traveller and can be advanced to meet the desires of the most fastidious of the human kind. The prohibitory law being in force in the Territories, alcoholic liquors are not obtainable at the hotels. As a substitute a beer made from hops is sold, the only virtue of which lies in the fact that it is comparatively harmless.\n\nChurches.\n\nIf substantial churches are any indication of the Christian zeal of the builders, Battleford people are something more than lukewarm believers in the plan of salvation. In the primitive days of the settlement they worshipped in the poorest of structures, now they possess three fine churches.\n\nThe Roman Catholic mission of St. Vital was founded by Rev. Pere Lestance, O.M.I., now of St. Albert, in the winter of 1877-8, who was shortly afterwards joined by Rev. Pere Andre, O.M.I., now stationed at Calgary. In the fall of 1878 Rev. Pere F. Hert arrived. At that time a small church had been built covered with a straw roof, the clergy found shelter in the houses of A. P. Forget and W. J. Scott, registrar. In course of time they managed to erect a log dwelling 10 x 15. Rev. Pere Hert started a school and taught the children—10 or 12—to read and to write. Unfortunately he lived but a short time, dying suddenly in the fall of 1880. He was succeeded by Rev. Pere Bigonesse. The latter taught school as well as performed his priestly duties for three years in the old town site. In 1883 a new church, 30 x 50, with a tower and large bell, was built on the brow of the hill overlooking the Saskatchewan, in the new town. Though this building seemed on the large side, so rapid has been the increase in the congregation that is now too small.\n\nA mission in connection with the English Church was founded in 1878, by the late Lord Bishop McLean. The first church was the usual log structure, and was located in the old town. This fell a prey to the flames of rebellion in the spring of 1885. From that time until the summer of 1887 the congregation worshipped in Latimer's Hall. In that year St. George's church was built, at a cost of $2,500. It is a frame building,\nis well finished inside and out, and capable of seating about 150. Rev. R. J. Pritchard is the present incumbent, succeeding Rev. Thos. Clarke, now Principal of the Industrial School.\n\nA Presbyterian mission was established in Battleford in 1883 by Rev. Peter Straith, who was succeeded in 1884-5 by Rev. H. Cameron, the first regular preacher. The latter gentleman was succeeded the following year by Rev. L. H. Rowand. After the lapse of a year this gentleman was succeeded by Rev. J. McL. Gardiner. The present incumbent is Rev. John Hogg. Last year a brick church was erected at a cost of $3,000. It is 24 x 45, inside, well finished, and capable of seating 140 people. Very little debt remains on it, which speaks well for the Christian zeal of the congregation. The church is located in a central position, and presents quite a creditable appearance.\n\nEducational.\n\nIn the field of education Battleford is not behind other Northwest towns, having two public schools, and an Industrial school for the education of Indian children. From the foundation of the town up to 1886 schools were carried on by private subscription. In May of that year both Roman Catholic and Protestant public schools were established, the former on the 4th of the month and the latter on the 29th. The assessed value of property belonging to members of the Catholic church is $50,000, and that of the Protestant churches $144,499, the revenue in each case exceeding the expenditure. Both schools are in charge of competent teachers, and the pupils are making rapid advancement.\n\nThe Industrial School for the education of Indian children is carried on in the old Government building, which was refitted throughout for that purpose at considerable cost. About thirty children attend the school, which is under the direction of Rev. Thomas Clarke, for some years teacher on Red Pheasant's reserve. Besides the English language the children are taught useful trades. That the school will be the means of doing much good there is no doubt.\n\nNewspapers.\n\nNext to the Christian missionary in a new country ranks the newspaper missionary. Among the latter and in the forefront of that noble phalanx of civilizing agencies, stands P. G. Laurie, editor and proprietor of the Saskatchewan Herald. Indeed it is a question whether the history of journalism affords a parallel to his in enterprise. At the time of his arrival in Battleford the settlers did not number a score, and the first issue of the Herald contained only one local advertisement—that of Mahoney & Macdonald, now A. Macdonald. With the development of the settlement, however, his advertising patronage increased, and the Herald is now a paying institution. But Mr. Laurie had a higher object in view than that born of mere greed of money, in establishing a news-\npaper in the capital of the Northwest, if we may judge from the following verses quoted from a poem entitled the \"Herald's Song,\" which appeared in the first number of that paper, issued on the 26th of August, 1878:\n\n\"I was born without pomp or glory,\nUnfettered or uncaressed,\nAmid hills eternal and hoary,\nIn the land of the golden west.\n\nBy the side of the rushing river,\nSweeping with tireless speed,\nI have sprung into life and being,\nTo achieve and to succeed.\n\nI will speak, and in tones of thunder\nUndaunted by human fears,\nI will scatter and rend asunder\nThe gloom of a thousand years.\n\nAnd perchance in the not long future,\nEre the star of my life goes down,\nI shall know that this land shines the brightest\nIn the gems of the British crown.\"\n\nHis dream was to \"scatter the gloom\"—to make the truth known with regard to the great country drained by the Saskatchewan, and thus do his share in opening up and developing a territory which, by virtue of its wealth in forests and minerals, richness of soil, and its vast extent, is destined, in the near future, to \"shine the brightest in the gems of the British Crown.\" That he has done and is doing his part, no one who knows the power of a well conducted newspaper will dispute, and the best wish of all those who admire pluck and perseverance must be that he will realize his dream \"ere the star of his life goes down.\"\n\nMr. Laurie is a native of Scotland, and came to Canada in the year 1842. He was first connected with the Owen Sound Times. Subsequently he established the Windsor Record. In 1869 he removed to Winnipeg, and nine years later to Battleford.\n\nSome Old Settlers.\n\nThough a town founded a little over a decade of years ago would be considered, in an eastern country, as yet in its swaddling clothes, and its citizens as comparative new-comers, the same rule does not apply in the Northwest. Ten or fifteen years of pioneering on the Saskatchewan, far from railways, and surrounded by the not over-friendly natives, count for a good deal more in a man's life than the same number of years spent within hearing of the whistle of the locomotive or a few hours' drive of a county town. Pioneering of the latter fashion is only a burlesque on the former. Besides the gentleman referred to in the paragraph preceding there are others worthy of special mention. Among these are\nW. J. Scott,\nwho was appointed Registrar of the Battleford district when the Northwest Government was first formed. He is a brother of the Hon R. W. Scott, a native of the Ottawa district, and by profession a barrister. During his residence in Battleford he has taken a deep interest in every movement having for its end the advancement of the prosperity of the town and district. In the early days his house was a shelter to the missionaries, who will ever hold in grateful remembrance his many deeds of kindness. Socially Mr. Scott has ever ranked as the most genial of companions. He lives in South Battleford, is in religion a Roman Catholic, and a Liberal in politics, though he studiously refrains from interfering in political matters.\n\nHugh Richardson, Jr.\n\nThis gentleman is a son of Lt.-Col. Hugh Richardson, Chief Justice of the Supreme Court of the Northwest, and occupies the three-fold position of chief telegraph agent, postmaster, and deputy-clerk of the Supreme Court for the District of Saskatchewan. He has been a resident of the Battleford district ever since the telegraph line was constructed, and was the first to \"hold down the lightning\" in Battleford, the office then being in the late Barney Freeman log shack at the foot of the hill as you enter the Battle River valley by the trail from Prince Albert. Mr. Richardson has always been very popular with his fellowcitizens. He owns considerable property in the town and has a firm faith in a prosperous future for the ex-capital of the Northwest.\n\nA. P. Forget.\n\nThis gentleman is a brother of the very popular clerk of the Northwest Council, and has been a resident of Battleford from its earliest days. As may be understood from his name, he is a Frenchman, born and brought up in the Province of Quebec. He has a farm close by the town, is a notary, and was for some time deputy-sheriff of the district. In the annals of the early missionaries he also figures among those whose roof always afforded them a welcome shelter.\n\nRobert Wylde.\n\nThis gentleman is an ex-member of the Mounted Police, and came to the Northwest in 1874 with the first detachment of police, under Col. French. While connected with the force he had an opportunity of seeing the most of the Northwest, and on leaving the service, some years ago, he took a claim, in company with Mr. Bourke, on the north side of the Saskatchewan, and immediately opposite the town. Mr. W. is, while a careful business man, one of the most genial of souls, and does everything he can to make life merry. He is a young man, unmarried, a Conservative in politics, and a native of Dundas, Ont.\n\nHartley Gisborne.\n\nThough this gentleman is a comparatively recent arrival in Battleford, he has occupied such a prominent position since his advent, in 1882, that\na history of the town lacking special mention of him would not only be incomplete but a mistake. He is a native of Kent, England, and was educated at the Mercers College, London, England, coming to Canada in 1872. He was employed as an assistant on a Government telegraph survey in Nova Scotia from 1876 to 1880. He was Government engineer in charge of telegraph construction in British Columbia and the Northwest Territories from 1880 to November, 1882, since which date he has been District Superintendent of Government Telegraphs and District Electrician for Manitoba and the Northwest Territories. He is a member of the Society of Electrical Engineers and Electricians of London, England; a member of the Institute of Electrical Engineers, New York; Associate Member of the Society of Civil Engineers of Canada, and Life Member of the British Association for the Advancement of Science. Since assuming the duties of his present office he has been very popular with the employees of the telegraph service, they having presented him, on the 24th of December, 1886, with an address and a magnificent silver cup as an evidence of the high appreciation of him as a superior officer and as a gentleman. He was also banquetted last October, on the eve of his departure for the east. He is a son of F. N. Gisborne, F.R.S.C., Ottawa.\n\nWM. M'KAY.\n\nThis gentleman is a Junior Chief Trader in the H. B. Co.'s service and has charge of the Company's post at Battleford. He is a brother of Thos. and James McKay, and a brother-in-law of Hon. L. Clarke, of Prince Albert. Like all the head officers of the Company throughout the Northwest, he is very popular. While always striving to advance the interests of his employers he takes a deep interest in the success of Battleford. He is about 38 years of age, a native of Manitoba, and has been in the employ of the Company ever since a permanent post was established at Battleford.\n\nMAHAFFY & CLINKSKILL.\n\nThese gentlemen came to Battleford in 1883. The former was for some time in the Dominion Bank, Toronto, and subsequently carried on business in Darlingford, Manitoba. Mr. Clinkskill is a native of Glasgow, Scotland, and came to the Northwest in 1882, more to see the country than for any other purpose. Liking the country, however, he formed a partnership with Mr. Mahaffy and commenced business in Prince Albert, in the store now occupied by Charles Mair. In 1883 they removed to Battleford, commencing business on the main street of the new town. Both are thorough business men and the firm are doing a large and constantly increasing trade.\n\nPRINCE RROS.\n\nThese gentlemen are the proprietors of the Battleford grist and sawmill, and came to the Saskatchewan from St. Boniface. They erected their mill in 1884, a short distance south of the steamboat landing on the Saskatchewan, and last year removed it closer to the river, putting in\nadditional machinery and otherwise improving it. They obtain their logs partly from Edmonton and partly from the forests adjacent to Battleford. Last year's crop of wheat being large, as well as other grains, the mill has been running steadily all winter. The brothers also do considerable farming, and in many ways contribute to the progress of the settlement.\n\nJOHN CARNEY.\n\nThis gentleman has for a number of years been connected with the Indian office, Battleford, in the capacity of Assistant Agent. He was for a number of years a resident of Windsor, Ont., and at one time carried on a fur trading business in Fort William. He is well posted in the characteristics of the natives, and makes a good officer. He is a brother of Dr. Carney, of Windsor, Ont., and a brother-in-law of P. G. Laurie, of the Herald.\n\nD. L. CLINK.\n\nThis gentleman is one of the most enterprising citizens of Battleford. He is not a professional man, nor does he carry on any one particular business. He is, properly speaking, a speculator, and he seldom fails to realize a good profit out of his ventures. He recently purchased the machinery of Coleridge & Co.'s mill, which has for some time been lying at the mouth of Turtle River, and intends putting it up in Battleford. Mr. C. was at one time a resident of Winnipeg, where he carried on the very honorable business of water-carrier.\n\nEDOUARD RICHARD.\n\nThis gentleman is one of the most widely known men in the Northwest, having been the first sheriff of the Territories. He is a native of Quebec, and was at one time a partner of the Hon. Wilfred Laurier, now leader of the Liberal party. He was also a member of the House of Commons for a number of years, taking a high place in the ranks of the Liberal party, though himself a pronounced protectionist. He abandoned politics, however, to seek his fortune in the Northwest, and was subsequently appointed sheriff. He is now following his profession.\n\nH. H. MILLIE.\n\nWherever you go in the Northwest, or any other country, you are sure to find natives of the Emerald Isle. They flourish in all climates and keep neck-and-neck with their fellowcitizens of other nationalities in the race uphill. Battleford has its Irish citizens, and the gentleman whose name heads this paragraph is one of them. He is a native of Dublin, and in his boyhood days he used to play football on College Green and hunt bailiffs, the latter being the national amusement. Now, however, Mr. Millie is following the business of watchmaker and jeweller, and is doing a good trade. Sober, industrious, and trustworthy, he will not fail to do credit to the land of his birth and the land of his adoption.\n\nThere are some other gentlemen, among them Mr. Harper, Mr. Bourke, Dr. A. B. McKay, J. A. Skelton, Wm. and R. C. Laurie, J. G. Oliver, Wm. Latimer, and F. Marigold, whose length of residence in the town would entitle them to special notice, but want of space forbids it.\nRanches in Battleford District.\n\nMcFarlane Bros., Eagle Hills—Twenty-two miles east of Battleford, south of the Saskatchewan, in the foot hills of the Eagle Hills, is situated the ranche of J. M. and Thos. McFarlane. The brothers are oldtimers in the district, having taken up homesteads some years ago in Tp. 43, R. 17. After the Indian rising of 1885, in which they lost heavily, the brothers removed to their present location and commenced the ranching business. It would be hard to find a tract of country better adapted for ranching than the broken and well wooded slopes of the Eagle Hills. Nothing is left unsupplied necessary for the raising of vast herds of horses and cattle, fresh water and luxuriant grass being abundant. The brothers have about one hundred head of young horses bred from Montana brood mares and two thoroughbred Percheron stallions. This grade of animals the brothers consider are the best adapted for the Northwest, being not only hardy, but adapted for the plow, wagon, buckboard or saddle. The brothers have also about one hundred head of grade cattle, besides four thoroughbred bulls. All the animals with the exception of the stallions are let run during the winter, the bluffs affording them ample shelter, and the bottomlands abundance of grass and fresh water. The brothers confine themselves solely to ranching. Their corral is near the trail to Prince Albert, and their snug bachelor quarters always afford a cheerful welcome to travellers. They are from near Montreal; are thorough business men and bound to succeed.\n\nStephen Warden, Eagle Hills—Adjoining McFarlane Bros. on the east is situated the farm and ranche of Stephen—more familiarly known as \"Sandy\"—Warden. It is just on the eastern limit of the trail through the foot hills of the Eagle Hills, which from Battleford to this point form the south shore of the Saskatchewan and are cut up by ravines and thickly wooded. It is better adapted for ranching than farming, being too much broken for the latter purpose. Mr. Warden's herd of cattle does not exceed fifty head at present, principally grades. Last year he had a good crop, his oats averaging as high as sixty bushels to the acre. \"Sandy\" is one of the earliest settlers of the district, is a thorough business man and much respected.\n\nFinlayson & Macdowall, Eagle Hills—These gentlemen are located near McFarlane Bros., but further from the river. Mr. Finlayson arrived with his brothers in the Battleford district in 1879, settling in the Battle river valley, where he remained until after the Indian rising of 1885, when he embarked in the ranching business with Claude Macdowall.\n\nChas. M. Daunais, Eagle Hills—This gentleman is among the most enterprising of the settlers of the Battleford district, being President of the Agricultural Society during 1887. He has a large band of cattle, principally grades, among them being a thoroughbred bull. He thinks there is no place in the Northwest equal to the Eagle Hills for cattle raising, and is gradually increasing and improving his band. He also farms extensively, having a large crop last year, and his experience goes\nto show that a man can succeed in the Battleford district. Cattle brand, \"C D\" high on left hip; horse brand, same, low on left hip.\n\nWylde & Bourke—The farm and ranche of these gentlemen is situated on the north side of the Saskatchewan river, immediately opposite Battleford. They have, altogether, about 1,000 acres, having 125 acres under crop last year, ten acres of wheat and the rest principally oats and potatoes. They are both ex-members of the Mounted Police and have been settled in Battleford for a number of years. At the time of the rising in 1885 they had the largest herd of any general farmer on the Saskatchewan, but lost almost every animal during that spring. Their loss was not less than $15,000, a portion of which was paid them last fall. With this they are endeavoring to restock their ranche. They are both persevering men, and are bound to succeed. Brand for horses and cattle, \"27\" low down on left hip.\n\nBaker & Prongua—These gentlemen recently commenced the ranching business in township 43, range 17. They have quite a large herd, and are constantly making additions. Brand, \"B P\" on cattle high on right hip; on horses, same low on right thigh.\n\nFinlayson Bros., Battle River—Nothing proves more conclusively the fertility of the soil surrounding Battleford, and its general fitness for the purposes of farming and stock raising than the experience of the settlers themselves. The Finlayson Bros. arrived in Battleford, in 1879, and when they took up their present claim were not only without money, but were actually in debt. By industry and perseverance at the end of three years they not only had paid their debts, but had seven hundred acres fenced, and one hundred and sixty acres broken, of which ninety acres were under crop. They had also two good houses and stabling for ten horses and thirty head of cattle. Unfortunately for themselves as well as for others, the peace of the district was disturbed in the spring of 1885, by an Indian rising, and their cattle driven off and houses burnt. Nothing daunted, however, the brothers set to work again to replace what they had lost, building new houses and restocking their farm. They had a heavy crop last year, the average per acre being very large, and exceeding that of any previous year. Their farm is situated about six miles west of Battleford, in the Battle river valley.\n\nD. L. Clink, Battleford—This gentleman is a comparatively new addition to the ranchmen of the district, though an old and enterprising citizen of Battleford. When shrewd men such as he go into stockraising it is a pretty sure sign that the business pays. His ranche is situated in township 47, range 17. Cattle brand, curb-bit high on right hip; horse brand, same, low on right hip.\n\nH. Cinnamon & Sons, Bresaylor—These gentlemen carry on general farming and stock raising in the Bresaylor settlement. They are among the most enterprising settlers of the Battleford district, and never fail to reap good crops. They have a large herd of cattle, though not nearly as large as they would have had but for the rebellion.\nHodgson, Sumner & Co.,\n\nIMPORTERS OF\n\nBritish, French, German and American\n\nDRY GOODS,\n\nSmall Wares, Fancy Goods,\n\nBEADS, PIPES, ETC.\n\n38 Princess St., Winnipeg.\nCALEDONIA\nLivery, Feed & Sale Stable,\nOPPOSITE H. B. CO.'S MILL, EAST END,\nPRINCE ALBERT, SASK.\n\nThe public can depend on getting a first-class turn-out at reasonable prices at the above stables. A reliable man in attendance night and day, to attend to the wants of the public. Telephone in connection and orders promptly attended to.\n\nTHOS. WOODMAN & CO.,\nPROPRIETORS.\n\nCaledonia Brewery\nEAST END,\nPrince Albert, Sask.\n\nPure and Sparkling\nSaskatchewan (Hop) Ale,\n\nDelivered at all parts of the town at the following rates:\nQuart bottles, $2.50 per doz.\nPint bottles, 1.50 \" \"\nKegs (any size), 75c per gallon.\nSpecial prices to retailers.\n\nCHAS. WOODMAN, Prop.\nCity Confectionery\nAND FRUIT DEPOT.\n\nR. T. GOODFELLOW,\nPROPRIETOR.\n\nA LARGE STOCK OF\nGroceries, Confectionery, Canned Goods\nCAKES, BISCUITS,\nToys & Fancy Goods Always on Hand.\n\nFresh Oysters, Ice Cream & Summer Drinks in Season.\n\nGARVIN & HOLMES,\nContractors and Builders,\n\nEAST END,\nPRINCE ALBERT, SASK.\n\nContracts Taken at the Lowest Rates.\n\nAll Work Satisfactorily and Promptly Executed.\nNo. 3.—Town of Prince Albert, looking west.\n\nThe above view is taken from the bank of the Saskatchewan river to the left of view No. 1. On the right is the North Saskatchewan, which at this point flows due east. The first building on the left is the Roman Catholic mission. The next is the residence of Louis Schmidt, assistant Dominion Lands Agent. To the right of River street and between it and the river is a cluster of buildings the centre of which is the store of Charles Mair. Among them is the Crown Timber office, the residences of Mr. Mair, Mr. Kennedy and Mr. Coombs, Thos. McKay's large storehouse and Jas. Sanderson's sawmill. About half a mile beyond and to the left—(not given in the above view)—stands the cluster of buildings which, in the early days, sprung up on the Porter estate. Still farther on, and to the left, are St. Mary's church, Emmanuel College, and the residences of Mrs. McLean, Thos. Swanston, Ven. Archdeacon Mackey and Rev. Canon Flett.\nBUSINESS DIRECTORY\n\nOF THE\n\nTown of Prince Albert.\n\nSituation.—The Town of Prince Albert is situated on the south side of the North Branch of the Saskatchewan River, in Township 48, Range 26, west of the second principal meridian. It is distant 250 miles from Qu'Appelle Station, on the C. P. R., with which latter place it is connected by a well broken trail, upon which stopping-places have been established at convenient distances. It is connected, in the summer time, by navigation with all points on the Saskatchewan River, and Winnipeg. Good trails also connect it with the various settlements in the District, of which it is the Capital. The Settlement was founded in 1866, by Rev. James Nesbit, a Presbyterian missionary, and incorporated in 1885. Population about 800; assessed value of real and personal property, and income, for 1878, $595,358. Over $100,000 were spent last year in new buildings, including the Police Barracks.\n\nAdvantages.—It is surrounded by land unsurpassed for agricultural purposes and stock raising, fuel is abundant and cheap, building timber plentiful, and hay unlimited and luxuriant. Horses, cattle, sheep and hogs are easily kept and yield large profits. Butter, cheese, meat, vegetables of all kinds, and other necessaries of life, are cheap. Fresh water plentiful. Rents are reasonable, and wages good. There is no better field for settlement by agriculturalists, particularly the poorer class, than the Saskatchewan country, the cost of building material, fencing, fuel and hay being very little, and the soil never failing to yield an abundant return to those who cultivate it as it should be.\n\nEducational.—Prince Albert has two Protestant Public Schools, a Separate School, a High School, a College—Emmanuel—established by the late Lord Bishop McLean; and a Convent conducted by ladies of the Order of Faithful Companions of Jesus. An Institute, to be named after the founder of the Settlement, is to be built this year by the members of the Presbyterian Church.\n\nChurches.—There are five churches in Prince Albert—St. Paul's (Presbyterian); St. Mary's and St. Alban's (Anglican)—the former being the\nPro-Cathedral of the Diocese; St. Anne's (R.C.), and a Methodist church, in all of which services are held each Sunday.\n\nBankers—Macarthur & Knowles.\n\nMercantile Interests.—There are eleven General stores, three Hardware stores, two Drug stores, two Book and Stationery stores, one Furniture store, one Confectionery store, and two Shoe stores in Prince Albert, all of which carry large stocks.\n\nIndustries.—One Saddlery, one Tailoring establishment, three Tinsmith shops, one Bakery, three Blacksmith shops, one Sash and Door Factory, three Saw mills, one Grist mill, two Breweries, two Watchmakers, one Millinery establishments, three Carpenter shops, one Carriage shop, one Gunsmith, two Wholesale Butchers, a Brickyard, a Printing office, three Livery stables, two Paint shops and two Photograph galleries.\n\nHotels, etc.—Two Hotels, three Saloons, and several boarding houses.\n\nProfessional.—Two Physicians, six Lawyers, and a Dentist.\n\nPublic Offices and Officers.—Court House and Jail, Judge, Sheriff, Deputy-Sheriff, Clerk, and Caretaker; Crown Land, Timber, Telegraph, Registry, Inland Revenue and Postoffice, with necessary officers; Dominion Public Works Department, with necessary offices; Council Chamber with necessary Civic officers, together with a Police Barracks comprising thirteen substantial buildings, erected last year.\n\nSocieties, etc.—Board of Trade, St. Andrew's Society, Masonic Lodge, Curling, Cricket and Lacrosse Clubs; and Brass Band.\n\nThe town is well laid out, the streets, with the exception of those close by the river, crossing each other at right angles. River-street, the principal business thoroughfare, fronts on the River McKay, Church, and King streets and Mackenzie avenue, running south from River street, and Nesbit, McLaren, Selkirk, First, Second, Third and Fourth streets, running east and west, comprise the most thickly settled portion of the town. The buildings are mostly wood, many of them being large and substantially built. There are also a number of substantial brick buildings in the town, many of which would do credit to much older and more favored places, and Prince Albert can justly claim to be the most city-like place in the Territories. Situated, as it is, above the rapids on the Saskatchewan, and being the objective point of the Manitoba and North-Western Railway, it is destined to be the shipping point for all goods going to and from the west and north during the season of navigation. Situated, also, in the centre of a country unsurpassed for agriculture and stock-raising, and being destined, in the near future, to be connected by railway with Hudson's Bay—the natural outlet of the products of the Saskatchewan country—Prince Albert cannot fail to take the leading place among the commercial centres of the North-west.\nPrince Albert Business Directory.\n\nAcademies.\nEmmanuel College-west end; Ven. Archdeacon J. A. McKay, D.D., Warden.\nHigh School, King-st.; conducted by Presbyterian Church Authorities; Rev. A. Campbell, Principal.\nSt. Anne's Convent; conducted by ladies of the Order of Faithful Companions of Jesus; Rev. Mother Collings, Superioress.\n\nAdvocates.\nBrewster & McKay, River-st.\nGunn, W. R., M.A., King-st.\nMaclise, W. V., River-st.\nNewlands, W. H., River-st.\nSifton, A.L., M.A., L.L.B., River-st.\n\nAuctioneers.\nBuckley, Robert, River-st.\n\nBakers.\nMcDougall, Hugh, River-st.\n\nBanks.\nMacarthur & Knowles, cor. River and Church-sts.\n\nBilliard Halls.\nBuckley's Billiard Hall, River-st.\nDalas' Billiard Hall, Nesbit-st.\nWoodmans' Billiard Hall, River-st.\n\nBooks and Stationery.\nCampbell, T. N., River-st.\nE. J. Cann, River-st.\n\nBlacksmiths.\nFarney & Lovell, Church-st.\nMcColl, Isaiah, Church-st.\n\nBrewers.\nMcIntosh & Gerrond, Third-st.\nWoodman Bros., East End.\n\nBrickmakers.\nThompson, Chester, East End.\n\nBricklayers.\nBrown & Peard, Third-st.\nCongdon, R. G., River-st.\n\nButchers.\nMcDonald, John A., River-st.\nRussell & Davis, River-st.\n\nCabinet Makers.\nGoodfellow, Blain, River-st.\n\nCarpenters and Joiners.\nCarter & Cockrill, McLaren-st.\nGarvin & Holmes, East End.\nHurd & Baker, Third-st.\nKnox, Wm., Church-st.\n\nCarriage Makers.\nNeilson, Graham, Nesbit-st.\n\nConfectioners.\nGoodfellow, R. T., cor. River and McKay-st.\n\nDentists.\nMeagher, P. F., River-st.\n\nDruggists.\nClark, A. H., River-st.\nJackson, T. E., River-st.\n\nGardiners.\nMcDonald, John, East End.\n\nGeneral Merchants.\nBetts & Gwynne, River-st.\nCampbell, J. M., River-st.\nDavis, T. O., River-st.\nFish, W. R., River-st.\nH. B. Co., Tait's Block, River-st., and East End.\nMair, Chas., River-st.\nStobart, Wm., & Son., River-st.\nStewart Bros., River-st.\nWalters & Baker, River-st.\nWigmore, R. C., & Co., River-st.\nGrist Mills.\nH. B. Co., East End.\n\nGunsmith.\nGouldhawk, W., West End.\n\nHardware Merchants.\nAgnew, T. J., River-st.\nJohnston, J. L. & Co., River-st.\nMcPhail, J. R., East End.\n\nHarnessmakers.\nBratnober, R. H., Church-st.\n\nHotels.\nQueen's, Church-st., Thos. Oram, Proprietor.\nCentral, King-st., D. Pollock, Proprietor.\n\nInsurance Agents.\nAtwater, H. W., River-st.\nBrewster, Stephen, River-st.\nSpratt, Alexander, River-st.\nStull, J. F. A., First-st.\n\nIssuers of Marriage Licenses.\nBuckley, Robert, River st.\nHannahin, J. D., River-st.\n\nLivery Stables.\nGrand Union, Church-st., Donaldson & Penbridge, props.\nVictoria Livery, Nesbit-st., Neilson & McBeath, props.\nWoodman Bros., East End.\n\nMilliners.\nFraser, Mrs. Jas., River-st.\n\nNewspapers.\nPrince Albert Times, J. D. Maveety, Proprietor.\n\nPainters.\nAshby, Paul, River-st.\nThompson, Robert, McKay-st.\n\nPhotographers.\nHead, H. A., River-st.\nPage, Chas., East End.\n\nPhysicians.\nBain, Hugh U., cor. First and Church-st.\nPorter, A. E., First-st.\n\nPlasterers.\nPowers, T., cor. Mackenzie-avenue and Fourth-st.\nSutherland, George, McKay-st.\n\nReal Estate Agents.\nGunn, W. R., M.A., King-st.\nHannahin, J. D., River-st.\nHurd & Baker, Selkirk-st.\n\nSurveyors.\nReid, J. Lestock, River-st.\nSpratt, Alex., River-st.\n\nSash Factory.\nPrince Albert Sash and Door Factory, Goodfellow Bros., props.\n\nSaw Mills.\nMoore, Macdowall & Co. (Limited); at eastern limit of town.\nThompson, Chester.\nSanderson, James.\n\nShoemakers.\nShannon, Wm., & Co., cor. River and Church sts.\nMcLeod, Samuel, & Co., cor. River and King sts.\n\nTailors.\nRobinson & Robinson, cor. Church and Nesbit sts.\n\nTinsmiths.\nAgnew, T. J., River-st.\nMcPhail, J. R., East End.\nSmith, T. H., Church-st.\n\nWatchmakers.\nNorthgraves, G. D., River-st.\nWay, R. B., River-st.\nIMPORTANT\n\nTO\nSurveyors, Settlers and Prospectors.\n\nBUFFALO HALL,\nESTABLISHED 1879.\n\nThe Leading Dry Goods, Clothing,\nMen's Furnishing and Grocery\nHouse of Saskatchewan,\nCarries the\nBest Assorted Stock\nin the above Lines, and quotes\nThe Lowest Prices of any House\nin the District.\n\nEVERY DEPARTMENT\nWILL BE FOUND\nSupplied with Reliable Goods Bought\nin the Best Markets.\n\nINSPECTION OF STOCK AND PRICES INVITED.\n\nPrompt Attention! Good Value!\n\nBETTS & Gwynne.\nReal Estate Bought and Sold.\nJOHN A. MACDONALD,\nWholesale & Retail Butcher\nRIVER STREET,\nPrince Albert, Sask.\n\nHighest Price paid for Cattle, Sheep, Hogs and Poultry.\n\nTHOMPSON'S\nSteam Brick Yard.\nEAST END,\nPRINCE ALBERT, SASK.\n\nPressed Brick Superior to Winnipeg Brick, Manufactured and always on hand.\n\nCHESTER THOMPSON,\nPROPRIETOR.\nRobertson & Robertson,\nCLOTHIERS,\nAND\nMerchant Tailors,\nCORNER CHURCH & NESBIT STREETS,\nPRINCE ALBERT, SASK.\n\nConstantly on Hand, a Large Variety of\nIMPORTED WOOLENS & WORSTEDS,\nCanadian Tweeds in Great Variety,\nALSO,\nOver Coatings & Pantings.\nJ. R. McPHAIL,\n(ESTABLISHED 1879.)\nPrince Albert, Sask.\nDEALER IN\nHardware, Stoves, Tinware,\nGROCERIES,\nBOOTS & SHOES,\nClothing, Etc.\n\nMy Stock is Large and Well Assorted\nAnd the Public may Rely on having\nORDERS FILLED PROMPTLY.\n\nIt will always be my Object to have\nEverything New and Desirable in these Lines.\n\nJob Lots to Traders at Specially Low Rates.\nPrince Albert Alphabetical Directory.\n\nAdams, Horace, clerk Stewart Bros'.\nAgnew, T. J., hardware merchant, r west end.\nAgnew, A., clerk T. J. Agnew's.\nAnderson, Geo., lather.\nArmstrong, Robert, painter.\nAshby Paul, painter.\nAuld, Miss M., milliner.\nAtwater, H. W., insurance agent.\nBadgley, J. A., labourer.\nBaker, Thos. E., of Hard & Baker, carpenters, r Selkirk-st.\nBaker, Miss, school teacher, r First-st.\nBaker, Fred., of Walters & Baker, general traders, b First-st.\nBain, Hugh U., physician, r First-st.\nBain, Alex., watchman.\nBallentine, Hector, lumberman.\nArchibald,\nWilliam,\nBartlett, W. H., carpenter.\nBear, Henry, labourer,\nJas.,\nWm.\nBeaudry, A.,\nBegin, J. V., Inspector, N.W.M.P., r barracks.\nBetts, John. F., of Betts & Gwynne, r Second-st.\nBishop, W. H., cook.\nW. J., carpenter.\nBird, Geo., carpenter.\nBostwick, Thos.\nBradley, Dennis, labourer.\nBratnobe, R. H., harness-maker, r Church-st.\nBrewster, Stephen, of Brewster & McKay, advocates, r River-st.\nBrinkman, J., labourer.\nBrown, Geo. T., of Brown & Peard, bricklayers, r Third-st.\nBuckley, R., auctioneer, r River-st.\nBurns, R., printer, Times office.\nByrnes, Chas., teamster, r Second-st.\nCampbell, J. M., general trader, r cor Selkirk and McKay sts.\nCampbell, T. N., stationer, r Fourth-st.\nCampbell, Rev. A., r cor McKay and First sts.\nCampbell, Duncan, r east end.\nCann, E. J., stationer, r McKay-st.\nCarter, E. J., carpenter, First-st.\nClarke, Hon. L., Chief Factor H. B. Co., r east end.\nClark, A. H., druggist, r River-st.\nClinch, F., clerk J. M. Campbell's, r River st.\nCockrell, G., carpenter, r McLaren-st.\nCockrell, Wat., carpenter, r McLaren-st.\nCollings, Rev. Mother, Superioress St. Anne's convent.\nCook, —, homestead inspector, r crown timber office.\nCoombs, J. M., conveyancer, r River-st.\nCourtney, T., plasterer, r First-st.\nCourtney, Jas., carpenter, r First-st.\nCongden, R.G., bricklayer, r River-st.\nCurran, —, inspector public works, b J. M. Coombs'.\nCuthbert, A. R., Inspector, N.W. M.P., r barracks.\nDallas, J., saloonkeeper, b Queen's.\nDavidson, G. S., junior trader H. B. Co., r Third-st.\nDavidson, A. C., H. B. Co. clerk, r east end.\nDavis, T.O., general trader, r Second-st.\nDavis, W. T., of Russell & Davis, butchers, r River-st.\nDavis, J. O., peddler.\nDeacon, R., blacksmith.\nDeLagorgendierre, C., clerk supreme court, r First-st.\nDickinson, C., painter.\nDillworth, Wm., teamster, r River-st.\nDixon, Wm., labourer.\nDominean, Rev. Pere, O.M.I., incumbent St. Anne's (R.C.) church, r mission building.\nDonaldson, Samuel, of Donaldson & Pembridge, props Grand Union livery, r Church-st.\nDowling, Wm., lumberman.\nDrain, Wm., engineer.\nDuffy, Dennis, clerk Wm. Stobart & Son's.\nEden, H. H., bookkeeper Russell & Davis; r River-st.\nFarney, Wm., blacksmith.\nFawcett, Wm., carpenter, r Third-st.\nFiddler, Jas., labourer.\nFish, W. R., general merchant, r River-st.\nFlett, Rev. James, B.D., professor, Emmanuel College, r west end.\nGarson, Jas., labourer.\nGarvin, H. B., of Garvin & Holmes, carpenters, r east end.\nGenercan, Alex., labourer.\nGerrond, Jas., of McIntosh & Gerrond, brewers, r Third-st.\nGiles, Wm., engineer Moore, Macdowall & Co.'s mill, r east end.\nGiveen, Chas., carpenter.\nGlass, Wm., labourer, r First-st.\nGoodfellow, Andrew, of Goodfellow Bros., r Third st.\nGoodfellow, Blain, cabinetmaker, r River-st.\nGoodfellow, R. T., confectioner, r McKay-st.\nGordon, James, teamster, r Graham-st.\nGougeon, Xavier, labourer.\nGunn, W. R., M.A., advocate, r King-st.\nGunn, D. S., carpenter, r Graham-st.\nGunn, D. J., teamster, r Water-st.\nGunn, Wm., labourer, r Selkirk-st.\nGwynne, R., of Betts & Gwynne, r McLaren-st.\nGouldhawk, W., gunsmith, r Graham-st.\nHamilton, Rev. Alex., Presbyterian minister, r parsonage, cor Church and First sts.\nHamilton, Chas., carpenter, r River-st.\nHannahin, Joseph, deputy-sheriff, r First-st.\nHarkness, H., teamster, r Fourth-st.\nHart, J. R., H. B. Co. clerk, r east end.\nHudson, Albert, H. B. Co. clerk, r Water-st.\nHolmes, Archibald, of Garvin & Holmes, carpenters, r east end.\nHughes, O. E., sheriff of Saskatchewan, r cor Second-st and MacKenzie-ave.\nHurd, Joseph, of Hurd & Baker, carpenters, r Seventh-st.\nHurst, D., engineer.\nHutchinson, F., teamster, r River-st.\nHoward, Rev. W., Methodist minister, r Nesbit-st.\nJackson, T. E., druggist, r River-st.\nJardine, Rev. R., M.A., B.D., D.S., incumbent St. Paul's Presbyterian church, r parsonage, cor. Church and First sts.\nJohnston, J. L., hardware merchant, r River-st.\nKerr, Frank, carpenter.\nKeenan, Henry, Sergt. N.W.M.P., r Eighth-st.\nKennedy, Wm., trader.\nKnowles, Joseph, of Macarthur & Knowles, bankers, r cor McKay and Selkirk sts.\nLandry, Narcisse, labourer.\nLandry, Julien, \" \nLandry, Alex., \"\nLaing, Alex., blacksmith, r First-st.\nLouden, A., of Moore, Macdowall & Co., lumber merchants, r east end.\nLove, Geo., labourer, r First-st.\nLovell, J., blacksmith.\nLyons, Miles, teamster.\n\nMacarthur, James, of Macarthur & Knowles, bankers, r cor River and Church sts.\nMacaulay, John, junior chief trader, H. B. Co., r east end.\nMacdowall, D. H., M.P., of Moore, Macdowall & Co., lumbermen, r east end.\nMack, James, H. B. Co. miller, r First-st.\nMackay, Rev. J. A., D.D., warden and divinity professor, Emmanuel College, r west end.\nMaclise, W. V., crown prosecutor, r River-st.\nMagovern, L., pensioner.\nMair, Chas., sr., general trader, r River-st.\nMair, Chas., jr., clerk Chas. Mair, sr's.\nMair, Richard, freighter.\nMair, Jno., trader.\nMaveety, J. D., proprietor Prince Albert Times, r Third-st.\nManly, Thos., lumberman.\nMarkley, A.W. R., insurance agent.\nMeagher, P. F., dentist, b Queen's.\nMiller, Samuel, r east end.\nMills, George, clerk, r west end.\nMillward, Jas. labourer.\nMitchell, Hillyard, manager Wm. Stobart & Son's, r River-st.\nMoffat, Jas., farmer.\nMuir, Andrew, labourer.\nMosser, Alex., \"\n\nMcBeath, Geo., of Neilson & McBeath, props Victoria livery, r Nesbit-st.\nMcBeath, Adam, teamster, r Nesbit-st.\nMcColl, Henry, baker Hugh McDougall's.\nMcColl, Isaiah, blacksmith, r Church-st.\nMcDonald, John A., butcher, River-st.\nMcDonald, John, market gardener, east end.\nMcDougall, Hugh, baker, r River-st.\nMcGinn, R., H. B. Co. clerk, b John A. McDonald's.\nMcGregor, D., carpenter, r Church-st.\nMcGregor, D. A., carpenter, r First-st.\nMcGuire, Hon. T. H., judge supreme court Saskatchewan district, r cor Church and Third sts:\nMcIntosh, Jas., brewer, of McIntosh & Gerrond, r Third-st.\nMcKay, Thos.; farmer and mill-owner, r Graham-st.\nMcKay; Ven. Archdeacon George, B. D., r Emmanuel College.\nMcKay, Mrs. George, r McKay-st.\nMcKay, Jas., of Brewster & McKay, advocates, r Graham-st.\nMcKay, Albert, clerk J. M. Campbell's, b Queen's.\nMcKay, J. D., Clerk Wm. Stobart & Son's.\nMcKay, Joseph, jr., interpreter N. W. M. P., r west end.\nMcKay, Joseph, r Nesbit-st.\nMcKechnie, T., carpenter, r Second-st.\nMcKenzie, Wm., teamster.\nMcKenzie, Norman, clerk J. L. Johnston & Co's.\nMcLean, Mrs. W., widow late Lord Bishop McLean, r west end.\nMcLeod, Kenneth, labourer.\nMcLeod, Saml., shoemaker, r Third-st.\nMcLeod, Geo., clerk T. O. Davis', b Queen's.\nMcNabb, Adam, C. E., r River-st.\nMcPhail, J. R., hardware merchant, r east end.\nMcPhillips, Henry T., printer and journalist, b Queen's.\nMcTaggart, John, dominion lands agent, r cor Church and First sts.\nNeil, N., lumberman.\nNeil, D., carpenter.\nNeilson, Grahame, of Neilson & McBeath, props. Victoria livery, r Nesbit-st.\nNeilson, Hugh, carpenter, r McLaren-st.\nNeilson, Andrew, carpenter, r McLaren-st.\nNewitt, C. A., clerk J. R. McPhail's, r east end.\nNewitt, W., clerk Betts & Gwynn's, b Queen's.\nNilson, John, trader.\n\nOlson, Olaff, r River-st.\nOram, Thos., prop Queen's hotel.\nOuillette, R., clerk Wm. Stobart & Son's, b Queen's.\nPage, C. E., photographer, r east end.\nParker, T. H., H. B. Co. clerk.\nParker, —, Sgt. N. W. M. P., r Seventh-st.\nParks, Archibald, trader.\nPeard, Henry, of Brown & Peard, bricklayers.\nPembridge, D., of Donaldson & Pembridge, livery keepers, r Church-st.\nPerry, A. B., Supt., F Div. N.W.M. P., r barracks.\nPeters, W. H., government architect, r River-st.\nPeters, Frank, carpenter, r River-st.\nPeters, Louis, carpenter, r River-st.\nPeterson, Douglas, contractor.\nPritchard, R. J., rancher, r Selkirk-st.\nPollock, David, prop Central hotel, King-st.\nPorter, A. E., physician, r First-st.\nPorter, George, tinsmith Thos. J. Agnew's, b Queen's.\nPowers, T., plasterer, r cor Fourth-st. and Mackenzie-ave.\nPruden, John H., labourer.\nRankin, E., Government telegraph operator, r King-st.\nReed, Lestock, D.L.S.\nRiley, Wm., labourer.\nRobertson, Peter, farmer, r Third-st.\nRobinson, Alex., of Robinson & Robinson, tailors, r River-st.\nRice, Thos., lumberman.\nRogers, Hugh, carpenter.\nRoss, Harold E., assistant inspector Weights and Measures.\nRoss, R., mailcarrier, Nesbit-st.\nRussell, Geo., of Russell & Davis, butchers.\nSanderson, J., millowner, r Church-st.\nSaunders, J. P., trader.\nSayers, Mrs. J., laundress, River-st.\nSchmidt, Louis, assistant Dominion lands agent, r River-st.\nShannon, Wm., of Shannon & Mcleod, r McLaren-st.\nShannon, Henry, labourer.\nShannon, H., jr., teamster.\nShannon, John, teamster.\nShea, Frank, carpenter, r First-st.\nSinclair, James, tailor, cor McKay and Second-st.\nSifton, A. L., M.A., L.L.B., advocate, r Selkirk-st.\nSmith, Fred., tinsmith, r Second-st.\nSnell, John, teamster, r River-st.\nSoles, James, carpenter, r River-st.\nSproat, Alex., registrar, r River-st.\nSproat, A. A. B., H. B. Co., clerk, r River-st.\nSpence, Alexander, labourer.\nStewart, John, of Stewart Bros', r River-st.\nStarforth, H., r Emmanuel college.\nStanley, H. S., labourer.\nStevenson, Jas., trader.\nStewart, Alex., lumberman, r River.\nStewart, Alex., jr., bookkeeper J. M. Campbell's, b Queen's.\nStull, J. F. A., public school teacher, r First-st.\nSt. Louis, Albert, carpenter.\nSt. Louis, Louis, clerk W. R. Fish's.\nSutherland, Geo., plasterer; r McKay-st.\nSwanston, Thos., capitalist, r west end.\nTait, Wm., rancher, r Tait's block, River-st.\nTait, Joseph, farmer.\nTaylor, Bernard, limeburner, r north river.\nTaylor, James, limeburner, r north river.\nThereaux, Ed., teamster, r River-st.\nThompson, Robert, painter, r McKay-st.\nThompson, Chester, brickmaker and millowner, r east end.\nThompson, Angus, teamster.\nThompson, Alex., farmer, r Third-st.\nThorpe, Patrick, labourer, r River-st.\nToole, John, labourer.\nWaggoner, D. J., Crown timber agent.\nWalters, Henry, of Walters & Baker, general traders, r First-st.\nWay, R. B., jeweller, r River-st.\nWestwood, A., clerk Queen's.\nWetherby, —, blacksmith, r River-st.\nWhite, James, prop White's restaurant, east end.\nWigmore, R. C., of R. C. Wigmore & Co., general traders, r River-st.\nWigmore, Joseph, clerk R. C. Wigmore & Co's.\nWilliamson, D., labourer, r McKay-st.\nWoodman, Charles, saloonkeeper, r east end.\nWoodman, H., of Woodman Bros., r east end.\nWright, Rev. A. A., Anglican missionary, r Nesbit-st.\nValee, Louis, labourer.\nVeinette, Alex., labourer.\nVeinette, Roger, labourer.\n\nBROWN & PEARD,\nContractors and Bricklayers.\nContracts taken at Lowest Rates.\nAll Work Promptly and Satisfactorily Completed.\nPRINCE ALBERT, SASK.\nLOWER FLAT.\n\nThat part of the Prince Albert settlement lying east and south-east of Prince Albert Town, and comprising tps. 47 and 48, range 25 and fractional parts of tps. 47 and 48, range 24, west of the 2nd meridian. The soil is good, hay and timber is abundant. There are a number of good farmers in the settlement, some of whom have large herds of cattle. There are two public schools in the settlement, one known as Colleton and the other as Island Lake. Postoffice, Prince Albert.\n\nBeads, Jacob, 13 49 22.\nBeads, William, 13 49 22.\nBrooks, Thomas, n e 14 48 25.\nBoylan, Abram, farmer.\nBoylan, George, farmer.\nByrnes, Edward, s w 32 47 25.\nByrnes, Peter, s w 6 48 24.\nCampbell, George, n w 28 47 24.\nCarter, Walter, n w 29 48 24.\nCoombs, Joseph, n w 10 48 25.\nCherry, Frank, n w 18 47 25.\nClark, W. W., s e 20 48 25.\nCunningham, J. W., farmer.\nFrank, William, n w 19 48 24.\nFraser, Peter, farmer.\nGiveen, R. W., n e 26 48 24.\nHalpin, Herbert, n w 4 48 24.\nHalpin, Henry, s e 16 48 25.\nHarkness, Wallace, s w 16 47 25.\nHarper, Robert, s e 4 47 29.\nHarper, William, n w 22 47 25.\nHarper, Thomas, farmer.\nHutchinson, Vincent, farmer.\nHumphries, Thomas, n e 36 47 25.\nIshbister, Adam, n e 6 47 25.\nIsland Lake School, 47 25.\nKeenan, John, farmer.\nLimothe, Thomas, farmer.\nLoucks, Albert, s e 36 47 24.\nLoucks, H. T., s e 18 48 23.\nLoucks, William, s w 18 48 23.\nLyons, Myles, farmer.\nMarcell, John, sr., 14 49 22.\nMarkley, Gervais, s e 34 47 24.\nMatheson, John, n w 28 47 25.\nMiller, Richard, n w 32 47 25.\nMiller, George A., n e 14 48 26.\nMilligan, D., farmer.\nMiller, William, 24 48 26.\nMowat, Peter, s w 32 47 26.\nMcBeath, Morrison, 25 48 25.\nMcBeath, Robert, s w 29 48 25.\nMcBeath, William, s e 34 48 25.\nMcBeath, George, s e 22 48 25.\nMcBeath, Adam, n e 28 48 24.\nMcFadden, John, n w 16 48 25, rancher.\nMcFadden, Thomas, 48 25.\nMcKeen, John, see 12 48 25.\nMcKeen, Samuel J., n w 12 48 25.\nMcKenzie, John, n w 18 48 25.\nMcLeod, Donald, s e 10 48 25.\nNelson, George, s w 2 48 25.\nNelson, John, n e 6 48 24.\nPorter, Henry, n w 30, 48 24.\nPlante, Henry, n w 20 47 25.\nPlaxton, William, s e 28 48 25.\nReid, Henry, s 19 48 24.\nReid, George, s w 20 48 24.\nReid, Blain, n w 14 49 23.\nRogers, Thomas, s w 4 48 25.\nSanderson, Francis, farmer.\nShannon, Daniel, s w 27 48 25.\nSkelton, Henry, n w 20 49 22.\nSlater, J. C., s e 30 47 25.\nSmith, John, n w 34 47 25.\nSmith, E. W., n w 34 47 26.\nSpencer, William, sr., n e 30 47 24.\nSpencer, Edward, farmer.\nSpencer, Wm., jr., farmer.\nStewart, Archibald, farmer.\nStainer, William, w 22 49 22.\nStevens, George, s e 6 47 25.\nSutherland, Alex., n e 33 48 24.\nSutherland, George, 28 24.\nThompson, John, n w 10 47 25, rancher.\nThompson, Wm., s w 22 47 25.\nThompson, James, n e 47A, 24, rancher.\nThompson, George, n e 33 47 26.\nToole, John, n e 22 47 26.\nVanluven, Solomon, n e 28, 47 24.\nWilliamson, Thomas, farmer.\nYoung, Capt. C. F., n w 21 48 25.\n\nRED DEER HILL.\n\nThat part of the Prince Albert settlement lying immediately to the west and south-west of the Town of Prince Albert, and comprised in tps. 46 and 47, ranges 27 and 28, and fractional parts of tps. 46 and 47, range 1 west of the 3rd meridian. It is the most thickly settled, and the majority of the farmers are in comfortable circumstances; having numerous horses, cattle and sheep. The land is high and rolling, of excellent quality, and is dotted with small lakes, around the borders of which hay grows luxuriantly. The crops last year throughout this section were equal in yield and quality to those of any other section of the Northwest or Manitoba. There are three schools in the settlement, known as St. Catharines, Lindsay and Red Deer Hill public schools. There are also two churches, Postoffice, Kirkpatrick or Prince Albert.\n\nAdams, Joseph, n e 4 47 28.\nAdams, James, s e 32 46 27.\nAdams, Robert, s e 18 47 27.\nAdams, Joseph, s e 32 46 27.\nAdams, James, s e 4 47 28.\nAnderson, David, sr., r lot 42.\nAnderson, John M., s w 1 47 28.\nAnderson, John H., n w 32 47 27.\nAnderson, W. H., n e 32 47 27.\nAnderson, Joshua, r lot 31.\nAnderson, David, r lot 22.\nAnderson, C. T., farmer.\nAnderson, Joseph, farmer.\nAtwater, Rev. H. W., teacher Lind say school.\nBallentine, David, n w 34 46 27.\nBannerman, David, n w 20 46 27.\nBennett, A. E., n w 24 47 1 w 3.\nBoylan, Wesley, n e 14 46 27.\nBoylan, Geo., sr., farmer.\nBrass, Peter, sr., 12 46 27.\nBrass, Peter, jr., farmer.\nBrass, Alexander, farmer.\nCameron, Angus, s w 12 46 1 w 3.\nCameron, James, n w 10 47 27.\nCameron, Daniel, n e 24 47 28.\nCameron, Henry, farmer.\nCameron, John, 22 46 28.\nCampbell, Archibald, farmer.\nCampbell, Angus, s e 23 46 28.\nCampbell, Alexander, farmer.\nCook, Charles, s e 10 47 27.\nCorrigal, Joseph, n e 18 47 27.\nCorrigal, Thomas, s e 36 47 27.\nCraig, William, r lot 32.\nCraig, James, r lot 32.\nCraigie, William, s e 12, 46 28.\nCusator, George, n e 26 46 28.\nCusator, James, farmer.\nCuster, James, farmer.\nDemarais, Jean, farmer.\nEnglish, Robert, n e 22 46 27.\nFiddler, J. E., r lot 9.\nFiddler, Edward, r lot 15.\nFiddler, Peter, jr., r lot 18.\nFiddler, Thomas, farmer.\nFiddler, William, farmer.\nFlett, William, s w 18 46 27.\nFlett, James, farmer.\nFlett, Andrew, jr.\nFlett, George.\nFlett, John, sr., n w 24 46 28.\nFlett, John, jr., s e 24 46 28.\nFoulds, William, s e 6 47 27.\nFoulds, John, sr., n w 4 47 26.\nFoulds, Alexander, n e 30 46 27.\nFoulds, John, jr., n w 4 47 27.\nFox, Michael, s e 25 47 26.\nGaddy, William, s e 14 47 27.\nGiles, Robert, s w 22 46 27.\nGlaister, George, s 27 46 27.\nHarkness, George, s e 20 46 27.\nHarkness, Henry, s w 16 46 27.\nHatrick, Robert, s e 2 47 27.\nHodgson, John, farmer.\nHodgson, Joseph, farmer.\nHodgson, William, n e 14 47 27.\nHodgson, Albert, n e 3 47 27.\nHourie, Alexander, r lot 5.\nHourie, E. G., n-o-14 47 1 w 3.\nHourie, John, farmer.\nHourie, Peter, r lot 11.\nHourie, Robert, farmer.\nInkster, George, n w 2 47 27.\nInkster, A., jr.\nIshbister, R. H., n w 36 47 1 w 3.\nKIRKPATRICK Postoffice, 22 47 27.\nLambert, Joseph.\nLyttle, William, n w 12 46 1 w 3.\nMiller, Thomas, s w 20 47 27.\nMonkman, Henry, s e 12 46 27.\nMackie, James, r lots 217 219 136.\nMorrison, Angus, n e 14 46 28.\nMorgan, Robert, farmer.\nMcCloy, Thomas, farmer.\nMcDonald, John, n w 16 46 27.\nMcDonald, Angus, n e 18 46 27.\nMcDonald, John, n e 24 46 28.\nMcFarland, Joseph, s e 13 46 1 w 3.\nMcIvor, Roderick, n w 14 46 1 w 3.\nMcLoughlan, —, s e 24 47 28.\nMcLoughlan, Peter, farmer.\nMcLoughlan, Miles, s e 24 47 1 w 3.\nMcNiven, John, n e 16 47 27.\nMcNabb, Charles, n e 21 47 27.\nProctor, George, s w 14 46 27.\nPacquin, George, n e 46 1 w 3.\nPacquin, Henry, s e 17 47 27.\nPacquin, Joseph, jr., n e 36 46 28.\nPacquin, William, sr., s w 6 47 27.\nPacquin, Charles, n w 5 47 27.\nPacquin, John, 7 47 27.\nPacquin, William, jr., farmer.\nPacquin, John James, s-e 22 47 22.\nPacquin, Gilbert, s e 7 47 27.\nPacquin, Joseph, sr., n-w-6 47 27.\nRegnald, D. C., farmer.\nRenne, Thomas R., r lot 26.\nRobertson, James L., farmer.\nRoss, Hugh, farmer.\nSanderson, David, sr., r lot 32.\nSanderson, George, sr., farmer.\nSanderson, William, farmer.\nSanderson, George, r lot 31.\nScott, Thomas, n w 22 47 27.\nSinclair, Peter, s w 16 47 27.\nShaw, Charles, s e 14 46 1 w 3.\nShipman, Samuel, s e 36 46 27.\nSmith, Jackson, s e 36 46 1 w 3.\nSpencer, George C., n e 32 46 27.\nStansfield, Alex., n-w-24 46 27.\nStevens, William, s w 24 47 28.\nSullivan, Daniel, s e 34, 46 27.\nSutcliffe, John, farmer.\nSwain, Thomas, r lot 27.\nTait, Andrew, n w 36 46 1 w 3.\nTait, Robert, n w 6 46 27.\nTremain, Richard, s w 34 46 27.\nTurner, John, s e 24 47 27.\nWard, Harry, s w 36 46 27.\nWhitford, Andrew, farmer.\nWoodcock, Edward, farmer.\nTHOS. J. AGNEW,\n\n(ESTABLISHED 1879.)\n\nPRINCE ALBERT, SASK.\n\nDEALER IN\n\nHardware, Stoves, Tinware,\n\nGuns, Ammunition,\n\nBuggy Shafts, Spokes,\n\nHubs and Felloes,\n\nCARPENTERS' TOOLS, PAINTS, OILS,\n\nETC., ETC.,\n\nManufacturer of Tinware and Sheet Iron Ware.\nLIST OF NORTH-WEST NEWSPAPERS.\n\nFollowing is a list of Northwest Newspapers in the order of their establishment. As will be seen the first papers were printed in the Saskatchewan country.\n\nNo. 1.—Herald, Battleford............. Vol. X., No. 14.—Independent.\n\" 2.—Bulletin, Edmonton................ IX., \" 23.—Liberal.\n\" 3.—Gazette, Fort MacLeod........... VI., \" 26.—Ind't Con.\n\" 4.—Times, Prince Albert............. VI., \" 4.—Ind't Con.\n\" 5.—Leader, Regina.................... V., \" 46.—Conservative.\n\" 6.—Herald, Calgary................... IV., \" 20.—Conservative.\n\" 7.—Courier, Moosomin.............. IV., \" 23.—Conservative.\n\" 8.—Vidette, Fort Qu'Appelle....... IV., \" 14.—Independent.\n\" 9.—Progress, Qu'Appelle............ III., \" 15.—Prohibitionist\n\" 10.—Times, Medicine Hat............ II., \" 15.—Independent.\n\" 11.—Tribune, Calgary............... II., \" 30.—Liberal.\n\" 12.—Journal, Regina............... II., \" 14.—Liberal.\n\nBesides the above newspapers a Stock Journal was established about a year ago in Calgary. The Moosejaw News and Calgary Nor'Wester were established in 1884 and 1885 respectively, but suspended after a brief existence.\n\nThe Prince Albert Times\nAND\nSaskatchewan Review,\nPUBLISHED BY\nJ. D. MAVEETY,\nAT THE OFFICE, THIRD STREET,\nPRINCE ALBERT, SASK.\n\nTERMS—$2.50 per annum in advance. Single copies, 10 cents each.\nTransient advertisements 10c per line for first insertion, and 5c per line for all subsequent insertions.\nNo contracts made under three months.\nNo advertisements inserted for less than $1.\nW. R. FISH,\n\nRiver St., Prince Albert, Sask.\n\nGeneral and Indian Trader.\n\nALWAYS ON HAND,\n\nA GENERAL STOCK OF\n\nDRY GOODS, CLOTHING,\n\nHATS AND CAPS,\n\nGroceries, Hardware, Boots & Shoes.\n\nImmigrants will find it to their Advantage to Give us a Call.\nHORSE SHOE STORE!\nRiver Street, Prince Albert, Sask.\n\nT. O. DAVIS,\nWHOLESALE AND RETAIL DEALER IN\nDry Goods, Clothing, Boots & Shoes,\nGROCERIES, CROCKERY, GLASSWARE,\nFancy Goods, Patent Medicines, Etc.,\nAGRICULTURAL IMPLEMENTS, ETC.\n\nCustomers will always find on hand the most complete stock of General Goods in the Saskatchewan District, at Rock Bottom Prices.\nHALCRO.\n\nThat part of the Prince Albert settlement comprised in tps. 46A and 46B; ranges 25 and 26, west of the second meridian, and lying about twelve miles southeast of Prince Albert town. The soil is of the same character as that of Red Deer Hill. There is a public school in the settlement known as St Andrew's. There are three postoffices—Aaskana, 32 46 26; Halcro, 15 46 26, and Puckahin, 30 46 25.\n\nAASKANA Postoffice, 32 46 26.\nAdams, Charles, s w 32 46 26.\nAdams, P., farmer.\nAtbrick, John, 40 46 25.\nBeddome, John, s e 18 46 25.\nBird, C. G., snr., 18 46 25.\nBird, C. G., jr., s w 18 46 26.\nBird, Nicholas, farmer.\nBird, John, 28 46 26.\nBird, W. G., farmer.\nBrass, Peter, n w 12 47 26.\nBrewster, B. E., 12 46 25.\nBrown, James, n e 18 46 27.\nBiswell, Robert, 8 45 26.\nBovette, Ambrose, n e 32 46 25.\nCampbell, P., 22, 46 25.\nCook, Benjamin, 35 46 26.\nCook, J. S., 38 46 26.\nCook, Edward, farmer.\nCromartie, William, 30 46 26.\nCunningham, J., 32 46 26.\nDonald, John, s w 10 47 26.\nDubrae, A., 39 46 26.\nDubrae, Alexander, s e 7 46 26.\nDunlop, W. S., s 47 24.\nErasmus, William, farmer.\nGerrond, Wm., schoolteacher, 16 45 26.\nGiveen, S., farmer.\nGrey, John, s e 20 47 26.\nGordon, J. H., n 24 46 23.\nHALCRO Postoffice, 15 46 26.\nHalcro, Joseph, 34 46 26.\nHalcro, H., 24 46 26.\nHalcro, William, 22 46 24.\nHalcro, Thomas, s w 66 47 26.\nHamilton, James, n e 4 47 26.\nHourie, T., farmer.\nIrvin, John, n w 28 46 24.\nMassey, John, farmer.\nMcBeath, Alexander, 19 46 25.\nMcKay, John, s e 32 46 26.\nMcLeod, M., farmer.\nMcNabb, D., 25 46 26.\nNorthcote, John, 6 46 26.\nOrmond, James, s e 6 46 26.\nPeibles, R., 10 46 26.\nPride, Philip, s w 10 47 26.\nPride George, farmer.\nPUCKAHN Postoffice, 30 46 25.\nRobertson, Wm., sr., s w 34 46 26.\nRobertson, George, n e 14 47 26.\nRobertson, William, jr., s e 34 46 26.\nSpence, Andrew, s e 30 46 26.\nSpence, Edward, n w 30 46 26.\nStevens, Wm., snr., s w 32 46 25.\nStevens, Robert, 37 46 25.\nStevens, Wm., jr., farmer.\nSutherland, Edward, 19 46 26.\nSutherland, Jas., farmer.\nSutherland, Charles, farmer.\nThompson, Geo., jr., n e 14 47 26.\nTait, George, 24 46 25.\nTaylor, Edward, snr., 27 46 25.\nTaylor, Edward, s w 20 46 25.\nTaylor, George, 29 46 25.\nWhitford, George, 6 46 25.\nWhitford, G. T., 7 46 25.\nWork, Peter, n e 28 46 26.\nCANNON RIVER:\n\nThis river flows in a valley, its name taken from the Cannon River, which flows into the Mississippi River near Cannon Falls, Minnesota. The river is navigable for small boats and is used by local farmers for irrigation purposes.\n\nThe river is surrounded by fertile farmland, providing excellent opportunities for agriculture. The soil is rich and well-drained, suitable for growing a variety of crops. The river also provides abundant water for irrigation and livestock.\n\nThere are several towns along the river, including Cannon Falls, Minnesota, and Cannon City, Iowa. These towns offer various services and amenities to the local population.\n\nAnderson, J. C., No. 12-13\nDeady, R. W., No. 14-15\nCampbell, H., No. 16-17\nClarke, Wesley, n 12 36 5.\nClarke, Mrs. E. E., s 14 36 5.\nClements, Geo., e 28 36 4.\nConn, J. J., e 2 37 5.\nCarson, James, w 5 38 4.\nClarke, B W., n 23 38 4.\nCopland, Thos., s 24 36 5.\nCleveland, J. W., w 20 35 5.\nCleveland, E. U., e 20 35 5.\nCoster, E. A., n 22 36 4.\nDulmage, R. W., s 36 36 5.\nEby, Jas. M., n 6 36 5.\nEby, James M., jr., w 1 36 5.\nFletcher, Joseph, e 24 36 6.\nFarrel, John, 9 36 4.\nGarrison, G. W., s e 22 36 5.\nGarrison, Donald W., s 24 36 5.\nGrant, G. W., s 34 38 4.\nGongeon, Xavier, 22 36 6.\nGoodwin, H W., n e 5 36 5.\nGoodwin, Jas. B., s e 6 36 5.\nGoodwin, Charles, s 1 37 5.\nHamilton, Mrs. Jas., n 16 36 5.\nHamilton, John S., s 16 36 5.\nHamilton, Robert, e 18 36 5.\nHamilton, James, 17 36 5.\nHailey, Wm., w 7 36 4.\nHailey, Earnest, w 10 36 4.\nHollywood, Wm., s 31 36 4.\nHunter, Wm., s 4 37 4.\nHood, Wm., w 20 37 4.\nHilliard, George, s 30 37 4.\nHawke, E. D. B., s 22 37 4.\nHorn, Geo. A., s 4 37 5.\nHodgson, Rev. F. W., Methodist missionary.\nIrvine, William, s e 18 36 4.\nKusch, Charles, w 2 37 5.\nKusch, John, w 6 37 4.\nKeyworth, Fred., n 36 36 6.\nKerr, Fred. W., n 10 37 5.\nLasher, Simon L., e 4 36 4.\nLasher, David, w 4 36 4.\nLeslie, James, teacher School district No. 13.\nMcCordock, Robert, n 4 36 5.\nMcLean, Arthur, n 31 36 4.\nMason, Richard, 25 36 6.\nMay, Charles W., s 10 37 5.\nMeeres, E. W., n 30 37 4.\nMaxwell, Edward, n 36 36 6.\nMarr, Alexander, e 6 37 5.\nMontgomery, Const. A.E., N.W.M.P.\nPendygrasse, Sefton, n 5 37 4.\nPendygrasse, Mrs., e 20 36 5.\nPowe, J. D., e 22 38 4.\nRichardson, R. Taylor, n 14 36 5.\nSmith, Henry, s 28 36 6.\nSmith, Joseph, n 28 36 6.\nSmith, Archie, s 34 36 6.\nSmith, Charles, n 34 36 6.\nSmith, William, n e 26 36 6.\nSkafter, William, n 1 37 5.\nStewart, J. W., n 24 37 5.\nStephenson, Wm., s 12 37 5.\nStephenson, George, s 18 37 4.\nSmith, Reuben, 19 36 5.\nTeeple, Sylvester, e 32 35 5.\nTrounce, Henry, w 18 36 4.\nWilloughby, J. H. C., M.D., C.M., L.R.C.P., London, n 30 36 5.\nWilloughby, G. T. A., n 34 36 5.\nWheeler, Sayer, w 15 38 4.\n\nG. W. Grant,\nNotary, Real Estate and Insurance Agent,\nSASKATOON.\nCLARKE'S CROSSING.\n\nThis settlement is situated in tp. 38, range 4, west of the third meridian, within the Temperance Colonization tract. The postoffice is known as Saskatchewan. A Government telegraph office is located at this point, on the west side of the river, from which the wires branch off towards Battleford, Fort Pitt and Edmonton on the west, and St. Laurent and Prince Albert on the north. Telephone connection has been established between this point and Saskatoon. The crossing was named after J. F. Clarke, the first settler at that point, who is also the postmaster. The soil is good, though timber is scarce. A number of thoroughbred cattle have been imported. Good trails lead to Battleford and Prince Albert. Mail twice a month, by way of Prince Albert.\n\nBarrett, George, n 28 37 4 w 3.\nClarkc, J. F., w 36 38 4 w 3.\nCongdon, w 22 38 4.\nCaswell, Joseph, w 1 39 4 w 3.\nCaswell, R. W., e 2 39 4 w 3.\nCaswell, J. J., e 12 39 4 w 3.\nCaswell, J. D., n 12 39 4 w 3.\nCaswell, David, w 2 39 4 w 3.\nDennan, Hugh, w 18 39 3 w 3.\nHarrington, T., farmer.\nHarrington, —, telegraph repairer.\nLake, James P., n e 36 38 4 w 4.\nLake, Francis L., n 24 38 w 3.\nLake, Chas., n 28-38 3 w 3.\nLake, Parker, s 28 38 3 w 3.\nLamoigne, Fred. A., w 10 38 4 w 3.\nMolloy, R. J., Government telegraph operator.\n\nSHELL RIVER.\n\nAmong the best fields for settlement in the Northwest, stands the Shell River country, about fifteen miles north-west of Prince Albert. The soil is rich, timber for all purposes is abundant, and the supply of hay and fresh water is illimitable. To the poor man, especially, is it adapted, the cost of hay and timber being simply the cost of cutting plus the Government fees. Thus comfortable buildings can be erected, fencing done, hay secured, and horses, cattle and sheep wintered for a mere trifle compared with a purely prairie country. Added to these advantages, settlers in the Shell River country will have the benefit of being close to a good, and ever-increasing market, at better prices than can be obtained in the south or east. There are but few settlers in the country, and there is room for thousands of industrious farmers. A missionary in connection with the English Church is stationed at Assisippi Postoffice, Prince Albert. There is also an H. B. Co. trading post.\n\nCameron, John.\nHines, Rev. John, English Church missionary.\nKakasoo, Peter, H. B. Co. trader.\nLaRonde, Paul.\nLaRonde, Paul; jr.\nLaRonde, Alexander.\nLaundry, Julian.\nMorin, Baptiste, snr.\nMorin, Baptiste, jr.\nMorin, William.\nMorin, Pierre.\nMorin, Joseph.\nVandal, Gabriel.\nBIRCH HILLS.\n\nBirch Hills settlement is situated in tp. 46, range 23, west of the third meridian, just west of the Carrot River, and is of much the same character. There are but few settlers located there as yet, and there is ample room for more. It is also on the proposed line of the M. & N. W. Postoffice, Kinistino.\n\nCadwallader, J., 22 46 23.\nCadwallader, A., 22 46 23.\nJackson, J., 16 46 23.\nStevens, James.\nTaylor, Geo., 20 46 23.\nYoung, H. G.\n\nSNAKE PLAINS.\n\nSnake Plains are situated north-west of Carleton and south-west of Shell River. The land is good, and timber and hay are abundant. There is an Indian reserve and a Roman Catholic Mission at Muskeg Lake.\n\nBouchere, Francois.\nBourchega, Francois.\nBeauchern, Alexander.\nChaffee, George.\nDrever, James, snr.\nDrever, James, jr.\nDrever, John.\nErasmus, William.\nFinlayson, Joseph, Indian Agent.\nIsbister, Robert.\nLaFonde, Roger.\nLucien, Modeste.\nLeblond, Donald.\nMorissette, Norbert.\nMorissette, Norbert, jr.\nPauquette, Rev. J. P., O.M.I.\nRobertson, George.\nSanderson, William.\n\nFORT A LA CORNE.\n\nFort a la Corne is fifty one miles east of Prince Albert, below the junction of the North and South Saskatchewan, and on the south side of the river. It is a very old H. B. Co. post, having been established in the latter part of last century. The land is good and there is abundance of hay, fresh water and timber. The settlers are principally Half-breeds, and little farming is done. The boats call regularly at the post on the way up and down the river. The mail goes by way of Prince Albert.\n\nBallentyne, James.\nBelanger, August.\nCook, Thomas.\nDechambault, Louis, 20 48 21.\nFiddler, Charles.\nFiddler, Alexander.\nFiddler, Charles.\nGoodfellow, George, 2 48 21.\nGoodbad, James, 11 48 21.\nJackson, T. G., e 34 48 22.\nJourdan, Peter, 20 48 2.\nLetellier, J. L. S.\nMcLeod, Norman.\nParanteau, Napoleon.\nSmith, Peter, 48 21.\nSabys, Baptiste, 6 48 20.\nSabys, William.\nSabys, John.\nTurner, Peter, 11 48 21.\nTurner, Philip, H. B. Co. trader.\nThompson, Philip.\nThompson, Joseph.\nUmperville, Robert, 23 48 21.\nUmperville, Jno., 1 48 21.\nUmperville, Malcolm.\nSASKATCHEWAN\n\nPhotograph Gallery!\n\nH. A. HEAD,\nGraduate of the Buffalo School of Photography.\n\nPhotography in all its Branches,\nWith the Advantage of the Latest Improvements in the Art.\n\nRIVER STREET, PRINCE ALBERT.\n\nJohn Dallas' Saloon\nBowling Alley,\n\nSHOOTING GALLERY,\nBilliard and Pool Tables,\n\nCORNER NESBIT & CHURCH STS.,\n\nPRINCE ALBERT, SASK.\nSt. Anne's Convent,\n\nDelightfully Situated near the South Bank of the River,\n(See Engraving opposite Page 41.)\n\nPrince Albert, Sask.\n\nCONDUCTED BY\n\nReverend Mothers of the Order of Faithful Companions of Jesus.\n\nPupils of every denomination are admitted, and no interference is made with their religious convictions. They are, however, required to conform to the general rules of the institution.\n\nIts course of studies comprises, English, French, Latin, Greek, Italian, History, Literature, Arithmetic, Geometry, Music, Singing, Painting, Drawing, Sewing, Fancy Work.\n\nPupils are admitted any time, charges dating from entrance.\n\nFor particulars as to terms, etc., address\n\nREV. MOTHER COLLINGS,\nSuperioress St. Anne's Convent,\nPrince Albert.\nWM. STOBART & SON.\n\nINDIAN TRADERS.\n\nPrince Albert, Sask.\nHURD & BAKER,\nBuilders & Contractors,\nOWNERS OF THE\nHURD & BAKER ESTATE.\n\n300\nCHOICE BUILDING LOTS!\nFOR SALE!\nIN THE\nBUSINESS CENTRE\nOF THE\nTown of Prince Albert.\n\nPurchasers can make arrangements for the erection of buildings on\nEASY TERMS OF PAYMENT.\n\nCorrespondence Solicited.\n\nPost Office Address, HURD & BAKER,\nPrince Albert, Sask.\nCUMBERLAND.\n\nCumberland—the base of supplies for the H. B. Co. district of that name—is situated in township 37, range 2 west of the second meridian, on the south shore of Pine Island Lake, north of the North Saskatchewan, and is connected with the latter by Big Stone river. It is the oldest post of the H. B. Co. in the interior, having been established over one hundred years ago. It has had many famous visitors in its time, among them being Sir Alexander Mackenzie, Sir John Franklin, and Capt. W. F. Butler, author of the \"Great Lone Land.\" Time, however, has made little change in the post for the better. Indeed it has lost much of the prestige it enjoyed in the early days when it was the base of supplies for the interior. The inhabitants of the district are principally Halfbreeds and Indians. Steamboats call regularly on their way from Grand Rapids to Prince Albert, Battleford, and Edmonton. There are two churches at the post—English and Roman Catholic—with resident missionaries. Very little farming is done, the inhabitants who are not connected with the H. B. service living principally by hunting and fishing. Chief Factor Ballanger has charge of the post.\n\nBallentine, John.\nBallentine, James.\nBallentine, Baptiste.\nBallenden, Charles.\nBallenden, Thomas.\nBelanger, Chief Factor, H. B. Co.\nBudd, Peter, snr.\nBudd, Peter, jr.\nBudd, Henry.\nBudd, James.\nBudd, John.\nCadotte, George.\nCadotte, Pierre.\nCharlebois, Rev. Pere., O.M.I.\nCochrane, Thomas.\nCochrane, Henry.\nCook, Joseph, snr.\nCook, George.\nCook, John.\nCook, George.\nDorion, Jean, snr.\nDorion, Jean, jr.\nDorion, Louison.\nFlett, Albert.\nFontain, G.\nFoseneuve, Francois.\nFoseneuve, Jean Baptiste.\nHuston, Gideon.\nJourdain, L., snr.\nJourdain, L., jr.\nMercon, Alfred.\nMcCrum, George, H. B. Co. clerk.\nMcKay, William.\nMcKay, Donald.\nMcKay, August.\nMcKay, Donald, jr.\nMcLellan, Rev. R., English Church Missionary.\nNabaiese, John.\nNabaiese, Donald.\nPaul, Adam.\nPaul, Abel.\nPaul, James.\nPaul, John.\nSayer, John.\nSalvis, Francois.\nStone, John.\nTHE PAS.\n\nThe Pas is situated at the junction of the Carrot River and the North Saskatchewan, in tp. 55, range 26, west of the first meridian. It is a very old H. B. Co. post. There is a small church at the post said to have been built by Sir John Franklin. It is a primitive log structure, enclosed by a picket fence, and surmounted by a rude cross. The inhabitants of the post and vicinity are principally Halfbreeds and Indians. The latter are famous for their birch bark canoes and bead work. The boats call regularly during the season of navigation, which occasions the Indians take advantage of to dispose of their bead and silk work.\n\nBadger, Peter.\nBallendine, Robert.\nBell, John, snr.\nBloomfield, John.\nBuck, James.\nBuck, Matthew.\nBudd, Adam.\nCanby, Adam.\nCochrane, John, jr.\nCochrane, James.\nConstante, Jerry.\nCook, Matthew.\nCook, Henry, snr.\nCook, Henry, jr.\nCook, Simon.\nCook, Donald, snr.\nCook, Donald, jr.\nHenderson, John.\nHenderson, E.\nMarceillais, Pierre.\nLettes, Thomas.\nStone, John.\n\nGRAND RAPIDS.\n\nGrand Rapids is situated at the foot of the rapids of that name and at the mouth of the Saskatchewan river, in tp. 48, range 14, west of the first meridian. It is at this point the boats from Winnipeg connect with those on the Saskatchewan. A tramway was built some years ago from the lake shore along the north side of the river, to a point above the rapids, for the conveyance of goods and passengers to the river steamers. There is an H. B. Co. post and a warehouse belonging to the Northwest Navigation Co. at the mouth of the river. The Navigation Company have also a warehouse at the western end of the tramway, together with a boardinghouse for the accommodation of passengers. There are very few inhabitants at Grand Rapids at present, though with building of the H. B. Ry. and the utilization of the immense water power of the rapids, it is bound to become an important point. There is a missionary in connection with the English Church resident at this point.\n\nBadger, Rev. P., English Church missionary.\nBallendine, Richard.\nCook, James.\nDouon, J. Baptiste.\nFlett, Archibald.\nFiddler, John.\nGinthron; Fred.\nKnight, John.\nMerecai, Francois.\nMcLean, Angus.\nParenteau, Joseph.\nSettie, John.\nScott, Abram.\nHUMBOLDT.\n\nHumboldt is situated in township 10, range 23 west of the second meridian, near the southern limit of Saskatchewan, and upon the trail from Qu'Appelle to Prince Albert. A Government telegraph office is located at this point. The soil in this region is good and there is abundance of fuel, fresh water and hay.\n\nAnderson, J. M., Government telegraph operator.\nAnderson, Gus., rancher.\nBelanger, Norbert.\nDelorme, Jas.\nMcMahon, L.\nMcMahon, J.\nSansregret, Andre.\nSansregret, M.\n\nRED DEER LAKE.\n\nRed Deer Lake is in township 56, range 25, west of the second meridian. There is an H. B. Co. post at this point.\n\nBird Joseph.\nBird, Samuel, snr.\nBird, Samuel, jr.\nBird, J.\nBird, George.\nBird, Benjamin.\nBird, Patrick.\nBell, Thomas.\nBear, Paul.\nBoyer, John.\nCarson, Charles, H. B. Co. clerk.\nHenderson, William.\nLaliberty, Joseph.\nMaresty, Baptiste.\nNelson, John.\nSaunders, J.\nStevenson, James.\n\nGREEN LAKE.\n\nGreen Lake is a trading post on the south shore of a lake of that name, in township 58, range 11, west of the third meridian. Besides the H. B. Co., several private traders do business. The inhabitants are principally Halfbreeds and Indians, who live by fishing and hunting.\n\nBruce, William.\nClaxton, Pierre.\nClaxton, Julien.\nCilepetre, Pierre.\nDiamond, Isaiah.\nGirard, Paul.\nGirard, Napoleon.\nKennedy, G.\nListon, Jules.\nMorin, G.\nMorin, Louis.\nMorin, Baptiste.\nMorin, Baptiste, jr.\nMorin, Cyprien.\nMulhonif, Pierre.\nMcCalleneau, James.\nMcDonald, August.\nPayette, John Baptiste.\nSalihoite, Francois.\nSalihoite, Oliver.\nSalihoite, Baptiste.\nSinclair, James.\nWard, James.\n\nNUT LAKE.\n\nTp. 39, Range 23, west of second meridian.\n\nBeads, John.\nDriver, George.\nFisher, Michael.\nFoulds, Robt.\nLAC LA RONGE.\n\nLac la Ronge lies about 150 miles north of Fort a la Corne, and is partly in the unexplored territory and partly in Saskatchewan. There is quite a large settlement on the south shore of the lake, consisting of Halfbreeds and Indians, fifty-one votes having been cast at the recent election of a member for the Commons.\n\nBear, John.\nBear, Andrew.\nBear, James.\nBear, Paul.\nBird, Fred.\nCook, John.\nCharles, Joseph.\nCharles, Edward.\nCharles, Amos.\nCharles, Thomas.\nCharles, David.\nCharles, James, snr.\nCharles, James, jr.\nCharles, Edward, jr.\nCharles, Joseph, jr.\nCharles, William.\nCharles, Edward, jr.\nEmeneau, Adam.\nEye, James.\nHunt, Joseph.\nHalket, James, snr.\nHalket, James, jr.\nHalket, Andrew.\nKennedy, William.\nMariestee, D., snr.\nMariestee, D., jr.\nMcLeod, Angus.\nMcLeod, John.\nMcKenzie, Philip.\nMcKenzie, Philip, jr.\nMcKenzie, Thomas.\nMcKenzie, Alex.\nMcKenzie, Andrew.\nMcKenzie, Alex., jr.\nMcKenzie, Robert.\nMcKenzie, Hector.\nMcKenzie, Dan.\nMcKenzie, Andrew, jr.\nRat, William.\nRat, Daniel.\nRoss, James.\nRoss, John.\nRoss, Peter.\nRoberts, James.\nRoberts, Moses.\nRoberts, Stephen.\nRoberts, Glen.\nRoberts, John.\nSinclair, John E.\nVenn, James, trader.\n\nBIRCH RIVER.\n\nBell, Peter.\nBell, John.\nBuck, Isaiah.\nBuck, Charles.\nBuck, Peter.\nBuck, Patrick.\nBuck, J. B.\nBuck, A.\nBuck, Matthew.\nBuck, Thomas.\nBloomfield, Z.\nBloomfield, Benjamin.\nCochrane, T.\nGordon, Isaiah.\nLathlin, Robert.\nPelley, Simon.\nPelley, Adam.\nPelley, John.\nWilson, D.\nThe French Settlements.\n\nBesides the French Canadians and Metis who are scattered throughout the outlying districts of Saskatchewan, there are five French settlements, or Missions, located on or near the South Branch of the Saskatchewan river. Of those settlements St. Laurent is the oldest. It was originally composed of those plain hunters who used to meet and pass the winter on the South Branch a little above what is now known as Fish Creek. It was subsequently augmented by the arrival of other plain hunters from the south, and by emigrants from Manitoba, who spread themselves along the river from Fish Creek to what is now known as St. Louis de Langevin. Numbers also settled around what is now known as Duck Lake, or Stobart, and some around Fort Carleton. St. Laurent mission was established in 1873 by Rev. Pere Andre, now at Calgary. The Duck Lake mission was also established by Rev. Pere Andre in 1874. Rev. Pere Touze is now in charge of the mission. He also teaches the school. The mission of St. Antoine, Batoche, was established in 1882, the first resident missionary being Rev. Pere Vegerville, now of St. Albert. This mission is now in charge of Rev. Pere Moulin. The mission of St. Louis de Langevin was established in 1886, by Rev. Pere Lecoque, who also has charge of the Fish Creek mission. A postoffice has recently been opened in this latter settlement on section 42, township 40, range 2 west of the third meridian, called Alvena. There are schools in all the settlements except the latter. There is a postoffice at St. Laurent mission, a telegraph office and a store. Rev. Pere Fourmond has charge of the postoffice. There is a postoffice at Duck Lake known as Stobart, and a trading post kept by Wm. Stobart & Son, and managed by W. H. Mitchell. There is also a gristmill, at which excellent flour is made. There are three stores at Batoche mission, a postoffice and a saloon. There is a store at McDougall's crossing, St. Louis de Langevin, and a postoffice known as Bouchere has recently been opened on sec. 11, tp. 45, range 27.\n\nThroughout the above settlements the soil is of good quality, and wood, hay and fresh water are abundant. In fact, no more desirable field for farming and stock raising could be found. Cattle and horses are numerous. W. H. Mitchell, of Duck Lake, established a ranche in that settlement a couple of years ago, and has been continually adding to his stock of thoroughbred horses and cattle. Last year very little farming was done by the Metis with the exception of those of St. Louis de Langevin, who all had good crops and are in a fair way to become independent. Mail arrives at Bouchere from Batoche, and returns every Monday.\n\nFish Creek and Batoche will always be memorable as having been the scenes of the struggles between the Metis under Louis Riel and the Canadian troops under Gen. (now Sir Frederick) Middleton, in the spring of 1885.\nST. LAURENT.\n\nSt. Laurent is in tp. 44; range 1 west of the third meridian Postoffice, Grandy.\n\nBosquet, J., Baptiste, 24 44 29 w 3.\nBrequet, Louis, 10 44 7 w 3.\nBoyce, William, r lot 9.\nBoyce, J. D., trader.\nBreland, Gilbert, r lot 8.\nCaron, Theo., r lot 52.\nCaron, John, sur., r lot 63.\nCaron, John, Jr., r lot 52.\nChamberlain, Phillip, 14 44 28.\nChampagne, Ed., r lot 44.\nChampagne, Cleopas, r lot 43.\nChampagne, Ambrose, r lot 42.\nDelorme, Norbert, r lot 50.\nDelorme, Wm., r lot 50.\nDumas, Isidore, r lot 69.\nDumont, Elise, r lot 15.\nDumont, Patrice.\nFayant, Cathbert, r lot 34.\nFayant, Jatroine, r lot 34.\nFayant, Chas., r lot 36.\nFayant, Wm., r lot 36.\nFerguson, Leon, r lot 2.\nFerguson, Antoine, r lot 24.\nFisher, Geo. W., r lot 46.\nFlorin, Alex.\nFortmond, Rev. Père, J.A.V., O.M.I., 16 44 1.\nGarneau, Agathe, 10 44 28.\nGariepy, R., r lot 34.\nGervais, Pierre, r lot 29.\nGervais, Alex., r lot 29.\nGervais, John B., r lot 27.\nGervais, Isidore, r lot 29.\nGervais, Napoleon.\nGiraud, Hughes, 27 44 1.\nLafontaine, C., r lot 33.\nLafontaine, Edward.\nLetendre, Xavier, r lot 47.\nLetendre, Baptiste, r lot 47.\nLetendre, L., r lot 59.\nLetendre, Andrew, r lot 1.\nLetendre, Charles, sur.\nLavoigne, Aug., 2 44 38.\nLoubette, Moses, r lot 11.\nLoubette, John, 19 44 1 w 3.\nLemay, Joseph, 27 44 1.\nParenton, P., sur., r lot 41.\nParenton, Louis, r lot 43.\nParenton, Moses, r lot 40.\nParenton, John Baptiste, r lot 30.\nParenton, Gabriel, sur., 27 44 1.\nParenton, Gabriel, Jr., 27 44 1.\nParenton, Joseph, 27 44 1.\nPichon, Bartholomew, r 54.\nPichon, Alex., r lot 70.\nPichon, Joseph, sur., r lot 67.\nPichon, Joseph, Jr., r lot 67.\nRacette, Charles, r lot 6.\nShort, James, 2 44 1 w 3.\nSmith, Gabriel, r lot 32.\nSt. Germain, Fred., r lot 32.\nThomas, Chas., r lot 49.\nVienne, Solomon, r lot 55, trader.\nVienne, D., r lot 55.\n\nBATOCHE.\n\nBatoche settlement is situated in townships 42, and 43, range 20, west of the second, and range 1 west of the third meridian.\n\nBarron, J. C., freighter.\nBeaby, F., farmer.\nBelanger, Abram, 32 42 1 w 3.\nBelanger, B., 32 42 1 w 3.\nBouchere, John, 32 42 1 w 3.\nBouchere, Eugene, farmer.\nCarrier, Chas., 9 42 1 w 3.\nCharrette, D. J., 32 42 1.\nCharrette, Dan., 32 42 1.\nDubois, Ambrose, 32 42 1.\nST. LOUIS DE LANGEVIN.\n\nSt. Louis de Langevin comprises tps. 44 and 45, ranges 27 and 28, west of the second meridian. Postoffice, Bouchere.\n\nBoyer, Magloire, 10 44 28.\nBoyer, John Baptiste, 9 45 27.\nBoyer, Napoleon, 9 45 27.\nBouchere, John Baptiste, 11 45 27.\nBovchere, Solomon, 11 45 27.\nBremner, Moise, 10 54 27.\nBremner, Alex., 5 45 27.\nBremner, Joseph, 6 45 27.\nDougall, Capt., storekeeper.\nFiddler, Frederick, 9 45 27.\nFiddler, George, 5 45 27.\nFontaine, Louis, 12 45 27.\nGordon, Wm., 36 45A 27.\nGareau, Izoire.\nGodart, Baptiste.\nHoey, Capt., 2 45A 27.\nHoey, Alexander.\nLavelotte, Chas., 9 45 27.\nLavelotte, Jonas, 10 45 27.\nLavelotte, Modeste, 5 45 27.\nLepine, Maxime, 11 45 27.\nLegare, Alcide, 545 27.\nLecoque, Rev. Pere, O.M.I.\nLedrais, Ferdinand.\nLetendre, Louis.\nLeroy, Louis.\nLumsden, Thos., 24 45A, 27.\nMcDougall, Alex., jr., 12 46 27.\nMcDougall, Samuel, 12 45 27.\nMcKenzie, —.\nMcLeod, Geo., ferryman, 14 45A 27.\nNolin, Hon. Chas., 11 45 28.\nRacette, Jerome, 10 45 28.\nRegnier, Octave, school teacher, 11 45 28.\nRichard, Antoine, 10 45 27.\nSalter, Thomas.\n\nSt. Luc, Pierre, 11 45 28.\nSwain, Elzea, 10 45 27.\nTurcotte, Norbert, 11 45 28.\nToogood, John, 2 45A 27.\nYoung, Thos., 34 45A 27.\n\nDUCK LAKE\n\nDuck Lake comprises tps. 43 and 44, ranges 2 and 3, west of the third meridian. Postoffice, Stobart.\n\nAnderson, Alex.\nArcand, Jno. Baptiste, 15 44 3.\nArcand, Joseph, 16 44 3.\nArcand, Francois, 2 44 2.\nBurston, Magnus, 34 43 2.\nBosquet, Cyrille, 24 44 2.\nCardinal, Alex., 25 44 2.\nCollins, Maxime, 28 43 2.\nCharette, Joseph, jr., 21 43 2.\nCharette, Joseph, snr., 21 43 2.\nElliott, —, I.D. servant.\nFisher, Ambrose, 33 43 2.\nFleury, Patrice, snr., 13 44 2.\nFleury, Patrice, jr., 11 43 2.\nGervais, Noel, 14 44 2.\nHamelin, L., 36 44 2.\nHamelin, Baptiste.\nKelley, Henry, 8 44 2.\nLedoux, Gerome, 15 44 2.\nLaframboise, Edward, 9 44 2.\nLavalle, John, 10 43 2.\nLaundry, S.\nLemarante, Alex., 20 44 2.\nLejour, Roger, 4 44 2.\nMackenzie, R. C., Indian agent.\nMcNeil, A. N., assistant Indian agent.\nMitchell, W. H.; manager Wm. Stobart & Son.\nMitchell, A., rancher.\nMorecin, Jonas.\nMarrion, Louis, 3 43 2, T. D. farm instructor.\n\nOuillette, Joseph, jr., 14 44 2.\nOuillette, Cyrien, 15 44 2.\nOuillette, C., jr., 15 44 2.\nOuillette, Julien, 22 44 2.\nOuillette, Bertrand, 14 44 2.\nOuillette, John Baptiste, 14 44 2.\n\nParenteau, Louis, snr., 2 44 2.\nParenteau, Louis, jr., 2 44 2.\nParenteau, Patrice, 2 44 2.\nPouchieche, Ambrose, 5 44 2.\nPicher, Wm., 20 43 2.\nPicher, Francois, 20 43 2.\nPrimeau, Francois.\nPrimeau, Francois, jr.\n\nRoss, John.\nRiguel, Louis, 3 43 2.\nSt. Dennis, Laude, 20 43 2.\n\nSaillant, Patrice.\nSanve, Norbert, 16 44 2.\nSansregret, John, 11 44 2.\n\nTouze, Rev. Pere Louis, O.M.I.\nTrottier, Cuthbert, 5 44 2.\nTrottier, James, 5 44 2.\nTrottier, Albert, 5 44 2.\n\nCARLTON.\n\nCarlton settlement is comprised in townships 44 and 45, ranges 3 and 4, west of the third meridian. A school was established last fall. Nothing is left of the H. B. Co. trading post, once the headquarters of the Company for the surrounding districts. A trading post is kept by Daniel Sisson on the south side of the river. The soil is good, and fuel, fresh water and hay are plentiful. It is a good country for stock raising, particularly sheep. Willoughby is the nearest postoffice.\n\nAnderson, Caleb.\n\nAnderson, William.\nArcand, Baptiste.\nBird, Philip, 10 45 4.\nBourass, Alex.\nBeads, Thomas.\nCarter, Gilbert, rancher, s e 18 44 4 w 3.\nDelorme, Chas., 2 45 4.\nDiehl, William, sheep rancher, n w 18 44 4 w 3.\nDelorme, Baptiste, 14 45 4.\nD'Amour, Baptiste.\nFiddler, John, 14 45 4.\nGunville, Theo.\nIsbister, George, 20 45 3.\nLucien, Toussant, 15 45 4.\nLucien, Daniel, 10 45 4.\nLaroque, Baptiste.\nLavalliea, Charles, snr., 6 45 4.\nLavalliea; Charles, jr., 6 45 4.\nLafonde, Cyril, 15 45 4.\nLavire, Francois.\nDedoux, James.\nLavalle, Charles.\nLavalle, Philip.\nLavalle, John.\nMcKay, D.\nMcKay, Wm., 32 44 3.\nMcKay, C. A., 20 45 3.\nMcKay, Archibald.\nMcKay, G. B.\nMcKay, Isidore.\nMcKay, Jerry, 18 46 3.\nPaul, John.\nPrimeau, Baptiste, snr., 45 4\nPrimeau, Baptiste, jr.\nPrimeau; Francois.\nRacette, Wm.\nSissons, Daniel, trader.\nSpears, John, 4 44 4.\nSwan, William.\nSmith, Samuel, 30 45 3.\nA. MACDONALD & CO.,\nINDIAN TRADERS,\nAND GENERAL\nMERCHANTS,\nBattleford, Sask.\nBUSINESS DIRECTORY\n\nOF\n\nThe Town of Battleford.\n\nSituation—The Town of Battleford is situated on the south side of the Saskatchewan river, a little west of the junction of the former with the Battle river. The original location of the town was on the Battle river, about a mile from the Saskatchewan, where the Northwest Government buildings were erected in 1877. In its primitive days it was known as Telegraph Flat. While the original site of the town was not without its attractions, the site of the present town, or North Battleford, is perhaps unequalled for beauty and natural advantages in the Northwest. Situated on the high ground which divides the two rivers, and which slopes gradually to the north, south and east, it will require no great engineering skill to keep streets and cellars dry, while its proximity to two rivers guarantees water for all purposes. Like all towns in the Northwest, it presents a somewhat irregular appearance, and is built almost entirely of wood. Wooden buildings of the cheapest character, however, mark the first stage in the career of a western town—the stage of uncertainty—out of which Battleford, notwithstanding the removal of the seat of Government to Regina, the destruction wrought by the Indians in the spring of 1885, and other difficulties, is slowly but surely advancing. The population of the town is about 500, equally divided between English and French.\n\nAdvantages—Battleford is connected during the season of navigation with all points on the Saskatchewan, and good trails lead to Ft. Pitt, Prince Albert, and Swift Current, on the C. P. R., from which latter point the mail arrives weekly. It is surrounded by a good country for farming and stock raising. There are, of course, bad, or what appear to be bad, sections, as is the case in all countries. Sufficient good land, however, is to be found to make homes for many thousands of industrious farmers within easy distance. The crops last year were excellent, every variety of grain and vegetables having been successfully raised.\nand the yield per acre being equal to that of any other section of the Northwest. For stock raising, also, the Battleford district affords ample scope. Good locations for ranches are to be found on all sides of the town, where grass and fresh water are abundant. For this purpose the Dagle Hills, lying to the south, and extending eastward along the Saskatchewan, cannot be surpassed. Already a large number of thoroughbred horses, cattle and sheep have been imported, and each year will add to their numbers. Lack of railway communication with the east is a drawback to the place. But even with this difficulty to contend with the farmers of the district are better off than those who live in the south, where the price of produce is low, timber for building, fencing and fuel is dear, and water scarce. They have everything at hand but a market for their surplus, which will be supplied in a couple of years at most.\n\nStores.—Battleford has four general stores, all of which carry heavy stocks, and one of which does a banking business; one drug store, one watchmaker and jeweller, and one butcher shop.\n\nIndustries.—One saw and gristmill, three blacksmith shops, one tinsmith shop, one bakery, two breweries, one brickyard, one cabinet shop, one paint shop, and one millinery.\n\nSchools.—There are two public schools, one Roman Catholic and one Protestant, both under charge of qualified teachers and well attended. An Industrial School was established in the old Government buildings last year, for the education of Indian children from the reserves, which is doing good work under the direction of Rev. Thomas Clarke.\n\nChurches.—There are three churches—English, Roman Catholic and Presbyterian—all of which are substantial buildings, and are in charge of resident missionaries.\n\nNewspapers.—The Saskatchewan Herald, edited and published by P. G. Laurie.\n\nHotels.—There are three hotels, the Pioneer, Arcand and Albion, and three saloons.\n\nSocieties.—Masonic Lodge, Agricultural Society, Rifle Association, Ladies' Missionary Association, and Temperance Society.\n\nPublic Offices.—Besides being the headquarters of the Mounted Police of the western portion of Saskatchewan, and being the source of supply for a large Indian population, Battleford has a resident Indian agent, assistant agent, and clerk; Dominion Lands agent, Crown Timber agent, Registrar, Inspector of Public Works, Deputy Clerk of the Supreme Court, and Deputy-Sheriff. It is also the headquarters of the Government telegraph system of the Northwest, and the residence of the District Superintendent, agent, sub-agent, and repairers.\nMAHAFFY & CLINKSKILL,\nINDIAN TRADERS,\nAND GENERAL\nMERCHANTS,\nBattleford, Sask.\nCOWAN & RICHARD,\nGENERAL MERCHANTS,\nAlbion Hotel Block, Main St.\nBattleford, Sask.\n\nALBION HOTEL,\nMAIN STREET,\nBATTLEFORD, SASK.\nBest Beer, Cider and Cigars Always on Hand.\nRooms Large and Comfortable.\nBOARD EQUAL TO ANY EASTERN HOUSE,\nTerms, $1.50 per day. Regular boarders, $6 per week.\nJOHN DILL, Proprietor.\nBattleford Business Directory.\n\nAdvocates, Etc.\nRichard, Edouard, Advocate.\nForget, A. P., Notary.\nLaurie, Wm., Notary.\n\nAuctioneer.\nBarker, W. J., Main-st.\n\nBaker.\nDery, Louis, 25th street.\n\nBanker.\nMacdonald, A.\n\nBrewers.\nGräff, Jacob, Main-st.\nRobinson & Cline.\n\nBlacksmiths.\nBrunel, Eugene.\nMackenzie, Alex.\nLatour, William.\n\nBrickmaker.\nDewan, Thomas, South Battleford.\n\nButchers.\nMcGregor & Gallagher.\n\nContractors and Builders.\nMcDonald, R. C., 24th-st.\nSully, J. H., 1st ave.\n\nCabinetmaker.\nClouston, Geo. H.\n\nDrugs and Medicines.\nMacKay, Dr. A. B., Main-st.\n\nGeneral Merchants.\nCowan & Richard, Main-st.\nMacdonald, A., Main-st.\nH. B. Co., Main-st.\nMahaffy & Clinkskill, Main-st.\n\nHotels.\nAlbion, Main-st., John Dill, prop.\nArcand, cor. 25th st. and 1st ave., Damaise Arcand, prop.\nPioneer, Main-st., Wm. Latimer, prop.\n\nInsurance Agent.\nSchneider, A. C., Main-st.\n\nLivery Stable.\nPioneer, Wm. Latimer, prop.\n\nMillowners.\nPrince Bros., props. Battleford Grist and Sawmill.\nOliver, J. G.\nClink Bros.\n\nNewspaper.\nSaskatchewan Herald, established 26th Aug., 1878, and first newspaper published west of Winnipeg. P. G. Laurie, Editor and Proprietor.\n\nMilliner and Dressmaker.\nLarkins, Mrs., Main-st.\n\nPainter.\nClouston, D. A.\n\nPhotographer.\nHead, H., Main-st.\n\nSaloons.\nFirst and Last Chance, South Battleford, T. Mitchell, prop.\nSouth Battleford Saloon, Baptiste Sayer, prop.\nClub Saloon, Albert Wm. Thom, prop.\nThe New Saloon, Jacob J. Graff, prop.\n\nSurveyor.\nLaurie, R. C., D.L.S., C.E.\n\nTinsmith.\nDulmage, Robert, Main-st.\n\nWatchmaker and Jeweller.\nMillie, H. H., Main-st.\nG. H. CLOUSTON,\nBATTLEFORD, SASK.\nUpholsterer, Cabinet Maker\nAND UNDERTAKER,\nDealer in and Manufacturer of All Kinds of Furniture.\n\nA Large Stock of Undertakers Requisites Always on Hand.\n\nChiffoniers, Writing Desks, Glass Cases, Lodge Furniture, Etc., made to order.\n\nRepairing Done on Shortest Notice.\nEstimates furnished on application. Workshop 25th Street.\n\nTHE CLUB SALOON,\nBATTLEFORD, SASK.\n\nPool, Billiards, Choice Cigars and Sparkling Beer\n\nTo be had at the Club Saloon.\n\nA. E. THOM, Proprietor.\nDR. A. B. MACKAY,\nCHEMIST AND DRUGGIST,\nSTATIONER, ETC.\nMAIN STREET,\nBATTLEFORD, SASK.\n\nBATTLEFORD BREWERY.\nJACOB GRAFF,\nPROPRIETOR.\nThe Oldest Brewery in Battleford.\nGood Beer and Cider!\nALWAYS ON HAND.\nFamilies Supplied in Wood or Bottle.\nJACOB GRAFF.\nBATTLEFORD MILLS!\n(Gristing and Flouring.)\n\nPRINCE BROS.,\nPROPRIETORS.\n\nLumber of all Kinds!\nALWAYS ON HAND, AND\nFor Sale at Lowest Rates.\n\nGRISTING AND CHOPPING!\nDONE ON SHORTEST NOTICE.\n\nGOOD FLOUR GUARANTEED.\n\nHIGHEST PRICE PAID FOR GRAIN.\nBattleford Alphabetical Directory.\n\nArcand, James, prop. Arcand House.\nArrowsmith, Wm.\nAtherston, Chas., trapper.\nAtkinson, Philip, labourer.\nBeath, T., teacher Protestant Public School.\nBallentine, S., freighter.\nBarker, W.; J., contractor.\nBerthuaim, Ambrose, Supt. Dom. Public Works.\nBellevue, Alphonse, farmer.\nBigonness, Rev. Pere., O.M.I.\nBigonnesse, Miss C., teacher R.C. school.\nBird, H., carpenter.\nBourne, Louis, farmer.\nBourke, Emile, farmer.\nBoulais, Medora, farmer.\nBones, O., labourer.\nBoudry, G., labourer.\nBrabant, P., labourer.\nBrewster, Geo., labourer.\nBrokovski, E., Dom. Lands Agent.\nBrunel, Eugene, blacksmith.\nBull, G. F.\nCarney, John, Assistant Indian Agent.\nCarsault, Goudaire, farmer.\nCanada, Geo., labourer.\nCarter, George, telegraph repairer.\nCline, E. J., brewer.\nClarke, Rev. Thos., Principal Industrial School.\nClink, D. L., speculator.\nClink, Tra., farmer.\nClinskill, James, of Mahaffy & Clinskill, merchants.\nClouston, George H., carpenter.\nClouston, D. A., painter.\nCochrané, J.\nCota, Michel, farmer.\nCouture, Honore, farmer.\nCowan, D., of Cowan & Richard, merchants.\nCrone, J. J., cook.\nDawson, J., labourer.\nDaniels, John, freighter.\nDaniels, Jno., H. B. Co., servant.\nDaniels, Chas., trader.\nDerval, Mrs. C., teacher R.C. school.\nDery, Louis, baker.\nDebaries, Hermon.\nDesjardins, S., mail carrier.\nDewan, Thos., contractor.\nDewan, William.\nDill, John, prop. Albion hotel.\nDonovan, Geo., clerk Mahaffy & Clinskill's.\nDucharmé, Joseph.\nElliott, Louis, labourer.\nFavel, Wm., labourer.\nFavel, Louison, labourer.\nFinley, Wm., labourer.\nFisher, E. G., labourer.\nFlamond, Louis, freighter.\nFlamond, Pierre, freighter.\nFonet, James, freighter.\nGagne, Jules, carpenter.\nGallagher, Con., of McGregor & Gallagher, butchers.\nGadaise, Julien, farmer.\nGariepy, Chas., freighter.\nGaudaire, Edouard, farmer.\nGardiner, G. W., trapper.\nGenese, Herbert, farmer.\nGilbert, G. W., I. D. servant.\nGibborne, Hartley, District Supt. Dom. Telegraph.\nGerrand, Pierre, freighter.\nGoudry, Francois, labourer.\nGoulet, Louis, freighter.\nGrass, Jacob, farmer.\nGuthrie, R., shoemaker.\nGuthrie, Richard, farmer.\nHardy, H., labourer.\nH'eon, Severe, farmer.\nH'eon, James, farmer.\nHetherington, D., labourer.\nHeureux, Moise, farmer.\nHodson, Thos., freighter.\nHolm, Chas. J., freighter.\nHouse, Thos., labourer.\nHourston, Wm.\nHourston, John.\nHughes, J. D.\nInce, Robert, labourer.\nJackson, Gideon, labourer.\nJohnson, E., clerk.\nLafond, Basil, freighter.\nLaJoie, Sobyesame, farmer.\nLamoine, William.\nLatimer, W., prop. Pioneer hotel.\nLatour, W., blacksmith.\nLarkins, L. C., contractor.\nLaronde, Louis, Interpreter.\nLaurie, P. G., prop. Saskatchewan Herald.\nLaurie, Wm., I. D., clerk.\nLaurie, R. C., D.L.S., C.E.\nLavallie, Chas., freighter.\nLawson, Bruce A., bookkeeper A. Macdonald's.\nLee, George, butcher Magregor & Gallagher's.\nLemoure, Francois, labourer.\nL'Heroux, Peter, farmer.\nLongmore, John, freighter.\nLoscombe, H. C., clerk.\nLucien, Basil, labourer.\nMcBeath, Wm., teamster.\nMcGregor, R., of McGregor & Gal- lager, butchers.\nMcKay, W., Junior Trader H. B. Co.\nMcKew, F.\nMcLellan, James.\nMcNabb, James, labourer.\nMcNichol, J.\nMcPhail, J.\nMacdonald, R. C., contractor.\nMackay, Dr. A. B., chemist and druggist.\nMackenzie, A., contractor.\nMackenzie, Alex., blacksmith.\nMacleanegan, H. C., Government telegraph operator.\nMahaffy, Thos., of Mahaffy & Clinkskill, merchants.\nMannix, H. A., saloonkeeper.\nMarchand, G., freighter.\nMarrigold, Fred., accountant.\nMaskal, Patrick, freighter.\nMatheson, R. K., brickmaker.\nMeredith, M. H., carpenter.\nMeroler, George, clerk.\nMillie, H. H., watchmaker.\nMillie, Chas., storekeeper.\nMiller, Angus.\nMitchell, T., saloonkeeper South Battleford.\nMorin, Simon, carpenter.\nMontgomery, H. J., timber ranger.\nMorton, E., freighter.\nNault, Andre, freighter.\nNeilson, W. G., bookkeeper Mahaffy & Clinkskill's.\nNolin, Adolph, freighter.\nNolin, D., freighter.\nNolin, Joseph, contractor.\nO'Keefe, Laurence, farmer.\nO'Neil, J. D., farmer.\nOliver, J. G., millowner.\nOtton, Frank W., mailcarrier.\nOuillette, Patrice, farmer.\nOuillette, Chas., labourer.\nPambrum Isidore, labourer.\nPambrum, John, farmer.\nPanard, Alex., freighter.\nParker, Henry, freighter.\nParker, Joseph B., H. B. Co. bookkeeper.\nParker, J. L. D., dairyman.\nPark, Thos., blacksmith.\nPeterson, Wm., clerk Mahaffy & Clinkskill's.\nPhilips, C., labourer.\nPhilips, H., farmer.\nPlante, M., freighter.\nPlante, Basil, freighter.\nPoitra, D., freighter.\nPruden, Geo., freighter.\nPrebette, Geo., freighter.\nPrimeau, Adolphe, freighter.\nPrimvain, Francois, freighter.\nPrince, Benjamin, millowner.\nPritchard, Rev. J. F., English Church missionary.\nReid, J. A.\nRichard, Emile, of Cowan & Richard, merchants.\nRichard, Edouard, Advocate.\nRichardson, H., Postmaster, Deputy Clerk Supreme Court, and D. G. telegraph agent.\nRivard, Victor, farmer.\nRobinson, Geo., of Robinson & Cline, brewers.\nRoss, Chas., freighter.\nSchneider, A. G., Insurance agent.\nScott, W. J., Registrar.\nSmith, Chas., pensioner.\n\nSully, J. H., contractor.\nSkelton, J. M., farmer.\nSykes, Henry, telegraph repairer.\nStuart, James, cook.\nSmith, George, mailcarrier.\nSmith, D., baker.\nSpencer, W., teamster.\nSpeers, R. G.\nStewart, John, H. B. Co. clerk.\nSmith, Alex., labourer.\nSayer, Louison, farmer.\nSimpson, S. S.\nSayer, Baptiste, saloonkeeper.\nStevenson, James, trader.\nTodd, William, trader.\nUple, Joseph, freighter.\nVillbrum, Daniel, trader.\nWeatther, J.\nWilliamson, Chas., manager A. Macdonald's.\nWilliams, Wm., brewer.\nWilliams, P. J., Indian agent.\nWoodward, H. S.\nYoung, M., clerk A. Macdonald's.\n\nH. H. MILLIE,\nWatchmaker and Jeweller!\nBATTLEFORD, SASK.\n\nDirect Importer of Fine Gold Jewelry, Silver Plated Ware, Watches, Clocks, etc.\n\nAgent for the Celebrated Raymond Sewing Machine.\nDERY'S BAKERY,\nOpp. Arcand House,\nBATTLEFORD, SASK.\n\nThe Best of Bread and Cakes always on hand.\n\nLOUIS DERY,\nPROPRIETOR.\n\nMRS. LARKINS,\nFASHIONABLE\nDress and Mantle Maker,\nMAIN STREET,\nBattleford, Sask.\n\nDresses Cut in the Latest Fashion.\n\nPlates Always on Hand.\n\nCutting & Fitting a Specialty.\nThe Pioneer Boarding House,\nLivery and Feed Stable,\nTWENTY-THIRD STREET,\nBATTLEFORD, SASK.\nWM. LATIMER, Proprietor.\n\nPUBLIC HALL,\n(24 x 44) and\nINTELLIGENCE OFFICE,\nIN CONNECTION.\n\nSAYER'S SALOON,\nSouth Battleford, Sask.\n\nBest of Beer, Cider and Cigars\nAlways on Hand.\n\nBAPTISTE SAYER,\nPROPRIETOR.\nEDOUARD RICHARD,\nBarrister, Notary Public, Etc.,\nBATTLEFORD, SASK.\n\nWM. LAURIE,\nNotary Public for N. W. T.\nBATTLEFORD, SASK. TER.\n\nR. C. LAURIE,\nD. L. S. & P. L. S. (Manitoba.)\nBATTLEFORD, SASK.\n\nR. W. DULMAGE,\nManufacturer of\nTin, Copper & Sheet Iron Ware,\nBATTLEFORD, SASK.\nDealer in Stoves.\nFITTING A SPECIALTY.\n\nA. MCKENZIE,\nBLACKSMITH\nAND\nGeneral Machinist,\nBATTLEFORD, SASK.\nReapers, Mowers, Plows, Guns, etc.,\nRepaired on Shortest Notice.\nBuckboards and Wagons Made\nto Order.\nHorse Shoeing a Specialty.\n\nR. C. MACDONALD,\nBATTLEFORD, SASK.,\nContractor & Builder\nAll Kinds of Fitting Done.\nWorkshop on 24th Street, near A.\nMacdonald's Store.\nOrders may be left at H. H. Millie's.\n\nJOHNSTON & FORBES,\nBarristers, etc.,\nREGINA AND MOOSOMIN.\n\nMcPhillips, Wilkes & McPhillips,\nBARRISTERS, ETC.\nOffice, Hargrave's Block, Main St.,\nWINNIPEG, MAN.\n\nR. DUNDAS STRONG,\nBarrister & Notary Public,\nQU'APPELLE STATION, ASSA.\n\nMcPHILLIPS BROS.,\nDominion Land Surveyors and\nCivil Engineers,\nOffice, Biggs' Block, Main St.\nWINNIPEG, MAN.\nBattleford District Alphabetical Directory.\n\nThe following list contains, as near as possible, all the settlers in the district outside of the town of, and whose post office is, Battleford.\n\nApplegarth, Herbert, rancher.\nApplegarth, Geo. C., Farm Instructor on Moosomin's reserve.\nApplegarth, Miss, school teacher on Moosomin's reserve.\nArcand, Euchere, farmer.\nArcand, —., farmer.\nBaker, L. E., of Baker & Prongua, ranchers, w 34 43 18.\nBallendine, Fred., s w 10 42 16.\nBaudette, Louis, n w 10 43 16.\nBernier, Joseph, s e 2 44 16.\nBird, James, s e 34 42 18.\nBourassa, Emile, n 18 44 15.\nBreland, Zeb.\nBremner, Andrew, farmer.\nBremner, Chas., farmer.\nBurk, F. A. D., s e 33 46 16.\nBruno, Josephine, 24 43 17.\nCassault, Godfrey, farmer.\nCochin, Rev. Pere, O.M.I., R. C. mission, Poundmaker's reserve.\nCopplette, L.\nCraig; John, n w 2 43 16.\nCummings, Wm., s e 10 43 16.\nDaunais, Chas. M., w 26 42 16.\nDaudlin, Pierre, school teacher on Poundmaker's reserve.\nDecoteau, P., n w 3 42 16.\nDucharme, P., n e 18 44 15.\nDucharme, Alex.; s e 16 44 15.\nDucharme, Jas.; s w 16 44 15.\nDucharme, Joseph, n e 9 43 16.\nEnoult, James, farmer.\nForget, A.-P., s w 36 43 17.\nFinlayson, John D., s e 5 44 17.\nFinlayson, Rorie, of Finlayson & Macdowall, ranchers.\nFinlayson, D. M., 5 44 17.\nFitzpatrick, John, farm instructor Sweet Grass reserve.\nForest, Joseph, n w 33 44 17.\nGopsel, Geo., farm instructor Pound maker's reserve.\nHerbert, Gennesse, n e 4 45 17.\nHarper, G. H., n w 3 42 17.\nHope, Henry, school teacher Sweet Grass reserve.\nHope, W. J., I. D. interpreter Little Pine reserve,\nHutchings, Thos., e 32 46 20.\nJefferson, R., n e 3 42 16.\nJefferson, H., trader.\nLaplatte, Patrice, farmer.\nMacdowall, Claude, of Finlayson & Macdowall, ranchers, Eagle Hills.\nMosse, Assene, n 32 42 15.\nMcConnell, Miss., teacher, Stoney reserve.\nMcFarlane, J. M., of McFarlane & Bros., ranchers, Eagle Hills.\nMcFarlane, Thomas, of McFarlane Bros., ranchers, Eagle Hills.\nNash, H. H., s e 19 42 17.\nOrr, Oscar, farm instructor Stony reserve.\nPambrum, P. C., n w 23 44 18.\nPotrais, Joseph, 28 42 15.\nProngua, A. J., of Baker & Prongua, ranchers, 33 43 18.\nPrince, Joseph G., s w 28 42 17.\nPrince, Hector, n w 22 42 17.\nPrevost, Regis, n w 36 43 16.\nPrice, Joseph, farm instructor Red-Pheasant's reserve.\nPrice, Mrs. Joseph, school teacher Red Pheasant's reserve.\n\nRose, Jonathan, n e 12 44 18.\nRouleau, Ed., H., s e 24 43 17.\nRichard, Philip, s e 35 41 16.\nSalisbury, W. G., telegraph operator Henrietta, 39 8 w 3.\nSufferin, Andrew, n w 12 44 18, farm instructor Thunderchild's reserve.\nSpeers, R. G., e 28 42 16.\nSmith, Chas., n w 32 43 17.\nSavard, Alex., s w 34 44 17.\nSpeers, R. H., s e 16 42 16.\nSlater, T. J.\nSayer, H.\nTabor, A. E., farmer.\nTurner, Wm., s e 2 44 17.\nThibault, Michael, n e 10 42 16.\nTompkins, Peter, assistant farm instructor Poundmaker's reserve.\nWyld, Robert, of Wyld & Burk ranchers, s w 33 43 16.\nWarden, Stephen, rancher, Eagle Hills.\n\nBRESAYLOR.\nBresaylor settlement is comprised in tps. 45 and 46, ranges 19 and 20, west of the third meridian and is about twenty-five miles north-west of Battleford. It is bounded on the north by the North Saskatchewan river and on the south by the Battle river. The settlers are mostly all from Kildonan, and came to the Saskatchewan country about five years ago. A school district was established lately and a school opened. The soil within this tract is good, and timber, hay and fresh water are plentiful. All the settlers had good crops last year, and most of them have large herds of cattle. Missionaries from Battleford visit the settlement at stated intervals.\n\nPostoffice, Bresaylor.\n\nChisholm, Alex., n w 14 46 19.\nCinnamon, Thos., s 28 46 19.\nCinnamon, H., snr., 28 46 19.\nCinnamon, H. J., 28 46 19.\nClink, Mrs. D. L., teacher Bresaylor school.\n\nDucharme, N., n e 34 45 19.\nMcDonald, Philip, n e 19 46 19.\nPruden, Camellias, s w 7 46 19.\nSayers, Cleophas, s w 35 45 16.\nSetter, Alex., n w 18 46 19.\nSpencer, Edward, s w 19 46 19.\nSpencer, Geo, n e 24 46 20.\nTaylor, Alex., s e 21 46 19.\nTaylor, David, n w 21 46 19.\nTaylor, Peter, n w 20 46 19.\nTaylor, H. C., n e 15 46 19.\n\nFORT PITTS.\nFort Pitt is on the north side of the North Saskatchewan, ninety-three miles north-west of Battleford. It is a very old H. B. Co. post. It was nearly all destroyed by Big Bear's band in the spring of 1885. A police barracks has since been built and a telegraph office opened. The inhabitants are principally Halfbreeds and Indians. The boats call regularly during the season of navigation, and a mail stage arrives every two weeks from Battleford.—Fort Pitt will be memorable as having been the place of meeting between the forces under Generals Middleton and Strange in the spring of 1885.\n\nDufresne, Ed., H. B. Co. servant.\nDufresne, Francois, H. B. Co. clerk.\nDufresne, H., H. B. servant.\nGerome, Henry.\nGladow, William, trapper.\nHarkness, Piévre, trapper.\nHarkness, John, trapper.\nMcDonald, Malcolm, H. B. servant.\nMcKay, Angus, H. B. Co. junior trader.\nMcDonald, H., telegraph operator.\nPritchard, John.\n\nCOLD LAKE.\nCold Lake is about seventy miles north of Fort Pitt. The inhabitants of that region are principally Chipewyans. A Roman Catholic mission was established at Cold Lake in 1844 by the late Rev. Pere Thibault. The Indians are very industrious, and live by hunting, fishing and agriculture. They have a large number of horses and about 150 horned cattle. They number about 140 souls. Rev. Pere Legoff is in charge of the mission.\n\nONION LAKE.\nOnion Lake is just twelve miles north of Ft. Pitt. There is an Indian reserve at that place, of which Geo. Mann is agent, having Mr. Vankoughnet, late of Duck Lake, for his clerk. The Indians, remnants of Big Bear's band, are now quite docile, and are making rapid headway in agriculture. A Roman Catholic mission was established there some years ago, of which Rev. Pere McGee is in charge. The Indians number about 170 souls in all.\n\nFROG LAKE.\nFrog Lake is about forty miles north-west of Fort Pitt. It was, as will be remembered, the scene of the massacre by Big Bear's band in the spring of 1885. There is an Indian reserve, on the west shore of the lake.\n\nTHE ARCAD HOUSE,\nCorner Twenty-fifth Street and First Avenue.\nBATTLEFORD, SASK.\n\nDAMASE ARCAD,\nPROPRIETOR.\n\nThe Largest and Most Comfortable Hotel in the Battleford District.\n\nTerms, $1 per Day; $6 per Week for Regular Boarders.\n\nStable in Connection.\nTHE PIONEER PAPER\nIn the North-West Territories.\n\nESTABLISHED 1878.\n\nThe Saskatchewan Herald,\n\nPUBLISHED WEEKLY AT\n\nBattleford, Saskatchewan Territory,\n\nAND CIRCULATED EVERYWHERE.\n\nREADABLE AND RELIABLE AS A NEWSPAPER.\n\nIts aim is to advocate the best interests of the Territories at large.\n\nAs an organ of Local News it is unrivalled.\n\nA most acceptable gift to friends abroad.\n\nEvery one interested in Saskatchewan will find it well worth more than it costs.\n\nSubscription Price: $2.50 per annum,\nPayable in Advance.\n\nAdvertising Rates: Transient, 10c. per line for the first insertion, and 5c. a line for each subsequent insertion; contract advertisements, per inch per annum, $8.50.\n\nAddress,\n\nP. G. LAURIE,\nBattleford, Saskatchewan Ter., Canada.\nManitoba and Northwestern Railway Co.\n\nFREE FARM LANDS\n\nIN MANITOBA AND\n\nThe North-West Territories\n\nCan be obtained near Stations and Thriving Villages along the Line of this Road in Well Settled Districts with Good School Accommodation.\n\nROLLING PRAIRIE DOTTED WITH BLUFFS.\n\nGOOD SOIL AND WATER.\n\n160 acres for $10.00 (Government fee).\n\n2,750,000 Acres of Farm Lands for Sale.\n\n$2.50 to $5.00 per acre will purchase some of the Finest Farm Land in Manitoba and the Northwest along the Line of this Road in the Park Lands of the Fertile Belt.\n\nWithout Cultivation or other Restrictions.\n\nFor Maps, Guide Books or other information apply to\n\nA. F. EDEN,\nLAND COMMISSIONER,\n622 Main Street, Winnipeg.\nDominion Lands Regulations.\n\nUnder the Dominion Lands Regulations all surveyed even-numbered sections, excepting 8 and 26, in Manitoba and North-West Territories, which have not been homesteaded, reserved to provide woodlots for settlers, or otherwise disposed of or reserved, are to be held exclusively for homesteads and pre-emptions.\n\nHomesteads.\n\nHomesteads may be obtained upon payment of an Office Fee of Ten Dollars, subject to the following conditions as to the residence and cultivation:\n\nIn the \"Mile Belt Reserve,\" that is the even-numbered sections lying within one mile of the Main Line or Branches of the Canadian Pacific Railway, and which are not set apart for town sites or reserves made in connection with town sites, railway stations, mounted police posts, mining and other special purposes, the homesteader shall begin actual residence upon his homestead within six months from the date of entry; and shall reside upon and make the land his home for at least six months out of every twelve months for three years from the date of entry; and shall within the first year after the date of his homestead entry, break and prepare for crop ten acres of his homestead quarter-section; and shall within the second year crop the said ten acres, and shall break and prepare for crop fifteen acres additional, making twenty-five acres; and within the third year after the date of his homestead entry he shall crop the said twenty-five acres, and break and prepare for crop fifteen acres additional; so that within three years of the date of his homestead entry he shall have not less than twenty-five acres cropped, and fifteen acres additional broken and prepared for crop.\n\nLand, other than that included in Mile Belt, Town Site Reserves and Coal and Mineral Districts, may be homesteaded in either of the three following methods:\n\n1. The homesteader shall begin actual residence on his homestead and cultivation of a reasonable portion thereof within six months from date of entry, unless entry shall have been made on or after the 1st day of September, in which case residence need not commence until the 1st day of June following, and continue to live upon and cultivate the land for at least six months out of every twelve months for three years from date of homestead entry.\n\n2. The homesteader shall begin actual residence within a radius of two miles of his homestead, and continue to make his home within such radius for at least six months out of every twelve months for the three years next succeeding the date of homestead entry; and shall within the first year from date of entry break and prepare for crop ten acres of his homestead quarter-section; and shall within the second year crop the said ten acres, and break and prepare for crop fifteen acres additional, making twenty-five acres; and within the third year after the date of his homestead entry he shall crop the said twenty-five acres, and break and prepare for crop fifteen acres additional; so that within three years of the date of his homestead entry he shall have not less than twenty-five acres cropped; and shall have erected on the land a habitable house in which he shall have lived during the three months next preceding his application for homestead patent.\n\n3. The homesteader shall commence the cultivation of his homestead within six months after the date of entry, or if the entry was obtained after the 1st day or September in any year, then before the first day of June following; shall within the first year break and prepare for crop not less than five acres of his homestead; shall within the second year crop the said five acres, and break and prepare for crop not less than ten acres in addition, making not less than fifteen acres in all; shall have erected a habitable house on the homestead before the expiration of the second year; and on or before the commencement of the third year shall have begun to reside in the said house; and shall have continued to reside therein and cultivate his homestead for not less than three years next prior the date of his application for patent.\n\nAt the time of making entry, the homesteader must declare to the Land Agent under which of the foregoing provisions he elects to hold his land; and on applying for patent must prove that he has made permanent improvements on his land, to the aggregate value of not less than one dollar and fifty cents per acre, (equal to about six shillings sterling).\n\nIn the event of a homesteader desiring to secure his patent within a shorter period than the three years provided by law, he will be permitted to purchase his homestead on furnishing proof that he has resided on the land for at least twelve months subsequent to date of homestead entry.\n\nPre-Emptions.\n\nAny homesteader may at the same time as he makes his homestead entry, but not at a latter date, should there be available land\nadjoining the homestead, enter an additional quarter-section as a pre-emption on payment of an office fee of ten dollars.\n\nThe pre-emption right entitles the homesteader to purchase the land so pre-empted on becoming entitled to his homestead patent; but should the homesteader fail to fulfil the homestead conditions, or pay for such pre-emption within six months after he becomes entitled to claim a patent for his homestead, he forfeits all claim to his pre-emption.\n\nThe price of pre-emptions, not included in Town Site Reserves, is two dollars and fifty cents per acre. Where land is north of the northerly limit of the land along the main line of the Canadian Pacific Railway, and is not within twenty four miles of any branch of that Railway, or twelve miles of any other Railway, pre-emptions may be obtained for two dollars per acre.\n\nINFORMATION.\n\nFull information respecting the land, timber, coal and mineral laws, and copies of the Regulations, may be obtained upon application to the Secretary of the Department of the Interior, Ottawa, Ontario; the Commissioner of Dominion Lands, Winnipeg, Manitoba; or to any of the Dominion Lands Agents in Manitoba or the North-West Territories.\n\nA. M. BURGESS,\nDeputy of the Minister of the Interior.\n\nTHE WANZER SEWING MACHINES!\n\nReceived the following unprecedented distinctions at the Vienna Exhibition, 1873:\n\nTWO MEDALS OF MERIT,\n\nA distinction not obtained by any other Sewing Machine at the Exhibition. ONE GRAND SILVER MEDAL for the best Family and Manufacturing Sewing Machine.\n\nThe Emperor of Austria conferred upon Mr. R. M. Wanzer, THE IRON CROSS, and knighted him with the order of FRANCIS JOSEPH THE FIRST, for his valuable services in the Sewing Machine business, which were the highest honors conferred at the Exhibition. Mr. Wanzer is the only Sewing Machine manufacturer in Great Britain or its Colonies who received those distinguished honors.\n\nThe Wanzer machines also received THE GOLD MEDAL (highest award) at the Centennial Exhibition.\n\nThe principal points in the Wanzer Family and Light Manufacturing Machines are: The large and roomy space under arm; The adjustability of their parts—the principal ones being of hardened steel; A steel feed on both sides of the needle; A triangular needle bar with oil cup; Nickel-plated balance wheel, with loose pulley; Positive take-up; Extremely light running, with little or no noise.\n\nEnquire of your local agent, or write to\n\nR. M. WANZER & Co.\nSEWING MACHINE MANUFACTURERS,\nHamilton, Ont.\nTHE CANADA NORTH-WEST LAND CO.\n(LIMITED.)\nOffer for Sale\nSELECTED FARM LANDS\nIn Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\n\nGREAT ADVANTAGES\nOffered to Purchasers.\n\nShares Now Taken at Par\nIN PAYMENT OF LANDS.\n\nThis Company is now enabled by Act of Parliament to accept its shares at par in payment for lands purchased. As shares can at present be bought at a considerable discount, those making purchases of land at once will reap great advantages. The Company's lands are scheduled at prices ranging from $5 upwards, so that purchasers paying in shares at present quotations will secure their lands at from $2.50 upwards.\n\nThe Company's Sections have been carefully selected and are all good agricultural lands, many of them in close proximity to railway stations.\n\nFor information, Prices and Maps, apply at the offices of the Company, 14 Castle street, Edinburgh, Scotland; 75 Lombard street, London, England; 181 Main street, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above-Railway\nBetween Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\nCHURCHES.\n\nCHURCH OF ENGLAND.\n\nDIocese of Saskatchewan.\n\nBISHOP:\nRt. Rev. Cyprian Pinkham, D.D.,\nD.C.L., Calgary.\n\nCLERGY:\nVen. Archdeacon J. A. Mackay,\nD.D., Emmanuel College, Prince Albert.\nVen. Archdeacon G. McKay, B.D.,\nPrince Albert.\nRev. Canon Flett, B.D., Emmanuel College, Prince Albert.\nRev. A. H. Wright, Prince Albert.\nRev. T. Clarke, Industrial School, Battleford.\nRev. J. F. Pritchard, Battleford.\nRev. Canon Newton, Ph. D., Edmonton.\nRev. Canon S. Trivett, Blood Reserve, Macleod.\nRev. H. T. Bourne, Piegan Reserve, Macleod.\nRev. R. Hilton, Macleod.\nRev. E. Matheson, Lethbridge.\nRev. G. Parke Smith, M.A., Calgary.\nRev. A.W. F. Cooper, M.A., Calgary.\nRev. R. Inkster, Sarcee Reserve, Calgary.\nRev. J. W. Tims, Blackfoot Reserve, Gleichen.\nRev. H. W. Gibbon Stocken, Blackfoot Reserve, Gleichen.\nRev. P. Badger, Devon (east of Cumberland).\nRev. J. Badger, Fort a la Corne.\nRev. R. McLennan, M.A., B.D., Cumberland.\nRev. John Sinclair, Stanley.\nRev. J. R. Settee, Grand Rapids.\nRev. J. J. Taylor, Prince Albert.\nRev. J. Hines, Assissippi, Shell River.\n\nDIocese of Moosonee.\n\nBISHOP:\nRight. Rev. J. Holden, D.D.\n\nCLERGY:\nVen. Archdeacon T. Vincent.\nRev. F. S. Clarke, M.A., Commissary in England.\nRev. H. Nevitt, Moose Factory.\nRev. E. J. Fleck, Little Whala River.\nVen. T. Vincent, Albany.\nRev. G. S. Winter, York Factory.\nRev. J. Saunders, Matuakumme.\nRev. J. Lofthouse, Churchill.\n\nDIocese of Qu'Appelle.\n\nBISHOP:\nHon. and Rt. Rev. Adelbert Anson, M.A., Qu'Appelle.\n\nCLERGY:\nRev. J. P. Sargent, M.A.; E. Matsay, licensed reader; E. T. Edmonds, Moose Jaw.\nRev. H. Tudor, Medicine Hat.\nRev. W. Nichol, Moosomin.\nRev. W. St. John Field, M.A., Moose Mountain.\nRev. J. W. Gregory, B.A., (Glenfell).\nRev. G. D. Child, Qu'Appelle.\nRev. P. K. Lyon, Fort Qu'Appelle.\nRev. H. H. Smith, Regina.\nRev. G. Cook, Round Plain, Touchwood Hills.\nRev. O. Owen, Gordon Reserve, Touchwood Hills.\nRev. Shafton F. Aggasis, Fort Pelly.\n\nROMAN CATHOLIC.\n\nDIocese of St. Albert.\n\nBISHOP:\nRt. Rev. Mgr. Vital Justin Grandin, O.M.I., St. Albert, Alberta.\nCLERGY:\n\nRev. Père A. Lacombe and H. Ledieu, O.M.I., Vicars General.\n\nRev. Père J. J. Leclercq, O.M.I., St. Albert Cathedral.\n\nRev. Père Leon Drouet, O.M.I., Blackfoot Crossing.\n\nRev. Père H. Ledieu and A. André, Calgary.\n\nRev. Père P. Blais, O.M.I., National Park.\n\nRev. H. Granville, O.M.I., Edmonton.\n\nRev. Pères Emile Legal, L. Vautier, and A. Foisy, O.M.I., Fort McLeod and the neighbouring reserves.\n\nRev. Père Z. Lysee, O.M.I., Lac St. Anne.\n\nRev. Père V. Vegreville, O.M.I., St. Christophe.\n\nRev. Père C. Tessier, O.M.I., Stony Plains.\n\nRev. Pères Gabillon and V. Pineau, O.M.I., Bears' Hill.\n\nRev. Père Bellevain, O.M.I., \"St. Thomas Duhamel.\"\n\nRev. Père Terrien, O.M.I., Notre Dame de Lourdes.\n\nRev. Père Bigonnesse, O.M.I., Battleford.\n\nRev. Père Louis Cochon, O.M.I., Eagle Hills, Battleford District.\n\nRev. Père Vital Pinard, O.M.I., Grandin (St. Laurent).\n\nRev. Père Julien Morin, O.M.I., Batoche.\n\nRev. Père P. Laroque, O.M.I., Lac la Croix (St. Louis de Langlois and Fish Creek).\n\nRev. Père M. M. Lee, O.M.I., Onion Lake.\n\nRev. Père Louis Touze, O.M.I., Sicuan (Duck Lake).\n\nRev. Père Joseph Paquette, O.M.I., Muskeg Lake, Shell River.\n\nRev. Père Dominique, O.M.I., Prince Albert.\n\nRev. Père Laurent Legoff, O.M.I., Cold Lake.\n\nRev. Pères A. Rapet, L. Dauphin, and P. Teston, Ile a la Crosse.\n\nRev. Pères M. Joseph Gaste and J. Victor Ancel, O.M.I., Cariboo Lake.\n\nRev. Père Charlebois, O.M.I., Cumberland.\n\nRev. Père Etienne Ronald, O.M.I., Pelican Lake.\n\nDISTRICT OF ASSINIBOINE (ARCHBISHOP'S SEAT OF ST. BONIFACE):\n\nRev. Père J. Decroly, O.M.I., Fort Ellice.\n\nRev. Père A. Page, O.M.I., Broadview.\n\nRev. Père St. Germain, O.M.I., Wood Mountain.\n\nRev. Père D. Gratton, Regina and westward to Medicine Hat.\n\nRev. Pères R. P. Magnan, P. Magnan, Campeau, and Brother Doyle, O.M.I., Fort Qu'Appelle.\n\nRev. Père Hugounard, O.M.I., Principal of the School of Industry, Fort Qu'Appelle.\n\nRELIGIOUS COMMUNITIES:\n\nRev. Fathers of the Order of Mary Immaculate, having charge of all the missions in the North-West and being the first to undertake the Christianization of the native tribes.\n\nSisters of Charity—Convents and Orphanages, St. Albert, Alberta; Ile a la Crosse Lake, Athabasca, and High River, Southern Alberta.\n\nMothers of the Order of Faithful Companions of Jesus—Convents, Prince Albert and Calgary. Rev. Mother Collings, Superioress, Prince Albert; Rev. Mother Green, Superioress, Calgary.\nMETHODIST CHURCH.\n\nREGINA DISTRICT:\nRev. A. Andrews, Chairman, Qu'Appelle.\nRev. F. Barnes, Wolveley.\nRev. T. H. Wilson, Monsomin.\nRev. J. Pooley, Broadview.\nRev. G. Daniel, Regina.\nRev. J. H. Howard, Prince Albert.\nRev. F. H. Glass, Battle River.\nRev. S. E. Colwill, Ft. Qu'Appelle.\nRev. W. A. Choate, Cranfield.\nRev. J. Callister, Wascana, Regina.\nP. O.\nRev. W. C. Hunt, Moose Jaw.\nRev. F. W. Hodgson, Saskatoon.\nRev. R. J. Elliott, Caribou.\nRev. G. Almack, Yorkton.\nRev. J. W. Dickson and C. S. Willis, Pleasant Forks.\n\nCALGARY DISTRICT:\nRev. J. E. Betts, Calgary.\nRev. G. H. Long, Edmonton.\nRev. J. A. McLaughlin, Victoria.\nRev. W. Bridgman, Ft. MacLeod.\nRev. John McDougall, Morley.\nRev. M. Dimmock, Medicine Hat.\nRev. J. F. Davis, High River.\nRev. J. McLean, Blood Reserve, Ft. MacLeod.\nRev. C. Teter, Maple Creek.\nRev. C. Williams, Banff.\nRev. E. B. Steinhauser, Slave Lake.\nRev. W. H. Vrooman, Red Deer.\n\nPRESBYTERIAN CHURCH:\nRev. R. Jardine, M.A., B.D., D.S., and A. Campbell, M.A., Prince Albert.\nRev. P. F. Langill, Qu'Appelle.\nRev. A. Umphlett, Regina.\nRev. J. Hegg, Battleford.\nRev. J. C. Hardman, B.D., Calgary.\n\nRev. J. Herald, Medicine Hat.\nRev. S. J. Taylor, Moose Jaw.\nRev. George Evans, Crescent Lake.\nRev. J. F. Fotheringham, Cranfield.\nRev. Hugh McKay, Broadview.\nRev. Charles McKillop, B.A., Lethbridge.\nRev. D. G. McQueen, B.A., Edmonton.\nRev. A. Robson, Ft. Qu'Appelle.\nRev. Angus Robertson, High River.\nRev. Duncan Munro, Wapiti.\nRev. W. Moore, Prophet's Reserve.\nRev. Mr. Nicholl, Broadview.\nRev. Mr. McCutcheon, Cranfield.\nRev. A. Hamilton, Whitehead.\nRev. Mr. Fisher, Lethbridge.\nRev. Mr. Hollicky, Wolveley.\nRev. Mr. Patton, Tonkwood.\nRev. Mr. McMillan, Yorkton.\nRev. Mr. Batte, Green Valley.\n\nSOCIETIES, LTD\n\nMASONIC:\nD.H.G.M., R.W.Bro. Henry Sykes, Battleford.\nKinloch Lodge, No. 16, G.R.M., A.F. & A.M., W.Bro. Rudolph Oullette, W.M., Bro. G. S. Davidson, Secretary; Bro. R. B. Way, Treasurer.\nThe above Lodge was first organized in 1830 under a charter from the Grand Lodge of Canada, Capt. Chas Young being W.M. In 1833 the charter was transferred to the Grand Lodge of Alberta, obtained from the Grand Lodge of Manitoba.\nBattle Lodge, No. 35, G.R.M., A.F. & A.M., W.Bro. G. E. Applewhite, W.M., Robert McLaughlin, Secretary.\nThe above Lodge was organized on the 14th of June, 1836. A charter\nwas granted on the 12th of Feb., 1878, when W. Bro. Montague White Frazer was elected W.M., Bro. J. Clinkskill, Treasurer, and Bro. H. J. Montgomery, Secretary.\n\nST. ANDREWS.\n\nPrince Albert—Pres., J. Stewart; Vice-President, J. F. A. Stull; Jas. McKay, Secretary-Treasurer.\n\nAGRICULTURAL.\n\nBattleford—President, D. L. Clink; Vice-President, Bruce A. Lawson; Sec.-Treas., J. M. Skelton.\n\nThis Society was first organized in 1884, Robert Wyld being first President and R. C. Laurie first Secretary.\n\nLorne District—President, William Plaxton; 1st Vice-President, W. Craig; Secretary-Treasurer, J. H. Howard.\n\nThe above Society was formed in 1884, Wm. Miller and A. H. Clarke being President and Secretary respectively. The value in money and cups awarded successful exhibitors at last year's exhibition exceeded that of any similar society in the Northwest.\n\nCarrot River—President, John Sanderson; Vice-President, G. S. Lowrie; Secretary-Treasurer, Jas. Tenant.\n\nThe above society was formed in 1886, the President and Secretary being Charles Robertson and Geo. Connors, respectively.\n\nCURLING CLUB.\n\nPrince Albert—President, J. L. Johnson; Vice-President, John McTaggart; Secretary-Treasurer, H. W. Newlands.\n\nThe above club was organized in 1882, Lt.-Col. Sproat and J. F. Kennedy being President and Secretary respectively.\n\nBRASS BAND.\n\nA brass band was organized in Prince Albert in 1883, under the leadership of Louis St. Louis, which is still in existence.\n\nLacrosse and cricket clubs were organized some years ago, the former as far back as 1880.\n\nRIFLE ASSOCIATIONS.\n\nPrince Albert—President, J. L. Johnson; 1st Vice-President, T. E. Baker; 2nd Vice-President, R. J. Pritchard; Secretary-Treasurer, S. Brewster; Assistant-Secretary, T. J. Agnew, Representative Member, J. Stewart. Executive Council—J. W. Hurd, D. Williamson, A. R. Burns, J. B. Maveety, James McKay, J. McTaggart, G. Gervais, H. W. Newlands, J. F. A. Stull and D. J. Gunn. Auditors, J. Stewart, T. N. Campbell.\n\nThe above association was formed in 1885. Last year the Dominion Government granted the association a piece of land on the north side of the river for the purpose of a rifle range.\n\nBattleford—President, Richard C. Laurie; 1st Vice-President, Major Cotton; 2nd Vice-President, H. A. Head; Secretary, H. H. Millie; Treas., B. A. Lawson; Executive Council, Deputy Adjutant-General Hartley Gisborne, P. G. Laurie, and B. A. Lawson.\n\nThe above Rifle Association was formed in 1884, Hartley Gisborne being President and R. C. Laurie Secretary.\nCORPORATION OF PRINCE ALBERT:\n\nPrince Albert was incorporated on the 22nd of August, 1885, and the first Council elected on the 1st of Nov. the same year. Mayor, Thos. McKay; Councillors, J. F. Betts, Andrew Goodfellow and G. T. Brown; Clerk, J. F. A. Stull; Assessor, A. W. R. Markley; Collector, J. D. Hannafin.\n\nCouncil for 1888—Mayor, Dr. Hugh U. Bain; Councillors, John Stewart, J. L. Johnson, R. J. McPhail, T. O. Davis, T. J. Agnew, Joseph Knowles; Clerk, J. F. A. Stull.\n\nBOARD OF TRADE\n\nPrince Albert—President, Hon. L. Clarke; Vice President, Chas. Mair; Secretary, Jos Knowles; Treasurer, T. N. Campbell.\n\nThe above Board was formed in January last, under a charter obtained from the Dominion Government, and is composed of all the representative merchants of Prince Albert, as well as others having a permanent interest in the place.\n\nDOMINION LANDS AGENTS.\n\nPrince Albert—John McTaggart, Agent, Louis Schmidt, Assistant.\nBattleford—E. Brokovski, Agent.\n\nTIMBER AGENTS.\n\nPrince Albert—J. D. Waggoner, Agent; R. S. Cook, Timber Ranger and Homestead Inspector.\nBattleford—H. J. Montgomery, Timber Ranger.\n\nINDIAN AGENTS.\n\nMistawasis Reserve—J. Finlayson, Agent.\nDuck Lake—R. C. Mackenzie, Agent; A. N. McNeil, clerk.\nBattleford—P. J. Williams, Agent; John Carney, Assistant Agent; W. Laurie, clerk.\nOnion Lake—G. G. Mann, Agent; Scott Vankoughnet, clerk.\n\nREGISTRARS.\n\nPrince Albert—Alex. Sproat.\nBattleford—W. J. Scott.\n\nNOTARIES PUBLIC.\n\nPrince Albert—Brewster & McKay, W. V. Maclise; W. H. Newlands, A. L. Sifton, W. R. Gunn.\nBattleford—Edouard Richard, A. P. Forget, W. J. Scott.\nSaskatoon—G. W. Grant.\n\nFIRE GUARDIANS.\n\nPrince Albert—R. J. Pritchard.\nDuck Lake—Louis Marion.\nCarlton—Andrew N. Patterson.\nSt Andrew’s—Alex McKay.\nCarrot River—Arthur T. Cadwallader, James Tenant, Thomas Sanderson.\nColleston—John C. Slater.\n\nGAME GUARDIANS.\n\nPrince Albert—Joseph Hannafin, Alexander McBeath.\nRed Deer Hill—Alex. Stansfield.\nPuckahn—George Tait.\nKinistino—Thos. Sanderson, A. Cadwallader, James Tenant.\nBattleford—A. P. Forget, Henry Parker and Wm. McKay.\nJUSTICES OF THE PEACE\n\nPrince Albert—Alexander Sproat, Wm. Craig, Hugh U. Bain, John F. Betts, C. F. Young, A. B. Perry, Supt. N.W.M.P.\n\nHalcro—Charles Adams.\n\nRed Deer Hill—Andrew Spence, Alexander Stansfield.\n\nBouchere—James Howie, Chas. Nolin, Jean Baptiste Bouchere.\n\nKinistino—Charles Robertson.\n\nSaskatoon—Thomas Copland, Dr. J. H. C. Willoughby.\n\nStanley Mission—John E. Sinclair.\n\nBatoche—George Fisher, Xavier Letendre.\n\nSaskatchewan—Richard Joseph Malloy.\n\nBattleford—John Catton, Supt. N.W.M.P., Hartley Gishorne, Duncan Malin and James Clinkskill.\n\nISSUERS OF MARRIAGE LICENSES.\n\nSaskatoon—Dr. J. H. C. Willoughby.\n\nPrince Albert—R. B. Way, R. Buckley, Joseph Hanafin.\n\nClarke's Crossing—R. J. Molloy.\n\nINDUSTRIAL SCHOOL\n\nIndustrial School Battleford, under the control of the English Church. Rev. Thos. Clarke, Principal.\n\nThe above school is supported by the Dominion Government, and was especially established for the education of Indian children in the English language and useful arts. Other children are also admitted at a nominal fee. It is under the control of the English Church.\n\nSUPREME COURT, N.W.T.\n\nCHIEF JUSTICE:\nLt. Col. Hugh Richardson, Regina.\n\nSASKATCHEWAN.\n\nComprising the Provisional District of Saskatchewan and the country to the north. Official residence, Courthouse and Jail, Prince Albert. Judge—T. H. McGuire. Sheriff—O. E. Hughes. Deputy-Sheriff—J. D. Hannafin. Clerk—Chouise de LaGorgendiére; Deputy-Clerk, Hugh Richardson, jr., Battleford.\n\nEASTERN ASSINIBOIA.\n\nComprising that part of Assiniboia east of Western Assiniboia, or east of the 10th range of townships west of the 2nd meridian. Officials reside at Moosomin. Judge—Edward L. Wetmore. Sheriff—G. Anderson. Clerk—Oliver Neff. Court sits at Moosomin the second Monday in January and 2nd Monday in July; at Woolseley the last Monday in March, at Whitewood, the 2nd Monday in October.\n\nWESTERN ASSINIBOIA.\n\nComprising that part of Assiniboia west of the 10th range of townships west of the 2nd Meridian, and east of the 23rd range of townships west of the 3rd meridian. Official residence Regina. Judge—Lt. Col. Hugh Richardson. Sheriff—Jas. H. Benson. Clerk—Dixie Watson.\n\nSOUTHERN ALBERTA.\n\nComprising the remainder of Assiniboia with that portion of Alberta south of township 17. Official residence Macleod. Judge—Lt. Col. J. F. Macleod, C. M. G.\nSheriff—D. M. Campbell. Clerk, C. N. Campbell.\n\nNORTHERN ALBERTA.\n\nComprising the remainder of Alberta and the country north, which includes Athabasca. Official residence Calgary. Judge—Chas. B. Rouleau. Sheriff—P. W. King. Deputy-Sheriff—W. S. Robertson, Edmonton. Clerk—H. A. L. Dundas. Deputy-Clerk—Alex. Taylor, Edmonton. Court sits in Calgary every second Tuesday in April, June and November. In Edmonton every second Monday in May and October.\n\nH. B. CO. TRADING POSTS IN SASKATCHEWAN.\n\nPrince Albert—Chief Factor, Hon. Lawrence Clarke; Junior Chief traders, John Macaulay, G. S. Davidson, Clerks, J. Hart, A. C. Hudson, Thos. E. Parker, A. A. Bruce Sproat.\n\nRed Deer Lake—Clerk, Charles A. Garson.\n\nFort a-la Corne—Clerk, P. Turner.\n\nCandle Lake—Trader, H. Smith.\n\nBattleford—Junior Chief Trader, Wm. McKay; clerk, Joseph B. Parker.\n\nTurtle Lake—Clerk, J. E. Stewart.\n\nFort Pitt—Clerk, Angus McKay; Trader, Francois Dufresne.\n\nCold Lake—Clerk, J. R. Simpson.\n\nOnion Lake—Clerk, William J. Gingras.\n\nSandy Lake—Clerk, Paul de Launde.\n\nAssissippi—Trader, Peter Kakasoo.\n\nCumberland House—Chief Factor, Bellanger; clerk, Geo. McCrum.\n\nMoose Lake, The Pas, Pelican Narrows, Lacdu Brochet, Rapid River, Grand Rapids, Nut Lake.\n\nTELEGRAPH OFFICES IN SASKATCHEWAN.\n\nHumboldt—J. M. Anderson, Sub-Agent.\n\nClarke's Crossing—R. J. Molloy, Agent.\n\nSt. Laurent—L. P. O. Noel, Sub-Agent.\n\nPrince Albert—E. J. Rankin, Agent.\n\nHenrietta—Walter Salisbury, acting Sub-Agent.\n\nBattleford—Hugh Richardson, Jr., Agent; Herbert McLeneghan, Sub-Agent; George Carter, repairer; Hartley Gisborne, District Superintendent.\n\nFort Pitt—H. McDonald, acting Sub-Agent.\n\nMoose—Nap. Polvin, Sub-Agent.\n\nTABLE OF DISTANCES.\n\n| Location                  | Miles |\n|---------------------------|-------|\n| Prince Albert to Carlton  | 45    |\n| Carrot River              | 37    |\n| Duck Lake                 | 36    |\n| Battleford                | 159   |\n| St. Laurent               | 40    |\n| McLeod's ferry            | 18    |\n| Humboldt                  | 110   |\n| Qu'Appelle                | 256   |\n| Saskatoon                 | 90    |\n| A la Corne                | 42    |\n| Cumberland                | 198   |\n| Battleford to Swift Current| 182   |\n| Fort Pitt                 | 93    |\n| Victoria                  | 222   |\n| Edmonton                  | 297   |\n| Prince Albert             | 159   |\n| Saskatoon                 | 115   |\nPOSTOFFICES IN SASKATCHEWAN DISTRICT.\n\n| Location                  | Sec. | Tp. | Range |\n|---------------------------|------|-----|-------|\n| Prince Albert             |      |     |       |\n| Charles Mair, Postmaster  | 48   | 26  | w 2   |\n| Battleford                | 1    | 43  | 16 w 3|\n| Hugh Richardson, Postmaster|    |     |       |\n| Kirkpatrick               | 22   | 47  | 27 w 2|\n| Robert Adams, Postmaster  |      |     |       |\n| Willoughby                | 12   | 46  | 1 w 3 |\n| Angus Cameron, Postmaster |      |     |       |\n| Grandin                   | 21   | 44  | 1 w 3 |\n| Rev. Pere Fourmond        |      |     |       |\n| Batoche                   | 17   | 43  | 1 w 3 |\n| Rev. Pere Moulin          |      |     |       |\n| Saskatoon                 | 28   | 36  | 5 w 3 |\n| Dr. J. H. C. Willoughby   |      |     |       |\n| Postmaster                | 35   | 38  | 4 w 3 |\n| Saskatchewan              |      |     |       |\n| J. F. Clarke, Postmaster  | 16   | 45  | 21 w 2|\n| Kinistino                 |      |     |       |\n| James Tennant, Postmaster | 30   | 46  | 25 w 2|\n| Puckahn                   |      |     |       |\n| George Taylor, Postmaster | 15   | 46A | 26 w 2|\n| Halcro                    |      |     |       |\n| William Tenant, Postmaster| 11   | 45  | 27 w 2|\n| Bouchere                  |      |     |       |\n| Rev. Pere Lecoque         | 32   | 46  | 26 w 2|\n| Aaskana                   |      |     |       |\n| Charles Adams, Postmaster | 32   | 40  | 2 w 3 |\n| Alvena                    |      |     |       |\n| Angus McIntosh, Postmaster| 53   | 28  | w 3   |\n| Ft. Pitt                  |      |     |       |\n\nPRINCE ALBERT POSTOFFICE.\n\nMail leaves Qu’Appelle for Prince Albert every Tuesday Morning, arriving at Prince Albert every Monday at 5 p.m. It leaves Prince Albert for Kirkpatrick, Willoughby, Grandin, Batoche, Humboldt, Touchwood, Fort Qu’Appelle and Qu’Appelle Station every Wednesday morning, arriving at the latter place every Tuesday evening. It leaves Prince Albert for Aaskana, Halcro and Puckahn every Tuesday at 1 p.m., and arrives every Monday at 5 p.m.; leaves Puckahn for Kinistino, Carrot River, every second Wednesday, returning every second Thursday. Chas. Mair, Postmaster; R. B. Way, Deputy Postmaster.\n\nBATTLEFORD POSTOFFICE.\n\nMail leaves Swift Current and Battleford every Wednesday noon, and arrives at Battleford and Swift Current respectively every Monday noon. Mail leaves for Bresaylor and Ft. Pitt every second Tuesday, at 9 a.m., returning leaves Ft. Pitt every second Saturday. Hugh Richardson, Jr., Postmaster.\n\nPUBLIC SCHOOLS IN SASKATCHEWAN DISTRICT.\n\nProtestant Schools in Prince Albert District; Rev. Canon Flett, Inspector, Prince Albert.\n\nPrince Albert (No. 3)—J. F. A. Stull, Secretary, Prince Albert.\n\nSt. Andrews (No. 8)—Chas. Adams, “Aaskana.”\nColleston (No. 9)—Henry W. Halpin, Secretary, Prince Albert.\nPrince Albert East (No. 10)—C. Woodman, “ “ “\nSaskatoon, (No. 13)—James Leslie, “ “ Saskatoon.\nRed Deer Hill (No. 17)—R. Giles, “ “ Aaskana.\nSt. Catharines (No. 18)—Wm. Craig, J.P., “ “ Prince Albert.\nLindsay (No. 41)—Rev. H. W. Attwater, “ “ “\nKinistino (No. 42)—James Tennant, “ “ Kinistino.\nIsland Lake (No. 44)—J. C. Slater, “ “ Prince Albert.\nSt. Leonard (No. 95)—W. S. Dunlop, “ “ Puckahn.\nSaskatchewan (No. 99)—Jas. Carswell, “ “ Saskatchewan.\nWilloughby (No. 106)—John Flett, “ “ Willoughby.\nNo. of pupils, 320.\n\nProtestant Schools in Battleford District; P. G. Laurie, Esq., Inspector,\nBattleford.\nBattleford (No. 71)—J. M. Skelton, Secretary, Battleford.\nBressaylor (No. 111)—H. C. Taylor, “ “ “\nNo. of pupils, 34.\n\nRoman Catholic Schools in Prince Albert District; Rev. Pere Dommeau,\nInspector.\nSt. Antoine (No. 1.)—Eugene Boucher, Secretary, Batoche.\nStobart (No. 8)—Ambrose Fisher, “ “ Grandin.\nSt. Laurent (No. 9.)—Louis Reguidel, “ “ Batoche.\nLourdes (No. 10)—Maxime Lepine, jr., “ “ “\nTache (No. 13)—Philip Garnot, “ “ “\nSt. Louis de Langevin (No. 14)—J. Bte. Boucher, Secretary, Batoche.\nSt. Francois de Tache (No. 16)—Patriel Tourond, “ “ Alvena.\nPrince Albert (Separate, No. 6)—Rudolph Ouellette, “ “ Prince Albert.\nNo. of Pupils, 230.\n\nRoman Catholic Schools in Battleford District; Rev. Pere Bigonnesse,\nInspector, Battleford.\nSt. Vital (No. 12)—Simon Morin, Secretary, Battleford.\n\nBOARD OF EDUCATION.\n\nProtestant Section: The Right Rev. W. C. Pinkham, D.D., Bishop of\nSaskatchewan; the Honorable E. L. Wetmore; Rev. Andrew B. Raid, B. D.; Rev. John McLean; John Setford, Esq., barrister.\nRoman Catholic Section: The Hon. C. B. Rouleau, Rev. H. Leduc, A. E. Forget, Esq., barrister.\n\nBOARD OF EXAMINERS.\n\nProtestant Section: Rev. Andrew B. Baird, B.D.; T. Grover, Esq., B.A.\nRoman Catholic Section: Rev. D. Gillies, Rev. D. Gratton.\nJames Brown, Secretary, Regina.\nJohn McLaughlin, clerk.\nADDENDA.\n\nPRINCE ALBERT.\nAdd Business Directory—\nMcLennan, D. C., Harnessmaker,\ncor. River and King streets.\nAuld, Miss., Milliner, River street.\nAdd alphabetical list—\nBartlett, —, Teacher, East End.\nReynolds, D. C., contractor.\n\nCorrection—\nFor “Central” Hotel read “Leland.”—For “Robinson & Robinson,” tailors, read “Robertson & Robertson.”\n\nThos. McKay and Wm. Thompson were elected President and Vice-President respectively of the Lorne Agricultural Society at the last general meeting.\n\nSaskatoon, page 83—For “1838” read “1883.”\n\nHistorical—\nThe Marquis of Lorne visited Prince Albert in August, 1883; in the fall of 1885 Hon. Thos. White visited Prince Albert, and was well received.—The first steamer placed on the Saskatchewan was the Lilly, an iron steamer built on the Clyde, and owned by the H. B. Co. It ran on a rock on the South Saskatchewan and sunk. The next was a Government tug which was hauled overland from Lake of the Woods to Red River, steamed up to the mouth of the Saskatchewan and handled up Grand Rapids, in 1877. It drew too much water, however, and proved useless. The machinery of the tug was subsequently sold to J. C. Oliver, and is now in a tug at Battleford, recently built by Lamoureux Bros.; of Edmonton, Alberta. The Northcote was the first to make a trip to Prince Albert and western points. It was built at Grand Rapids in 1875. Another boat built at the same place went to pieces on the rapids. The Manitoba, Northwest and Marquis formerly were on the Red River. Last year the Lamoureux Bros. added another vessel to the fleet on the North Saskatchewan.\n\nJohn Stewart and the late Wm. Napier were the first President and Secretary respectively of the St. Adrew’s Society.\n\nAdd Red Deer Hill—\nReynold, Joseph, farmer.\n\nBATTLEFORD.\n\nCorrection—\nFor “A. Macdonald & Co.” in advertisement, page 98, read “A. Macdonald.”\n\nHistorical—\nFrank Osler, now of Qu’Appelle, was the first white settler of Battleford, locating there in 1874. He purchased from the Indians the land on which the town is built and erected the building in which the Herald is now printed. When the capital was located at that point a reserve four miles square was set apart, and Mr. Osler’s claims overruled. Henry McKenny, now of St. Albert, and Stewart Mulkins, of Fort Saskatchewan, arrived shortly after Mr. Osler.—Mahaffy & Clinkskill first commenced business in the new town, not in South Battleford, as stated on page 53.\n\nA sawmill was established at the mouth of the Turtle River, about eighteen miles above Battleford, in 1883. The machinery of this mill now belongs to Clink Bros.\nNORTHWEST GOVERNMENT.\nSeat of Government, Regina; established 3rd Dec., 1881.\nLt.-Gov.—Hon. E. Dewdney, C.E.\nClerk of Council and Secretary—A. E. Forget.\nAccountant—L. O. Bourget.\nAsst. “ —J. C. Pope.\nChief Clerk—R. B. Gordon.\nClerk in Charge—Thos. Brown.\nLibrarian—Henry Fisher.\nAssistant Clerk—C. Lethbridge.\n“ “ —R. B. Deane.\n“ “ —W. J. Chaffey.\nMessenger—James McAra.\nCaretaker—E. Tenant.\n\nINDIAN DEPARTMENT.\nCOMMISSIONER’S OFFICE—REGINA.\nHon. E. Dewdney, Indian Commissioner.\nHayter Reed, Asst. Commissioner.\nW. McGirr, Chief Clerk.\nJ. C. Nelson, Surveyor.\nA. W. Ponton, Asst. Surveyor.\nAlex. McGibbon, Inspector.\nT. P. Wadsworth,\n\nNORTHERN TRAILS.\nFrom Qu’Appelle to—\nT. Carroll’s………………9 miles\n\nFt. Qu’Appelle…………18x* “\nL. Couture’s…………27xx “\nL. May’s………………33 “\nC. Fuhrer’s……………37 “\nMrs. Mulligan’s………47x “\nH. House’s……………53 “\nJ. House’s……………54 “\nJ. Taylor’s……………66 “\nTouchwood……………68xx “\nHeubeck’s……………77 “\nTelford & Boden’s……89x “\nR. Douglas’ (Spring’s)…101 “\nSalt Plain’s……………108xx “\nSmith’s………………..126 “\nHumboldt (G.T.office)…146 “\nF. Anderson’s…………148 “\nMail station (L. & S.)…151xx “\nBelangie’s……………..160 “\nSanguray’s…………….173 “\nDelorme………………..173x “\nHoodoo (McCombe)…..185xx “\nBatoche………………..208 “\nBoyer’s (St. Laurent)…216xx “\nA. Cameron’s…………236x “\nPrince Albert…………256xx “\n\n*x—Noon, xx Night Station.\n\nSwift Current to\nSaskatchewan Landing 29 miles\nOtter…………………..62 “\nRush Lake……………97 “\nFrenchman’s…………137 “\nBattleford……………..182 “\n\nRoyal Mail Stage Lines,\nWEEKLY\nFrom Q’Appelle to Prince Albert,\nSwift Current to Battleford & Ft. Pitt,\nCalgary to Edmonton & Ft. Saskatchewan.\n\nLEESON & SCOTT, Props.\nG. K. LEESON, Calgary. JAS. SCOTT, Qu’Appelle Station.\nS. H. CASWELL,\nWHOLESALE GROCER,\nQu'Appelle, N. W. T.\nDoes a General Banking Business.\n\nMISS AULD,\nMilliner and Dress Maker,\nRIVER STREET.\nPRINCE ALBERT, SASK.\n\nLarge Stock of Millinery & Fancy Goods\nALWAYS ON HAND.\n\nA First Class Dress and Mantle Maker in Charge, and all Orders Executed Promptly and in the Latest Styles.\nF. H. SMITH,\nTINSMITH & SHEET IRON WORKER,\nPlumber and Gas Fitter,\nRIVER STREET.\nPRINCE ALBERT, SASK.\n\nJOHN McDONALD,\nGARDENER,\nEAST END,\nPrince Albert, Sask.\nAll kinds of Flowers and Vegetables in Season at Reasonable Prices.\n\nR. DEACON,\nGeneral Blacksmith,\nPRINCE ALBERT, SASK.\nAll Kinds of Repairing Done to Order.\nCARTER & COCKRELL,\nContractors and Builders,\nPRINCE ALBERT, SASK.\nContracts Taken at the Lowest Rates.\nAll Work Satisfactorily and Promptly Executed.\n\nPRINCE ALBERT FURNITURE STORE,\nRIVER STREET.\n\nB. GOODFELLOW,\nPROPRIETOR.\n\nParlor Setts, Bedroom Setts, Sideboards, Extension Tables,\nCentre, Dining and Kitchen Tables, Bedsteads,\nMattresses, Lounges, Cane, Perforated and Other Kinds of Chairs, Etc., in Stock.\n\nREPAIRING DONE WITH CARE.\nRussell & Davis,\nWHOLESALE & RETAIL BUTCHERS,\nRIVER STREET,\nPrince Albert, Sask.\n\nHighest Price paid for Cattle, Sheep, Hogs and Poultry.\n\nPRINCE ALBERT\nPLANNING MILL\nAND\nSash and Door Factory,\nMcKAY STREET.\n\nGOODFELLOW BROS.,\nPROPRIETORS.\nWM. KNOX,\nCarpenter and Joiner,\nPRINCE ALBERT, SASK.\n\nShop near Queen's Hotel\n\nCHAS. PAGE,\nPhotographic Artist,\nPRINCE ALBERT, SASK.\n\nPhotography in all its Branches,\nwith the Advantage of the Latest Improvements in the Art.\n\nInstantaneous Exposures for Photographs.\nThe Regina Leader\n\nWill Continue to be what it has been in the past\nLife of Activity and Character,\nThe Farmer's Friend,\nThe Fearless Advocate of the People's Rights,\nThe Friend of the Church and Home.\n\nThe Leader is the People's Organ.\n\nSUBSCRIPTION $2.00 PER ANNUM IN ADVANCE.\n\nAPPOINTED, THE LEADER COMPANY (Limited),\nRegina, N.W.T.\n\nThe Regina Journal\n\nEight Pages Weekly.\n\nThe Only Pronounced Liberal Newspaper\nPublished in the Northwest Territories.\n\nContains more Strictly North-West News than any Paper published, supplied by its own Correspondents in all parts of the Territories.\n\nKeep Posted on the Northwest by Subscribing for The Journal.\n\n$1.00 PER YEAR.\n\nC. A. ATKINSON,\n\nEditor and Proprietor, Regina, N.W.T.\nPrince Albert Brewery,\n\nTHIRD STREET,\n\nPRINCE ALBERT, SASK.\n\nAmber {Hop} Ale!\n\nSUPERIOR QUALITY,\n\nDelivered to Any Part of the Town.\n\nMcINTOSH & GERROND,\n\nPROPRIETORS.\nTHE CANADIAN PACIFIC RAILWAY.\n\nCANADA'S NATIONAL HIGHWAY.\n\nThe True Transcontinental Line.\n\nTHROUGH TRAINS\n\nFROM OCEAN TO OCEAN.\n\nDaily Connection with the Atlantic and Pacific Seaboards.\n\nDirect connections made at Montreal and Quebec with the leading steamship lines for Europe.\n\nDirect connections at the Pacific Terminus, Vancouver, with steamers to Victoria, B. C.; Tacoma, W.T.; Seattle, W.T.; Portland, Ore.; San Francisco, Cal.; All Points on the Pacific coast and Puget Sound, New Zealand, Australia, Sandwich Islands, Yokohama and Hong Kong.\n\nDuring season of navigation on Lake Superior, close connections are made at Port Arthur with the Palace Clyde Built Steamers of the Canadian Pacific Railway, \"Alberta\" and \"Arthabasca,\" to all eastern points.\n\nMagnificent Drawing Room Sleeping Cars,\nWith BATH ROOMS and Private Dressing Rooms.\n\nPALACE DINING CARS.\n\nFree Second Class Sleeping Cars\nRun on all Through Trains.\n\nPassengers going east or west should make sure their tickets read by the \"Canadian Pacific Railway,\" thus ensuring Safety and Despatch.\n\nFor full information regarding routes of Travel, Time Tables, Lowest Fares, and through tickets to all points, apply to any Ticket Agent of the Canadian Pacific Railway.\n\nGEO. OLDS, LUCIUS TUTTLE, ROBERT KERR,\nGen'l Traffic Manager, Pass. Traffic Manager, Gen'l Passenger Agent,\nMONTREAL. MONTREAL. WINNIPEG, MAN.\nW. V. MACLISE,\nAdvocate, Notary, Etc.,\nPRINCE ALBERT.\n\nMoney to Loan on First Mortgages.\n\nW. R. GUNN, M.A.,\nAdvocate, Notary Public\nETC., ETC.\nPRINCE ALBERT.\n\nBREWSTER & McKAY,\nAdvocates, Solicitors,\nNotaries, Etc.\nPRINCE ALBERT, SASK.\n\nH. W. NEWLANDS,\nAdvocate, Notary Public\nPRINCE ALBERT, SASK.\n\nA. L. SIFTON, B.A., LL.B.,\nBarrister, Attorney;\nNotary Public, Etc.,\nRIVER ST., PRINCE ALBERT.\n\nJ. Lester Reid,\nDominion Land Surveyor,\nPRINCE ALBERT.\n\nDR. P. F. MEAGHER,\nSurgeon-Dentist,\nOver Betts and Gwynne's Store,\nRiver St., Prince Albert.\n\nJ. D. HANNAFIN,\nREAL ESTATE AGENT,\nPRINCE ALBERT,\nIssuer of Marriage Licenses.\n\nROBT. BUCKLEY,\nAuctioneer, Accountant,\nEstate & General Agent,\nPRINCE ALBERT.\n\nPAUL ASHBY,\nSign & Ornamental Painter,\nPRINCE ALBERT.\n\nContracts Taken & Satisfactorily Completed.\nTerms Moderate.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001740.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 163, "total-input-tokens": 237368, "total-output-tokens": 81654, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 78, 1], [78, 317, 2], [317, 734, 3], [734, 787, 4], [787, 1338, 5], [1338, 1437, 6], [1437, 3529, 7], [3529, 3610, 8], [3610, 3610, 9], [3610, 4177, 10], [4177, 4424, 11], [4424, 4622, 12], [4622, 7291, 13], [7291, 7335, 14], [7335, 10305, 15], [10305, 13539, 16], [13539, 16467, 17], [16467, 19520, 18], [19520, 22549, 19], [22549, 25693, 20], [25693, 28809, 21], [28809, 31718, 22], [31718, 34753, 23], [34753, 37272, 24], [37272, 40326, 25], [40326, 43437, 26], [43437, 46478, 27], [46478, 48010, 28], [48010, 48354, 29], [48354, 49445, 30], [49445, 52398, 31], [52398, 55681, 32], [55681, 58884, 33], [58884, 62060, 34], [62060, 65242, 35], [65242, 68553, 36], [68553, 71753, 37], [71753, 75004, 38], [75004, 78173, 39], [78173, 81184, 40], [81184, 81671, 41], [81671, 82025, 42], [82025, 85130, 43], [85130, 88329, 44], [88329, 91404, 45], [91404, 94193, 46], [94193, 97194, 47], [97194, 100173, 48], [100173, 102953, 49], [102953, 105755, 50], [105755, 105997, 51], [105997, 106308, 52], [106308, 109168, 53], [109168, 112067, 54], [112067, 114729, 55], [114729, 117655, 56], [117655, 118281, 57], [118281, 118619, 58], [118619, 121593, 59], [121593, 124743, 60], [124743, 127400, 61], [127400, 130443, 62], [130443, 130695, 63], [130695, 131233, 64], [131233, 132382, 65], [132382, 132382, 66], [132382, 135301, 67], [135301, 138253, 68], [138253, 141033, 69], [141033, 143834, 70], [143834, 146181, 71], [146181, 148969, 72], [148969, 151852, 73], [151852, 154786, 74], [154786, 157918, 75], [157918, 161003, 76], [161003, 161165, 77], [161165, 161826, 78], [161826, 162217, 79], [162217, 163190, 80], [163190, 165337, 81], [165337, 168132, 82], [168132, 169988, 83], [169988, 171742, 84], [171742, 172230, 85], [172230, 172536, 86], [172536, 172780, 87], [172780, 173136, 88], [173136, 175412, 89], [175412, 177761, 90], [177761, 180064, 91], [180064, 182422, 92], [182422, 184186, 93], [184186, 186633, 94], [186633, 189204, 95], [189204, 191747, 96], [191747, 191999, 97], [191999, 193532, 98], [193532, 193780, 99], [193780, 194143, 100], [194143, 196404, 101], [196404, 197141, 102], [197141, 197141, 103], [197141, 199199, 104], [199199, 201768, 105], [201768, 203872, 106], [203872, 204221, 107], [204221, 204965, 108], [204965, 205023, 109], [205023, 205360, 110], [205360, 207369, 111], [207369, 209599, 112], [209599, 211297, 113], [211297, 212747, 114], [212747, 215655, 115], [215655, 217863, 116], [217863, 217863, 117], [217863, 219943, 118], [219943, 222019, 119], [222019, 222096, 120], [222096, 224140, 121], [224140, 226746, 122], [226746, 226825, 123], [226825, 227137, 124], [227137, 228718, 125], [228718, 229223, 126], [229223, 229477, 127], [229477, 229720, 128], [229720, 231878, 129], [231878, 234080, 130], [234080, 235455, 131], [235455, 235751, 132], [235751, 236049, 133], [236049, 237077, 134], [237077, 239349, 135], [239349, 241913, 136], [241913, 243478, 137], [243478, 244229, 138], [244229, 244929, 139], [244929, 249808, 140], [249808, 252318, 141], [252318, 253545, 142], [253545, 255587, 143], [255587, 257999, 144], [257999, 260325, 145], [260325, 262851, 146], [262851, 264919, 147], [264919, 267267, 148], [267267, 269689, 149], [269689, 272542, 150], [272542, 274514, 151], [274514, 277114, 152], [277114, 278785, 153], [278785, 279109, 154], [279109, 279427, 155], [279427, 279865, 156], [279865, 280105, 157], [280105, 280372, 158], [280372, 281097, 159], [281097, 281265, 160], [281265, 282645, 161], [282645, 283464, 162], [283464, 283464, 163]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "fr", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]