[{"id": "569cab623a67925827e3d3a34d25299d034cf02f", "text": "THE \"BOODLE\" BRIGADE\nAS REPRESENTED\nAMONG THE MEMBERS\nOF THE\nDOMINION GOVERNMENT.\n\nNot since the era of the \"Family Compact\" of Upper Canada has this Country been called upon to behold the painful spectacle of Ministers of the Crown growing wealthy directly through the influence secured by their official positions until the inauguration of the corrupt system now in vogue by the Dominion Tory party. Is it any wonder that the rank and file of their parliamentary supporters have joined in plundering the country of timber limits, coal mines, farms and ranches, to say nothing of Boodle Bills, \"Blind shares\" and railway subsidies? In this leaflet, reference will be made only to the members of Sir John Macdonald's administrations, who have been using the public trusts committed to their care by the people to advance their own pecuniary interests.\n\nSIR JOHN MACDONALD:—The recipient of a testimonial from corporations and friends of $80,000, notably the Northern Railway and Sir David Macpherson. The former he endeavoured to relieve of an indebtedness of half a million to the country, and the latter he installed as a Cabinet Minister, and recommended him for Knighthood.\n\nThe Canadian Pacific Railway Syndicate made the Premier's son, (Hugh J. Macdonald, of Winnipeg,) one of its solicitors, at a salary of $5,000 per annum, for reasons that may be well understood. During the re-arrangement of the loans to the Canadian Pacific Company in the session of 1885, Sir John Macdonald declined to relieve the Company of the $10,000,000 special loan. Before the next session a member of his family was presented by the C. P. R. magnates with a diamond necklace, estimated to be worth from $25,000 to $50,000, (upon which duty has not been paid). Then at the session of 1886, the C. P. R. was relieved of the re-payment in cash of the $10,000,000, as they had requested and been refused twelve months previously. Sir John Macdonald's pleasure jaunts to England from 1879 to July 1885, have cost $11,324.33. See Public Accounts and Auditor-General's reports for those years.\n\nSIR CHARLES TUPPER:—When he accepted office was a poor man, but is now reputed to be very wealthy. He has always been the leading spirit when a C. P. R. job was to be put through, and the bosom friend of the Onderdonk's, Manning's, Shield's, McLaren's and others, whose\nexorbitant claims have received favorable consideration. His son, (J. Stewart Tupper, of Winnipeg,) was also appointed C. P. R. solicitor at a yearly salary of $5,000. Sir Charles went to England as Lord High Commissioner in 1884, at a salary of $10,000 per annum, and returned to parliament to force the new C. P. R. loan through the House.\n\nSir Charles departed for England again, the Government purchasing and furnishing a residence for him at a cost of $42,000. An idea of the extravagant furnishing may be had from a statement of a few of the items:—“Furnishing servants’ bedroom on the fourth flat, $240;” “back bedroom on third flat, $700;” “back bedroom, second story, $1,075;” 84 dozen wine bins, 168 champagne, sherry and claret glasses, decanter drainer, child’s carriage, etc. (See Hansard, 1885, page 926.) The Auditor-General’s Report, 1885, page 49, shows Sir Charles’ Income tax, Church and Parochial rates, etc., $1,120, charged in the office contingencies.\n\nSir Charles Tupper’s personal pleasure trips from 1879 to July, 1885, are entered in the Accounts and Auditor-General’s Reports, as $12,403.31.\n\nHON. J. H. POPE:—received a subsidy of $150,000 to extend a railway, controlled by him through the State of Maine.\n\nHON FRANK SMITH:—President of the Northern Railway of Canada, while holding a lease to the Northern Railway of the projected line from the terminus of that railway at Gravenhurst to Callendar, procured a subsidy for the proposed extension from the Government of $12,000 per mile, amounting to $1,320,000. The Company then bonded the road for $20,000 a mile, thus securing to themselves a clear profit of over $800,000.\n\nHON. JOHN CARLING:—Persuaded the Government to promise the corporation of the City of London, (Ont.) certain expenditures in connection with the military department, if the City would purchase the “Carling Farm” from him for $40,000—at least twice its value. It is needless to say that Mr. Carling has since received the $40,000.\n\nSIR HECTOR LANGEVIN:—This public recipient of a $25,000 testimonial from contractors having claims against the Government, has managed to charge $4,320 for his pleasure journeyings to the Dominion Exchequer, and has pensioned scores of relatives upon the public service. His latest deal was to get a subsidy of $620,000 for the Bay of Chaleur Railway Company, in which a very near family connection, R. A. Armstrong, holds a very large interest.\n\nHON. MR. CHAPLEAU:—Promoter of the Pontiac Railway which was granted a subsidy of $272,000 in the session of 1884. In the short time that he has been in the Cabinet, he has managed to expend $3,141 of\nTHE BOODLE BRIGADE—Continued.\n\npublic money in travelling. He was acting professionally for Smith & Ripley, claimants against the Government, before taking office, and it is now publicly charged by Hon. Wm. Macdougall, that out of the amount paid by the Government, the \"Chapleau's\" (the Secretary of State and his brother) received $8,300 for negotiating the settlement.\n\nSIR ADOLPHE CARON—Brother-in-law of Sharples, of Quebec, promoter of the Prince Albert Colonization Company, of \"blind share\" notoriety, which was granted the famous St. Louis de Langevin half-breed settlement in the North-West. Sir Adolphe has enjoyed himself in travelling at the public expense to the tune of $2,617.\n\nSir Adolphe is also a member of the \"Construction Company,\" awarded the contract for the Quebec and Lake St. John Railway Company, which has been subsidized by the Government to the extent of $176,000.\n\nHON. JOHN COSTIGAN—Lately presented with a mansion and furniture complete by contractors and others, at Ottawa, and whose name figures for extensive timber limits in the disputed territory (see Return No. 118, 1883), and who has been rushing in his relatives to positions of emolument.\n\nHON. THOMAS WHITE—Principal stockholder of the \"Montreal Gazette,\" the journal that gave utterance to the following remarkable doctrine a few years ago, when cornered in deliberate perversion of the truth:\n\n\"Editors are sometimes compelled by political exigencies to write in disregard of those considerations by which, under other circumstances, they would be guided.\"\n\nThe Independence of Parliament Act would not allow Mr. White to do Government printing as proprietor of the Gazette, so a stock company was formed by the White family, in order to evade the letter of the law. And Mr. White secures the profits all the same. During the last three years the \"Gazette\" Company received no less a sum than sixty-four thousand dollars; at, as Mr. Somerville proved in the House of Commons, an excess of twenty per cent. over ordinary prices of such work.\n\nThe \"Gazette\" Company has also secured a contract from the Government for five years to furnish steam-power from their offices in Montreal, to run an Electric Light machine in the Post Office, which is the adjoining building, at an annual charge of $2,700,—more than double what it costs to furnish the entire electric light in many Ontario towns.\n\nMr. White has a son drawing $800 a year, and a brother-in-law $1,200, in the public service at Ottawa.\nTHE BOODLE BRIGADE—Continued.\n\nSIR ALEXANDER GALT—while Lord High Commissioner in England, at an annual salary of $10,000, drew $7,036 for travelling expenses, a large part of which was spent on two trips to the North-West, prospecting for coal areas which he subsequently received from the Government at a nominal figure.\n\nHON. MACKENZIE BOWELL.—The one who gave his notorious son-in-law Jamieson the \"inside track\" in relation to Colonization Company, and who advanced $500 to the said Jamieson to purchase the \"blind share,\" valued at $33,000 in the Prince Albert Colonization Company. Mr. Bowell has his family well provided for in the public service.\n\nSIR LEONARD TILLEY, when in receipt of $7,000 yearly as Finance minister, spent $8,811 in pleasure trips to England, and now occupies Government House in New Brunswick in the enjoyment of $8,000 a year from the Dominion Treasury.\n\nHON. MR. MCLELAN.—Managed to fritter away in pleasure with friends $7,000 while visiting the Fisheries Exhibition in London, three years ago, in addition to $1,490 travelling in this country.\n\nSIR ALEXANDER CAMPBELL.—Had, between 1880 and 1885, the sum of $5,662 charged in the Public Accounts for his travelling expenses.\n\nMR. DALTON MCCARTHY, M.P., outside Member of the Cabinet, who, as President of the Northern Pacific Junction Railway, at a salary of $3,000 per annum, secured a Government subsidy of $12,000 a mile for that railway, and also permission to issue bonds for $20,000 a mile additional—thus making a clear profit for himself and to his friends of at least $800,000, over and above the cost of construction. He is Counsel for the St. Catharines Milling Company, in the suit with the Province of Ontario, the Dominion having assumed all responsibility for costs, etc. He has already received about $6,000, and has (in writing) recommended the Government to carry the case to the Privy Council, at a probable cost of $20,000. (See correspondence in Hansard, last day of Session, 1886). He was also the promoter of the notorious McCarthy Liquor Act, which has cost the country over $300,000.\n\nIn the preceding statements no reference is made to the enormous sums paid every year by the departments at Ottawa, for the cab hire of members of the Government and their friends. That item alone amounts to many thousand dollars.\n\nThe Electors are asked to stamp with their condemnation the policy of an administration under which such abuses are allowed to exist. Conduct of that character on the part of politicians, would not be tolerated in England or the United States.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001674.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5444, "total-output-tokens": 2680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2345, 1], [2345, 4981, 2], [4981, 7472, 3], [7472, 10043, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]