[{"id": "0e974e005ef45b442a2d3a35ff29779b833f9826", "text": "LE PEUPLE\n\nvs.\n\nSIR JOHN!\n\nI\n\nLe cabinet fédéral, mis en accusation pour avoir vendu la tête de Riel aux Orangistes d'Ontario, a publié sa défense qui comprend quatre colonnes et demie de journal, petit texte.\n\nIl faut, avant d'examiner cette défense, se rappeler que ses auteurs sont tenus, par serment, au secret de leurs délibérations ; qu'ils ont, entre les mains, toutes les pièces du procès ; et qu'ils peuvent anéantir celles qui ne cadraient pas avec leur ligne de défense.\n\nLa preuve de l'accusation doit donc être faite presque entièrement avec leurs aveux, leurs contradictions, les lacunes de leur plaidoyer, et complétée au moyen des faits connus du public par les différents moyens de publicité qu'il a à sa disposition.\n\nCe qui frappe tout d'abord, en lisant ce long document, c'est que le gouvernement ne se montre si prodigue d'arguments qu'après la perpétration du crime qui lui est reproché. Il a gardé, tant que sa victime a eu un souffle de vie, un silence obstiné sur ses intentions. Il a même fait plus ; il a induit en erreur ses députés, ses juges en première instance, leur faisant entendre : 1o. que Riel ne serait pas pendu, quoiqu'il advint ; 2o. qu'une commission d'experts serait nommée pour examiner l'état mental de Riel.\n\nIl y a donc, dès l'abord, une présomption que le gouvernement avait conscience de sa culpabilité, puisqu'il se cachait ; et qu'il redoutait le rapport d'une commission d'experts, puisqu'il n'a pas nommé de commission.\n\n***\n\nOn remarque en outre que le gouvernement ne dit pas un mot de la recommandation à la clémence par laquelle le jury a voulu qualifier son verdict. C'est qu'il n'a tenu, en effet, aucun compte de cette recommandation. Le verdict du jury était juste ou injuste, mais il fallait le prendre ou le rejeter dans son entier. En prendre la moitié et ignorer l'autre, c'est peut-être légal, mais à coup sûr ce n'est pas équitable. Et substituer son appréciation à celle du jury, c'est se faire juge et jury, c'est décider, à soi seul, de la culpabilité de l'accusé et de la peine qu'il a encourue.\n\nQuelle que soit donc la portée de ses actes, il en a assumé la pleine responsabilité ; il ne peut pas se réfugier derrière le verdict, puisque ce verdict, il l'a tronqué ; il ne peut pas dire qu'il n'a fait qu'appliquer la loi, sur les indications fournies par le jury, puisqu'il a faussé ces indica-\ntions, et qu'il a appliqué une peine que le jury avait précisément voulu écarter.\n\nDonc, si Riel a été pendu, c'est le gouvernement seul qui l'a fait pendre, le jury ayant formellement déclaré qu'il ne voulait pas que Riel fut pendu. À chacun sa responsabilité.\n\nVoyons maintenant ce que le gouvernement a à dire pour sa défense.\n\nLa première question qui se pose, et le gouvernement le comprend, est celle-ci : La rébellion n'a-t-elle pas été provoquée par la mauvaise administration des affaires des Territoires du Nord-Ouest ?\n\nSir Alexander Campbell ne croit pas devoir répondre à cette question pour le moment ; il se réserve d'y répondre, lorsque elle sera posée d'une manière constitutionnelle, au parlement.\n\nOn l'a également éliminée du procès de Riel : Que le gouvernement ait, par ses exactions, par ses tracasseries, par ses dénis de justice, exaspéré les Métis et poussé quelques uns d'entre eux à la révolte, cela n'a rien à faire avec le procès de Riel, disait la Gazette de Montréal, au commencement du procès.\n\nVous surprenez un homme chez vous, en train de dévaliser votre coffre-fort ; il y a lutte, vous tuez le voleur, vous êtes arrêté et on vous fait un procès pour assassinat. D'après le principe posé par Sir A. Campbell, on ne devra pas vous permettre de prouver que cet homme était là pour vous voler ; cela n'a rien à faire avec votre procès : Qu'on le poursuive pour vol, et devant le tribunal compétent, vous pourrez prouver qu'il a voulu vous voler ; mais pour le moment, il s'agit d'un assassinat, non d'un vol.\n\nComme on peut le voir, l'argument n'est pas même spécieux, il n'est qu'absurde.\n\nDevons-nous nous en contenter\n\nFaudra-t-il ignorer que les métis établis depuis 25 ou 40 ans sur les terres des paroisses de St Antoine, St Laurent, St Louis de Langevin, se voyaient dépossédés par des prétendues compagnies de colonisation, en réalité des compagnies de spéculation, composées des fils, des cousins de ministres, de députés et de personnages influents ?\n\nIl y a actuellement devant la cour de l'Echiquier, une pétition de droit intentée contre une de ces compagnies pour la répétition de $20,000 payées par elle au gouvernement en compte du prix des terres des métis de St. Louis de Langevin.\n\nLa compagnie se plaint au gouvernement de ce que les terres, qui lui avaient été vendues, étaient occupées par des métis. Mettez les dehors, a répondu le gouvernement ; et si ces gens là résistent, notre police ira les chasser de ces terres qu'ils occupent.\n\nLes limites de cet écrit ne permettent pas d'entrer dans une revue plus détaillée des griefs des métis ; ces griefs ont été d'ailleurs publiés l'été dernier, et quelques uns sont si palpables que le gouvernement a essayé, trop tard hélas ! de les redresser. En dépit de cela cependant, le conseil du Nord-Ouest vient encore, ces jours-ci, d'adopter une résolution où il regrette que le gouvernement fédéral n'ait pas fait droit aux justes réclamations des métis, comme la recommandation en a été faite si souvent et depuis si longtemps par le conseil.\n\nLa prochaine session, puisque le gouvernement en appelle au parlement, verra probablement la condamnation de tant d'injustices et de tant d'incurie ; mais cela ne fera pas ressusciter Riel.\n\nPour le moment, sir A. Campbell ne veut discuter que 4 points : 1o la compétence du tribunal et l'équité du procès ; 2o l'état mental de Riel ; 3o la nature politique du crime ; 4o\nla peine de mort appliquée aux crimes de haute trahison.\n\nLa compétence du tribunal et l'équité du procès.\n\nLa question de la compétence du tribunal exigerait des développements qui ne pourraient trouver place ici. En admettant même que la composition du tribunal fût conforme à la loi, si la loi est injuste, ce sont les ministres qui l'ont fait adopter, ce sont eux qui en sont responsables. Si la loi permet de faire juger un sujet de Sa Majesté, dans la Prussianse du Canada, par six jurés, seulement, choisis par le juge, dont aucun ne comprend la langue du prisonnier, et qui sont tous, par la force des choses, antipathiques à sa cause et à sa nationalité, cette loi ne devient pas juste, parce qu'elle est loi ; elle lie, c'est vrai, les officiers de l'ordre judiciaire ; mais le gouvernement qui l'applique, lorsqu'il aurait pu l'amender de manière à la faire concorder avec l'équité, la justice et les droits imprescriptibles de tous les sujets anglais au Canada, ce gouvernement ne peut pas dire : Nous n'avons fait qu'appliquer la loi existante. Cette loi étant inique, il fallait la faire rappeler ; ne l'ayant pas fait rappeler, ce qu'il a été mis en demeure de faire par interpellation en plein parlement (Voir Hansard du Sénat vol. 2, p. 1274), le gouvernement porte toute la responsabilité de l'irrégularité du tribunal et de la violation des droits conquis par la Grande Charte et par les traités.\n\nIl est souverainement ridicule de voir dans un factum de ce genre le raisonnement que voici : \"Il aurait suffi, pour assurer l'instruction impartiale du procès, de charger de la poursuite un avocat de renom ; mais pour prouver au public que l'instruction serait impartiale, la poursuite fut confiée à deux avocats éminents d'Ontario, auxquels fut associé un avocat franco-canadien de Québec, et tous les trois ont été aidés par le sous-ministre de la justice.\"\n\nAinsi, pour Sir Alexander Campbell, le comble de l'impartialité consiste à employer quatre juriconsultes éminents pour faire condamner le prisonnier. Il est vrai que sur quatre, il y en avait un de notre race et de nos sympathies ; mais celui-là n'était-il pas, pieds et poings liés, à la merci du senior conseil et du sous-ministre ? Sans compter que cet avocat canadien-français ajouté aux trois autres, avait pour devoir professionnel de représenter les intérêts de la poursuite et nullement ceux de la défense.\n\nLe défenseur du gouvernement croit inutile, il le dit en toutes lettres, d'ajouter que le prisonnier a été défendu par des avocats habiles, qui ont fait leur possible pour sauver la tête de leur client.\n\nLa défense a, dit-il, eu la latitude la plus complète. C'est ce qu'il faudrait prouver, car la chose est niée péremptoirement et ne sera pas difficile à démentir.\n\nLes faits suivants en donneront une idée : Les avocats de la défense demandèrent la production des papiers de Riel, papiers où, prétendant le prisonnier, on pouvait trouver des documents utiles à sa défense.\n\nCes papiers étaient entre les mains du gouvernement et le gouvernement refusa de les produire. Ce qui ne l'empêcha pas d'y prendre les documents qu'il pouvait faire servir à la poursuite. Est-ce équitable ? Est-ce juste ?\n\nEmpêchés, faute de pouvoir produire leurs preuves, de faire ce qu'ils auraient voulu pour défendre leur client, de l'accusation de haute trahison, les avocats de Riel plaidèrent simplement la folie.\n\nPour établir leur plaidoyer, il leur fallait faire venir des témoins de lieux très éloignés de Montréal, de\nQuébec, des États-Unis: Il fallait prévenir ces témoins; il fallait qu'ils eussent au moins quelques jours pour se préparer au voyage. Dans une cause ordinaire, un témoin, résidant au lieu même où siège le tribunal, a droit à un jour franc d'avis, et lorsqu'il réside à plus de vingt milles, il a droit à autant de jours de plus qu'il y a de fois cinq lieues entre son domicile et le lieu où siège la cour.\n\nD'après cette loi en force ici, les témoins eussent dû être assignés de 125 à 150 jours d'avance! Sans compter que les avocats de Riel n'ayant pas de ressources d'argent à leur disposition, le gouvernement aurait dû ordonner une enquête spéciale dans la Province de Québec.\n\nOr, combien de temps a-t-on donné au prisonnier pour faire venir ses témoins? Huit jours; juste le temps de se rendre de Québec à Régina.\n\nAinsi, entravés dans leurs efforts, gênés par le manque de fonds et restreints par la Couronne à un certain nombre de témoins dont elle payait les frais de voyage, les avocats de Riel n'ont pu faire leur preuve aussi complète qu'ils l'auraient voulu, et cela, par la volonté expresse des représentants de la Couronne.\n\nLe président de la cour déclara que c'était juste et raisonnable. Quelle preuve d'impartialité et d'équité! Comme on voit bien que ce juge est selon le cœur de nos ministres; il l'a bien prouvé, d'ailleurs, d'un bout à l'autre du procès.\n\nLe procès commença le 28. Il ne fut pas fait de nouvelle demande d'ajournement, c'est-à-dire inutile. Sir Alexander Campbell croit devoir citer, sur la composition du tribunal et sur la manière dont le procès a été conduit, les opinions exprimées par les juges de la cour d'appel du Manitoba. Peine inutile; les juges n'avaient qu'à examiner si la loi avait été suivie. Pour eux, c'était la loi, et la maxime: *summum jus, summa injuria*, n'est pas faite pour les juges.\n\nLe juge en chef du Manitoba fait remarquer que, dans le cas de condamnation à mort, il y a deux appels de la décision du magistrat: d'abord à la cour d'appel du Manitoba, où la cause est plaidée de nouveau; ensuite la cause doit être prise en considération par le gouverneur en conseil.\n\nOr, dans le cas actuel, la cour d'appel du Manitoba n'a examiné que les questions de droit; et, si elle s'est prononcée sur les questions de fait, ce n'est qu'en s'en rapportant au magistrat, car elle n'a eu devant elle que les notes du juge, n'ayant pas jugé à propos de demander la production de la preuve complète. Il est donc évident qu'il n'y a eu appel réellement que sur les questions de droit.\n\nOr, les formalités légales ayant été remplies, les juges du Manitoba devaient déclarer que la loi, telle qu'elle existait, ne permettait pas de réformer le jugement de M. Richardson.\n\nPour le gouvernement, comme il a été dit plus haut, cette excuse n'existe pas. Il est responsable et de la loi et de la manière dont elle a été appliquée. Or voici comment elle a été appliquée:\n\nLe juge Richardson, magistrat stipendiaire, appartenant au plus bas ordre de la magistrature, est chargé de l'exécution des basses-œuvres du ministère. La loi lui donne le pouvoir inoui de choisir les jurés. Il les choisit parmi les adversaires de Riel et de sa cause, parmi les gens mêmes dont la venue a donné lieu aux troubles, parmi ceux qui avaient le plus à perdre si Riel eût triomphé. Par un malentendu inexplicable, le nom d'un juré canadien-français se trouvait sur la liste, aussi la Couronne s'est-elle empressée de le récuser, voilà dans quelles conditions d'impartialité et d'équité s'est fait le\nprocès de Riel. Et encore une fois, qu'on ne dise pas : c'est la loi. On peut bien admettre, si l'on veut, que lorsque cette loi a été faite, on ne songeait pas qu'un cas semblable pût se présenter. Mais le parlement siégeait quand Riel s'est constitué prisonnier et le gouvernement n'avait qu'un mot à dire pour remettre d'accord la loi et l'équité. Il n'a pas dit ce mot ; qu'il en porte la responsabilité.\n\nLa poursuite put faire sa preuve tout à son aise ; la défense fit de son mieux et la cas fut laissé à la décision des jurés ; le magistrat stipendié, en donnant ses instructions au jury, leur expliqua carrément qu'ils ne devaient pas conserver le moindre doute sur la question soulevée par la défense : l'intégrité des facultés mentales du prisonnier.\n\n20. RIEL ETAIT-IL RESPONSABLE DE SES ACTES.\n\nCe moyen de défense a été discuté devant le jury et devant la cour du Manitoba. Le jury a suivi sur ce point, les instructions du juge, et la cour du Manitoba, n'ayant devant elle que les notes du juge, a décidé dans le même sens. Ainsi, ces décisions découlent toutes de la même source, et se basent sur l'appréciation que le juge Richardson a pu faire de la preuve sur ce point.\n\nIl est donc complètement oiseux de citer les commentaires des juges de la cour du Manitoba ; on pourra remarquer seulement dans quels termes le juge Taylor apprécie le caractère de Riel :\n\n\"L'appelant est incontestablement un homme d'une variété plus qu'ordinaire ; excitable, irritable, et ne pouvant suffire la contradiction. Il paraît avoir agi quelquefois d'une manière bien extraordinaire, avoir dit bien des choses étranges, et avoir eu ou au moins prétendu avoir des idées absurdes sur des sujets religieux et politiques. Mais ces faits sont loin de prouver un dérangement mental qui le rendrait irresponsable de ses actes.\"\n\nEt maintenant rapprochez de cette appréciation, la déposition du Dr Jukes dans la cause de Jackson, déposition qui a suffi à convaincre la couronne, le juge et les jurés, que Jackson n'était pas responsable de ses actes :\n\n\"Il y a des moments où je le croirais très-responsable de ses actes. Aujourd'hui, il est mieux que depuis 4 semaines, et il m'a parlé très sensément. Je n'ai jamais rien observé à son égard qui me porte à croire qu'il ne peut contrôler ses actes. S'il parlait sensément, je le croirais très responsable. Mais il a des idées étranges en matière religieuse, et il se croit tenu d'appuyer et de défendre la religion fondée par Riel. S'il commettait aucun acte dans l'état où il est aujourd'hui, je ne le croirais pas responsable. La moindre excitation produit beaucoup d'effet sur lui. En fait de folie, la question d'hérédité est très importante, mais je n'ai rien entendu rapporter de son passé ou de sa famille. Avec le temps, il pourrait redevenir responsable de ses actes.\"\n\n(Le Monde 3 août 1885.)\n\nEncore une fois, la responsabilité du gouvernement est toute autre que celle des juges de la Cour d'Appel. Il a eu la preuve entre les mains ; on dit même qu'il se propose de la publier. Il devait donc être à même de juger des faits aussi bien que du droit. Or, voici les faits, en résumé.\n\nRiel a toujours été un enthousiaste ; c'était un grand cœur et un homme dévoué à ses amis, mais qui, comme beaucoup de ces enthousiastes, avait le cerveau mal équilibré. La plupart des héros que vante l'histoire en sont là ; de même aussi que nombre de grands coeurs, de grands talents, sont morts fous. Appelé par ses compatriotes à protéger leurs droits, en 1869, il s'est vu, par suite\nd'un regrettable incident, comme il en arrive dans toutes les périodes de troubles, persécuté, poursuivi, poursuivi par la haine des orangistes d'Ontario. Étant toujours sur le qui vive, exposé à chaque pas à rencontrer le poignard d'un assassin, son intelligence a fini par se détraquer, et les amis, chez qui il vivait sous un nom d'emprunt, durant le confier aux soins des médecins de l'asile de Beauport. Il n'était pas fou, il était maniaque; c'est-à-dire, que sur la plupart des sujets: il était parfaitement sain d'esprit, causant sensément et agissant raisonnabllement, mais qu'il avait une monomanie dont les symptômes étaient très marqués. Sous le traitement du Dr Vallée, dans la tranquillité et le calme, il se rétablit peu à peu. Voulait-on savoir quelle était sa manie? Il l'a expliquée lui-même vers cette époque au Dr Samson, qui en a fait le récit suivant:\n\n\"Je me rappelle assez bien ce qui se passa dans ma pauvre tête pendant le mois qu'on a jugé à propos de m'enfermer.\n\n\"J'en étais venu à me croire prophète ou quelque chose d'analogique. Il me semblait que la papauté devait laisser le sol vermoulu de l'Europe pour un monde plus jeune. Je voyais les lumières de la civilisation gagner à travers les âges, de l'Orient au Couchant, l'homme né sur les bords de l'Éphrathe, le Christ en Palestine, la Papauté établie à Rome. Il me semblait que le tour de l'Amérique était venu, et je me croyais un rôle important dans ce nouvel ordre de choses. Par la plume et la parole, j'essayais à faire des prosélytes; et à tous les déboires que j'éprouvais, je me rappelais Jésus incompris parmi les siens.\n\nL'année suivante il allait s'établir aux États-Unis, au Montana, où, en 1884, il faisait l'école aux petits enfants et vivait modestement avec sa famille du maigre salaire que lui donnaient ses fonctions.\n\nC'est là que Gabriel Dumont et les autres délégués des Métis de la Saskatchewan du sud vinrent le chercher pour le prier de les aider à obtenir justice du gouvernement. Riel hésita. Il connaissait les métis, il connaissait les employés du gouvernement, il connaissait Sir John A. Macdonald. Il savait ce qui l'attendait, si, une fois, les orangistes le tenaient. Il hésita. Toute une nuit, cette pensée des métis chassés de leurs terres, malgré la foi des traités, malgré la parole royale, malgré les engagements solennels du gouvernement d'Ottawa, pour faire place à des spéculateurs, lui tortura le cerveau et fit bouillir son sang dans ses veines. Ses frères l'appelaient. Lui seul était en état de parler pour eux. Déjà, une fois, il avait arraché au pillage les propriétés des Métis de la Rivière Rouge et avait obtenu la reconnaissance de leurs droits. Pouvoir-il opposer un refus à ceux-ci, parce qu'il craignait pour sa sûreté personnelle? C'eût été lâche, et Riel n'était point lâche. Il la bien prouvé sur l'échafaud. Sa femme et ses enfants, voilà ce qui le faisait hésiter. Que deviendraient-ils s'il venait à succomber? Le lendemain, son parti était pris, son sacrifice était fait, et il partait avec sa famille, pour les établissement métis de la Saskatchewan.\n\nDurant tout l'hiver, il s'occupa d'organiser une agitation constitutionnelle, convoquant des assemblées, dressant des requêtes, faisant rédiger un mémoire des réclamations des métis.\n\nMais le travail ardu qu'il s'imposait, l'excitation, les discussions, réveillèrent la manie qui n'était qu'asoupie dans son cerveau, et un beau jour revinrent les hallucinations qui l'avaient hanté pendant son séjour à Beauport. De ce moment, il a été perdu, et M. Chapleau pouvait dire: nous le tenons bien, cette fois.\n\nSon cerveau malade lui fit voir une nation métisse dont il devenait le chef, qui balayait les intrus, qui appelait des races amies à peupler le Nord-Ouest; il fondait une religion dont il était le grand prêtre, ou bien il réformait la religion catholique et faisait venir le Pape à Montréal.\nMais ces hallucinations, qui le rendaient incapable de juger sainement de la valeur de ses actes, et qui par conséquent le rendaient irresponsable devant la loi, d'après toutes les données de la science, ne l'empêchaient pas de conserver une grande lucidité d'esprit pour chercher les moyens de parvenir à son but.\n\nLe fait d'avoir organisé et dirigé un tel soulèvement, dit Sir Alexandre Campbell, est incompatible avec le plaidoyer d'insanité. Il faut connaître bien peu de chose, en fait de médecine légale, pour soutenir une pareille proposition, surtout ici où on a affaire, non pas à un aliéné, mais à un monomane.\n\nTant qu'il est resté sur le terrain de l'agitation constitutionnelle, c'est-à-dire tant que sa manie n'a pas été réveillée, personne ne se doutait, au Nord-Ouest, de sa condition mentale; et certes, ce n'est pas le magnifique plaidoyer qu'il a fait en faveur de son peuple, comme il dit, et que nous avons reproduit ces jours-ci, qui peut le faire prendre pour un fou. Mais dès les premiers symptômes de révolte à main armée, des prêtres, qui étaient sur les lieux, l'ont cru fou.\n\nNous avons vu, dans La Minerve, bien avant Batoche, et quelque jours après l'escarmouche du Lac au Canards, cette opinion, que Riel était fou, exprimée carrément par un témoin oculaire compétent.\n\nQu'on ne vienne donc pas dire qu'on n'a songé à la folie que lorsque Riel a été prisonnier; les faits démentent cette assertion.\n\nVue à la lumière des faits qui viennent d'être exposés, la conduite subséquente de Riel, telle que nous l'exposent la preuve faite au procès, s'explique parfaitement; autrement, elle sort tout-à-fait de l'ordre logique des choses.\n\nLa question de savoir qui a tiré le premier coup de fusil au Lac au Canard à plus d'importance pour les métis que pour Riel; disons à leur honneur qu'il est prouvé, par le récit des hommes mêmes du major Crozier, que le premier coup de feu a été tiré par un de ses gendarmes, et pendant qu'il était en train de parlermenter avec Grébriel Dumont.\n\nSi nous ne discutons pas, pour le moment, le récit que fait Sir Alexander Campbell du combat du Lac au Canard, ce n'est pas que nous admettions, par exemple, que Riel ait été là, à la tête de 300 ou 400 hommes. Nous savons qu'il n'a jamais eu plus de deux cents hommes autour de lui, et il n'a jamais été prouvé, du moins publiquement, que Riel fut présent à cet engagement.\n\nMais, pour en finir avec la question de la responsabilité de Riel, il faut voir quelle preuve a été faite sur ce point à Regina.\n\nIl serait trop long de reproduire ici les dépositions des experts; il suffira d'établir qu'ils étaient trois: le Dr Clarke, de Toronto; le Dr Wallace, de Hamilton et le Dr Roy, médecin de l'Asile de Beauport.\n\nLe Dr Roy déclara carrément que, à son avis, Riel n'était plus responsable de ses actes; le Dr Clarke, qui n'avait passé que quelques heures avec Riel, déclara que, d'après ce qu'il en avait vu, il le croyait irresponsable, mais qu'il ne pouvait donner une avis formel sur ce point, vu l'étudier. Enfin, le Dr Wallace le déclara responsable.\n\nAinsi, sur trois opinions, une est formelle pour la folie, une autre est formelle contre la folie, quant à la troisième l'expert, qui l'a émise, en n'affirmant pas d'une manière positive que Riel est aliéné, déclare qu'il le croit irresponsable. M. Wallace, d'un autre côté, tout en déclarant Riel responsable donne une définition de la manie des grandeur (megalomania) qui correspond exactement avec l'état de Riel, tel qu'il a\nété constaté à Beauport et au Nord-Ouest par une foule de témoins.\n\nLa couronne avait si bien compris la portée de ces dépositions, qu'elle a fait une contrepreuve pour les détruire. Et elle a interrogé qui ? Le général Middleton, des officiers de l'escorte de Riel et des ex-prisonniers de Riel, pour contredire le témoignage des experts. Avec un juge Richardson, cela suffisait, paraît-il, et le juge dans sa charge aux jurés, exprima formellement son opinion que Riel était parfaitement responsable de ses actes. Nous trouvons, à ce sujet, dans le Mail le fait suivant : Après avoir entendu le plaidoyer de Riel, le Dr. Clarke dit que s'il avait encore à donner son témoignage, il déclarerait bien plus positivement que Riel était fou.\n\nLa province de Québec toute entière sans distinction de parti, demanda au gouvernement d'étudier l'état mental de Riel plus sérieusement qu'on n'avait pu le faire dans la hâte du procès ; elle lui demanda de nommer une commission d'experts pour faire cette étude à loisir et pour que leur rapport, motivé et raisonné, pût établir d'une manière satisfaisante pour le public, si Riel était ou non responsable de ses actes.\n\nLe gouvernement pouvait, sans sacrifier la moindre parcelle de ce qu'il pouvait considérer comme les droits de la justice, nommer cette commission ; l'équité même, à défaut de toute autre considération, l'exigeait, puisque le Dr Clarke qui avait été entendu à Régina, avait déclaré qu'il était impossible de juger, dans une ou deux entrevues d'une demi-heure chacune, de l'état mental du prisonnier.\n\nEnfin, des membres du gouvernement avaient formellement promis la nomination de cette commission. Or qu'est-il arrivé ?\n\nLes ministres ont failli à leur promesse ; le gouvernement a fait fi de la prière d'un million et demi de citoyens du Canada ; il a eu peur—est-il possible de lui prêter un autre motif ? —il a eu peur que le rapport d'une commission vint lui enlever la victime qu'il se proposait de livrer aux haines orangistes.\n\nSir Alexandre Campbell a-t-il essayé de justifier cela ? Non ; il n'en dit pas un traitre mot.\n\nIl est bon d'ajouter toutefois que l'on a appris, la veille de l'exécution, par les dépêches adressées aux journaux, que trois médecins—dont aucun n'est connu pour avoir fait des études spéciales sur le sujet—avaient été mandés strictement à Régina et qu'ils avaient vu deux ou trois fois le condamné ; l'un d'eux prétend qu'ils n'ont fait aucun rapport.\n\nDans tous les cas, si on compare les dates, il est facile de constater qu'il leur était matériellement impossible de faire un rapport qui put arriver à Ottawa avant l'exécution de Riel ; et de fait, pendant même que ces médecins examinaient Riel, le mandat d'exécution, signé par le Gouverneur en Conseil, était en route pour Régina ! !\n\nSir Alexander Campbell voit une contradiction évidente dans le fait de demander la commutation de la sentence, à raison de la prétendue mauvaise administration des affaires du Nord-Ouest, sans cesser d'insister sur le plaidoyer d'insanité. Il est impossible, dit-il, de considérer le prisonnier, à la fois comme le patriote représentant sa race et comme un lunatique irresponsable. Et grâce à cette argutie digne tout au plus du dernier des avocats de cour de police, il se dispense de considérer à la fois comme un patriote et comme un lunatique irresponsable. Il y a contradiction entre les deux préventions, dit-il ; l'une est fausse, donc je n'ai pas à m'occuper de l'autre.\n\nIl devrait bien expliquer au public comment le fait que Riel est maniaque peut prouver que les métis\nn'avaient aucune excuse pour se révolter; et aussi comment le fait que Riel est irresponsable de ses actes peut-être une preuve qu'il n'y a pas eu provocation de la part des employés du gouvernement. Mais les malversations commises au Nord-Ouest, d'après lui, n'ont rien à faire avec ce procès.\n\nEt l'irresponsabilité du chef entraîne-t-elle l'irresponsabilité de ses subordonnés? Ceux qui se font les complices d'un fou doivent-ils être nécessairement irresponsables eux-mêmes? Cette thèse est si absurde qu'il n'y a qu'à l'exposer pour la réfuter. Et cependant, c'est celle que propose Sir Alexander Campbell, quand il dit:\n\n\"On peut aussi se demander, si le chef ne jouissait pas de sa raison, en vertu de quel droit ceux qu'il avait convaincus et qui le suivaient, seraient-ils responsables; et s'ils ne l'étaient pas, qui pourrait être puni pour des crimes qui, sans aucun doute, méritent un châtiment.\"\n\nCeci soit dit, sans admettre la culpabilité des Métis partisans de Riel; car, malgré la prétendue contradiction signalée par le factum, les faits établissent ces deux choses: premièrement, les mauvais traitements, l'incurie, les injustices du gouvernement et de ses employés, s'ils ne justifient pas, excusent, au moins jusqu'à un certain point, leur protestation à main armée; et d'un autre côté, leur chef, sain d'esprit, au commencement de l'agitation, a fini par perdre le contrôle de ses actes, et, emporté par ses hallucinations, a commis, sous l'influence de sa manie, des actes regrettables à tous les points de vue.\n\nIII\n\nLA VÉNALITÉ DE RIEL\n\nC'est là le principal argument dont le gouvernement, ses défenseurs et ses organes, se sont servis pour faire perdre à Riel la sympathie de ses coreligionnaires et de ses compatriotes.\n\nIls s'appuient sur le fait que Riel aurait demandé au gouvernement d'abord $100,000, puis $35,000. Ce fait est rapporté par le Père André, et par M. Nolin, dont les dépositions ont été reproduites dans toute la presse restée fidèle au gouvernement.\n\nIl suffirait peut-être, pour y répondre, de faire remarquer que, malgré cela, le Père André est resté un admirateur passionné du caractère de Riel, abstraction faite de sa manie et des actes qu'elle lui a fait commettre. Mais le présent travail serait incomplet s'il laissait subsister le moindre doute contre Riel sur ce point.\n\nD'abord, Riel a-t-il, précédemment, donné à soupçonner qu'il était vénal?\n\nSi réellement, Riel eut été, comme dit le gouvernement, un homme vénal; s'il eut été prêt à vendre la cause des métis pour un avantage personnel, il lui eut été facile, à plusieurs reprises, de réaliser cette ambition. Voilà un homme qui a joué un rôle considérable, au Manitoba, en 1869 et 1870, qui a été chef d'un gouvernement populaire, jouissant d'un pouvoir à peu près absolu. A-t-il profité de cette position pour faire sa fortune, comme tant d'autres ont profité de leur position de ministre? a-t-il été plus riche, après la paix qu'il l'était avant? se faisait-il même payer un salaire?\n\nEn 1871 pendant que le Canada redoutait l'invasion des fénians,\n\n\"Le Lieutenant-Gouverneur de Manitoba, au nom de Sa Très Gracieuse Majesté la Reine, invita tous les habitants à la défense du territoire et demanda spécialement les services de Louis Riel et de Ambroise Didyme Lépine. Le dit Lieutenant-Gouverneur communi-\n\nqua officiellement et par écrit à ce sujet, avec les dits Louis Riel et A.D. Lépine qui, conjointement avec S. Parenteau, levèrent un corps considérable d'hommes, leurs\n\"services furent acceptés ; le Lieutenant-Gouverneur donna une poignée de main à Louis Riel et à A. D. Lépine et passa en revue le bataillon qu'ils commandaient.\"\n\n(Rapport du comité de la chambre des communes sur les troubles du Nord-Ouest, 1875.)\n\nRiel a-t-il profité de cette occasion pour se faire payer une indemnité ?\n\nAprès avoir vécu, pendant cinq ou six ans, de la charité de ses amis, Riel va s'établir au Montana et y vit pauvrement, mais tranquillement. Les délégués Métis viennent le trouver ; lui apportent-ils de l'argent ? Lui offrent-ils de lui payer un salaire ? Riel part avec sa famille, et depuis ce temps, il a toujours vécu chez des amis et des partisans, allant d'une maison à l'autre, reçu et hébergé avec l'hospitalité traditionnelle des métis, mais sans jamais demander d'argent. Même dans ses actes inspirés par ses malheureuses hallucinations, ce désintérêt absolu subsiste. Il recommande à ses partisans de saisir les munitions et les vivres, ce qu'il faut pour l'entretien d'un corps armé ; voit-on, dans toutes ses lettres, publiées par le gouvernement et par les journaux, une seule mention de l'argent qui cependant, devait se trouver, en une abondance relative, aux postes de la Baie d'Hudson ?\n\nNon, et son désintérêt s'explique par son éducation, sa manière de vivre et celle de son entourage. Les Métis vivaient de chasse et de pêche, ou des produits du sol. Mais comme ils étaient absolument dépourvus de marchés pour leurs produits, tout produit de la chasse, comme tout produit de la ferme était vendu à la compagnie de la Baie d'Hudson qui payait en provisions ce qu'il lui était apporté. L'argent était à peu près inconnu parmi la population métisse qui n'en connaissait guère la valeur. Et très probablement, Riel lui-même, malgré son éducation à Montréal, ne se faisait aucune idée de ce que représentaient en valeur les $100,000 qu'il réclamait du gouvernement.\n\nComment donc lui est-il venu à l'idée de réclamer du gouvernement d'abord $100,000, puis $35,000 ? Voici ce que Riel dit lui même du pays des Métis :\n\n\"Pour faire une estimation quelconque des terres sauvages du Nord-Ouest avant la Confédération, disons à la première idée venant, que ces terres valaient à l'Indien quinze cents l'acre. En prenant cette modeste.\n\nEVALUATION POUR POINT DE DEPART\n\nles Sauvages du Nord-Ouest, avec leur sol de 597,860,000 acres en superficie, possédaient un bien-fonds valant comme $89,679,000.00.\n\nMais il y a ici même une considération à intercaler dans ces aperçus ; les Métis, sans avoir le don d'utiliser la terre, d'après les développements et les ressources d'une civilisation avancée, la bâtissaient cependant, la labouraient, la clôturaient et l'employaient à beaucoup plus grand avantage que ne faisaient les Indiens ; à ce point qu'elle valait dans le moins deux fois plus aux qu'aux Sauvages, c'est-à-dire pendant que l'Indien pouvait raisonnablement demander 15 cents pour son acre, le Métis était en droit d'en exiger 30 pour le sien.\n\nLa moitié métisse du Nord-Ouest, 597,860,600 acres, équivalait donc à un capital d'au moins près $179,358,000.00.\n\nVoilà de combien les Métis étaient riches en valeur foncière de leur pays, avant la Confédération.\"\n\nPlus loin, dans le même document il fait remarquer que les métis étaient propriétaires du sol : lo par hérédité, comme descendant des sauvages dont le gouvernement a reconnu les droits, puisqu'il les a achetés ; 2o par la possession incontestée qu'ils en avaient depuis longtemps ; 3o par les améliorations qu'ils y avaient faites.\n\nOr, le premier acte du gouvernement, en s'installant au Manitoba, a été de s'emparer, pour le domaine fédéral, de toutes les terres, sans exception, de celles qui étaient habitées et cultivées, comme des autres. Le Manitoba, par son parlement, protesta encore contre cette spoliation.\nLe Canada avait, il est vrai, traité avec les métis, lors de l'entrée du Manitoba dans la confédération, et nombre d'entre eux ont reçu en terres ou en scrips une valeur quelconque représentant leurs droits au sol. Mais Riel n'a rien reçu de ce genre et il prétendait (avec une foule de gens honorables du Manitoba) que le gouvernement avait manqué à ses promesses et violé le traité conclu en 1870. Riel ne se considérait donc point lié par ce traité, et il s'est cru libre de réclamer la pleine valeur de ses droits.\n\nQue sa réclamation puisse paraître exagérée, cela n'a rien d'étonnant, mais cela ne prouve pas non plus, per se, qu'elle ait été faite de mauvaise foi.\n\nCe qui pourrait cependant faire croire à la mauvaise foi, c'est qu'il ait consenti aussi facilement à réduire ses prétentions à $35,000. (Voir la déposition du Père André.) L'emploi qu'il voulait faire de cet argent donne l'explication naturelle de ce changement.\n\nRiel avait vu dans les journaux que le journal Le Monde avait coûté $35,000 à ceux qui l'ont acheté de M. Houde ; que La Minerve, elle-même, avait été vendue le même prix quelque temps auparavant. Ce chiffre représentait donc pour lui le coût de la fondation d'un journal, et son rêve, son ambition, était de fonder un journal pour défendre la cause des Métis. Il avait de l'influence de la presse une opinion peut-être exagérée, mais que beaucoup de gens partagent. Châteaubriant, au lendemain de la révolution de Juillet 1830, disait :\n\n\"Qu'on nous donne la liberté de la presse et je ramène le roi en six mois\". Riel s'imaginait qu'un journal pour défendre leur cause, serait beaucoup plus utile aux métis que l'agitation constitutionnelle qu'ils faisaient alors. C'est pour cela qu'il disait au Père André : \"Si je suis satisfait, les métis le seront.\"\n\nQu'on ne dise pas que c'est là une thèse faite à plaisir : elle est basée sur des faits et voici les preuves :\n\nD'abord une lettre publiée dans l'Étendard du 25 novembre dernier :\n\n\"Monsieur le Rédacteur,\n\nA propos des 35,500 piastres, voici ce que j'en connais, je ne crains pas d'être démenti. On sait que ce qui a ébranlé le cerveau de Riel, c'est de voir ses compatriotes disparaître, sa belle langue française menacée par la trahison et l'esprit de parti qui fermaient la bouche à une députation sur laquelle il avait compté. Un matin, il eut une vision, c'est ce qu'il déclara à l'un des missionnaires. La plume lui parut plus forte que l'épée. Pour sauver sa patrie, il lui fallait un journal pour faire connaître au monde toutes les souffrances de ses compatriotes ; il se rappela que Cartier lui avait offert $35,000 pour ses droits comme métis.\n\nSi on me les accorde, se dit-il, alors ma patrie est sauvée, je vais faire instruire des métis qui m'aideront dans mon œuvre.\n\nIl revit le père André 20 fois après, la vision ne revint plus qu'une fois seulement pour disparaître de nouveau.\n\nCeux qui sont au fait des \"plans\" de Riel, savent que la fondation d'un journal était son rêve.......\n\nJe suis avec considération\n\nVotre, etc.\n\nUN AMI.\"\n\nVoici maintenant ce que dit Chs. Nolin, témoin de la Couronne, dans le procès de Riel, et dont le témoignage est cité par Sir A. Campbell :\n\n\"Au commencement de décembre 1834, il commença à exprimer le désir d'avoir de l'argent. C'est à moi qu'il en a d'abord parlé.\n\nQ. Combien voulait-il avoir ?—La première fois qu'il a été question de cette affaire, il parlait de $10,000 à $15,000.\n\nQ. De qui voulait-il avoir cette somme ?\n\nR. La première fois qu'il m'en a parlé, il n'avait pas de plan précis pour trouver cet argent. En même temps, il me dit qu'il avait l'intention de formuler une demande d'indemnité contre le gouvernement du Canada. Il me dit que le gouvernement lui devait $100,000 et ensuite il fut question de savoir qui serait chargé de réclamer cette indemnité.\n\nQ. Le prisonnier vous a-t-il dit ce qu'il ferait si le gouvernement lui payait cette indemnité ?\n\nR. Oui.\n\nQ. Que vous a-t-il dit ?\nR. Il me dit que s'il obtenait l'argent qu'il voulait avoir du gouvernement, il irait où le gouvernement voudrait l'envoyer. C'est ce qu'il a dit au Père André. S'il était un embarras pour le gouvernement, il irait dans la province de Québec. Il dit que, s'il obtenait de l'argent, il irait aux États-Unis et qu'il publierait un journal pour soulager les autres nationalités dans les États-Unis. Il dit : \"Avant que l'herbe atteigne cette hauteur dans le pays vous y verrez des armées étrangères.\" Il ajouta : \"Je commencerai par détruire le Manitoba et ensuite, je viendrai anéantir le Nord-Ouest et en prendre possession.\"\n\nVoilà donc la véritable explication de cette réclamation de $35,000 dont on a fait tant de bruit contre Riel ! De la vénalité, chez cet homme, lorsque tout dans sa vie crie le contraire, et lorsque ceux qui l'en accusent se nomment J. A. Chapleau...... etc.\n\nMais après avoir formulé cette infamie, Sir A. Campbell ajoute : \"... Il aurait été nécessaire, au moins de faire tomber cette accusation qui se dressera toujours contre lui ; .... qu'il était décidé à exécuter ses desseins en attirant, sur une population inoffensive, toutes les horreurs d'une guerre indienne.\"\n\nLe ministre n'ose pas accuser carrément Riel, comme le faisait l'administrateur de La Minerve, l'autre jour, d'avoir excité les sauvages au meurtre, au viol, au pillage. Ce n'est pas, il faut en être sûr, faute de bonne volonté, mais c'est que la preuve du contraire existe, et que le ministre, qui a été obligé de fournir cette preuve devant la Cour de Régina, n'ose se contredire ouvertement. Il se contente donc d'insinuations. Ce que comporte réellement son accusation, c'est d'avoir excité les sauvages à prendre les armes.\n\nEn 1869, M. McDougall, voulant prendre le gouvernement d'un territoire, qui n'appartenait pas à la Confédération, en vertu d'une commission émanant du gouvernement canadien, se vit refuser l'entrée du Nord-Ouest, par les habitants de ce pays.\n\nLe 1er Décembre, 1869, \"M. McDougall lance une proclamation par laquelle il nomme John Hongton Dennis, son lieutenant et conservateur de la paix dans le Nord-Ouest, et, à ce titre, l'autorise à lever, organiser, armer, équiper, et approvisionner une force suffisante dans le dit territoire et avec la dite force, à attaquer, désarmer et disperser les susdits hommes armés, à assaillir, faire feu, abattre, renverser ou enfoncer tout fort, maison, retranchement, ou autre place etc.......\n\n\"Sur ce, le colonel Dennis, employé Canadien nommé par un soi-disant Lieutenant-Gouverneur Canadien, pénètre dans un territoire qui n'appartient pas au Canada, se saisit d'un fort, le garnisonne avec des sauvages, fait appel aux armes, et, de fait, enrole armé et équipe tous ceux qui répondent à son appel.\"\n\n(Mgr. Taché, L'Amnistie, page 34).\n\nEh bien, M. Campbell, voici un homme \"qui était décidé à exécuter ses desseins en attirant sur une population inoffensive toutes les horreurs d'une guerre indienne!\" Crime que vous considérez comme plus noir encore que celui de haute trahison. Quel châtiment a donc été infligé au Colonel Dennis ?\n\nVoici un autre document :\n\n\"Mes chers parents :\nNous vous remercions pour les bons sentiments et les sympathies que vous exprimez dans votre communication du 23 août.\nAyez courage. Puisque vous êtes disposés à nous aider, nous acceptons vos bonnes offres et nous ne vous laisserons pas exposés au danger. Que Dieu vous bénisse dans toutes vos bonnes intentions. Qu'il dirige toutes vos actions.\n\nLa justice exige que nous prenions les armes dans l'intérêt de notre salut commun. Prévenez les sauvages des bois, afin qu'ils ne soient point surpris. Tout en restant calmes et courageux, qu'ils soient prêts à saisir toutes les munitions, chefs et marchandises appartenant à la Cie. de la Baie d'Hudson, au Lac au Canard et au Lac à la Biche.\"\n\"Ne tuez, ni ne molestez, ni ne maltrai-\ntez personne inutilement, mais emparez-\nvous des armes.\"\n\nLOUIS DAVID RIEL.\nEx-ovile.\n\nPar. \"WILLIAM JOSEPH JACKSON,\nSecrétaire particulier.\nSt. Antoine, 25 mars 1885.\n\nAu chef MARKA OGAN,\nA M. ANTOINE ROSE BLANC.\"\n\nVoilà une de ces appels aux armes\nadressés aux sauvages et il est signé\npar Jackson, le secrétaire de Riel.\nÀ quelle potence a-t-on attaché Jack-\nson ? Il est aujourd'hui en train\nde faire tranquillement des confé-\nrences aux États-Unis sur les trou-\nbles du Nord-Ouest.\n\nOn voit de suite que cette accusa-\ntion n'est si formidable que parce-\nqu'elle est portée contre un métis\ncanadien et catholique. Elle est\nd'ailleurs fausse en ce point,\nque ce n'est pas Riel qui a\nsoulevé les sauvages ; mais que\nles sauvages, mourant de faim au-\nprès du lard pourri et du blé\ngelé de Dewdney, lui ont offert leur\nconcours ; qu'il a eu le tort de l'ac-\ncepter ; et ensuite, de diriger leurs\nmouvements mais de trop loin pour\npouvoir se rendre compte des dispo-\nsitions à commettre les plus déplo-\nrables excès, qui existaient chez cer-\ntaines parties de ces bandes.\n\nSir Alexander Campbell fait re-\nmarquer que, dès le commencement\ndes hostilités, Riel avait dans sa trou-\npe, un certain contingent de sauva-\nges ; mais ces sauvages ne se sont con-\nduits ni mieux ni pis que ses métis,\net n'ont, en définitive, ni tué, ni vio-\nlé, ni pillé. Piét à Dieu qu'on put\nen dire autant des volontaires du gé-\nnéral Middletón !\n\nIV.\n\nLA PEINE DE MORT APPLIQUÉE AU\nCRIME DE HAUTE TRAHISON\n\nQue le fait de révolte seul soit\npuni de mort, dit le défenseur du\ngouvernement, c'est une question\nsur laquelle les opinions peuvent\ndifférer. C'est vrai ; d'un côté toutes\nles nations civilisées sont d'opinion\nque les crimes politiques ne doivent\npas être punis de mort ; on peut\nciter l'Angleterre, la France, l'Al-\nlemagne, l'Autriche, l'Italie, l'Espa-\ngne, et les États-Unis.\n\nDe l'autre côté, les nations semi-\nbarbares appliquent encore, dans ce\ncas la peine de mort ; on peut nom-\nmer la Russie, le Mexique et le Ca-\nnada. Triste compagnie !\n\n\"Dans le cas qui nous occupe,\nc'est une récidive accompagnée com-\nme la première rébellion, de meur-\ntres commis par l'ordre direct et im-\nmédiat du prisonnier.\"\n\nSir Alexandre Campbell, en écri-\nvant cela, a oublié qu'il n'a pas\nprouvé, qu'il n'a pas même allégué,\ndans son factum, un meurtre com-\nmis par l'ordre immédiat, et direct\nde Riel. Il est impossible de parler\nde meurtre à propos des combats\nlivrés entre les insurgés et les trou-\npes ; ça sont là des faits de guerre,\ndes faits de la révolte qui sont\nd'une nature essentiellement politi-\nque.\n\nD'ailleurs, par l'accusation portée\ndevant le juge Richardson, le gou-\nvernement le reconnaît, puis-\nqu'au lieu de poursuivre Riel\npour meurtre, il l'a poursuivi\npour haute trahison. Donc, il est\nfaux que la révolte ait été accompa-\ngnée de meurtres commis par l'ordre\nimmédiat de Riel, comme cette accu-\nsation était fausse à propos de la mort\nde Scott en 1870.\n\nIl n'y a pas non plus récidive.\n\nEn 1869, lorsque M. McDougall\nvoulut pénétrer, et exercer le gou-\nvernement dans un territoire qui\nn'appartenait pas au Canada, les habi-\ntants de ce territoire refusèrent de\nreconnaître son autorité. Et n'en\navaient-ils pas le droit ? Le gouver-\nneur pour la Cie de la Baie d'Hud-\nson, M. McTavish, s'étant démis de\nses fonctions, les habitants du pays\norganisèrent un gouvernement pro-\nvisoire, parfaitement régulier, et\navec lequel le Canada a débattu les conditions de l'admission du Manitoba dans la Confédération, de la même manière que depuis il a négocié avec le gouvernement de la Colombie Anglaise et de l'Ile du Prince Édouard.\n\nLes délégués de ce gouvernement provisoire ont été reçus et reconnus comme tels à Ottawa, par le gouvernement fédéral, et au ministère des colonies, à Londres, par Lord Granville.\n\nCe gouvernement avait l'assentiment des autorités de la compagnie de la Baie d'Hudson elle-même, et l'honorable Donald A Smith conseilla fortement au peuple d'élier sans retard ses délégués au gouvernement provisoire. (Mgr Taché, L'amnistie, page 46.)\n\n\"L'effet sur les immigrants, dit encore le ministre, de la moindre faiblesse dans l'administration de la justice ; et les conséquences qui résulteraient dans ces régions si l'on venait à croire que des crimes comme celui de Riel pouvaient se commettre, sans encombrer l'extrême rigueur de la loi, par le premier individu qui serait sujet à des hallucinations ou qui pourrait faire croire aux autres qu'il y est sujet.\"\n\nVoilà le seul argument spécieux de ce volumineux factum, et la conclusion en est celle-ci : Pour attirer les émigrants au Nord-Ouest, il était nécessaire de pendre Riel, qu'il fut ou non sujet à des hallucinations ; qu'il fut sain d'esprit ou qu'il fut fou !\n\nAinsi voilà tout ce que le gouvernement avait à dire pour sa défense ! Il n'est, dans ce factum, pas un argument qui n'ait déjà servi vingt fois aux journaux ministériels et qui n'ait été vingt fois réfuté ; il n'en est pas un seul qui puisse soutenir un examen sérieux. La cause est désormais entendue, et le peuple va prononcer son verdict.\n\nIl est donc bien entendu, que les ministres Canadiens-Français ne se sont jamais opposés à ce que la sentence de Riel fût exécutée ; que le gouvernement en a été réduit, pour obtenir cette sentence, à faire juger Riel par un Richardson, et six jurés ; que Richardson a pesé de toute son influence sur le jury pour en obtenir un verdict de culpabilité ; qu'il avait eu soin de choisir ces jurés parmi les ennemis naturels de Riel et de sa cause.\n\nQue malgré cela, les jurés ont recommandé le prisonnier à la merci de la cour, recommandation dont ni la cour, ni le gouvernement n'ont jugé à propos de tenir compte. Que la preuve, telle qu'on a pu la faire, laissait au moins un doute sur l'état mental de Riel, doute dont on devait donner le bénéfice à l'accusé.\n\nQue Jackson a été reconnu aliéné, par le gouvernement parcequ'il avait les mêmes idées religieuses et politiques que Riel.\n\nQue la plus révoltante partialité a été mise en œuvre pour faire condamner Riel, et que le gouvernement n'a pas tenu compte de sa propre responsabilité, comme instigateur des désordres du Nord-Ouest, lorsqu'il a délibéré sur le sort de Riel.\n\nEt enfin que les plus noires calomnies ont été lancées dans le public pour détruire la sympathie que les Canadiens-Français pouvaient avoir pour Riel et pour sa cause.\n\nAprès avoir lu les pages de ce memorandum où la mauvaise foi suinte entre chaque ligne, tout homme sensé, tout homme éclairé, et au fait de ce qui s'est passé, s'écriera : Honte à vous ! Le Canada est un pays civilisé, et, dans un pays civilisé, on ne pend pas les condamnés politiques ; on ne pend pas les maniaques ; on ne pend pas les gens pour avoir secouru des opprimés, pour s'être sacrifiés à une cause juste, méritoire ; on ne pend pas un homme qui s'est constitué prisonnier et à qui on a promis la vie sauve ! Orangistes et traitres, la vengeance du peuple est sur vous ! Jourdain.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001475.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 19836, "total-output-tokens": 14518, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2370, 1], [2370, 5789, 2], [5789, 9292, 3], [9292, 12825, 4], [12825, 16353, 5], [16353, 20250, 6], [20250, 23748, 7], [23748, 27317, 8], [27317, 30809, 9], [30809, 34634, 10], [34634, 38593, 11], [38593, 42441, 12], [42441, 45896, 13], [45896, 49460, 14]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]