[{"id": "2b82ae271673231b2685d810f6c7206ebc202ed4", "text": "THE RIEL REBELLION.\n\nHOW IT BEGAN—HOW IT WAS CARRIED ON—AND ITS CONSEQUENCES.\n\nSUCCINCT NARRATIVE OF THE FACTS.\n\nHALF-BREED GRIEVANCES.\n\nIn beginning the thorough study of the Riel question, the grievances of the half-breeds form the most prominent point. There is no need to follow those who, with one object or another, go back to the rebellion of 1869-70 and try to seek in it for causes and effects in some respects foreign to the present question. In taking this course, we have the authority of Louis Riel himself, who immediately on his return to the North-West declared before a large meeting of the half-breeds, which he had convoked: \"The Riel of 1869 and he of 1884 are two very different men. In '69 he rose against Canada, which sought to take possession of the country without making a previous arrangement to guarantee the rights of the population of Manitoba and the North-West. But today the North-West is an integral part of Canada, and after an experience of nearly nine years passed in the United States, he can assure his fellow-countrymen, the half-breeds, that they are better on this side of the line, and that he does not wish them to become Americans.\" (Letter from Father André to Lieutenant-Governor Dewdney, 21st July, 1884.) These words of the half-breed chief prove conclusively that he himself considered the Government of Canada as perfectly legitimate, and that, in his opinion, there was a clearly drawn line of demarcation between the events of 1869-70 and those whose history we are now about to attempt writing.\n\nThese grievances, so far as it has been possible for us to ascertain, are reduced, at the moment of Riel's arrival, to the six following:\n\n1. The half-breed settlers did not receive letters patent for their lands, in consequence of delays for which the Government alone was responsible, and by which they were prevented from obtaining the lands on which they were settled.\n\n2. That in consequence of the system of survey, they could not obtain the lands on which they had settled and improved previous to the survey.\n\n3. That they were entitled to the same rights as those granted to the half-breeds of Manitoba.\n\n4. That the lands which they had resided on for years, had been sold to others, principally speculators, in disregard of their rights.\n\n5. That the timber dues were very onerous and a serious cause of dissatisfaction.\n\n6. That the dues for cutting hay on Government lands were also onerous and produced a deep feeling of discontent.\n\nLet us examine these six grievances.\n\n1. The half-breeds claim letters patent for their lands.\n\nIt appears from the papers; that contrary to the assertions of the half-breeds, it was not so much the Government as the half-breeds themselves who were to blame.\n\nHere is what Mr. Pearce's report says on this subject:\n\n\"During my first visit to Prince Albert, in August, 1883, I instructed Mr. Gauvreau, then assistant agent, a French Canadian, to visit every French settler, half-breed, or otherwise, in the district, ascertain what particular quarter-section he was on, and urge him to make entry. This he did; but although the Roman Catholic priest urged them in a like\n\"manner, for some reason or other they failed to do so. Some were deterred through\n\"ignorance, thinking that they would have to pay taxes; others have stated that they feared\n\"if they did so the Government might call upon them to bear arms, but against what foe does\n\"not appear to have been very clear to them. Like all ignorant people, a few designing,\n\"mischievous men who have their ear, can work on their ignorance and prejudices for the\n\"advancement of their own selfish ends. This is particularly noticeable in the case of those\n\"who settled subsequent to survey along the South Saskatchewan River.\"\n\nFurther on Mr. Pearson says:\n\n\"In March 1884, I instructed Mr. George Duck to proceed to the parish of St. Laurent\n\"to take evidence in support of those claims there, and all others above and below the same.\n\"He engaged the services of the Rev. Father André to assist him in explaining to these people\n\"the object of his visit; he obtained applications from nearly all the claimants, from the\n\"upper part of the settlement down to the south limit of Township 45, Range 1, west 2nd.\n\"In this Township, owing to a bend in the river, there were several disputed claims, which\n\"at the time could only be arranged by making a traverse of the improvements, which is now\n\"being done. If, at the time of survey, these claimants in said portion of Township 45 had\n\"furnished the surveyors with the information necessary to adjust their claims, they could\n\"have been settled so soon as this Township was open for entry, viz., September, 1881; but,\n\"since then, through transfers and settlement by others thereon, they have become very coin-\n\"plicated. If, at any time since then, these parties in said portion of Township 45, had\n\"united and furnished the Department, by means of survey, with the information necessary,\n\"the whole matter might have been arranged and entry granted long since. Below that\n\"point the settlers had taken up their claims in such a way that, with the information on the\n\"Township map, the river keeping across the entire lands claimed in an almost due easterly\n\"course, it was not deemed necessary to visit them on the ground to adjust the claims;\n\"these parties it was thought would be able to state, on application at the office, what lands\n\"were claimed by them. Many, although notified, to make their applications for entry,\n\"refused to do so, in some cases purposely leaving their houses when visited for that purpose,\n\"and acting in this manner although urged by their priests and others to do as requested.\"\n\nIs there not here an evident proof of culpable negligence, not of bad faith, for which the\nGovernment can in no degree be held responsible? The result has proved that if the Gov-\nernment were slow in giving effect to the claims of the half-breeds, there were excellent\nreasons.\n\nThus the petitions addressed by the half-breeds to the Government from 1872 to 1884,\nbear altogether 854 signatures. These different petitions did not all come from the neighbour-\nhood of Batoche nor from the scene of the rebellion; on the contrary, those which were sent\nfrom Qu'Appelle, from Cypress Hills, from the Blackfoot Crossing and from Edmonton,\nlocalities more than 500 miles from the Prince Albert District, had 615 names, leaving 241\nnames for the Districts of Batoche, Duck Lake, St. Laurent, St. Louis de Langevin and Prince-\nAlbert.\n\nOf the 241 petitioners, 99 had received many years before, land and scrip in Manitoba,\nand consequently had no claim, 40 took their letters patent before the Commission of 1885,\nand the other 102 have not been able to prove their claim.\n\nIn presence of such a state of things, can it be reasonably maintained, that the Govern-\nment would have been justified in granting the demands of the half-breeds without examina-\ntion, and simply on their petition?\n\n2. The half-breeds protest against the system of surveying their lands, and demand that\nin future they shall be divided into river lots of two miles long by ten chains wide.\n\nThis question raised most serious difficulties and a new survey would have been very expen-\nsive; on the other hand, the settlers did not agree on this question, and the Government did\neverything possible to bring them to a practical understanding.\n\nOn the 19th November, 1883, a certain number of the settlers protested to the Govern-\nment against the action of one of themselves, Michel Canny, who had made an entry for his\nland as a square lot, whilst they wished theirs to be laid out in river lots, and asserted that\nthey had all come to an understanding not to make entries. This disposition of the settlers\nhad the inevitable effect of multiplying the difficulties and hindering the action of the Gov-\nernment agents.\n\nThe third claim had no reason for being put forward, as the state of things was exactly\nthat asked for, only the half-breeds neglected to conform to the regulations.\n\n4. That the lands upon which they had long resided had been sold to others. This\nstatement is unfounded; for no half-breed has ever been disturbed or dispossessed of his\nproperty, although more than one subsequently installed himself on Canadian Pacific Railway.\nlands, and we challenge anyone whatever to cite the name of a single half-breed settler who has been illegitimately dispossessed of a single acre of land.\n\n5. The timber dues are onerous. Let us see what is in this statement. Read what the report of Mr. Pearce, the superintendent says:\n\n\"The amount collected as timber dues, from all the settlers embraced in these three lists since the establishment of a Crown Timber Office, amounts to $30.25, which, divided by 258 the number of claimants, amounts to 31 cents each for two years, or at the rate of 15½ cents each year for each settler. Of that amount $55.25 was paid by four settlers for timber dues for erection of stores and shops, leaving $25 which has been paid by the remaining 254 settlers as office fees on homestead permits, known as free permits—10 cents for each settler for two years, or at the rate of 5 cents per settler per annum.\"\n\n6. The cutting of hay. The same report shows what this claim is worth.\n\n\"As you are aware the object of hay permits was to protect the small settler against the large stockman or speculator, and it has always been optional with settlers whether they took out permits or not. If they chose they could continue the practice of the past by cutting hay anywhere. This has been explained to these people. They have never been asked to take out any permits or pay any dues, the hay being plenty and no large stockmen or speculators to interfere with them. The hay for the town of Prince Albert, or any large stockmen in that district, has been obtained elsewhere than in the neighbourhood of these settlers.\n\nThis is what is left of these famous grievances about which so much noise has been made.\n\nFACTS AND DATES.\n\nThe delegates, Gabriel Dumont, J. Isbester, Moise Onellette and M. Dumas, arrived at the Mission of St. Peter (Helena), Montana, on the 2nd of June, 1884. The said delegates invite Riel to come to the Saskatchewan on the 3rd of June, 1884. Riel accepts the invitation by letter dated the 5th of the same month, resigns his employment on the 9th, and departs with his family on the 10th June, 1884. They arrive at Prince Albert about the 1st of July following. He holds several pacific meetings. The 7th July, 1884, the Rev. Father André writes to Prince Albert, to Lieutenant-Governor Dewdney, that Riel is acting peacefully, and that he does not seem dangerous, if the authorities do not molest him. On the 21st of the same month, writing to the same official personage, the Rev. Father André recommends him not to disturb Riel, in spite of what some people might request. Riel is still peaceable. The French and English half-breeds hold meetings, on different dates, at which Riel speaks with calmness, politeness and persuasive eloquence. The half-breeds open a list of subscriptions for the support of Riel in August, 1884. On the 12th December, 1884, Riel speaks of his claim of $100,000 to the Rev. Father André. On the 23rd of the same month he promises to leave the country if the Government gives him $35,000. On the 27th February, 1885, he speaks of his claim of $35,000 to Charles Nolin. On the 24th February, 1885, Riel holds a meeting, in the course of which he speaks of his return to the United States. Some half-breeds, engaged for this purpose on his request, cry: No! No! No! On the 27th of the same month he speaks to Charles Nolin of his claim of $35,000. Towards the end of February he accuses the Bishop Taché and Grandin of being rogues and thieves (testimony of George Ness, J.P., at the trial of Riel). On the 28th February Charles Nolin receives from McDonald a telegram announcing that the Government is going to give effect to the requests of the half-breeds. He communicates this telegram to Riel the following Sunday. On the 4th of March a telegram from the Government announces that the scrips are granted. On the 4th March Riel has a meeting at Batoche, where the half-breeds present themselves in arms. He has a dispute with Rev. Father André. On the 5th March Riel explains to Nolin his plan of insurrection. Nolin rejects the plan and proposes to have a nine days retreat at St. Joseph and then to act according to their conscience. This proposition is accepted by the half-breeds in spite of Riel, who tries to hinder the half-breeds from going. On the 17th March Riel visits the half-breeds and invites them to come in arms to Batoche, to assist at the baptism of his Secretary Jackson, on the 19th March, St. Joseph's Day. On the 18th the half-breeds take up arms and meet at Batoche. On the 18th Riel circulates the report that the police are coming to take them. He proclaims the church at Batoche, ejects from it the Rev. Father Moulin, appoints his council and commences to make prisoners, the same day. On the same day he arrests Boyer and Nolin in the church, while they are assisting at mass. He proclaims himself a prophet, presides at the pillage of the shops of Walters, Baker and Kerr. He declares that the time has come when he must govern the country or perish in the attempt.—(Testimony of Dr. Willoughby).\nOn the 19th March the church at Batoche serves as a barracks, restaurant, council chamber. He continues to make prisoners. Condemns Leger and Nolin to be shot because they will not join him. On the 20th March Riel causes himself to be proclaimed prophet by his council. On the 21st March he demands from Major Crozier the surrender of Fort Carleton. On the 22nd, 23rd and 24th March he makes prisoners to be used as hostages. On the 25th March is the battle of Duck Lake. On the 2nd April, 1885, Indians instigated by Riel, massacre the Reverend Fathers Marchand and Faflard and other whites at Frog Lake. The operations of the rebellion continue. The Canadian Government put the army on a war footing to supplement the North-West police. On the 6th April General Middleton marches on Batoche, the stronghold of the rebels. On the 2nd May is the battle of Cut Knife Hill. On the 9th May commence the military operations before Batoche. On the 12th May the fortifications of Batoche are taken by assault, the prisoners set free, the rebels and Riel in flight. On the 16th May Riel, carrying a saddle and bridle and looking for a horse, is captured by scouts Armstrong and Hourie and brought to General Middleton's camp. From there transferred to Regina under the conduct of Capt. Holmes Young.\n\nTHE REAL MOTIVE OF RIEL.\n\nWhen his defendants of today (the Honorable Mr. Blake at their head) promised a reward of $5,000 to whoever would arrest him, Louis Riel escaped the danger, thanks to the pecuniary succour of Sir John A. Macdonald. He promised at that time to exile himself and not to come back to this country. Far from keeping his word the half-breed chief hid himself for a long time in different localities at the houses of many friends in the Province of Quebec. It even seems proved that his detention at the asylum of Beauport and Longue Pointe were more or less pretence, and that he enjoyed a certain liberty of action. One might say that these asylums served him as shelter when, in the course of his peregrinations to gain friends in our Province, he thought himself too closely pressed and on the point of being discovered by the blood hounds put on the scent by Mr. Blake's $5,000.\n\nIn spite of his promises Riel never abandoned his plans respecting the North-West, he ruminated on them continually, wove intrigues, and with this end in view kept up his relations with the North-West. \"WHILE STILL IN THE STATES,\" writes Father André, \"RIEL HAD FOR A LONG TIME BEEN STIRRING UP AMONG THE SASKATCHEWAN HALF-BREEDS THE EXCITEMENT WHICH LED TO HIS RECALL TO THE COUNTRY.\"\n\nAfter many trips across the province of Quebec and the United States the agitator established himself at Helena, in Montana, where he enters, in the character of teacher, an educational establishment—directed by the Reverend Fathers, the Jesuits.\n\nIn 1883, as has been proved in the course of the trial of Pierre Parenteau, we see him returning to Manitoba, and there holding secret cabals with Nault and Dumont. In the course of this conspiracy it is agreed between the three conspirators that Nault and Dumont would go through the country, and stir up the people to send to fetch him (Riel). A subscription list was prepared in haste, three meetings were held and before the public of the country knew that he was being sent for, he had arrived.\n\n\"ALREADY FOR FOUR YEARS,\" writes Frère Pignet,—\"HE PREMEDITATED THE TROUBLES WHICH HAVE JUST TAKEN PLACE, AND TRACED THE PLAN OF THEM IN A LETTER WRITTEN BY HIS OWN HAND WITH BUFFALO BLOOD.\"\n\nThe delegates, among whom were comprised those who played the part of supernumeraries in this sinister comedy, arrived at Helena to render account to the half-breed chief of their pretended mission. He, an accomplished comedian, requests two days for reflection. After this delay he makes them the following reply:\n\n\"It is shortest to be frank. I suppose that the counsel which I should give you on this foreign soil concerning the affairs of the Canadian Territory can cross the frontier, and exercise some influence. But there is another question. According to the 31st Article of the Treaty of Manitoba, the Canadian Government owes me 240 acres of land. It owes me also five lots, which are rendered valuable by hay, wood and the vicinity of the river. These lots belonged to me by virtue of the different paragraphs of the same 31st article of the treaty of which I have just spoken: It is the Canadian Government which, directly or indirectly, has deprived me of these properties. Besides, if only the Government examined the thing for a moment, it would easily see that it owes me something more. These claims which I have against it have still their justice, in spite of my having become an American citizen. In your interest, as well as for my own, I accept your kind invitation; I will go and spend some time among you. Perhaps in presenting petitions to the Government, we shall have a chance to obtain something. But my intention is to return early in the autumn.\" (Signed.) LOUIS RIEL.\nCan we not see already in this letter Riel's real plan? To gain a recognition of his claim against the Government. He was not ignorant, however, that his claim had no longer any foundation, not only because he had taken the character of an American citizen, but also because he had been condemned for contumacy in the trial for the execution of Scott.\n\n\"But,\" some will say to us, \"you do not see then, that this man is animated by peaceful sentiments, and that he speaks of returning to his home in the autumn?\"\n\nCertainly! But let us not forget that among the delegates Gabriel Dumont only knew of the comedy being played, and that there was great risk of this latter being spoiled in the first scene if Riel committed the stupidity of exposing his batteries. Here, as in the latter course of events, we see him meritting well the praise of his accomplice G. Dumont. \"He is more cunning than all the others put together.\"\n\nRiel did not cause his own recall, some people protest. This is only the supposition of ill-natured people. Have the goodness to explain to us then how it was that this opinion was generally accredited among the half-breeds as is stated by the superintendent, Wm. Pearce in his report dated 24th December, 1885? Explain to us how it was that several weeks before he received the deputation of half-breeds Riel was able to announce his coming departure to a half-breed of Montana; and promise him the payment of a debt of $200 on his return from the North-West, as the fact has been proved? These facts are proof enough, it seems to us, to make it unnecessary for us to seek others.\n\nRiel arrived at the Saskatchewan about the 1st of July. He begins at once his work of proselytising with calmness and moderation, for he knows that opinions are divided as regards him, and that he has need to act prudently.\n\nOn the 12th of December he speaks for the first time to Revd. Father André of his claim against the Government, and he does so in such terms that there can be no doubt that he has no sympathy for the cause of the half-breeds, and that he wishes simply to raise money for himself personally. On the 23rd of the same month he again insists on the point. He says to the Rev. Father André, who draws his attention to the fact that his claim for $100,000 is exorbitant, \"Wait a little and I will take £5,000 cash down,\" and at this price he was ready to leave the country; adding, \"If I am satisfied so will the half-breeds be.\"\n\nDo not these words lay bare the motive of the rebel, and at the same time give the key to the enigma? If Riel could affirm thus that the half-breeds would be satisfied if he was, does it need a very great effort of the imagination to find in these words the proof that he had himself raised this comedy of delegation and agitation? He knew that he was the soul, the pivot of that fermentation, and that if he were once away the country would be calm again.\n\n\"The object of Riel,\" says again Father André, \"was to personify the cause of the half-breeds, to sell it and to be himself bought by the Government.\"\n\nOn the 27th of February Riel went to Nolin, accompanied by Gabriel Dumont, who pressed him to retire in favor of Riel a tender which he (Nolin) had introduced for the enterprise of a telegraphic line between Edmonton and Duck Lake, \"in order,\" said he, \"to frighten the Government, because it had not responded to his request for indemnity of $35,000.\"\n\nBut when the news arrived from Ottawa that the Government granted the scrips to the half-breeds, without making mention of Riel's claims, the latter became angry, and decided to precipitate events.\n\nWe shall see by what follows with what cunning, with what a diabolic spirit he executed his plan, and how, in his infernal combination he did not falsify the appreciation of his lieutenant. \"He is more cunning than all the rest put together.\"\n\nA DIPLOMATIST AT WORK\n\nWe have seen in contemporary history statesmen greatly eulogized for the cleverness with which they knew how to conduct a political intrigue, and draw from events apparently the least propitious, the most incredible advantages. But we do not hesitate to say that Riel required no lessons from these great diplomatists.\n\nIt is perhaps monotonous to keep repeating the saying of Gabriel Dumont, but the more one examines the actions of the half-breed agitator, the more one is convinced that the lieutenant had correctly judged the chief.\n\nBefore leaving Montana—to which place, let it be said in passing, he had condemned himself by the troubles he had provoked—Riel went to the missionary priest, and he and his family received the blessing. Arriving in the North-West, the first thing he does is to throw himself at the priest's feet, and implore his benediction, and, as Father André says, in his deposition before the court, \"He was a fervent Catholic, frequenting the church and fulfilling often his religious duties.\" Testimonies abound of his religious inclinations. However, the\nRev. Father André declares, that \"he criticised everything. He wanted changes in the mass, the liturgy, the ceremonies, and symbols, which was sufficient to make one suspect that his piety was more external than real.\" However it was, Riel continued to edify the half-breeds by excessive outward devotion, for he knew that there was an ardent faith among this simple and honest population. He knew that his race was much disposed to believe in the miraculous, the supernatural, and it was for this reason that he took the character of a mystical man.\n\nIn fact, from the moment that Riel entered the North-West the petitioning of the half-breeds stopped. This would be a very strange circumstance if we did not find the explanation of it in a letter from the hand of Riel, addressed \"To our brothers the French and English half-breeds of Lake Qu'Appelle and its environs.\" In this epistle Riel writes to his \"very dear relations and friends\": \"Buy all the ammunition you can. If necessary go and procure some from across the line. Be ready. Do not listen to the offers which the Government at Ottawa will make to you. These offers are the offers of thieves. Do not sign further papers or petitions. Trust in the good God.\" (Riel's trial.) This letter is confirmed by the testimonies of Willoughby, Thomas Jackson, etc., to whom he held similar language. This was the way in which this educated man, this guide of the people wished to make a constitutional agitation.\n\nBut one day, at a meeting where Riel was making oratorical efforts, Mgr. Grandin permitted himself to say: \"That is not perhaps the true way to arrive at it.\" From that moment the half-breed chief commenced his warfare against the clergy. He accused the bishops of being rascals and rogues. (Evidence of George Ness.) He says that \"the spirit of God is with him,\" and when the Rev. Father Moulin tells him that he is making a schism in the church, he affirms that \"Rome is fallen.\" (Same evidence.) The priests abandon his cause, because they see the danger, and comprehend to what an abyss his conduct is leading the country. Then he calls himself a prophet, \"he pretends to be a descendant of St. Louis,\" and makes the people believe that \"he was clearly designated in the prophecies of St. Bridget more than two hundred years ago, as the man who was to save the universe.\" (Trial of Parenteau.)\n\nThese affirmations, coming from a man who has always been a model of devotion, make a profound impression on these simple and little cultivated people, who have a thirst for the supernatural, and the object of the rebel is attained. The half-breeds leave their priests to follow the new Mahomet, who will lead them from abyss to abyss to the most frightful ruin.\n\nBut we should be in gross error if we imagined that this was the only care of Riel. While he leads those poor half-breeds to their ruin, with the object of forcing the hand of the Canadian Government, and obtaining from it the adjustment of his claim, for $35,000, he does not lose his bearings, and does not forget to take precautions for concealing his responsibility. On the 12th May he says to Astley: \"I have three chances, or means of escape: first by politicians; secondly, by means of the council papers, you must know that I have arranged all the papers in such manner as to show that the council has done all; I shall not permit myself to be mixed up with the movement. My third means is in my character of chief of the new religion.\" (Trial of Areal and others.) He endeavours besides to make himself welcome to the English half-breeds, whom he greatly desires to draw into the movement, and to this end he has recourse to religious fanaticism. He says to them that \"he has quite separated himself from the Church of Rome, and will have nothing more to do with the Pope, and that they shall pay no more taxes to Rome. That if they remain attached to Rome they cannot unite with the Canadians and the whites who would go there to live, because their government would have to expel all the Protestants from the country if it wished to remain on a good understanding with Rome.\" (Trial of Riel. Testimony of Thomas Sanderson.)\n\nWhen he writes to the Indians he promises them the support of the United States, as appears from a letter which Poundmaker and four other chiefs write to Riel. \"Tell me when the Americans will be at the Canadian Pacific Railway.\" (Trial of Poundmaker.) And to Nolin he says also: \"Before the grass has grown to this height in this country you will see foreign armies here.\" (Testimony of Nolin at the trial of Riel.) He holds this language to several others, with the object of creating intimidation. Then he makes them believe that \"they would be made to suffer unspeakable atrocities if they were made prisoners by the police or the army.\" (Trial of Parenteau and 25 others.) He threatens the Indians on another occasion, and affirms that \"if they do not join him and accept the conditions of the half-breeds, the Americans will take everything from them, and that the Indians will not have the size of THAT,\" cracking his fingers. (Trial of Poundmaker. Testimony of Robert Jefferson.)\n\nBut it is not only diplomacy and menaces that the half-breed chief employs; \"he takes the cattle of the Indians in order to take from them their only means of existence;\" and...\nfree them thus to throw themselves on him. (Trial of Bonnet Blanc.) He says \"Monkman with twenty armed men to free the English half-breeds to join him.\" (Trial of Scott.) Proofs are superabundant of his great astuteness, incredible foresight, and his indomitable audacity, and in the choice of the moment for his rebellion he has given proof of keen foresight. He knew that in the spring, when the roads are saturated with melting snow, it is difficult and almost impossible for armies to march; on the other hand, he knew that to postpone the enterprise was to condemn it to failure, the completion of the Canada Pacific Railway necessarily implying great facilities for the transport of the Government troops.\n\nRiel played his part in a superior manner, and it must be concluded that instead of being the victim of hallucinations he was, on the contrary, an astute man of superior intelligence. Providence has not willed that his perverse designs should be crowned with success, for which we should return fervent thanksgivings.\n\nTHE APPEAL TO THE INDIANS.\n\nIt is established by the evidence given at the trial of Riel, that the Indians did take part in the engagement at Duck Lake.\n\nMcKay said: \"There were two wagons with two Indians in each, and an Indian on horse-back. It was the Indian who had spoken to Major Crozier. He was killed when the firing commenced.\"\n\nAstley gives evidence: \"Towards noon or a little later a certain number of Metis and some Indians arrived from Batoche in command of Riel.\"\n\n\"There were then at Duck Lake about 150 Indians.\"\n\nHarold Ross, Deputy Sheriff, asserts: \"That there were from 75 to 100 Indians among the rebels, whom he saw at Duck Lake, running in the direction of Carleton a few instants before the firing.\"\n\nPeter Tompkins questioned: \"Among the 300 men how many, think you, were Indians?\"\n\nReply: \"About 150.\"\n\nThis appears to us sufficient to prove that the Indians did take part in the skirmish at Duck Lake. It remains to prove that these Indians came there at the call of Riel and not of their own accord.\n\nIn the course of the trial of Poundmaker, Robert Jefferson declared that there came to Cut Knife a Metis and an Indian, bearers of a letter from Riel to Poundmaker, in which the \"exotic\" begged Poundmaker to lend him his armed assistance.\n\nJohn W. Astley gives evidence: \"In speaking to me of the Indians, Riel told me once that the reasons why he had made an appeal to the Indians was because certain persons had not kept faith with him.\"\n\n(Trial of One-Arrow).\n\nThis acknowledgement made to Astley would suffice in case of need, if we had not other proofs written by the hand of Riel himself.\n\nHere are some of these written proofs:\n\nCase for the Crown (Exhibit No. 8), Riel writes: \"Dear relations and friends we advise you to pay attention, hold yourselves ready for everything. Take the Indians with you, collect them from all sides. Take all the ammunition that you can from any storehouses whatever. Murmur, groan, threaten, stir up the Indians; before all make the police at Fort Pitt and Battleford homeless.\"\n\nCase for the Crown No. G, addressed to the Metis and the Indians of Battleford and surroundings: \"Rise, face the enemy, and, if you are able to do so, take Battleford, destroy it, &c.\"\n\nNo. 10, dated St. Antoine, 23rd March, 1885, and addressed to our brothers the English and French Metis of Lake Qu'Appelle, and surroundings. Riel closes: \"Afterwards warn the Indians of the woods against allowing themselves to be surprised.\"\n\nNo. 11. \"Tell our relations, the Indians, to hold themselves ready to come to aid us.\"\n\nNo. 13. \"Warn the Indians of the woods that they might be surprised. Let them be ready for all events, and with calmness and courage, let them take possession of all powder, bullets, balls and cartridges from the storehouses of the Hudson Bay Company at Nut Lake and at Fish Lake.\"\n\nNo. 28. To the Metis and to the Indians of Battleford and surroundings, letter dated from St. Antoine 9th April, 1885: \"Rise, face the police, if that is possible for you, and if the thing is not already done take Battleford, destroy it, save all the goods and provisions and come to join us.\"\n\nFinally, here is a letter signed by Poundmaker and four other Indian Chiefs which proves\nbeyond all doubt that not only did Riel engage the Metis to stir up the Indians, but that he himself, previously, had prompted them to revolt, that he had made promises to them, given orders; in a word, that he had constant communication with them.\n\n\"To Mr. Louis Riel,—I would like to have some news of the progress of the work of God. Please let me know if any event happened since your messenger departed. Tell me when the Americans will be on the Pacific Railway. Give me all the news you have received, from all the places where your work goes on. Big Bear has finished his task. He has taken Fort Pitt. He has caused to be said to me, 'If you have need of me let me know it immediately,' and I immediately sent for him. I shall be four days on my journey. Those who have left to go and see him will sleep twice on the road. They have made 20 prisoners, among them the governor of Fort Pitt. They have killed 11 men, among them the agent, 1 priest and 6 white men. We are camping near the creek, immediately below Cut Knife Hill where we wait for Big Bear. The blackfeet have killed 60 men of the police at the Elbow. It's a Metis interpreter for the police who, having survived although wounded, has brought us this news. Here we have killed six white men; we have not yet taken the barracks, but that is the only building which remains intact in Battleford. We have taken all the horses and all the cattle in the neighborhood. We have lost one man, a Nez-Percé, who, finding himself alone, has been killed, and we have had one wounded. Some soldiers have come from Swift Current but I do not know how many. We have here guns and rifles of all kinds, but we are in want of ammunition. If it were possible we beg of you to send us some ammunition of different kinds. We are weak only in that. You have caused us to be informed that you would come to Battleford when you have completed your operations at Duck Lake. We are waiting for you yet, seeing that it is impossible for us to take this fort without aid. If you send us news only send one messenger. We are anxious to rejoin you, it would encourage us much to see you and would make us work with a better heart. Up to the present everything has been well with us, but we expect always that the soldiers are about to come and pay us a visit here. We hope God will also be good to us in the future as he has been in the past. We the undersigned send our greetings to all.\n\nPOUNDMAKER,\nCO-PIN-OU-WAY-SIN,\nMUS-SIX-ASS,\nMEC-LAY-WAY-IS,\nPEE-YAY-CHEEW.\n\n\"As soon as this letter reaches you send us immediately some news, seeing that we are in a hurry to get some.\n\n\"If you send us news send as many men as possible.\"\n\nNow, gentlemen, you who admire Riel, think you still that the Government has been doing wrong in giving to the \"exécute\" a just trial in lieu of causing him to be shot after summary conviction, following the practice and customs of the neighboring republic. We have promised you proof; you must find that they superabound, and yet nothing would be easier than to give out yet several columns more of them.\n\nNo one knew better than Riel the ferocious instincts of the Indians and the horrible dangers resulting from their alliance. In 1869, Real wrote in a manifesto: \"In spite of our difficulties we have never called to our assistance the dangerous element of the Indians.\"\n\nTHE REBELLION.\n\nRiel having learned by the telegram addressed to Nolin by McDonald, (trial of Riel, evidence of Nolin,) that the Government had decreed to do justice to the claims of the Metis, and seeing that his little claim is not received with the favours due to him, cries out:—\"The English have been stealing for 400 years, it is about time to put an end to it; that has lasted long enough.\" (Evidence of Nolin at the trial of Riel.)\n\nHis decision is made, it is necessary to take up arms. He communicates some days later his plan of an insurrection to Nolin and demands his adhesion. Nolin frightened at the resolution of the Metis chief, refuses his co-operation and proposes having public prayers in the Catholic Chapel for nine days, confessing and communicating and then acting according to their consciences. The Metis decide to have the nine days' devotion. It commences on the Sunday following, against the will of Riel, who hinders the people from going there. (Trial of Riel, evidence of Nolin.)\n\nThe influence of Nolin is on the point of making the Metis escape from the action of the\nrebel, and it is necessary to get rid of the troublesome one, so he causes him to be arrested while he is assisting at mass. (Evidence of Nolin, trial of Scott.) Orders him to be shot, but the council saves his life. (Trial of Riel, evidence of Astley, Ross, Nolin and others.)\n\nThe signal for the insurrection is given, the question is only to reunite the forces. \"The 17th March he takes himself to the settlement from above or from the south, to the south of Batoche. Gabriel Dumont takes himself to the north of Batoche. They call upon all the population to reunite themselves at Batoche in order to go from there to the church of St. Laurent to assist at baptism. (of Jackson) They must bring along their guns to fire a volley. They must in the meantime stop at Batoche till all were assembled there. They assemble at Batoche. He circulates then a report that 500 men of the police are advancing against them. They had such confidence in their chief and in all things they said and explained to them that they believed these reports.\" (Trial Parentean.)\n\nThe aim of the agitator is attained. The Metis are assembled in arms, they think themselves threatened, their spirits are elated, the revolt has commenced, now is the moment to strike the grand blow. He proclaims himself a prophet. He is about to take possession of the church at Batoche. The Rev. Priest Moulin, who is curate of that parish, wishes to speak to the crowd that invades the church by order of Riel, but the Metis chief opposes himself to this in the following terms: \"Carry him away and bind him.\" The worthy Ecclesiastic protests and Riel cries out: \"Look at him, he is a Protestant,\" then he adds, \"Go away! Go away!\" (Evidence of G. Ness, J. P., trial of Riel.) Riel installed in the church, a council is appointed after the strangest fashion. Let us still further consult the evidence at the trial of Parentean in order to edify ourselves. Here is what we find there: \"Gabriel Dumont cries from the midst of the crowd: Do you consent to such and such an one being appointed councillor? The church serves besides as a barracks, where one eats, drinks, sleeps, bathes, in a word the temple of God is profaned in an abominable manner.\n\nBut in order to carry out the rebellion, arms and ammunition are necessary. Riel procures these for himself by delivering up to pillage the stores of Walters and Baker, and of Keir, and he says to Walters: \"Give up your arms and ammunition peaceably, and if we succeed in the movement, we will pay you; if we fail, the Federal Government will pay for them, you will be satisfied in either way.\" Really that is a splendid piece of bold cunning, and proves that the Metis chief had not yet lost his head, although he was already then a prophet, which constitutes in the eyes of his admirers, the principal point of his madness.\n\nAs a good insurgent, and to imitate the communards of Paris, the Exovide, for that is the title he takes, causes prisoners to be made, who will serve as hostages. The 18th March and the following days, till the 26th, the date of the engagement at Duck Lake, Riel causes Astley to be arrested and Lash, Tompkins, Simpson, McKean and Woodcock, all peaceable citizens who had given no motive for treating them thus, and Astley declares, that the chief rebel was disposed to exchange them for Col. Sprout, the Hon. Lawrence Clark, and the Volunteer McKay, who would have served as hostages. (Trial Riel.) The agent of the Indians, Mr. Lash, declares that the Exovide said to him: \"I shall give to the police every opportunity to surrender, but if they do not do that, there will be blood spilled, and he adds:\" As for you, I shall not set you at liberty under any protest, because you are employed by the Government, and I shall detain you as a hostage.\" At another moment he makes use of persuasion, and as respects Lash, of promises; he guarantees him a position in the service, if he will place himself at his side. (Trial Riel. Evidence of Lash.)\n\nWe now arrive at the period of the first bloodshed. We could cite yet more evidence, all proving that Riel was, from the 18th March, at the head of a movement which was insurrectionary, plainly and undeniably; but it appears to us that these quotations are sufficient. We will continue the history of the events on authentic documents.\n\nThe 26th March, Thomas McKay, as he said in his evidence, goes to Batoche, in order to try to make the Metis understand to what they were exposing themselves in entering into a rebellion. Arrested by Riel's men he escapes death, with which the \"Exovide\" threatened him, thanks to the intervention of Champagne. Riel flies into a passion against the Volunteers, inveighs against him and finishes by telling him: \"You know not what we want! It's blood! Blood! Blood is what we want! It's a war of extermination. All who are against us will be chased from the country!\" Let us not forget this date of 26th March. It is 6 days before the first meeting between the Metis and the police, that Riel made use of this ferocious language, it will be henceforth very difficult to make people believe what has been pretended, that Riel was attacked by Major Crozier. But the events go to show clearly that even if the first shot were fired from the ranks of the police, which fact does not appear proven, the warlike intentions of the \"Exovide\" were undeniable.\n\nHere is the account given by Mackay at the trial of the Metis chief, of the events at\nDuck Lake. \"He (Riel) said that he would be happy to have my support, and that it was not too late for me to join them, that this was the last chance for Crozier to avoid the effusion of blood, and that unless he surrendered Fort Carleton an attack would be made by midnight.\" These propositions are scarcely pacific, and do not absolutely indicate a man decided on waiting to be attacked, on the contrary, one already perceives there the fixed idea to attempt a surprise. But let us continue. When MacKay re-enters Carleton in company with Mitchell, the latter hands to Major Crozier, a letter in which Riel requested him to meet halfway 2 men whom Riel preferred to send, rather than to go there himself. The interview takes place at the place designated. MacKay and Captain Moore declare to Charles Nolin and Maxime Lepine following the orders of Major Crozier; \"that they must give the names of the chiefs of the movement, and that they would have to give account to justice, but that a great number of those who had been dragged by force into the movement would be treated with kindness.\" Nolin declared that \"Riel and his council required the surrender of Fort Carleton without condition, and that nothing else would satisfy him.\" The delegates of Crozier having replied, that it was perfectly useless to discuss such propositions as they could not be accepted, Nolin answered that he had a letter for Major Crozier, but that it was useless to deliver it to him, since the Fort Carleton would not be surrendered.\n\nLet us note by the way that Major Crozier caused to be posted up by Astley a proclamation in the sense of what he had caused to be told Riel by Capt. Moore and McKay, and that these posters were torn down by order of Riel (trial of Riel. Evidence of John W. Astley). This fact, any more than the preceding ones, does not prove an expectant attitude on the part of the exovide.\n\nHere is the letter of which Nolin and Lepine were the bearers:\n\nSAINT ANTOINE, 21st March, 1885.\n\nTo Major Crozier, Commander of the Mounted Police at Carleton and at Battleford:\n\nMajor,—The Councillors of the Provisional Government of Saskatchewan, have the honour to communicate to you the following conditions of surrender: \"You must abandon completely the position wherein the Canadian Government has placed you at Carleton and Battleford, and at the same time all the properties of the Government.\"\n\nIf you accept you and your men will be free on your word of honour to keep the peace, and those who may wish to leave the country will be provided with waggons and provisions to enable them to go to Qu'Appelle.\n\nIf you refuse we intend to attack you when to-morrow, the Lord's Day, shall have passed, and to commence, without delay, a war of extermination against all those who have shown themselves hostile to our rights.\n\nMessrs., Charles Nolin and Maxime Lepine, are our representatives with whom you must treat.\n\nMajor, we respect you. May the cause of humanity be to you a consolation in the misfortunes which the bad administration of the Government will have caused you.\n\nLouis \"David\" Riel, Exovide; René Parenteau, J. B. Parenteau, Pierre Henry, Charles Nolin, Gab. Dumont, Albert Delorme, Moise Ouellette, Albert Monkman, Dam. Carrière, Maxime Lepine, Ete. Boyer, Ete. Boucher, Donald Ross, David Touround Amb. Jobin, and P. Garnot, Secretary.\n\nIt would be difficult to find a more crushing proof of the guilty designs of the \"Exovide.\"\n\nREVOLT, CONSEQUENCES AND PUNISHMENT.\n\nNo community or State can sanction rebellion, and itself continue to exist. And as respects punishment for rebellion, it has been pointed out that the United States did not inflict the punishment of death, after crushing the rebellion in the South. But in that case let us not forget that the two armies, during four years, made regular warfare with exchange of prisoners and all other rights accorded to belligerents; this was much less a revolt than a war for a principle.\n\nAt a date much more recent, did we not see, in France M. Thiers cause to be summarily executed some thousands of rebels in defending the communes of Paris? Who in the civilized world ever dreamed of making that a reproach to him except the communists themselves?\n\nLet us not forget that rebellion arms the citizens of the country one against the other, that its consequences are the ruin and devastation of the country in which it breaks out, and that far from being useful to its authors, it overwhelms them with calamities. Under pretext of obtaining redress of grievances it precipitates the unfortunate who have recourse to it into an abyss of miseries, even when it is crowned with success. Relations and friends killed or disabled, properties devastated, poverty, hunger, such is the hideous train which rebellion\ndrags behind it. And would we wish to leave unpunished the author of such horrors? And should we have the guilty weakness to permit the first over-excited person counting upon impunity, to recommence these baneful attempts? No! the tears, the pains, the blood of the victims cry for vengeance. Society demands protection. An example, terrible as well as sad to execute, must be made. Ofttimes the death of the guilty one can unfortunately alone satisfy those too legitimate appeals for justice, and the Government not only has the right, but the painful duty of responding to them.\n\nThe North-West rebellion has given rise to the most dangerous pretensions upon this subject which occupy our minds.\n\nThis rebellion was, however, culpable in every point of view. It was disapproved of by the bishops of that province. Mgr. Tache has manifested a lively regret for it. Mgr. Gravel vigorously denounced and condemned it. \"Even,\" said he, \"when one thinks he has cause to complain, one has not by that authority to rebel, as has so unfortunately been done in the North-West, and that, in spite of Mgr. Grandin and all the missionaries of the country. Thus to serve the good cause of the Metis, poor Riel has had recourse to means which are culpable and condemned by the church.\"\n\nThat condemnation sums up and contains all the arguments which we would be able to give.\n\nBATTLE OF DUCK LAKE.\n\nWe have now come to the first bloody episode of the rebellion, the narrative of which we borrow from the evidence of McKay, at the trial of Riel.\n\n\"The 26th March, Sergeant Stewart, accompanied by 21 men, of which 15 were police, left Carleton at 4 o'clock in the morning, with 7 or 8 sledges, to go and look for provisions at Duck Lake, in the storehouse of Mitchell. The column of feragers marched in the following order. Four men in the vanguard, the witness and volunteer McKay on horseback as scouts a quarter of a mile in advance of the teams, finally the teams accompanied by the rest of the troop. Arrived at 3 or 4 miles from Duck Lake, the witness remarked upon the snow some footsteps, which he took for tracks of Indians and almost immediately he perceived on the road some men lying upon the snow and making signals to each other. At about a mile and a half from the Lake there is a ridge a little to the north of the Postal Station. When they arrived there, the witness perceived the four men of the vanguard of the police on horseback pursued by some rebel horsemen. The volunteer McKay turned his horse and came back full speed upon the main body; arrived at a quarter of a mile, from the place where he perceived the pursued soldiers, he reached a hill from which he made a signal to the men of Sergeant Stewart to prepare their rifles. He said to the troop that the police were being pursued, and to hold their rifles ready, but not to fire. Whatever they may do, he added, I shall be able to save myself, and if they wish to fire on me, they can take the first chance and you will be able to defend yourselves.\n\n\"At this moment, the Metis were on the heels of the police and they were going to surround them at the turning of the hill. The witness McKay then gallops in advance and the rebel horsemen make a halt, all except one, Patrick Flury, from whom the scout demanded What are you doing there? What are you doing yourself? was the answer. I am going to Mitchell's to get provisions, replied McKay. There is a good deal there, they say; then letting him know that they came from Duck Lake, they warned him that Stewart's men would do better to return. McKay returned near the sledges and at the moment when he was going to rejoin them a band of 30 to 40 men, excited, brandishing their rifles, presented themselves before him. Gabriel Dumont, who led them, was more excited than the others, leaping from his horse he charged and cocked his rifle, threatening to blow out the brains of the witness and called upon the troops to surrender. McKay remained calm and ordered the drivers not to slacken their horses; he parleyed with Dumont while the Metis tried to take possession of the sledges. Suddenly, one of the drivers discharged his rifle into the air, the Metis jumped into the road and the police saved themselves in the direction of Carleton.\"\n\nThis is the first of the engagement at Duck Lake. It would be childish to stop to demonstrate that the Metis were, in this case, the aggressors. They had not yet shed blood, it is true, but they gave chase to the defenders of order and made threats with arms in hand. After the proclamation posted up by order of Major Crozier, to which the insurgents replied by a demand of surrender of Fort Carleton, the troops would have been, according to regulations, in the right to fire on the rebels, but let us remark that they avoided constituting themselves the aggressors.\n\n\"Sergeant Stewart dispatched a message to Major Crozier and on approaching Carleton he perceived him coming from the place at the head of 99 men. Sergeant Stewart and his...\"\nmen turned back and accompanied Major Crozier. The little troop marched to about four miles from Duck Lake to the place where the house of Barber was, and there the vanguard fell back and announced that the house was full of Indians. After having parleyed a moment the troops began the march again. Arriving at the place from which in the morning the vanguard of Stewart had retreated, the vanguard of Crozier was attacked and forced back on the main body of the troops, pursued by a numerous band of rebels.\n\nMajor Crozier gave orders to unharness the horses, put them behind and make a barricade when the insurgents did approach. Arrived at half a mile from the troops of Major Crozier the rebels waved a white counterpane like a flag. Major Crozier advanced before them with the interpreter and began to parley, while the rest of the band of rebels effected a movement to turn the soldiers. While the police prepared the waggons in their place, one of them cried out that the Metis were firing on them. \"Wait till they wound us,\" McKay cried out. At the same moment Major Crozier, who had perceived that the firing had commenced on the part of the enemy, gave orders to commence firing. The engagement lasted thirty to forty minutes. The loss on the part of the defenders of order was ten men; of whom nine were killed and one was wounded, who rejoined the troops in its retreat.\n\nLet us add to this testimony the evidence given by Capt. Holmes Young on the same trial. This is how this military man, who escorted Riel from Batoche to Regina, expressed himself:\n\n\"Riel said that he was not foolish enough to imagine that he was able to make war against Canada and Great Britain. But he hoped that his first successes would force the Canadian Government to study the situation or to accede to his demands. This is what his idea was: He hoped to surround and capture the troops of Major Crozier and make use of them as hostages, to force the Canadian Government to occupy itself with their cause, but he had fallen short of his design. A battle took place and the police retreated. He expected to surround the police at first, but the fight commenced and the police retreated.\"\n\nTheir remains then no more doubt. The Metis began the firing and the case of legitimate defence can no longer be admitted, if ever it was possible to invoke in their favour this argument. It has also been said that the Metis are in the habit of carrying arms, and that the circumstance of their being armed ought not to have influenced Major Crozier, but it was proven at the trials of the Metis that this pretension was not well founded, that these people only carry weapons when they are going to hunt, but they are not in the habit of hunting in a band of 300 to 400. There was on the other side, for a certain length of time, a rumour in the country that at St. Jerome, Riel was training men in the handling of weapons during the night, as appears from a letter of Major Crozier. (Speech of Mr. Mills in the House of Commons). Although this fact may have never been verified, it was nevertheless of a nature to excite suspicion.\n\nAFTER THE BATTLE.\n\nCrozier's force is beaten and routed, the insurgents remain in possession of the battlefield and are triumphant. Peter Tomkins, one of the prisoners of the Exovide, narrates the facts in the following manner, in the course of Riel's trial:\n\n\"I heard the firing of guns a couple of times, and when the half-breeds returned, Riel entered the yard on horseback, some of his men were in the rear, others in the front, and he waved his hat shouting joyously and sending forth hurrahs, and he thanked the Blessed Virgin and St. Joseph for the victories he had gained.\"\n\nBut the Exovide is not the greatest enthusiast of the band; his worthy acolyte and relative, G. Dumont, also enters the yard and shouts to bring out the prisoners and to kill them.\n\nIt is so very seldom that we have occasion to relate a creditable action on the part of Louis \"David\" Riel, that we will not allow this one to pass. Riel writes to Major Crozier to come and bury his dead and be should not be molested.\n\nSpeaking of the engagement at Duck Lake, Riel told Astley that the soldiers had fired first, to which the latter replied: that from what he knew of Major Crozier, he would say he had no intention of firing first; that he had told him so; that perhaps a rifle had gone off by accident. Riel admitted that might have been, then boasted of having commanded his men. \"In the name of God and the Supreme Being I say to you 'fire,'\" and he explained that the troops had been beaten by the bravery of his soldiers. (Evidence of Astley and Harold Ross, Riel trial.)\n\nRiel then had his prisoners transferred to Carlton, thence to Batoche; but before leaving Carlton the insurgents set fire to the post. (Riel trial, evidence of Harold Ross.)\n\nTransferred to Batoche, the prisoners are locked up on the ground floor of Baptiste Boyer's house, but at the least alarm, or the least danger of an attack from the troops of General\nMiddleton, he had them locked up in a cellar without light, seven men in a space of sixteen feet square and nine feet high. At night their hands were tied behind their backs. (Evidence at Riel trial; Harold Ross, Peter Tompkins, William Tompkins, Lash, &c.) The prisoners remained in the cellar a fortnight, at different times, the last ten days consecutively, and William Tompkins had his feet and hands tied at night. Delorme one day said to the prisoners that if he found them united he would blow their brains out. (Riel trial, evidence of William Tompkins.)\n\nTowards this time, Thomas E. Jackson goes and sees Riel and asks him to let his brother go, Wm. Jackson, the half crazed secretary of the Exovide. Instead of giving up the brother, Riel holds him prisoner himself, and says to him, \"I have made him a prisoner in his own interest, for it would not have been prudent to allow him to go about.\" On the other hand, Riel gives Dr. Cotton particulars as to the insanity of his secretary. (W. Jackson's trial.) At the same time Riel says of his secretary, that \"he is sick, that his brain is weakened and that it is a punishment for having gone against him.\" (Riel trial, evidence of Thomas E. Jackson.) The argument that some have tried to draw in favour of Riel from the madness of his secretary, thus falls to the ground. If it had been proved that the Exovide was ignorant of the madness of his secretary and had continued to employ him, this fact would certainly have been of considerable importance in suggesting the belief of insanity in the chief himself. But there is nothing of this; not only does the agitator make no use of his secretary, but he knows he is mad and he has him locked up, and says that in this way his mental state will be cured.\n\nBLOODY EPISODE.\n\nWhile the Exovide is continuing his criminal, cruel and sacrilegious work at Batoche, while he has his prisoners bound, deceives the half-breeds and drags them into a revolt, let us see what his ferocious allies, the Indians, are doing. Two noble priests, two martyrs, eight peaceful and inoffensive men and a poor woman fall under the bullets of the assassins.\n\nIt is the most painful drama of this sinister period, and we esteem it our duty to unfold to the eyes of our readers its atrocious particulars. Many generous hearts pity the miserable fate of the Exovide, but they forget too easily with how many tears, how much blood his name is soiled.\n\nOn the 2nd April, 1885, Good Friday, the Rev. Fathers Fafard and Marchand, two missionaries esteemed and venerated by all the country, were celebrating the Holy Sacrifice in the church of the establishment known under the name of Frog Lake. During the Holy Sacrifice the Indian chief Wandering Spirit, accompanied by a band of men of his tribe, penetrated into the church, decked out in his war costume, his rifle on his shoulder.\n\nThe service ended, while the faithful were returning to their homes Wandering Spirit met Quinn and Gouin. The Indian Chief ordered Quinn to go to the Indian camp. As the unfortunate man demands some explanations, Wandering Spirit discharges his rifle point blank. Quinn, the first victim falls dead. Gouin runs to assist him, when Bud Arrow, another Indian chief, strikes him with his gun. The unhappy victim falls, his face to the ground, lifts himself on his elbow, Miserable Man, another tiger with a human face, discharges his rifle in his breast—Gouin was dead.\n\nBlood for blood, the Indians see it red; they must have other victims. The Instructor of Agriculture with his wife, are not long in falling victims to the ferocious passions kindled in their hearts. The miller Gowenlock shares their fate, but as the work of blood progresses, it also assumes more barbarous forms. The unfortunate miller is coolly assassinated under the eyes of his horror-stricken wife, half dead with despair. Dill, Williscraft, and Gilchrist fall under the blows of these infuriated monsters, and are killed with horrible cruelty.\n\nThe Rev. Fathers Fafard and Marchand, who ran to the spot at the noise of the firing of the Indians' rifles, wish to interpose and stop this ferocious carnage; they fall in their turn. This is what the Indian The Thunder deposed at the trial of the chief Around The Sky.\n\n\"I saw the priest Fafard lying on the ground after he had been fired at. When I saw him for the first time, I was going in the same direction as some Indians who were following the whites. Subsequently, I returned to the place where the priest was lying, and I saw the defendant firing at the priest. The priest was lying with his face to the ground, and the defendant fired at his skull. The defendant, Around The Sky, was almost over him. He held the end of his rifle very near the head of the priest. A certain number of Indians surrounded them. The Indians said the priest pretended death, and that he was not dead. I saw him stir while on the ground. I heard him groan after the defendant fired at him.\"\n\nAnother Cree Indian, Ossawewo, says, at the same trial, Wandering Spirit was the first to fire on the priest Fafard. The priest fell, his face against the ground, the blood flowing from his mouth and nose.\nDetails are not given of the murder of the Rev. F. Marchand, but we can complete them by a letter from the Rev. F. Leduc, who expresses himself as follows:\n\nThe dear fathers Pifard, Canadian, and Marchand, of the Diocese of Rennes, were massacred by the infidels, their bodies horribly mutilated, their hearts pulled out and no doubt devoured.\n\n\"They both gloriously fell under the bullets of the savages, immolated to their blind and foolish hatred. Both fell in the exercise of the noble virtue of charity in bringing relief to the victims of the infidels, and in endeavouring to subdue and calm the fury of the Indians. The latter, blinded by perjurious advice, wanted to get rich, not only of the whites, but of their priests and their religion.\"\n\nThe Grey Nuns only escaped outrage and death by taking refuge on a desert island, where they spent several nights exposed to the inclemency of the weather at this glacial season, and having for food nothing but the fish they could catch in the lake.\n\nThe defenders of the \"Exode,\" do not hold him responsible for these massacres, and say he never ordered these atrocities. We are willing to believe—-that the new Mennonite did not sign the order to put to death the victims at Frog Lake, for then all examination of his case would be superfluous, but the opinion of the Rev. Father Leduc seems to us to be so clearly expressed as to need no commentary. Riel who gave the order to arouse the Indians, has at the same time, assumed the responsibility of their atrocities.\n\nAnd the Rev. Father Tourmond does not think differently when he says—\n\n\"It was a horrible consequence of the diabolical plans of Riel that the Rev. Fathers Fabre and Marchand were massacred at Frog Lake under his orders.\n\nAnd when after the engagement at Duck Lake, Riel boasted of having prevented an Indian from finishing off Newett, the wounded soldier of the Mounted Police, he gets from Astley this severe but just reply, \"It is a consequence of having aroused the Indians\" and Riel does not protest. He thus, in a manner, acknowledges his culpability.\n\nIt is moreover superfluous to discuss at any greater length this question of responsibility. It is evident to any man whose proper place is not at Beauport or Longue Pointe. Who then will dare to say that the execution of Riel was not an act of justice? The blood of ten men, two of whom were holy missionaries, whose persons are invested with the most sacred character; of a poor and innocent woman, massacred at Frog Lake, with a cruelty which made people's hair stand on end; of two men murdered at Battleford, crying for vengeance from Heaven, and had Riel only been guilty of these atrocities, the executive would not have been justified in granting him a pardon.\n\nBATOCHE UNDER THE TERROR\n\nWhile the Indians at Frog Lake and Battelford were winning immortality by their horrible cruelties, Louis David Riel continued his work at Batoche.\n\nThe burning at Frog Lake and Carleton had given an appetite to the insurgents. They set fire to Hillyard Mitchell's house, after having sacked and pillaged it.\n\nOne day Riel says to his men, \"you will go and take the prisoners at Garnot's and give them to the Indians, who will kill them to-night, and the same is to be done to the two prisoners in Solomon Venne's house, but see that the Indians do not torture them.\" Patrick Tourmond energetically opposed this barbarous order and exclaims: \"If you kill these men, you will have to begin by killing me,\" and the Exode replies banteringly: \"Tourmond, you are mad you will remain all sound.\" (Tourmond trial, evidence of Roger Goulet.)\n\nWhat a good apostle! Truly we must acknowledge that Mr. Mercier is a hundred thousand times right when he says that Riel died because he had loved his country too well, but the Rouge chief should have added, and his neighbors. Truly can you imagine anything more touching than this recommendation to see that the Indians did not torture the prisoners. This strongly bears a resemblance to the man who would give a lamb to the wolf, forbidding him to eat it.\n\n\"Riel, having discovered that Moukman had formed the plan of escaping on horseback, when he should have crossed the river, has him judged by a council of war, made a prisoner and chained to the floor of one of the upper rooms of the house of Baptiste Boyer at Batoche.\" (Evidence of Thos. E. Jackson, Champagne trial.)\n\n\"Spies and sentries were posted at the houses where suspected parties lived, and all attempt at escape was, by order of Riel, to be treated as a crime punishable with death. Any person found trying to escape must be immediately shot, by order of Riel. (Trial of Joseph Arcaud and others, evidence of Nolin.)\n\nLet us see how very popular Riel's regime was. Thomas E. Jackson, Riel's prisoner, the same man to whom the Exode had given the order to forward to the newspapers in the east\ncorrespondence to justify the rebellion, gives his evidence at the Champagne trial in the following words: \"The only members of the council upon whom Riel could rely were Gabriel Dumont, Dumase Carrière and Napoleon Nault. Riel distrusted all the others and watched them.\"\n\n\"The master comedian, this signal impostor, had turned their heads, and when he had compromised them by the shedding of blood, then they were in his power, and he made use of his power without mercy. I have heard him say and proclaim: 'Death! death! death! for whoever seeks to escape.' And by order of Riel, rifles were put to the breast of poor people, because he suspected them of wanting to escape; to completely terrorise them all, he declared he would have me placed in the front on the battle-field. * * * I spoke to Garnot and I reproached him with being among the misguided. 'What can I do,' said he, 'I am forced to be here. I would be killed if I refused to appear at least to act, and I must do all in my power to save the life of the poor people locked up at Battleford; this is what consoles me in this terrible business.'\"\n\n(Evidence of Rev. Father Fourmond, trial of Arcaud and others.)\n\nAnd the Rev. Father André in his evidence at the trial of Joseph Arcaud and others says:\n\n\"Riel told them that death alone, and a death accompanied by merciless tortures, awaited them; that their daughters and sisters would be outraged under their very eyes, their children cut in pieces; their property destroyed, and their nation entirely exterminated by the brutal soldiery. And to complete the terror of these poor deceived people, he reminded them of the fate of Charles Nolin, who had been condemned to death by Riel for desertion, and whom the police had thrown into prison. * * * Another time Riel said: 'If you do not consent to become a member of the council, your property will be pillaged, your life will not be in safety, you will be at the mercy of those who want to deceive you.'\"\n\nSpeaking of Joseph Delorme, in the course of the same deposition, the Rev. Father André said: \"For a long time he refused all relations with Riel, and engaged his neighbors to follow the same line of conduct. It was only by force and threats that at length they succeeded in getting him to join the rebellion.\"\n\nWe have already told how Nolin had been arrested with Boyer, and condemned to death for having refused to join the movement.\n\nThe picture of the cruelties of Riel is complete enough, and it is useless, it seems to us, to enter into the details of the ill treatment his prisoners had to endure, all inoffensive people with whom the Exode had nothing to find fault, but whom he kept to be used as hostages. We could add to this recital, somewhat disjointed but very searching, the grotesque side of the impious mummeries which Louis David Riel practised so as to win the popular feeling, passing himself off for a prophet, but space is wanting to allow a review of his juggleries.\n\nIn the meantime, G. Dumont surrounded Batoche with a triple line of earthworks and posts where the riflemen, secure against the projectiles of the enemy, could keep up well sustained fire. The pits or shelters were hidden by means of branches planted in the sunken ground, in a manner to simulate thick bushes. Moreover they were distributed in a way to command all the passages by which General Middleton could attempt an attack on the village. The plan of operation at Batoche found in the papers of the half-breed chief, a fac-simile of which has been published at the end of the Report of the Minister of Militia, proves that Riel and his men had perfectly studied the ground of their operations.\n\nBy the foregoing, one can study the feelings animating the half-breed chief. The half-breed's cause is nothing in his eyes, the proof of which is obvious since it was only by deceit and terror he held his partisans together. If he had had really in view the good of those, who by a cruel irony of fate, he called his people, he would have put everything in motion to stop the rebellion, had the half-breeds shown any sign of revolt. Far from acting in this way, he foments the rising and forces the unfortunate to follow him.\n\nHis conduct is that of an intriguer, coupled with that of a cruel, ambitious and crafty man.\n\nA SORROWFUL EPISODE.\n\nNear Batoche, he was living in a kind of opulence, surrounded by her seven sons, models of piety, courage and industry, a holy and worthy widow by the name of Tourond. The mother loved with a lively and tender affection her seven children who brought back to her mind the loved husband gone to a better sphere, and these worthy children of a virtuous mother returned her love like dutiful sons. This family was the admiration of the neighborhood.\n\nFrom the beginning, these brave young men declared themselves openly against the machinations of Riel. The half-breed chief used with them persuasions and threats, but without avail; they remained steadfast.\n\nRiel then conceived an infernal plan. Every day he would go to the widow and relate his holy visions, would tell her of the inspirations of the spirit of God, impressing the simple and credulous, and slightly superstitious, mind of the poor mother. He narrated to her how\nin his visions he had seen himself surrounded by seven stars shining with extraordinary brilliancy, and forming for him an aureol of glory. These stars, would he say to the good woman, are your seven sons to whom will be due the glory of the half-breed nation; and the mother, in her simple faith, believing in the divinity of the mission of this imposter, begged and prayed her sons to go and fight under the banners of the new Mahomet.\n\nAlas! they obeyed the deluded mother; they took up arms. Three fell dead on the battlefield and lie in an eternal sleep in their hastily dug graves on the banks of the Saskatchewan. The fourth died with sorrow on learning of the miserable end of his brothers; the fifth is maimed for life; the two others were made prisoners, brought to Regina and only escaped imprisonment, thanks to the evidence given as to their past conduct.\n\nIt was one of them who, replying to Judge Richardson's question as to what they had to say why judgment should not be passed upon them, said in tremulous tones: \"'Tis hard, seeing that we have been deceived.\"\n\nThis family who previous to the insurrection was well-to-do is now ruined, and yet towards the author of these heartrending misfortunes some people wanted the Government to exercise clemency.\n\nTHE BATTLE OF BATOCHE.\n\nThe military operations of the campaign offer but a secondary interest, and we will allude to them only so far as they throw light on the conduct of the prophet, Louis \"David\" Riel.\n\nWhether by calculation or natural disposition, or a combination of both, the Exovide gives no tokens of that great quality that all nations so highly prize, and of which his race is so justly proud: Courage.\n\nJohn W. Astley, in his deposition at the trial, says: \"So far as I can judge, he was too much afraid of risking his neck to run a needless danger,\" and at another time: \"I returned. It was taking a long time to find Riel. I went at last where the women and children were.\" We know that in reply to a note of the Exovide thus worded: \"If you kill our families, we are going to kill the Indian Agent and the other prisoners. (Signed,) Louis 'David' Riel, Exovide, General Middleton had replied by this other note: \"Mr. Riel, I am anxious to avoid killing women and children, and have done my best to avoid doing so. Put your women and children in one place and let us know where it is and no shot shall be fired upon them. I trust to your honour not to put men with them. Signed, Fred. Middleton, Commander of the North-West Forces.\"\n\nThe deposition of Astley, with its accompanying circumstances, does not show on the part of the half-breed chief very great bravery. We should expect to see a man, seemingly devoted to the cause of his people, foremost where danger threatened, showing the example of intrepidity, of courage, after calling to arms; we would think he would be found in the vanguard, under the leaden hail, encouraging his men by word and example, and it is among the women and children, safe from danger, that he is to be found! For ourselves, in spite of all, if Riel had sealed with his blood his unfortunate revolt, we could have had some respect for his memory and believed in his sincerity; we could have taken him for a misguided hero, but there is nothing of this nature in him, he has only low and sordid feelings.\n\nThe same Astley deposes at the same trial in these terms: \"He told me that we all knew he never carried any arms, nevertheless we had seen him one day with a rifle;\" and George Ness states at the same trial: \"I saw him with a revolver.\" And William Tompkins declares that he saw Riel \"armed with a Winchester rifle.\"\n\nThis is what proves in this man, whom it is sought to exalt as a hero, an odious calculation to save his own life after he had driven unfortunates to expose theirs.\n\nLet us return to the facts. The witness Thomas E. Jackson, brother of the hallucinated secretary of the Exovide, and his prisoner, states in the Riel trial: \"I remember one occasion when he rushed into the church and brought out the crucifix, and ran among the houses calling out the men and insisting all should come, and I saw him go out and choose the ground upon which to defend himself, expecting an attack from the Humbolt trail.\" Charles Nolin deposes to \"having seen him armed with a crucifix one foot and a half in length, which he used as a baton of command.\" He neither shrank from the profanation of churches nor the carrying of images, to strike the credulity spirit of the half-breeds; but when he would be expected to show some bravery, he hides himself behind the women and the children.\n\nHarold Ross deposes: \"After the battle of Tourond's creek, I heard Riel say that they had gained two victories and that they wanted to gain a third and they could then make better terms with the Government.\n\nJohn W. Astley says: \"After the battle of Tourond's creek, I wrote to Riel asking him for an interview. I had a long conversation with him about the prisoners. I told him the\nscares I entertained about the Indians, and asked him if he would allow me to see the General or Irvine, to try and effect an exchange. He refused to exchange. I said to him, what do you want to keep us for? I said I suppose you want us in the event of you or your council being in danger. He replied: 'Yes, certainly.' I said, you claim the victory at Tourond's creek and Duck Lake, and you ought to let me go and try for terms. And he replied, he had gained two victories and he must have done. 'If we gain this the terms will be better, if we lose the terms will be the same as now.'\n\nHere is how Riel explains his conduct to Captain Holmes Young, who gave his evidence at the Riel trial: \"He said he had not dreamed of fighting the army in the open country, and the reason he had not adopted Guerilla warfare was that he hoped by remaining quiet to induce the General to send a small force himself, and he hoped to capture that small force, and with them as hostages, to compel the Government to consider the situation. He failed in that, and then he made the attempt to capture the steamer Northcote, with the intention of keeping as hostages those on board.\"\n\nThe battle began, the firing was getting warm, according to the expression of Astley at the Riel trial. The Exovide arrived all upset at the cellar in which he kept his prisoners, and called Astley in these terms, according to Lash's deposition: \"Astley, come quick; go and see Middleton. If our families are wounded in any way, I will kill the prisoners.\" He gives to Astley the note we publish elsewhere, and a similar one to Thomas E. Jackson, each messenger to take a different route. Astley returned with the reply of the General, which we have also published. Astley proposed to Riel to go and see General Middleton and try to get the best possible terms, and the Exovide seemed decided, when the firing began anew. Riel then decided to send another letter to the General and gave it to Astley. \"It was only a pretext to stop the firing,\" certifies the witness. Astley gives the letter to the General, and returns to Riel, who entrusted him with another message, returns to the General and brings back his reply, receives another message from Riel and delivers it to Middleton, who, learning from the bearer that Riel seemed disposed to surrender, provided that he and his council were given their lives until the Government had given a regular trial, (Astley's evidence,) decides on writing the celebrated note which some partisans of Riel, without a shadow of reason, try to have appear a letter of anticipated pardon. Astley returns to Riel's position, looks for him a long time and at last finds him among the women and children. \"I reported to him,\" says Astley, \"what the General had told me, that if he ordered his men to stop firing, he (the General) would do likewise, and that he might accompany me to the General's.\" Riel hesitated but declares that he has no need to call the council to surrender, that he will do what Astley wishes; still he is evidently searching for some new trick to turn the tide of events in his favour; but he has forgotten the Indians he has enrolled, who having continued the firing, provoked the charge which placed the force of General Middleton in possession of Batoche. The half-breeds and Indians throw away their arms and run, the prisoners are taken from the cellar in which they are confined by means of pieces of rock, but the Exovide has disappeared. If, as some people pretend, he had wished to surrender, this was the moment to meet the General, a white flag in his hand. He did not do this.\n\nTHE SURRENDER OF RIEL.\n\nIt has been pretended that Riel threw away his arms and surrendered on the promise given by General Middleton that his life would be spared. This pretension is false in all its bearings. When Riel, on the 15th May, 1885, allowed himself to be taken by the scouts, he had, no doubt, good reason to believe that he would not be shot on the spot, nor killed by the volunteers; but he must have expected to be held responsible for his acts before the tribunals of the country.\n\nThe authorities had given him to understand, on several occasions, what fate awaited him, and he himself had a premonition when he said that he was going to govern the North-West or perish in the attempt.\n\nFrom the beginning of the revolt, and previous to the first shedding of blood at Duck Lake, Major Crozier had a proclamation posted by J. U. Astley, and instructed Captain Moore and Thomas McKay, of Prince Albert, to tell any of Riel's men whom they would meet, that he believed many men had been driven involuntarily into this business; that he hoped they would disperse and return to their homes; that he believed the Government would take their case into consideration and deal leniently with them, with the exception of the Chiefs, who would have to answer for their offence, and that he would do all in his power to get an amnesty for the rank and file. (Riel trial, evidence of Crozier.)\n\nOn his side, General Middleton sent the insurgents a proclamation, dated 30th April, which read as follows:\n\"The half-breeds and the Indians who have been forced against their will to join the rebels, or those misguided Indians who are aiding the rebellion, are hereby informed that if they throw away their arms and return to their homes and reserves, they will be protected and given pardon.\"\n\n\"The forces sent by the Government do not want to wage war against these men, but only against Riel, his councillors and abettors.\"\n\n\"MIDDLETON.\"\n\nIt is seen that the amnesty promised by Middleton to all those who threw away their arms, did not extend to Riel, nor to his councillors and abettors. A pardon cannot then be invoked for them on the strength of this proclamation.\n\nNow, let us pass to another point.\n\nHow did Riel surrender? Was he the victim of a snare? Did he throw away his arms during the battle to stop the conflict? Did he not rather surrender after Batoche was taken and when all resistance was hopeless?\n\nIt was on the 12th May that the battle of Batoche was fought and the place carried. The entrance of the victorious force into Batoche put the rebels to flight—Riel ran away with the rest.\n\nThe next day, the 13th May, the half-breeds were returning with white flags. Those who were the least compromised were allowed to go, by Middleton, the others were taken prisoners. Of the latter there were 13, of this number 2 councillors, but Riel does not make his appearance, he remains in hiding in the neighbourhood of Batoche.\n\nOn the 14th May they are on the track of Riel.\n\nOn the 15th May, the scouts search the wood and the neighbourhood. In the afternoon two of them, named Armstrong and Howie, fall in with Riel, who offers no resistance and they show him the note written by General Middleton, two days before, promising him protection until the Government had decided on his case.\n\nHere is the exact wording of this note:\n\n\"Mr. Riel, I am ready to receive you and your Council and to protect you until your case has been decided upon by the Canadian Government.\"\n\nThis note of Middleton's was written after the communications exchanged with Riel during the Battle of Batoche. During the firing Riel sent one of his prisoners, Astley, with the following note to the General:\n\n\"BATOCHÉ.\"\n\n\"If you massacre our families we are going to massacre the Indian Agent and other prisoners.\"\n\n\"LOUIS DAVID RIEL, Exovide.\"\n\n\"J. W. ASTLEY, Bearer.\"\n\n12th May, 1885.\n\nThe General replied as follows:\n\nMr. Riel,—I am anxious to avoid killing women and children, and have done my best to avoid doing so. Put your children and women in one place and let us know where it is and no shot shall be fired on them. I trust to your honour not to put men with them.\"\n\n\"FRED. MIDDLETON,\nCom. N. W. Field Forces.\"\n\nIn the course of his interviews with General Middleton, Astley said to him: \"I think Mr. Riel is in a high state of excitement, and I would not be surprised if he surrendered.\" It was on this indication, given by Astley, that the General wrote the next day the note previously quoted which only reached Riel, however, on the 15th.\n\nNow here are two of the scouts who captured Riel who came and testified under oath that the latter did not surrender freely, that he was well armed and was getting ready to run away when they captured him. We quote:\n\n\"We, William Diehl and Robert Armstrong, of Prince Albert, in the North-West Territories, solemnly declare:\n\n1. That during the revolt of the half-breeds and Indians which took place in the...\"\nSaskatchewan in the Spring of 1885, we enrolled among the volunteers of Prince Albert and did the service of scouts, being in relation with the said volunteer militia for about two months:\n\n\"2. We have seen it stated by certain newspapers of the Lower Canada Press, that Louis Riel, the leader of the insurgents, had voluntarily surrendered after the battle of Batoche, and given himself up to the authorities, and that the said Louis Riel could easily have left the country had he been so inclined.\"\n\n\"3. We, accompanied by one Thomas Howie, are the three volunteers of Prince Albert who took part in the search for Louis Riel and the other rebels, who fled after the battle of Batoche.\"\n\n\"4. Moreover, we expressly state that we and the said Thomas Howie, are the three scouts who captured Louis Riel and placed him in the hands of General Middleton. When we captured him we believed, and to-day we affirm, that the said Louis Riel had not the intention of surrendering, but was getting ready for a hurried flight. He was looking for a horse, and had with him a bridle and saddle and was well armed. The two half-breeds who accompanied him were also well armed. The rumours mentioned above, that Louis Riel had voluntarily surrendered are entirely false.\"\n\n\"And we each make separately this solemn declaration, conscientiously believing it to be true, and by virtue of the Act passed in the 37th year of Her Majesty's reign, intituled \"An Act for the suppression of voluntary and extra-judicial oaths.\"\n\n\"WM. DIEHL.\"\n\n\"ROBERT ARMSTRONG.\"\n\nTaken before me, in the City of Prince Albert, North-West Territories, this 23rd day of December, 1885.\n\nWM. R. GUNN,\nNotary Public for the North-West Territories.\n\nTWO WORDS ON THE HALF-BREED GRIEVANCES.\n\nAs our reader may have seen by our article on the half-breeds grievances, there is nothing left standing of those celebrated claims. These were, moreover, nothing more than pretensions that the half-breed fancied should prevail, rather than real grievances based on a certain and acquired right. We voluntarily admit that these pretensions deserved in equity, to be seriously considered, but we cannot admit that they gave any right whatever to the half-breeds to rise in rebellion.\n\nIn those pretended grievances, there is not a single one which is not inherent to the nature itself of a new colony, of an establishment in the state of embryo like the North-West. We find, moreover, the proof of this assertion in the numerous forms these claims take, the considerable number of changes they undergo. To-day, the petitioners will ask one thing, the next day they clamor for another, and the Government was quite excusable in not being able to act on this flood of petitions, crossing each other and very often in opposition to each other.\n\nNow, let us take up the appreciation of the most ardent defenders of Riel and his rebellion, and let us consider a moment what they think of the rebellion and the grievances of the half-breeds.\n\nHere are the words spoken in the House of Commons by Mr. Gigault, member for Rouville,\n\n\"I say that I do not approve of the rebellion because I believe that the grievances of which the half-breeds complained were not of a nature to justify it.\"\n\nAnd the member for Port Huron West, Mr. Cameron, whose evidence is hardly more suspicious than that of his colleague of Rouville says:\n\n\"I do not wish to justify the rebellion. I want to point out the situation in the North-West. I want to prove that the prisoner was justified in going there, and setting forth the circumstances that lead him there.\"\n\nAnd on another occasion the same member says:\n\n\"I admit that the half-breeds had grievances, but their grievances were not sufficient to justify the rebellion. Who has pretended they had grievances sufficient to justify the rebellion? Who made this declaration? Is it a member of the Opposition?\"\n\nSeveral members—Yes.\nMr. Cameron: \"No motion on the side of the opposition made any such declaration, to the effect that the half-breed had grievances justifying a rebellion.\"\n\nSir Richard Cartwright and Mr. Girouard do not think otherwise, and the eloquent advocate of Riel, Mr. Fitzpatrick himself, says, That there was nothing justifying a rebellion.\n\nIt seems needless to seek for other evidence. The authority of these defenders of the course seems to us sufficient.\n\nWe could develop these considerations largely, but we will limit ourselves to quoting one fact which must complete the enlightenment of the most obstinate. We hold it from a most reliable source, and can consequently attest its perfect authenticity.\n\nA short time previous to beginning his revolutionary movement, Riel came into the Province of Quebec, and consulted theologians, the most eminent and esteemed for their learning. He was desirous of obtaining from them the approval of his projects of rebellion, but he failed to obtain from any of them the encouragement he desired; on the contrary, all were unanimous in pressing him to abandon his unfortunate scheme, and struggled in vain in their endeavours to show him its malice and horror.\n\nThis fact, of which we again say we can guarantee the perfect authenticity, proves not only that the rebellion was not only unjustifiable in all its bearings, but that Riel was perfectly well aware of this and this renders his guilt all the greater.\n\nWAS RIEL INSANE?\n\nWe now arrive at the last argument of the Nationalists and Liberals in favor of Riel.\n\nIt seems somewhat strange that our adversaries want to make of a lunatic, a hero, a martyr, a great patriot, and that they take his name as a rallying cry. Truly they are not paying themselves any compliments to call themselves the followers of a madman, a lunatic.\n\nL'Étendard, Riel's great advocate, squarely set forth the dilemma some time ago when it said:\n\n\"That Riel had acted in a deplorable manner; that he had been guilty of acts which were only excusable as the doing of a madman; that he had infamously outraged the Catholic doctrine, and abused missionaries and sisters of charity. It was unfortunately impossible to doubt this.\"\n\nEither insane or criminal, there is no other medium, not even for L'Étendard.\n\nNow let us see whether Riel was really insane and irresponsible for his actions.\n\nThe general opinion throughout the country, during the agitation, was that Riel was perfectly sane and a man of ability. During the nine months that he worked the agitation in the Saskatchewan, in a population of 2,000 souls, not a single person was struck with the idea that Riel was not in full possession of his mental faculties.\n\nEven today it would be impossible to make the half-breeds believe that Riel was insane, and nevertheless, they were intimately acquainted with him.\n\nThe witnesses at Riel's trial all agree in saying they never took him to be insane.\n\nThe evidence of the physicians comprising the Medical Commission, which has been published, all have a crushing concurrence on this point.\n\nGabriel Dumont gets indignant when he is told that Riel was insane. We quote from his interview with Odilon Girard: \"They (the English), have tried to make him appear as a lunatic and a coward, but Riel is cuter than they.\" This then is the appreciation made by a man who has lived with him and fought at his side.\n\nThe witnesses declare at the trial, that Riel was perfectly calm after the battle at Duck Lake, and during the battle at Batoche; and General Middleton declares that the Exovide conversed with him in quite a sensible manner after the taking of Batoche. And nevertheless, was it not after the first success, or the complete annihilation of all his projects, that one would expect to find him greatly excited.\n\nIf it could be admitted that Louis Riel was insane, one would be compelled to admit that the whole half-breed population of the Saskatchewan were stricken with lunacy; since it confided its interests to a madman and blindly followed him in his most foolish escapades.\n\nThe essence of folly is to create a state of mind during which the reason of man escapes all control, and it was not $35,000 nor $100,000 as Riel demanded to leave the country, which would have put a stop to this morbid condition.\n\nIt is pretended that Riel had the insanity of greatness, that the only thing which he was incapable of resisting, and which in his mind justified all crimes, was his own feeling of greatness, elevation and power. And nevertheless, he was ready to renounce that greatness, that power, for $35,000. Some may say in reply that he wanted with this money to work out his aim with more certainty by establishing a paper, as he said to Nolin: In mercy, let us remark that he held this language to Nolin, one of his followers, a relative; but that he makes no\nmention of this project to the Rev. Father André. Had he made to Nolin the remark he made to Rev. Father André: \"If I am satisfied the half-breeds will be,\" Nolin would have considered him a traitor, a treacherous venal man. Had he spoken of the establishment of his paper and his projects of conquest to the Rev. Father André as he did to Nolin, he was destroying all chance of success. Is it like a madman to thus calculate? And with Jackson, he uses the same reserve and keeps silent in regard to his extravagant projects. Wherefore? Because he is insane? Because he does not know what he is doing? It would be puerile to pretend this.\n\nCan we infer insanity in the insinuating and skilful manner in which he drives the Indians to revolt?\n\nIs it madness to have hostages and to understand that an employee of the Government is of more value as a prisoner than another individual?\n\nIt is said that his extravagances, his pretensions to a prophetic and divine mission, are a proof of his insanity, but let us hear on this subject the evidence of his cousin Nolin at the trial at Regina.\n\nThe witness is asked whether the prisoner had separated from the clergy, and the witness answers: Yes, completely. He adds that the half-breeds are a people who need religion, that religion has a great influence on their minds.\n\nThe witness is asked whether the defendant by remaining with the clergy, could have succeeded in bringing the half-breeds with him. The witness replies: \"No this would never have succeeded. If the defendant had not made himself appear as a prophet he would never have succeeded in bringing the half-breeds with him.\"\n\nThe witness is asked if the people did not have confidence in their clergy, and he says: \"No, but they were ignorant in their simplicity.\"\n\nIt has been said that Jackson, the Secretary of Riel, having been declared insane, the \"Exovide\" who employed him must have been insane. This argument might be good and might prove something in favour of the assertion. You would have to prove first that Riel was not acting from calculation, but this proof would be groundless, for it has been proved at the trial that Riel was aware of the insanity of his Secretary and had him locked up for mental aberration.\n\nAnd when would it be most likely to imagine that the mind of that man would weaken if not during his incarceration and after his condemnation? And, nevertheless, are the last writings of Riel those of a madman? Not at all. His will, his letters to his mother, to his wife, his religious actions are far from indicating mental aberration. There are effusions of feeling, delicacy of sentiment, shades of language that a sound and well balanced mind could alone conceive and express. His religious retractions, some of which, bearing on the subjects which engendered the first heresies, are not the product of a disordered brain.\n\nAnd the Rev. Father McWilliams writes in reference to the death of the half-breed leader:\n\n\"You perhaps wish to know my opinion on the condition of the poor ambitious man at his last moments. Here it is: It is impossible to be of sounder mind than he was; never was there a man more strengthened by the power of faith and the sacraments of the Church. Never did a man more sincerely regret his past sins.\n\n\"I saw Riel, I conversed with him. I took the time required to study his case with calm; and I must say that his end was not that of a madman.\"\n\nNow this argument remains that Riel was locked up as a lunatic at Beauport and Longue Pointe. Here are two letters which throw a strange light on those two incarcerations:\n\n\"I, the undersigned Medical Superintendent of the Insane Asylum of St. Jean de Dieu, certify that soon after the confinement of Louis Riel in this hospital, I perceived that in him insanity was only being simulated. The exaggeration in his actions was so much beyond what is generally noticed in persons suffering from real insanity, that for a physician any way skilful in treating mental diseases there could be no room for doubt. On observing to him that I was not his dupe, he acknowledged that he was pretending insanity; and the proof that his avowal was very sincere was that at all times when I was alone with him, he always spoke to me in a perfectly lucid and sensible manner on any subject on which I conversed with him.\"\n\nF. X. PERREAULT, M.D.\n\n\"I, the undersigned, certify that at the time of the confinement of Louis Riel (with whom I was well acquainted in the United States and Canada) at Beauport, and after that time, I ascertained at different times that apart from certain eccentricities of manner, slightly evident, he had a perfectly lucid and sound mind, and spoke perfectly well on all subjects when not under observation. I certify, moreover, that in my presence the said Louis Riel has...\"\npretended insanity, with such an evident design of misleading, that there can be in my mind no doubt whatever as to the character of his pretended insanity.\n\nJ. A. S. BRUNELLE.\n\nAnd here is what Dr. Howard wrote to Mr. Curran, M.P.:\n\nMontreal, 14th March, 1886.\n\nMy Dear Curran,—I notice by the papers that you are going to speak on the Riel question in the Federal Parliament to-morrow. As my name has been mentioned, saying that I was one of the witnesses who should have given evidence in favour of that unfortunate, at the time of his trial, I send you a copy of a letter I forwarded to the Government Counsel in the city.\n\nI think, moreover, that it is well for me to add, that in my opinion, my presence at the trial would have been of no benefit to Riel; you know my views on the question of responsibility, but when the legal question would have been brought forward, I would have been obliged to state that Riel was responsible for his acts, the same as any other criminal.\n\nYours very truly,\n\nHENRY HOWARD,\nMedical Superintendent of the Asylum St. Jean de Dieu.\n\nThis seems to us very clear, and mental alienation can no further be pleaded.\n\nWe know, moreover, from authentic authority that the insanity of Riel in 1875 never existed. He had just been exiled for five years and his residence on Canadian territory was prohibited; there was then danger, and in some sort, criminality in receiving him. Nevertheless were we not in fear of compromising eminent citizens and people of high position in our province, we could follow the exile day by day, step by step, seeking to make proselytes in the province, when he was nominally confined at Beauport and Longue Pointe, which served him as refuges when found out. We quote in support of our assertion the words of M. P. B. Casgrain in his work \"Lettellier de St. Just and his times,\" p. 178: \"Useless searches were made to find out his retreat. The cunning half-breed, under different disguises, baffled all searches with the adroitness and the skilful daring of a trapper. What irritated his enemies was that he was invisible to them, although he frequently went out of his retreat.\"\n\nWhat remains of the argument of insanity? Nothing. Nevertheless the opinion of certain ecclesiastics of distinction who declared that the Exode was insane, will perhaps be brought against us. We respect the opinions of these venerable priests, but we do not think that they have meant to decide the question of legal madness, that in the great charity of their hearts, they preferred, like the Rev. P. Fourmond, to believe Riel insane rather than think him criminal to the extent shown by his actions.\n\nAfter having described the miseries and sufferings entailed on the community by the uprising of the Indians, a man from Batoche, wrote:\n\n\"Poor Indians! I do not think they can be blamed for their misdeeds, they did not know what they were doing. The guilty are those who stirred them to revolt.\"\n\nTHE FAIRNESS OF RIEL'S TRIAL.\n\nThe Liberals and the so-called Nationalists, for want of arguments, pretend that Riel did not have a fair trial. Let us see on what this pretension is founded. As to the choice of Judge Richardson, the Liberals are unable to criticize that, since he was appointed during the Mackenzie administration.\n\nAs to the composition of the jury, if the old tradition which requires that a jury be composed of 12 jurors was abandoned, the Liberal Government is responsible for it, the law relating thereto having been passed during its administration.\n\nIt is said that Riel should have been tried by a French Canadian or a half-breed jury, but this pretension was never made by the counsel of the half-breed chief. Mr. Fitzpatrick made a motion in the Court at Regina, on the 20th July, 1885, that Riel should be brought before a tribunal in Upper Canada or before a regular tribunal in British Columbia. (Riel's trial.) Is there any mention of a French Canadian or half-breed jury in this motion? Not at all. On the contrary, it is certain that in these two provinces the jury would have been exclusively composed of English members. It was also pretended by one of Riel's counsel, Mr. Lemieux, who for the purposes of the Liberal cause, displayed the bad taste, not to say the\nimpudence, of stating in presence of a newspaper reporter, that the Court had refused them the necessary delays, when his colleague and assistant in the case, Mr. Fitzpatrick stated at the trial: \"May it please your honours. I assume on behalf of the defence the responsibility of accepting the delays which the Crown has declared itself ready to give us.\" (Ten days.) In the same interview, Mr. Lemieux, moreover, states that the Crown refused to pay the necessary expenses to bring Dr. Howard, a specialist who had treated Riel at Longue Pointe Asylum, yet he could not be ignorant of the telegraphic correspondence which took place with the Minister of Justice.\n\nDr. Howard refuses to leave (?) unless he is paid $500 down, will the counsel for the defence accept another witness, or will I pay such sum and send this one?\n\nALEXANDER CAMPBELL.\n\nTo this telegram the counsel for Riel sent the following reply:\n\n\"The defence does not expect the Crown to pay such fees. Please inform Dr. Howard that he need not come if he's not ready to come for the fees allowed by law.\"\n\nWe are astonished at seeing a lawyer who dares, with a full knowledge of the facts, affirm the contrary of what is true, and even if such a course were adopted in the interest of a political party, it deserves to be stigmatised.\n\nBut it is useless to insist on this point; we will give proofs which our opponents cannot challenge.\n\nThe leader of the Opposition, Mr. Blake, stated at London (Ontario) in January last:\n\n\"I believe that it is right to say that, in my opinion, the Government acted wisely in defraying the expenses in bringing the witnesses for the defence; and from what I know of the principal counsel for the Crown, I am convinced that it is impossible that the case was so conducted that any injustice was committed towards the prisoner, or that it was derogatory to the high reputation enjoyed by the counsel for the Crown, or to the serious duties they had to fulfil. I therefore do not express, for the present, any doubt as to the fairness of the trial. According to the information which I possess, all was conducted with equity.\"\n\nIs this clear enough? And even if Mr. Lemieux dared to go against the statement of the leader of the Liberal party, we would not permit ourselves to doubt that he did not speak frivolously or without knowledge of his subject.\n\nThe Court of Queen's Bench of Manitoba, as well as the Queen's Privy Council, to which appeals in the Riel case was made, rendered their judgment that the trial had been fair and just.\n\nIn his address to the jury, Mr. Fitzpatrick makes the following statement:—\"We see here men who come from the east and from the west, the north and the south, to defend the cause of the Government. Gentlemen, permit me to say it, even in their presence, the Government has exercised a wise discretion in their selection.\"\n\nThe Leader, of Regina, of the 14th August, twelve days after Riel's condemnation, wrote the following:\n\n\"M. M. Fitzpatrick, Lemieux and Greenshields, before starting for the east, called upon Judge Richardson and thanked him for the impartiality and tact which had marked his judgments.\"\n\nNot one of these gentlemen protested against this news, therefore we have the right to draw the conclusion that it is correct.\n\nLastly, we have the statement of Riel himself, who says in the course of his trial:\n\n\"Your honour, I thank the Court for having postponed my trial, first for fifteen days, and then for eight other days, also for having furnished the money necessary for the appearance of the witnesses, and at last for the impartiality you have shown me. Addressing the Court for the first time, it is my duty to recognize what has been done, and what might have been refused.\"\n\nIt seems to us that these proofs are more than sufficient to show that the trial of Riel was just and equitable.\n\nThe many respites granted to Riel have also been made use of against the Government's action in executing the half-breed chief; but let us not forget that the first respite was granted to allow the prisoner to bring his case before the Queen's Bench Court at Manitoba; the second to give him time to go before the Privy Council; the third was asked for by his lawyers, asking for a medical commission.\n\nThe Liberals declare that after these respites Riel should not have been executed. They are simply reproaching the Government with having given too much latitude to the defence.\nAN ECHO FROM THE BATTLE FIELD.\n\n(From Le Pionnier de Sherbrooke.)\n\nOur correspondent Veritas, now travelling across the western region, and intending to reach Vancouver, in the search for documents, for an important work on this part of the country, has kindly transmitted to us the following notes, dated from Batoche, now famous for the battle of the 12th May, 1885.\n\nKnowing the high and honourable character of this correspondent, we do not hesitate to guarantee the exactness of the following information.\n\nBatoche, 14th November, 1886.\n\nMy Dear Pioneer—\n\nI have arrived at the famous establishment of Batoche, after having travelled five days by mail coach, always following the route of General Middleton in his march towards the theatre of the insurrection.\n\nThis country is very little settled, and settlements are scarce on the road, except some miles around Batoche. Here there is a good settlement.\n\nWe took dinner with a half-breed farmer compromised in the last rebellion, who is settled on the banks of the Saskatchewan river. This good man and his family have been full of good will towards me, and made every effort they could to be agreeable to me.\n\nBatoche is a fine country and no one would think it had been the seat of a battle. Today being Sunday, I have been wondering at the people going to church. They were dressed with taste and were so good looking, and seemed to be so happy and contented, that I thought myself in one of our Canadian parishes in Beauce County.\n\nThe damages done by the war are nearly all repaired. Many half-breed dwellings that had been bombarded and burned by General Middleton have been rebuilt.\n\nIn talking with the settlers and half-breeds, I was astonished at the reserve with which they talk of Riel; but no one found he suffered unjustly. They say he undertook a task which would have made him a hero, if he had succeeded, but they always expected that in case of non-success, he would be executed for his violation of the law.\n\nThere is not a half-breed here who believes that Riel was insane.\n\nThey say that this rising of the North-West inhabitants had been prepared and instigated by Riel men during his stay in the United States. It is admitted here that Riel, living in the Western part of Montana, was in constant communication with the half-breeds and the Indians of the North-West, and caused them to believe that, at a proper time, he would come back and take again from white men the lands they had usurped. The half-breeds generally, were expecting this with impatience, hoping that in hindering the colonization of the country they would regain their old life of hunters over these uninhabited plains.\n\nBut now that Riel has been vanquished and suffered the punishment imposed by the law, they consider this to be the inevitable consequence of his nonsense, and it is really astonishing to see the little regard they have for him.\n\nI had also occasion to enquire about those famous grievances of the half-breeds; and I talked of these to many of them. I especially enquired if it was the case that they had been expelled or threatened with expulsion from their lands for the benefit of colonization companies. Such a thing never happened them. In listening to those half-breeds give the lie so formally to the stories that I read in the Press of the Province of Quebec, I hardly believed my ears. You could obtain a great number of certificates from these brave people, in support of the information that I now transmit to you.\n\n\"VERITAS.\"\n\nCORRESPONDENCE.\n\nPrince Albert, N.W.T., 1st December, 1886.\n\nTo the Editor of the Pioneer:\n\nDear Sir,—Since you manifest a desire to have the fullest information in connection with the too famous rebellion which afflicted our territories last year, I transmit to you a few more remarks, in the hope that they will serve to make things clearer, and to destroy prejudice.\n\nI have read lately, the letters of Philippe Garnot, as they were published in the Étendard of the 21st September and 4th October last. Neither in the one nor in the other is there a word of explanation as to the real causes of the revolt. It is curious enough that this brave Philippe Garnot, of whom the Rielists of Quebec have wished to make an instrument, does not enter into the exposition of the grievances, and especially has not noted with any precision those cases of persecution of which the half-breeds were the victims. If, as our newspapers have\nbeen crying out for a year, certain half-breeds were ejected from their lands, or threatened with being so, for the profit of speculators, it would have been easy to give the names of such half-breeds, and the descriptions of their lands. Not only has this point not been touched on, but not a single clearly defined grievance has been pointed out. What then were the causes of this rebellion which party spirit endeavours to excuse?\n\nI have just been visiting the districts of Carleton, Stobart or Duck Lake, St. Laurent, Batoche and Fish Creek. I mixed everywhere with the half-breed colonists I talked with them, I interrogated them, and I have nowhere found a single case, nor heard the mention of a single case, where a single colonist has been expelled, threatened, or disturbed by the Government.\n\nI may tell you that I have even been astonished at not discovering, at least, some rare acts of grave persecution, after what I had read in the newspapers, and the echoes from the hustings which had reached me.\n\nThe only complaint I heard formulated, was against the slowness of the Government in granting the scrips or titles to the lands claimed by the half-breeds, and also against the tax imposed for cutting wood.\n\nAnd I only found two persons who complained of this affair of the wood cutting. One of these persons had paid, in all, $0.50 of taxes, and the other had entirely neglected to pay any, and had, notwithstanding, never been troubled or threatened with proceedings in any manner. Such is the résumé of all the famous grievances, and I defy anyone to go through the country as I have done, and find more.\n\nIt is well to remember that the half-breeds of Manitoba and the half-breeds of the Saskatchewan are one and the same people, and that a large number of those who inhabited the Saskatchewan in 1835 had previously inhabited Manitoba, and were there at the time of the first rebellion 1869-70, when they received the scrips or parts of lands by title of indemnity, as first occupiers of the soil.\n\nIt is known that the greater number of these unfortunate half-breeds speculated in these lands and afterwards sold them for a trifle, and penetrated still farther into the plains, but always keeping the remembrance of this claim, and imbued with the idea that they were the primitive owners of this new territory, as they had been promised as owners of that of Manitoba.\n\nThe most malignant amongst those who remained in constant communication with Louis Riel since his sojourn in the neighbouring country of Montana endeavoured,—and succeeded—in persuading the others that when the half-breeds had made a treaty with the Government in 1870, they had ceded only Manitoba, and that the half-breeds were still the proprietors of the other territories of the North-West, and that they could obtain several millions of dollars from the Government, and that if the latter refused to pay it would be at the cost of millions, through the troubles which would follow.\n\nThere, in few words, is the true history of the causes of the rebellion.\n\nFrom his retreat in Montana, Riel followed different plans of agitation, and especially in 1883, he was in communication with the Farmers' Unions. He also followed the virulent tone of the grit newspapers of Upper Canada, and the thousand embarrassments created for the Government by the general Opposition press. He thought the moment opportune for coming to the North-West, and exciting them for the purpose of extorting money from the Government, as well for the half-breeds as for himself.\n\nHe began by holding public meetings here at Prince Albert, and in each of the other settlements, making conspicuous there the rights, or pretended rights, of the people, and getting petitions signed, addressed to the Government. Seeing that Riel was at the bottom of these requests, and knowing his antecedents, the Ministers would not enter into any recognition. Seeing this, Riel became exasperated, and began to go from house to house, and to excite the minds of the people, preaching to them to use force in order to obtain what he called their rights. So great became his evil influence that the good Fathers, the priests at each mission, became alarmed, and counselled their flocks to have nothing more to do with this movement, for they saw that it might degenerate into open revolt and loss of life.\n\nThe effect of this was to check Riel for a time, but he did not consider himself beaten, and resolved to try by a desperate effort to render himself master of the people, by drawing them away from the clergy, and teaching them to despise their wise and faithful instructions. He resolved to destroy this salutary obstacle which opposed itself to his designs.\n\nIt was then that he posed as a prophet, as a religious reformer; that he played the marvellous, the mystical, to seduce these poor half-breeds, full of faith, but ignorant and superstitions.\n\nInformation of the agitation was soon given to the North-West Police, and detachments\nwere sent to guarantee the maintenance of peace in the districts. It was in response to these preventative measures that Riel hastened his messengers to the Indian chiefs of the different reserves, asking them to join him, and help him to seize upon the Territories. The result of the intervention of these cruel allies is known.\n\nSeeing the dangerous turn that events were taking, the priests began to denounce the agitation from the pulpit, and to put the faithful on their guard against Riel, warning them that they were committing a great sin, and that they would be punished for it by bloodshed and death.\n\nUpon this Riel, resolved to have recourse to extreme methods. He summoned the priests to come to Batoche and remain there, seeing that their teaching was opposed to his plans, and that he could not gain his ends if they (the priests) remained in their respective missions. The priests refused to submit to this demand, and it was then that Riel had them arrested and brought by force to Batoche. Father Fourmond, Father Ougerville, Brother Piquet and the Sisters of St. Laurent, were all deprived of their liberty, and subjected to a strict surveillance. They were permitted to go only a short distance from the house which was assigned to them, with the intimation that they would be shot if they attempted to escape.\n\nLet me relate to you the arrest of Father Tonge, as he has just related it to me himself.\n\nSome days after he (Father Tonge) had denounced the agitation from the pulpit, Riel came to him and announced that it was no longer permitted to him to live in his mission; that his sermons were misplaced and prevented him (Riel) from controlling his men, and that he must follow him at once to Batoche. Father Tonge replied that, in fact, he did not preach against the revolt, and that he denounced it as likely to end in pillage and murder, and that, in acting thus, he was only following the orders of his bishop and the rules of the church.\n\nRiel became excited then, and said: \"I am above the bishop; you must go where I tell you; you must come to Batoche.\" The father replied that he would not go, and Riel said: \"We shall see.\"\n\nThe next day Father Louge was returning on horseback from visiting a poor sister person in his mission, when three miles from his church, he met three of Riel's men, two of them mounted, and the third leading a carriage. They said to him: \"Mon. Riel has sent us to look for you, Father; you must come to Batoche. Get down from your horse and get into this carriage, and we will return.\" He said to them: \"I will not get into the carriage; I will not go with you, and you have not the right to arrest me.\" They tried then to seize upon him, but a vigorous cut of the whip on his horse enabled him to escape, at least for the moment, and when once the night came he was able to enter his house.\n\nBut Riel (the martyr and patriot of the Liberals) did not consider himself conquered. Learning of this failure from his co-religionists, he hired a larger number of more determined ones. The next morning five emissaries of Riel presented themselves at the priest's house, and summoned him, by authority of Riel, to go to Batoche, saying that they had a formal order to make him a prisoner. He replied that he would not follow them, and that he was certain they would not use violence against a minister of the church. They replied that they would not use violence if he would give himself up without resistance, but in case of refusal, they have instructions to bind him, and to lead him, at the same time exhibiting a rope which had been given them to tie him with, in case of refusal on his part.\n\nAh! Unhappy agents of a sacrilegious tyrant. This miserable Riel, in his obstinacy and culpable blindness, had given you a rope to garrote a minister of Jesus Christ, an apostle devoted of the gospel, a model of charity and devotion. This heinous crime on the part of Riel filled the measure of his iniquities. This rope, which he employed for using violence to one of the anointed of the Lord, was to become the instrument of his chastisement, and the means of expiation of his series of crimes and injustices. Riel employed a rope, and he was to perish by the rope. When Riel, on the scaffold at the point of being hurled into eternity, asked the forgiveness of all whom he had molested, the memory of this poor missionary, so sorely persecuted, must have come vividly to his mind.\n\nFather Tanze, finding himself alone against five, ended by constituting himself their prisoner and following them to Batoche. On his arrival at Batoche, Riel came to him and said: \"Well, Father, you have arrived. You can rest here in full liberty, but if you try to escape you will be shot by the Indians.\"\n\nIt is thus that these good fathers, as well as the Sisters of Charity, were violently taken away from their good works and pious devotions by the orders of him whom the Liberals have the audacity to cite as having represented the Canadian and Christian Spirit of the North-West.\n\nTime fails me to relate to you all the insults, all the outrages committed against the priests, against the religious women, against peaceable citizens by Riel's men, and especially\nby the savages. Those human-faced monsters, called to the help of the enterprise of the rebellious chief. Ah! Compatriots of the Province of Quebec, if you were to come and spend one or two days in these parts, you would, on your return, hasten to throw into the fire those portraits and busts of Riel, the martyr, the patriot, which have been distributed among you by demagogues clever in deceiving you, demagogues who, like Riel, are ready to do anything in order to gain their ends.\n\nWhen one thinks of what has happened in these parts; when one collects at the very places the recitals of the crimes committed by the half-breed chiefs and his followers, and when one thinks at the same time of the Liberal Press, which has, for a year, designated as villains, those who would not venerate Riel of holy and glorious memory, one asks one's self how far political folly can conduct its victims.\n\nAs for the insanity of Riel, it does not seem to exist except for the Grits of Quebec, for the Half-Breeds here, who have seen him and known him for months, who were his administrators, his companions in arms, all tell you that he was perfectly sound in mind. Some among them hearing it said, however, that in the Province of Quebec it has been tried to make him out insane, say sometimes: \"It is possible that he was insane during the trouble; for it was difficult to suppose that a man of judgment could be so thoroughly wicked as he was.\" That is what some of the Half Breeds declared to me in reply to observations which I made on the pretended insanity of Riel.\n\nOne word more to my French Canadian fellow-citizens who have let themselves be led into a so-called National movement, under the pretext that Riel had been executed because he belonged to the French race. This is a huge piece of humbug, invented by charlatans and speculators in patriotism. You will not get a Half Breed of this country to believe that Riel was executed because he belonged to the French race. On the contrary, they will tell you that Riel made them rise against all the Canadians in general—the French Canadians as well—as the others—and that he called these last \"rascals\" on more than one occasion. For the rest, the Half Breeds tell you that Riel was of Irish origin rather than French. I was much surprised to hear this on all sides in this district. His grandfather was an Irishman, and his father was known under the appellation of Riel of Ireland. It is true that he had French blood, but it was from his mother only. It was the Irish blood, and the savage blood, which swayed him. Besides, I remember having read a notice in this sense, written by our celebrated archeologist, Mon. l'Abbé Tanguay, but at that time I did not pay much attention to it. Whether Riel was Irish, French, savage, or no matter what, this did nothing for his cause before the jury, but it is important enough to trace his origin, from the moment when it was attempted to be made a national question as regards his execution.\n\nI ask those who wish to represent Riel as a patriot to come and go through the different theatres of the last rebellion, and to contemplate the desolation which he has caused among the poor half-breeds. They should talk, as I have just done, with the widows of the victims of this autocrat,—whose word was law. They should see the tears of a poor widow flowing, like the one I tried to comfort the day before yesterday, weeping over the death of a beloved husband, the sole support of five unfortunate children, devoted to misery. They should see these poor little orphans, their faces pressed to the windows to see us pass, exhibiting their figures thin from privation, and their clothes in rags. When one enters these abodes, formerly prosperous and now desolate, in spite of the succour received from the Government, one feels that one is in the presence of misfortune, and of ulcerated hearts.\n\nI saw a poor woman at Fish Creek who had two sons killed at Batoche, and two others badly wounded. Her children were forced by the orders of Riel to take up arms, and she, like many others, weeps over the tombs erected by this unhappy rebellion.\n\nCompatriots of Quebec! if you have real sympathy for the half-breeds send your offerings to these places. It is here that are real victims deserving of your sympathies, your help, and your alms. Come to the aid of these good missionaries who do so much to relieve these poor half-breeds, and raise them from ruin.\n\nIf the chief of the pretended National party, Mr. Laurier, were to visit these districts in person, if he were to talk with the people, if he were to study the ravages caused by the insurrection, if he were to take note of the declarations so spontaneously made by the victims he would blush for the injurious work which he has not feared to undertake among his compatriots in his ambition to attain to power.\n\nIf all the good and loyal Canadians, who, in ignorance of the facts, and under the shade of a surprise hypocritically arranged by intriguers, allowed themselves to be drawn, after the 16th November, 1885, into a movement so much the more dangerous because it was clothed in the appearance of generosity and patriotism, if, I say, all these Canadians were to come here to judge for themselves, they would return, as I myself returned, shaking their heads.\nand meditating what a deplorable thing it is to form too hasty judgments, and to decide, without taking time to inform one's self correctly.\n\nTo return to the letters of Philippe Garnot, it is to be remarked that this Garnot was, himself, one of the principal rebels who owes his actual liberty only to the clemency of the authorities with regard to him. In writing as he does at this moment he is only seeking to justify his antecedents. This proves what I have, besides, stated myself (and I warn the Government of it), that if the rebellion has been crushed and its chiefs punished, there are still bad elements in the midst of this population, some wicked heads into which the writings in the opposition newspapers, and the Rielist excitement in Quebec, might put bad designs.\n\nIt is true that the mass of the rebels were led by force to take up arms, but apart from that there is a large number of bad subjects, who conspired with Riel long before the events of 1885, and who helped their chief to prepare those events. There are thus bad elements still in these parts, and we must not be astonished if the Liberals recruit thence some accomplices to aid them in warping public opinion.\n\nIt has been said that the execution of Riel was useless, and that his imprisonment for life would have sufficed for the ends of justice. The opinion of the half-breeds here is, in general, much opposed to this pretension. Apart from those who were his agents, his accomplices and associates in treason, all tell you that he deserved his sad fate, that if he had been simply incarcerated his friends would have made constant efforts to obtain his pardon, and that this prospect of seeing Riel return, some day or other, would have kept in fear those who had been against him, as well as the peaceful colonist in general.\n\nI beg you to excuse the length of these remarks. May they serve to destroy prejudice.\n\n\"VERITAS.\"\n\nTESTIMONY FROM DAKOTA.\n\nThe following letter from Mr. André Martineau, of Dakota, to his brother in Ste. Edwidge, Quebec, throws a clear light on Riel's motives and actions:\n\nSt. Joe, Pembina County, Dakota, Jan. 6th, 1887.\n\nVery Dear Brother,—I avail myself of the first moment to answer on the subject of Riel, and particularly to tell you what I know of his pretended insanity; for I understand this to be the principle end of your enquiry.\n\nThe information that I can give, concerning Riel, is founded upon long conversations that I had with him, and the daily observations I naturally was able to make during the four or five months that he, as you know, passed with me. We conversed together very often and at length, after his arrival in the United States, following the rebellion of 1870. I remember that on one occasion he set himself to look at me fixedly, and to demand of me what I thought of him, of his past life, and especially of the insanity attributed to him by certain people in Canada. I answered that I did not believe that he had ever been insane, and upon that he explained to me how often and for what reasons he had pretended, on many occasions to be mad, for the purpose of better attaining his ends and foiling his enemies.\n\nHe attributed the commencement of all the troubles, in 1870, to the Hudson's Bay Company, who governed then the North-West and exercised a monopoly of trade. His aim was to get restored to the Metis the wealth in his opinion, unjustly accumulated by the Company.\n\nFrom all that I have known of him, I believe that Riel sincerely wished the welfare of the Metis; but never in my life will any one make me believe that he was mad, and no person in Montana, where he afterwards lived, could be got to say seriously that Riel had ever been a madman.\n\nDuring the stay he made with me, I never understood that he dreamed of making an appeal to arms, and I think that if the Government had not refused to pay him the money that he claimed from them, he would not have committed the excesses that are well known. His case was not made much of, and it was this which led to the troubles.\n\nWhen Riel left to go to the North-West of Canada, he was confident of succeeding in getting a large sum of money paid him by the Government. He owed me, poor fellow, a sum of $185.39, and he reckoned on the success of his mission to enable him to pay me as well as many others; for he was over head and ears in debt.\n\nIn conclusion, I wish you every kind of prosperity for the New Year and remain,\n\nYour devoted brother,\n(Signed,) ANDRE MARTINEAU.\nA MISSIONARY'S TESTIMONY.\n\nLETTER FROM REV. FATHER TOUZE.\n\nThe Rev. Father Touze is one of the oldest missionaries in the North-West, where he has exercised his ministry among the Metis and Indians for more than twenty years. He was on the spot during the Riel insurrection and saw with his own eyes what took place. He is, therefore, an irrefutable witness.\n\nStobart, Duck Lake, Nov. 22nd, 1886.\n\nDear Sir,—You have asked me for my opinion regarding this too famous agitation, which has been stirred up by certain parties in Canada. I am not much in the habit of writing nor have I much ability that way, but I will comply with your request, hoping that my frankness and simplicity may not be unworthy of attention, and, in the first place, permit me to say that however charitable, well-disposed or sympathetic I may be, I find it difficult, not only to explain, but to excuse this agitation—rather, this madness, which has broken out and still continues in connection with the execution of Riel. It is all the more inexplicable that it is the effect of a contradiction of the most obvious character. Those same Liberals said during the trial and up to the very eve of the execution, that the Government would not have the courage to fulfil its duty towards Riel, and that, though the latter had abundantly merited the penalty of death he would not have to submit to it. But, contrary to their expectation, the Government, having exhausted all its patience and long suffering and given Riel every facility for pleading his cause by allowing him access to other courts of justice, permitted the sentence pronounced against him by the higher court and confirmed by the superior courts, to be carried out. Then it was that those same Liberals, wishing in any event to harass the Government and to overthrow it, if possible, changed their cry and ever since have raised their voices against the Government for executing Riel, because, as they urged, he was a French half-breed and a Catholic.\n\nThe question may be asked whether Riel was not all that during his trial and before his execution, and the answer must be in the affirmative. And those Liberals were then, as now, the enemies not only of the Government and Sir John, but also of Riel and those very persons whose protectors they pretend to be to-day. I do not think that ever, in any country, was there a political agitation analogous to that which they are now carrying on. That for a just sentence legally enforced, and which it was the clear duty of the Executive to enforce, people should, at the instigation of shameless politicians, and without taking time to reflect, blame in chorus what they had every reason to approve, is certainly difficult to explain. Others before me have made the same remark. I will repeat it, and I appeal to all honest Canadians, to all loyal citizens and good Christians, who, if like me, they had seen and heard all that went on in the North-West, would carefully refrain from joining a clique whose aim has been to falsify facts for the success of their party and themselves. If those people really loved the Metis, if they had at heart the interests of French Canadians and Catholics, their conduct, I feel assured, would be very different. I would like to believe that it is well with Riel, but if God had mercy on him and gave him a place in the house of His glory, why should those who pretend to love him labor so strenuously to disturb his peace and to tarnish his joy? If, on the other hand, his soul was not sufficiently purified for such bliss, and he still groans in the place of suffering and expiation, let us in silence aid him with our prayers. And as for his compatriots, his kindred, his friends, the entire nation of the Metis, surely it would be rendering them a greater service and setting them a better example to let them forget a proceeding of which the justice cannot be disputed.\n\nThe sad events of the spring of 1885 have had results sufficiently unhappy. The immediate and later consequences of the rebellion were painful enough without seeking to add to them. Enough evil has been done already without the attempt to do more. Without exaggeration I can aver that the continuous agitation in Canada is producing the worst effects here in the North-West. The wounds already inflicted were severe enough. Why then tear them open and lacerate them afresh? The greater number of my people who shared in that deplorable rebellion were surprised into it—were led astray in spite of themselves. What is necessary now is to redeem them from the results of so grievous a mistake. At first the task was possible and even easy, but the agitation in Quebec has made it more and more arduous, so that now the work of reconciliation has become almost impossible.\n\nIn conclusion, I beseech you, my Canadian fellow-countrymen, if, as you say, you love the Metis, work no longer against their dearest interests, but, on the contrary, help us, by your calmness, by your quiet submission to established authority, to undo what has been mistakenly\ndone, to restore what has been impaired. Leave our people in peace and tranquility of mind, which they so much need to recover from the disasters into which Kiel's unhappy rebellion plunged them. With my best wishes,\n\nI remain, dear sir, your obedient servant,\nLS. TOUZE, priest, O.M.I.\n\nLETTER OF ARCHBISHOP TACHE.\n\nNo man living understands the affairs of the North-West better than His Grace Archbishop Tache, and no man's authority stands higher. We have, therefore much pleasure in publishing the following letter:\n\nOTTAWA, 13th March, 1886.\n\nTo His Lordship Mgr. Latiche, Bishop of Three Rivers:\n\nMy Lord and Very Dear Friend.—I am once more at Ottawa to continue working there in the interests of our dear population. The terrible crisis in our North-West, the deplorable occurrences that have taken place there, and their sad consequences, all cause me the greatest pain. I frequently say to myself; Why was I not forewarned of all this? You easily understand the effect produced amongst the French delegation by the Landry motion. Alas, why must party spirit ever dominate every other sentiment? I see men whom I know have not the slightest interest in or regard for our people, for our dear half-breeds, who nevertheless are displaying an apparent zeal which but imperfectly conceals the true motive of their conduct. For the same reasons and with the same aspirations they are playing the counterpart of what was done in 1873 in North-West affairs on the fate of the unfortunate victims that were sacrificed to vengeance, or that they pretend to protect according as it suits their purpose.\n\nOn the other hand there are certain men—I remark with pleasure that we have a certain number of sincere men—who entertain a true desire to defend and aid our population, even were it necessary to sever their party ties, separate themselves from their natural allies and lifelong friends. As you may imagine people are anxious to know my opinion. My sole object, my only thought in all this is one thing: the happiness of the people to whom I have devoted my existence. What should be done to insure so desirable a result? There naturally lies the difficulty. Several members of Parliament, who are my friends, have put the question squarely to me thus: \"Should we overthrow the Government?\" After mature deliberation I felt bound to answer: \"Such is not my opinion. The overthrow of a government is not always a remedy for evils which we deplore for faults committed. In 1873 the Government was overthrown on the amnesty question. And what was the result? Simply that harsh treatment replaced weakness. The new Government decreed and assured the outlawry, imprisonment, sentence of death and exile of the chiefs, and for the others an amnesty, a partial amnesty which had been offered to us before, and which we had declined. Are the men who did all those things the only friends of half-breeds? Must we sacrifice everything to place our destinies in their hands?\"\n\nA third party is being formed. I know the loyalty and goodwill of those who form part of it. They are sincere, but will they be able to attain their object by rupturing their present alliances? Can they hold aloof from all alliance, and will the new alliance insure the happiness of the people of the North-West? I do not believe it.\n\nIf the present Government wishes to profit by its experience—I may say it without hesitation—if they will profit by their mistakes, they would be much more ready to do good than others who have not the same data, than other men who, even were they well disposed, would have to grope about before being able to seize the situation, the inconveniences that surround it, and the remedies to be applied. Let the personnel of the employees in the North-West be modified. Let the natural rights of a people that were taken unawares in their own land be recognized. Let the half-breeds and the Indians be treated as any other people placed under the same circumstances would wish to be treated, and there will be no need for political revolution. I have, therefore, felt it my duty to state to the friends who have consulted me on this subject that if their political sympathies are in favour of the present Government, they could, without declaring themselves the enemies of the North-West or its people, vote against the Landry motion, which was simply one of want of confidence; but that they should not be blind partisans, but insist upon having the grievances so often set forth, redressed and compensation granted for the losses resulting from the delay in rendering justice. Speaking of the Government, I used to my friends the well known expression: \"Let them be converted and live.\"\nOur long friendship, the lively and sincere interest you show in the people of the North-West, causes me to make known to you the attitude I assume and the opinion I have formulated. Naturally this letter is not for the public. Nevertheless, if later on, those to whom I have expressed my opinion should be made to suffer because they accepted my views, I authorize you to communicate to them this letter, and I authorize them to use it for their own justification.\n\nForty years of devotion to the cause of the Indians and half-breeds, my whole life spent in their interests, give me the assurance that I am incapable of sacrificing those interests, or to do anything that in my inmost conviction is not to their advantage. Let those who do not think as we do do a part of what we have done, and then, and then only, will they have the right to be astounded at the attitude I have just indicated.\n\nIn a few days, my lord and dear friend, I shall pay you a visit. Then we can open our hearts to each other on those subjects that so deeply concern and interest us. Who would have dreamt four years ago, when, at this season, we were preparing to leave for Isle a la Crosse, that we should see what we have since experienced, that we should have been tried as we have been so sorely. Let us bow to the will of Divine Providence, extend to men pardon for the grief they have caused us, and, bound together in affliction as in prosperity, let us pray one for the other, so that one day we may enjoy that felicity which is unalloyed.\n\nYour devoted and sincere friend,\n\n† ALEX.,\nArch. de St. Boniface, O. M.I.\n\nA true copy.\n\n† ALEX.,\nArch. de St. Boniface, O.M.I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001322.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 31, "total-input-tokens": 46814, "total-output-tokens": 33288, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3169, 1], [3169, 8326, 2], [8326, 13397, 3], [13397, 18423, 4], [18423, 23397, 5], [23397, 28730, 6], [28730, 32996, 7], [32996, 37445, 8], [37445, 42906, 9], [42906, 47691, 10], [47691, 52699, 11], [52699, 57731, 12], [57731, 62905, 13], [62905, 67782, 14], [67782, 73023, 15], [73023, 78023, 16], [78023, 83145, 17], [83145, 86594, 18], [86594, 90495, 19], [90495, 95341, 20], [95341, 100149, 21], [100149, 104395, 22], [104395, 108833, 23], [108833, 113272, 24], [113272, 118270, 25], [118270, 123478, 26], [123478, 128798, 27], [128798, 133291, 28], [133291, 138341, 29], [138341, 143030, 30], [143030, 144686, 31]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]