[{"id": "516b25afe2070cbc103232dbef5b7b62b73cd388", "text": "Mr. BLAKE. Mr. Speaker, I rise to move the motion of which I gave notice some time ago, as follows:\n\nThat it is the duty of the Government without further delay to bring down further papers relating to North-West affairs, and throwing light on the situation prior to, during, and subsequent to the late rebellion.\n\nI do not think it is necessary for me at this stage to trespass at any length on the time of the House in support of this motion. I have already stated upon former occasions, I stated last Session and I have restated this Session, what I conceive to be the general aspects of this question, the principles upon which we ought to deal with it and the facts which are material to a judgment. We all know, to our sorrow, that a very serious revolt occurred in March of last year, involving the loss of millions of treasure, many sorrows and many lives and involving also consequences to the future of our country, material and moral, which it is difficult at this time to estimate. When in our age of the world and with our system of Government such an outbreak occurs, the *prima facie* presumption of mankind is that there must have been something wrong on the part of those who had control of the administration of affairs. The *prima facie* presumption is that there will be no rising, with all the risk and troubles which that involves, without some cause, inadequate it may be, but still without some cause or without some default on the part of those who govern. That presumption is, of course, capable of being rebutted; but nevertheless it exists; it is founded upon common sense; and it involves this consequence, that the Government which has the administration of affairs, which has full control, is bound to vindicate itself under such circumstances; when the public peace has been broken, when public order has been disturbed, it becomes the bounden duty of the Government to set forth a vindication of itself and a rebuttal of that presumption which arises from those facts. Another material proposition is this: That the Government is in possession of all the evidence and the facts, and is bound from that circumstance to lay them before the House and the country as materials for its judgment. So much, Sir, for the general propositions which I have advanced; and which I restate to-night as applicable to the case of a rising in our times. But in the present case there are special reasons why these duties to which I have referred devolved upon the Government of the day. In the first place, there were long standing, unsettled claims and grievances; substantial or unsubstantial, there were yet long standing unsettled claims and grievances. Why, Sir, the leader of the Government last Session and members of the Government since have declared that there was culpable neglect on the part of the late Administration, which ceased to hold office in the fall of 1878, with respect to some of those North-West claims. That proposition is denied. But supposing it to be admitted, supposing the statement to be true, supposing the allegation of hon. gentlemen opposite which, with a perversity which is almost ridiculous, they assert in their defence were true, does not that prove conclusively how aggravated is that guilt, how intense is that guilt, which left unsettled and undealt with claims in respect of which there had been culpable neglect so long ago as the fall of 1878? How are we to account for 1879; 1880; 1881; 1882; 1883; 1884 under those circumstances? Then, Sir, there was in this case also a long continued agitation which renders the neglect and delay the less excusable. Again, there was a serious warning and a crisis in the position when, in June, 1884, Riel came, after which time there were nine months for action before the actual outbreak, and the circumstance of his arrival and all the concomitant circumstances add enormously to the responsibility of the Government for diligence, promptness and liberality in their action. Again, there was in this case the special circumstances of danger arising from the large savage Indian population in the Territories, from the relation of the half-breeds to the Indians and from the isolated and defenseless position of the settlements in that country—circumstances known to the Government, circumstances so well known to the Government that the First Minister declared last Session that the wonder was there had not been an outbreak long before 1885, long before the outbreak last year, when he told the House that the Indians were desperate, starving and in a condition of irritation and discontent. Those were circumstances which certainly were calculated to heighten to an incalculable degree the responsibility of the Government, and therefore to call into display in the highest measure diligence and earnestness in the settlement of all grievances. Now, the Government acknowledges theoretically its duty of diligence and fair treatment. It acknowledges also its accountability to Parliament, and it has challenged and courted—I use the phrase of the First Minister himself—an enquiry into these transactions. But it has alleged, first of all, that there were no complaints from the half-breeds before the rising. The First Minister stated on 26th March, 1885:\n\n\"Before Riel came in they (the half-breeds) had never sent in a bill of rights to us; they had never sent any complaints to the Government.\"\n\nSir David Macpherson, the late Minister of the Interior, in the Senate during last Session said:\n\n\"No half-breed delegation came to Ottawa to complain of ill-treatment or to make complaints in relation to their land.\"\n\nThen the Government alleges by the mouth of the late Minister of the Interior—I quote again from his speech of last Session—that:\n\"There never was any reason to apprehend an outbreak; there was not the slightest apprehension of the discontent taking any form more serious than words until the outbreak took place.\"\n\nSo that having alleged there were no despatches embodying the grievances of the half-breeds before the rebellion, they allege there was no warning or apprehension of the outbreak until the outbreak occurred. Then they allege that there has been no negligence and no delay, neglect or mismanagement; that all things were done well, wisely, promptly, liberally, and that there were no grievances.\n\nThe First Minister repeated during the course of last Session these statements, if not these words, their substance; and Sir David Macpherson stated in the Senate last Session:\n\n\"The half-breeds had no grievances whatever in relation to the lands or as to any other matters.\"\n\nIn truth the allegation of the Government is that there were no grievances connected with the half-breed Indian rights, with the rights of the unenumerated half-breeds of Manitoba, with the rights in connection with surveys, river fronts, patents, reserves, colonisation companies, wood rights, and other rights. Then, the Government alleges that white men were at the bottom of it all. The First Minister said last year in this House that there \"was a deep laid conspiracy; that it is to white men, to men of our race and lineage, and not to the half-breeds, nor yet to the Indians, that we are to attribute the war, the loss of life and the loss of money.\" And Sir David Macpherson said in the Senate:\n\n\"I fear there will be found among them (the guilty parties) more than redskins. I fear that unfriendly whites, disloyal whites, men of the farmers' union class have had a good deal to do with precipitating the half-breed rebellion.\"\n\nThen the Government alleges that until they came in, until the period at which they assumed office, in 1878, the half-breeds were happy, that they were contented and did not complain. What said the First Minister last Session? He said in substance:\n\nThe Government alleges that till they came in the half-breeds were happy, contented and did not complain, and it was after they came in that the half-breeds, taught by the Opposition in Parliament and by the Reform press that they were oppressed; and the Government charges on the Liberal party in this House and out of it, the responsibility and the consequences of the rebellion.\n\nNow, Sir, the distance which exists between Ottawa and the North-West Territories rendered it necessary that the dealings of the Government with that country, and the communications between local officials and the governed parties of that country and Ottawa, should be almost entirely in writing. They have been almost entirely in writing and there are, therefore, records of the course of events. \"What is written remains,\" and that evidence is in the hands of the incriminated Government. If it has been guilty of no neglect, delay, or mismanagement, the papers will show it. If there were no grievances, the documents will prove it. If there were no complaints, the production of the documents will show that. If there were no warnings of danger the papers will show that. If there was a conspiracy amongst the whites and they are the guilty people, the written evidence will establish it. And if the Liberal party in and out of the House fomented discontent and raised the rebellion, the evidence will doom them to the fate they deserve. It is then the duty of the Government to give us the full information. These papers are not their papers; they are the country's papers. The Government have been pressed to perform this duty in Parliament since the year 1883, in March of which year I moved my motion with reference to the grievances of the people of Prince Albert, and you heard this afternoon, a few moments before it was expected this motion would come on, a supplementary return to the order of 1883, brought down to Parliament. Since March, 1885, the pressure upon them has been constant and continuous; they have been asked time and again, from day to day, to produce the papers. They have acknowledged their liability to produce them. They have acknowledged their obligation to produce them, but they delayed last Session on these grounds: First, they said it was dangerous to the public interest during the rising to produce certain papers, the existence of which was acknowledged, the materiality of which was acknowledged, and they were detained for that reason. Secondly, they said it was dangerous to private interests during the rebellion to produce certain papers the existence of which was acknowledged, the materiality of which was acknowledged, but which were not to be produced while the uprising continued. Thirdly, they said that they had not clerks enough to copy them; that we asked for so many papers, that they could not possibly get the time; that they were embarrassed by these demands, that time must be given. And lastly, towards the close of the Session, they promised that these papers would be collated and laid on the Table of the House at the opening of this Session. I asked for them at the opening of the House this Session and was told that they were to be brought down. I asked when they were to be brought down, and I was told that they were in course of preparation, and here we are in the fifth or sixth week of the Session without these papers yet. I say it is time for this House to assert its dignity, and to teach the Government its duty by declaring that it is its duty—as I move that the House shall now declare it to be their duty—to bring down these papers.\n\nSir HECTOR LANGEVIN. The hon. gentleman has tried to do the best he could with his motion; he has tried to show that the Government had failed in their duty in bringing down papers to this House. The hon. gentleman will forgive me, I have no doubt, if I do not agree with him on that head. The Government have brought down, from time to time, the papers that were asked by the addresses of this House or the Orders of this House. We have, in certain cases, delayed bringing down papers, because it was not in the interests of the country that they should be brought down. That is a responsibility which the Government had to take, and which, as long as we occupy these benches, we intend taking. In the position we hold, of course there are matters which we know, and which hon. gentlemen around us and opposite us are not in a position to know, and we have to protect the public interests, even against the curiosity, the landable curiosity, of hon. gentlemen on the opposite side. The hon. gentleman says that there were addresses passed by this House calling upon us, in 1883, for certain papers, and that they were not produced. We produced a number of papers from time to time—large numbers of papers—and I have no doubt that with the exception of the hon. gentleman, the leader of the Opposition, I do not suppose we could find another member of this House who has gone through those papers.\n\nSome hon. MEMBERS. Yes, yes.\n\nSir HECTOR LANGEVIN. A few, but not all, I am sure. I am sure there is not one member that will say that, and I do not expect it either; nobody expects it from them. Those papers were so numerous that it was a task to go over them. But the leader of the Opposition thought it was his duty to do so and has done so, as he does I have no doubt with all other papers brought down to this House.\n\nMr. BLAKE. Oh, no.\n\nSir HECTOR LANGEVIN. Well, when I see the hon. gentleman so unwell at his seat, I begin to think that he is doing a little too much in that direction, and that if he did a little less the country would not suffer for it. The hon. gentleman says that even today we brought down certain papers. Well, that shows how far we are disposed to go and how ready we were to bring these papers down. From-\nthe beginning of the Session every day, every second or third day, we have brought down voluminous papers, large numbers of papers in accordance with the instructions of the House and others have been laid on the Table of the House without being asked for by the House. Our disposition has always been to bring down papers in accordance with the direction of the House. We have brought all the papers we thought we could bring consistently with our duty towards the country and saving the interests of the country; and the House may be assured that any further papers that the House may order or may require shall be brought down if they are of the same kind—if we can bring them down with safety to the country. But we cannot, and I have no doubt, hon. gentlemen, when they think about it, cannot expect us to bring down papers that the interest of the country requires should not be brought down; but on the contrary will agree that we should not communicate them to the House or the country. We are here as custodians of these papers; we have been put here as the executive of the country for the purpose of guarding its interests; and if on our responsibility as Ministers of the Crown we think any of the papers asked by the House are such as we should keep, we must take that responsibility, and I have no doubt the House will sustain us in that course. I repeat that all the papers we could bring down, consistently with the interests of the country, have been brought down, and our intention is to continue in the same course.\n\nMr. BLAKE. If it is possible to be surprised, I am surprised at the line the hon. gentleman has taken. He has now made the declaration that the Government have brought down all the papers connected with this matter, which, consistently with the public interest, they could bring down—that there are no papers not before us except such as are retained in view of the public interests—\n\nSir HECTOR LANGEVIN. I did not say that.\n\nMr. BLAKE.—secret interests, which we cannot learn. The hon. gentleman has said, that they have brought down the papers which have been moved for. You have heard him speak of the diligence with which they have brought them down. It was but this afternoon that they brought down papers which were ordered three years ago; that is the diligence the hon. gentleman boasts of. In April, 1886, they bring down the papers setting forth the grievances complained of by the settlers in the year 1883, for which an order of this House was made in the spring of 1883; and the hon. gentleman says: \"See how diligent we have been; and I ask that confidence should be reposed in us by the House and the country that we will promptly bring down what papers ought to be brought down.\" Now, after the hon. gentleman's statement, I am only going to refer some of the papers which I declare and believe to exist, as to many of them, from information furnished in papers already brought down, as to others from the public journals and other sources, and as to others from statements made by hon. gentlemen opposite; and I will show you that the ground the hon. gentleman takes is entirely inconsistent with and contradictory of the statement of the leader of the Government made last Session on this subject. If that ground was to have been taken, we ought to have known it last Session; we ought to have known it at the beginning of this Session. But tonight we hear the Government declare that it has discharged the duty which the First Minister acknowledged last Session repeatedly was incumbent upon them—not to wait for an address or an order of the House under circumstances of this kind, because we had not the particulars; we cannot be expected to have the particulars; we are outside; hon. gentlemen are inside; the secrets of the prison house are with them; it is they who know the papers and the correspondence and the documents are which were to be brought forward; and the First Minister, in recognition of the obligation of the Government, two or three times last Session brought down large numbers of papers which were not moved for or ordered, because he felt and admitted that it was his duty to bring down those papers spontaneously. So this Session I asked him: \"Am I not to understand that the Government are going to bring down papers spontaneously?\" \"Yes,\" he said. \"When?\" I asked. He said: \"They are in course of preparation.\" The duty was acknowledged last Session and this Session; but under the pretence of the public interest, documents, material to a judgment, are retained. Now, I repeat, as applicable to the condition of things, the statement I read at the opening of this Session made by a former colleague of hon. gentlemen who knew their methods of transacting business:\n\n\"I knew that you and the majority of your colleagues would not hesitate to garble or suppress important State papers, even when demanded by Parliament, if their production was likely to expose or embarrass the Government.\"\n\nIt is time, Sir, that this farce of treating the public interest and the interest of hon. gentlemen opposite as synonymous, of treating the defence of an incriminated Government as a public interest, should cease, or if it is not to cease, that it should be exposed; and I declare that I am informed and believe that there are, and that it can be proved that there are, under the control of this Government, material documents affecting the question of their neglect, delay and mismanagement of North-West matters prior to the late rebellion. That is my statement on this subject, and if this House will give us the opportunity of proving that, we shall be prepared to establish it. Sir, it has already been established by the discussions which have taken place and by the papers which have thus far been brought down, in the first place, and in the general, that there were a large number of papers brought down which were on the face of them imperfect, in that they did not disclose the answers of the Government to the demands made on them in correspondence and in petitions to them. I do not detail these demands; I state this to be the case—that there are numerous letters which appear to have been received, the receipt of which is admitted, but in respect of which there is nothing to show the action of the Government. I am to assume, I suppose, that there was no action taken, there being no further papers brought down. Now, I will go through a list, which I have hurriedly made, of some of these documents, the existence of which appear to have been established. The letter of Bishop Grandin to the Governor General in September, 1873; the reply to that letter sent to the Lieutenant Governor; the despatch to the Lieutenant Governor with that reply; the despatch to the Lieutenant Governor of the 2nd of April, 1884; a report of Colonel Dennis enclosed in the Lieutenant Governor's despatch; further despatches of Lieutenant Governor Morris, 50 N, 154 N, and 159 N; the instructions as to surveys, and correspondence about surveys, and reports of surveyors as to those districts relating to which questions have arisen—Prince Albert, St. Laurent, Carlton, Duck Lake, the scenes of the troubles, Edmonton, Battleford, St. Albert, and Qu'Appelle, orders approving of the surveys, and letters despatching surveys to land offices, &c., from 1875 down to 1886. There are the orders and regulations and correspondence as to the river lots and the system of surveys on rivers. There is Russell's report on the surveys and settlements of Prince Albert and neighborhood, about 1877 or 1878. There are the special reports of Aldous on surveys of 1878 and 1879. There are Russell's instructions for his visit to the district in 1878 or thereabouts, and report thereon. There is the petition of settlers east of the main settlement of Prince Albert, put into the Surveyor General's hands before 14th January, 1879; and the action taken thereon. There is Duck's report on the half-breed claims in Battleford of 1879. There are Ryan's and the other reports on the unenumerated half-\nbreed claims, the action on these reports and the correspondence. There is the information on Pearce's statement of 11th March, 1882, that the settlers on the south branch, near St. Laurent, took lands before the survey on river system, and that a resurvey was wanted. There are the reports showing how much land was surveyed when the change of system was adopted. There is Nolin's letter accompanying the petition of the half-breeds, of 11th September, 1882. There is the answer to Sir David Macpherson's letter of 23rd April, 1883. There is very important correspondence referred to in report of Mr. Pearce of 12th March, 1883. There is the copy of the resolutions of Prince Albert, of October, 1883, and of the letter enclosing those to Sir John Macdonald, which I saw in a newspaper, and to which I drew the attention of the Government. There is the petition of the residents of St. Louis de Langevin to the Minister of the Interior, in the fall of 1880. There are several further petitions from the same parties between that date and November, 1883. There are the correspondence and action of Messrs. Royal, Macdougall, Clark, Bishop Grandin, and Father Leduc, on the same subject. There are Mr. Duck's letters on the same subject referred to by him. There is the action of Mr. Walsh on the reference to him of Qu'Appelle half-breeds case of 6th July, 1882. There is the petition brought down by Father Leduc and Mr. Maloney; the papers submitted by them, the answers given and the action ordered and the action taken. There is the report of the President of the Council and the Minister of Interior on the Privy Council's reference to them of the memorandum of the North-West Council dated 9th October, 1883. There are the representations of the North-West Council not brought down, and correspondence with them. All the papers and full reports from all officers as to the Prince Albert Colonisation Company, up to date of rebellion. The petitions or resolutions and correspondence of the St. Catherines settlers, about the 21st January, 1884, which I showed last Session, took place, by a reference to a newspaper. The petition and correspondence of settlers of Red Deer Hill, of January, 1884. The petition and correspondence of settlers of Halero Settlement, South Branch, in January, 1884. The petition and correspondence of settlers at Colleton, of February, 1884. The resolution of the North-West Council, of 21st July, 1884. The telegram to the Government of the Lieutenant-Governor thereupon, and the telegram in reply. The despatch of the Lieutenant-Governor and the reply, and the action taken thereupon. The petitions forwarded to Ottawa, prior to 1880, as mentioned by Mr. Montour at the meeting held by Father André, which was reported in a newspaper. The correspondence with Bishop Grandin referred to in his speech on the 5th February, 1884, which I read last Session. Bishop Grandin said:\n\n\"To the other propositions, I have busied myself already for a long time with, and you will see special interest. I have put upon the Federal Government all possible pressure to obtain justice; I have even obtained promises, which I believe to be official, that they shall have the pain of seeing today forgotten. I have felt the same discontent which you have also felt, and I have not failed to complain upon the subject at high quarters.\"\n\nThe report of Col. Houghton in the summer of 1884, referred to in the Militia report, a part of the facts contained in which were disclosed in the Winnipeg Sun. The letter of Bishop Grandin to the First Minister in the summer of 1884; that letter which I asked about last Session, and the existence of which has since been proved by the letter of Bishop Grandin to Archbishop Taché, which I read, in which the bishop says that learning the archbishop is desirous of getting copies of the letters he wrote to members of the Government, he sends to him copies. The letter of Bishop Grandin to the Minister of Public Works in the summer of 1884. The directions, and action thereon, as shown by Pearce, on 19th September, 1883, as to the inspection of the half-breeds' lands. The letter from Mr. Deville, of 23rd, November 1883, as to rivers and river lots, and the correspondence on that. The petitions of settlers in St. Catherines, presented to Pearce early in 1884. The many letters sent to Ottawa, through Mr. Duck, before 1883; by Father Vegreville, as stated by him on the 19th January, 1884. The letters of which Mr. Duck speaks also in the same correspondence. The promise of a survey in the fall of 1883, made by Father Leduc and Mr. Maloney and shown Father Vegreville. The revocation of river lot order announced in the Saskatchewan Herald on 9th May, 1884, and all action thereon. The various orders and correspondence as to wood rights. The letter of Mr. Jackson to the Minister of Public Works, of 3rd September, 1884, shown in the telegram to the chairman of the Half-breed Commission to exist, and referred to by me as indicating what was required to be done. The report of the Minister of Public Works on his visit, and in pursuance of his pledge to the half-breeds of Qu'Appelle. On that occasion he is reported in Le Manitoba as follows:\n\n\"After mass, Sir Hector Langevin addressed the Metis. They asked that the Government should give them scrip, as it did to those of Manitoba. Sir Hector considered the request reasonable, and promised to submit it to his colleagues.\"\n\nThere were other things stated in my speech on this subject last Session. I pointed out that not merely the Minister of Public Works, but also the Minister of Railways, the Minister of Marine and Fisheries, and the Postmaster General visited the North-West; that then there were the deputies who went there, the Deputy Minister of Interior, the Comptroller of the Mounted Police, and that year or the year before, the Deputy Superintendent of Indian Affairs. I referred also to the Lieutenant-Governor, the Indian agents, the farm instructors, the Crown land agents, the Crown timber agents, the registrars, the Land Board, the inspector of local colonization companies, the inspectors of agencies, the stipendiary magistrates, the Mounted Police, the militia, the school masters, the North-West council; and besides these, as pointed out, there were the non-officials, but men interested in the prosperity of the country, and to whom hon. gentlemen have frequently and properly appealed for advice, assistance and information, the officers of the Hudson Bay Company and the clergy of the country. Then I referred to another class of information which we also required to obtain; the information connected with the appointments to office of those who were taking an active part in the movements of 1884. There was Louis Schmidt, the secretary of the Riel invitation meeting, appointed an assistant land agent; Mr. Dumais was offered the position of Indian instructor; Mr. Isbester's case; and that of Gabriel Damont. I also said that, during that summer, I had reason to believe that amongst the unofficial persons who yet were clothed with great authority and responsibility in this matter, and who communicated with the Government, was Bishop Grandin. I believed, he wrote more than once, saying, in substance, that the half-breeds were greatly dissatisfied; that he and his clergy were losing all influence with them; that they were no longer respected; that they were frequently accused of having no real sympathy with the half-breeds and their grievances; that it was said that, on the contrary, the clergy's sympathy was always sure to be with the Government; adding, that unless a prompt settlement of their just claims was affected, serious troubles were sure to come soon; and pointing out that the half-breeds being the link between the whites and the Indians, it was important that all cause of dissatisfaction should be removed, as if trouble should arise with the half-breeds, it would spread to the Indians, and the consequences would be terrible. I stated that I had reason to believe, also, from other information, that Archbishop Taché himself wrote, that Mr. McDowell wrote, that Father André and others wrote, and\nI could hardly believe otherwise than that Mr. Duck and Mr. Pierce wrote. Then, there was Sheriff Chapleau, who was interviewed in the fall of 1884, and expressed his opinion of the condition of things. There was also Judge Rouleau, who wrote twice to Mr. Dewdney about the dissatisfaction of the half-breeds, urging prompt redress, and Mr. Dewdney answered that he had forwarded his letters and urged prompt settlement. That in the latter part of 1884 Judge Rouleau wrote to the First Minister himself, directly and strongly on the question. I said that after the July sitting of the North-West Council, Judge Rouleau, Mr. Hayter Reed, and Mr. Forget went to Duck Lake. The ostensible mission of the first two was to select the site for a court, and that of Mr. Forget to inspect ferries and schools; but according to my information, their main object was to ascertain the feeling of the half-breeds on the situation, and certainly, if it was not, it ought to have been, after all the warnings the Government had received. A report of this mission was, I believe, made to Lieutenant-Governor Dewdney, and through him to the Government, that there existed considerable dissatisfaction, which might lead to serious consequences, unless promptly remedied, and the views of Bishop Grandin, and probably of Father André and others, were, as I believed, obtained. But none of these papers have been communicated to us. I had also been informed that Mr. Forget has stated that Mr. Dewdney had repeatedly warned the Government, and could clear himself from the heavy load of responsibility which unquestionably devolved upon him if he did not give any warning: Where are these warnings? Then there are the missing Mounted Police reports, some of which are proved to exist, by the statements I have made, and there is the missing report of Col. Houghton; the existence of which I have proved, and then, in the month of October, as I pointed out, Governor Dewdney himself visited St. Albert and various places near that country, perhaps, not in the immediate neighborhood of the disturbed region, but a neighborhood which would give him naturally the opportunity of communication with men of great importance; and I could hardly conceive that after that visit he should not have acquired and communicated much information.\n\nThen there is the report of Lieutenant-Governor Dewdney as to his evil reception by the half-breeds in this very district, which, I believe, is referred to by Bishop Grandin in one of the letters which the Government declines to bring down. There is the report of Lieutenant-Governor Dewdney on his visit to Edmonton and Stobart, in October, 1884. There is the correspondence with the resolutions of the meeting at Moosomin, in December, 1884, which I proved last Session by the authority of the local paper; there is the correspondence as to the memorial under signature in 1884 and 1885, of which a copy was sent down to the Government, it appears, though the original document had not reached them before the rebellion; there is the answer to Mr. Hall's letter to Mr. Deville in February, 1884, the answer of the Chief Inspector of Surveys to the Secretary of the Interior Department, and the letter of the latter to Mr. Pearce, indicated in his letter to Pearce of February, 1884; there is the communication of Lieutenant-Governor Dewdney on which the telegram of the Minister of the Interior of the 4th February, 1885, was sent; there are the orders to Governor Dewdney and others to inform the half-breeds, and the action thereon. There is the report of the Deputy Minister of the Interior of the 9th of May, 1884, on the settlement of the claims of the Manitoba half-breeds. I stated last Session, and it is established that, on the 9th May, 1884, the Deputy Minister of the Interior reported as to the proved claims of the Manitoba half-breeds, and recommended their settlement, but it was only on the 26th April, 1885, that action was taken on that report. There is the report of the same officer of March, 1886, on the same subject. There are the letters of Bishop Grandin referred to in Sir John Macdonald's reply to me on the 16th July, 1885, and the answers thereto. On the 16th July, I asked:\n\n\"Whether the Government received any, and if so, how many communications, and at what dates, from Bishop Grandin, relating to North-West affairs, and not brought down?\"\n\nSir John Macdonald said:\n\n\"There is no correspondence of record in the Department of the Interior from Bishop Grandin since that which he addressed to Mr. Laird, in 1878, already laid on the Table of the House, except a communication of the 30th March, 1882, in which he asks for assistance in the construction of a hospital, a subsidy for a hospital, and help for the orphanages, and one (not dated) received on the 30th September, 1882.\"\n\nThen he added:\n\n\"I may as well say there are a great many letters, I dare say, addressed to individual members of the Government, which are not considered official.\"\n\nMr. WHITE (Cardwell). Hear, hear.\n\nMr. BLAKE—\n\n\"But they will be collated as fast as they can be\"—Cheered too soon; quite too soon; better wait till the full stop comes before cheering—\n\n\"But they will be collated as fast as they can be, and laid on the Table of the House at the beginning of next Session.\"\n\nThe House has begun. The House has gone on. The collation, I presume, has taken place. But the collation, when it took place, was not to the taste of the hon. gentlemen before whom it was set, and they determined that they would not set it before us, as they did not like the taste of it themselves. So there were a great many letters addressed to individual members of the Government, which were to be collated as fast as possible and laid on the Table of the House at the beginning of this Session, not one of which has been brought forward. What is the meaning of a pledge made by the First Minister of the country to Parliament assembled, and violated in this fashion? What reason is there for it? What excuse is there for it? It is a sacred pledge which is thus violated. The hon. gentleman says it is not in the interest of the country to produce these letters. He dare not produce Bishop Grandin's letter to the First Minister—the public interest would forbid it, because it would prove that he had neglected his duty. He dare not produce Bishop Grandin's letter to himself or Mr. Jackson's letter. The public interests, forsooth, forbid it; it would damage the country, because it would damage the hon. gentleman's hold upon the country.\n\nMr. WHITE (Hastings). It will not benefit yours very much.\n\nSome hon. MEMBERS. Order.\n\nMr. BLAKE. We must give every excuse to the prisoner on trial. Then I asked, on the same 6th July last:\n\n\"Whether the Government addressed any, and if so, how many communications, and at what date, to Bishop Grandin, relating to North-West affairs, and not brought down?\"\n\nSir John Macdonald says that, in reply to his letter of 1882, the Bishop was informed that instructions had been given for the survey of lands in the settlement; but we did not get the letter, though Sir John Macdonald states that it is in existence and states, in some part, its purport. Then there are the letters referred to, in answer to my question, by the hon. Acting Minister of the Interior, the present Minister of Finance, I asked:\n\n\"Whether the Government received any, and if so, how many communications from inhabitants of St. Albert, Edmonton or Fort Saskatchewan, through Father Leduc and Mr. Maloney, in the winter of 1883, not brought down—whether the Government received any, and if so, how many communications from Father Leduc and Mr. Maloney, or either of them, on the same subjects, not brought down?\"\n\nThe Minister gives an account of these letters and papers, which are intimately connected—though they concerned directly the district of St. Albert and that neighborhood—\nwith the general management and conduct of the Government in North-West affairs, and also had indirectly to do with the management of the business as to the river lots and surveys in the other districts. They are not brought down, although their existence is admitted. Then I asked:\n\n\"Whether any answers were given, not brought down, to any, and if so, to which of the letters or memorials on the subject of North-West grievances, which have been brought down? and at what date were such answers given?\"\n\nThe hon. Minister answered:\n\n\"The answer to that question has not been prepared. Many of these questions involve a search in the whole Department for letters and papers, and they involve a great deal of time.\"\n\nSo that there is no allegation that there are no answers, though, mark you, this was a search in their own letter books, because what I was asking was what answers are there in your own books to papers you have received. The Department had not had time to find the answers which were given by the Government to papers which they had brought down to Parliament, so as to answer my question in July last. They have not since had the time—yes, they have had the time, but they find the public interests require that they should not bring down the answers. Then there is the reply of Mr. Deville to Father Vegreville of the 15th February, 1884, mentioned by the acting Minister of Interior on the 16th July, 1885, as existing; the details of the action on the petition of the 19th November, 1883, from St. Louis de Langelin; the answer of Mr. Burgess of the 6th May, 1885, to Mr. Schmidt, which the acting Minister of Interior stated had been sent on that day; the dates and correspondence connected with the transmission of the plans of the neighborhood of St. Laurent; the communications of Lieutenant-Governor Dewdney referred to by the First Minister on the 16th July, 1885. I then asked:\n\n\"Did the Government call on Governor Dewdney for any information as to the state of things with reference to the half-breeds in the Saskatchewan region, during January or in February or early March, 1885, and if so, when? Did the Government receive any communication from Governor Dewdney on the subject; and if so, when?\"\n\nThe First Minister said:\n\n\"I do not know that there have been any special calls on Governor Dewdney on behalf of the Government for information. It is Governor Dewdney's duty to give full information on everything affecting affairs in his jurisdiction, and he has been in continual communication with the Government, or individual members of the Government, on this subject.\"\n\nNow, one of the charges against the Government is, that they were warned and did not act. We know that Governor Dewdney, who ought to have had the information, has been in \"continual communication\" with them, but the public interest prevents these communications from being brought down! Then the papers referred to by the First Minister, in reply to my question on the same day:\n\n\"Did the Government call on any of the officials in the North-West, and if so, on which, and when during 1884 or 1885, or information as to the state of things with reference to the half-breeds in the Saskatchewan region? Did the Government receive any communication from any of the officials in the North-West during 1884 or 1885 as to the state of things with reference to the half-breeds in the Saskatchewan region and if so from whom and when?\"\n\n\"Sir JOHN A. MACDONALD. The Government and several of the Departments have been in active correspondence with the various officials in the North-West as to the state of affairs with reference to the half-breeds in the Saskatchewan regions, and other matters affecting the North-West. Some of these communications are in the Department, and some are not. They will be brought down.\"\n\nBut they are not brought down, and now we are told that the public interest prevents their being brought down, so that materials for a judgment are denied to us. Then Sir, the answer of the First Minister to Father André's letter of the 16th January, 1883; I asked was any answer sent, and he replied:\n\n\"I am not quite prepared to answer that question, neither as to the receipt of the letter nor as to the answer.\"\n\nHe did not know even that the letter had been sent, and I pointed out to him that he had brought the letter down and read it. He said that was all right, but as to the answer he was not prepared to say, and the public interest, I suppose, prevents the answer from being brought down. So with reference to the answer to his letter to Father Vegreville of about the same time. Then the report of Major Crozier mentioned in that of the 27th July, 1884, unless brought down, and I am not certain whether that is amongst the papers brought down, because it is not identified, but if it be not amongst them, that also ought to be brought down. Then the communications from various persons mentioned in reply to me on the same day by the Government. I asked:\n\n\"Had the Government received, before the outbreak, any communication as to the half-breed matter containing the views of Mr. Forget, Mr. Foster, Bishop Bourneau, Father André, Mr. L. Clarke, Mr. McDowell, Bishop McLean, or any other prominent citizen of the North-West Territory.\"\n\nSir JOHN A. MACDONALD. Very probably communications have been received from some, if not all, of those gentlemen. Those received will be brought down.\"\n\nBut they are not brought down, and now we are told the public interest prevents their being brought down. Then there are other communications to the Minister of Public Works mentioned on the same day in his reply to me, in which he acknowledged the receipt of a communication from Mr. Jackson. Then there are required papers showing the facts asserted by the First Minister on the 26th March, 1885, in this House, relating to, 1, the plan of survey; 2, the information conveyed to the half-breeds that they would keep or get their lands according to their custom; 3, the frauds alleged to be attempted by the Metis; 4, the claims which had been settled at that date; 5, the small residue, about 50, which alone remained unsettled, for which this commission was appointed; 6, the attempts to get a sick gentleman to accept the commission and his name; 7, the action between January and March as to the commission; 8, the course taken by the Government to assure the people from door to door that their rights would be respected, that not an acre would be taken from them; and that their possession was as good as a deed; 9, the reports on the \"litigated claims\" between half-breed and half-breed. These are some of those papers which were called for last Session, their obligation to bring down the most important of which was admitted by the Government last Session, their intention to bring down which was stated last Session, their promise and pledge, to bring down which, at the opening of this Session, were given last Session, and now in the sixth week of the Session, we are told the duty has been fully performed, and that we are to have no more papers.\n\nPrinted by MacLean, Roger & Co., Parliamentary Printers, Wellington Street, Ottawa.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001346.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9960, "total-output-tokens": 10020, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5757, 1], [5757, 13641, 2], [13641, 21697, 3], [21697, 29874, 4], [29874, 37787, 5], [37787, 44959, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]