[{"id": "e6123af2843ea6fed4637ce7f0467f3ffaebd90f", "text": "FORT QU'APPELLE\n\nBoating, Fishing, &c., Shooting Club.\n\nRules.\n\nNAME.\n\n1.—This Club shall be called \"Fort Qu'Appelle Boating, Fishing and Shooting Club.\"\n\nCOLORS.\n\n2.—The colors of the Club shall be Dark Blue and White, and the Flag a white Maltese cross on blue ground.\n\nOFFICERS.\n\n3.—The officers of the Club shall consist of a President, two Vice-Presidents, Commodore, Vice-Commodore, Secretary-Treasurer, and a Committee of five members. Officers to be de facto members of committees.\n4.—The officers and committee shall be elected annually by ballot from among the members of the Club, at the annual general meeting.\n\n5.—In the event of any vacancy occurring in the committee after the annual general meeting, the committee shall have the power of filling it up.\n\n6.—Should any member of the committee be absent from three consecutive meetings of that body, without a satisfactory excuse to the other members, he shall cease to hold office, and his place be filled pursuant to Rule No. 5.\n\n7.—The members of the Club shall be divided into four classes, viz.: Patrons, Active Life, Honorary Life, Active, and Honorary. Active and Active Life members only, shall take part by voting or otherwise in the management of the affairs of the Club.\n\nCANDIDATES FOR MEMBERSHIP.\n\n8.—Each candidate for admission as a member shall be proposed by one member, and seconded by another; (such proposer and seconder not being honorary members,) by a proposal in writing, stating the candidate's usual residence, rank, profession, or other description, and signed by both proposer and seconder, which nomination shall be posted in the Club room or the Secretary's office (should the Club house be closed) for at least one week. After the expiration of such week the committee shall proceed to elect such candidate unless the Secretary shall have been notified by any member of the Club of his desire that a ballot should be taken, in which\ncase the election shall be by ballot, as provided for in Rule 12. The first subscription of such candidate to be handed to the Treasurer before election:\n\n9.—The subscription shall be $25 for Active Life members, $20 for Honorary Life members. The annual subscription for Active members shall be $5 and a liability to a further call of $5, and for Honorary members $3.\n\n10.—The subscription of any Active member elected after the first day of August shall be $2 for that year and a liability to a further call of $2. All subscriptions payable in advance.\n\n11.—Any member failing to pay his annual subscription within one month after the same becomes due, shall on and after the first day of June, have his name posted in the Club room as a defaulter; and if the subscription be not paid within one month from the date of such posting, he shall cease to be a member, and his name shall be erased from the books of the Club, unless the non-payment be explained to the satisfaction of the Committee; but he shall not thereby be released from any liability to the Club. Should such person wish at any time to again become a member of the Club, he must first pay all arrears, and then be elected in the usual manner.\n\nTHE BALLOT.\n\n12.—The ballot shall take place between the hours of 12 and 6 p.m. on the first Saturday after a clear week's notice has been posted that a ballot has been demanded. Each member voting shall write\nhis name on a card to be provided for that purpose, which shall be placed by each member in a box; and the Secretary and one member of the Committee or, in the absence of the Secretary, two members of the Committee, shall open the ballot and declare the result. One black ball in every three shall exclude, and no ballot shall be valid unless at least twelve votes be cast.\n\nRULES.\n\n13.—Every person elected as a member shall, by the fact of such election, be held to have notice of and acquiesce in all Club rules.\n\n14.—On the election of each member, the Secretary shall notify him of the same, furnishing him with a copy of the Rules of the Club.\n\nPRIVILEGED MEMBERS.\n\n15.—All members of regularly organized amateur rowing clubs in Great Britain, Canada, and the United States, not resident in Qu'Appelle, shall be admissible as privileged members during a period not exceeding one week, on being introduced by a member.\n\nVISITING MEMBERS.\n\n16.—Any member may introduce a friend resident at a distance of not less than twenty miles from Qu'Appelle, for a period not exceeding one week, provided the name of such person, with his proposer, be submitted to, and approved of, by two members of the Executive Committee. Such approval to be posted in the Club room.\n17.—A general meeting of the Club shall be held at the Club rooms, or such other place as shall be selected by the Committee, on the last Friday in March, and the first Friday in May, June, July, August, September, and October of each year, at 8 p.m., or at such other time as shall be mutually agreed upon.\n\n18.—No meeting of the Club shall be competent to transact business unless a quorum be present, such quorum to consist of not less than nine members. A quorum of the Committee shall consist of not less than four members.\n\n19.—A special meeting of the Club shall be called if any five members acquaint the Secretary, in writing, of such their desire, and the object thereof. The Secretary shall thereupon give notice of the same, with the object thereof, to the members of the Club.\n\n20.—A special meeting of the Committee may be called at any time by the Secretary, of which due notice in writing, with the object thereof must be given to each member thereof.\n\nSUSPENSION OF MEMBERS.\n\n21.—The Committee shall have the power to suspend any member who may, in their opinion, be guilty of ungentlemanly conduct, or who may have transgressed the rules, until the next general meeting of the Club in whom alone the power to expel shall be vested. A vote of two-thirds of the present members shall be required to expel.\n22.—The Secretary shall keep correct minutes of the proceedings of the Club at each meeting, which shall be read by the Secretary at the ensuing meeting, and signed by the chairman.\n\nFunds.\n\n23.—The Committee shall have full control of the Club funds. All disbursements to be made by the Treasurer after being certified by the President or Vice-President.\n\nAuditors.\n\n24.—Two Auditors shall be appointed by the Club at the last general meeting in each year, to examine the accounts for the current Club year, and report thereon to the Club at the following annual meeting.\n\nManagement of Boats.\n\n25.—All boats belonging to the Club shall be under the control and management of the Commodore or Vice-Commodore. All members shall be limited to two hours for use of any Club boat unless a special order of the Commodore be obtained.\n\nClub Races.\n\n26.—The Commodore or Vice-Commodore shall have control and management of all Club races.\n\nExpenses of Representative Crews.\n\n27.—In the event of any member or members of the Club being chosen to represent the Club as competitors at any regatta meeting, all expenses to\nand fro. and legitimate expenses while necessarily absent shall be paid out of the Club funds. Such payments to be determined upon and approved of by the Committee.\n\n**STORAGE OF MEMBERS' BOATS.**\n\n28.—Life and Active members shall have the privilege of keeping their private boats in the Club house. All places suitable for the storage of such boats shall be numbered and be put up to auction at an upset price, to be fixed by the Committee; every year at the regular general meeting of the Club held in May, and allotted to the highest bidder. The price for which the same may be sold shall be forthwith paid, and if not paid within one week thereafter the Committee shall dispose of the same to any member of the Club who may apply therefor. Members will be allowed to store racing shells free of charge. The storage of such boats to be under control of the Committee.\n\n**LOCKERS.**\n\n29.—Life and Active members shall be entitled to the use of lockers provided by the Club on the payment of one dollar each per annum therefor, but no member shall be entitled to possession without permission from the Treasurer. Members holding lockers shall be entitled to first choice therefor the succeeding year.\n\n**COMPLAINTS.**\n\n30.—Any cause of complaint that may arise is to be written and signed by the member so complaining in the Complaint Book provided for that\npurpose; or by letter to the Secretary, which complaint must be specially noticed by the Committee at their next meeting.\n\nALTERATION IN RULES.\n\n31.—No alteration shall be made in the Constitution unless at a general meeting of the Club, and notice of such proposed alteration shall be posted in the Club room for at least two weeks previous to such meeting; but the Committee shall have power to make regulations and by-laws having the force of rules, and to suspend any rule that may be found to work badly, and the same shall be confirmed or annulled at the next general meeting of the Club. Notice of any rule so made by the Committee must be posted in the Club room over the signature of the Secretary.\n\n32.—These Rules shall be printed, and a copy of the same sent to every member of the Club.\nFORT GOUFELLE\nBoating, Fishing, and Shooting Club\n\nOFFICERS OF THE CLUB:\n\nPRESIDENT:\nE. WILLARD HOPKINS\n\nVICE-PRESIDENT:\nW. B. SIMPSON\n\nSECRETARY-TREASURER:\nR. O. THOMPSON\n\nCOMMODORE:\nC. P. BLANCHET\n\nVICE-COMMODORE:\nROBERT D. NORDEN\n\nCHANGING BOAT OFFICER:\nJ. L. JARVIS\n\nJ. CALVIN", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001726.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 18632, "total-output-tokens": 2510, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 490, 3], [490, 1928, 4], [1928, 3351, 5], [3351, 4615, 6], [4615, 5937, 7], [5937, 7050, 8], [7050, 8410, 9], [8410, 9210, 10], [9210, 9210, 11], [9210, 9490, 12]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false]}}]