[{"id": "1db6190894819c5dc8a0e721caee474aa52280e3", "text": "## STATEMENT\n\n(80d)\n\nOf Militia Pensions awarded by Orders in Council, consequent upon the Rebellion of 1885, North-West Territories.\n\n| Date of O. in C. | Rank. | Name. | Corps. | Pension. |\n|-----------------|-------|-------|--------|----------|\n| Nov. 19 1885    |       | Mary F. French, widow of Capt. French. | French's Scouts. | $514 65 |\n|                 |       | 4 children—girl, 11; boys, 9, 7 and 1. |        | $411 72 ea. 102.33 |\n| Dec. 3          |       | Catharine Cook, widow of Gunner W. Cook. | \"A\" Battery. | $73 00 |\n| do              |       | 1 daughter 4 years old. |        | $14 60 |\n| do              |       | Marie Lebel Demanally, widow of Gunner H. Demanally. | \"A\" Battery. | $73 00 |\n| do              |       | Catharine Armworth, widow of Gunner C. Armworth. |        | $73 00 |\n| do              |       | Hannah Dobbs, widow of Private H. Dobbs. | Battleford Rifles. | $91 25 |\n| do              |       | 3 children—girl, 11; boys, 9 and 3. |        | $54 75 ea. 18.25 |\n| do              | Captain | Wm. Clark. | 90th Batt. | $400 00 |\n| do              | Staff Sergeant | W. Mawhinney. | \"A\" Battery. | $328 50 |\n| do              | Gunner | E. A. Asselin. | do | $200 75 |\n| do              | Trumpeter | W. J. Wilson. | do | $200 75 |\n| do              | Corporal | W. A. Kemp. | 90th Batt. | $164 25 |\n| do              | Private | C. H. Kemp. | do | $109 50 |\n| do              | do | D. Hislop. | do | $109 50 |\n| do              | do | W. W. Mathews. | do | $109 50 |\n| do              | do | H. B. Perrin. | Boulton's Scouts. | $109 50 |\n| do              | do | A. L. Young. | 90th Batt. | $83 25 |\n| do              | do | W. H. Canniff. | do | $200 00 |\n| do              | Gunner | Albert Mulvey. | \"A\" Battery. | $219 00 |\n| do              | Bugler | Michael Gaughan. | 10th Batt. | $58 40 |\n| do              | Private | James Eager. | do | $182 50 |\n| do              | do | James Oane. | do | $200 75 |\n| do              | do | Robert Henry Dunn. | \"O\" Co., I.S.C. | $200 75 |\n| do              | do | Henry Jones. | do | $109 50 |\n| do              | do | Richard Jones. | do | $182 50 |\n| do              | Lieutenant | A. E. Doucet, A.D.C. | 10th Batt. | $280 00 |\n| do              | Private | Alexander S. Martin. | do | $250 00 |\n| do              | do | Simcoe Mackintosh Daly. | Midland Batt. | $182 50 |\n| do              | do | Samuel Gray. | 10th Batt. | $146 00 |\n| Jan. 8 1886    |       | Thomas Agnew. | 2nd do | $91 25 |\n| do              | Color Sergeant | Francis Francis. | 10th do | $109 50 |\n| do              | Private | Alexander P. Graham. | 2nd do | $91 25 |\n| do              | Trooper | Valentine Bruce. | Boulton's M. I. | $200 75 |\n| do              | Gunner | Samuel Parkhill. | \"A\" Battery. | $109 50 |\n| do              | Sergeant | Edward Walling. | do | $328 50 |\n| do              | do | Catharine Hutchison, widow of Private James Hutchison. | 90th Batt. | $91 25 |\n| do              | do | 1 daughter 11 years old. |        | $18 2 |\n| do              | Private | Samuel Bell. | Midland Batt. | $219 00 |\n\n80d—1\n## Statement of Militia Pensions—Continued.\n\n| Date of O. in C. | Rank          | Name                        | Corps                  | Pension Rate per diem | Remarks |\n|-----------------|---------------|-----------------------------|------------------------|-----------------------|---------|\n|                 |               |                             |                        | $ cts.                |         |\n|                 |               |                             |                        | Rate per annum        |         |\n| 1886            | Captain       | Samuel F. Peters            | 7th Batt.              |                       |         |\n| Jan. 26         | Lieutenant    | John E. Halliwell           | Midland Batt.          |                       |         |\n| do              | Sergeant      | John W. McLintock           | 7th do                 | 0 80                  |         |\n| do              | Gunner        | Thos. J. Stout              | \"A\" Battery            | 0 60                  |         |\n| do              | Private       | John Davidson               | 7th Batt.              | 0 60                  |         |\n| do              |               | Jeremiah Osgoode, father of Private Wm. Osgoode | Ottawa S S | 91 25                |         |\n| do              | Private       | George Phillips             | 10th Batt.             | 0 15                  |         |\n| do              |               | Mrs. Hannah Harvey, grandmother of Pte. Wm. Ennis | 90th do | 0 25                |         |\n| Feb. 6          | Act'g. Bombard| Douglas H. Taylor           | \"A\" Battery            | 0 23                  |         |\n| do              | Private       | Joseph McIlveen             | 10th Batt.             | 0 20                  |         |\n| do              |               | Miss Ella D. Osgoode, sister of Private Wm. Osgoode | Ottawa S S | 45 62                |         |\n| do              |               | Mrs. Elizabeth Lydia Brown, mother of Capt. Brown | B. M. I. | 0 71                |         |\n| do              |               | Mrs. Marois, widow of Private Th'ophile Marois | 9th Batt. | 68 44                |         |\n| do              |               | Her five children           |                        | 70 19                 |         |\n| do              | Gunner        | James Harrison              | \"A\" Battery            | 0 30                  |         |\n| do              | Private       | James Henderson             | Midland Batt.          | 0 55                  |         |\n| do              |               | Chas. F. Guy                | do                     | 0 25                  |         |\n| do              | Sergeant      | James F. Gaffney            | \"B\" Battery            | 0 90                  |         |\n| do              |               | James Young                 | H. P. B.               | 0 60                  |         |\n| do              | Driver        | Gandias Houde               | \"B\" Battery            | 0 55                  |         |\n| do              | Act'g. Bombard| Thos. Reynolds              | do                     | 0 55                  |         |\n| do              | Gunner        | Victor Clérout              | do                     | 0 55                  |         |\n| do              |               | Walter Y. Woodman           | \"A\" Battery            | 0 50                  |         |\n| do              |               | Pierre Langlois             | do                     | 0 50                  |         |\n| do              | Corporal      | Alex. Boucher               | 9th Batt.              | 0 23                  |         |\n| do              | Qr. Mr. Sergt.| Mathew Donnelly             | 14th do                | 0 20                  |         |\n| do              | Bugler        | Edward Gilbert              | Battleford Rifles      | 0 30                  |         |\n| Mar. 27         |               | Ruby Jane Muligh, widow of Private W. H. Muligh | H. P. Batt. | 9 25                |         |\n| do              |               | Her infant child            |                        | 0 05                  |         |\n| do              |               | Margaret McDonald, widow of Private Frederick Marwick | H. P. Batt. | 0 183                |         |\n| do              | Corporal      | John Edward Lethbridge      | 90th do                | 0 90                  |         |\n| do              | Gunner        | Eugène Moisan               | \"A\" Battery            | 0 50                  |         |\n| do              | Private       | Jacques Zachariah           | \"O\" Co., L.S.O.        | 0 30                  |         |\n| do              |               | Jean-Baptiste Fortin        | 9th Batt.              | 0 55                  |         |\n| April 5         | Transport clerk | John Viven                  | Str. Northcote         | 0 45                  |         |\n\nTotal Pensions awarded up to 30th April, 1886: $13,517 06\nCOPY\n\n(80e)\n\nOf a Report of the Honorable the Privy Council, approved by His Excellency the Governor General in Council on the 8th July, 1885, respecting Regulations as to Pensions and Gratuities, Rebellion, North-West Territories.\n\nCopy of a Report of a Committee of the Honorable the Privy Council, approved by His Excellency the Governor General in Council on the 8th July, 1885.\n\nOn a memorandum, dated 30th June, 1885, from the Minister of Militia and Defence, submitting for Your Excellency's approval the annexed regulations relating to gratuities and pensions to be granted under the provisions of section 68 of the Consolidated Militia Act of 1883, to officers and men of the Active Militia, who have been or may be killed or wounded in actual service after the 26th day of March, 1885, or who have died since that date, or may die hereafter from illness or injuries contracted in actual service.\n\nThe Minister observes that the proposed rates of pension to officers and soldiers for wounds or injuries received in action, and the regulations under which they are to be issued are the same as granted by order of the Governor General in Council, dated 21st of August, 1866, to officers and soldiers wounded or injured during the invasion of Canada by Fenians in 1866 and following years.\n\nThe Minister represents that the rates of pensions and gratuities proposed to be granted to widows, children and relatives of officers and soldiers killed in action, or who have died or may hereafter die from wounds received in action, or from illness or injuries contracted on actual service, are based as far as practicable upon Imperial Army Regulations, but as on that army pensions are not granted to the widows and families of deceased soldiers, the Minister considers that a change should be made for the reason that the conditions of service of Canada bring to the ranks of the active militia a class of the community whose claims are in his opinion as deserving of consideration as those of the officers. He has, therefore, adopted as far as practicable the rates allowed on the Imperial Regular service to the widows and families of deceased officers, and made similar provisions for the widows and families of deceased soldiers, based as in the case of officers on the respective ranks of those on whose account the pensions and gratuities are to be issued.\n\nThe Minister further represents that the distinction made in the Imperial Regulations has been followed in granting a higher rate of pension to those killed in action or who die from wounds received in action than to those who die from injuries or illness contracted on actual service. In both cases the rates fixed for lieutenants, colonels, majors and captains closely approximate those adopted in the Imperial Army but are less for Lieutenants owing to the Imperial rate for that rank being in excess of the actual difference in pay. Also there are two rates of pay for lieutenants in the active militia, the one in the permanent corps being higher than the other, and he, therefore, recommends in order to bring the rate of pension in that rank nearer to that in the Imperial army, that the minimum rate of pay for pension on account of deceased lieutenants, in all corps of the active militia be counted at $2.44 per diem, which is the rate paid to lieutenants on appointment on the permanent corps of the Dominion. The Committee advise the adoption of the annexed regulations and they submit the same for Your Excellency's approval.\n\nJOHN J. McGEES Clerk Privy Council.\n\nVide Militia General Order No. 14, of the 9th July, 1885, attached, showing rates of pensions, etc.\n\n80z—1½\nExtract from \"The Canada Gazette\" of Saturday, 11th July, 1885.\n\nMILITIA GENERAL ORDERS.\n\nHEAD QUARTERS, OTTAWA, 9th July, 1885.\n\nGENERAL ORDERS (14).\n\nNo. 1.\n\nThe Regulations and Orders for the Militia, 1883, having been amended by order of His Excellency the Governor General in Council, dated 8th July, 1885, by adding 17 paragraphs under the heading of \"Gratuities and Pensions,\" the Regulations under the heading \"Casualties\" so amended are now published for general information:\n\nCASUALTIES.\n\nCasualties—Actual Service.\n\n995. When any officer or man is killed in actual service, or dies from wounds or disease contracted on actual service, provision shall be made for his wife and family out of the public funds.\n\n996. And all cases of permanent disability, arising from injuries received or illness contracted on actual service shall be reported on by a Medical Board, and compensation awarded, under such regulations as may be made from time to time by the Governor in Council; and any medical practitioner who shall sign a false certificate in any such case, shall incur a penalty of four hundred dollars. 46 Vic., chap. 11, sec. 68.\n\nInjury or Illness—Actual Service.\n\n997. If any officer of the Militia shall receive injury or contract illness on actual service, which, although of a temporary nature, shall necessitate his discharge from such service, he shall be conveyed to his home at the public expense, and shall receive a sum equal to the daily pay and allowance of his rank, for the period during which, according to the certificate of two qualified medical practitioners, he shall have been actually and necessarily incapacitated from following his usual occupation. And no allowance for medical attendance shall in any such case be made. Par. 149, R. & O., 1870.\n\n998. If any militiaman shall receive injury or contract illness on actual service, which, although of a temporary nature, shall necessitate his discharge from such service, he shall be placed either in a military or civil hospital, and on his discharge from hospital he shall be conveyed to his home at the public expense; and he shall receive compensation for loss of time at the rate of one dollar a day, for the period during which he has been detained in hospital. But in case he should elect to be sent to his own home in place of the hospital, he shall receive compensation for loss of time at the rate of one dollar a day, for the period during which, according to the certificate of two qualified medical practitioners, he shall have been actually and necessarily incapacitated from following his ordinary occupation; and no allowance for medical attendance shall in any such case be given. Par. 150, R. & O., 1870.\n\nGRATUITIES AND PENSIONS.\n\nThe following rates of compensation by gratuity and pension will be allowed under the provisions of sec. 68, chap. 11 of 46 Victoria.—The Consolidated Militia Act, 1883, to militiamen wounded or disabled, or who may be hereafter wounded or disabled in actual service, and to the widows and children of those who have been killed in battle or have died from injuries or illness contracted on actual service. O. C. July, 1885.\nWOUNDS AND INJURIES RECEIVED IN ACTION.\n\n1. An officer who shall be certified to have received a wound in action which shall have occasioned the loss of an eye, or a limb, or the use of a limb; or to have received bodily injury equivalent to the loss of a limb, shall in the first instance, receive a gratuity in money of one year's full pay of the appointment held by him at the time of his wound.\n\n2. From the expiration of one year, from the date of the wound or injury, the wounded officer referred to in the preceding paragraph, may, subject to the conditions of paragraphs 3 to 5, be granted a pension according to the following scale:\n\n| Rank or relative rank of officer | Annual pension |\n|---------------------------------|---------------|\n| Lieutenant-Colonel              | $1,200        |\n| Major                           | 800           |\n| Captain                         | 400           |\n| Lieutenant                      | 280           |\n\n3. No claim to a gratuity or pension shall be entertained unless the officer shall apply for the same within five years after being wounded.\n\n4. A pension shall not be granted for the loss of an eye, consequent upon a wound received in action, unless loss of vision shall have occurred within five years after the wound, and shall be solely attributable to such wound.\n\n5. A pension shall be granted according to Militia rank, or in the case of a departmental officer, relative rank, held by the officer at the time of being wounded.\n\nSOLDIERS' PENSIONS.\n\n6. Pensions may be granted to militiamen discharged as unfit for further service from wound or injuries received in action.\n\n| Rank          | First degree | Second degree | Third degree | Fourth degree |\n|---------------|--------------|---------------|--------------|--------------|\n|               | From         | To            | From         | To           | From         | To           |\n| Sergeant      | 75           | 1.10          | 60           | 90           | 45           | 60           | 30           | 45           |\n| Corporal      | 60           | 90            | 45           | 60           | 30           | 45           | 23           | 30           |\n| Private       | 45           | 60            | 30           | 55           | 23           | 30           | 16           | 23           |\nPENSIONS TO WIDOWS AND CHILDREN OF OFFICERS AND SOLDIERS IF IN REDUCED OR NEEDY CIRCUMSTANCES.\n\nRates of Pension.\n\n7. If the deceased officer or soldier has been killed in action, or has died from wounds received in action, within twelve months of having been wounded:\n\n(a.) To the widow a pension annually equal to one-half the daily pay of the officer or soldier during twelve months, and in addition for the first year a gratuity equal to twelve months' pay.\n\n(b.) To each child, a compassionate allowance annually at the rate of one tenth of the pay of the officer or soldier, and in addition for the first year a gratuity equal to four months' pay.\n\nIf the deceased officer or soldier died from illness which can be directly traced to fatigue, privation or exposure incident to active operations in the field, within six months after his having been finally incapacitated for duty, or if the deceased officer or soldier shall have lost his life in consequence of wounds received in the execution of military duty otherwise than in action,\n\n(a.) To the widow a pension annually equal to three eighths of the daily pay of the officer or soldier during twelve months.\n\n(b.) To each child a compassionate allowance annually at the rate of one-thirteenth of the pay of the officer or soldier.\n\n8. A pension to the widow or other relative of a deceased officer or soldier shall only be granted as a reward of good, faithful and gallant service rendered, and shall not be claimed as a right. It shall not be conferred if the applicant be left in wealthy circumstances, or is already in possession of any pension, provision, or allowance from the public.\n\n9. A widow's pension shall, as a rule, commence the day following that of her husband's death, and shall be discontinued should she subsequently prove unworthy of it, or attain to wealthy circumstances.\n\n10. The pension of a widow who re-marries shall be suspended from the date of her re-marriage; but in the event of her again becoming a widow, her pension may be restored, upon proof that she is not in wealthy circumstances, and is otherwise deserving.\n\nChildren.\n\n11. Compassionate allowances as shown in paragraph 7, may, subject to the conditions which apply to widows' pensions, be granted to the children of deceased officers and soldiers. They shall not be granted to sons over the age of eighteen, nor to daughters over the age of twenty-one except in very special cases in which it shall be shown that the sons or daughters became afflicted during the officer's or soldier's life with some mental or bodily infirmity rendering them dependent upon him, and permanently incapable of making adequate exertion for their support; and that such incapacity dates from a period before the children reached the limit of age, as above laid down, and that they are in distressed circumstances.\n\n12. The allowances granted under paragraph 11, to the sons of officers and soldiers may be continued until they respectively attain the age of eighteen, or are otherwise previously provided for; and those to the daughters may be continued until they respectively marry or attain the age of twenty-one, whichever shall first happen, and no longer; except in very special cases, in which it shall be shown that such children are afflicted with any mental or bodily infirmity rendering them incapable of making adequate exertion for their own support; and that they are in distressed circumstances.\n\n13. In the case of an officer or soldier killed in action or dying from wounds received in action within twelve months after such wounds shall have been received, and not leaving a widow, but a daughter or daughters only, an annual allowance equal to half the rate of widow's pension may, under special circumstances, to be\ndetermined by the Minister of Militia and Defence, be granted, instead of the compassionate allowances referred to in paragraph 11, to such daughter or to such daughters collectively. Such allowance may be continued until the daughter, or the last survivor of them in case there be more than one, may become disqualified by marriage or otherwise.\n\n14. A compassionate allowance shall be paid from the date of the officer's or soldier's death to the 30th June next ensuing; and subsequent payments shall be made yearly in advance from 1st July in each year.\n\nMother.\n\n15. The mother of an officer or soldier killed in action, or dying of wounds received in action within twelve months after such wounds shall have been received, without leaving either widow, or legitimate child, such mother being herself a widow and in distressed circumstances, and having been mainly dependent upon the deceased officer or soldier for support, may be granted an annual allowance, according to the rank of the officer or soldier, and at half the rate of widow's pension; but if she shall be in receipt of a pension as an officer's or soldier's widow, or shall have any other provision of any kind from the public, no allowance shall be made to her on account of her son, unless she relinquish such pension or provision. In the event of her allowance ceasing in consequence of re-marriage or death, it shall not be transferable to her daughters.\n\nSisters.\n\n16. The sister or sisters collectively of an officer or soldier killed in action, or dying of wounds received in action, within twelve months after such wounds shall have been received, without leaving widow, legitimate child, or mother; and provided she or they be an orphan or orphans, without surviving brother, and mainly dependent for support upon the officer or soldier deceased, may, under special circumstances, to be determined by the Minister of Militia and Defence, be granted an allowance equal to half the rate of widow's pension.\n\n17. In instances where the regulations do not meet the circumstances of individual cases, they may be specially considered by His Excellency the Governor General in Council.\n\nThe minimum rate of pay for pension on account of deceased lieutenants in all corps of the Active Militia will be counted at two dollars per diem.\n\nPermanent Disability.\n\n1007. All cases of permanent disability, arising from injuries received or illness contracted by officers or men on actual service, shall be reported on by a medical board, and compensation awarded for the same according to the merits of the case; Par. 152, R. & O.\n\nRegulations for Claims.\n\nThe following regulations apply when claims to pensions, or gratuity on account of death or wounds, of officers or men, or of disability from illness contracted while on actual service, require to be established.\n\n1008. A board of officers composed of one field officer and two captains of the Active Militia, will be assembled at such time and place as may be ordered, and shall take cognizance and report on the various claims presented for its consideration; Par. 374, R. & O., 1870.\n\n1009. Where the claims are on account of disability, the cause, degree and probable duration of the disability must be established by evidence before a medical board; and the report of such board will form part of the evidence required to be produced before the board of officers referred to in the above paragraph. The claims will be divided into three classes.\n1st Class.\n\n(1.) Claims on the part of relatives of militiamen who have been killed in action, or who have died of wounds or injuries received, or of disease contracted on actual service.\n\n(2.) The evidence required to be produced before the board in support of claims of this class, is, in the case of a militiaman killed in action, a certificate from the commanding officer of his corps, stating that he was killed in action or on actual service. (Form marked A, par. 1013.)\n\n(3.) In the case of a militiaman who has died of wounds or injuries received on actual service, a certificate from the medical officer who first saw him after he was wounded or injured, countersigned by the commanding officer, stating the nature of the wound or injury which caused death; also a certificate from the medical attendant at the time of death, stating the cause and date of death, (form B, par. 1014,) the same is to be corroborated by any other material evidence that can be procured.\n\n(4.) In the case of a militiaman who has died of disease contracted on actual service, a certificate from the medical officer who first attended him after he was taken ill, countersigned by the commanding officer, stating the nature of the disease, and that it was contracted on actual service (form B, par. 1014); Also a certificate from the medical attendant at the time of death, stating the cause and date of death. (Form B, par. 1014.)\n\n(5.) In all the foregoing cases, evidence must be produced of the circumstances of the deceased, and the amount of income he was in receipt of at the time of his going on service; and whether his income died with him in whole or in part, stating what part, if any, was independent of his life; also evidence of the number, age, sex and proximity of relatives who were dependent for support on the life of the deceased; also evidence of the amount of medical attendance received by the deceased (supposing him to have died of wounds or disease,) between the time of his discharge from actual service and the date of his death, with the names and residences of the medical attendants who had charge of him during that period. (Form C, par. 1015.)\n\n2nd Class.\n\n(1.) Claims on the part of militiamen who have received wounds or injuries, or have contracted disease on service, which may incapacitate them wholly from following their former trade or profession.\n\n(2.) The evidence required to be produced is as follows:—Report of medical board referred to in first part of this paragraph 1009. (Form D, 1016) Evidence as to the circumstances of claimants:—the amount of income he was in receipt of at the time of his going on service—whether his income depended in whole or in part on his personal exertions; and what portion thereof, if any, was independent of his personal exertions; also evidence of the age, sex and proximity of relatives who depended for support on the claimant's personal exertions; also evidence of the medical attendance received by the claimant between the time of his discharge from actual service and the date of investigation of his claim, with the names and residences of the medical attendants who had charge of him during that period. (Form C, par. 1015.)\n\n3rd Class.\n\n(1.) Claims on the part of militiamen who have received wounds or injuries, or have contracted disease on actual service, such as to incapacitate them for a time from following their usual trade or profession. The evidence required to be produced is as follows: report of medical board referred to in the first part of this paragraph 1009, which shall establish the amount and probable duration of incapacity (form D, par. 1016). Also evidence of the same nature as prescribed for claimants under the 2nd Class. Par. 375 R. & O. 1870.\n\n1010. The Board, having taken the necessary evidence, will make its report—and will recommend such amounts of pension and gratuity, subject to the regulations on that head, as may appear equitable. The report of the board will be solely on the evidence which is embodied in the proceedings. Par. 376, R. & O. 1870.\nBoards of Medical Officers.\n\n1011. The following applies to such boards as may be assembled for purposes mentioned in paragraph 1009, to investigate cases of disability of militiamen occasioned by wounds or injuries received, or by disease contracted on actual service. These cases are divided into two classes. Par. 387, R. & O. 1870.\n\n1. Cases of militiamen who have received wounds or injuries, or have contracted disease on actual service, such as to incapacitate them wholly from following their former trade or profession.\n\n2. Cases of militiamen who have received wounds or injuries, or have contracted disease, on actual service, such as to incapacitate them for a time from following their former trade or profession.\n\n1012. The board will take such evidence as may be produced, and will report its own opinion thereupon, either as to the total or partial disability of the claimant; if the disability is partial, the board will state the amount of injury or incapacity under which the claimant is suffering at the date of investigation, and its probable duration; the opinion of the board will, of course, be based solely on the evidence which is embodied in the proceedings. Par. 378; R. & O. 1870.\n\n1013. FORM A.\n\nI hereby certify ...........................................of.............................................. Battalion:\n*..................................................at................................................on the...........................................\nday of..................................................18\n\n...........................................................................\n\nCommanding.....Batt.\n\n1014. FORM B.\n\nI hereby certify that ...........................................of.............................................. Battalion:\nwas†..................................................on................................................day of. .......................18\n\nThe nature of†\n\n...........................................................................\n\nSurgeon..... Battalion.\n\nA duplicate copy of the certificate is to be forwarded, through the Deputy-Adjutant General of District, to the Adjutant-General of Militia.\n\n1015. FORM C.\n\nFORM OF PRIVATE PRACTITIONER'S BILL.\n\n..............................................Battalion. ..................................................18\n\nDr. to..............................................................\n\n| Rank | Patient's Name | Date | Daily Prescriptions, Visits, &c. | Charges. $ cts. | Remarks—by Surgeon and Commanding Officer |\n|------|----------------|------|----------------------------------|----------------|------------------------------------------|\n|      |                |      |                                  |                |                                          |\n\n* Here state whether killed in action with the enemy, or was wounded, or died of injuries received, or sickness contracted on service, or is still suffering from wounds or injuries received, or disease contracted, on actual service.\n\n† Here state wounded in action with the enemy, or otherwise, whilst on active service.\n\n‡ Here give a detailed account of wound or disease.\nThis form is to be made out in duplicate, to be submitted to the commanding officer for Remarks, and to be forwarded by him to the Deputy Adjutant-General of the District, who will forward one copy to the Adjutant-General, and have the other laid before the board of executive officers.\n\n1016. FORM D.\n\nProceedings of a Board of Medical Officers, assembled by order of…………………to enquire into the nature of the disability of………………of………………on………………day of………………18\n\n…………………………………………President.\n\n…………………………………………Members.\n\nWe declare, upon our honor, that we have duly and impartially enquired into the case of………………….of…………Battalion, who appeared before this Board this day; and we find the above-named…………………………is (1)\n\nWe do further declare, upon our honor, that we consider the above (2)……………to be (3)………………and that the injury is equal to (4)………………and that he will be (5)………………for service or his usual occupation.\n\nSigned, …………………President.\n\n…………………………………………Members.\n\nBy Command,\n\nWALKER POWELL, Colonel,\nAdjutant General of Militia, Canada.\n\n(1) Here give a particular description of wound or disease.\n(2) Here state sickness incurred on actual service or wound received in action.\n(3) Here say severe, dangerous or slight, as the case may be.\n(4) Here say if the disability is equal to the loss of arm or leg, or eye; or any other observation the board may deem sufficient to meet the case.\n(5) Here state he will ever be fit or never be fit, or probable length of time in which he will be fit.\n\nRETURN\n\n(80f.)\n\nTo an ORDER of the House of Commons, dated the 31st March, 1886;—\n\nFor Copies of Instructions to Major Bell, Major-General Laurie, S. L. Bedson and other Non-combatants employed during the North-West Campaign, from the Minister of Militia, Major-General Middleton or the Adjutant-General of Militia, and of Correspondence between the last named authorities and such Non-combatants.\n\nBy Command.\n\nJ. A. CHAPLEAU,\nSecretary of State.\n\nDepartment of the Secretary of State,\n3rd May, 1886.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001382.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 15036, "total-output-tokens": 8182, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3107, 1], [3107, 8144, 2], [8144, 11797, 3], [11797, 14958, 4], [14958, 17282, 5], [17282, 21052, 6], [21052, 24526, 7], [24526, 28593, 8], [28593, 31783, 9], [31783, 33776, 10]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]