[{"id": "0f78fbb4d49e2a21d86edf2093452e225b335609", "text": "FOR THE LEADER COMPANY, LIMITED,\n\nET AL.\n\nA SPEECH\n\nBY\n\nNICHOLAS FLOOD DAVIN, M.P.,\n\nDelivered in the Supreme Court of the North-West Territories, His Honour Mr. Justice Richardson presiding, on the 7th July, 1890.\n\nTHE LEADER COMPANY (LIMITED), REGINA.\n\n1890.\nFOR THE LEADER COMPANY.\n\nA SPEECH\n\nBY\n\nNICHOLAS FLOOD DAVIN, M.P.\n\nMy Lord and gentlemen of the jury, I am glad this case has come before a jury of the North-West. I believe in trial by jury. Yesterday morning when you were going into the box a friend handed me a slip of paper intimating that some of you were Reformers and that one had a personal prejudice against me. But I did not entertain the notion for a moment of challenging any of you. I had perfect confidence that a jury fairly chosen from our North-West settlers, whether composed of Grits or Tories, would give an honest verdict. I am satisfied there is not one man amongst you who would allow the least personal feeling to influence him in deciding on the issues you have to try. There are three issues before you. The Plaintiff comes into Court and because of an article which appeared in THE LEADER of August the 6th asks $10,000 damages from THE LEADER Company and Davin. These last make a counter claim, THE LEADER Company $10,000 for libelling it and Davin $10,000 for that the Plaintiff libelled him, holding him up to public contempt and hatred.\n\nThe article deals with Atkinson not as the publisher of a paper, but as president of a Sunday school. But I will show you that the position of a Sunday school teacher is a public one. Are we to be told,—and now especially would it be absurd when the Bible and religious teaching are being driven from our day schools—are we to be told that the character of the President of a Sunday school is not a matter of public concern? I will show you that it is. This gentleman is still President of the the Sunday school, yet he comes to you and says he has been so damned that he wants $10,000. Now in the first place in regard to that article we say it was not libellous. We say it did not touch him in his means of livelihood, and this is the heart and core of a libel. We say it was privileged comment on him in a most important public office, in regard to which his character is of vital importance. We say a slanderer is not fit for such a position. Why, you saw him in that box. He swears he was not actuated by malice against me or against THE LEADER; but did\nyou not mark the scorn and hate which he poured into the reading of those articles? And who behaved most like a Christian—this loud professor or the man that would not presume to make a profession? Libelled three years and a half, did we once reply?\n\n\"A thousand suns went down on that man's lie.\"\n\nHe called me a penny-a-liner and an understrapper on eastern newspapers. They tried to explain away penny-a-liner. But I tell you, what you know, it is a term of contempt. But what does his own counsel say? He tells you that I am the first writer in Canada, or one of the first, I forget which. He says there was probably not another man in the world could have written that article but myself. Was it true then to say I was a penny-a-liner? His counsel tells you I am an able speaker and a hard hitter. What did his client say of me? The ink is hardly dry yet on the paper, in which he said I should be lost in the shadow of a ministerial walking stick. Do you think he believed that when he wrote it? Well gentlemen I have known the members of government under Grit and Tory rule, and you know how governments are recruited, and do you think he believed that? Was it true? I do not think you will think it arrogant on my part if I say it would be a pretty big walking stick, aye, and a pretty big minister too in whose shadow I should be lost. Was that written believing it to be true or with the malicious purpose of bringing me into contempt? What are you to think of this man? Gentlemen are we in Bedlam? Is this a phantasmagoric dream? Is the whole a delusion? The Judge sitting there; the Sheriff; the Clerk; the police Sergeant; you the jury; the two Q.C.'s, with silk on their backs; Mr. Johnstone and myself? Here is a man who has been libelling me for three years and a half and there is one reply and he rushes into Court and says: \"Please gentlemen give me $10,000!\" (Laughter.) Why, it is a monstrous farce. If he can claim $10,000 why should not I have $10,000. What about the paper.—The Leader which he calls a libellous sheet, a paper in regard to which no instance can be found where it did not stand up for the interest of the North West? He says it is a libellous sheet—is that true? My learned friend congratulated the bar on not delaying you. Certainly we have not delayed you. But I must make this remark in regard to them—you saw it yourselves—they wished to close my mouth. Were they afraid of the voice of a petty creature who could be lost \"in the shadow of a ministerial walking stick\"? You saw how they tried to keep out evidence. We had evidence bearing on every point in the pleadings—and why did we not produce it? Because they did not dare to go into the matters contained in the pleadings. The fact is this they found that their case had broken down. You can fancy the conclave. The two Q.C.'s with silk on their backs,—Mr. Scott presumably one of the first lawyers in the Territories, for he is the government prosecutor, and his partner newly fledged, with his blushing honours fresh upon him, (Laughter.)—and Mr. Atkinson in tweed and they have discovered they cannot win on the merits and one or other says: \"our only chance is to send for Hagel.\" (Laughter.) My learned friend Mr. Scott is an able lawyer, but they wanted a different man; they wanted a man who could address a jury; and my learned friend Mr. Hagel has the reputation of being able to pull the wool over the eyes of any jury in Canada. And how does he do it? Look at the actor he is. Look how he read the article. You\nsaw the way he pictured some imaginary creature under the feet or knee of another, and how he prodded away as though the weapon was in his hand. The fact is, he would have made a great reputation on the stage; but it was mere acting. You marked the way he emphasized that article and brought out meanings neither you nor any ordinary reader would ever have seen.\n\nA great deal depends on how you read anything. You remember how our Lord fed thousands with five barley loaves and a few fishes. The sacred writer tells us how they all sat down and they did eat and were filled. Read that as an ordinary man would read it and you get the idea that they had a good meal. Now let me emphasize one word after the manner of my friend Mr. Hagel—\"and they all sat down and they did eat,\" and you have thousands of gluttons at once. (Laughter.)\n\nI am very glad that my learned friend (Mr. Hagel) quoted at such length from Odger on the scope and bounds of criticism, for it saves me the trouble of doing this, and all he quoted to you makes as much for us as for the plaintiff. That great authority says a newspaper has a right to comment sharply and fearlessly on matters of public interest—but he must not exceed. Did the plaintiff exceed when he discussed me as a barrister, when he called me a penny-a-liner, and a bald headed eagle? \"True criticism,\" quoted my learned friend, \"deals only with such things as invite public attention; call for public comment; it does not follow a man into his private life or pry into his domestic concerns.\" Is the open and public demeanour of a Sunday school teacher a private or domestic concern? But, gentlemen, do you remember what he said in an article read in that box about some supposed conversation of mine at a breakfast table—when he attributed to me a remark I never made in order to bring me into public odium? The very first and worst article written about me was written before I was a candidate for parliament.\n\n\"Criticism,\" says Odger, as quoted by my learned friend, \"never attacks the individual but only the work; in every case the attack is on the man's act and not upon the man himself.\" Was it my work he attacked when he called me a cowardly back-stabber, a libeller, the evil genius of the North-West? Evil genius of the North-West! Gentlemen, you all know me for the last eight years. During that time have I ever, before and since I have been in parliament, have I ever neglected to attend to any man's private affairs, whatever his politics? You know that I have done the business of you all at the land office and in the Departments. I have spent and been spent in your service—in the service of the North-West. He says I made an unqualified pledge on disallowance and after it was pointed out to him that I said in my address \"With Sir John Macdonald on any vote challenging the confidence of the country I will stand or fall,\" he swore—this intelligent and conscientious saint—that my voluntary pledge was yet unqualified. You saw the scorn he threw into his voice in reading that address—because I held up a high political ideal before the North-West—and he continued until his counsel who saw it was injuring him told him not to inflect his voice. What has THE LEADER done? Has it not been forward to make suggestions for the welfare and fight the battles of the North-West? Yet this man who comes here and before he knows anything about me libels me, who has never done anything for the country, who devoted all his columns and all his energy to denouncing Davin, and who for the last four years followed me like a sleuth hound, he declares I am the evil genius of the North-West! But if the\nwhip is moved gently over his back he crawls and whines and says \"Gentlemen, I am an injured man, please give me $10,000.\" (Laughter). Gentlemen, I may have to put on my gown again to earn my bread. I studied law in the best school in the world—that of the Middle Temple and Westminster Hall. I was at once admitted at Osgoode Hall; I am an advocate of the Territories. Now was it my work as a public man he criticized when he said I was a failure as a lawyer? The very gist of a libel is that it should touch a man's business. Now what did I do when I came back to Regina and found that the Editor of the Leader had commented on the printing by this man of cards for races, against which races he had warned boys in the Sunday school? I apologized. That related to his business; it was in no sense a public matter. How did he receive my apology, this saintly man? As a Christian? No; As a gentlemen? No; he could not receive it graciously. He commented on it in a vain-glorious, boastful way, and it was out of that comment that this article complained of arose. My friend quoted Odgers that \"a true critic never indulges in personalities.\" Is it a personality to call me \"a bald-headed eagle\"? (Laughter.) Some men are very sensitive on the subject of personal appearance. Baldness is a defect from the point of view of personal beauty and there are men whose feelings would be wounded by a reference to their unhatched roof, tho' some of the men who have done most for the world—the great ones of the world—have been bald; Bismarck has been bald for more than half a century; Cesar was bald; the late Chief Justice Cockburn, one of the greatest judges who ever sat on the bench in England, whom my friend has quoted, was as bald as a billiard ball; Alexander Pope, one of the greatest men of the eighteenth century, was bald; Dr. Johnson was bald; Mr. Canning—that great statesman, was bald, and the list is indefinite. This man, the plaintiff, complains that we call him a wolf. But we did not do that. But suppose we did. What is a bald-headed eagle? A bird of prey, which kills and sometimes stoops on carrion. What is a wolf? A beast of prey on four legs which sometimes eats carrion too. And yet this man whose animus against me was such that he could not spare space in his columns to discuss North-West matters, so full was his brain of \"Davin\" \"Davin\" \"Davin,\" comes here because wolf is brought in as an illustration and wants ten thousand—fiddlesticks! (Laughter.) Should I not be justified in calling a man, who called me a bald headed eagle, an elephant or a hippopotamus? If a man is called wolf and is not like one, the language strikes back on him who uses it. And who would think there was anything of the wolf about that noble countenance? (Laughter.). Twice he accused me of being a hypocrite and a cowardly backstabber. Well, gentlemen, I am pretty well-known in the North-West. Most of you know me, and I don't think anybody would believe I would do anything behind a man's back. I think if I fight a man I fight him to his face. And as for cowardice—I am pretty well-known throughout Canada and no man who ever knew me would believe that taint to be in me. Are not these words reflections on moral character? Yet what did the learned counsel read to you from Odgers? That it is not libellous to attack or ridicule a man's works, but it is a different thing when the moral character of the man is attacked. This man appears before you as a religious teacher. I make no profession. I go to church. I am but a\nsinner. Did you hear how he swore in that box that he could not give an unqualified 'no' as to whether an article written by him was intended or not to bring me into public contempt! What is an unqualified no? Did you not hear him answer when asked whether there was ill-feeling in a given article. \"'Not ill feeling as I understand it.\"'-Not ill feeling as he understands ill feeling! He cannot give an unqualified 'no'! He is a Presbyterian, but these answers would suggest the worst features every attributed to Jesuitism. My learned friend told you that we could not say: \"You libelled us; we can libel you.\" But there is such a thing as provocation. Now, gentlemen, what does Odgers say? On page 175 he lays it down:\n\n\"Every man has a right to defend his character against false aspersion. If I am attacked in a newspaper I may write to that paper to rebut the charges and I may at the same time retort upon my assailant when such a retort is a necessary part of my defence or fairly arises out of the charges he has made against me. A man who himself commenced a newspaper war cannot subsequently come to the court as plaintiff, to complain that he has had the worst of the fray.\"\n\nAgain on page 238 Odger says:\n\n\"The previous libels and slanders may be made the matter of a counter claim even though not immediately connected with the words on which the plaintiff is suing.\"\n\nThat retort in... The Leader arose fairly out of the way the plaintiff received our manly apology. Was it true what he stated that we had accepted his correction? It was not. He put in the word \"existed\"; no ground existed for saying he he was a hypocrite. This would be a wholesale statement—a general certificate of character. We utterly refused to put in the word. Were they true the statements he made in commenting on our apology? Now, gentlemen you will have seen that the plaintiff's counsel have behaved as if they were carrying a heavy load—a load too heavy. They forgot yesterday to prove publication and it was only after sleeping over it last night that they discovered their case was incomplete, and they have never justified now and their case is incomplete still. Mr. Scott is an experienced lawyer:—how came he to so act? The fact is as I said before they found there was no case; no chance; no hope but to send for Hagel! What is Hagel? A great actor. A hired advocate. And, gentlemen, if Mr. Johnstone and myself had thought our case was weak and feared—we are only stuff gowns you know—the two Q. C.'s with their silk—my learned friend, Mr. Scott and his partner, (Laughter,) well if five minutes before they did it, we had sent for Mr. Hagel, you would have seen him get into a passion in my regard; he would have read the libellous articles written against me with indignation and feeling; he would have placed me on the ground and described some imaginary individual driving his spear below my ribs into my vitals, and would have held me up with great pathos as an object for your commiseration. (Laughter.) He would have described Atkinson pummelling me for four years and he would have asked you which of the two showed the more Christian spirit? Gentlemen, I make no profession. I am but a sinner. I am like the publican in the temple who stood afar off and dared not to lift up so much as his eyes to heaven. This man like the Pharisee wraps his garments of holiness and spiritual pride around him and thanks God he\nis not as other men or even as this poor sinner. But what does our Lord say? \"I say unto you that the publican went away justified rather than the other.\" This man is a religious teacher—Is it not a matter for public comment whether he is a slanderer and a libeller or not? Now my learned friend threw his voice very low and tried to impress you with the view that it was a terrible thing to comment on this man's religious character, which he said in this case was a matter \"between him and the children.\" What about the parents of the children? What about the public? What about God? I will show you according to his own authority, Odgers, that Atkinson is a fit subject of comment. On page 36 we read:\n\n\"The working of all public institutions, such as colleges, hospitals, asylums, homes, is a matter of public interest, especially where such institutions appeal to the public for subscriptions.\"\n\nI think, if I remember rightly I have subscribed something for that Sunday school—I certainly have for the church and if I have not for the school others have.\n\nAgain: \"A bishop's government of his diocese, a rector's management of his parish or of the parochial school are matters of public interest.\"\n\nIs not the manager and management of a Sunday school then open to public criticism? Why we do not want authorities—the thing is common sense. And have we no guide—no standard? What does this book say?—\"By their fruits ye shall know them.\" This prominent religious teacher teaches the 13 chapter of 1st Corinthians in which we are told that love is above all things.\n\n\"Though I speak with the tongues of men and angels and have not love I am become as sounding brass or a tinkling cymbal. And though I have the gift of prophecy and understand all mysteries, and all knowledge, and though I have all faith so that I could remove mountains and have not love, I am nothing. And, though I bestow all my goods to feed the poor, and though I give my body to be burned and have not love, it profiteth me nothing.\"\n\nAnd what does our Lord say? Love your neighbours? Yes. And your friends? Yes. Nay, more emphatically, love your enemies. This man sat in the same church with me a few Sundays ago, when the Rev. Mr. Carmichael preached on this subject; also when he preached on the 48th chapter of Isaiah. What did Mr. Carmichael say? That the Jewish church, in Isaiah's time, with its priests and levites, its doctors and Sunday Synagogue teachers was a \"magnificent hypocrisy, a splendid insincerity;\" and he said the Christian church today was in danger of being a \"magnificent hypocrisy, a splendid insincerity.\" With the Bible speaking thus, and a Minister of the Gospel speaking thus, are we to take for granted the christianity of every man who professes himself a christian? How did this man display love—the love of Christ? What example did he set the children of that school and this community? How did he manifest his Christian love to the poor sinner who addresses you? How did he try to lead me from the benighted condition in which he thinks I am? He has told you from that box.—By determining to drive me from my seat; by aiming at my life as a public man; by pursuing me like a sleuth hound for three years and a half; by seeking to destroy me; with what weapons? The weapons of slander, of calumny, of lies. And if he thus fought, is his character such as should belong to a prominent religious teacher? Our Lord has said it is impossible but\nthat scandals should arise; that is misconduct on the part of Christians; but woe to that man by whom the offense comes. And yet with that Bible—that standard in our hands—there is to be no criticism! My learned friend told you I wrote that article in a passion; but if so it must have been an impulsive act. There could be no malice if it was the fruit of passion. And was there malice? You know what malice is; it is a passion that abides; it controls a man; it overturns his judgment; it rides the will. I controlled the columns of the most powerful paper in the Territories. Did I feel malice towards that man—do you suppose if I did that with the continual dropping of his gall of bitterness from week to week—that I could have kept my hands off him? No; I had no malice. But where was the evidence of malice? In his paper, where there was the weekly dropping of six or seven articles—there was the malice. This man falsely said I had been a penny-a-liner. Did THE LEADER ever refer to what he had been? What matter what a man's beginnings? We must take him as he is. He commenced life as a printer's devil—as a devil—and in the process of Darwinian evolution—he has evolved into a printer, and the evolution is going on through a Sunday school Superintendent, and at some very far off day he will doubtless emerge as a seraph. (Laughter). Before that angelic and super-essential time comes he will have to change very much. (Laughter.) The learned counsel referred to the Chinese Commission, and quoting his client, who mis-stating the facts, said I got $13½ a day. I never asked to be placed on that Commission. I was appointed without being consulted and the salary was $5 a day and $3.50 as expenses. My friend Mr. Hagel knew me in Toronto and when in Toronto by a few hours work a day I habitually earned more than this, and a commission takes up a man's whole time, the bulk of the work falling on the Secretary. They plead that I am a public man? Has a public man no protection? Has he no right, before the courts of his country? Is he like a wild beast to whom no law is to be given and who may be shot at with any missiles from behind a bush or clump? Suppose one of you were to determine to run for the North-West Assembly or for the Dominion Parliament, what justification would there be for men mendaciously accusing you of faults you never had and crimes you never committed? And is he not in a public position? Am I to be pursued for three and a half years and never reply? Is the worm never to turn? Why did I not reply to him? He was attacking me with congenital ferocity. My learned friend, his counsel, tells you I am the first writer in Canada. Well I cannot say that his client is the first or second or third or fifth or fifteenth writer in Canada. But any man who can hold a pen can write mendacity and abuse. Why did I not reply to him? Because I held him at naught. I cared not for him. He could not excite anger, still less inspire malice. I will tell you a little story. There was in my boyhood a great large St. Bernard dog in Cork and a little half-bred terrier used to bark after him. For some three years he barked after him and was never noticed. One day crossing St. Patrick's bridge, which spans the Lee, the St. Bernard thought the time of the petty Barker had come, and turning struck the cur with his paw; kept him there while he lifted his hind leg over him; then taking him by the skin of the neck he dropped him into the river. (Laughter) My learned friend spoke very strongly on the sentence that but for the restraining influence of Christianity this man might\nhave stood in a criminal dock and be serving a term in Stony Mountain. What is there in that? He is a Presbyterian. He teaches the tenets of Presbyterianism and presumably the doctrines of the Bible, and what are these? That the heart of man is full of adulteries, murders, lyings and all manner of wickedness; that the depth of its wickedness no man can know. You have all heard of Richard Baxter—a great and holy divine—the author of \"the Saints Everlasting Rest.\" What did he say on seeing a criminal manacled led in the prison cart to the gallows? \"There but for the grace of God goes Richard Baxter.\" What did THE LEADER say that Richard Baxter does not say of himself? That the Bible does not say of all men? That this man if he is efficient must teach? And as a matter of fact might he not have stood in a criminal dock? Might he not have gone to Stony Mountain? Could I not have prosecuted him for criminal libel on the articles set out in these pleadings? Remember there is a great deal at stake for THE LEADER and for me. My reputation is at stake; my position is at stake; my life is in your hands. He has no such risk as I have; he has nothing at stake. If you give him a farthing damages—or do as you should do, scout his claim out of Court—and give the two defendants a thousand dollars each or more we will get a cheque the following morning (here Mr. Davin pointed with his finger over his left shoulder amid much laughter). But if you give him a verdict it will be a different thing. We must pay it. Then you have to consider our relative positions. The people of Western Assiniboia have given me the highest position they can give, that of representing them in Parliament. It is the highest position the people, the source of power in a democratic country, can give. The duties of that position I have to the best of my poor ability discharged. When I retire some one else can come forward, aye, if you can get a fit man perhaps I should be willing to retire. To do the work well is a laborious thing and requires special talents. But so long as I have the confidence of my fellow citizens throughout this constituency, I will represent them until some man who can really take care of their interests is forthcoming, and then perhaps gladly enough would I lay down the responsibility. Take THE LEADER—look at its position. It has been called a libellous sheet and an inventor of falsehoods. Is that true? You know THE LEADER, and what its course has been for eight years. You know it has been devoted to the interests of the farmers and the people of the North-West, of the whole North-West, and that when it came to be a question between North-West interests and anything, a government, a corporation, a public officer, even though a close friend of its proprietors, it has never hesitated—it has always sided with the settler, the farmer, the North-West. This man says THE LEADER libelled Mr. Ross on a given occasion, and published telegrams to support his assertion. Of course the authors of those telegrams would deny; but it was a significant thing no telegram came from Mr. Lineham or Mr. Cayley—Mr. Cayley, the most active, the leading wire-puller of the Council. What does an unsupported telegram amount to? Mr. Ross was sitting there yesterday; he knew all about it; he could swear to the facts. Why did they not call him? They also set out that what THE LEADER said about the police—Van Pittius not being allowed to get married—the canteen business—to support their statement that THE LEADER was a libellous sheet. Why did they not call\nMr. Herchmer? Gentlemen, I will tell you the reason—\n\nMr. Hagel, Q.C.: I do not wish to interrupt my learned friend but if he travels out of the record we must ask for a reply.\n\nMr. Johnstone: But these things are set out in the pleadings.\n\nAfter some argument\n\nMr. Davin said: Oh, well I will pass away from that. And now gentlemen I will call your attention to the advice given by this saint—if you were to examine his shoulders I have no doubt you would find the wings sprouting—(laughter) to the municipality of Portage la Prairie, in the Liberal. He told them to repudiate their just debts. But my learned friend Mr. Hagel says there is no harm in this and that it was very wrong of us to say that he advised them to rob the public creditors. You know what ancient Pistol says of theft and an ugly thing can be toned down to the ear by such euphemisms as those of my learned friend. When Nym in Shakespeare's \"Merry Wives of Windsor\" commends stealing, using the harsh word and calling a spade a spade, mine Honest Pistol says: \"Convey, the wise it call: steal; foh; a fico for the phrase.\" When you call stealing \"conveying\" it sounds better; and you have heard the excuses made by my learned friend for the advice to repudiate, to \"have the nerve to repudiate.\" But what does the Globe, the leading journal of his party say? \"The proceedings are unquestionably dishonest.\"\n\nMr. Scott: Well my Lord I submit this is travelling outside the record.\n\nMr. Davin: Well my Lord I wont go into it. Now gentlemen my learned friend (Mr. Hagel) spoke to you as if the libels amounted to only six or seven against me but you know they were continued up to the very day of the commencement of this action. You know what his system has been. You know that were I as wise as Solomon and spotless as an angel anything I did he would oppose. Although he poses as a reformer, if I advocate anything which he may think the government does not approve of he starts up to attack me. Gentlemen I have been injured, because this man's paper has gone among new settlers and I was too busy discussing the affairs of the country to afford space or thought to disabuse their minds. The paper may have been injured, for people who would regard it as a libellous sheet would not subscribe for it. How does he, how can any man know how much I have been injured in my feelings by this perpetual mis-representation and abuse; this perennial flow of calumny, and slander; this unfailing supply of envy, hatred, malice and all uncharitableness? I have sometimes in my mother's lifetime refrained from sending home Leaders in which replies appeared to attacks from other papers because I wanted to spare her pain. Gentlemen the whole case is before you. I rely on you doing your duty. I have confidence that you will mark with your disapprobation, envious, scurrilous, unjust, malignant, and mendacious attacks on a public man and on a newspaper whose end, whose aim and whose watchword has been faithfulness to the North-West.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001875.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 16328, "total-output-tokens": 7246, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 261, 1], [261, 261, 2], [261, 2439, 3], [2439, 5961, 4], [5961, 9616, 5], [9616, 13147, 6], [13147, 16572, 7], [16572, 20026, 8], [20026, 23633, 9], [23633, 27199, 10], [27199, 30198, 11]], "primary_language": ["en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]