[{"id": "ca8c0223ec8eaf05753b3c871617a99c60397c82", "text": "Alphabetical\n\nBUSINESS DIRECTORY.\n\nOF THE\n\nTOWN AND DISTRICT\n\nOF MOOSE JAW\n\nIN THE\n\nNORTH WEST TERRITORIES,\n\nWith a Brief Historical Sketch of the\n\nTOWN AND DISTRICT.\n\nMOOSE JAW, N. W. T.:\nPrinted at the Times Printing House, Main Street.\n1890.\nRight Hon. Sir John A. Macdonald,\nPremier of Canada.\nPreface.\n\nDirectory of the Town and District of Moose Jaw, it is our aim to give as accurate a list as possible of the settlers in each Section, Township and Range of each, but in as complete a manner as possible set forth a few of the advantages this district offers as a settlement, and a short history of the formation and growth of the town.\n\nThis District unlike many other parts of the North West Territories has not much of a history, beyond the advent of the Canadian Pacific Railway in 1882, except that it was noted as the great feeding ground for the now extinct buffalo, whose might tread must at one time on these plains have \"shook the earth.\"\n\nThe different business interests of the district are represented on the advertising pages of this book, which show that nearly every line of business is being carried on, and that competition in the different lines is keen. I regret very much that I have been unable to procure a good cut of the Town for the Directory, but hope that the next edition will contain such a cut, as will represent our town as it is.\n\nHaving lived in this District for over seven years, and during that time having had frequent opportunities as Government Immigration Agent, of contrasting its advantages as a mixed farming locality, with those of other districts both in the North West and Manitoba, I am in a position to speak from personal knowledge on these matters.\n\nThe system of survey in the North West, although one of the simplest and most convenient in the world, is apt to confuse newly arrived settlers, and they are often in doubt as to the meaning of such expressions as 27-27 and until they become thoroughly familiar with the country, where the land represented by such numbers really is. To such, and in fact every settler in the District, this directory will prove a valuable guide as to the exact location of his fellow settlers.\n\nI trust that notwithstanding any errors or omissions that may have unavoidably occurred in this edition, the object aimed at in its publication may be accomplished, and where such errors or omissions may have occurred they may be pardoned.\n\nR. L. Alexander.\n\nMoose Jaw, N. W. T., March 15th, 1890.\n\nEntered according to Act of Parliament of Canada, in the year One Thousand Eight Hundred and Ninety by R. L. Alexander, of the Town of Moose Jaw, N. W. T., in the office of the Minister of Agriculture.\nHonorable E. Dewdney\n\nMinister of Interior.\nDESCRIPTION AND HISTORY.\n\nThe Electoral District of Moose Jaw is composed of all that part of the North West Territories being and included between Range 23, West of the 2nd Principal Meridian line, and Range 6 West of the 3rd Meridian line, and stretching from the International Boundary line on the South, to the Southern Boundary of Saskatchewan, on the North. It is 180 miles long and 78 miles wide, and comprises an area of 14,040 square miles. The main line of the Canadian Pacific Railway runs across the District, near the centre, in Townships 16 and 17, along both sides of which as far west as Caron Station; the district is fairly well settled, for a distance varying from 10 to 20 miles in width. The other settlements in the district are the Willow Bunch settlement of French and Halfbreeds, about eighty miles south of the railway line, a North West Mounted Police station at Wood Mountain Post, near the Montana Boundary, and a small settlement of ranchers at Beaver Creek, about 100 miles north of the railway. Almost the whole of this large extent of country is admirably adapted for mixed farming, which has been found to be in every part of the North West the surest way to prosperity. The settlement of the district began in 1882, but it was not until the fall of that year that the C. P. R. reached the place where the town of Moose Jaw now stands, and the \"rush\" for land began. During the winter of 1882, and the succeeding summer, a considerable quantity of land was taken up in the district, especially in the part adjacent to where the town was rapidly springing up. A large number of good homesteads were taken up by \"adventurers,\" who, as the railway pushed forward, followed it and never returned to make any improvements. These entries were, in subsequent years, cancelled by the Government and given to other and better settlers, thereby making a more permanent and compact settlement. Since its first settlement the district has made a steady advance in improvement and development, although a partial failure of crop in 1886, somewhat retarded its progress. During the past three years the crops have been good. Good prices have been paid for all kinds of farm produce, a large amount of new and improved farming machinery introduced, and the reputation of the district established on a firm basis.\nPhysical Features.\n\nFor about twenty miles on either side of the Caron River, the land is principally level prairie, with little or no wood except along the banks of the Moose Jaw River, or along the valley of the Qu'Appelle River. The land is more hilly, with wood in the ravines. In these hills there is an abundance of the best coal, awaiting the magic wand of capital to bring it into operation. About twenty miles north of the town of Moose Jaw is an enlargement of the Qu'Appelle river with banks from 200 to 300 feet in height. To the north of the Buffalo Lake the land is described as knolly prairie with luxuriant grass around the sloughs. Wood is found along the valley of the \"Little Arm.\" A number of small lakes and ponds of good fresh water are found in every township. Pelican Lake is a considerable body of water north west of Caron. Old Wives' Lakes and River extend from Chaplin southward, and form quite a large sheet of water.\n\nSchools.\n\nIt is generally found that in a new country, where the principal aim of the first settlers is to make a home for themselves and families, that matters of an intellectual nature receive but slight attention. Not so in the Moose Jaw District. Coming as they did from the Eastern Provinces of the Dominion, they early recognized the importance of having good schools. This they were enabled to do by the liberality of the Government and their own exertions. As early as 1886, school districts were organized at Pasqua, Caron and Two Rivers. In 1888, School Districts were organized at Buffalo Lake and Pioneer, and schools established. In 1889, a school district was organized at Marlborough, and a new school building erected. A neat frame school house was also erected in the Pioneer district. In all these schools good Teachers have been engaged, and good work done, so that the settlers in the district have good educational advantages for their children, as they had in the countries from which they came. During the present summer (1890) a school will be opened at Boharn, and several more are spoken of for next year, so that there are now in active operation in the Moose Jaw district eight good schools.\n\nChurches.\n\nBesides the churches in the town, religious services are held by the different denominations at various places in the district. An Episcopal church, with a resident Missionary, was built at English Village in 1888. A Presbyterian Missionary is during the summer months stationed at Buffalo Lake, and holds services at different places along the Lake, at Marlborough and Caron. The Methodists have a Missionary stationed at Marlborough under the Superintendent at Moose Jaw, who also supplies Caron, Boharn, Pioneer, Pasqua and Coventrie's. The Roman Catholics have a church and resident Priest at the Willow Bunch settlement.\nMr. F. Davis, Esq., M.P.,\nWestern Assiniboia.\nR. BOGUE,\n\nGENERAL MERCHANT\n\nCORNER MAIN AND HIGH STREETS,\nMOOSE JAW, N.W.T.\n\nG. M. ANNABLE,\n\nIMPORTER AND DEALER IN\nALL KINDS OF LIVE STOCK.\n\nHas on Hand Constantly—\n\nA THOROUGHBRED SHIRE STALLION.\n\nFOR SERVICE.\n\nAlso Heavy Draught Mares, Driving Horses, Working Oxen, Polled Angus and Durham Cattle. Milch Cows FOR SALE.\n\nCorrespondence Solicited.\n\nStables in Moose Jaw.\nElections.\n\nThe district of Moose Jaw was formed into an Electoral district in 1883, and has been continuously represented in the North West Legislative Assembly by Mr. James Hamilton Ross. Elections were held in 1885 and 1887, at each of which Mr. Ross was elected. The number of votes cast at the last election was 325. In 1887 the North West gave representation in the House of Commons, the district of Moose Jaw being included in the Constituency of Western Assiniboia, an election was held in that year and Mr. Nicholas Flood Davin, of Regina, elected to represent the Constituency. In each election so far the polling of votes has been \"open,\" but ballot voting will be introduced at next elections.\n\nSoil.\n\nThe soil in the Moose Jaw district is admirably adapted for mixed farming. That of the central townships of the district near the line of the C. P. R. is described in a report compiled from the field notes of the surveyors, and published under the authority of the Department of Interior, as varying from clay loam to sandy loam with a clay subsoil, and is rated as first class. That of the Southern townships as black clay, clay and sandy loams, with brown clay, white clay and gravel subsoils, class 2 and 3. The soil of the Northern townships is described as good sandy loam, alluvial soil of six inches on a black sand subsoil class 2 and 3.\n\nClimate.\n\nThe climate of this part of the North West is dry, clear and invigorating. The winters are much shorter and milder than further east, and not so liable to sudden changes as further west. Spring generally opens about the end of March, and seeding commences early in April. The summer rains generally come in the month of June, the time when it is of most benefit to the growing crops. The summers are dry and warm, the wheat harvest commencing about the first of August. No summer frosts have as yet been experienced, the first frosts generally coming about the end of September after the harvest is all gathered in. The autumns are dry and clear, with sunny days and cool nights, and lasts until the beginning of December when winter generally sets in. The climate, during the whole year, is one of the healthiest on the Continent, lung troubles being almost unknown.\n\nENOCH COLPITTS,\nDAIRYMAN AND GARDENER,\n\nMoose Jaw, N. W. T.\nBelow we give as nearly as possible, a complete alphabetical list of settlers in the district, with the Section Township and Range where each settler is located. The sign * denotes that the settler has made his Second Homestead.\n\n| Name                  | Section | Township | Range |\n|-----------------------|---------|----------|-------|\n| Abbey, O.             | w       | 2        | 18    |\n| Abbey Louis           | e       | 2        | 18    |\n| Allison, Robt         | w       | 24       | 16    |\n| Allison, Albert       | e       | 31       | 16    |\n| Allison, Jackson      | w       | 24       | 16    |\n| Allison, Walter       | w       | 34       | 16    |\n| Alcock, N. T.         | s       | 18       | 17    |\n| Allen, Wm.            | n w     | 12       | 16    |\n| Anderson, Chas.       | s e     | 20       | 17    |\n| Annable, G. M.        | n e     | 19       | 15    |\n| *Annable, H. F.       | n w     | 24       | 15    |\n| *Annable, Joshua      | n e     | 24       | 15    |\n| Annable, Joseph       | e       | 22       | 16    |\n| Annable, J E          | n       | 20       | 15    |\n| Annable, Stephen      | s       | 28       | 15    |\n| Annable, Wm           | s       | 10       | 15    |\n| Armstrong, C. H.      | s       | 18       | 18    |\n| Armstrong, F. L.      | n       | 18       | 18    |\n| Armstrong, Wm         | e       | 18       | 16    |\n| Astleford, J. W.      | w       | 34       | 18    |\n| Ashwin, Chas. W.      | w       | 16       | 16    |\n| Ashford, H. J.        | w       | 20       | 18    |\n| Ashley, WJ            | s e     | 32       | 18    |\n| Auger, Thos           | e       | 4        | 17    |\n| *Battell, H C'        | e       | 2        | 17    |\n| Battell, J E          | w       | 36       | 16    |\n| Battell, C E          | e       | 34       | 16    |\n| Battell, W J          | w       | 34       | 16    |\n| Battell, Thos         | n e     | 12       | 17    |\n| Bate, Joel            | w       | 30       | 16    |\n| Bate, Hy              | s       | 24       | 16    |\n| Bates, W H            | w       | 24       | 16    |\n| Bates, Henry          | s       | 16       | 16    |\n| Bailey, Mrs           | n w     | 24       | 15    |\n| Baines, Thos          | e       | 36       | 15    |\n| Buines, E R           | s e     | 14       | 16    |\n| *Bambridge, M T       | e       | 2        | 16    |\n| *Barker, Mrs EJ       | s e     | 20       | 17    |\n| Barry, Thos           | e       | 34       | 17    |\n| *Barlee, W R          | e       | 4        | 19    |\n| Bastedo, J G          | w       | 24       | 17    |\n| Bastedo, J L          | s e     | 18       | 17    |\n| *Beasley, Jno G       | w       | 22       | 18    |\n| Beasley, Arthur       | w       | 10       | 18    |\n| Betts, Jerald         | n e     | 22       | 19    |\n| Behnie, Thos          | e       | 16       | 16    |\n| Bennie, Wm            | e       | 2        | 16    |\n| Bevis, Thos           | s w     | 24       | 17    |\n| Bennet, John E        | w       | 18       | 19    |\n| Bennett, G H          | e       | 18       | 19    |\n| Berry, Hugh           | n       | 24       | 16    |\n| Beveridge, Jno E      |        | 24       | 16    |\n| Bielbey, Thos         | s       | 14       | 15    |\n| Boan, D               | n       | 10       | 19    |\n| *Briggs, Chas         | s w     | 36       | 18    |\n| Brown, Jas            | n e     | 20       | 15    |\n| Brown, E F            | n e     | 16       | 19    |\n| Brown, W H            | w       | 18       | 18    |\n| Brookfield Jacob      | s e     | 2        | 17    |\n| Brubaker, Jno H       | s e     | 16       | 15    |\n| Burton, Wm            | e       | 34       | 16    |\n| *Buchanan, Jno        | w       | 20       | 15    |\n| Buckoll, R J          | w       | 20       | 17    |\n| Bull, Thos            | s       | 10       | 19    |\n| Bunt, Geo             | w       | 28       | 16    |\n| Bunt, W               | e       | 28       | 16    |\n| Bumphrey, Jno         | w       | 24       | 18    |\n| *Campbell, Jas        | e       | 22       | 17    |\n| Campbell, Arch        |        | 28       | 17    |\n| Campbell, P P         | n e     | 22       | 16    |\n| Cameron, S            | n       | 32       | 16    |\n| Card, W D             | e       | 36       | 16    |\n| Card, C T             | s e     | 4        | 17    |\n| Carle, Adam B         | n e     | 14       | 17    |\n| Carty, Jno            | w       | 20       | 15    |\n| Carter, W J           | n e     | 36       | 17    |\nW. W. BOLE,\nGIST & STATIONER,\nMOOSE JAW, N. W. T.\n\nDealer In -\nDrugs, Patent Medicines and Cigars,\n\nA Full Line of Books and Stationery Always in Stock.\n\nGOPHER POISON!\nBuy your Strychnine from Bole and get a few good hints for using it seven-eighths of the Strychnine used is wasted, all for want of a proper knowledge of dissolving it.\n\nF. A. MELLER,\nHouse, Sign and Ornamental Painting.\n\nKALSOMINING,\n\nSIGN WRITING A SPECIALTY.\n\nAll Orders Promptly Attended to.\n\nF. G. HERRLER,\n\nCONTRACTOR FOR\n\nSTONE and BRICK WORK,\n\nKALSOMINING, Etc.\n\nManitoba Street, Moose Jaw.\nA. K. GRAYSON,\n\nIMPORTER AND DEALER IN -\n\nHORSES, PONIES, WORKING OXEN,\n\nMILCH COWS, BUGGIES, Etc.\n\nCorrespondence Solicited.\n\nTHOS. HEALEY'S\n\nRESTAURANT,\n\nMain Street.\n\nOysters—Fresh—in Season.\n\nCrabs—Best Brands.\n\nVEGETABLES in SEASON.\n\nW. J. LAW,\n\nMerchant Tailor.\n\nChoice STOCK Always on Hand.\n\nW. J. BRADSHAW,\n\nBUILDER AND CONTRACTOR.\n\nEstimates Given and Contracts Taken at Lowest Rates. All work Guaranteed.\nHon. W. O. Bailey,\nSenator Eastern Assiniboia.\n| Name                  | Location |\n|----------------------|----------|\n| Carmichael, Donald   | w 14, 16, 25 |\n| Carmichael, C        | e 14, 16, 25 |\n| Cafferatte, Jos      | e 24, 18, 24 |\n| Cathcart, W H       | e 4, 16, 27 |\n| Case, J W           | e 32, 15, 24 |\n| *Checker, Henry     | e 32, 17, 56 |\n| Clowes, Jno         | e 10, 18, 27 |\n| Cline, Mrs J        | e 24, 17, 27 |\n| Cline, Hiram        | n e 6, 17, 26 |\n| Cline, Jas          | n 30, 17, 26 |\n| Colenutt, Chas A    | e 2, 18, 29 |\n| Colpitts, E         | w 12, 16, 26 |\n| Collins, Jas        | s w 34, 16, 28 |\n| Code, F             | n e 14, 18, 24 |\n| Coventry, Jas H     | e 28, 15, 24 |\n| Coventry, P         | w 28, 15, 24 |\n| Cooper, Thos        | w 30, 15, 24 |\n| Craig, W F          | n 16, 20, 27 |\n| Craig, Robt         | s 16, 20, 27 |\n| *Croft, Win         | e 12, 18, 27 |\n| Crozier, Benj       | e 28, 18, 27 |\n| *Cudmore, E J       | n e 14, 18, 28 |\n| *Curren, Arch       | s w 10, 18, 25 |\n| Dalgetty, Geo       | s 4, 17, 26 |\n| Dalgetty, David     | w 18, 16, 24 |\n| Dalgatty, Alex      | n 6, 17, 24 |\n| Dalgatty, Wm        | n e 36, 17, 26 |\n| Dalgarno, Alex      | w 36, 18, 23 |\n| Dalgarno, Andrew    | e 16, 17, 26 |\n| Dalgarno, A G       | w 36, 16, 28 |\n| Daley, Thos         | w 14, 18, 27 |\n| Dalrymple, Arch     | s 2, 18, 28 |\n| Davis, A L          | w 4, 18, 27 |\n| Davey, Wm           | n 34, 17, 25 |\n| Day, B              | w 20, 18, 26 |\n| Davies, E. C. K     | n & 29, 16, 26 |\n| de la Haye, J L     | s w 36, 18, 26 |\n| Dalgetty, R S       | n 4, 17, 24 |\n| Denton, S. B        | n w 10, 17, 26 |\n| Dickson, R          | e 14, 18, 25 |\n| Dillabaugh, Henry   | w 30, 15, 23 |\n| Dunn, G M           | e 2, 18, 24 |\n| *Dorrell, Hy., J. P. s w & e 30, 18, 26 |\n| Dustan, D           | w 22, 16, 25 |\n| Devon, Andrew      | e 32, 16, 28 |\n| Devon, Win          | w 32, 16, 28 |\n| Doan, Jesse         | n w 12, 18, 25 |\n| Doran, R            | e 10, 15, 25 |\n| Doan, C W           | s 18, 18, 25 |\n| Eaton, Ed A         | n w 30, 18, 26 |\n| Edwards, Chas       | s w 4, 19, 27 |\n| Edwards, John       | e 32, 21, 25 |\n| Eddie, Wilbert      | w 6, 18, 26 |\n| Elliott, Chas       | e 16, 15, 24 |\n| Elliott, Jno W      | w 4, 16, 24 |\n| English, Joe        | n n 24, 18, 29 |\n| Evat, Ed            | e 32, 18, 25 |\n| Elliott, W R        | e 4, 16, 24 |\n| Falconer, T         | e 24, 18, 27 |\n| Fenwick, John       | s e 28, 18, 24 |\n| Fleury, Jno A       | n e 2, 18, 24 |\n| Fowler, Jas P       | n 28, 18, 25 |\n| Franks, Jas         | w 16, 19, 26 |\n| Franks, Wm          | s 20, 19, 26 |\n| Franks, Thos        | n 28, 19, 26 |\n| Franks, Robt        | e 16, 19, 26 |\n| Franks, Jno         | w 22, 19, 26 |\n| Finlay, Wm          | w 14, 19, 24 |\n| Fletcher, J F       | n e 30, 17, 24 |\n| Fletcher, J         | s e 30, 17, 24 |\n| Fenwick, R          | n e 28, 18, 24 |\n| *Frases, J D        | e 16, 18, 27 |\n| Fysh, O B           | n w 36, 17, 26 |\n| Fysh, Hy L          | n w 6, 16, 25 |\n| Galbraith, Robt     | w 28, 17, 25 |\n| Galbraith, W        | e 28, 17, 25 |\n| Garbut, R           | n e 22, 18, 28 |\n| Gass, C A           | e 4, 19, 26 |\n| Gee, Geo            | s w 32, 16, 24 |\n| Gee, J M            | s e 22, 16, 25 |\n| *Getty, Geo         | e 12, 18, 28 |\n| *Getty, Arch        | w 12, 18, 28 |\n| *Getty, Samuel      | n 2, 18, 28 |\n| Getty, Thos         | e 30, 17, 27 |\n| Getty, Joseph       | e 34, 17, 28 |\n| Gilford, Grant      | s w 20, 18, 24 |\n| *Gilmour, H C sr   | e 30, 18, 25 |\nWm. Grayson,\nBarrister, Advocate, Notary Public Etc.\nMOOSE JAW, N.W.T.\n\n— AGENT FOR THE —\n\nCANADA NORTH WEST LAND COMPANY, (Ltd)\nAND THE TRUSTEES OF MOOSE JAW TOWN SITE.\n\nChoice Town Lots for Sale and Improved Farms and Wild Lands.\n\nLAFFERTY & MOORE,\nBANKERS\nAND FINANCIAL AGENTS\nMOOSE JAW, N.W.T.\n\nHead Office — Calgary. Agents for the Bank of Montreal.\nBRUNSWICK HOTEL,\n\nRIVER STREET, WEST, — MOOSE JAW, N. W. T.\n\nJames Ostrander, Proprietor.\n\nFIRST CLASS ACCOMMODATION.\n\nSAMPLE and COMMERCIAL ROOMS.\nBAR IN CONNECTION.\n\nJAMES BRASS,\n\nBUILDER, CONTRACTOR,\n\nand BRICK MANUFACTURER.\n\nSASHES AND DOORS MADE TO ORDER.\n\nEstimates, Plans and Specifications Furnished.\n\nRIVER STREET, East, Moose Jaw.\n| Name                  | Location |\n|-----------------------|----------|\n| Gilmour, H Cjr        | e 6, 16, 25 |\n| Gilmour, Jas          | w 16, 18, 25 |\n| Gilmour, D            | w 32, 18, 25 |\n| Gibson, Ed            | n e 26, 17, 26 |\n| Gibson, Jas           | s e 24, 17, 26 |\n| Gibson, Jerminh       | s 30, 17, 25 |\n| Glassford, J W        | n e 10, 17, 27 |\n| Godd, Jno             | e 16, 16, 26 |\n| Goodwin, Wm           | s w 16, 12, 25 |\n| Green, F W            | s e 36, 17, 27 |\n| Green, Robt           | n 4, 17, 27 |\n| Green, Jno            | s w 4, 17, 27 |\n| Green, Henry          | n e 20, 17, 27 |\n| Green, Peter          | e 16, 17, 23 |\n| Green, S N de P       | n w 22, 19, 26 |\n| Green, Mrs E          | s w 34, 19, 26 |\n| Gilmour, W J          | n 4, 16, 25 |\n| Gilmour, Fi H         | e 12, 16, 25 |\n| Gilmour, Jas          | w 12, 16, 25 |\n| Glenn, D              | n 10, 15, 24 |\n| Glenn, J              | s 10, 15, 24 |\n| Godson, Jno           | n 24, 18, 23 |\n| Gray, R J             | n e 26, 18, 26 |\n| Gray, Geo             | s o 30, 16, 25 |\n| Gray, Thos            | s e 34, 18, 26 |\n| Griffith, Isaac       | w 36, 17, 28 |\n| Grayson, A K          | n 24, 17, 26 |\n| Grayson, J H          | e 14, 17, 26 |\n| Grayson, M            | e 22, 17, 26 |\n| Glover, W J           | n w 22, 18, 26 |\n| Glover, J B           | n e 22, 18, 26 |\n| Halliday, W           | s w 36, 17, 26 |\n| Hans, Wm              | w 28, 17, 28 |\n| Hans, Jno             | e 12, 18, 29 |\n| Hannah, Wm            | n e 26, 16, 26 |\n| Harvey, Chesley       | w 18, 16, 27 |\n| Haggerty, Andrew      | w 15, 18, 24 |\n| Harrison, Thos        | e 14, 19, 24 |\n| Harris, Nat           | n e 36, 17, 27 |\n| Harris, Ed            | s w 24, 17, 27 |\n| Hawkins, Fred C       | n e 26, 17, 28 |\n| Hawkes, Mrs D         | s e 6, 18, 28 |\n| Hawkes, Ed            | n e 6, 18, 28 |\n| Hawkes, Jas W         | n w 6, 18, 28 |\n| Henderson, Richard    | s w 34, 17, 27 |\n| Henderson, T J        | n 6, 17, 27 |\n| Heath, Ed J           | e 10, 18, 27 |\n| Heath, Hy T           | n e 4, 18, 27 |\n| Healey, Thos          | w 34, 16, 26 |\n| Herron, C             | w 16, 18, 28 |\n| Herron, Wm A          | s w 22, 17, 27 |\n| Herler, F G           | n w 10, 17, 25 |\n| Hill, Jte A           | s w 18, 17, 27 |\n| Holbrook, S J         | w 30, 16, 25 |\n| Holdsworth, E A       | n 10, 16, 27 |\n| Hoop, Robt T          | w 28, 17, 26 |\n| Hopkins               | n 30, 16, 27 |\n| Humber, Jno           | s w 6, 18, 28 |\n| Hudson, Stephen       | s e 18, 18, 26 |\n| Hudson, Peter         | n e 18, 18, 26 |\n| Hutchison, Hy         | e 36, 16, 25 |\n| Hubbard, A S          | n 4, 18, 28 |\n| Hurlbert, Jno         | s w 4, 18, 28 |\n| Hurlbert, H A         | s e 4, 18, 28 |\n| Hurlbert, C H         | n e 36, 17, 29 |\n| Hunsicker, Hy         | s w 4, 15, 25 |\n| Ivor, H A             | s w 6, 16, 25 |\n| Ireland, Mrs M        | n w 24, 16, 25 |\n| Ince, R               | s e 34, 18, 26 |\n| Irwin, Robt           | e 36, 17, 24 |\n| Irwin, J              | s w 36, 17, 24 |\n| Irwin, C              | s e 2, 18, 24 |\n| Jefford, Arthias      | w 30, 18, 24 |\n| Johns, Henry          | e 18, 15, 24 |\n| Jones, Robt           | e 18, 17, 27 |\n| Johnstone, M          | e 10, 17, 28 |\n| Kent, G W             | s e 36, 15, 26 |\n| Keyes, Joseph         | s w 10, 18, 23 |\n| Keyes, Geo            | s e 12, 17, 27 |\n| Killough, J A         | w 4, 18, 23 |\n| Kent, E P             | n e 6, 16, 25 |\n| Kells, Robt           | s 14, 17, 27 |\n| Kerr, E J             | w 32, 18, 26 |\n| King, Lawrence        | s 2, 19, 27 |\n| King, L B             | n 2, 19, 27 |\n| Kimpel, Jno           | n e 26, 16, 28 |\n| Latham, Jno           | w 30, 17, 27 |\n| Latham, Frank         | s e 36, 17, 28 |\n| Name                  | Location | Phone Numbers |\n|-----------------------|----------|---------------|\n| Latham, Mrs M         | w        | 19, 17, 27    |\n| Lamb, Geo             | w e      | 36, 17, 27    |\n| Lamb, Chas            | n e      | 22, 20, 27    |\n| Laird, Geo            | s e      | 18, 16, 25    |\n| Laud, Jas             | s w      | 18, 16, 25    |\n| Langford, C           | w        | 34, 15, 24    |\n| Langford, C W         | w        | 14, 17, 26    |\n| Lanyon, F             | s w      | 28, 18, 24    |\n| Larson, N A          |          | 32, 18, 26    |\n| Ledingham, Wm         | s e      | 10, 17, 27    |\n| Lewis, Wm             |          | 30, 15, 25    |\n| Lewis, F W            | w        | 12, 18, 29    |\n| Lowe, Phineas         | n e      | 28, 17, 26    |\n| Lowe, Ed              | s        | 12, 18, 24    |\n| Lyons, O C            | s        | 24, 18, 26    |\n| Lyons, H L            | s w      | 26, 17, 28    |\n| Lyons, O G            | s e      | 16, 17, 28    |\n| Malloch, D            | e        | 14, 15, 25    |\n| Malloch, J            | w        | 22, 15, 25    |\n| Malloch, P            | e        | 22, 15, 25    |\n| Manning, M            | e        | 10, 18, 27    |\n| Marcellus, A H        | s e      | 16, 20, 27    |\n| Marcellus, W H        | s w      | 22, 20, 27    |\n| Manley, Hy            | s e      | 20, 15, 24    |\n| Marple, Alex          | w        | 30, 18, 25    |\n| Mason, H. L           | w        | 14, 18, 24    |\n| Mawhinny, Robt W      | w        | 18, 16, 24    |\n| Mawson, And           | n        | 6, 15, 25     |\n| *Might, S H           | s        | 18, 17, 25    |\n| *Might, Geo           | s        | 18, 17, 25    |\n| Miller, R O           | w        | 20, 17, 26    |\n| Miller, Mrs J (estate)| s w      | 32, 16, 25    |\n| Mills, Geo            | n e      | 20, 19, 26    |\n| Moffat, Jno           | n w      | 22, 18, 25    |\n| Moffat, Jno           | e        | 22, 18, 25    |\n| Moffat, Wm            | s        | 28, 18, 25    |\n| *Moore, Robt          | n        | 6, 20, 25     |\n| Moore, Geo            | s        | 6, 20, 26     |\n| Murrelle, Phineas     | w        | 32, 17, 25    |\n| Murdochison, M        | n w      | 6, 18, 25     |\n| Murphy, Wm            | e        | 22, 16, 27    |\n| Murphy, Arthur        | n e      | 14, 16, 27    |\n| McLaren, L            | s w      | 14, 15, 25    |\n| McPherson, A          | s        | 2, 21, 27     |\n| McKeown, Andrew       | n        | 34, 17, 28    |\n| McBride, Robt         | e        | 18, 18, 28    |\n| McBride, R J          | w        | 18, 18, 28    |\n| MacDougald, Jno       |          | 17, 16, 26    |\n| *McBain, Donald       | e        | 22, 18, 27    |\n| McCaskill, F A        | s        | 6, 18, 25     |\n| McCaskill, Peter      | n e      | 6, 18, 25     |\n| *McCarroll; J V       | e        | 32, 19, 25    |\n| McCartney, R          | n        | 7, 19, 25     |\n| *McCarter, Wm         | n        | 18, 16, 25    |\n| *McCartney, Jas       | s e      | 12, 19, 26    |\n| McCartney, Geo        | e        | 10, 19, 26    |\n| McCartney, Hugh       |          | 24, 19, 26    |\n| McCague, M J          | w        | 32, 19, 26    |\n| McCague, D S          |          | 30, 19, 26    |\n| McCoy, Jas sr         | n        | 12, 18, 26    |\n| McCoy, Jas jr         | s        | 2, 19, 25     |\n| McCarthy, Richard     | n        | 24, 18, 26    |\n| *McConnell, Jas       | s        | 4, 18, 26     |\n| McDonald, Wm          |          | 30, 17, 26    |\n| McDonald, Hugh D      | s w      | 12, 16, 27    |\n| McDonald, A           | w        | 4, 16, 25     |\n| *McDonald, Austin     | s        | 20, 16, 26    |\n| McDougall, Wm         | e        | 18, 20, 26    |\n| McDougall, D C        | s e      | 24, 20, 27    |\n| McFetridge, Samuel    | w        | 18, 28, 26    |\n| McGillavry, Donald    | e        | 2, 27, 26     |\n| McIntosh, J W (J P)   | s e      | 32, 17, 27    |\n| McInnis, Jno          |          | 12, 16, 27    |\n| McKenzie, A B         | n        | 20, 16, 26    |\n| McKay, Jno            | w        | 22, 16, 26    |\n| McKay, C              | s        | 28, 16, 26    |\n| McLean, J J           | w        | 2, 17, 26     |\n| McLean, D J           | s w      | 10, 27, 26    |\n| McLean, Jas           | e        | 36, 16, 26    |\n| McLeod, Angus         | s w      | 30, 18, 27    |\n| *McLellan, Jas        | s        | 12, 17, 26    |\n| *McMilan, Jas         | s w      | 30, 15, 25    |\n| McMillan, Duncan      | w        | 34, 17, 26    |\n| McMillan, Neil        | n        | 10, 16, 25    |\n| McPherson, Alex       | w        | 20, 18, 27    |\n| McPherson, John       | e        | 20, 18, 27    |\n| McPherson, Findlay    | e        | 32, 28, 27    |\n| McWilliams, T E       | e        | 28, 12, 24    |\n| McVannell, D S        | e        | 20, 16, 25    |\n| Nash, Fred            | s        | 28, 19, 26    |\n| Nelson, Aug           | w        | 14, 16, 26    |\n| Newbury, Sam          | n e      | 24, 15, 27    |\n| Newbury, D W          | s a      | 24, 15, 27    |\n| Newbury, Geo A        | n w      | 24, 15, 27    |\n| Newbury, Jno          | s w      | 24, 15, 27    |\n| Nicholle, Chas        | e        | 36, 18, 25    |\nOTTAWA HOTEL.\n\nMOOSE JAW, N.W.T.\n\nBest Beer Cider and Cigars Always on Hand.\n\nThe only Hotel in Town having First Class Stabling in Connection\n\nH. BATES, Proprietor.\n\nJ. T. SIMPSON,\n\nLumber, Coal, Wood,\nLaths, Doors, Windows,\nOak, Maple, Ash,\nBasewood, Mouldings, Tar Felt,\nBrown Paper, Glass.\n\nCommon Sense Sash Balances $1 per Sett. Try them.\n\nClear White Pine from Ontario. Clear Red Cedar from British Columbia\n\nLIME Retail and in Car Lots.\n\nWindow and Door Frames Made to Order.\n\nAgent for Grobb's Chemical Fire Extinguisher.\n\nLife Insurance Etc., Etc.\nC. P. R. DINING HALL,\n\nMOOSE JAW, N. W. T.\n\nFIRST CLASS ACCOMMODATION FOR THE TRAVELLING PUBLIC.\n\nA. SMITH, Proprietor.\n\nFormerly of G. T. R. Dining Halls, Stratford and Toronto.\n\nH. U. ROBISON,\n\nKeeps on Hand all Kinds of Implements Suitable for Prairie Farming\n\nPATTERSON BROS. & Co's Manufacture.\n\nAlso Seed Grain and Feed Supplied. Orders by Mail Promptly Attended to.\nJames N. Ross, M.D.\n\nMoose Jaw, N.W.T.\nCITY\n\nTONSORIAL PARLOR.\n\nToilet: Requisites: and: First: Class: Brands: of: Cigars.\n\nALWAYS ON HAND.\n\nNear Post Office, Main Street, Moose Jaw.\n\nR. Hockley, Artist.\n\nR. HOOD,\n\nBOOT AND SHOE MAKER.\n\nBOOTS AND SHOES MADE TO ORDER.\n\nORDERS PROMPTLY ATTENDED TO.\n\nMain Street, Moose Jaw.\n\nH. McDougall,\n\nDEALER IN\n\nLUMBER AND BUILDING MATERIAL.\n\nOFFICE AND YARD.\n\nFairford Street, Moose Jaw.\nCANADA\n\nNORTH WEST LAND COMPANY,\n(LIMITED.)\n\nNOTICE TO FARMERS AND OTHERS!\n\nThe lands reserved for selection by this Company have all been carefully inspected and are good Agricultural Lands. For sale without cultivation or settlement restrictions. Price Lists can be seen at the offices of the various agents. The Company's shares which are now at a considerable discount, are accepted AT PAR in payment of lands.\n\nA great Part of the Lands is in CLOSELY SETTLED DISTRICTS and Near The Main Line of the Canadian Pacific Railway.\n\nTOWN SITES?\n\nThe Company offers Lots for sale at all Stations along the main line of the Canadian Pacific Railway, from Brandon west to British Columbia.\n\nMerchants, Mechanics, Tradesmen,\n\nAnd all who intend making their homes in the progressive Trade Centres of the North West, should consider the advantages of the railway towns and cities, with their conveniences of communication and prospects of rapid growth and development.\n\nMANAGING DIRECTORS:\n\nW. PEACOCK EDWARDS, W. B. SCARTH,\n14 Castle Street, 624 Main Street,\nEDINBURGH, SCOTLAND. WINNIPEG, MAN.\n\nWM. GRAYSON, AGENT, MOOSE JAW, N. W. T.\n| Name                  | Location | Pages |\n|-----------------------|----------|-------|\n| Outerbridge, T W      | n w      | 2, 19, 24 |\n| Ostrandet, Jas        | s w      | 6, 17, 25 |\n| Palmer, W D           | w        | 4, 19, 26 |\n| Patterson, Jas        | s        | 6, 20, 27 |\n| Paisley, G W          | e        | 4, 17, 28 |\n| Paxton, E H           | s        | 3, 19, 24 |\n| Phillips, Geo E       | s e      | 34, 17, 27 |\n| Picard, A             | s e      | 28, 17, 26 |\n| Polland, Jno G        | s e      | 14, 18, 24 |\n| Poiser, Jno           | w        | 4, 19, 24 |\n| Potter, A E           | e        | 28, 16, 27 |\n| Potter, G W           | w        | 2, 17, 27 |\n| Porter, Jas           | n e      | 24, 17, 28 |\n| Porter, J J           | e        | 12, 17, 28 |\n| Porter, Wm            | w        | 12, 17, 28 |\n| Poulter Wm            | s w      | 14, 19, 26 |\n| Powell, A H           | s        | 14, 18, 29 |\n| Purser, Edwin         | n w      | 22, 15, 25 |\n| Purser, E J           |          | 16, 15, 24 |\n| Pollock, W            | n e      | 34, 16, 25 |\n| Porter J H            | n w      | 6, 18, 23 |\n| Quackinbush, Ed       | s e      | 10, 17, 26 |\n| *Rathwell, Jno        | s e      | 20, 18, 28 |\n| *Rathwell, S K        | n        | 20, 17, 27 |\n| Rathwell, Wm          | s        | 24, 18, 29 |\n| Reid, J G             | e        | 10, 16, 27 |\n| Richards, ST          |          | 30, 16, 24 |\n| Richards, Wm          | e        | 24, 18, 28 |\n| Richardson, Hy        | e        | 18, 16, 26 |\n| Riddell, R H          | w        | 18, 17, 26 |\n| Riddell, Wm           | n        | 12, 19, 24 |\n| Rigden, Geo           | s e      | 14, 19, 26 |\n| Rigden, Iden          | n w      | 2, 19, 26 |\n| Rigden, Chas E        | e        | 2, 19, 26 |\n| Rorison, H U          | n e      | 26, 16, 25 |\n| Ross, Jas H           | e        | 4, 17, 26 |\n| Ross, F H             | w        | 4, 17, 26 |\n| Ross, J E             | s e      | 22, 17, 26 |\n| Ross, D M             | n w      | 14, 17, 27 |\n| Ross, G M             | s e      | 28, 17, 27 |\n| Ross, Albert R        | n e      | 32, 18, 25 |\n| Robinson, J           | e        | 12, 17, 26 |\n| Rouat, Jas            | w        | 16, 18, 25 |\n| Rouat, Jno            | e        | 16, 18, 25 |\n| Rutherford, Wm sr     | n        | 14, 17, 25 |\n| Rutherford, Jas       | w        | 22, 17, 25 |\n| Rutherford, Wm jr     | e        | 22, 17, 25 |\n| *Sanders, W C., J P   | s        | 12, 20, 27 |\n| Sanders, A J          | n        | 12, 20, 27 |\n| Sanders, W J          | e        | 2, 20, 27 |\n| Sanders, Samuel       | s e      | 14, 20, 27 |\n| *Schram, Jno          | e        | 32, 17, 25 |\n| *Shields, Jno         |          | 36, 16, 28 |\n| Shantz, J             | e        | 16, 15, 24 |\n| Sharpe, Geo           | n e      | 20, 17, 25 |\n| Seeli, R J            | e        | 4, 16, 26 |\n| Simington, Jas M      | s        | 6, 17, 20 |\n| *Smail, Jno           | e        | 6, 18, 26 |\n| Smail, Geo            | n        | 34, 19, 27 |\n| Smith, Chas           | e        | 10, 18, 26 |\n| Smith, Jas            | e        | 34, 17, 26 |\n| Smith, C F            | w        | 10, 18, 26 |\n| Smith, A H            | e        | 14, 18, 26 |\n| *Smith, Benj          | e        | 20, 17, 27 |\n| Smith, Thos           | w        | 16, 17, 26 |\n| Slemmon, Jas          | s        | 6, 27, 24 |\n| Snoddie, R            | n e      | 16, 16, 27 |\n| Stewart, R            | s        | 18, 15, 25 |\n| Saunders, S B         | n        | 36, 19, 27 |\n| Sanders, S B          | n        | 36, 19, 27 |\n| Small, Geo S          | s w      | 2, 20, 27 |\n| Stump, V E            | e        | 2, 17, 28 |\n| Smibert, Jas          | w        | 16, 16, 26 |\n| Spence, Wm            | w        | 32, 18, 27 |\n| Spence, W J           | e        | 36, 18, 27 |\n| Spaughton, Wm         | w        | 10, 16, 27 |\n| Stodders, Thos        | s        | 22, 18, 25 |\n| Stewart, Alex         | n e      | 26, 17, 27 |\n| Stevenson, Daniel     | s        | 10, 20, 27 |\n| Stephenson, E L       | w        | 30, 16, 24 |\n| Stephenson, G L       | e        | 30, 16, 24 |\n| Stephenson, A H       | e        | 20, 16, 24 |\n| Stephenson, J         | w        | 20, 16, 24 |\n| Sullivan, Michael     | e        | 34, 16, 25 |\n| Sweet, Richard        | w        | 32, 18, 25 |\n| Sylvain, Geo          | w        | 34, 18, 25 |\n| Symmons, J R          | s e      | 24, 18, 23 |\n| *Tapley, Ed           | n w      | 4, 18, 26 |\n| Name                  | Location | Pages |\n|-----------------------|----------|-------|\n| Tapley, Geo           | n e      | 4, 18, 26 |\n| Tanner, A W           | e        | 16, 18, 28 |\n| Tarrantt, Hy          | s        | 12, 18, 26 |\n| Taylor, David         | w        | 10, 19, 26 |\n| Tennant, R E          | e        | 24, 15, 24 |\n| Tennant, Ed           | w        | 24, 15, 24 |\n| Thomas, H L           | w        | 4, 16, 24 |\n| *Thomson, R K         | e        | 20, 26, 27 |\n| Thomson, Colin        | n w      | 16, 16, 27 |\n| Thompson, Jas        | w        | 2, 16, 26 |\n| Thompson, Alex        | s        | 29, 16, 26 |\n| Thompson, Jas        | w        | 18, 19, 25 |\n| Thompson, Hugh        | w        | 12, 19, 26 |\n| Thompson, J E         | e        | 6, 15, 25 |\n| Thompson, T B         | e        | 34, 17, 24 |\n| Thompson, Jno         | e        | 16, 15, 25 |\n| Thompson, Jonathan    | w        | 22, 14, 24 |\n| Townsend, T           | e        | 14, 16, 27 |\n| Trudgeon, Neil        | n        | 6, 18, 23 |\n| Trudgeon, Jas         | s        | 6, 18, 23 |\n| Tiffin, H             | n        | 10, 16, 25 |\n| Tennant, Geo          | n e      | 24, 15, 24 |\n| Tennant, Wm           | s e      | 24, 15, 24 |\n| Tiffin, Hy            | n        | 10, 16, 25 |\n| Trainer, Frank        | w        | 28, 16, 25 |\n| Tuxford, Geo          | n        | 14, 19, 26 |\n| Upex, J U             | w        | 36, 16, 25 |\n| Urton, W S            | e        | 20, 15, 26 |\n| Urton, Ed             | n w      | 20, 15, 26 |\n| Usherwood, Wm         | n        | 10, 18, 23 |\n| Usherwood, Jno        | s        | 16, 18, 23 |\n| Vance, Tupper         | w        | 22, 16, 27 |\n| Varder, Sam           | e        | 22, 18, 26 |\n| Whitehouse, Wm        | w        | 2, 17, 28 |\n| Wier, Thos            | s e      | 34, 15, 24 |\n| Wilkie, Duncan        | s        | 2, 19, 23 |\n| *Wilkie, Donald       | w        | 6, 19, 23 |\n| Wilkie, Jno           | e        | 6, 19, 23 |\n| Wilkie, Neil          | s        | 36, 18, 23 |\n| Wilkinson, Jno        | w        | 4, 19, 23 |\n| *Wilson, Alex         | w        | 16, 17, 27 |\n| Wilson, R             | s w      | 22, 17, 28 |\n| Wilson, Uriah         | n        | 14, 15, 25 |\n| Wilson, Jno           | e        | 28, 17, 28 |\n| Wilson, J R           | e        | 10, 18, 25 |\n| Wilson, Robt          | s w      | 23, 17, 25 |\n| Winn, T I             | w        | 14, 18, 27 |\n| Winn, J H             | e        | 14, 18, 27 |\n| Winn, Thos, Sr        | w        | 28, 18, 27 |\n| Winn, W S             | e        | 30, 18, 27 |\n| Waddell, Jno          | n e      | 28, 16, 26 |\n| Walsh, Wm             | w        | 14, 17, 26 |\n| Walsh, Thos           | n e      | 10, 17, 26 |\n| Waller, P             | e        | 32, 18, 26 |\n| Wallace, Mrs J        | s w      | 4, 16, 27 |\n| Westman, J C          | n e      | 12, 25, 26 |\n| Westman, D            | n w      | 12, 15, 26 |\n| Westman, A E          | s e      | 12, 15, 26 |\n| Wilson, Alex          | n w      | 18, 15, 25 |\n| Wilson, Jno           | n e      | 18, 15, 25 |\n| *Watson, Wm           | s        | 2, 18, 27 |\n| *Watson, Angus        | n        | 2, 18, 27 |\n| Watson, T D           | n        | 18, 17, 27 |\n| Watson, Jas           | w        | 30, 16, 26 |\n| Watson, Jno           | e        | 24, 16, 27 |\n| Watson, David, Rev    | n w      | 2, 18, 24 |\n| Waters, Moses         | e        | 12, 16, 26 |\n| Webb, Thos            | e        | 20, 18, 26 |\n| *Welsh; Ed B          | w        | 28, 18, 26 |\n| Welsh, R A            | e        | 28, 18, 26 |\n| White, Chas           | w        | 36, 16, 25 |\n| White, W W            |          | 24, 18, 23 |\n| White, C E            |          | 36, 15, 24 |\n| White C B             |          | 36, 15, 24 |\n| Woolman, T W          | n e      | 2, 17, 25 |\n| Williams, Geo         |          | 10, 17, 28 |\n| Wrong, W J            | e        | 30, 16, 26 |\n| Wright, G P           | n w      | 18, 17, 25 |\n| Yates, Williard       | n w      | 32, 17, 28 |\n| Yerxa, O B            | n e      | 20, 17, 26 |\n| Young, Jos            | e        | 16, 18, 24 |\n| Young, Jno            | s        | 22, 18, 24 |\n| Young, Geo            | n        | 32, 18, 24 |\n| Young, W J            | n w      | 22, 18, 24 |\n| *Young, Chas A        | n e      | 26, 16, 27 |\n| Young, Fred H         | w        | 28, 17, 29 |\n\n**THE \"TIMES.\"**\n\nSubscription — $1.50 a Year If Paid in Advance.\n\nAddress—The Times, Moose Jaw, N.W.T.\nThe Town of Moose Jaw.\n\nThe Town of Moose Jaw is situated on the Main Line of the C.P.R., 398 miles west of Winnipeg. It is centrally located on Sections 32 and 33, Township 17, Range 26 west of the Second Principal Meridian, and is the distributing point for the entire district of Moose Jaw. Situated in a valley surrounded by a noble rampart of hills rising to a height of from 150 to 200 feet, the site is one of the finest along the entire line of the C.P.R. The Moose Jaw river flows through the town in a north-easterly direction, and is joined by Thunder Creek, flowing from the west. The population in 1890 is about 1009, and the assessed value of the real and personal property is over $300,000. It is a divisional point on the Canadian Pacific Railway, has a large and well equipped round house, with stalls for eleven engines, and repair shops with a full staff of employees. The Divisional Superintendent offices are located here, with the Divisional Train Despatchers' office. Every kind of business necessary for the country is carried on in Moose Jaw, and the wants of the settlers in every line can be supplied. Competition in every line of trade is keen. There are six General Stores with large, well assorted stocks, one Drug and Stationery store, two Shoe shops, two Tinsmiths, one Furniture store, two Confectionary stores, five Hotels, three Livery and Sale stables, two Butcher shops, two Bakeries, two Lumber yards, Carpenter shops, one Millinery store, two Tailor shops, two barber shops, one Jewellery store, one Printing office, two Lawyers, one Bank and a resident Doctor. For more elaborate accounts of which we direct attention to the advertising pages and business directory of this book. As a corporation the Town of Moose Jaw has not a cent of debt, and the last financial statement of the town showed a balance in the Town Treasury of over $1,000.\n\nEducational Advantages.\n\nA large brick school building, the finest in the North West Territories, was erected in 1889, at a cost of $7,000. At the beginning of the present year, 1890, a High School Department was opened in the school, and the Moose Jaw school registered as a Union School, under the Ordinance. Mr. Wm. Rothwell, a graduate of Toronto University, was engaged as Principal teacher, with Miss Ida McMillan, the former principal, and Miss Willa Simpson as first and second assistants respectively. The school has been equipped with new desks and seats, maps, library, and all other appliances necessary for successful teaching. Moose Jaw can now offer educational advantages to the children both of the town and district, who are desirous of pursuing their studies beyond the Public School course, which are unsurpassed by any town of its size in Canada. A cut of the new school building will be found on one of the pages of this directory.\nter by Catholic Church in Meva's Range\nerecting” as a common Church, present Church is denominating above voters of active\n\nErected, 1869.\n\nMoose Jaw Community Church\n\nC. H. Gudliff, s, which were n It early in was count point. In 1832 messrs., The elected Messrs Messrs. The first Mr. R has been very almost regular and the great 1834 when Moose Jaw Chairman Corps squad at leader in town dwarinish but not so close and from District Ball was the\nReligious Advantages.\n\nThe religious wants of the town of Moose Jaw, are well looked after by pastors of the Episcopal, Presbyterian, Methodist and Roman Catholic Churches. The Salvation Army have nightly services in their barracks. St. John the Baptist Church, (Episcopal,) is a neat concrete building, erected in 1888, at a cost of $1,500, on River street east, with the \"vicarage\" adjoining it. The Methodist Church is a neat frame structure, with a comfortable parsonage adjoining, on High street east. The Presbyterian Church on Main Street is a substantial wooden building, lately removed to its present site, and given a thorough course of repair. The Roman Catholic Church is a neat little frame building on Manitoba street east. The Baptist denomination have acquired a building site in the town, and are talking of erecting a place of worship at an early date. Services are held in all the above Churches, as per Cards in another page of this Directory. The pastors of the Churches of Moose Jaw are Earnest, Cultured Men, and are always active in looking after the religious interest of the people in their charge.\n\nHistory and Progress.\n\nThe Town of Moose Jaw received its name from two Indian words, which mean \"The place where the white man mended his cart with the Jaw of a Moose.\" The first settlers squatted on the site of the present town, early in 1882, in advance of the construction of the C. P. R. which reached this point in the fall of that year, but the inhabitants chiefly \"dwelt in tents.\" In 1883 the foundations of the future city were laid and the town incorporated. The first election was held February 11th, 1884. Mr. John E. Ross was elected the first Mayor, defeating his opponent Mr. Alexander, after a very exciting election by a majority of one. The first Councillors elect were:—Messrs. T. B. Baker, J. T. Simpson, O. H. Allen, G. Gagen, D. McLean. The first meeting of the Council elect was held on February 13th, 1884, and Mr. R. L. Alexander appointed Clerk and Treasurer. Mr. J. G. Gordon was appointed Town Solicitor, Messrs. D. McQueen and Wm. Goodwin Assessors. In the years 1883 and 1884 the progress of the town of Moose Jaw was very rapid. Settlers were pouring into the district, and the town had a regular go-ahead western \"boom.\" Real Estate went up to fictitious prices, and the streets of our little town resembled those of Winnipeg in the days of the great \"boom\" of 1881. The natural result followed and in the fall of 1884 the reaction set in, and the collapse came. During the rebellion of 1885, Moose Jaw was one of the distributing points for the Government supplies and during that summer, it had quite a military air. A hospital with Medical Corps was established here, and several of the eastern batteries left the railroad at Moose Jaw to proceed to the seat of war. A Home Guard under the leadership of Captain Rorison was organized for the protection of the town, but fortunately their services were not required for that purpose. At the close of the rebellion Louis Riel the leader was brought to Moose Jaw and from this place taken to Regina. The Moose Jaw Protestant Public School District No 1, in the North West Territories, was organized in 1884, and was the\nfirst School District organized under the School Ordinance in the Territories. Since that year a good school has been in active operation in the town. In 1883 a weekly newspaper, the \"News\" was started, with Mr. J. E. Wells as Editor, but passed away with the boom. Low water mark was reached in the town of Moose Jaw in 1886. The dry season of that year causing a total failure of the crops in the district, which caused a corresponding depression in the business of the town. —The spring of 1887 opened up in a manner which gave the people of the town and district renewed hope, which fortunately was realized in an abundant crop of grain in the district, and the town again started on a career of prosperity which has continued until the present time. Situated as it is in the centre of a district, rich in Agricultural, Grazing and Mineral resources, which are rapidly being developed, with the trade of a large extent of country tributary to it, the town of Moose Jaw will continue to grow and flourish. The town has an active Board of Trade, which is keenly alive to everything affecting the welfare of the town. A list of the Municipal Officers of the town since its incorporation, officers of Board of Trade, Agricultural Society, Secret and Benevolent Societies is given in other pages of this book. We also give an alphabetical directory of the town of Moose Jaw.\n\n1883. : ESTABLISHED : 1883.\n\nE. A. BAKER & CO.,\n\nWholesale and Retail Dealers in—\n\nHARDWARE, TINWARE, GLASS, PAINT,\n\nOils, Etc.,\n\nSTAPLE AND FANCY GROCERIES,\n\nPROVISIONS, FLOUR, OATMEAL Etc.\n\nGrains and Provisions of all Descriptions Bought and Sold.\n\nNow on hand—SEED WHEAT, OATS, (black and white,)\nBARLEY, PEAS,\nFLAX SEED.\n\nChopped Feed Bran and Shorts Always on hand.\n\nSettlers will find it to their advantage to Call and see us MAIN STREET—East.\nTown Directory\n\nAbbey Lewis, C P R Engineer\nAdams, H., Lay-reader\nAlexander, R., L., Gov-Im., Agent, and J. P.\nAnderson, Alf., C. P. R. employee.\nAnnable, G M., horse & cattle dealer.\nAnnable, J E., Merchant\nAnnable, H F., farmer.\nBabb, Miss Adela, Teacher.\nBattell, A C., farmer.\nBattell, J E., horse dealer\nBattell, H., gentleman.\nBaker, T B., merchant.\nBaker, Archie, C P R fireman.\nBates, Henry, farmer.\nBate, Harry, butcher\nBate, Joel, farmer\nBaxter, R., teamster\nBarrett, W T., C P R Mail Clerk.\nBurton, Alex., N W M P\nBellamy, John, builder\nBedford, Hy., engineer\nBird, Mrs. cook\nBurbeck; T E., C P R Clerk\nBlackburn, Geo., brakeman\nBlackhall, Jno., laborer\nBole, W W., druggist.\nBogue, R., merchant\nBoan, Hy., laborer.\nBrown, Rev W E., B A\nBrown, R J., brakeman\nBrass, Jas., contractor\nBrass, Wm., carpenter\nBrass, Jno., tin-smith\nBradshaw, W J., carpenter\nBudd, Geo., conductor\nBuxton, Joe, C P R employee\nBumphrey, Jno., farmer\nBurton, Wm., conductor\nCameron, J A., Ass't., Sup't C P R\nCameron, Chas C., tailor.\nCameron, Robt, laborer\nCampbell, W R., tin-smith\nCarter, H W., barber\nCard, H B., brakeman\nGarther, Jno., C P R employee\nChalmers, J G., merchant\nChanin W G., Baker\nCline, Mrs J., Widow\nCline, Jas., brakeman\nClark, Thos., clerk\nClarke, Miss E., milliner\nColpitts, Enoch, dairyman\nCooper, Ed., laborer\nCooney, W J., teamster\nCowan, Thos., brakeman\nCowan, Mrs T., Widow\nCumpton, C B., Chief train Dispat'r.\nCurrie, Dougald, laborer\nDavidson, Alex., blacksmith.\nDaley, Andrew, C P R engineer.\nDickinson, J H., carpenter.\nDowns, Wm., laborer.\nEdweldis, Wm.\nElderkin, A., conductor.\nFalconer, farmer.\nFerguson, Hugh, hotel keeper.\nFields; Octavius, saloon keeper.\nFindlay, Wm., C P R employee.\nRoy, Wm., capt. S A.\nFrancis, Geo., laborer.\nFraser, Chas., C P R employee.\nFranks, Jno., C P R employee.\nFysh, O B., carriage builder.\nGarnham, Fred., brakeman.\nGass, O A., Postmaster.\nGlassford, J W., farmer.\nGordon, J G., barrister.\nGowdy, Wm., farmer.\nGowdy, John, farmer.\nGrayson, Wm., barrister.\nGraham, R.\nGreen, F W., thresher.\nGreen, S N de P, J P.\nGregory, Geo, C P R employee.\nGrierson, Jas, fireman.\nGurney, Ed, C P R employee.\nHammond, J B, locomotive foreman.\nHannah, Wm, C P R turner.\nHannah, T J, C P R employee.\nHardie, R H, fireman.\nHawkins, Jno, C P R employee.\nHenselwood, Jno, Ass. Sup. bridges.\nHealey, Thos, restaurant.\nHealy, F G, confectioner.\nHealey, Hy, clerk.\nHerller, F G, bricklayer.\nHaskett, Wm J, N W M P.\nHalliday, A, C P R employee.\nHicks, Amos, mail clerk.\nHinchy, R, fireman.\nHockley, R, barber.\nHoldsworth, G E, car repairer.\nHoldsworth, Ed, laborer.\nHoldsworth, Arthur, brakeman.\nHolbrook, S J, veterinary surgeon.\nHolmes, W J, watchmaker.\nHood, Robt, shoemaker.\nHood, Jas, shoemaker.\nHubbell, H G, conductor.\nHughson, Isaac, C P R employee.\nHyghland, Joseph, fireman.\n\nIvor, W A, gentleman.\nJackson, J T, livery keeper.\nJackson, Jethro, fireman.\nJackman, Hy hotel keeper.\nKerr, J E, clerk.\nKammer, J K, train dispatcher.\nKenny, Jno, mail clerk.\n\nLaw, W J, tailor.\nLeary, Con, engineer.\nLewis, Isaac, C P R employee.\nLillis, M, roadmaster.\nLittlefield, Sergt. N W M P.\nLowe, Robt H; section foreman.\n\nMartin, Robt, clerk\nMair, Jas, brakeman\nMair, John, saloon keeper\nMawson, Jno, farmer\nMark, Percy, C P R employee.\nMellar, Frank, painter\nMiller, H E, conductor\nMoore, D, engineer\nMoulding, Chas, fireman\nMorrison, Dan, brakeman\nMurphy, Pat, brakeman\nMcAuley, Wm, watchmaker\nMcBride, M, merchant\nMcCloud, Dan, C P R employee\nMcCaskill, F H, stone mason\nMcCaskill, Peter, clerk\nMcDonald, Jas N, editor of TIMES\nMcDonald, F H, post office clerk\nMcDonagh, Jno, laborer\nMcDougall, Hugh, lumber dealer\nMacDougall, Miss Jessie, nurse\nMcDowell, Hy, C P R employee\nMcGinnis, Jno, farmer\nMcGill, T J, Lieut. Salvation Army\nMcKinzie, A B, farmer\nMcLeod, Mrs M, nurse\nMcLeod, Newton, C P R employee\nMcLeod, Jno, engineer\nMcLean, Rev. J, P H D\nMcLean, Dan, engineer\nMcMillan, Dan, harness maker\nMcMillan, Jno, farmer\nMcMillan, Miss Ida, teacher\nMcNeil, John, C P R employee\nMcNaught, E, laborer\nMcNaught, Geo, laborer\nMcPhail, W A, saloon keeper\nMcTaggart, Jno, section foreman\nMcWilliams, T E, farmer\n\nNaismith, Jno, engineer\nNeelands, W W, C P R Storekeeper\nOstrander, Jas, hotel keeper\nPalfrey, Chas, fireman.\nPalmer, W D, C P R employee.\nPatterson, Wm, Laborer.\nPascoe, Wm, engineer.\nPlante, Felix, merchant.\nPorter, J C, blacksmith.\nPorter, W A, mail clerk.\nO. B. FYSH,\nAuctioneer, Valuator and Implement Agent.\n\nSales of Live Stock will Receive Prompt Attention.\n\nOffice High Street: Moose Jaw.\n\nEXCELSIOR SHAVING PARLOR.\n\nTOILET ARTICLES and\n\nCHOICEST BRANDS of CIGARS,\n\nAlways on Hand.\n\nH. CARTER, Proprietor.\n\nFirst Door South of the Queen's Hotel. Main Street.\n\nCENTRAL BLACKSMITH SHOP.\n\nHORSE-SHOEING and PLOW POINTS,\n\nA SPECIALTY,\n\nAll Branches of Repairing Done with Neatness and Dispatch.\n\nA. DAVIDSON, Proprietor.\n\nSHOP—High Street. West of Main.\nALEX. WILSON,\n\nGENERAL BLACKSMITH and\n\nCARRIAGE MAKER.\n\nHorse Shoeing and Plow Repairing a Specialty.\n\nHIGH STREET—WEST.\n\nW. R. CAMPBELL,\n\n—Dealer in—\n\nHARDWARE, STOVES and TINWARE,\n\nCUTTLERY, NAILS, POWDER,\n\nPAINTS, OILS, Etc.\n\nAll Kinds of Work Done to Order.\n\nCorner Main and High Streets\n\nMoose Jaw.\n| Name          | Occupation                        |\n|---------------|-----------------------------------|\n| Porter, J J   | farmer                           |\n| Porter, Nat   | clerk                            |\n| Potter, A E   | implement agent                  |\n| Prosser, A    | brakeman                         |\n| Riddell, R H  | Farmer                           |\n| Riddell, Wm   | rancher                          |\n| Rigden, Geo   | C P R employee                   |\n| Ross, J H     | M L A                            |\n| Ross, J E     | J P, farmer                      |\n| Ross, D M     | farmer                           |\n| Robinson, T W | merchant                         |\n| Rorison, H U  | grain merchant                   |\n| Rothwell, Wm  | teacher                          |\n| Rothwell, B E | printer                          |\n| Roundt, Wm    | conductor                        |\n| Rutherford, J R| operator                        |\n| Scarth, M B   | C P R clerk                      |\n| Scott, Geo    | gentleman                        |\n| Seal, Wm      | janitor                          |\n| Sharpe, Alex  | C P R employee                   |\n| Shields, Jno  | C P R employee                   |\n| Sherlock, G L | station agent                    |\n| Simington, J M| baker                            |\n| Simpson, J T  | lumber dealer                    |\n| Simpson, Miss W| teacher                        |\n| Simpson, Miss L| teacher                        |\n| Smith, Thos   | saloon keeper                    |\n| Smith, Chas   | clerk                            |\n| Snale, laborer|                                |\n| Smeaton, Jas  | fireman                          |\n| Snoddie, Robt |                                |\n| Spaughton, Wm | boiler maker                     |\n| Targett, Hy   | farmer                           |\n| Tupley, Geo   | C P R employee                   |\n| Taylor, Rev S J| B A.                          |\n| Taylor, Jas   | conductor                        |\n| Tebo, M       | gentleman                        |\n| Thompson, Jno | clerk                            |\n| Tillen, Mrs   | baker                            |\n| Timmons, R W  | blacksmith                       |\n| Townsend, Tim | brewer                           |\n| Trent, Wm     | clerk                            |\n| Trainer, Frank| teamster                         |\n| Turnbull, A R | M D                             |\n| Union, Chas   | C P R employee                   |\n| Upex, Jno U   | C P R employee                   |\n| Urton, W S    | freight agent                    |\n| Vance, Tupper | brakeman                         |\n| Waddell, Jno  | brakeman                         |\n| Walsh, Wm     | livery keeper                    |\n| Walsh, Thos   | farmer                           |\n| Waller, Pierce| C P R employee                  |\n| Wallace, Jno  | C P R employee                   |\n| Walker, H     | Band Master                      |\n| Watkins, Jno  | Printer                          |\n| Westwood, A   | C P R employee                   |\n| Wheeler Sager | C P R employee                   |\n| Wilcox, Albert| train despatcher                |\n| Wilson, Russell| Waterman                       |\n| Wilson, Jas   | C P R employee                   |\n| Wilson, Jas R | fireman                          |\n| Withrow, Thos L| blacksmith                     |\n| Wolfe, Geo    | laborer                          |\n| Wright, Tios  | C P R engineer                   |\n| Wright, Alf   | butcher                          |\n| Wright, W R   | C P R employee                   |\n\nCHAS. C. CAMERON,\nMERCHANT TAILOR.\n\nTWEEDS : SERGES : and : FANCY : SUITINGS,\nAlways on Hand.\n\nPERFECT FIT GUARANTEED.\nMain Street, Moose Jaw.\nJAS. McCauley,\nWATCHMAKER & JEWELLER,\n\nWatches, Clocks, Jewellery and Silver Ware in Latest Designs, Always in Stock.\n\nS. J. Holbrook,\nVETERINARY SURGEON,\n\nDISEASES of HORSES and CATTLE Skilfully Treated.\n\nCASTORATING A SPECIALTY.\n\nWM. Walsh,\nLivery, Feed and Sale Stables,\n\nHORSES, PONIES and CATTLE for SALE.\n\nFIRST-CLASS RIGS and HORSES for HIRE.\n\nBailed HAY Always Hand.\nSOCIETIES.\n\nMoose Jaw Lodge No. 26, A.F. & A.M., G.R.M.\n\nMeets in Masonic Hall, Main St., on second Tuesday in each month, at 20 o'clock. Visiting brethren cordially welcome.\n\nR. H. Lowe, Seymour Green, W. M., Secy.\n\nValley Lodge No. 1, I.O.O.F.\n\nMeets in Masonic Hall, Main St., every Tuesday evening at 20 o'clock. Visiting brethren welcome.\n\nO. B. Fysh, Ins. Mair, N.G., Secy.\n\nWestern Hope No. 1542, L.O.L.\n\nMeets in Masonic Hall, Main St., on Monday, on or before the full moon.\n\nR. L. Alexander, C. A. Gass, W. M., Secy.\n\nCourt Moose Jaw I.O.F., No. 509,\n\nMeets in Masonic Hall, Main St., every first and third Monday in each month, at 20 o'clock.\n\nR. Hockley, J. Thompson, Chief Ranger, Rec.Secy.\n\nCHURCHES.\n\nMethodist Church, High Street.\n\nRev. John McLean, M.A., Ph.D., Pastor. Services every Sunday at 11 and 19 o'clock. Sunday School at 14.30, J.E. Annable Supt. Prayer Meeting Thursday evening at 19.30. All seats free.\n\nPresbyterian Church, Main Street.\n\nRev. S.J. Taylor, B.A., Pastor. Services every Sunday at 11 and 19 o'clock. Sunday School at 14.30 o'clock, Wm. Rothwell Supt. Prayer Meeting Thursday evening at 20 o'clock. All seats free.\n\nSt. John the Baptist Church, (Episcopal,) River Street.\n\nRev. W.E. Brown, B.A., Incumbent. Services every Sunday at 11 and 19 o'clock. Sunday School at 14. The Pastor Supt Seats free.\n\nRoman Catholic Church, Manitoba Street.\n\nRev. Father Montreuil, Pastor. Services every fourth Sunday in each month. Sunday School at 14 o'clock.\nMunicipal Officers\n\nOf the Town of Moose Jaw, Incorporated 1884.\n\nCOUNCIL MEETINGS EVERY SECOND MONDAY.\n\n1884—Mayor, J. E. Ross. Councillors—T. B. Baker, J. T. Simpson, D. McLean, Geo Gagen, R. L. Alexander, town clerk and treasurer.\n\n1885—Mayor, Richard Bogue. Councillors—O. H. Allan, O. B. Fysh, H. W. Morphy, W. Nichol, R. L. Alexander, town clerk and treasurer.\n\n1886—Mayor, J. G. Gordon. Councillors, J. W. Bradshaw, Wm. Walsh, E. Colpitts, H. U. Rorison.\n\n1887—Mayor, J. G. Gordon. Councillors—O. H. Allen, Wm. Walsh, D. McLean, J. Bellamy.\n\n1888—Mayor, Richard Bogue. Councillors—J. A. Whitmore, H. Bates, J. Bellamy, A. B. McKenzie, W. A. Porter, W. R. Campbell. H. McDougall, town clerk and treasurer.\n\n1889—Mayor, J. T. Simpson. Councillors—Jas Brass, J. W. Bradshaw, F. H. McCaskill, Jas Ostrander, A. E. Potter, J. Rutherford. J. N. McDonald, town clerk. H. McDougall, treasurer.\n\n1890—Mayor, J. T. Simpson. Councillors—J Rutherford, A. E. Potter; W. W. Neelands, H. H. Lowe, G. M. Annable, J. E. Battell. J N. McDonald, town clerk; H. McDougall, treasurer; R. L. Alexander, assessor; T. E. Birbeck, J. E. Annable, auditors; H. Walker, town Constable, License, Health and Street Inspector, etc.\n\n---\n\nMoose Jaw School Board\n\nMeets every alternate Friday evening in the School Room.\n\nWm. Hannah, Chairman.\nH. McDougall, A. R. Turnbull,\nT. W. Robinson, J. N. McDonald:\nWm. Grayson, Secy.-Treas.\n\nTeachers.\n\nWm. Rothwell, B. A.,\nPrincipal of Union School.\nMiss Ida McMillan, Miss Willa Simpson;\n1st Assistant Teacher. 2nd Assistant Teacher.\nMAIN ST. STOVE DEPOT.\n\n— Call and See our stock of —\n\nBurrows, Stewart and Milne's Celebrated STOVES.\n\nAll kinds of Cooking and Heating Furnaces.\n\nEave-troughing and roofing a Specialty.\n\nJNO. BRASS,\nMoose Jaw, Main Street.\n\nF. G. HEALEY,\n\n— Dealer In —\n\nFRUIT, CONFECTIONERY and CIGARS.\n\nChoice Brands Cigars always on hand. Terms—Cash\n\nJ. G. REID,\n\n—DEALER IN—\n\nHORSES & CATTLE,\nand General Rancher.\n\nEast ½ Sec. 10, 16, 27.\nMoose Jaw.\nJ. G. BEESLEY,\nBRICK AND STONE MASON,\n\nEstimates, Plans and Specifications Furnished.\n\nAll work guaranteed.\n\nMARLBOROUGH P.O.\n\nSec. 22, 18, 27.\n\nBENJAMIN SMITH,\nSTOCK BREEDER,\n\nHas FOR SALE some fine Clydesdale Brood Mares.\nA thoroughbred Durham Bull for Service.\n\nEast ½ Sec. 20, 17, 27.\n\nJAS. McCLELLAND,\nPlasterer,\n\nPlaster of Paris Ornaments always on Hand.\n\nCentre Flowers, Brackets, Trusses Etc.\n\nOrders in Town or Country Promptly attended to.\nMoose Jaw Agricultural Society.\n\n(ORGANIZED—1834.)\n\nOFFICERS FOR 1890.\n\nBENJ. SMITH, President.\nH. C. GILMOUR, 2nd Vice-Pres.\nJ. E. ANNABLE, Treasurer.\n\nH. DORRELL, 1st Vice-Pres.\nJ. N. MCDONALD, Secy.\n\nJ. G. GORDON,\nWM. ROTHWELL,\n\nAuditors.\n\nDIRECTORS:\n\nJ. E. BATTLELL, ROBT. MOORE, HUGH GILMOUR,\nG. M. ANNABLE, JOS. YOUNG, S. K. RATHWELL,\nJAS. CAMPBELL, O. B. FYSH, J. G. BEESLEY,\nE. N. HOPKINS, WM. GRAYSON.\n\nANNABLE & CO.,\n—Dealer In—\n\nDry Goods, Ready-Made Clothing Boots and Shoes,\nGROCERIES.\n\nSPECIAL ATTENTION PAID TO FURNISHING SETTLERS WITH\nOUTFITS.\n\nWE'LL NOT BE UNDERSOLD.\n\nMain Street : : : : : : : : Moose Jaw.\nMoose Jaw Board of Trade.\n\nT. B. BAKER, President. J. N. McDONALD, Secretary.\n\nThe above Board was organized in 1889, under a charter from the Dominion Government and is composed of all the representative business men of the town.\n\nMoose Jaw Rifle Association,\n\n(ORGANIZED 1889.)\n\nG. L. SHERLOCK, President. G. HOLDSWORTH, Vice-President.\nW. S. URTON, Sec'y, Treas.\n\nMoose Jaw Cemetery Company,\n\n(INCORPORATED 1890.)\n\nDIRECTORS:\n\nT. W. ROBINSON, J. E. ANNABLE;\nT. E. McWILLIAMS, R. H. RIDDELL,\nH. McDOUGALL.\n\nBoard of Education.\n\nPROTESTANT SECTION.\n\nRIGHT REV. W. C. PINKHAM, D. D.,\nBishop of Calgary, Chairman.\nHON. E. L. WHETMORE, Moosomin.\nREV. S. J. TAYLOR, B. A., Moose Jaw.\nREV. JOHN McLEAN, M. A., Ph.D., Moose Jaw.\nJOHN SECORD, Barrister, Regina.\n\nROMAN CATHOLIC SECTION.\n\nHON. C. B. ROLEAU, Calgary.\nREV. H. LEDUC, Regina.\nA. E. FORGET, Barrister, Regina.\nJAMES BROWN, Secretary of Board.\nI. M. CHALMERS,\n\nDealer In\n\nDry Goods, Gents' Furnishings, Carpet, Boots and Shoes.\n\nMain Street — Moose Jaw\n\nSeymour N. de P. Green,\n\nFIRE INSURANCE AGT.\n\nFarms Bought and Sold. Settlers Located on Choice Locations.\n\nHOUSES TO LET.\n\nAll parties wishing to buy a Farm, Sell a Farm, or obtain a good Homestead apply to the above office, Main Street—Next to Presbyterian Church. Lots in Town bought and sold on Commission.\n\nMoose Jaw Bakery and Meat Market.\n\nCorner River and Main Streets — East\n\nAll kinds of Bread, Pies and Cakes. Game in Season.\n\nMEATS OF ALL KINDS.\n\nJ. M. SIMINGTON, Proprietor.\nNorth West Territories\nSeat of Government—Regina.\n\nLieut.-Governor—Hon. Joseph Royal.\nClerk of Legislative Assembly and Secretary—R. B. Gordon.\nIndian Department—Commissioner—Hayter Read.\nAss't Indian Commissioner—A. E. Forget.\n\nMEMBERS OF THE HOUSE OF COMMONS.\n\nAssiniboia West—N. Flood Davin, Regina.\nAssiniboia East—Hon. Edgar Dewdney, Minister of Interior.\nAlberta—D. W. Davis, Macleod.\nSaskatchewan—D. H. Macdowall, Prince Albert.\n\nLEGISLATIVE ASSEMBLY ELECTED JUNE 28th, 1888.\n\nMoosomin—John Ryerson, Neff.\nWallace—Joel Reaman.\nWhitewood—Alex. G. Thorburn.\nSouris—John G. Turrit.\nWolseley—Benj. P. Richardson.\nQu'Appelle S.—Geo. S. Davidson.\nQu'Appelle N.—W. Sutherland.\nRegina North—David F. Jelly.\nRegina South—John Secord.\nMoose Jaw—James H. Ross.\nMedicine Hat—Thomas Tweed.\n\nMacleod—Fred W. G. Haultain.\nCalgary—John Lineham.\nHugh St. Q. Cayley.\nRed Deer—Robert G. Bett.\nEdmonton—Herbert C. Wilson.\nFrank Oliver.\nBattleford—James Clinkskill.\nPrince Albert—Win. Plaxton.\nJohn F. Betts.\nBatoche—Hillyard Mitchell.\nKinistino—Captain Hoey.\n\nESTABLISHED 1884.\n\nFIELD'S BILLIARD PARLOR.\n\nMain Street: Moose Jaw.\n\nBlackwood's noted Fancy Drink's\n\nImported and Domestic Lager Beers, Etc.\n\nChoice Assortment of Havana Cigars.\n\nA Fine Stock of Meerschaum and Briar Pipes.\n\nO. FIELD, Proprietor.\nMoose Jaw Brass Band\n\nPROF. WALKER, Leader.\nA. H. HICKS, President.\nA. E. POTTER, Vice-President.\nW. A. PORTER, Secretary.\nC. A. GASS, Treasurer.\n\nR. HOCKLEY.\nB. E. ROTHWELL, Managing Com.\nW. R. CAMPBELL.\n\nHONORARY MEMBERS:\nN. F. DAVIN, M. P., JAS. H ROSS, M. L. A., J. N. McDONALD.\n\nPost Offices in Moose Jaw District.\n\nMOOSE JAW—Town of Moose Jaw, C. A. Gass, P. M.\nPASQUA—Pasqua Station, J. Hughes, P. M.\nCARON—Caron Station, A. H. POWELL, P. M.\nMARLBOROUGH, Section 22-18 26, J. G. BEESLEY, P. M.\n\nMoose and Pasqua have daily mail service, C. P. R. Caron, tri-weekly. Marlborough, weekly, every Friday from Moose Jaw. Post offices will shortly be established at Buffalo Lake and Two Rivers.\n\nSupreme Court,\nJUDICIAL DISTRICT WESTERN ASSINIBOIA.\n\nHON. HUGH RICHARDSON, Judge, Regina.\nJ. H. BENSON, Sheriff, Regina.\nDIXIE WATSON, Clerk, Regina.\nSEYMOUR N. de P. GREEN, Deputy-Clark, Moose Jaw.\n\nNEW CASH GROCERY.\nCorner Main and River Streets.\n\nEverything New and Fresh.\n\nCall and See our Stock before Buying elsewhere.\n\nJ. E. WELSH,\n\nMain Street — Moose Jaw\nEXTRACTS FROM\nHOMESTEAD REGULATIONS\n\nAll even-numbered sections of Dominion Lands in Manitoba or the North West Territories, excepting §8 and §26, which have been homesteaded, reserved to provide wood lots for settlers, or other purposes, may be homesteaded by any person who is the sole head of a family, or male over eighteen years of age, to the extent of one quarter section of 160 acres, more or less.\n\nENTRY.\n\nEntry may be made personally at the local land office in which the land to be taken is situate, or if the homesteader desires he may, on application to the Minister of the Interior, Ottawa, or the Commissioner of Dominion Lands Winnipeg, receive authority for someone to make the entry for him. A fee of $10 is charged for an ordinary homestead entry; but for lands which have been occupied, an additional fee of $10 is chargeable to meet inspection and cancellation expenses.\n\nHOMESTEAD DUTIES.\n\nUnder the present law homestead duties may be performed in three ways, and on making application for entry the settler must declare under which of the following conditions he elects to hold his land:\n\n1. Three years cultivation and residence, during which period the settler may not be absent for more than six months in any one year without forfeiting the entry.\n\n2. Residence for three years anywhere within two miles of the homestead quarter section; and afterwards actual residence in a habitable house upon the homestead for three months next prior to application for patent. Under this system, 10 acres must be broken the first year after entry, 15 additional in the second, and 15 in the third; 10 acres to be in crop the second year, and 25 acres the third year.\n\n3. The five years' system under which a settler may reside anywhere for the first two years (but must perfect his entry by commencing cultivation within six months after the date thereof) breaking 5 acres the first year, cropping those 5 acres and breaking 10 acres additional the second year, and also building a habitable house before the end of the second year. The settler must commence actual residence on the homestead at the expiration of two years from the date of entry; and thereafter reside upon and cultivate his homestead for at least six months in each of the three next succeeding years.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001837.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 50, "total-input-tokens": 77066, "total-output-tokens": 24804, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 245, 2], [245, 298, 3], [298, 2688, 4], [2688, 2732, 5], [2732, 5064, 6], [5064, 7870, 7], [7870, 7916, 8], [7916, 8289, 9], [8289, 10589, 10], [10589, 15107, 11], [15107, 15675, 12], [15675, 16090, 13], [16090, 16137, 14], [16137, 19640, 15], [19640, 19995, 16], [19995, 20336, 17], [20336, 24088, 18], [24088, 29281, 19], [29281, 29839, 20], [29839, 30212, 21], [30212, 30251, 22], [30251, 30639, 23], [30639, 31769, 24], [31769, 36238, 25], [36238, 40715, 26], [40715, 43552, 27], [43552, 44000, 28], [44000, 44000, 29], [44000, 44000, 30], [44000, 47229, 31], [47229, 49055, 32], [49055, 51102, 33], [51102, 53455, 34], [53455, 53954, 35], [53954, 54258, 36], [54258, 57995, 37], [57995, 58370, 38], [58370, 59859, 39], [59859, 61410, 40], [61410, 61848, 41], [61848, 62299, 42], [62299, 62924, 43], [62924, 63823, 44], [63823, 64421, 45], [64421, 65716, 46], [65716, 66777, 47], [66777, 69065, 48], [69065, 69065, 49], [69065, 69065, 50]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, false, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 90, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, true, true, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]