[{"id": "1762e2cff24bafea701f861023668b006b216385", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÈE\n\nN° 64. — Décembre 1878.\n\nMISSIONS ÉTRANGÈRES\n\nSAINT-ALBERT.\n\nLETTRE DU R. P. LÉDUC.\n\nSaint-Albert, le 28 juin 1878.\n\nMon révérendissime et bien-aimé Père,\n\nJe vous envoie ci-joint, à l’adresse du R. P. Aubert, un long rapport sur nos missions de la haute et de la basse Saskatchewan. Votre cœur de père sera grandement réjoui en voyant les bénédictions abondantes que le bon Dieu a daigné répandre sur les travaux de vos enfants dans ces territoires du Nord-Ouest. Je me suis appliqué, dans ce travail, à montrer tous mes Frères à l’œuvre, les laissant raconter eux-mêmes leurs efforts, leurs combats et aussi leurs consolations, leurs succès obtenus avec et par le secours de la grâce divine. Vous verrez avec bonheur, bien-aimé Père, que le catholicisme s’affermi de plus en plus\ndans cette jeune Eglise de Saint-Albert, confiée à la sollicitude pastorale de Mgr Grandin, notre bien-aimé et digne Evêque, modèle pour nous tous du véritable Oblat de Marie immaculée, du religieux et du missionnaire. L'influence protestante est, avec le secours de Dieu, efficacement combattue. Dix mille Sioux, émigrés des États-Unis, sont venus se réfugier sur le territoire canadien, diocèse de Saint-Albert. Neuf établissements nouveaux ont été commencés depuis deux ans, et déjà ils ont porté leurs fruits : conversions plus nombreuses d'infidèles ; nombre bien consolant d'abjurations ; gouvernement définitivement établi parmi nous ; communications plus faciles ; beaucoup de métis abandonnant la vie nomade et se fixant sur des terres ; un nombre déjà considérable d'Indiens établis sur des réserves à eux cédées par le gouvernement, et demandant le prêtre catholique. Cinq de vos enfants parcourant tout l'été les immenses déserts de l'Ouest, pour porter la bonne nouvelle de l'Evangile aux sauvages disséminés dans ces immenses prairies ; Cris, Pieds-Noirs, Gens du sang, Piégans, Sarcis, Assiniboines, Sauteux, tous vont être visités, tous vont entendre la parole de Dieu, que leur portent vos enfants. Dans ce vaste district du Cumberland, jusqu'âce jour forcément si abandonné, les PP. Bonnald et Paquette voient leurs efforts couronnés de succès. Tel est le résumé succinct du rapport que je me fais un devoir de vous envoyer. Je vous avoue, révérendissime et bien-aimé Père, que cette vue d'ensemble me fait du bien à moi-même. Si ces lignes tombent sous les yeux de nos Frères, j'espère que quelques-uns en seront consolés et encouragés. Comment en effet ne pas aimer tous les jours davantage un ministère, bien pénible il est vrai, souvent bien crucifiant pour la pauvre nature, mais pourtant si visiblement béni du bon Dieu et de notre Immaculée Mère ? Comment se laisser aller à l'abattement, à des pensées, à\ndes idées de tristesse, et de désolation sous prétexte qu'on ne voit point de conversions en masse, de tribus entières demander à la fois la grâce du baptême, comme si le monde s'était converti d'un seul coup et dans un seul jour au catholicisme?\n\nCe matin, fête du Sacré-Cœur de Jésus, de ce cœur divin qui a tant aimé les âmes, nous avions une cérémonie bien touchante à la cathédrale. C'était la première communion des enfants. Une trentaine de ces jeunes âmes, bien préparées par une retraite de trois jours, bien purifiées par le sacrement de pénitence, venaient s'asseoir à la table sainte, et j'avais le bonheur de leur distribuer le pain eucharistique; le cœur de Jésus allait battre contre ces jeunes cœurs préparés avec soin par le R. P. Bruner, et les enflammer de son amour, les purifier de plus en plus, les fortifier en un mot dans le combat qu'ils auront nécessairement à livrer contre l'ennemi de tout bien, à mesure qu'ils avanceront dans la vie. Après la communion, il y a eu rénovation des vœux du baptême, consécration à Marie et procession de la cathédrale au collège. Quatre orphelines en blanc portaient sur un bâton la statue de Notre-Dame de Lourdes; la bannière de Marie, la statue de saint Albert étaient portées par les petits garçons. Puissent ces chers enfants conserver toujours vivace dans leurs cœurs le souvenir de ce beau jour, si fécond pour eux en grâces et en bénédictions divines!\n\nMaintenant, révérendissime et bien-aimé Père, je me recommande à vos bonnes prières et saints sacrifices, et je suis votre tout dévoué, obéissant et très-respectueusement affectueux fils en J. M. I.\n\nH. Leduc, O. M. I.\nSaint-Albert, le 24 juin 1878.\n\nAU RÉVÉREND PÈRE AUBERT, ASS. GÉN.\n\nMON RÉVÉREND ET BIEN CHER PÈRE,\n\nDepuis longtemps je remets de courrier en courrier ma réponse à votre bonne lettre de novembre dernier. Des occupations, des voyages, des dérangements imprévus, m'ont toujours fait différer de jour en jour. Quoi qu'il en soit, je me mets résolument à l'œuvre, afin de vous envoyer un long rapport sur nos chères missions de la Saskatchewan. Comme toujours, je compte sur votre indulgence pour excuser le décousu de mon travail ; j'écris *currente calamo*, vous parlant sans ordre de tout ce qui peut intéresser un des premiers missionnaires de la rivière Rouge.\n\nL'Eglise de Saint-Albert n'est-elle pas la fille ainée de l'Eglise de Saint-Boniface? En travaillant pour la mère, dont le souvenir est toujours resté si vivant dans votre cœur, n'avez-vous pas contribué aussi, par votre zèle et vos travaux apostoliques, à l'érection future du diocèse de Saint-Albert? N'avez-vous pas ainsi apporté votre pierre à la fondation de ces missions de la Saskatchewan, dont je viens vous parler aujourd'hui?\n\nIl y a un an à peu près, à pareille époque, j'étais chargé de la mission de Notre-Dame des Victoires, au lac Labiche. Depuis plusieurs semaines déjà, Mgr Faraud affrontant lui-même les fatigues d'un pénible voyage pour assurer à ses missionnaires de l'extrême Nord la réception des articles indispensables à leur entretien et à l'entretien de leurs missions, était parti par les berges de Notre-Dame des Victoires, assumant sur lui les soucis, les inquiétudes et la responsabilité du guide. Le bon P. Du-\nVictoires, y avoir reçu l'onction sacerdotale et fait son oblation, accompagnait Sa Grandeur, en route pour la mission du Mackenzie. Deux filles dévouées, venues l'année précédente du Canada, allaient s'offrir aux excellentes sœurs de la Providence, pour les seconder dans leurs œuvres de zèle et de charité. L'époque où Monseigneur devait être de retour au lac Labiche commençait à passer, et pas de nouvelles de Sa Grandeur. Sans être encore sérieusement inquiets, nous n'étions cependant pas rassurés. Pour plus de sûreté, craignant que nos voyageurs ne manquassent de vivres, il fut décidé que le R. P. Grouard partirait avec un guide, en canot d'écorce, pour aller au-devant de Monseigneur et de ses seize hommes engagés. Le Père était parti depuis deux heures à peine, que je reçus une lettre de Sa Grandeur. Monseigneur est arrêté au pied du grand Rapide. L'eau a tellement monté dans la rivière, qu'il est impossible aux hommes de traîner plus longtemps leurs berges à la ligne. Monseigneur renvoie sept de ses rameurs, qui reviennent à pied au travers de la forêt. La septième journée, ils arrivent à la mission, et m'annoncent que Monseigneur, avec les hommes qui lui restent, va certainement manquer de vivres. Vous dire l'inquiétude que j'éprouve en ce moment est impossible : il me semble voir notre bon F. Alexis, arrêté lui aussi, deux ans auparavant, à la même place, par la crue subite des eaux, puis voyageant péniblement le long du rivage, et, dans la forêt, mourant de faim et tombant définitivement victime de la cruauté de son guide. Sans doute Monseigneur a sept ou huit hommes avec lui, et le P. Grouard vient de partir avec un demi-sac de pé-mikan et quelques livres de thé. Mais qui sait si, lorsqu'il arrivera au pied du grand Rapide, ces sept ou huit hommes n'auront pas laissé Monseigneur, pour revenir eux-mêmes, à travers les bois, à Notre-Dame des Victoires ? Je cherche\nà engager quelqu’un qui parte au plus vite, afin de porter des vivres à Sa Grandeur et à sa caravane. Croiriez-vous, révérend et bien cher Père, qu’on profite de la circonstance pour me demander des prix déraisonnables? Bien que je sois fait à de telles indélicatesses, la patience m’échappe, et je renvoie mon individu avec quelques vérités qu’il n’ira pas divulguer trop vite, quoique je lui recommande bien de ne cacher à personne ce que je lui dis à huis clos. Je cours alors chez un bon Canadien, bien dévoué à la mission. Je sais qu’il est très-occupé en ce moment, n’importe! « Va, lui dis-je; avec toi, je ne fais aucun prix, tu verras le temps que tu prendras pour le voyage, et, pendant ton absence, je surveillerai ton champ et ton jardin; j’y ferai travailler les Frères, si c’est nécessaire. » De suite il se procure un compagnon de voyage avec un bon canot; il prend à la mission les vivres indispensables, et se met en route aussi vite que possible. Le dimanche suivant, je ne pus m’empêcher, à la fin de mon instruction, de dire combien la conduite égoïste et sans cœur de plusieurs était pénible à constater. Je leur rappelai ce qu’ils doivent aux missions; je tâchai de leur faire comprendre combien était honteuse la conduite de ceux qui profitaient du moment où leurs prêtres, et leur évêque même, se trouvaient dans les positions les plus difficiles, pour extorquer des gages exorbitants, ou mieux encore pour demander augmentation du salaire convenu. Plusieurs firent les mauvaises têtes et les mécontents; mais la réconciliation fut bien vite faite, grâce à mon changement, qui m’arriva ce jour-là même, comme je vous le dirai tout à l’heure. À midi et demi, je reçus l’heureuse nouvelle de l’arrivée de Mgr Faraut dans le cours de la soirée. Sa Grandeur avait abandonné une berge en chemin, les vivres expédiés quelques jours auparavant étaient arrivés à propos et à temps. Ces nou-\nvelles à peine reçues, arrive un autre courrier. Ce dernier vient de Saint-Albert, me remet un paquet de lettres, et m'annonce l'arrivée de Mgr Grandin pour le lendemain ; je reçois en même temps mon obéissance pour Saint-Albert. Sur ce je revois mes mécontents du matin, auxquels j'annonce mon prochain départ, ajoutant en riant : « Êtes-vous heureux de l'ignorance où j'étais ce matin de mon changement, car je vous en aurais dit cent fois davantage. » Sur ce, on se donne la main, la réconciliation est faite, et les vérités passablement crues de la matinée sont facilement digérées. Le lendemain, grande fête à la mission, solennité de saint Henri, patron de Mgr Faraud, heureusement de retour de son pénible voyage ; arrivée de Mgr Grandin, nomination du bon P. Grouard à la charge de supérieur de Notre-Dame des Victoires. Ce cher Père, pendant les deux mois qu'il vient de passer à la mission, a su se faire connaître, apprécier et aimer de la population. Il a et mérite l'estime et l'affection de ses frères en religion, il fera un grand bien au lac Labiche. Pourtant la nouvelle de sa nomination fut un sacrifice pour lui ; car, pour un temps indéterminé, il ne devait plus revoir ses chers sauvages du Mackenzie. Le 21 juillet, Monseigneur de Saint-Albert, les RR. PP. Grandin et Leserrec, le F. Gerente et moi, nous nous mettions en route pour Saint-Albert, où nous arrivions heureusement le vendredi 27. Depuis le départ du bon P. Lacombe, en 1872, les missions sauvages de cette partie du diocèse avaient nécessairement souffert. Les Cris se plaignaient d'être plus ou moins abandonnés. Malheureusement, après le départ de leur missionnaire, nous nous étions trouvés, faute de sujets, dans l'impossibilité d'aller à leur secours autant que nous l'aurions désiré. Depuis longtemps, Monseigneur soupirait donc après le moment où il pourrait établir de nouvelles missions sauvages ; me trouvant dé-\nchargé du lac Labiche, je pensais tout naturellement à cette mission des Cris. Déjà j’avais fait mes plans, je partais avec un Père, nous allions bâtir une maison d’hivernement au milieu des sauvages, etc., etc. Mais j’avais compté sans le zèle et l’éloquence du R. P. LESTANG. Ce cher Père fit si bien valoir ses raisons, qu’il obtint cette mission d’abnégation et de dévouement, mission bien pénible à la nature sans doute, mais digne à tous égards de l’ambition d’une âme apostolique. Pour moi, je dus reprendre la charge de la mission de Saint-Albert, tandis que le R. P. LESTANG partait pour la mission des Cris, sans savoir encore où il irait fixer sa tente et passer l’hiver. Je vous dirai plus loin, révérend et bien cher Père, le bien qu’il a fait avec le R. P. FAFARD pendant les dix mois qui viennent de s’écouler. Hélas ! il nous avait à peine quittés, que notre bon et saint Évêque, Mgr GRANDIN, était repris de son terrible mal d’oreilles. Ce furent, pendant plusieurs semaines, des alternatives de mieux et de souffrances aiguës, supportées avec une admirable patience. Nous voyions Monseigneur condamné, selon toute probabilité, à garder tout l’hiver encore le lit ou la chambre, comme il avait été contraint de le faire les deux années précédentes. Cette maladie ne pouvait que nous donner de graves inquiétudes ; comme Monseigneur lui-même, nous redoutions de voir à la longue cette maladie se terminer par une surdité complète ou à peu près. Le 15 août, fête de l’Assomption, nous apprenons que l’unique steamboat de la Saskatchewan doit arriver à Edmonton et redescendre à Winnipeg. Depuis un an, nous prions Monseigneur de partir pour l’Europe, afin de recevoir les soins d’un spécialiste. Ce jour-là, les Pères se rendent ensemble auprès de Sa Grandeur, et la prient de nouveau de profiter de cette dernière occasion pour se rendre à Saint Boniface, et de là au Canada et même en France, où il pourra\nplus facilement utiliser son temps, en se procurant quelques ressources nouvelles, en recrutant quelques bons sujets. Quinze jours plus tard, Mgr GRANDIN nous donnait ses derniers conseils, nous faisait ses dernières recommandations, avant de partir pour l'Europe. Comme notre vénéré fondateur, il nous recommandait surtout la charité, à l'intérieur la charité, la charité fraternelle, et à l'extérieur le zèle pour le salut des âmes. De plus, il me confiait l'administration de son diocèse pendant sa longue absence. Je ne pouvais promettre qu'une chose à Sa Grandeur, mais je lui promis de tout cœur; c'était d'apporter la plus grande dose de bonne volonté possible à l'accomplissement de la lourde charge que l'obéissance m'imposait. Le bon P. LESTANC, autant du moins que les circonstances pourraient le permettre, devait partager avec moi le fardeau, m'aider de ses conseils, de son expérience. Malheureusement il nous était impossible de nous voir ou même de correspondre ensemble autant que nous l'aurions désiré.\n\nDepuis l'automne dernier, nous nous sommes occupés d'une manière spéciale des missions sauvages. Le R. P. LESTANC, ayant pour compagnon l'excellent P. FAFARD, arrivait au fort Pitt. Après y avoir bien réfléchi devant le bon Dieu, il résolut de commencer de suite à jeter les fondements d'une mission qui serait comme le centre des missions crises. Le fort Pitt est le poste de la Compagnie de la baie d'Hudson, où des milliers de Cris se rendent chaque année pour venir y traiter leurs fourrures et recevoir aussi, chaque automne, la paye annuelle à laquelle ils ont droit d'après le traité conclu entre eux et le gouvernement canadien. Il fut donc résolu que le bon P. FAFARD, aidé du cher F. Boon et de quelques engagés, bâtirait de suite une maison où ils pourraient, tant bien que mal, passer l'hiver. Le R. P. LESTANC partit alors\navec un camp de sauvages pour la prairie, où il se proposait de voir les Cris le plus possible et de passer l'hiver avec eux. Le P. Fafard aurait ardemment désiré d'aller de suite partager les travaux et les privations de son supérieur. Il pleura même de ne pouvoir l'accompagner; d'autres privations, d'autres travaux, d'autres œuvres de zèle lui étaient réservés au fort Pitt même, que nous appellerons désormais Saint-François-Régis. À cette époque, je reçus du R. P. Lestang la première lettre qu'il m'adressait de son camp, à la montagne du Nez. Il me mandait :\n\n« Aujourd'hui vous savez, sans doute, que je n'ai pas bâti au lac d'Orignal, comme nous nous l'étions proposé d'abord. Au lac d'Orignal, il y a très-peu de monde pour le moment, et nous avons jugé qu'il était mieux d'attendre nos sauvages chrétiens pour ne pas nous exposer à bâtir en vain. Au printemps, l'un de nous accompagnera le chef Kiyerwin au lac d'Orignal; un autre accompagnera un autre chef aussi quelque part, à l'embouchure de la rivière du même nom : pour bien faire, nous aurions besoin d'un troisième Père qui pût garder la mission du fort Pitt, s'occuper des chrétiens de cette place et voir les sauvages qui fréquentent continuellement ce poste. L'agent du gouvernement pour les Indiens du Nord-Ouest, agent que nous avons rencontré au lac des Œufs, nous a dit avoir payé plus de mille sauvages, au fort Pitt. Ces sauvages y ont résidé plus ou moins longtemps. Cela seul suffirait pour l'établissement d'une mission. Mais ce n'est pas tout. Il y a dans le fort un certain nombre de catholiques et de sauvages infidèles; tous les sauvages du bois et de la prairie s'y rendent plusieurs fois dans le cours de l'année, et voilà qu'une mission protestante s'y bâtit. Telles sont, bien cher Père, les raisons de ma conduite. Tous les sauvages chrétiens sont contents de cette\nnouvelle fondation, d’autant plus qu’ils auront aussi un prêtre sur leur réserve. En arrivant au fort Pitt, j’ai cru devoir accepter l’offre d’un chef sauvage, Pionutteyasiw, qui me promettait d’avoir soin de moi si je l’accompagnais à la prairie. C’est un infidèle; mais trois de ses enfants et plusieurs personnes de son camp sont baptisés. Depuis plus d’un mois, je vis avec ces sauvages. Le sac de pémikan et la poche de farine que j’avais pris en partant au fort Pitt, ne m’ont pas embarrassé longtemps. Avant huit jours, je n’avais plus rien. Je vis aujourd’hui aux dépens de mes sauvages, qui promettent tous de prier. J’ai déjà fait plus de cinquante baptêmes, tant d’enfants que d’adultes. Je me propose de passer l’hiver avec ces pauvres gens. C’est en restant avec eux un temps considérable qu’on peut espérer de réaliser un bien solide. Ma présence à la prairie opère un bon effet parmi les Cris, et déjà j’ai visité le camp de Kiyerwin et de Paskiakewiyim, qui semblent revivre après un long sommeil. Je n’ai rien, et, grâce au bon Dieu, je ne manque de rien. Mes pauvres gens, il est vrai, n’ont pas été heureux dans leur chasse jusqu’à ce jour. Ils vivent de la charité, et, depuis dimanche, un autre camp nous donne à manger. »\n\nÀ la fin de novembre, le R. P. LESTANG recevait ordre de Mgr GRANDIN de visiter, autant que faire se pourrait, Battleford, nouvelle capitale du gouvernement dans les territoires du Nord-Ouest. Il s’agissait de voir la place, d’entrer en relations avec le gouvernement et de s’assurer un terrain convenable pour l’établissement d’une mission. À la date du 7 décembre, je recevais les détails suivants : « J’ai mis huit jours pour me rendre de la montagne de l’Oeil à Battleford. Ici j’ai trouvé le R. P. André à l’œuvre; il était arrivé trois jours avant moi. Nous nous sommes donné une chaude accolade! Et le gouverneur?\nLe gouverneur est charmant ; il m’a fait la plus gracieuse réception, ainsi qu’au P. André. J’ai déjà eu l’occasion de le voir plusieurs fois, et, plus je le connais, plus je l’aime et l’estime. Hier soir, Son Honneur a donné un grand dîner à notre occasion ; il n’y avait que des catholiques d’invités. Et devinez qui a eu l’honneur de donner le bras à Mme la gouvernante pour la conduire à table ? Que n’étiez-vous là pour admirer mes airs de courtois chevalier. Le gouverneur est aimé de tous, même des sauvages, pour lesquels il est très-patient et charitable. Il y a ici un gros camp de Cris et quatre ministres protestants. Quoique dans la capitale, je vais pouvoir continuer mon œuvre de Missionnaire cri. J’ai trouvé ici quatre fois plus de sauvages que je n’en ai laissé, et je vous assure que je m’occupe de ces pauvres âmes abandonnées, exposées aux séductions de l’erreur. Le ministre, M. Kay, est vraiment zélé ; j’essaye de l’imiter et de le surpasser. Ne pouvant réussir à réunir les sauvages dans un même local, je vais tous les jours de maisons en maisons, de loges en loges, faire le catéchisme et enseigner les prières ; faire l’école en cri et en anglais. J’ai fait aujourd’hui quinze de ces visites, jugez si j’ai le temps de m’ennuyer ! »\n\nPendant que le R. P. Lestanc s’occupe ainsi sans relâche de ses Cris à la prairie ou à Battleford, son excellent compagnon, le R. P. Fafard, ne reste pas les bras croisés. D’abord, il doit songer à se procurer un abri pour l’hiver qui approche. Secondé par l’excellent F. Boon, il met la main à l’œuvre, s’arme d’une hache et tous les deux coupent le bois nécessaire pour bâtir une maison de 16 pieds sur 20. La maison terminée, pendant que le Frère s’occupe de faire le foin nécessaire pour hiverner les quelques animaux de la mission, et de charroyer le bois de chauffage requis pour les six mois à venir, le P. Fafard se met à l’œuvre et s’efforce de commencer une école, où\nil enseignera lui-même les premiers éléments des sciences humaines, tout en instruisant, avant tout, ses élèves des vérités bien autrement importantes de notre sainte religion.\n\nA la date du 14 janvier, ce cher Père m'écrivait : « Je suis arrivé hier du lac Tortue, bien fatigué, ayant été obligé de marcher tout le temps et presque à jeun. Mais ce n'est rien ; j'ai bien dormi cette nuit, et me voilà rétabli. Les pauvres sauvages du lac Tortue, formant vingt-cinq loges, ne sont pas disposés à entendre parler de religion. La plupart appartiennent à la nation des Sauteux. Je suis allé les visiter tous, m'efforçant de leur inspirer des dispositions meilleures. Maintenant, le plus vite possible, j'irai visiter les sauvages du lac la Grenouille, du lac d'Orignal et peut-être du lac Froid. Depuis notre arrivée, nous avons déjà fait soixante-deux baptêmes, béni huit mariages et reçu deux abjurations. »\n\nIl y a un mois à peu près, le R. P. FAFARD, ayant pour compagnon le R. P. BOURGINE, qu'il laissait au fort Pitt, pour soigner de son mieux cette mission de Saint-François-Régis, partait pour la prairie, afin de passer tout l'été au milieu des sauvages, les suivant dans toutes leurs pérégrinations, partageant de bon cœur leurs souffrances, leurs privations et leur vermine, se faisant tout à tous pour les gagner tous à Jésus-Christ. Je ne doute pas que son zèle ne soit couronné de succès et que ce cher Père ne fasse ample moisson d'âmes dans le cours de l'été.\n\nAprès vous avoir parlé de la mission des Cris, je veux vous entretenir un peu de la mission des Pieds-Noirs, nation nombreuse et encore presque entièrement indigène. Cette mission est depuis quatre ans confiée au R. P. SCOLLEN, aidé du bon P. DOUCET. Cet automne, le R. P. RÉMAS, malgré son âge et ses infirmités, partait de bon cœur pour aller passer l'hiver à Notre-Dame de la\nPaix, à Bow-River. Il devait rester là, à poste fixe, pendant que les PP. Scollen et Doucet, plus jeunes et plus alertes, iraient visiter les Pieds-Noirs dans leurs camps pendant l'hiver. Ce printemps, au lendemain même de la fête de Pâques, je quittai moi-même Saint-Albert, pour aller faire visite à ces chers Pères de Notre-Dame de la Paix. Je passai quelques jours avec eux à Bow-River même, et je me rendis, accompagné du P. Scollen, jusqu'au fort Mac-Cleod, nouvelle et dernière colonie du diocèse, avant de traverser les frontières américaines au sud-ouest de Saint-Albert. Le bon et zélé P. Doucet me manifesta, à plusieurs reprises, le désir de rester le plus de temps possible au milieu des sauvages et dans leurs propres camps. Avant de quitter la mission, je laissai donc pour obédience au cher P. Scollen et à son excellent compagnon, de partir au commencement de juin, afin de consacrer tout l'été, dans la prairie, à l'évangélisation des Pieds-Noirs. Le bon P. Rémas sacrifiait ses goûts et ses inclinations à l'obéissance, et restait chargé des métis établis autour de la résidence, pendant l'absence des PP. Scollen et Doucet. Tous les trois doivent, autant que faire se pourra, se rendre cet automne à Saint-Albert, pour y prendre part aux exercices de la Retraite annuelle. Le R. P. Scollen me remit alors un rapport sur la mission dont il était chargé. Je veux vous en communiquer ici au moins les principaux passages. Je traduis de l'anglais. Le R. P. Scollen date ce rapport du camp des Piégans, le 10 mars 1878.\n\n« Mon révérend et bien cher Père, écrit-il, je vous envoie un compte rendu aussi exact et succinct que possible, sur nos missions Pieds-Noirs. L'événement important qui a préoccupé les esprits dans les premiers mois de 1877, a été le traité que la tribu des Pieds-Noirs devait faire avec le gouvernement canadien. Comme ce traité pouvait\navoir des conséquences graves relativement à l'évangélisation de ces pauvres Indiens, je n'étais pas moi-même sans soucis et sans inquiétudes. Les commissaires du gouvernement et les sauvages déterminèrent enfin le jour et la place de la grande assemblée. Conformément aux intentions de mes Supérieurs, je résolus de suite de me rendre au lieu du traité. Laissant le R. P. Doucet en charge de Notre-Dame de la Paix, je partis à la fin d'août, pour le fort Mac-Cleod. Au commencement de septembret, Son Honneur, le lieutenant gouverneur Laird, arrivait à cette place. La police à cheval et les civils de la localité se portèrent au-devant de Son Excellence. Une foule considérable de sauvages regardaient avec étonnement. Pendant les quelques jours qu'il passa à Mac-Cleod, j'eus plusieurs fois l'occasion de voir le gouverneur. À différentes reprises, il me fit l'honneur de m'inviter à sa table. Je trouvais en lui un homme aux sentiments religieux, capable d'apprécier le bien fait par les Missionnaires aux pauvres sauvages. Il n'hésita même pas à attribuer aux Missionnaires catholiques la plus grande part du bien opéré, bien dont il avait été témoin depuis son arrivée dans le pays. Le 10 septembre, avec toute la pompe possible, la milice, forte de deux cents hommes, avec un train considérable d'artillerie et deux pièces de campagne, partait du fort Mac-Cleod pour se rendre au lieu désigné, sur la rivière des Arcs. Là, nous rencontrâmes une multitude de sauvages, au nombre d'environ six mille âmes; Pieds-Noirs, Hommes-du-Sang, Piégans, Sarcis, Assiniboines et quelques Cris, tous attendaient impatiemment l'arrivée du gouverneur. Je plantai ma tente au milieu de cette foule hétérogène et commençai de suite l'instruction religieuse, catéchisant, baptisant, confessant bon nombre de ces pauvres Indiens. Dans le même temps, je me fis un devoir de ne\npas manquer une seule des réunions relatives au traité à conclure. Les mêmes arrangements proposés l'année précédente aux Cris furent proposés aux Pieds-Noirs, qui les acceptèrent sans grande opposition. Il fut convenu, néanmoins qu'ils ne recevraient pas d'instruments aratoires, mais qu'en retour on leur donnerait un fort troupeau d'animaux domestiques. Une réserve de terre, d'environ 5 milles de large sur 150 de long, leur fut accordée sur la rivière des Arcs. Le gouvernement doit bâtir une école sauvage sur cette réserve et installer un instituteur. Les Pieds-Noirs ont fait eux-mêmes cette demande au gouvernement, à l'instigation de notre fameux Jean l'Heureux, qui sera probablement l'instituteur désigné. (Ce l'Heureux est l'homme le plus incompréhensible que j'aie jamais vu. C'est une espèce de Gil Blas, qui a joué toutes sortes de tours, s'est fait quelquefois passer pour prêtre, et s'intitule, depuis une dizaine d'années, catéchiste des Pieds-Noirs. Il baptise, marie, prêche, on dit même qu'il confesse au besoin.) Avant la conclusion du traité, continue le P. Scollen, j'eus une tâche assez désagréable à remplir. Deux Indiens étaient accusés de trahison. Ils vinrent à moi, me priant de prendre leur défense. Ayant recueilli toutes les informations possibles, je vis que la prétendue trahison était entièrement de la fabrique de l'Heureux. Dans quel but ? Je ne saurais le dire; sinon qu'il voulait peut-être faire montre de patriotisme et prouver ainsi sa fidélité au gouverneur. En fin de compte, mes deux pauvres Pieds-Noirs furent renvoyés absous; mais, dans la défense, j'avais un peu froissé le colonel, prévenu déjà en faveur de Jean l'Heureux, et déjà plus ou moins indisposé contre moi, à raison d'un fait dont il convient de vous dire un mot. Lorsque les métis commencèrent à bâtir autour des forts de la Police montée, craignant pour leur foi, je fis tous mes efforts pour les éloigner. Ce ne fut\nqu'après avoir fait une bien triste expérience du danger, que quelques-uns se rendirent enfin à mes conseils ; mais les autres s'obstinèrent à rester, et plusieurs d'entre eux semblent maintenant morts à tout sentiment de moralité. Mécontents de mes reproches, ils s'en sont vengés par la calomnie. Je dus, à la même époque, et pour les mêmes raisons, me plaindre au colonel de l'immoralité de ses hommes. C'était indirectement critiquer sa surveillance, et je vis qu'il en était offensé. Néanmoins, mes remarques eurent un bon effet, et je ne m'en repens pas.\n\nRevenons maintenant à ma mission, où j'étais de retour en octobre. Peu après, le R. P. REMAS arriva de Saint-Albert, pour passer l'hiver avec nous. Au mois de janvier suivant, le R. P. DOUCET et moi, nous nous rendîmes au camp des Piégans, sur la rivière du Ventre. Pendant plusieurs semaines nous fûmes occupés à instruire et baptiser les enfants de cette tribu, travaillant en même temps à nous perfectionner dans la connaissance de la langue. Si l'on pouvait parvenir à détruire la polygamie en vigueur parmi ces sauvages, rien, je crois, ne devrait les empêcher d'embrasser en masse notre sainte Religion ; mais c'est là un désordre, humainement parlant, impossible à détruire chez la génération présente. Le R. P. IMODA, de la Société de Jésus, après vingt ans de missions chez ces sauvages, m'a dit, lui aussi, n'avoir pas rencontré d'obstacle plus grand à la conversion de ce peuple. Le seul moyen de réussir est de gagner les jeunes gens et de les décider à ne prendre qu'une femme. Du camp des Piégans, nous nous rendîmes au fort Mac-Cleod. J'eus la douleur d'apprendre qu'une école protestante venait d'y être établie.\n\n« L'automne dernier les habitants de cette place m'avaient offert de me bâtir une église et une maison d'école, si je voulais rester avec eux ; je dus leur répondre que la chose\nétait impossible, l'intention de Monseigneur étant que je m'occupasse des sauvages. Ce printemps, ils sont revenus à la charge, et je leur ai fait la même réponse. »\n\nTels sont, révérend et bien cher Père les principaux faits relatés dans le rapport du P. SCOLLEN. Je reviens maintenant à Saint-Albert et aux missions environnantes qui en dépendent plus spécialement, c'est-à-dire le lac Sainte-Anne, le lac Lanone et Notre-Dame de Lourdes.\n\nÀ Saint-Albert, aussitôt les travaux des champs terminés, ayant achevé la provision de bois et de foin nécessaire pour notre long hiver, j'écrivis aux Pères des environs de venir à l'évêché pour les exercices de la retraite annuelle. Pour ma part je sentais grandement le besoin de me recueillir avec eux, et d'aviser ensemble à ce que l'œuvre des missions ne dépérisse point entre nos mains pendant la longue absence de notre Évêque bien-aimé. Les RR. PP. VÉCREVILLE, BLANCHET, GRANDIN, BRUNET, TOUZE et BOURGINE vinrent prendre part à cette retraite avec nos deux bons Frères scolastiques DAUPHIN et VANTIGHEN et nos chers Frères convers PEREARD, Alex. LAMBERT, LERICHE et LETOURNEUR. Les bons Frères LALICANT et BOON devaient arriver quelques jours plus tard. Chacun, j'en suis convaincu, s'efforça de faire profiter en soi la grâce divine, chacun sortit de retraite avec un nouveau courage, un renouvellement de bonne volonté. Le bon F. LERICHE fit son oblation perpétuelle le jour de la clôture de la retraite. Peu après nous nous séparâmes pour aller là où l'obéissance nous appelait. Le bon P. BLANCHET restait à Saint-Albert, chargé de l'économat, et de la desserte de Saint-Joachim au fort Edmonton. Le R. P. GRANDIN reprenait avec un nouveau courage l'instruction de ses jeunes latinistes ; le P. BRUNET retournait au lac Sainte-Anne, le P. TOUZE recevait en partage la mission nouvelle des Assiniboines au lac Lanone et le R. P. VÉGRE-\nVILLE allait travailler au développement de la jolie petite mission canadienne de Notre-Dame de Lourdes.\n\nDans le cours de l'automne j'ai eu la consolation de baptiser à la cathédrale cinq ou six adultes assiniboines, prémices de la mission confiée au R. P. Touze. Cette mission du lac Lanone est la première qui ait été spécialement établie pour ces sauvages, sur une réserve de terre à eux cédée par le gouvernement et sur les bords d'un lac poissonneux. Une quarantaine de familles sont en voie de se construire des maisons et de faire défricher quelques arpents de terre pour y semer des pommes de terre, un peu d'orge, etc. Ces pauvres Indiens sont tout fiers d'avoir un prêtre à eux, ils aiment leur petit P. Touze, qui fera, j'en suis sûr, un grand bien au milieu de ces sauvages, pour la plupart infidèles encore. Le chef, bigame depuis de longues années, promit de se faire instruire et baptiser, et de fait, le saint jour de Pâques, il recevait solennellement le sacrement de la régénération à la cathédrale et se mariait ensuite à l'église avec une de ses femmes autrefois baptisée. Le jour précédent, à la cathédrale aussi, un autre Assinboine recevait le baptême avec sa femme, qui abjurait en même temps le protestantisme. Comme vous le voyez, mon révérend Père, le saint ministère n'a pas été sans consolation pour nous cette année. Ici encore j'ai eu la consolation d'avoir communion générale de nos chrétiens à la Toussaint, le jour des Morts, à Noël aux Quarante Heures et à Pâques. Trois ou quatre seulement ont négligé leur communion pascale. Encore l'un de ces retardataires se propose-t-il de communier dimanche, solennité de la Fête-Dieu, jour aussi de communion générale pour notre population. Depuis huit jours le R. P. Blanchet et le F. Dauphin préparent les reposoirs pour la procession du très-saint Sacrement.\n\nCet automne, un pauvre Assinboine qui dans un mo-\nment de furie, pour assouvir sa vengeance, avait tué, massacré sept ou huit sauvages, se mourait à la prison. Le bon P. VIGREVILLE l'avait visité souvent, réconcilié avec Dieu, administré et préparé à la mort. « Mon pauvre prisonnier se meurt, m'écrivait-il. Monseigneur, en partant pour l'Europe, vous a communiqué les pouvoirs reçus de Rome, et vous a délégué pour administrer le sacrement de confirmation in articulo mortis. Je souhaite que cette grâce soit accordée au pauvre sauvage repentant. »\n\nLe lendemain j'étais à Notre-Dame de Lourdes, je voyais ce pauvre mourant, je recevais sa dernière confession, et il mourait réconcilié avec le bon Dieu, l'âme toute fraîchement enrichie du signe indélébile qui marque les parfaits chrétiens. Le bon colonel Jarvis, ami dévoué de nos missions, me disait ni plus ni moins que si l'enfer existe, mon sauvage était sûr d'y aller. « Vous êtes bien sévère, colonel, à côté de Notre-Seigneur sur la croix.—Oui, oui, répondit-il, il y avait là un voleur, un brigand ; à cette conversion j'y crois ; mais, à part celle-là, je ne crois pas à ces conversions à la mort ; à moins, ajouta-t-il, et c'est du reste ce que vous enseignez, vous, catholiques, qu'il n'y ait dans l'autre vie un lieu quelconque d'expiation. » Voici donc le dogme du purgatoire admis par la force de la raison, par un protestant qui doit se mettre en contradiction avec les lumières mêmes de sa raison pour rester fidèle aux enseignements de sa religion. C'est un fait, il me semble, bon à enregistrer.\n\nUn mot maintenant des sœurs et de leurs œuvres. Notre orphelinat est toujours nombreux, notre école française et anglaise de Saint-Albert assez bien fréquentée. Deux sœurs se dévouent à l'instruction des enfants, une autre est plus spécialement chargée de l'orphelinat. J'ai fait passer chaque mois un petit examen aux enfants, et en somme je trouve que les progrès ont été satisfaisants\nPlusieurs commencent à écrire passablement, l'orthographe est convenable, les grammaires française et anglaise sont apprises et comprises ; quelques notions de géographie, d'histoire sainte et de mathématiques : telles sont les principales branches de l'enseignement de notre jeune école de Saint-Albert, à laquelle le gouvernement a accordé cette année une allocation de 300 piastres environ (1 600 fr.). Bon nombre de malades ont été soignés à domicile par notre bonne sœur supérieure et infirmière tout à la fois. Elle a même eu la consolation de baptiser in extremis et d'envoyer au ciel quelques enfants que les parents n'auraient pas voulu présenter au baptême : quantité de remèdes ont été distribués gratis aux indigents, bon nombre d'affamés ont reçu chez les sœurs l'aumône corporelle et spirituelle tout à la fois. Deux ou trois adultes ont été instruits et préparés au baptême par une des sacristines, qui, comme de raison, a tenu sur les fonts baptismaux les sauvages qu'elle avait instruits. Les sœurs sont aidées dans leurs œuvres de charité et de dévouement par cinq filles bien pieuses et bien dévouées qui, elles aussi, ont quitté parents et patrie pour se consacrer plus spécialement au service du bon Dieu. Toutes les cinq appartiennent au tiers ordre de Saint-François. Sept ou huit de nos meilleures chrétiennes ont été reçues de ce tiers ordre, et chaque mois toutes ensemble ont une réunion et une instruction spéciale.\n\nMaintenant, avant de quitter nos missions de la haute Saskatchewan pour vous entretenir un peu, révérend et bien cher Père, des missions de Carlton, de l'île à la Crosse, du Cumberland et du lac Caribou, je ne veux pas passer sous silence l'immigration d'une nouvelle et nombreuse tribu sauvage sur les territoires du Nord-Ouest. Les Sioux, mécontents du gouvernement américain, qui les a trompés mainte et mainte fois, sont venus\nse mettre sous la protection du gouvernement canadien. Environ deux mille loges, ce qui doit faire une population d'au moins dix mille âmes, errent de côté et d'autre dans le diocèse de Saint-Albert. Le gouvernement semble vouloir les prendre sous sa protection, et comme on me le disait récemment au fort Saskatchewan, il est probable que ces sauvages vont recevoir une réserve de terre, comme les autres tribus de cette partie du territoire. Il est donc également probable qu'un nouveau champ de bataille va aussi s'ouvrir au zèle et au dévouement des Oblats. Un certain nombre de ces Sioux ont été baptisés par le prêtre, et il est certain que la grande majorité de la nation est naturellement portée vers le catholicisme.\n\nParlons maintenant des missions de la basse Saskatchewan proprement dite. À Grandin, mission Saint-Laurent, proche le fort Carlton, les R.R. PP. Fourmond et André ne sont pas restés oisifs. Vous pourrez en juger par les extraits de lettres que je veux vous communiquer. Cette mission, à laquelle le gouvernement a donné pour nom civil le nom même de notre Évêque bien-aimé, forme une population catholique d'environ douze cents âmes. La plupart sont des métis d'origine française, bons chrétiens, fidèles à leurs devoirs religieux, mais comme la grande généralité de leurs compatriotes, peu disposés à s'imposer des sacrifices matériels pour aider leurs Missionnaires ; quelquefois même contrecarrant, plutôt par ignorance que par mauvaise volonté, le bien que nous voudrions faire. Le R. P. Fourmond m'écrivait dans le cours de l'hiver : *Vita hominis militia super terram*. Oui la vie de l'homme, et surtout la vie du prêtre, la vie de l'apôtre est un combat continuel ici-bas. Le R. P. André a commencé la lutte cet automne avec un ministre protestant : il s'agissait de faire opter les sauvages du lac Canard entre le prêtre ou le ministre. Le chef, encore insidieux,\naurait bien voulu avoir l’un et l’autre sur sa réserve, dans l’espoir sans doute de recevoir d’eux le plus possible, non pas précisément l’instruction, mais du thé, du tabac, des vivres, etc., etc. La question devenait de plus en plus brûlante quand le R. P. André, s’adressant au chef, lui parla, dit-on, à peu près en ces termes : « Si tu demandes le prêtre et le ministre, sais-tu ce qu’on dira de toi partout ? Eh bien ! l’on publierait que tu étais le plus bête ou le plus mauvais des sauvages ; un prêtre ne suffirait pas pour t’instruire ou te convertir, il te fallait encore un ministre. » Cet argument d’un nouveau genre eut un succès complet. « Tu as raison, répondit le sauvage, je ne veux pas qu’on dise que je suis si bête ou si méchant, je ne veux que toi pour m’instruire moi et les miens. » Quelques mois plus tard le R. P. André sommait ses Indiens de tenir leur parole et de présenter au moins leurs enfants au baptême. Une réponse évasive, c’est tout ce que le Père put en tirer pour le moment. Néanmoins, ils demandent instamment qu’un prêtre réside continuellement avec eux et qu’on leur procure une école ; alors, disent-ils, ils embrasseront tous le catholicisme. Sur ces entrefaites le P. André va porter la guerre sainte au lac de Sable, à une journée de là. Il est enchanté des dispositions des sauvages : magnifique réserve, lac poissonneux, terre fertile, population d’environ deux cents loges ou huit à neuf cents âmes au moins. Un moment l’opposition menace de lever la tête, mais le chef se déclare hautement pour le Père ; la concorde se rétablit, les mariages sont bénis, plusieurs enfants reçoivent le baptême.\n\nD’un autre côté le R. P. Fourmond combat de toutes ses forces. D’abord il s’agit d’une école qu’un métis plus entreprenant veut ériger et surveiller comme il l’entend. Ce sera une école anglaise d’où l’instruction religieuse devra être bannie, sous prétexte de perte de temps. Enfin\ncette école tombe pour ne plus se relever. Pendant ce temps, conformément à l'approbation donnée par Mgr Grandin, les Pères de Saint-Laurent se mettent en frais pour construire une maison convenable pour trois sœurs de charité qui doivent nous venir du Canada. Il s'agit d'avoir là un pensionnat de demoiselles dirigé par des sœurs. Là l'instruction religieuse ne sera point oubliée et la nouvelle mission qui se fonde au lac Canard à sept milles de Saint-Laurent, sous le vocable de Notre-Dame du Sacré-Cœur, est appelée à faire un grand bien dans le diocèse de Saint-Albert, mais, pour cela, il nous faut nécessairement des ressources et des sujets. Plusieurs protestants ont bien voulu souscrire pour une centaine de francs. L'ouvrier charpentier qui, le premier, a travaillé à cette mission a tout récemment abjuré le protestantisme. Il a travaillé pour le Sacré-Cœur, il en a reçu aussitôt sa récompense. Les Pères de Carlton ont été aidés à diverses reprises dans leurs travaux apostoliques par le R. P. Moulin, qui, chaque printemps, quitte pour quelques mois sa solitude du lac Vert et vient se mettre à la disposition du P. Fourmond. Il reçoit généralement la mission d'accompagner les chasseurs à la prairie et de passer l'été avec eux. Pendant deux ou trois mois il accompagne ainsi les métis dans les pérégrinations à la recherche du buffle; hommes, femmes et enfants reçoivent de lui l'instruction religieuse et sont préservés de la plupart des dangers auxquels cette vie de camp les expose nécessairement. Ce printemps le R. P. Moulin doit attendre à Carlton le R. P. Lestanc, et tous les deux partiront de là pour aller rejoindre quelques camps sauvages qu'ils évangéliseront tout l'été.\n\nBien des fois, depuis que cette jeune église de Saint-Albert lui a été confiée, la sollicitude pastorale de Mgr Grandin s'est portée sur le pauvre district de Cum-\nherland. Cette partie du diocèse, nécessairement négligée faute d'ouvriers apostoliques, est restée ensevelie dans les ténèbres de l'infidélité ou est tombée au pouvoir de l'hérésie. Là, le protestantisme avait eu carte blanche; pas de prêtres, pas d'établissements, pas de missions catholiques; aussi avait-il su profiter de ces circonstances, bien douloureuses pour nous, pour s'implanter aussi solidement que possible dans ce district abandonné. L'excellent P. Gasté, seul au lac Caribou, à des centaines et des centaines de milles, sans autre moyen de transport que les berges de la compagnie, une fois par année, et ses chiens et ses raquettes pendant l'hiver, a toujours fait tout en son pouvoir pour visiter les trop rares catholiques dispersés dans le district, tout en s'occupant nécessairement d'une manière spéciale de ses Montagnais et de ses Esquimaux du lac Caribou. Enfin, à deux reprises différentes, des compagnons lui furent donnés; des Pères lui furent envoyés à quelques années d'intervalle pour partager ses travaux apostoliques, et essayer, autant que faire se pourrait, la fondation de quelque mission dans le Cumberland. Le démon alors redoubla visiblement d'efforts et de ruses de tout genre pour empêcher semblable fondation. Il entassa obstacles sur obstacles, mensonges sur mensonges, pièges sur pièges; les obstacles, les mensonges et les pièges eurent malheureusement plein succès et le Cumberland resta tout entier infidèle ou hérétique. Enfin, réjouissons-nous : depuis un an, des jours meilleurs se sont levés pour ces pauvres âmes; la grâce, là aussi, opère visiblement et produit des fruits abondants. Il y a deux ans, l'excellent P. BonnalD partait joyeux pour ces missions abandonnées. Il allait se mettre en toute confiance sous la conduite du R. P. Gasté, bien résolu à se sacrifier sans réserve à ces missions qui devaient lui être confiées. Il visitait bientôt\nle district tout entier, se conciliait les esprits, les gagnait peu à peu à des dispositions meilleures ou à des sentiments moins hostiles à notre sainte Religion; puis, voyant la possibilité de réussir avec la grâce du bon Dieu, il demandait à grands cris un aide, un auxiliaire, un compa-\ngnon dévoué. Pendant ce temps, il préparait activement une fondation au fort Cumberland même et une autre au lac Pélican. L'année suivante, le jeune et excellent P. PA-\nQUETTE, immédiatement après son ordination, partait de Saint-Albert pour aller rejoindre les PP. GASTÉ et BONNALD. Je laisso à présent parler ces Pères eux-mêmes. Le R. P. BONNALD écrivait à la date du 10 mai 1877 : «Que le bon Dieu soit béni! On va donc désormais s'occuper sé-\nrieusement des âmes si abandonnées du Cumberland. On nous envoie le bon P. PAQUETTE. C'est bien l'homme qu'il nous faut. Dès son noviciat, il paraissait avoir un grand zèle, et maintenant qu'il est prêtre, il sera tout cœur pour le salut de ces pauvres sauvages. Dieu merci, nous serons encore à temps pour un grand nombre. Quelques-\nuns de nos anciens catholiques, baptisés autrefois par Mgr TACHÉ et par le R. P. VÈGREVILLE, sont passés à la religion protestante. À l'heure qu'il est, les ministres re-\ndoublent d'ardeur pour nous arrêter. Celui du fort Cum-\nberland travaille pour sa secte comme les commerçants pour les fourrures. Il a couru tout l'hiver avec son inter-\nprète dans les camps sauvages. Un autre a envoyé deux de ses sauvages les plus instruits au milieu de nos Cris de la rivière Caribou et du lac Pélican pour les indisposer contre nous. La femme d'un de nos meilleurs chrétiens, enragée protestante, a travaillé de toutes ses forces pour éloigner de moi les sauvages. Cette femme a été furieuse de ce que j'aie renouvelé le baptême à deux petites filles baptisées par son ministre. Fanatique au premier degré,\nelle m'en veut grandement, parce que j'ai reçu l'abjura-\ntion d'une de ses parentes. Une autre de ses amies a aussi manifesté le désir de devenir catholique. Mariée à un infidèle, elle presse son mari de venir se faire instruire. Je vais souvent voir ces deux braves gens; mais les ministres de l'hérésie passent après moi et s'efforcent de paralyser le bien que je voudrais faire. J'ai vu ici trente catholiques, entendu vingt-deux confessions et administré quatre baptêmes, dont deux de protestants. Plus tard, le R. P. BONNALD se rencontrait avec le P. PAQUETTE, et tous deux travaillaient énergiquement au salut des âmes. «J'ai vu le bon P. PAQUETTE à l'œuvre, dit le P. BONNALD. N'osant pas encore se lancer dans la langue crise en présence d'un confrère, il allait trouver les sauvages à l'écart, caressait les enfants, adressait à tous de pieuses exhortations. Il est aimé des siens et s'est fait dans tout le district une réputation de médecin habile et charitable. Nous sommes bien venus au lac Pélican, et je suis convaincu que bien des égarés reviendront au bon Dieu. »\n\nDe son côté, le R. P. PAQUETTE lui-même me mandait tout récemment : «Vous ne sauriez croire tout le bien qu'il y a à faire au Cumberland et comme ces chers chrétiens sont bien disposés. Depuis que je suis ici, j'ai visité plus de cent cinquante catholiques et reçu quatorze abjurations. Dans quelques semaines, j'en recevrai deux autres et conférerai le baptême à deux vieux infidèles. J'ai de l'ouvrage par-dessus la tête. L'automne dernier, je suis allé planter ma tente à la porte même du ministre. Bientôt j'ai eu jusqu'à quarante personnes au catéchisme. Quelques fanatiques furieux ont été jusqu'à jeter des pierres dans ma tente pendant la nuit; mais tout cela m'est fort indifférent, pourvu que je gagne des âmes au bon Dieu en les retirant des ténèbres de l'infidélité ou des erreurs de l'hérésie. Ici, je fais chaque jour deux\nlongues heures de catéchisme, et j’ai le bonheur de vous annoncer que, dans quelques jours, je vais baptiser le cuisinier du fort. Mais, le croiriez-vous? C’est un Prussien, un vrai Prussien. Qui aurait pensé que je trouverais jusque dans le fond du Nord un Prussien égaré, auquel je conférerais le saint baptême après avoir reçu son abjuration? »\n\nÀ la date du 13 juillet 1877 et du 14 janvier 1878, le bon P. Gasté écrivait du lac Caribou : « Le R. P. Bonnald, après être allé passer près de deux mois chez les sauvages, nous revenait la veille du dimanche des Rameaux. Pendant sa pénible mission, il a fait beaucoup de progrès dans la langue montagnaise, dont il a saisi la clef et la prononciation. Nos fêtes de Pâques ont été splendides et nous avons été réjouis par l’affluence de nos sauvages. J’ai baptisé l’ancien interprète du maître d’école protestant du lac la Hache; le voilà donc, ainsi que son beau-fils, gagné à notre sainte religion. Sa fille a également abjuré; il lui reste un fils, qui fera bientôt aussi son abjuration. Depuis Pâques, j’ai vu beaucoup d’Indiens que j’attendais pour la fête et qui n’avaient pu venir. Tous, ou à peu près, se sont approchés du sacrement de pénitence. Un bon métis, du nom d’Antoine Morin, nous a puissamment aidés auprès des sauvages. Il n’a cessé de les exhorter avec l’ardeur d’un véritable apôtre. Il parlait avec tant d’onction que les larmes coulaient continuellement de ses yeux. C’est à cette occasion que notre chef nous disait : « Ah! si cet Antoine eût toujours été ici, il y a longtemps que tous mes parents priaient. »\n\nÀ la première procession de la Fête-Dieu, nous n’avions guère qu’une centaine de personnes; nous retardâmes la seconde pour donner à tous le temps d’arriver, et nos chers chrétiens y assistèrent en grand nombre. J’ai conféré le baptême à deux insidèles et baptisé sous condi-\ntion cinq adultes protestants qui rentraient dans le sein de l'Eglise catholique. Parmi nos chrétiens, tant métis que sauvages, les communions deviennent, Dieu merci, plus fréquentes que par le passé. Ainsi, j'ai plusieurs Indiens qui s'approchent régulièrement chaque semaine de la table sainte. Un jeune homme du fort est aussi admis à la communion hebdomadaire. Au Cumberland, le bon P. Paquette est bien l'homme qu'il nous fallait. Oh! si nous pouvions avoir encore un Père et deux Frères! Combiné aussi il serait urgent que les deux postes du grand Rapide et du lac Pélican fussent munis au plus tôt d'un bon Missionnaire! Le mouvement de retour que nous avons remarqué s'accentue de plus en plus, et les pauvres sauvages du lac Fendu, qui fréquentent maintenant le lac Pélican, méritent assurément toute notre sollicitude par les excellentes dispositions qu'ils manifestent. En voici un exemple: l'été dernier, le R. P. Bonnald leur avait promis de se trouver au lac Pélican à l'automne. Malheureusement, il lui fut absolument impossible de tenir sa promesse. Néanmoins, les sauvages furent exacts au rendez-vous, les uns pour recevoir le baptême, les autres pour faire baptiser leurs enfants. Grand fut alors leur désappointement de ne pas trouver le Père; ils en éprouvèrent une peine bien vive, mais n'en furent nullement ébranlés. Dans le même temps, en effet, ils furent visités par un ministre qui séjourna plusieurs jours au milieu d'eux. En vain essaya-t-il d'attirer à ses prêches nos bons catéchistes et de baptiser leurs enfants, aucun ne voulut l'entendre, aucun ne consentit à recevoir de lui le baptême. Et voilà déjà trois ans qu'on leur a promis de bâtir chez eux, qu'on a commencé à préparer les bois nécessaires, et rien ne se fait, faute d'ouvriers. Le bon F. Nemoz a bâti cette année au fort Cumberland. Puisque la chose est entre vos mains, pendant la longue absence\nde Monseigneur, je vous supplie bien, cher Père, de nous laisser le F. NEMOZ pour bâtir ce printemps au lac Pélican. C'est là une construction urgente et importante. Je compte si bien sur l’autorisation que je vous demande, qu’à raison de la difficulté des communications, dans l’impossibilité de faire autrement, je garde le bon F. NE-\nMOZ jusqu’à ordre contraire. »\n\nComme de raison, révérend et bien cher Père, à la ré-\nception de cette lettre du bon P. GASTE, j’ai de suite écrit\nà l’excellent F. NEMOZ, pour lui dire de rester un temps\nindéterminé dans ce district de Cumberland, qui semble\nentendre vouloir se convertir de l’infidélité et de l’hérésie à\nla religion toute sainte et toute divine de notre bon\nSauveur.\n\nIl me resterait maintenant à vous entretenir des mis-\nsions de l’île à la Crosse, confiées à l’excellent P. LEGEARD\net à ses deux intrépides compagnons, les RR. PP. LEGOFF\net CHAPELIERE. Je préfère laisser au R. P. LEGEARD le\nsoin de le faire lui-même. Il le fera beaucoup mieux et\navec connaissance de cause plus parfaite. Je n’ai, du\nreste, aucun document suffisant sous la main pour un\nrapport exact de cette importante mission, que le bon\nP. LEGEARD dirige avec tant de zèle et de sollicitude, mal-\ngré son état de souffrances presque continuel. Par cette\nlongue lettre que je m’empresse de terminer, vous pou-\nvez voir, mon révérend et bien cher Père, une chose bien\nconsolante, bien encourageante pour nous, c’est que le\nbon Dieu et Marie Immaculée bénissent notre ministère :\n*Soli Deo honor et gloria et nobis absit gloriarì nisi in cruce\nDomini et in infirmitatibus nostris.* Demandez pour nous\ntous au bon Dieu, et pour moi en particulier, que nous\nsoyons bien humbles, bien zélés, bien fidèles à nos\nsaintes Règles, afin que nous attirions sur nous et sur\nnos œuvres les bénédictions du Ciel ; demandez pour\nnous, à notre Mère Immaculée, qu'elle nous obtienne de son divin Fils la grâce de marcher sur les traces de l'Évêque bien-aimé qui nous a été donné pour nous guider et nous conduire. Puisse ce Père vénéré nous revenir bientôt, parfaitement rétabli et accompagné d'une nombreuse caravane d'apôtres !\n\nAgréez, très-révérant et bien cher Père, l'expression de l'affection bien sincère avec laquelle je suis votre tout dévoué et humble Frère en J. M. I.,\n\nH. Leduc, O. M. I.\n\nLETTRE DU R. P. BONNALD.\n\nMission du Sacré-Cœur de Jésus, 6 juillet 1878.\n\nMON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nComme l'année dernière, à la même époque, c'est en attendant le passage des barques du lac Caribou que je vous écris ma lettre annuelle. J'aurais pu m'acquitter plus tôt de ce devoir, mais j'ai cru qu'il était mieux d'attendre jusqu'à mon retour d'un voyage chez les Cris infidèles de la rivière Nelson, voyage très-intéressant à plus d'un point de vue. Il manquait cependant à mon bonheur d'avoir un compagnon pour être témoin des admirables dispositions de ces bons sauvages, et pour attester que ce qui fera l'objet de ce récit n'est pas l'effet de l'illusion ou de l'enthousiasme.\n\nVous savez, mon très-révérant Père, que le R.P. Gasté a eu le premier l'idée d'établir une mission au lac Pélican. Dans l'été de 1874, au moment où nous traversions les prairies avec Mgr Grandin et sa caravane, le R. P. Gasté, passant ici à son retour du lac Cumberland, choi-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007626.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 31, "total-input-tokens": 42950, "total-output-tokens": 17167, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 843, 1], [843, 2774, 2], [2774, 4414, 3], [4414, 6020, 4], [6020, 7923, 5], [7923, 9830, 6], [9830, 11739, 7], [11739, 13662, 8], [13662, 15520, 9], [15520, 17377, 10], [17377, 19243, 11], [19243, 21183, 12], [21183, 23036, 13], [23036, 24910, 14], [24910, 26773, 15], [26773, 28704, 16], [28704, 30574, 17], [30574, 32463, 18], [32463, 34353, 19], [34353, 36260, 20], [36260, 38136, 21], [38136, 40035, 22], [40035, 41964, 23], [41964, 43832, 24], [43832, 45734, 25], [45734, 47662, 26], [47662, 49524, 27], [49524, 51386, 28], [51386, 53280, 29], [53280, 55123, 30], [55123, 56570, 31]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]