[{"id": "854d51ddc08f1b6f5fd79e9818359a9116f36c89", "text": "MISSION DE PRINCE-ALBERT.\n\nEXTRAITS DU JOURNAL DU R. P. ANDRÉ.\n\nPrince-Albert, le 22 mars 1885.\n\nLa crise que nous redoutions depuis longtemps vient de se déclarer. Riel a levé l'étendard de la révolte, et a entraîné les métis français du district dans sa rébellion. Le pays est dans un état d'excitation qu'il m'est difficile de décrire, et Dieu sait par quelles scènes de désordres et par quels malheurs nous allons passer avant que la tranquillité soit rétablie. Nos gens, qui sont, grâce à l'instigation de Riel, la principale cause du trouble, en deviendront aussi les victimes. Déjà, au printemps de l'année dernière, avec quelle anxiété nous avons suivi le mouvement des esprits ! Nos gens tenaient des conciliabules secrets, dont le but était d'aller chercher Riel dans les États et de le rappeler dans le pays, comme le seul homme capable de porter remède aux maux dont ils prétenaient souffrir. Nous nous étions opposés énergiquement à ce projet, mais nos remontrances ne furent pas écoutées, et nous fûmes éconduits parce que nous désapprouvions comme dangereuse l'arrivée de cet homme parmi nous. Nolin, l'Epine, Gabriel Dumont furent les principaux auteurs de ce mouvement, et c'est sur eux que retombe la responsabilité des tristes événements dont nous allons être témoins.\n\nRiel arriva à Saint-Laurent dans le courant du mois de juillet, et fut accueilli par ses compatriotes comme un libérateur. Ma première entrevue avec cet homme me fit comprendre de suite combien nous devions le tenir pour suspect. L'air mystique, le ton religieux qu'il affectait dans ses conversations, les dehors affables et humbles qu'il savait revêtir, tout en lui était de nature à tromper les simples et les ignorants; nos gens le considéraient comme un héros et lui reconnaissaient les qua-\nlités qui distinguent un génie et toutes les vertus qui caractérisent un saint. Mais sous ce masque se cachaient un orgueil diabolique et une ambition démesurée. Dans son cœur gronde une haine sourde contre toute autorité, excepté bien entendu la sienne ; les prêtres et les évêques lui sont odieux, et il emploie toute son influence auprès des métis pour les tourner contre leur clergé. Dès qu’il a vu que nous n’entrions pas dans ses idées et que nous contrariions ses vues politiques, il n’a cessé de semer dans l’esprit de nos pauvres métis la défiance contre nous ; faisant entendre que la doctrine que nous leur prêchions n’était point celle de Jésus-Christ, mais que nous étions des adulateurs du gouvernement, payés pour soutenir son autorité, et qu’il fallait par conséquent se tenir en garde contre l’influence du clergé. Les prêtres et les évêques étaient l’objet continuel de ses entretiens ; il nous louait quand nous étions présents, pour nous attaquer plus vivement ensuite. En arrivant dans le pays, il a commencé à agiter les esprits dans de fréquentes assemblées où il faisait miroiter aux yeux de son monde un avenir brillant. L’excitation est allée en grandissant, et Riel devenait de plus en plus provocant et menaçant dans son langage. J’avais des luttes terribles avec lui, et j’excitais tellement sa colère qu’il perdait alors tout empire sur lui-même ; il devenait dans ces moments un vrai maniaque, se tordant en contorsions, dans une fureur qui le rendait méconnaissable. Je le contredisais ouvertement devant ses gens, lui montrant l’énormité et la folie de ses projets, l’appelant un ignorant et un visionnaire, qui se complaisait à des rêves et à des plans insensés. J’avertis nos gens, et cela plusieurs fois devant lui, des dangers qu’il y avait à soutenir un pareil homme. Je ne me cachais pas pour dire que cette agitation ne pouvait finir que par la guerre, altérer sur eux toutes sortes de malheurs et couvrir le pays de\nruines et de sang. Mes avertissements, joints à ceux de mes confrères, faisaient une grande impression sur nos gens, et ils commençaient à voir l'abîme où Riel voulait les entraîner. Aussi plusieurs se détachèrent peu à peu de lui, même parmi ses principaux partisans, et il y avait déjà scission dans le camp. Nolin avait rompu avec Riel, et les plus intelligents le suivaient. Riel se voyait perdu, et il ne lui restait d'autre parti à prendre que de se réfugier dans les États. Le gouvernement, troublé par les rumeurs qui lui arrivaient de toutes parts sur les menées de cet homme, avait résolu de le faire arrêter ; aussi avait-il augmenté considérablement ses forces à Carlton ; les gens de Prince-Albert, également excités par toutes ces nouvelles, commencèrent à s'organiser pour se défendre en cas d'attaque. Riel, avec Gabriel Dumont, tenta alors un coup de désespoir. Le 17 mars, ils parcoururent toutes les maisons le long de la rivière, priant les gens de se rendre pour l'amour de Dieu à Saint-Antoine, à l'effet d'y tenir une assemblée. Peu d'entre eux se rendirent au rendez-vous, mais Riel, suivi de quatorze ou quinze hommes armés, traversa la rivière le 18 au matin, alla prendre possession du magasin de Walter et s'empara des munitions et des effets qu'il contenait. Le même jour, plusieurs trains chargés de farine furent arrêtés à Batoche et saisis. Riel envoya immédiatement des messagers partout pour avertir les hommes de se rendre au plus vite et en armes à Saint-Antoine, car la police venait pour l'arrêter. Près de soixante se rendirent à cet appel, dans la nuit, la veille de Saint-Joseph. Le matin, Walter avec son homme fut fait prisonnier. L'agent des sauvages qui visitait la réserve de ce côté de la rivière fut également arrêté. Les poteaux du télégraphe furent coupés et l'insurrection fut ouvertement proclamée. Plusieurs parmi les métis, et on peut dire la majorité, épouvantés de ces excès, craignirent de se compromettre, et refusèrent\nde répondre à l'appel de Riel; de ce nombre fut Charles Nolin. Mais Riel organisa bien vite des bandes de dix à douze hommes, qui reçurent ordre de visiter toutes les maisons et de forcer les récalcitrants, sous peine de mort immédiate, de se joindre à lui à Saint-Antoine. Les malheureux furent poussés comme une bande de moutons, amenés à Saint-Antoine et enrôlés de force dans l'armée rebelle. Charles Nolin se cacha pendant deux jours chez le P. Fourmond, mais il fut découvert, et ramené à Saint-Antoine, et là il fut, sous peine de mort, forcé de se prononcer pour le mouvement. William Boyer fut également condamné à mort, ainsi que Louis Marion. Devant cette perspective (la mort), ils firent leur soumission et reconnurent le gouvernement de Riel. Le premier acte du nouvel autocrate fut de s'emparer par force de l'église de Saint-Antoine, pour en faire son quartier général. Les protestations du pauvre P. Moulin ne servirent qu'à l'irriter, Riel menaça le pauvre Père de l'arrêter et de le lier comme un prisonnier, s'il continuait de s'opposer à son dessein. L'église fut donc envahie à main armée et devint le quartier général de Riel et de ses gens. « La Providence, qui prévoyait ce mouvement miraculeux, disait-il à ses recrues, avait préparé cette église pour leur servir de forteresse, et Saint-Antoine allait devenir célèbre dans l'histoire comme le lieu d'où sortirait l'émancipation du Nord-Ouest. »\n\nVendredi matin, 20 mars, pendant que je disais la messe chez les Sœurs, M. Thomas Mac Kay vint chez moi en toute hâte; quelle ne fut pas ma douleur quand j'appris par lui que la rébellion avait éclaté parmi les métis; que Riel avait pillé des magasins et arrêté plusieurs personnes et qu'il se préparait à marcher sur Carlton, pour descendre ensuite sur Prince-Albert ! Je me rendis immédiatement chez M. Clarke, qui me confirma ces tristes et lamen-\ntables nouvelles. Deux messagers étaient arrivés, dans la nuit, de Carlton, de la part du major Crozier, suppliant les citoyens d'aller en toute hâte à son secours. La police, en effet, ne se sentait pas en nombre pour résister à Riel, si elle n'était pas appuyée par les gens de Prince-Albert. Pour m'assurer de la vérité de ces faits, je suis allé chez M. Clarke, arrivé de Winnipeg la veille. La chose n'était que trop vraie, et il me donna certains détails qui me démontrèrent la gravité de la situation. Vous dire la consternation que cette nouvelle répandit dans Prince-Albert est chose impossible. Les citoyens s'abordaient tout effarés, en se demandant comment tout cela allait finir. L'idée que les sauvages allaient se joindre aux métis jetait l'épouvante dans tous les esprits; on voyait déjà le pays livré au meurtre et au pillage. Mais les citoyens de Prince-Albert déployèrent alors un courage et une énergie à la hauteur des circonstances. M. Clarke, le vendredi 20 mars, de bon matin, les fit rassembler, afin de prendre des mesures pour repousser une attaque, et on fit un appel aux hommes décidés, pour aller au secours du major Crozier, qui s'attendait à être attaqué à Carlton par Riel et sa bande. Soixante-quinze hommes s'offrirent généreusement pour aller à Carlton, et le jour même, à deux heures après midi, ils partirent au milieu des acclamations des gens de Prince-Albert. Mais, parmi les spectateurs, il y en avait plusieurs qui ne pouvaient contenir leur émotion et qui pleuraient. On ne savait, en effet, quel serait le premier point d'attaque de Riel : serait-ce Carlton ou Prince-Albert ?\n\nJe résolus de me porter directement à Saint-Laurent pour me rendre compte de la situation. Je ne pouvais croire que la majorité de nos gens eût été assez aveuglée pour prendre part à une rébellion coupable, devant entraîner leur ruine et celle de leurs familles. Après avoir rassuré\nde mon mieux les pauvres Sœurs, qui, je dois le dire, se montraient courageuses, je me mis en route le vendredi, vers onze heures du matin, accompagné de mon jeune homme Damase. Je pris la direction de Saint-Louis-Langevin, afin de voir les métis échelonnés le long de la branche sud de la Saskatchewan. Environ à 10 milles de Prince-Albert, je rencontrai un métis du nom d'Alexandre Macdougal, qui se sauvait pour se réfugier à Prince-Albert. Il me dit que je ne trouverais pas un seul homme à partir de chez les Boucher jusqu'à Saint-Antoine ; tous avaient été enrôlés de gré ou de force par Riel. Je revins donc sur mes pas à Prince-Albert, et j’arrivai assez à temps pour être témoin du départ des volontaires pour Carlton. Je dis à M. Clarke que la situation était plus sérieuse que je ne l’avais pensé, que tous les métis, sans exception, étaient rassemblés en armes à Saint-Antoine et qu’ils allaient attaquer Carlton. À quatre heures du soir, le même jour, je me mis de nouveau en route, et cette fois pour me rendre directement à Saint-Laurent en prenant la direction de Carlton. Je savais à quoi je m’exposais en allant à Saint-Laurent, car, si je venais à tomber entre les mains de Riel, il ne m’épargnerait pas, exaspéré qu’il était contre moi, par suite de la vive opposition que j’avais faite à ses abominables projets. Arrivé au Creek, qui coule à Macfarlane, sur la route de Saint-Laurent, après avoir laissé le chemin de Carlton, je vis venir cinq ou six trains du côté de Saint-Laurent. Les gens qui les composaient me dirent qu’ils venaient de Troy, qu’en passant à Batoche Riel les avait arrêtés, et qu’après les avoir dépouillés de toute la farine qu’ils frétaient pour la Compagnie, il les avait laissés aller. Les nouvelles qu’ils me donnèrent m’épouvantèrent. Riel avait armé les Sioux comme les Cris et avait envoyé partout du tabac pour appeler les sauvages à son secours. C’était une guerre d’extermination qui\ncommençait. Les pauvres femmes que je rencontrai sur mon chemin étaient à moitié mortes de frayeur. Ces hommes dirent aussi qu’il y avait une garde placée à Saint-Laurent pour m’attendre et que, si je tombais entre les mains de Riel, j’étais perdu et que je ne retournerais jamais à Prince-Albert. Ils avaient entendu Riel, durant leur séjour forcé à Saint-Antoine, s’exprimer sur mon compte, d’une façon qui ne laissait aucun doute dans leur esprit sur le sort qui m’était réservé, si j’allais à Saint-Laurent. Je ne craignais pas cependant d’être tué ; mais j’avais la certitude d’être fait prisonnier et de voir les Sœurs abandonnées à Prince-Albert, sans prêtre pour les assister dans cette terrible épreuve. Mon devoir me parut être de retourner à Prince-Albert et d’y rester comme au poste que l’obéissance m’avait assigné. Je rebroussai donc chemin, et j’arrivai à trois heures après minuit. Les pauvres Sœurs furent au comble de la joie de me voir, car elles étaient dans la désolation en pensant que je ne retournerais pas, tout faisant croire que Riel me tuerait ou me retiendrait prisonnier. Ici, je suis sans communication aucune avec les Pères du district : ni le P. Fourmond ni le P. Moulin ne m’ont envoyé le moindre mot.\n\nC’est le 19, fête de saint Joseph, que le gouvernement provisoire fut établi à Saint-Antoine ; il commença par le pillage et la profanation de l’église. Riel a pour drapeau un étendard sur lequel sont écrits les dix commandements de Dieu. Tout, dans cet homme, est une insulte à notre sainte religion.\n\nLe samedi et le dimanche furent pour nous des jours d’anxiété et d’inquiétude. Nous nous attendions à voir Riel et ses gens descendre sur Prince-Albert, et y mettre tout à feu et à sang. Le danger était d’autant plus grand que nos hommes les plus vigoureux étaient partis pour\nCarlton et que nous n'étions pas trop bien organisés pour repousser une attaque ; de plus, nous savions que les métis anglais qui nous entouraient sympathisaient avec Riel et ses gens, et que la peur seule les empêchait de se joindre à lui. Nous savions aussi que les émissaires de Riel parcouraient tout le pays, pour fomenter la révolte chez les métis et les sauvages. Le secours de 450 hommes, qui nous était annoncé comme devant venir de Troy, n'arrivait pas, et l'on ne savait à quoi attribuer ce retard. Peut-être les hommes de Riel avaient-ils coupé le détachement, et malheur à nous si le chef rebelle était victorieux dans la première rencontre avec les troupes du gouvernement ! On était dans une inquiétude mortelle, et un doute terrible pesait sur tous les esprits.\n\nSamedi, Louis Marion arriva à Prince-Albert ; il s'était échappé des mains de Riel, qui lui avait donné le choix de se joindre à lui ou de mourir. Les nouvelles qu'il nous apportait de Saint-Antoine n'étaient pas de nature à nous rassurer. Riel agissait en despote, et tous ceux qui s'opposaient à son autorité et refusaient de se joindre à lui étaient, sans forme de procès et par sa seule autorité, condamnés à mort. Nolin, William Boyer, avec Louis Marion, avaient déjà reçu leur sentence de mort, laquelle avait été commuée à la condition de prendre les armes pour la défense commune. C'est dans l'église que se passaient ces scènes ; là Riel, comme un tribun, haranguait les ignorants, qui approuvaient par leurs cris et leurs applaudissements. La terreur était dans tous les cœurs, et personne n'osait protester contre la conduite de ce furieux, qui affectait la piété et la religion. Il faisait un signe de croix et une prière avant de porter une sentence de mort ; debout, devant l'autel, il parlait durant de longues heures ; les\nprêtres et les évêques étaient l'objet de ses diatribes et invectives; il avait soin, toutefois, de semer ses discours de certains éloges en notre faveur, avant d'enfoncer le trait empoisonné destiné à détruire notre autorité dans l'esprit de ces pauvres gens. Mais, malgré les assurances si répétées de Riel que Dieu était avec eux; qu'un grand miracle se ferait en leur faveur, que leur cause triompherait sans effusion de sang; que partout le Nord-Ouest se soulevait; que Battleford était entre les mains des sauvages et Winnipeg en pleine révolte, et enfin que Saint-Albert et Edmonton prenaient part au mouvement; l'inquiétude était dans tous les cœurs, et les malheureux se demandaient quelle serait l'issue d'une lutte dans laquelle ils avaient été entraînés de force. Les familles étaient dans les transes; les pauvres femmes et les enfants, laissés seuls dans les maisons, étaient en proie à toutes les terreurs. Personne cependant n'osait exprimer hautement son opinion, chacun voyant dans son voisin un espion qui pouvait le trahir. Samedi matin, M. Mac Kay, plein de compassion pour ses malheureux compatriotes, et mû par un sentiment de générosité digne d'admiration, se rendit seul au camp de Riel, à Saint-Antoine. Riel, qui le redoutait, voulut l'arrêter et l'empêcher de parler à ses gens; mais M. Thomas Mac Kay, sans se laisser troubler par ses menaces, parla hardiment devant les métis assemblés et leur représenta la situation dangereuse dans laquelle ils se mettaient. Riel et Gabriel voulaient l'arrêter; mais Emmanuel Champagne exigea que M. Mac Kay eût pleine liberté de parler, attendu que tous les métis le connaissaient comme un honnête homme, animé des meilleures dispositions à l'égard de ses compatriotes. Enhardis par les paroles de Champagne, plusieurs prirent parti pour M. Mac Kay. Riel, intimidé par cette manifestation de l'opinion publique, s'excusa de ses gros-\nsièretés, et M. Mac Kay déclara que le gouvernement exigeait qu'on lui délivrât Riel et Gabriel, comme les deux auteurs responsables de la rébellion ; mais les métis refusèrent cette condition.\n\nAujourd'hui, 25 mars, j'ai vu M. Mac Kay qui est venu pour un moment à Prince-Albert. Les métis lui ont assuré qu'ils avaient été entraînés dans cette révolte contre leur volonté, et son opinion est qu'il n'y aura point de bataille ; que les métis, devant le déploiement de forces opéré par le gouvernement, allaient se rendre, toute résistance étant impossible. Aujourd'hui, ils sont retenus par la crainte qu'ils s'inspirent mutuellement.\n\nHier au soir, nous avons enfin été délivrés d'une grande inquiétude, le secours que nous attendions avec une si vive impatience étant arrivé à Prince-Albert à huit heures. Il fallait entendre les cris de joie avec lesquels les 150 hommes ont été accueillis par la population ; toute crainte d'une attaque de la part de Riel est maintenant passée, et son règne éphémère touche à sa fin : 300 hommes venant de Winnipeg vont arriver dans trois ou quatre jours. Riel n'a pas plus de 300 hommes sous ses ordres, y compris les sauvages, et c'est l'appel aux sauvages qui a soulevé le sentiment public contre lui. Les gens de Prince-Albert ont fait preuve d'un grand dévouement et d'une grande unanimité de sentiments. Devant le danger toutes les divisions ont cessé. Les hommes se sont gaiement offerts pour veiller pendant la nuit, et pour parcourir le pays dans toutes les directions comme éclaireurs, afin d'observer les mouvements de l'ennemi, et c'est en effet cette vigilance et cette activité qui l'ont déconcerté. Les espions circulaient parmi nous, car, comme je l'ai dit, les métis anglais étaient en parfaite union de sentiments avec Riel, mais ils ne voulaient se prononcer qu'en toute sûreté. La nouvelle nous ar-\nrive aujourd'hui, 25 mars, que Riel a envoyé la nuit dernière 40 hommes de ses gens les plus déterminés pour aller recruter à domicile les métis anglais et les traîner de force à Saint-Antoine, afin qu'ils viennent prendre part au danger commun et qu'ils ne puissent se retirer en arrière quand la lutte sera engagée. D'après les ouï-dire ils ont pris un grand nombre d'hommes qui leur seront plutôt un embarras qu'un secours.\n\n25 mars. Maintenant que la sécurité est assurée pour Prince-Albert, je suis en repos au sujet des personnes confiées à mes soins. Mais je suis grandement effrayé pour nos pauvres gens de Saint-Antoine qui continuent dans leur rébellion contre le gouvernement.\n\n26 mars. Des forces considérables arrivent de toutes parts pour écraser Riel. Outre les 450 hommes arrivés avant-hier, il y a en chemin 300 hommes qui viennent de Winnipeg avec une batterie de 18 canons. Ces hommes sont partis dimanche de Troy, et ont ordre de faire une marche forcée ; ils seront dans un jour ou deux à Saint-Antoine. Aujourd'hui, les 150 hommes arrivés récemment se rendront à Carlton pour y rejoindre les 300 qui sont déjà là, et le corps de troupes, qui pourra monter au moins à 400 hommes, va diriger une attaque contre Riel aussitôt que les 300 hommes de Winnipeg seront arrivés. Déjà plusieurs essais d'accommodement ont échoué ; Riel et les métis semblent vouloir persister dans leur rébellion. Le major Crozier exige que Riel et Gabriel Dumont se rendent à discrétion et que les autres se dispersent ; ces deux hommes, âmes de la rébellion, refusent toute condition ; ils intimident et poussent à la résistance les gens qu'ils ont enrôlés.\n\n27 mars. Les nouvelles qui nous sont arrivées cette nuit de Carlton sont désolantes et jetent l'épouvante\ndans tous les cœurs. Les hostilités ont commencé hier, 26 mars, environ à deux heures après-midi. Les troupes du gouvernement se composaient surtout des citoyens de Prince-Albert partis vendredi, 20 mars, pour aller au secours de la police en garnison à Carlton. Les volontaires formaient la majorité et le corps montait à environ 80 hommes. Les métis et les sauvages, de leur côté, pouvaient composer un corps de 100 à 120 hommes, mais les métis français faisaient la force de ce parti. L’engagement a eu lieu à environ 1 mille du lac Canard, sur le chemin de Carlton, proche la réserve du Barbet. Les troupes du gouvernement ont essuyé une sérieuse défaite et ont été obligées de battre en retraite. Onze hommes ont été tués de leur côté et il y a plusieurs blessés, parmi lesquels on compte le capitaine Moore. Elliot et son commis ainsi que neuf citoyens de Prince-Albert, dont deux policemen, ont été tués ; on ne connaît pas le nombre des tués parmi les métis. Cette nouvelle a répandu la terreur à Prince-Albert, les habitants sont affolés de peur ; on s’attend à chaque instant à voir Riel avec sa bande de métis suivis des sauvages, fondre sur nous et mettre tout à feu et à sang. On abandonne les maisons pour se réfugier dans une espèce de fort qu’on a construit dans la ville. Ce soir, les Sœurs seront obligées, elles aussi, d’abandonner leur maison pour se réfugier dans le camp retranché ; mais la supérieure, avec deux autres Sœurs, veut rester pour garder le couvent, et je crois qu’il n’y a aucun danger pour elles. Le sentiment de la foi n’est pas assez éteint chez Riel pour qu’il ose s’en prendre à ces saintes femmes contre lesquelles il n’entretient, du reste, aucun sentiment d’animosité ; quant à moi, je ne puis espérer aucun quartier de la part de ce fanalique que le succès ne rendra que plus cruel. Maintenant que le sang a coulé, la guerre va\nprendre un caractère sauvage et cruel : nos pauvres métis seront exterminés ; le gouvernement ne reculera devant aucun moyen pour réduire la rébellion, et Dieu sait par quelles épreuves nous allons passer. Nos tristes pressentiments ne nous ont pas trompés : nos pauvres gens sont perdus et ruinés sans ressources. C'est le délai du gouvernement à faire justice aux réclamations des métis et son refus d'écouter tous les conseils qui nous attirent ces malheurs.\n\nLes Sœurs sont fermes et résolues, et Dieu me donne aussi à moi le courage de ne pas m'effrayer au milieu de l'épouvante générale. Je ne crois pas que Riel vienne ici, obligé qu'il est de se garder contre les attaques des troupes cantonnées à Carlton : Prince-Albert est trop éloigné de sa base d'opérations ; mais on ne peut rien prévoir avec des hommes qui ne se laissent guider par aucun conseil de prudence et qui ne prennent même pas les précautions les plus élémentaires. Jusqu'ici, tous ses actes sont marqués au coin de la folie et il n'en calcule pas les conséquences. Les gens qui le suivent agissent également en aveugles et sans prévision aucune de l'avenir. Aussi, on peut s'attendre à tout de leur part, et on doit s'abandonner entièrement à la Providence qui nous protège. On dit que le commissaire Irvine doit aujourd'hui aller attaquer Riel dans ses retranchements, à Saint-Antoine : tous les cœurs sont dans l'anxiété.\n\n28 mars. Quelle nuit nous avons passée ! Hier au soir, nous avons abandonné notre maison pour nous réfugier dans une espèce de camp retranché que les hommes de Prince-Albert avaient construit près de l'église presbytérienne. On avait employé du bois de corde pour former les murs, et dans l'enceinte de ce fort, tous les gens de Prince-Albert et des environs étaient installés\navec leurs familles. Nos bonnes Sœurs, à leur grand regret, avaient dû laisser leur couvent pour prendre place elles aussi dans cet asile ; mais le malheur commun avait rapproché tous les cœurs, et je dois dire que la dame du ministre presbytérien a témoigné toutes sortes d’égards à nos religieuses, et toutes les dames le plus grand respect. C’était une confusion et un encombrement dont il serait difficile de se faire une idée. L’évêque anglais était là avec sa famille et ses ministres, et, le danger rapprochant les cœurs, l’union et l’accord régnaient parmi tous les membres des diverses religions. L’évêque anglais me pressait affectueusement les mains et me remerciait avec émotion cet après-midi de l’intérêt que je lui avais témoigné dans ses anxiétés. Voilà deux nuits que nous n’avons pas dormi. Nous nous attendions à être attaqués à chaque moment par Riel et ses alliés les sauvages. C’est l’approche de ces derniers qui frappait de terreur les imaginations ; l’on se représentait toutes les horreurs possibles ; nos meilleurs défenseurs étaient, en effet, à Carlton, et nous n’étions qu’insuffisamment préparés à repousser une attaque. Mais la grande nouvelle qui nous arrive ce matin rassure tous les cœurs. Toutes les troupes abandonnent Carlton et viennent se fixer à Prince-Albert. On a jugé qu’il était nécessaire de les concentrer sur un seul point afin de pouvoir écraser l’ennemi, s’il osait se présenter à Prince-Albert. C’est donc au milieu des acclamations du public que nos troupes ont défilé, et ont fait leur entrée à Prince-Albert. Les premiers en tête étaient les blessés dont l’état excitait la compassion universelle. Notre cher capitaine Moore s’est arrêté pour m’appeler, et c’est avec une véritable émotion que je suis allé embrasser cet ancien ami que je ne croyais plus revoir, tant les dernières nouvelles le représentaient comme\nperdu; heureusement sa blessure n'inspire aucune inquiétude. Maintenant que nous avons toutes les forces réunies à Prince-Albert, tout le monde respire à l'aise et se croit préservé. Aussi j'avais averti les Sœurs de rester tranquilles chez elles et de prendre, en toute confiance, le repos dont elles avaient un si grand besoin. On a renoncé à se réfugier de nouveau au fort. Nous étions assis tranquillement, Ambroise Fisher, Damase, mon jeune homme et moi, et nous nous réjouissions ensemble de nous voir sortis de cette situation critique lorsqu'en regardant par la fenêtre, je vois un cavalier et une bande de chevaux se dirigeant en plein galop vers Prince-Albert. Ils se précipitaient comme poursuivis par l'ennemi. Je sors pour demander la cause de ce mouvement; les hommes arrivent pâles et les yeux hagards, et, en passant devant moi, ils me crient:\n\n« Come on! they are coming, the French and the Indians! »\n\nAussitôt, de dehors, je crie aux Sœurs de sortir au plus vite et de se sauver, car l'ennemi arrive. Les pauvres Sœurs étaient au lit, et pendant qu'elles s'habillaient, je cours vers le fort pour chercher un wagon. J'arrive hors d'haleine au fort, où déjà M. Clarke commande un wagon pour elles. Le plus grand désordre et la plus grande confusion régnaient dans la ville. Les familles tout éploées et affolées de terreur sortaient de leurs maisons, ce n'étaient partout que des cris de terreur et de désespoir. J'attendais les Sœurs; elles arrivent à moitié habillées et tremblantes de peur. Il est difficile de tracer une peinture exacte du spectacle que nous avions sous les yeux: les hommes comme les femmes étaient dans les transes et s'attendaient à voir les sauvages et les métis fondre sur nous pour nous égorger et mettre tout à feu et à sang. M. Clarke était le seul qui gardait son sang-froid au milieu de cette confu-\nsion et sa voix dominait le bruit pour commander le calme et ranimer la confiance : il affirmait que c'était une fausse alarme. Peu à peu les esprits se rassurèrent en voyant que l'ennemi ne paraissait pas, mais quelle terrible nuit les femmes passèrent dans le fort, pressées et serrées qu'elles étaient les unes contre les autres ! Sous l'influence de la chaleur et de la peur, les malheureuses tombaient sans connaissance ; plusieurs furent sérieusement malades, cinq femmes accouchèrent ; les Sœurs, me racontant le lendemain les impressions de cette nuit horrible, me disaient qu'il s'était passé des scènes déchirantes. Le matin, de bonne heure, à cinq heures, j'allais les chercher pour les ramener au couvent : il n'y avait plus de danger. À six heures, je dis la messe, à laquelle assistèrent Louis Marion, Ambroise Fischer, et mon jeune homme ; bien entendu que nous n'eûmes pas de bénédiction des rameaux. Ce dimanche, il n'y eut aucun service public dans aucune église à Prince-Albert. On était trop fatigué pour prendre part aux offices.\n\n30 mars. Aujourd'hui, trois hommes, partis de Prince-Albert dimanche après midi, ont ramené les corps de ceux qui ont été tués. C'est neuf cadavres qui ont été relevés sur le champ de bataille. Une chose console au milieu des tristesses qui nous accablent : c'est de voir que les sentiments d'humanité qu'inspire notre sainte religion ne sont point éteints dans les coeurs de nos gens ; ils n'ont pas permis que les cadavres fussent mutilés par les Sioux qui les accompagnaient. Tous les corps ont été religieusement respectés et placés dans une maison peu éloignée du champ de bataille. On avait craind que ceux qui se sont dévoués pour aller les chercher ne fussent retenus prisonniers ou peut-être massacrés ; mais tout au contraire, ils se louent beau-\ncoup de la bienveillance avec laquelle ils ont été reçus.\n\nUn autre trait à la louange des métis. Un blessé laissé sur le champ de bataille a été sauvé par l'intervention de William Boyer qui a sauvé ce malheureux, au moment où un Sioux se préparait à l'achever à coups de crosse de fusil. Il avait déjà deux doigts de la main brisés, quand William Boyer est accouru à son secours. Grande foule pour visiter les morts. L'indignation et la haine contre les métis augmentent dans tous les cœurs. Les Anglais se sentent humiliés de la défaite qu'ils ont éprouvée et nourrissent des idées de vengeance contre ceux qui ont troublé la paix publique par une insurrection que rien ne justifie. Tous les colons, dans un rayon de 20 milles, se sont réfugiés à Prince-Albert, laissant à l'abandon leurs maisons et leurs animaux. La terreur règne dans tout le pays.\n\n31 mars. Aujourd'hui a eu lieu l'enterrement des neuf hommes tués au lac Canard ; c'était une cérémonie solennelle, mais lugubre. Une foule immense suivait le cortège funèbre, et tous les cœurs étaient à la douleur. Le pauvre Elliot, jeune avocat plein d'avenir, était au nombre des morts ; il a été tué avec son commis Napier. Pour donner un témoignage de respect et de reconnaissance à ces victimes qui se sont dévouées pour notre défense, je suis allé à l'enterrement. Le soir de ce jour, la femme de Louis Marion est arrivée de Saint-Laurent avec sa jeune fille. Cette femme a fait preuve d'un vrai courage en venant à Prince-Albert rejoindre son mari. Elle m'a remis deux lettres du bon P. Fourmond, et une troisième pour les religieuses de Prince-Albert de la part de leurs Sœurs de Saint-Laurent. Nous étions bien inquiets au sujet de nos Pères et de nos Sœurs. Le P. Fourmond me rassure et me dit qu'ils sont tranquilles et qu'ils n'ont pas encore été inquiétés. Mais il craint que la Mis-\nsion ne soit pillée par quelques bandes de sauvages. Ils n’ont pas un seul homme autour d’eux; leur jeune homme, Philippe, les a abandonnés après la bataille pour aller rejoindre les autres insurgés et ses trois frères déjà enrôlés dans l’armée de Riel. Lundi, les cinq tués du côté des métis ont été enterrés à Saint-Laurent; ce sont : 1° Isidore Dumont, le frère aîné de Gabriel, il laisse une veuve et quatorze enfants; 2° Augustin la Framboise, cousin germain de Gabriel, il laisse une veuve et sept ou huit enfants; 3° J.-B. Montour, jeune homme de vingt-quatre ans qui laisse une veuve et deux enfants; il était le gendre d’Isidore Dumont; 4° Joseph Montour, frère du précédent, jeune homme de vingt ans, pas marié; 5° Assiviu, sauvage chrétien. Jean-Baptiste Parentcau, neveu de Gabriel, est blessé à mort. C’est Gabriel qui, après Riel, est le principal auteur du trouble, et c’est dans sa parenté que la mort a choisi ses victimes. Gabriel lui-même l’a échappé belle: une balle lui a effleuré la tête en déchirant la peau. Ce que la femme de Marion nous raconte est bien triste. Nos métis sont plus que jamais résolus à soutenir la lutte. Les familles qui ont perdu quelques-uns de leurs membres ne ressentent aucune tristesse, et personne ne versait de larmes à l’enterrement. La bonne chère que font les révoltés et le pillage général auquel ils ont presque tous, plus ou moins, participé, les rendent joyeux et contents. Leur confiance en Riel, qui pourtant les avait assurés que pas une goutte de sang ne serait versée, ne diminue pas. Riel est allé à la bataille armé de la croix du P. Touze qu’il a prise de force, et avec laquelle il a béni les combattants, mais en ayant soin de se tenir éloigné de la portée des balles: sa personne est trop précieuse pour qu’il l’expose au danger. Il a jeté maintenant le masque et se montre tel qu’il est. Il a rompu publiquement avec l’Eglise\ncatholique en renonçant au Pape, et il a entraîné ces malheureux dans son apostasie. Ils le regardent comme un grand prophète investi d'une mission divine. Modime l'Épine lui-même le suit fidèlement et semble aveuglé. Nos malheureuses gens, sous l'influence de cet homme, ne sont plus reconnaissables. Le quartier général est au lac Canard, dans les bâtiments des Stobart. J'ai eu, ce matin, une longue conversation avec le commissaire Irwine. Il m'annonce que 2000 hommes sont en route pour venir réduire la rébellion. Il exprime un grand regret de n'avoir pu arriver quelques jours plus tôt, avant l'effusion de sang.\n\n2 avril, Jeudi saint. Quelle triste semaine sainte nous passons! Je me contente de dire la messe basse le matin et nous nous abstenons de faire aucune cérémonie en rapport avec les mystères du jour, de peur d'être surpris par l'ennemi. Tout le monde a abandonné les maisons et s'est replié au cœur de la ville où se trouve le fort qu'on y a construit pour donner asile aux familles en cas d'attaque. Nous sommes les plus éloignés; mais le système de défense est si bien organisé, que nous sommes tranquilles. Chaque jour arrivent quelques malheureux qui s'échappent du camp de Riel et viennent chercher un refuge à Prince-Albert. Hier au soir, Jous-saint, l'huissier, nous arrivait de Carlton avec un de ses garçons. Il nous dit que Riel a fait occuper Carlton par quinze de ses hommes et que le feu a épargné le plus grand des bâtiments du fort. D'après lui, la débandade et la désertion commencent parmi les gens de Riel. Ils voient maintenant l'abîme ouvert devant eux. La peur les gagne, à la pensée du compte terrible que le gouvernement va leur demander du sang si injustement répandu et du pillage qu'ils ont fait de tant de magasins. L'huissier nous dit qu'il croit que Riel a\nquitté le lac Canard et qu'il a transporté son camp à Saint-Antoine. Je plains notre pauvre Père Moulin d'être obligé de donner l'hospitalité à de pareils hôtés. L'opinion s'acerdite que Riel se dispose à prendre la fuite et à mettre sa vie en sûreté, en abandonnant ses victimes à la vindicte des lois. Il ne ferait, en cela, que suivre l'exemple de tous les auteurs de révolutions qui, au moment du danger, savent prendre la clef des champs, et laissent les malheureux qu'ils ont séduits se débattre comme ils peuvent. Ce sera, je pense, le dénouement probable de cette échauffourée. Et les infortunées dupes, que deviendront-elles? plusieurs périront sur l'échafaud. Notre colonie est entièrement ruinée, et je pense qu'il nous faudra abandonner la moitié de nos missions, et nous borner à garder Saint-Antoine.\n\n3 avril, Vendredi saint. Tout est tranquille autour de nous. L'opinion que Riel a abandonné le lac Canard et gagné Saint-Antoine prend de plus en plus de la consistance.\n\n9 avril. Les fêtes de Pâques se sont passées tranquillement. Dimanche, notre chapelle était remplie; plusieurs protestants sont venus assister à la grand'messe. Nous étions les seuls, à Prince-Albert, à avoir l'office public le jour de Pâques. Les protestants, les deux derniers dimanches, n'ont pas eu de service dans leurs églises. Tous les soirs, nous avions bénédiction du Saint Sacrement. Dimanche soir, le commissaire en chef le colonel Irvine et le major Cromier sont venus nous faire visite. Ce qu'il y a d'extraordinaire, c'est que les autorités, ici, ne connaissent pas les mouvements de Riel et ignorent complètement où il est. On est stupéfait de voir le manque d'organisation où est tombée l'administration canadienne dans le pays. Cette rébellion, que le gouvernement devait prévoir depuis long-\ntemps, l'e pris complètement au dépourvu, et il se trouve en face d'une insurrection de deux cents métis et d'une centaine de sauvages, sans aucun moyen de la réprimer. Si Riel avait eu plus d'audace, il aurait fait un mal immense; mais il paraît se tenir sur la défensive et ne sait trop à quoi se résoudre. La terreur qu'il inspire est incroyable. Il s'est déclaré ouvertement hérétique, et le monstre a la prétention de réformer l'Eglise de Jésus-Christ. Il manifeste, comme tous les sectaires, une haine infernale contre le Pape et contre Rome, et il appelle l'Eglise catholique la Vieille Romaine. Nos pauvres gens le suivent quand même.\n\n11 avril. Un courrier est arrivé ce matin de Battleford; il nous apporte les nouvelles les plus terribles et les plus lamentables. Les sauvages sont partout soulevés, et la guerre d'extermination a commencé. La main me tremble et le cœur me saigne en rapportant les faits dont on nous fait le récit. Les bons et chers PP. FAFARD et MARCHAND, avec deux Frères, ont été tués par des sauvages de la bande du Gros-Ours (Big-Bear). La Mission de Notre-Dame de Bon-Conseil, au lac La Grenouille, a été saccagée et brûlée. Delany, le fermier des sauvages; Tom Quin, l'agent des sauvages pour le district du Fort-Pitt, avec d'autres blancs, ont été tués. Battleford est assiégé par les sauvages; quatre ou cinq blancs, la plupart fermiers dans les réserves, ont été tués. Ces nouvelles ont répandu la plus grande consternation dans Prince-Albert; le peuple se dit qu'il n'a aucun quartier à attendre, puisque les prêtres eux-mêmes n'échappent pas à la férocité des sauvages. La haine et l'indignation contre Riel et les métis qu'on rend responsables de ces meurtres, augmentent d'une manière effroyable, et ces malheureux seraient épouvantés eux-mêmes, s'ils étaient témoins de l'horreur qu'ils inspirent. Je dois, dans cette circonstance malheureuse, rendre\nun tribut de justice aux sentiments manifestés par la population de Prince-Albert. Tout le monde sympathise avec nous dans le malheur qui nous frappe et exprime la plus grande admiration pour le courage et le dévouement de nos prêtres, tous inébranlables à leur poste, au risque de devenir mar'yr's de leur devoir. Les habitants comparent la conduite de nos Pères, qui restent tous à leurs Missions, malgré les dangers qui les menacent de toutes parts, avec la conduite des ministres protestants, qui tous ont déserté leurs postes pour venir se mettre avec leurs familles en lieu de sûreté. Pauvres et chers Pères FAFARD et MARCHAND! que de regrets leur mort va causer partout! Il y a trois mois, je passai au lac La Grenouille, mais j'étais loin de penser alors que cette mission allait devenir le théâtre de meurtres horribles. Le bon P. FAFARD, si dévoué aux sauvages, travaillait nuit et jour pour achever les bâtiments construits au prix de grandes fatigues. Cette Mission du lac La Grenouille présentait un aspect riant et coquet et faisait l'admiration de tout le monde. La place commençait à prendre l'apparence d'un joli village, et tout semblait lui promettre un bel avenir. Des entrepreneurs construisaient un moulin, et le cher Père se réjouissait de voir sa Mission prendre des développements si rapides. Il avait une école fréquentée par près de quarante enfants. Le dimanche que je passai au lac La Grenouille, combien je fus édifié de voir ce cher Père occupé durant toute la journée à confesser des enfants sauvages, montrant, par leur contenance et leur respect dans l'église, qu'ils savent apprécier l'instruction qu'ils reçoivent. Mais tout cela n'est aujourd'hui que ruines arrosées du sang des deux missionnaires de Notre-Dame de Bon-Conseil. Ce qui console, au milieu de ces tristesses, c'est d'apprendre, entre autres rares détails, que nos deux zélés\nconfrères ont été frappés par la main des sauvages païens, et que les chrétiens n'ont eu aucune part à la mort de leurs pères en Dieu et au meurtre des autres blancs. Ce sont les sauvages de Big-Bear qui ont commis tous ces crimes; les Pères ont été immolés, parce que, dans leur charité, ils voulaient défendre les blancs et détourner d'eux les coups qui les menaçaient.\n\n12 avril, dimanche après Pâques. Aujourd'hui, nous avons eu une grand'messe solennelle. L'église était remplie d'une nombreuse assistance, composée de catholiques et de protestants. Nous étions tous sous l'impression des terribles nouvelles reçues hier. Profondément ému moi-même, j'ai pris pour sujet de mon instruction les événements qui se déroulaient devant nous. J'appuyai, en commençant, sur les bonnes qualités qui distinguent les métis, les représentant comme bons, simples dans leurs mœurs, mais faciles à tromper et à devenir les dupes de ceux qui profitaient de leur bonne foi pour les porter à des actes dont ils ne n'entrevoyaient pas les conséquences. S'ils avaient été plus solides dans la religion, ils auraient suivi et écouté leurs prêtres, lesquels s'étaient toujours montrés leurs vrais amis. Riel n'avait pas reçu mission pour les enseigner, et aujourd'hui, ils allaient payer de leur vie leur tort de s'être laissé séduire par cet homme néfaste. Je connais nos gens depuis vingt-cinq ans, et, devant Dieu, je puis dire que c'étaient des hommes au cœur simple, bons et généreux pour tout le monde; mais leur esprit d'indépendance et la défiance que Riel leur avait inspirée contre nous ont amené leur perte. Dieu, irrité à cause des péchés du pays, avait choisi deux saints prêtres pour victimes, mais on n'accusera pas le clergé d'avoir poussé les gens à la rébellion; la mort de ces deux prêtres démontre que cette affreuse insurrection était autant dirigée contre la reli-\ngion que contre le gouvernement. Les blancs ne pouvaient pas se disculper entièrement de n’avoir aucune part à une rébellion qui bouleversait tout le pays. En venant s’établir ici, s’ils avaient eu plus d’égards pour les sentiments et la faiblesse des métis et des sauvages, on n’eût pas vu cette haine féroce qui se fait jour entre les deux races. Mais les blancs et le gouvernement avaient pris en profond mépris les métis et les sauvages. Ils avaient affecté de ne les compter pour rien, alors que ceux-ci avaient vécu en maîtres pendant si longtemps sur ces terres ; les nouveaux venus avaient presque tous affiché de l’indifférence, pour ne pas dire du mépris, pour la religion et pour ses préceptes, et, au lieu de traiter les natifs comme des frères dignes de leur compassion et de leur sympathie, ils s’étaient montrés insolents et arrogants à leur égard, etc.\n\nTel fut le sujet de mon instruction, que je développai longuement, et l’impression, dans l’assemblée, fut vive et profonde.\n\n13 avril. Un courrier est arrivé aujourd’hui de Battleford ; il confirme la nouvelle de la mort de nos deux Pères au lac La Grenouille ; mais il nous apporte aussi la consolante nouvelle que le juge Roleau et son frère le docteur, avec leurs familles, ont échappé au massacre. On avait des craintes sérieuses sur leur sort, à cause des dangers auxquels on les savait exposés sur la route, avant d’atteindre Swift-Current, la première station du chemin de fer. Les sauvages, à Battleford, ne sont guère redoutables ; ils n’osent pas s’approcher du fort du gouvernement où ont pris asile toutes les familles du pays. Ce poste est à l’abri de leurs attaques. Ici, nous sommes très inquiets au sujet des Pères et des Sœurs de Saint-Laurent. Nous redoutons qu’ils ne soient massacrés par quelque bande de sauvages, et nous ne comprenons pas que le bon P. Fourmond n’ait pas pris des mesures pour envoyer les\nSœurs à Prince-Albert rejoindre leurs compagnes. Peut-être ce cher Père ne connaît pas le danger de la situation et ignore complètement les nouvelles du Fort-Pitt et le danger où l'on est de voir tous les sauvages descendre pour s'unir à leur chef, l'infâme Riel. Aujourd'hui, j'ai engagé un homme nommé Antoine le Cril, pour aller porter deux lettres : l'une au P. Fourmond, l'autre au P. Touze. J'espère que ce courrier arrivera à destination et que le P. Fourmond trouvera encore moyen d'envoyer les Sœurs ici avant que les chemins ne soient fermés. Le danger est pressant, et je ne sais si ces pauvres Sœurs pensent même à partir pour se rendre à Prince-Albert. J'ai eu de la peine à trouver un messager ; tout le monde redoute les sauvages maraudeurs, et ce n'est qu'en promettant une vache et Ambroise Fisher une autre, avec condition d'aller au lac Canard, que le courrier a consenti à se mettre en route. Nous attendons avec anxiété son retour. Depuis le voyage de Damase, mon serviteur, à Saint-Laurent, nous sommes sans nouvelles de cette place et des métis. Les autorités, ici, ne connaissent absolument rien de Riel et de ses mouvements. Les éclaireurs, effrayés, ne s'aventurent jamais loin et se contentent de chevaucher dans un rayon de 10 à 12 milles autour de Prince-Albert, tandis que les métis, pleins d'audace, s'avancent de tous côtés avec leurs alliés les sauvages. Le pays est, en ce moment, en leur pouvoir, et le gouvernement se contente de défendre Prince-Albert, en attendant de nouvelles forces.\n\n14 avril. On ne sait comment expliquer le retard que les troupes annoncées depuis longtemps mettent à venir à notre secours. Le gouvernement agit avec une lenteur désespérante, et pourtant le danger est grand. C'est la lenteur anglaise ; les événements auxquels on n'est pas\nn'est pas préparé viennent surprendre ceux qui auraient dû les prévoir.\n\n15 avril. Nous attendons aujourd'hui avec une anxiété fiévreuse le retour du courrier envoyé à Saint-Laurent. Dieu nous préserve du malheur que nous redoutons pour les pauvres Sœurs et qu'il nous donne de les voir arriver ici sans accidents!\n\n16 avril. Notre messager Antoine le Cri n'est pas encore de retour de son voyage à Saint-Laurent. Nous craignons qu'il ne lui soit arrivé quelque malheur. Voilà le quatrième jour écoulé depuis son départ, et nous n'avons aucune nouvelle de lui. On annonce qu'on a vu des sauvages rôder dans la contrée et qu'ils ont volé un cheval dans une étable. Le pauvre Antoine a pu tomber entre les mains d'un parti de maraudeurs et être tué par eux. Je suis vraiment inquiet à son sujet. Je le regarde comme perdu s'il n'arrive pas ce soir. La situation périlleuse des Pères et des Sœurs à Saint-Laurent nous préoccupe beaucoup. Depuis huit jours, nous n'avons aucune nouvelle d'eux, et toutes sortes de rumeurs circulent. On dit que Riel a donné l'ordre d'abandonner les maisons pour se concentrer autour de Saint-Antoine; or, il peut arriver que les Pères et les Sœurs aient été obligés eux aussi de se rendre au camp de Riel, où celui-ci les aura gardés de force, afin d'avoir dans leurs personnes autant d'otages qui répondent de sa vie et de celle des principaux auteurs de l'insurrection. Ici, on ne connaît absolument rien de lui. Les éclaireurs de Prince-Albert n'osent s'aventurer au-devant de l'ennemi, tant la terreur les domine. Le gouvernement, avec ses trois cents hommes de police, ne peut arriver à rien connaître des mouvements des insurgés. Les seuls renseignements qu'il obtient, c'est par le moyen des rares déserteurs qui abandonnent Riel, pour venir se réfugier a\nPrince-Albert. Les métis persévérent dans leur révolte : Riel les a fascinés. Les désertions ont été rares. Le moment approche où les malheureux vont recevoir un terrible châtiment : le général Middleton arrive, en effet, avec deux mille hommes pour combattre les métis et les sauvages. Les courriers qu'on attendait avec tant d'anxiété ont paru ce matin ; ils nous apportent la bonne nouvelle que les troupes sont à Humboldt et que, dans trois ou quatre jours, elles seront à la rivière. Le dénouement ne peut tarder ; mais les métis semblent être dans une parfaite sécurité et ne soupçonnent nullement le coup qui va les frapper.\n\n18 avril. Plusieurs messieurs faisant partie de l'armée du général Middleton sont arrivés la nuit dernière à Prince-Albert. Enfin, voici le secours que nous attendons depuis si longtemps. Cette armée est partie mercredi dernier de Humboldt, et elle devait être rendue à la rivière, traverse de Batoche, au moins pour dimanche au soir. Un autre détachement vient par Swift-Current, et doit être débarqué à 30 milles de Saint-Antoine, pour marcher ensuite le long de la rivière et cerner ainsi le camp des métis. La catastrophe approche donc à grands pas. Les troupes débouchent de tous côtés pour cerner et entourer nos pauvres gens, à qui il ne restera d'autre alternative que de se rendre à discrétion ou d'être massacrés en masse. Un bataillon de trois cents hommes se disposa à partir de Prince-Albert, pour se joindre aux forces qui s'avancent en sens opposé et écraser la rébellion sur le lieu où elle a éclaté il y a aujourd'hui un mois. Nos pauvres métis, d'après toutes les rumeurs plus ou moins véridiques qui circulent, semblent vivre dans la plus parfaite sécurité et ne soupçonnent nullement le coup qui va les frapper. Ils sont encore campés à Batoche, occupant les deux côtés de la rivière, où leurs\nforces peuvent monter à quatre ou cinq cents hommes, y compris leurs alliés les sauvages.\n\nLe sort qui les attend me fait peur, car le gouvernement n'ira pas de main morte pour les punir, et, s'ils ne se rendent pas, ils ne peuvent espérer aucun quartier. Ce soir, j'ai expédié une lettre au général Middleton en faveur de ces infortunés, le conjurant de les épargner, lui faisant remarquer que peu parmi eux sont vraiment coupables et qu'il doit leur offrir, avant de les frapper, l'occasion de se soumettre, en leur envoyant un parlementaire. Que les vrais coupables expient leurs crimes, et que les innocents soient épargnés. L'humanité se révolterait si, abusant des forces dont on dispose, on faisait un massacre général, sans distinction de coupables ou d'innocents. Mais Riel, qui est le génie malfaisant de ses malheureux compatriotes, sachant d'avance le sort qui lui est réservé ainsi qu'à quelques autres de ses plus chauds partisans, poussera l'obstination jusqu'au bout, et précipitera l'action, pour entraîner dans la même ruine tous ces égarés. Voilà ce qui fait craindre que la conciliation ne soit pas possible, surtout après un mois de révolte les armes à la main.\n\nLe courrier que nous avions envoyé à Saint-Laurent est de retour depuis hier vendredi, après midi, mais nous n'en sommes pas pour cela guère plus renseignés sur le compte de nos Pères et de nos Sœurs à Saint-Laurent. On affirme que l'église du lac Canard a été brûlée le jeudi 9 avril. Il est possible que le pauvre Père Touzé soit en captivité. L'horizon s'assombrit de plus en plus.\n\nL'année dernière a été fort dure par suite du manque de récolte ; mais ce printemps, personne dans le pays ne songe à semer, à cause du trouble, et une misère affreuse nous menace de tous les côtés. Tous les habitants du\ndistrict anglais comme du district français sont ruinés, et c'est seulement lorsque la rébellion sera réprimée, que nous apprécierons tout le mal dont elle a été cause, et que nous pourrons compter les ruines amoncelées dans ce pays. Les marchands de Prince-Albert et la Compagnie sont les seuls qui profitent de ce trouble : ils vendent leurs marchandises à haut prix, et tous les magasins sont vides par suite des achats que le gouvernement a faits chez eux. Aurons-nous des nouvelles aujourd'hui du théâtre de la guerre? Tout le monde s'attend à de grands événements pour aujourd'hui ou demain : il y a quelque chose en l'air qui nous dit que nous approchons de la fin.\n\n30 avril au matin. Voici bientôt deux semaines que le général Middleton est arrivé à la rivière à Clarke's Crossing, et de là pour se rendre à l'ennemi, il n'avait qu'un trajet de 35 milles à parcourir. D'après Bedson, lors de sa visite à Prince-Albert, il y a trois semaines, le général devait, de Humboldt, marcher droit sur Batoche, attaquer immédiatement Riel, et en finir par un coup hardi avec cette misérable révolte. Au lieu de courir droit aux métis pour les écraser, il fait un grand circuit en allant à Clarke's Crossing. Il n'a donc guère avancé dans son entreprise, la rébellion est encore debout, et nous ne savons ce que fait le général et pourquoi il hésite tant à attaquer un ennemi qui lui est si inférieur en nombre, et qui compte à peine cinq cents combattants. Les uns disent qu'il est en conférence avec les métis pour en venir à un arrangement quelconque; que le désir de sauver les prisonniers qui sont aux mains de Riel, lui fait différer l'attaque ; qu'il lui répugne d'exposer la vie de ces prisonniers en livrant bataille ; les autres disent qu'il est retardé parce que les troupes qu'il attend venant de Swift-Current ne sont pas encore arrivées. Quelques-uns\nqui voient les choses en noir, pensent que peut-être le général a éprouvé une défaite et que les autorités ici cachent la vérité afin de ne pas épouvanter la population de Prince-Albert déjà assez portée à s’alarmer. Toujours est-il que la situation n’est guère agréable et qu’elle laisse le champ libre à toutes les suppositions. Notre pauvre Ambroise Fisher a aussi ses explications qu’il tire de ses rêves, et qui sont aussi croyables que ce que nous entendons par ailleurs.\n\nDepuis le commencement des hostilités on n’a pas encore fait un seul prisonnier aux insurgés, tandis que ces derniers ont pris plusieurs de nos hommes ; les seuls prisonniers que nous avons ici, sont ceux qui se sont sauvés du camp de l’île pour venir se réfugier à Prince-Albert. Je me fais un devoir de visiter presque tous les jours ces malheureux, et ils sont contents, catholiques comme protestants, de me voir ; mon apparition au milieu d’eux leur est une grande consolation. Si nous trouvons longs les jours qui nous laissent sans nouvelles, ces infortunés trouvent encore plus pénible leur situation, surtout à cause de l’ignorance où ils sont du sort qui leur est réservé…\n\nLe R. P. André continue à consigner dans son journal ses observations de chaque jour. Ses angoisses, loin de diminuer, augmentent. Il ne sait rien de nos Pères et des Sœurs de Saint-Laurent, de Mgr Grandin et des autres Pères du vicariat. Tout est possible et l’on peut redouter les plus grands malheurs. De plus, les gens de Prince-Albert, las de cette situation, ont fini par s’habituer au danger, et se livrent au plaisir. Les courses et les réjouissances de toutes sortes sont à l’ordre du jour. On ne sait où est le général Middleton, envoyé avec des forces pour écraser la rébellion, et l’incertitude de ses mouvements n’est pas faute pour rassurer.\nLe 14 mai, le missionnaire écrit : Enfin, le dénouement si longtemps attendu est arrivé, la rébellion a été écrasée à Batoche, sur le lieu où elle prit naissance, le 18 mars. Alexandre Macdougall est arrivé cet après-midi et nous apporte cette heureuse nouvelle. Les métis, entourés par les troupes du général Middleton ont combattu pendant quatre jours, c'est-à-dire : samedi, dimanche, lundi et mardi ; ils ont été repoussés jusqu'à la rivière et obligés d'abandonner leur quartier général, établi dans les maisons situées du côté sud de la traverse de Batoche. Ils se sont repliés en descendant plus loin que la maison de Champagne, et ils se sont réfugiés dans le bois qui forme la pointe ; là, bien qu'entourés de toutes parts, ils sont parvenus à s'échapper dans la nuit du mardi soir. Riel, Gabriel, et tous ceux qui étaient gravement compromis dans la rébellion se sont enfuis, quelques-uns se sont rendus ensuite au général, mais on n'en connaît pas le nombre. Riel, dans la journée de mardi, a voulu, dit-on, obéissant à un sentiment de générosité dont je ne le croyais pas capable, se rendre, pour épargner une plus grande effusion de sang et aussi pour faire retomber sur lui seul la responsabilité de la révolte. « C'est ma tête, dit-il, qu'ils veulent, je vais aller la leur offrir » ; et il a fait cesser le feu. Pendant qu'il rédigeait sa lettre de reddition au général Middleton, quelques sauvages avec quelques jeunes métis ont commencé à tirer sur les troupes ; William Swan a dit alors à Riel qu'il avait poussé les métis à la guerre et qu'il fallait aller jusqu'au bout, qu'il était trop tard pour parler de se rendre. La résistance a donc continué jusqu'à la nuit.\n\nOnt été tués pendant ces jours de combat : Donald Ross, deux Jourond (Callixte et Eleazar), Damase Carrière, Joseph Vandale, Joseph Delorne, le pauvre vieux Ouellet, un vieillard âgé au moins de quatre-vingt-cinq ans. Ont\nété gravement blessés : Baptiste Boucher, Charles Lavallé, les deux Swan, père et fils, Daniel Garriépy ; à la bataille du 24 avril, quatre métis ont été tués, parmi lesquels je ne connais que Saint-Pierre Parenteau et le vieux Vernette.\n\nVoilà donc terminée cette révolte qui a été insensée dès le principe. Les métis n'ont voulu écouter les conseils ni de leurs prêtres ni de leurs amis : Riel était leur Dieu.\n\nLe général Middleton mérite les plus grands éloges pour l'habileté avec laquelle il a conduit cette campagne, et surtout pour la longanimité et l'humanité qu'il a montrées à l'égard de nos gens. Il a procédé lentement afin de leur donner le temps de se reconnaître et de faire leur soumission. Mais, dominés par Riel, ils ne voulaient entendre parler d'aucun accommodement, et malgré lui le général a été obligé de frapper fort pour en finir. Nous voilà libres et les chemins sont ouverts ; mais quelles tristes pensées remplissent nos cœurs au souvenir de tant d'hommes que nous avons connus, et qui sont tombés dans l'acte de la révolte !\n\nRiel et les autres prisonniers sont attendus ce soir à Prince-Albert ; la curiosité publique est grande et se promet un spectacle.\n\nA. André, O. M. I.\n\nLETTRE DE MÈRE GRANDIN.\n\nSaint-Albert, district d'Alberta, Canada, 12 mai 1885.\n\n... Depuis le milieu du mois de mars, une grande partie de mon pauvre diocèse est livrée aux horreurs de la guerre civile. Depuis longtemps nos métis réclamaient, auprès du gouvernement, certains avantages qu'on leur avait fait espérer lors de l'annexion du pays au Canada.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007722.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 44288, "total-output-tokens": 17520, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1786, 1], [1786, 3743, 2], [3743, 5721, 3], [5721, 7595, 4], [7595, 9501, 5], [9501, 11439, 6], [11439, 13257, 7], [13257, 15075, 8], [15075, 16976, 9], [16976, 18834, 10], [18834, 20596, 11], [20596, 22469, 12], [22469, 24247, 13], [24247, 26117, 14], [26117, 27966, 15], [27966, 29775, 16], [29775, 31628, 17], [31628, 33525, 18], [33525, 35331, 19], [35331, 37128, 20], [37128, 39023, 21], [39023, 40899, 22], [40899, 42769, 23], [42769, 44667, 24], [44667, 46467, 25], [46467, 48259, 26], [48259, 50106, 27], [50106, 51897, 28], [51897, 53760, 29], [53760, 55578, 30], [55578, 57488, 31], [57488, 59050, 32]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]