[{"id": "a1ea9c9e966cf6a8422d34feabd4b0135baeaff3", "text": "MISSIONS DE LA SISKATCHewan.\n\nLe 23 avril 1868, Mgr GRANDIN s'embarquait à Brest, à la tête d'un nombreux renfort d'ouvriers apostoliques qu'il conduisait dans son nouveau vicariat. Dans le cours du mois suivant, les voyageurs arrivaient à Québec, où venait de s'ouvrir un concile provincial. Mgr GRANDIN y assista en qualité de coadjuteur de Mgr TACHÉ et continua ensuite son voyage. Après un repos de plusieurs jours à Montréal, nos voyageurs se dirigèrent dans les premiers jours de juin vers Saint-Paul (Minnesota), d'où Mgr GRANDIN écrivit au T.-R. P. Général les détails suivants :\n\nSaint-Paul, 9 juin 1868.\n\nMon très-révérend Père,\n\nIl nous a encore fallu faire halte ici, où nous sommes arrivés le samedi 6 juin, après avoir passé près de quatre jours et quatre nuits en chemin de fer, ce qui suffit pour vous faire comprendre combien nous étions fatigués. Le voyage jusqu'ici a été très-heureux, à part quelques petits désagréments qu'il est impossible d'éviter dans un pareil pays, avec de nombreux compagnons qui n'ont guère l'expérience des voyages, et surtout avec la quantité de bagages que nous traînions à notre suite. J'ai heureusement trouvé à Montréal un des Missionnaires séculiers de Saint-Boniface, qui revient avec nous et qui nous est d'un grand secours. Par suite d'un retard, nous avons\ndû passer quelques heures à Toronto ; je suis allé saluer le digne Évêque de cette ville, qui a voulu nous recevoir tous ; je dirai plus, nous vénérer ; encore un peu, il allait demander à nos bons Frères convers de le bénir. Il nous a reçus comme autant d’apôtres, s’est plaint de ce que je ne lui avais pas envoyé une dépêche pour lui annoncer notre arrivée, car il aurait voulu faire une démonstration publique. Après nous avoir fait faire un excellent dîner à tous (nous étions quinze), il a fait venir quatre belles voitures et nous a promenés lui-même pour nous montrer ses divers établissements. Partout il nous a humiliés par les éloges qu’il faisait de nous et la vénération qu’il nous témoignait. Il est ensuite rentré accablé de fatigue, car il était très-souffrant, et nous a fait accompagner à la gare par son grand vicaire, en nous exprimant son regret de ne pouvoir y venir lui-même. Cette réception nous a fait du bien à tous, en nous faisant estimer notre belle vocation.\n\nEn arrivant ici, j’ai placé dans une maison particulière ceux de mes compagnons qui ne sont pas Prêtres ; les autres sont descendus à l’évêché, où nous avons été parfaitement reçus, mais où l’espace manque pour recevoir tant de monde. Hier j’ai dû faire bien des courses dont je ne serais pas venu à bout sans le secours du bon M. Ritchotte, ce Missionnaire de Saint-Boniface dont je vous ai parlé. Nous avons appris ce matin que notre caravane arrivait à Saint-Cloud ; j’y ai aussitôt envoyé tout mon monde avec M. Ritchotte, et je suis resté ici avec le R. P. Dupin pour régler différentes choses et surtout pour m’entretenir avec vous...\n\n— Deux mois après, la caravane arrivait au fort Carlton, premier poste du vicariat de la Saskatchewan. Le R. P. André venait d’y donner une mission que Mon-\nseigneur clôtura en célébrant pontificalement la grand’messe. Un grave accident y retint les voyageurs plus longtemps qu’ils ne s’y attendaient. Voici en quels termes Mgr GRANDIN rend compte à Mgr TACHÉ de cette nouvelle épreuve que Dieu lui envoyait à son entrée sur le territoire de son vicariat :\n\nCarlton, 15 août 1868.\n\nMonseigneur et bien cher Père,\n\nJe vous disais avant-hier que j’étais sur le point de partir, et cependant me voilà encore ici. Avant-hier à midi, lorsque tout était à peu près réglé pour le départ, un bœuf sur le point de gravir la côte de l’autre côté de la rivière partit comme un trait avec sa charrette pour revenir de ce côté en traversant l’eau. Le R. P. MAISON-NEUVE et moi nous apercevions du rivage tout ce qui se passait, sans pouvoir porter aucun secours. Le bœuf, après bien des efforts, se détela et sauva ainsi sa vie ; mais quand les Frères arrivèrent auprès de la charrette, elle était vide, toute la charge était tombée à l’eau… Ils retièrent cependant un ballot, puis ma chapelle, que le courant avait entraînée à 2 milles plus loin. Le reste de la charge a été perdu.\n\nIl y avait sur cette charrette une grande malle renfermant ce que j’emportais de plus précieux : le calice et le ciboire que m’avait donnés le souverain Pontife, un autre beau calice en vermeil, un ciboire en argent, des ampoules pour les saintes huiles, ma mitre, ma soutane violette et plusieurs ornements précieux, pontificaux et sacerdotaux, et de plus, près de 2 000 francs d’orfèvrerie et de bijouterie, commissions dont je m’étais chargé pour quelques messieurs d’ici.\n\nJ’avais en outre beaucoup d’objets de prix, dont je comptais me servir pour exprimer ma reconnaissance aux\nmembres de l'honorable compagnie qui se montrent si obligeants pour nous, tout mon linge et même du linge de mes compagnons, un grand nombre de papiers, entre autres la notice sur la mission de l'île à la Crosse. Après avoir perdu cette notice par l'incendie, je me l'étais procurée à Paris, et voilà maintenant qu'elle fait naufrage. J'ai encore perdu une grande quantité d'outils qui devaient nous être de la plus grande utilité. Que le bon Dieu soit béni cependant !\n\nJe vous disais dernièrement avec quelle charité M. Clarke nous avait tous reçus. Dans cette circonstance, il s'est montré d'une manière admirable. Hier, de concert avec M. Chatelain, il a travaillé toute la journée avec quatre de ses serviteurs, ne s'épargnant en rien, demeurant dans l'eau le plus souvent jusqu'au cou, afin d'essayer de retrouver mes effets. Il est ensuite venu me remettre avec beaucoup d'émotion la somme de 10 livres sterling, et hier soir il m'en faisait remettre 5 autres par sa petite fille. M. Mac Donald, un de ses parents, m'a pris à part en me disant : « Monseigneur, je ne suis point catholique, mais je veux vous montrer combien je vous estime et combien je prends part à votre peine ; » et il me remit 5 livres sterling. M. Chatelain m'en a donné 2, en s'excusant de n'être point chez lui; hier encore M. Clarke me remit 3 autres livres, résultat d'une collecte faite parmi les serviteurs du fort, qui ne se trouvent ici, en ce moment, qu'en petit nombre. Une partie de cette somme m'était donnée par un protestant qui avait travaillé toute la journée afin de retrouver mes effets perdus. Ces aumônes sont loin assurément de convrir la perte que j'ai faite, mais je ne saurais dire combien nous en avons tous été touchés. Veuillez vous unir à moi, Monseigneur, pour demander à Dieu de récompenser dignement une si grande charité...\nAprès de nouvelles recherches aussi infructueuses que les précédentes, Mgr GRANDIN continua son voyage, visita, en passant, plusieurs de ses missions, entre autres celle de l'île à la Crosse, ruinée par le feu quelque temps avant son départ pour la France. Grâce aux dons de la charité recueillis pendant son voyage, il put ramener un peu d'aisance dans cette mission désolée, et, après un mois de séjour, il reprit sa course vers Saint-Albert, où il arriva le 25 octobre.\n\nLa mission de Saint-Albert devait être la résidence habituelle de Monseigneur ; il y fit un long séjour afin d'organiser le noviciat et le scolasticat qui devaient être établis dans cette mission. De là aussi, comme du point central de son vicariat, il put correspondre avec ses Missionnaires et diriger leurs travaux apostoliques. Mais le moment étant venu de visiter les différentes missions, Monseigneur reprit sa vie de voyage. La lettre suivante qu'il adresse au T.-R. P. supérieur général va nous mettre au courant de ses excursions et nous fera connaître en même temps d'une manière sommaire les travaux auxquels se livrent nos Pères du vicariat de la Siskatchewan.\n\nLETTRE DE MONSEIGNEUR GRANDIN\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Jean-Baptiste (île à la Crosse),\n12 juin 1869.\n\nMON TRÈS-RÉVÉREND PÈRE,\n\nDepuis ma dernière lettre (c'était, je crois, au commencement de février), j'ai beaucoup voyagé et fait bien des campements en visitant plusieurs missions. Le 17 février était, bien entendu, fête de première classe à Saint-Al-\nbert; nous l'avons solennisée avec toute la pompe possible; rien n'a manqué : magnifiques chants à la chapelle et magnifique dîner au réfectoire. Déjà le dimanche précédent nous avions eu une fête qui avait bien touché nos novices et nos scolastiques : c'était la cérémonie de la première communion et de la confirmation pour nos enfants et plusieurs vieillards, puis le baptême de deux adultes. Tous paraissaient pénétrés des grandes choses qu'ils faisaient, et les Missionnaires étaient consolés et édifiés ; les mêmes cérémonies avaient eu lieu à Sainte-Anne et à Saint-Joachim.\n\nMais toutes les fêtes ont leur lendemain, et à peine le dîner du 17 février était-il achevé, qu'il fallait se préparer à partir. Je devais emmener à Saint-Paul des Cris une bonne vieille fille canadienne qui va s'efforcer de rendre service à cette mission, en prenant soin du ménage. Elle devait avoir une compagne, et elles allaient être forcées de se tenir toutes les deux sur la même traîne et de conduire elles-mêmes leur cheval. Un jeune homme de quinze à seize ans devait nous guider et conduire la traîne aux provisions. Mon compagnon de voyage d'autrefois était obligé de rester pour faire les travaux de la mission, et je me trouvais dans l'obligation de conduire moi-même mon cheval. On me fit plusieurs objections sur ma manière de voyager, on prétendait que j'allais avoir beaucoup à faire dans les campements et que mon jeune homme ne pourrait suffire à tout. Baptiste surtout, ce vieux compagnon de voyage, qui était si contrarié de ne pas venir avec moi, fit si bien auprès de tout le monde, que, pour lui faire plaisir, je dus l'emmener.\n\nLe 18, à neuf heures du matin, nous partions ; je fuyais plutôt que je ne partais, car ces départs, qui se font toujours avec une certaine solennité, m'abiment. Un commerçant de Saint-Albert, excellent catholique, vint me\nconduire avec son traîneau jusqu'à l'endroit où nous devions dîner. Le R. P. Leduc devait être aussi de la partie.\n\nVous êtes peut-être surpris, bien-aimé Père, de ce que je ne voyage pas cette fois, comme d'ordinaire, avec des chiens. Dans nos missions de l'Ouest, les postes étant plus rapprochés les uns des autres, et cette année la neige étant peu épaisse, il est plus avantageux de voyager avec des chevaux qu'avec des chiens. Du reste, on ne voyage pas toujours sur les lacs comme dans nos autres missions, et les chevaux ont l'instinct de découvrir avec leurs pieds le foin qui est sous la neige.\n\nCependant il fallait penser au dîner, car le P. Leduc et son brave compagnon devaient retourner à Saint-Albert. Peu s'en fallut qu'ils ne fussent très-embarrassés pour effectuer leur retour. Le beau cheval de notre digne ami prit tout à coup l'épouvante et brisa le traîneau et les harnais; par bonheur, personne ne fut blessé, mais je fus très-mortifié de la perte qu'éprouva ce bon catholique. Dans l'après-midi, nous dûmes ralentir notre marche: nos chevaux n'auraient pu résister à la fatigue. C'est le premier hiver que je voyage sans raquettes et si à mon aise. Si j'ai fait un peu de chemin à pied, ce n'a été que pour me reposer, et je n'ai point souffert du froid.\n\nLe soir au campement, nous eûmes à essuyer les misères dont ne sont pas exempts ceux-là même qui ont l'habitude de coucher à la belle étoile, mais qui sont plus pénibles pour ceux qui voyagent pour la première fois; aussi la bonne fille que nous avions prise à notre service, et qui campait dehors pour la première fois, trouva-t-elle l'épreuve fort dure.\n\nLe 20 à midi, nous arrivâmes à Victoria, où se trouvent un poste de traite pour les fourrures et une mission protestante. Nous ne pûmes nous y arrêter que pour prendre notre repas; le lendemain, dans l'après-midi, je marchais\nà pied, précédant notre caravane, quand j'aperçus de la fumée et quelque chose qui se remuait auprès d'un petit feu. Je crus que c'était un campement de sauvages. Mais bientôt je fus détrôné et je vis venir vers moi à toute vitesse un cavalier qui n'était autre que le Fr. Adolphe Perrault. Le samedi précédent, il avait accompagné le R. P. André à un petit village situé à une demi-journée de marche de la mission de Saint-Paul, et, laissant le Père avec ses paroissiens, il était venu, accompagné d'un jeune sauvage, au-devant de moi pour m'amener des chevaux frais. Cette rencontre inattendue nous réjouit et nous mit à l'aise ; nous pûmes changer de chevaux et accélérer notre marche. Avant la nuit, j'eus le plaisir d'embrasser le bon P. André et de bénir la petite population du village. J'arrivais même à temps pour présider l'exercice du soir, qui consistait simplement dans la récitation du chapelet et un petit entretien, non dans une église ou une chapelle, mais dans l'habitation d'un commerçant. Le lendemain, nous célébrâmes tous les deux la sainte messe ; j'adressai encore la parole à ces bons chrétiens, puis nous continuâmes notre route plus nombreux qu'au-paravant, car, outre le R. P. André et le Fr. Perrault, plusieurs de nos chrétiens voulaient nous faire une escorte d'honneur. Il y avait avec nous des cavaliers, puis des hommes traînés par des chevaux et d'autres traînés par des chiens.\n\nCependant le R. P. Dupin, voyant que ses compagnons n'arrivaient pas et se doutant bien qu'ils ne reviendraient pas seuls, se mit en marche et vint au-devant de nous à plus de 2 lieues. Vers les trois heures du soir, nous étions tous réunis dans la modeste chapelle de Saint-Paul des Cris. Le R. P. Végreville devant venir me voir et le R. P. Ladombe m'annonçant par une lettre qu'il ferait aussi son possible pour venir me trouver, je résolus de\npasser quelques jours dans cette mission. Nous installâmes notre bonne fille dans sa cuisine ; le cher Frère lui céda sans regret ses chaudrons et sa vaisselle. Pauvre fille ! elle fut alors plus déconcertée encore que dans son premier campement. Comment faire bonne cuisine avec de semblables ustensiles ? Les Pères n'ont pas même chacun une assiette, leur vaisselle est toute cassée, tout manque absolument... Et pourtant les Pères jusqu'alors s'étaient crus riches ! Nous ne pûmes nous empêcher de rire en voyant sa consternation. Pour la consoler, je fus heureux de lui procurer un petit poêle de cuisine.\n\nLa plupart des chrétiens qui dépendent du poste de Saint-Paul étaient alors absents, les sauvages étaient au loin, et le P. Lacombe avec eux. Profitant de cet éloignement, le P. André était allé donner ses soins aux chrétiens du fort Pitt (mission de Saint-François-Régis). Le R. P. Dupin gardait la mission transformée en ermitage, instruisait les passants et enterrait les morts qu'on lui apportait de plusieurs journées de marche. Nous sommes quelquefois heureux, quand nous nous rencontrons, qu'il n'y ait pas beaucoup de monde à la mission ; nous avons alors plus de liberté et nous pouvons jouir de la société les uns des autres, tandis que lorsque les sauvages sont réunis, nous ne pouvons avoir ce bonheur.\n\nLe 25, le R. P. Végreville arrivait du lac la Biche avec deux hommes et de bons chevaux. Le 27, le P. Lacombe arrivait à son tour, grâce à un secours de chevaux que nous lui avions envoyé ; autrement nous n'aurions pas eu la consolation de le voir ce jour-là. Il était accompagné d'un jeune sauvage ; sur la route, il avait dû abandonner un de ses chevaux expirant, et celui qui restait n'avait plus que la peau et les os. Le pauvre Père était lui-même harassé de fatigue. Pendant son hiver il avait vues groupées autour de sa hutte de peau environ quatre cents loges sau-\nvages, soit à peu près deux mille sept cents individus, in-\nfidèles, catéchumènes ou chrétiens. La famine, la maladie\net la mort visitèrent ce nombreux camp en même temps\nque le Prêtre, ce quiaida beaucoup celui-ci à faire une\nmission fructueuse. Il eut la consolation de ne voir mou-\nrir un bon nombre de sauvages qu’après les avoir puri-\nfiés, les uns dans les eaux du baptême, les autres dans le\nbain de la pénitence. Vous avez reçu, bien-aimé Père,\nplusieurs relations de ce genre de missions ; elles se res-\nsemblent toutes plus ou moins.\n\nNous passâmes ensemble la journée du 28, et le\n1er mars je partais pour le lac la Biche avec le R. P. VÉ-\nGREVILLE, le Fr. PERRAULT et quelques hommes. Quelques\njours après nous, le R. P. LACOMBE partait aussi pour\nSaint-Albert, où il allait aider le R. P. LEDUC. Nous avons\nun peu souffert du froid en nous rendant au lac la Biche ;\nla nuit du 2 au 3 mars surtout fut extrêmement froide.\nC’était la première fois que je voyais la mission du lac la\nBiche, où nous arrivâmes le 3 mars, vers quatre heures\nde l’après-midi. Un de nos hommes avait pris les de-\nvants pour nous annoncer ; aussi, quand nous arrivâmes,\ntout était prêt et on me reçut solennellement, presque\ncomme dans les grands pays. La maison des Pères et celle\ndes Sœurs étaient décorées de nombreux étendards au\nchiffre de la Congrégation ; tous les voisins avaient voulu\nen faire autant et avaient arboré au-dessus de leurs de-\nmeures, les uns un morceau de drap rouge, les autres\nun mouchoir de coton ; l’étendard flottait sur la maison,\nmais ceux qui l’habitaient l’avaient abandonnée et, armés\nde leurs fusils, s’étaient rendus à la mission. Dès qu’ils\nm’aperçurent, ils commencèrent à tirer et ne ménagè-\nrent pas leur poudre ; c’était le bon P. RÉMAS qui comman-\ndait le feu. Tous étaient groupés, hommes, femmes et\nenfants, entre les deux maisons de la mission. Quand je\nfus au milieu d'eux, ils cessèrent de tirer : l'émotion et le froid m'abîmaient ; ce fut presque une corvée pour moi que de toucher la main à tout le monde ; je le fis cependant à la hâte. Pour me rendre à la chapelle, je passai, sans m'en douter, sur une belle allée recouverte d'une couche de sable jaune, que la blancheur de la neige faisait encore mieux ressortir, et sous un magnifique arc de triomphe décoré de rubans de diverses couleurs. Je ne vis rien de tout cela qu'à mon retour ; il est très-possible que d'autres belles choses aient échappé à mes regards, même pendant tout le temps que j'ai passé là. Il est cependant une chose qui m'a frappé dès mon arrivée, ce sont les petits enfants dirigés par les Sœurs, orphelins sauvages de différentes nations ; les petits garçons, en uniforme bien simple, étaient rangés autour du Fr. Gérante ; autour des bonnes Sœurs se trouvaient les petites orphelines ; ces beautés-là ne m'échappent jamais.\n\nLa mission de Notre-Dame des Victoires (lac la Biche) est la plus avancée de toutes nos missions sous le rapport matériel ; mais pendant longtemps les consolations spirituelles ont manqué à ceux de nos Pères qui la dirigeaient. Aujourd'hui, grâce à Dieu, les habitants de cette localité semblent enfin comprendre le dévouement du Prêtre et paraissent décidés à en profiter. Aujourd'hui, la mission du lac la Biche est pour moi d'un grand secours. C'est le point central des missions actuellement existantes ; c'est là que je fixerais ma résidence, si les communications avec les grands pays n'y étaient pas plus difficiles qu'à Saint-Albert. C'est la mission la plus rapprochée de l'île à la Crosse ; et actuellement le Fr. Bowes, aidé de quelques hommes, fait un chemin par terre qui va l'en rapprocher beaucoup plus encore ; elle n'est qu'à trois jours de Saint-Paul des Cris, à quatre tout au plus de Saint-Albert, et ces distances peuvent encore diminuer si on améliore\nles chemins. J'ai passé à cette mission un mois et neuf jours et j'y ai eu de grandes consolations.\n\nLe cher P. Rémas, tout infirme qu'il est, se livre activement à l'instruction de la population. Il allait d'abord faire le catéchisme à domicile, mais le plus souvent il ne trouvait pas ses brebis ; du reste, ne pouvant aller ni à cheval ni en voiture, il faisait à pied tous ses voyages. Ces courses ont fini par le fatiguer et lui causer une maladie qui l'a conduit aux portes de la mort. Le jour de Noël, son compagnon, le P. Végreville, en était réduit à lui donner l'extrême-onction et craignait beaucoup d'avoir prochainement à lui fermer les yeux. Le bon Dieu a bien voulu lui épargner ce chagrin, ainsi qu'à nous tous ; peu de jours après Noël, le P. Rémas reprenait ses catéchismes ; il n'allait plus à domicile trouver ses gens, mais il les prenait quand ils venaient le voir. Les enfants avaient des heures fixes ; les adultes, n'étant pas aussi libres, venaient quand ils pouvaient ; le P. Rémas était toujours prêt à les recevoir et à les instruire. Il a préparé de cette manière quatre-vingt-quinze personnes à la première communion et à la confirmation, et un certain nombre d'adultes au baptême ; les personnes qui se sont présentées pour la première fois à la sainte table étaient âgées de douze à quatre-vingts ans. Le jour de Saint-Joseph nous avons ouvert la retraite de préparation à la communion pascale : j'officiai pontificalement et je célébrai la grand'messe pour nos bienfaiteurs. Nous donnâmes, le P. Végreville et moi, les exercices de la retraite ; le P. Rémas continuait ses catéchismes. Le jour de Pâques fut réellement une bien belle fête pour la population et pour les Missionnaires. Mais la chapelle provisoire ne peut plus suffire, il faut de toute nécessité une église plus grande, et qui sait quand nous pourrons en avoir une ?\n\nLe 12 avril, je reprenais la route de Saint-Paul avec le\nP. Rémas, le Fr. Perrault et un petit jeune homme qui devait nous servir de guide. Nous avions à surveiller trois charrettes et cinq chevaux. Les chemins étaient affreux dans cette saison, et les chevaux, accoutumés à vivre en liberté, étaient peu ou point domptés ; sur nos charrettes nous avions un millier de livres de farine destinée aux missions de l'île à la Crosse, de Saint-Paul et du lac Caribou. Le P. Végreville nous accompagna jusqu'à la première halte ; il nous envoya, de plus, un homme qui nous suivit pendant toute une journée de marche, pour nous aider ; malgré cela, notre voyage a été bien piteux et semé de difficultés de toutes sortes. Notre jeune homme a failli se tuer d'une chute qu'il a faite ; je tremblais pour le P. Rémas, à qui j'aurais voulu éviter les secousses de nos grossières charrettes, mais il était obligé, aussi bien que moi, en pataugeant dans la boue et la neige fondante, de pousser à la roue, de crier et de frapper sur les chevaux. Cela dura jusqu'au 15 avril. Ce jour-là, le P. André, qui se trouvait de nouveau au petit village où je l'avais trouvé en venant de Saint-Albert, eut connaissance de nos difficultés et envoya des hommes et des chevaux au-devant de nous. Le soir même, j'arrivai à cheval à Saint-Paul, mes compagnons m'y rejoignaient le lendemain. Le P. Lacombe y était aussi arrivé de Saint-Albert avec le Fr. Scollen et y avait éprouvé les mêmes désagréments que nous. En vérité, l'époque de la fonte des neiges n'est pas la saison la plus agréable pour voyager.\n\nPendant que nous donnions la retraite au lac la Biche, le P. Lacombe en donnait aussi une à Saint-Albert ; le bon Dieu l'a couronnée d'un succès plus complet encore que la nôtre. Vous le verrez d'ailleurs par les lettres que je reçois de Saint-Albert, et que je vous adresse en même temps que celle-ci. À Saint-Paul je trouvai donc les PP. Lacombe, André, Dupin et le Fr. Scollen. Nous restâmes ensemble\njusqu'au 19, très-occupés, je vous assure, de nos préparatifs de voyage et de quelques lettres que nous faisions quand nous pouvions, car il n'y a pas dans tout l'établissement une seule chambre où l'on puisse être tranquille. Comme nous n'étions ensemble que pour bien peu de temps, malgré nos occupations, nous avions beaucoup de choses à nous dire. Cependant nous profitâmes de notre réunion pour nous occuper de nos intérêts spirituels, et les exercices de piété en commun se firent à Saint-Paul comme dans les autres maisons de notre Congrégation.\n\nLe 19, deux caravanes partaient en même temps de Saint-Paul : le P. Lacombe et le P. André pour Saint-Albert : le premier devait aller passer l'été avec la nation des Pieds-Noirs et de là se rendre jusqu'à Benton, s'il en trouvait les moyens, pour savoir s'il ne serait pas plus avantageux de faire venir nos marchandises par cette voie ; le second devait accompagner les chasseurs à la prairie. De mon côté, je partais pour l'île à la Crosse, accompagné d'Alexis, le fidèle compagnon du P. Lacombe, et d'un jeune métis. Je conduisais encore les provisions, dont la quantité s'était augmentée de presque tout ce que nous avions trouvé à Saint-Paul. Nos trois charrettes étaient lourdement chargées pour la saison, mais nos chevaux étaient frais et nous marchions à petites journées.\n\nLe 24 avril, je confiai à mes compagnons la garde des charrettes et je me rendis à cheval au fort Pitt (mission de Saint-François-Régis) pour y passer la journée du lendemain, qui était un dimanche. Malheureusement presque toute la population était absente ; je confessai ceux qui étaient présents, pour qu'ils pussent au moins faire leurs Pâques ; j'en confirmai six ou sept, et le soir, après ma dernière instruction, je retournai vers ma caravane. Quelques jours après, nous arrivâmes au lac du Brochet, où des sauvages infidèles étaient campés. Je me souciais peu de\ncamper près d’eux ; nous nous éloignâmes du chemin et nous allâmes nous installer dans le bois. Plusieurs d’entre eux vinrent cependant nous trouver ; ils avaient du poisson en abondance, mais ils en étaient fatigués et voulaient du pemmikan. Je tenais à conserver celui que j’avais pour l’île à la Crosse : c’est la seule nourriture que l’on puisse avoir en voyage et en été quand le poisson fait défaut ; c’était donc un bien dont j’étais avare. Les sauvages m’en demandèrent ; je fis semblant de ne pas comprendre, et je partageai un peu de tabac entre sept ou huit hommes, je donnai à manger à tous et je recommandai à Alexis de veiller pendant toute la nuit sur nos provisions. Le lendemain, au moment de notre départ, quelques sauvages vinrent se joindre aux autres et me dirent que si je ne leur donnais pas de pemmikan, ils en prendraient malgré moi ; il fallut bien s’exécuter et en donner un peu à chacun. Mais tout n’était pas fini, nous devions traverser dans l’après-midi un nombreux camp de dix-sept loges. On me prédit que nos provisions y resteraient. Je les fis cacher le mieux que je pus dans des couvertures et me recommandai instamment à Dieu. Pour arriver à ce camp, il fallait traverser une rivière d’un accès très-difficile ; assez souvent dans ces passages il arrive que nos charrettes se renversent ; si, par malheur, pareille chose nous fut arrivée en cette circonstance, la foule qui nous attendait sur la rive opposée ne nous eût point laissé la peine de recharger nos provisions. Heureusement nous n’eûmes point d’accident et nous traversâmes le camp sans que personne nous demandât rien. Déjà je remerciais Dieu d’en être quitte à si bon compte, mais bientôt nous vîmes que nous étions suivis par une vingtaine de sauvages à cheval. Je cherchais un moyen de me tirer d’embarras ; mes provisions étaient suffisamment dissimulées et j’avais dit à mes compagnons que la provision qu’ils\navaient à leur disposition devait leur suffire jusqu'à l'île à la Crosse. Ceux-ci, voyant qu'elle avait beaucoup diminué, firent entendre aux sauvages que nous étions à la veille de manquer. Le chef vint alors me trouver, et après avoir loué ma piété et ma générosité, il me demanda du tabac, du thé et du rababou. Voilà un nouveau mot que vous ne connaissez peut-être pas ; les Canadiens appellent rababou une espèce de bouillie que l'on fait avec du pemmikan et un peu de farine. Pour moi, quand j'ai de la farine, le rababou est ma nourriture ordinaire en voyage. Je me gardai bien de refuser ce que me demandait le chef ; je distribuai entre tous à peu près 2 livres de tabac, nous préparâmes du rababou et du thé, dont je donnai environ 1 livre au chef. Puis, pour nous débarrasser d'eux, nous fimes semblant d'aller camper beaucoup plus loin. Malgré cela, trois de ces sauvages eurent encore le courage de nous suivre et partagèrent ainsi notre souper du soir et notre déjeuner du lendemain.\n\nNous allâmes camper près de trois baraques où des commerçants avaient passé l'hiver ; ils étaient partis pour Saint-Boniface afin d'y vendre les fourrures qu'ils avaient obtenues des sauvages au prix de boissons enivrantes ou de futilités. Bien-aimé Père, je voudrais que vous visiez ces baraques ; celle que nous habitions autrefois à la Providence était un château comparée à celles-ci, et c'est pourtant là que des hommes doués parfois d'une certaine instruction passent une partie de leur vie afin d'avoir des peaux de bêtes, au prix de leur âme et de celle des pauvres sauvages. L'un de ces marchands était mort dans une de ces misérables huttes ; peut-être sa mort avait-elle été occasionnée par ses pénibles voyages, ses jeunes forcés. Il n'a pas même eu la consolation de jouir de ses profits. Son cadavre a été enterré à quelque distance de ces habitations ; encore quelques années, et il n'y aura pas même\nun signe pour indiquer qu'un corps humain attend la résurrection dans cette partie du désert. Depuis que je suis dans ce pays, mon très-révérend Père, j'ai vu bien des faits de ce genre et je ne puis m'y habituer. On parle de ce que nous faisons pour le salut de ces pauvres sauvages ; en faisons-nous la moitié, souffrons-nous le quart de ce que souffrent ces commerçants ? Cependant quel est le motif qui nous fait agir de part et d'autre ? Ces nombreux sauvages que nous venons de rencontrer ne sont point chrétiens, ils n'ont pas de Missionnaire pour les instruire, et combien sont comme eux ! Mais ils ne manquent pas de commerçants qui les scandalisent et les perdent, tant au physique qu'au moral. Il ne se perd pas une queue de loup dans ces immenses prairies, il y a toujours quelqu'un pour les ramasser ; mais des âmes créées à l'image de Dieu, rachetées par le sang d'un Dieu, ne trouvent que quelques rares ouvriers... J'en reste là de ces réflexions, bien-aimé Père ; si j'écrivais tout ce que je sens, je ne sais jusqu'où j'irais.\n\nNous arrivions quelques jours après sur les bords du lac Pélican ; je redoutais ce passage, parce que je savais que des sauvages infidèles y vivaient de poisson. Nous cachâmes encore nos provisions, ne laissant paraître que celles dont nous usions, et avant qu'ils nous demandassent du pemmikan, nous leur demandâmes du poisson. Cette petite ruse nous réussit, nos provisions augmentèrent au lieu de diminuer. Le 5 mai au soir, nous étions à l'extrémité sud du lac Vert, où nous nous arrêtâmes le jour de l'Ascension.\n\nNotre voyage en charrette se terminait là. Nous devions prendre désormais la voie d'eau, dès que les glaces nous ouvriraient un passage sur les lacs. Elles formaient encore un pont solide sur le lac Vert ; cependant on me fit dire qu'on n'attendrait pas que cette glace se brisât,\nparce que les rivières étaient libres. Je me rendis donc par terre au point où m’attendaient les employés de l’honorable Compagnie, qui m’accueillirent solennellement en brûlant beaucoup de poudre, et après deux jours de halte je continuai ma route en bateau. Le 15, veille de la Pentecôte, j’arrivais au lac de l’île à la Crosse ; il était aussi couvert de glace ; malgré cela, nous pûmes parvenir jusqu’à une île située à 1 mille de la mission. J’y trouvai une foule de sauvages qui, ainsi que moi, attendaient un passage pour se rendre à la mission. En entendant les décharges que firent ces sauvages à mon arrivée, les Pères et tous ceux de la mission comprurent que je n’étais pas loin, et bientôt le pavillon français surmonté d’une croix flotta sur le clocher. On se demandait si nous finirions par trouver le moyen d’arriver jusqu’à la mission. Enfin le passage devint possible, bien que difficile encore, et j’arrivai à l’île à la Crosse, où j’eus le bonheur, dès le lendemain, d’officier pontificalement dans notre petite église.\n\nJe trouvai tout le monde en bonne santé, et même un certain bien-être commençait à régner dans cette mission naguère si éprouvée.\n\nDès mon arrivée, nous nous occupâmes des sauvages montagnais et cris ; nous avions été très-satisfaits des résultats de la mission. Aujourd’hui, 19 juin, nous sommes très-heureux ; Mgr Faraud et Mgr Clut ont encore ajouté à notre bonheur en venant nous surprendre au milieu de la nuit. Mgr Clut doit partir demain et moi après-demain. Vous m’excuserez donc, bien-aimé Père, si je termine là pour aujourd’hui cette espèce de journal que je n’ai pas le temps de relire.\n\nJe suis avec affection, mon très-révéré Père, votre fils respectueux et soumis.\n\n† Vital, O. M. I.,\nEvêque de Satala.\nVoici quelques extraits de lettres écrites par nos Pères de Saint-Albert à Mgr Grandin, et qui rendent compte de la retraite donnée dans cette mission par le R. P. Lacombe durant la semaine sainte de l'année 1869. Le R. P. Leduc écrivait le 29 mars 1869 les lignes suivantes :\n\nUn bien immense a été fait cette semaine à Saint-Albert. La retraite prêchée par le P. Lacombe a réussi au delà de toute espérance. Toute la semaine, deux fois par jour, l'église s'est remplie de fidèles. Dès les premiers jours, le P. Lacombe a établi la congrégation des jeunes filles ; toutes ont répondu à l'appel qui leur a été adressé. Le vendredi saint, avant l'adoration de la croix, le Père a parlé de la tempérance, puis il a fait appel à la bonne volonté de chacun ; tous les assistants sont venus en masse adorer la croix, promettant de garder la tempérance toute leur vie. Les samedi, dimanche et lundi suivants, tout le reste de la population, hommes, femmes et enfants, a fait la même promesse. La retraite s'est terminée par la plantation d'une belle croix sur le coteau de la mission. Pendant toute la semaine sainte, le P. Lacombe a été occupé du matin au soir, soit à la prédication, soit à l'audition des confessions. Le bon Dieu a couronné ses efforts de succès ; qu'il en soit à jamais béni !\n\nUne seconde lettre, datée du même jour, donne de plus amples détails sur cette même retraite. Nous croyons devoir la reproduire textuellement. Comme la précédente, elle est aussi adressée à Mgr Grandin.\n\nMonseigneur,\n\nNous sommes au lendemain de la clôture de la retraite donnée ici par le R. P. Lacombe, et nous sommes encore tout émus des belles et touchantes cérémonies qui se sont\nsuccédés sans interruption pendant huit jours qu'ont duré les saints exercices. Cette retraite, je m'empresse de le dire, afin de remplir de consolation votre cœur si souvent éprouvé, a parfaitement réussi et porté de nombreux fruits de bénédiction.\n\nLe bon P. Lacombe n'a rien épargné pour éclairer et toucher les cœurs ; il a déployé toutes les ressources de son zèle vraiment apostolique, et selon son habitude il ne s'est pas épargné. À peine a-t-il eu le temps de se reposer des fatigues de son pénible voyage. Il est arrivé le vendredi avant le dimanche de la Passion, et aussitôt il s'est occupé des intérêts de la mission et de nos chers métis. Le dimanche de la Passion il leur donna rendez-vous pour le mercredi suivant au pont situé sur la rivière Esturgeon, qui est en mauvais état, afin de le refaire. Au jour fixé, il arriva des premiers ; les métis furent presque tous fidèles au rendez-vous, où ils arrivèrent les uns avec des bœufs, d'autres avec des haches ; la besogne commença à l'instant même : plusieurs allèrent abattre des arbres dans les bois, pendant que d'autres jetèrent à bas le vieux pont brisé ; enfin tout marcha si bien qu'en deux jours un pont solide remplaçait l'ancien qui ne pouvait plus servir.\n\nLa retraite a commencé le dimanche des Rameaux par le chant du Veni, Creator ; l'église était comble. Tous nos bons métis ont écouté l'instruction d'ouverture avec une attention et un recueillement qui annonçaient leur satisfaction et la bonne volonté dont ils étaient animés. Le soir a eu lieu le chemin de la croix fait solennellement en cri et suivi d'une instruction en français et en cri.\n\nLes trois premiers jours, il y a eu deux instructions : l'une le matin, à la suite de la sainte messe, pour les femmes ; l'autre le soir, vers quatre heures, pour les hommes. Cette dernière était précédée du chemin de la croix et tou-\njours faite en français et en cri, afin que tout le monde pût la comprendre. Pendant ces trois jours, le Père a fait sur les sacrements des instructions admirables de simplicité, de clarté, et bien propres à faire connaître et aimer ces sources de grâce établies par Notre-Seigneur. Les quatre derniers jours, toute la population se rendait à l'église deux fois par jour, matin et soir, pour assister aux offices si touchants de la semaine sainte et entendre la parole de Dieu. Le R. P. LACOMBE prêchait au moins pendant une heure à chaque exercice et les assistants l'écoulaient avec la plus grande attention.\n\nLe jeudi saint, le Père établit la congrégation des enfants de Marie et la société de tempérance pour les femmes. Les jeunes filles, averties d'avance, sont venues, la tête couverte d'un voile blanc, se consacrer à la très-sainte Vierge ; cette cérémonie a paru les rendre très-heureuses, et maintenant, à tous les offices, elles se réunissent aux pieds de la statue de la très-sainte Vierge, près de l'autel, du côté de l'Evangile. Les femmes ne sont pas venues avec moins d'empressement quand il s'est agi, pour elles, de prendre la tempérance. Puis, après l'office, les deux congrégations ont élu à la pluralité des voix une présidente et deux assistantes.\n\nLa journée du vendredi saint, déjà si touchante par les émouvantes scènes de la passion qu'elle rappelle aux coeurs chrétiens, fut la plus belle de cette retraite. C'était le jour où les hommes, à leur tour, allaient former une société de tempérance. Les saintes cérémonies commencèrent ; le P. Leduc officiait. Déjà les prières que dans ce jour des miséricordes du Seigneur on adresse à Dieu pour tous ceux qui ont besoin de pardon et de consolation sont terminées ; la croix voilée en signe de douleur est solennellement découverte et offerte aux adorations de tous les fidèles. Alors le P. LACOMBE pense que c'est le moment de\nparler au cœur des bons métis, et il leur dit l'amour de Notre-Seigneur Jésus-Christ pour nous et la nécessité de lui témoigner notre amour d'une manière efficace ; il parle avec tant de force et en termes si touchants, mêlant des larmes à ses paroles, que tous les assistants, émus jusqu'au fond de l'âme, ne peuvent retenir leurs larmes. On pleure de tous côtés, les hommes aussi bien que les femmes. Puis, après cette touchante instruction, les hommes sont invités à venir s'agenouiller à la table sainte, pour promettre à Jésus crucifié par amour pour nous que désormais ils garderont la tempérance. Alors l'un des assistants se lève le premier et s'avance résolument pour faire la promesse, et il est suivi d'un grand nombre. Ceux qui ont pu ce jour-là résister à l'appel du missionnaire sont entraînés par l'exemple les jours suivants.\n\nLa clôture de la retraite a eu lieu le jour de Pâques après les vêpres. On a élevé sur le coteau de Saint-Albert une belle croix de 28 pieds de hauteur qui domine tout le pays de nos bons métis, comme pour les bénir et les engager à la persévérance...", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007516.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 30678, "total-output-tokens": 11728, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1313, 1], [1313, 3102, 2], [3102, 4800, 3], [4800, 6635, 4], [6635, 8162, 5], [8162, 10022, 6], [10022, 11886, 7], [11886, 13748, 8], [13748, 15648, 9], [15648, 17536, 10], [17536, 19464, 11], [19464, 21389, 12], [21389, 23317, 13], [23317, 25226, 14], [25226, 27140, 15], [27140, 29055, 16], [29055, 30901, 17], [30901, 32660, 18], [32660, 34338, 19], [34338, 36202, 20], [36202, 38105, 21], [38105, 39199, 22]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]