[{"id": "39fefc77cf375a14ac4a8f60ad16cb6fc248fbe4", "text": "VICARIAT DE SAINT-ALBERT.\n\nJOURNAL DE VOYAGE DE Mgr GRANDIN.\n\nNous avons en main le Journal de l'évêque missionnaire. Il a été, nous dit-il, écrit à plusieurs reprises, sur les genoux du voyageur, à divers campements ou en canot d'écorce. Ces notes, jetées en courant sur le papier, sont précieuses. Nous en détachons les souvenirs les plus intéressants. Commencé le 30 août 1887, ce Journal se ferme à la date du 2 novembre, à Saint-Boniface.\n\nJe puis dire que je suis en voyage depuis le 1er juin 1886. Je partais à cette époque pour visiter les différents postes de mon diocèse, qui ont eu le plus à souffrir de la guerre. Depuis, je ne me suis pas arrêté. J'ai dû, pour la plus grande gloire de Dieu et le bien de mon diocèse, visiter deux fois le Canada civilisé, et puis l'Europe, pour assister au Chapitre général. Peu de temps après cette solennelle assemblée, je quittais la France, le 18 juin, pour reprendre le chemin de l'Amérique. À Ottawa, j'étais sur la route de Saint-Albert. La Compagnie du Pacifique se montra très généreuse envers moi, comme elle l'avait été également pour les PP. André et Lestanc.\n\nAprès avoir réglé quelques affaires à Ottawa et à Montréal, le mercredi 20 juillet, à huit heures du soir, je prends la route du Nord-Ouest. À Port-Arthur, le P. Lestanc, qui m'avait précédé, me rejoignait, et le 23, à neuf heures du matin, nous arrivions à Saint-Boniface. J'éprouvai une joie d'autant plus grande à revoir Mgr Taché, que la santé du vénéré archevêque me parut être meilleure qu'à mon premier passage. Malgré les instances les plus gracieuses, je dus m'arracher à son hospitalité prématurément, et, laissant à Saint-Boniface les PP. Les-\nTANC et ANDRÉ, je partais le 26 pour Calgary, où j’arrivais le 27, à dix heures du soir.\n\nJe ne sais, mon bien-aimé Père général, si vous avez entendu parler d’une source thermale qu’on a découverte dans les montagnes Rocheuses. Ses eaux passent pour avoir une grande vertu, et on les dit excellentes pour guérir les rhumatismes. Le gouvernement fédéral a fait construire là des établissements considérables. Baux — c’est le nom de la nouvelle ville — va devenir une véritable ville d’eaux, et l’affluence des malades y sera grande en été. À mon passage à Ottawa, j’avais fait quelques démarches pour obtenir du gouvernement la cession de quelques lots, pour avoir là un pied-à-terre. Le ministre de l’intérieur partait à ce moment pour Calgary et Baux, où il se réservait de traiter l’affaire avec le P. LACOMBE.\n\nLe 29 juillet, je partais de Calgary pour Baux, afin de voir ces eaux merveilleuses dont je n’avais appris l’existence que pendant mon voyage en Europe. J’étais accompagné du P. BLAIS, chargé de visiter les diverses stations du chemin de fer dans mon diocèse. M. White, ministre de l’intérieur, était avec nous dans le même train. C’était providentiel. Le soir du même jour, nous arrivions à Baux, et Son Honneur me donnait rendez-vous pour le lendemain, pour faire en sa compagnie et dans sa voiture une exploration dans le pays, afin d’y choisir un emplacement favorable à mes projets. Le P. BLAIS et moi descendîmes dans un hôtel fort convenable, près de la gare. Le propriétaire est franc-maçon et porte ostensiblement ses insignes, mais il se dit catholique. Sa femme est certainement catholique, et ses charmants enfants ont été baptisés par nous. En fin spéculateur, notre hôte s’est dit que la ville, qui est encore à 1 mille de là, se prolongera un jour jusque vers la gare avec ses plus beaux quartiers. Mais, au contraire, il est probable que la station du\nchemin de fer sera reportée plus près de la ville actuelle. Il se disait que l'église bâtie près de chez lui empêcherait le déplacement de la station, et il nous engageait vivement à nous établir dans son voisinage. Malheureusement, il y a en ville d'autres maîtres d'hôtel et des marchands qui font le même raisonnement; tous voudraient avoir l'église près d'eux, comme un moyen de favoriser la prospérité de leur commerce. À ce point de vue, protestants et francs-maçons sont dévots. Et c'est pour ce motif que le P. Lacombe, moins libre que moi, ne se joignit pas à nous pour aller à la découverte d'un emplacement.\n\nLe 30 au matin, nous disions la messe dans ma chambre; mon hôte, sa famille et quelques voisins qui avaient eu connaissance de mon arrivée y assistaient. Je me risquai à leur faire une petite instruction en mauvais anglais.\n\nAprès le déjeuner, le ministre, accompagné de sa famille, venait me prendre, et il voulut bien me servir de guide et de cicerone. Nous nous rendîmes d'abord à la source. La température en est si élevée qu'il est impossible de prendre un bain à la source même. Après cette première excursion, nous nous séparâmes, et Son Honneur me donna rendez-vous, pour l'après-midi, à un hôtel qu'il m'indiqua. J'avais refusé l'invitation à dîner, afin de pouvoir rejoindre le P. Blais. Un brave Italien, que le hasard me fit rencontrer, s'offrit à me guider à son tour dans cette seconde partie de mon exploration. C'était un bon chrétien, tout dévoué à l'Église et au Pape. Il m'amena à un hôtel tenu, ni plus ni moins, par un Parisien, un vrai Parisien de Paris. Il nous servit donc, le P. Blais et moi, à la parisienne, et ne voulut rien accepter pour son dîner qui était excellent, se disant trop honoré de ma visite et de celle de Son Honneur. Celui-ci vint me\nreprendre à l'heure indiquée. Mais, entre temps, le Parisien m'avait fait parcourir les rues tracées déjà, mais peu habitées, et il nous avait engagés d'une façon très éloquente à nous établir dans son quartier. C'était, disait-il, notre intérêt, celui de la religion, et, sans doute aussi, ajoutait-il tacitement, c'était son intérêt à lui. Nous nous laissions convaincre, et, quelques instants après, le ministre nous accordait trois lots tout près de là. C'était suffisant. Il n'est pas nécessaire d'avoir à Ranf (1) beaucoup de terrain ; ce n'est pas un pays propre à la culture, et l'avenir de la ville dépend exclusivement de la réputation, récente encore, de ses eaux. Mais il est nécessaire d'y avoir un poste, soit à cause des catholiques qui viendront là, comme les autres, soigner et guérir leurs rhumatismes, soit à cause de nos Pères, à qui il peut être utile également de venir, dans la saison, chercher un adoucissement et un remède à leurs infirmités.\n\nLe dimanche 28 août, fête de saint Albert, patron du diocèse, j'ordonnais prêtre à Saint-Albert même le F. Thérien, et le soir du même jour je bénissais deux belles cloches que je dois à la générosité d'un ancien condisciple du diocèse du Mans. J'ai cru devoir, par reconnaissance, nommer le donateur, mon ami, vicaire général de Saint-Albert. Durant mon court séjour au chef-lieu du diocèse, j'ai pu voir tous les Pères et Frères du district. Tous se réunirent près de moi, et nous pûmes faire en commun la petite retraite mensuelle.\n\nÀ Saint-Louis du lac d'Oignon, ancienne mission du P. Marchand, il ne reste plus que des cendres. Le P. Merrer a pu, cependant, y bâtir une petite maison-chapelle, qui, plus tard, servira de maison d'école. Le P. Bigonnesse\n\n(1) Nous ne garantissons pas l'orthographe de ce nom. Nous avons lu tantôt Baux, tantôt Ranf. (Note de la Rédaction.)\nétait venu, de Battleford, pour me voir, et nous dûmes nous contenter de l'unique appartement du P. Mérer. Le lendemain, je m'installai sur un tas de bois qui doit servir à la construction de la nouvelle église. Ce fut dans ce siège parloir que je vis successivement les Pères. Quelques chrétiens se préparèrent à gagner l'Indulgence plénire accordée à mes diocésains par le Souverain Pontife, à l'occasion de ma visite. Il y eut grand'messe solennelle. Le chant surtout fit sensation; le P. Cochin sut tirer des sons très harmonieux d'un vieux violon d'emprunt, grâce auquel les voix purent se soutenir.\n\nJe constatai chez les sauvages une attitude chrétienne que je n'avais pas encore eu occasion de signaler, et qui me fit plaisir. Le R. P. Soullier, lors de sa visite, fut affligé avec raison de l'ignorance de ces pauvres gens et de leur manque de tenue. À cette époque, ils ne voyaient le prêtre qu'en passant; maintenant le prêtre réside au milieu d'eux. D'après le calcul du P. Mérer, il y a à la mission de Saint-Louis du lac d'Oignon cent quatre-vingts catholiques, vingt protestants et un bon nombre d'infidèles. À cette mission se trouve le père de celui qui donna au P. Fafard le coup de grâce. Le meurtrier affirma qu'il ne l'avait fait que par pitié, parce que la victime ne pouvait survivre à ses blessures. Malgré ses excuses, il fut condamné et exécuté. Son père, vieillard malheureux et qui n'avait que ce seul fils, voulut remercier les PP. Bigonnesse et Cochin de l'assistance qu'ils avaient donnée à son pauvre enfant, soit dans la prison, soit au jour de l'exécution. « Quand le chagrin envahit mon âme, me dit ce pauvre homme, je prends mon chapelet, je prie et je sens que mon cœur devient fort. » Il commuia à ma messe, lui et sa femme.\n\nLe 5 septembre, nous laissions le P. Dauphin en charge de la mission, et nous partions, le P. Mérer et moi, pour\nSaint-Raphaël, mission des Montagnais. Nous pûmes nous rendre le jour même près du P. Legoff. Admirable réception ! Messe pontificale le lendemain, communion à peu près générale. Départ plus bruyant encore que l’arrivée. Le P. Legoff et moi, chacun en canot d’écorce, nous nous dirigeons vers l’île à la Crosse. Station au lac Vert. Là, il me fallut soutenir un véritable assaut des habitants, me demandant un prêtre à poste fixe, et un autre pour les habitants du lac de la Prairie, à 20 milles plus loin.\n\nÉcrivant péniblement mon Journal sur mes genoux, en canot d’écorce ou en campement, je ne puis qu’abréger les détails. J’arrivai à l’île à la Crosse le 13 septembre. La réception fut des plus solennelles, et la poudre ne fut pas épargnée. J’aime à croire que tous ces bons sauvages sont sincères dans leurs démonstrations. Je fis le sermon d’ouverture de leur retraite ; mais les instructions furent ensuite données aux Montagnais par le P. Legoff, et aux Cris, dans la chapelle des Sœurs, par le P. Teston. Le P. Rapet et moi, nous nous partageâmes les confessions des Montagnais. Je puis affirmer, mon très Révérend Père, que quand même la Congrégation, dans notre immense territoire du Nord-Ouest, n’eût fait autre chose que de fonder cette mission et de christianiser ceux qui la fréquentent, elle aurait déjà fait et assuré un très grand bien. Il y a un peu plus de quarante ans, il n’y avait pas ici de chrétiens, et les premiers Oblats venus à l’île à la Crosse durent semer dans les larmes et dans la pauvreté ; maintenant la mission compte plus de sept cents chrétiens ; la mission du Portage, qui en dépend, en compte deux cents, et celle de Saint-Raphaël, près de trois cents. Je doute que, dans les meilleures paroisses de France, les fidèles donnent plus de consolations à leurs curés que nos chrétiens en donnent ici à leurs missionnaires. Ils s’approchent des sacrements avec la plus vive piété et se montrent\nd'une grande générosité pour leurs prêtres, à qui ils sont trop heureux de rendre gratuitement tous les services. Les chasseurs font toujours la part de la mission ; à mon départ, j'ai été moi-même l'objet de la générosité de ces cœurs reconnaissants. Ils m'apportaient, qui une assiette, qui une paire de mocassins ; celui-ci de petites boîtes d'allumettes, celui-là un morceau de cuir. Une bonne vieille me remet un paquet d'aiguilles, en me disant : « Mon grand Père, je voudrais bien te donner quelque chose de plus beau, mais je ne puis disposer que de cela. » Il fallut m'arracher, bien ému, à ce cher peuple. Au lac Vert où je dus repasser, je vis se renouveler les instances qu'on m'avait déjà faites au sujet de l'envoi d'un missionnaire résidant. Après avoir prêché, confessé, confirmé, je me dirigeai vers Notre-Dame de Pontmain ; sur la route, je fis une halte et une courte mission à la rivière Coquille. Là, comme au lac Vert, j'ai pu constater le bien résultant de la création de nos orphelinats. Les jeunes familles catholiques de ce pays, formées au milieu d'un entourage protestant et infidèle, sont dues à ces institutions ; et c'est là la meilleure réponse aux objections et aux critiques, comme le meilleur encouragement pour le dévouement de nos Sœurs, à qui nos orphelins doivent l'instruction et la bonne éducation.\n\nÀ Pontmain encore, comme ailleurs, je prêchai, confessai, confirmai. Les enfants, bien formés par le P. Paquette, firent, de la manière la plus satisfaisante, les frais du chant.\n\nLe 10 octobre au soir, nous arrivions à Prince-Albert. Le 12, je prêchai et donnai la confirmation à un certain nombre de personnes, entre autres à un presbytérien converti. Les Fidèles Compagnes de Jésus ayant pu se procurer un local plus convenable que le premier, le cher P. Dommeau a pu transformer leurs classes en église\nprovisoire ; ce qui m'arrange fort, parce que je suis ainsi dispensé de bâtir, du moins pour quelques années. L'école des Fidèles Compagnes obtient toujours les succès les plus mérités. Les diverses sectes protestantes s'en sont émues, et, pour opposer une digue aux progrès de l'enseignement catholique, les Presbytériens ont élevé un magnifique pensionnat près de notre mission. Mais les bonnes Mères continuent leur œuvre, et, à une séance donnée en mon honneur, j'ai été émerveillé des résultats. Ce ne fut pas sans un mélange de surprise et de vraie satisfaction que j'entendis une jeune fille débiter des vers français avec une excellente prononciation et un petit enfant de dix ans environ réciter un morceau de prose, également dans la même langue, avec le plus grand aplomb. Ces deux élèves sont les enfants de l'ancien évêque protestant de Prince-Albert. Ceci donne la mesure de l'inutilité du cri d'alarme jeté par les Presbytériens.\n\nLe 12, au matin, en entrant à la chapelle, je fus tout surpris d'y voir un prêtre à l'autel : c'était le P. LECOQ. Ce cher Père évangélise deux futures paroisses, plusieurs réserves et d'autres points fort éloignés. Aussi est-il toujours en route, au grand mécontentement de son cheval, et pour lui-même au prix de grandes fatigues. Le 13 octobre, je prêchai à Saint-Laurent, j'y assistai à une grand'messe, je confirmai, et le lendemain nous faisions la retraite du mois. Plusieurs Pères s'étaient réunis pour cette circonstance et pour me voir. J'étais entouré des PP. FOURMOND, TOUZE, PAQUETTE, MOULINS, LECOQ, DOMMEAU et du F. PIQUET.\n\nLe 22, après un voyage que la neige rendit pénible, j'arrivais chez nos Pères de Qu'Appelle, où je rencontrai le R. P. LACOMBE. Deux jours après, j'étais à Régina, où m'appelaient des affaires importantes. Je fus aidé dans mes négociations, pour la revendication de nos droits, par\nle P. Leduc, que j'avais appelé à mon aide. Dans la nuit du 28 au 29 octobre, nous partions, lui pour Calgary, et moi pour Saint-Boniface, où j'arrivai dans la nuit du 29. Reçu par Mgr Taché avec la plus grande bienveillance, j'arrivai juste à temps pour voir le feu prendre à une des cheminées de l'archevêché. Grâce à Dieu et au F. Jean, on en eut vite raison, mais l'émotion et le mouvement qu'il dut se donner fatiguèrent Mgr l'Archevêque, déjà souffrant.\n\nDe Saint-Boniface, je me rendrai à Ottawa pour y traiter avec le gouvernement fédéral les affaires quo j'ai déjà traitées avec le gouvernement local.\n\n† VITAL, O. M. I.,\nEvêque de Saint-Albert.\n\nPROVINCE DES ÉTATS-UNIS.\n\nTEXAS.\n\nLETTRE DU R. P. MALMARTEL AU R. P. MARTINET.\n\nEagle Pass, le 24 mai 1887.\n\nMon révérend et bien cher Père,\n\nLe R. P. Provincial me presse instamment de rédiger un rapport sur le jubilé que nous avons prêché pendant les mois d'août, septembre, octobre et novembre de 1886, à des populations mexicaines, très pauvres, sans prêtre, dispersées dans les vastes régions de l'ouest du Texas, et que Mgr Nérat, évêque de San-Antonio, voudrait tant confier aux Oblats. Comment vais-je remplir la tâche qu'on m'impose? Je n'ai jamais tenu une plume. Si je n'ai pas le talent d'intéresser, l'obéissance sera mon excuse. Je vais donc, si vous le voulez bien, vous faire parcourir en esprit plus de 1000 milles et vous dire en même", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007764.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 12456, "total-output-tokens": 5038, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1675, 1], [1675, 3558, 2], [3558, 5356, 3], [5356, 7204, 4], [7204, 9081, 5], [9081, 11014, 6], [11014, 12862, 7], [12862, 14730, 8], [14730, 16138, 9]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]