[{"id": "178c4c71f33cf551b688cee5d4dbac42af51ce2c", "text": "se sont approchées des sacrements pendant la retraite. Le local qui nous servait alors d'église et d'école pouvait à peine contenir quatre-vingts personnes; avant la retraite j'eus la bonne idée d'y ajouter un hangar provisoire pour une centaine de personnes. Comme je surveillais ce travail, un individu qui passait me demanda ce que c'était; sur ma réponse, qu'on agrandissait simplement la chapelle, il me dit qu'il serait bien plus utile de construire une prison; je lui fis mon compliment pour avoir si bien compris ses propres besoins et ceux de son époque. La semaine d'après, le frère de mon interlocuteur était condamné à deux ans de prison! Après ces deux retraites, nous eûmes la consolation de recevoir dans l'Église catholique une douzaine de protestants et quatre païens. L'accroissement si grand et si subit du nombre de nos paroissiens à Dutoitspan m'obligea à bâtir une nouvelle église et une école paroissiale plus vaste et plus commode que l'ancienne chapelle.\n\nÀ l'époque de sa visite pastorale au mois de novembre dernier, Mgr Jolivet eut la consolation de présider à l'ouverture de l'église nouvelle et de la nouvelle école. Sa Grandeur administra aussi le sacrement de confirmation à soixante et onze personnes, tant enfants qu'adultes. À mon retour à Kimberley, j'ai l'intention de vous faire la description de nos établissements à Kimberley et Dutoitspan, qu'on appelle maintenant Beaconsfield, et de vous envoyer aussi le plan des terrains et des constructions.\n\nAgréez, mon Révérend Père, mes sentiments de respect et de dévouement en J. et M. I.\n\nH. Lenoir, O. M. I.\n\n— Manitoba. — Extraits d'une lettre du R. P. Hugonard au R. P. Soullier, visiteur.\nMon révérend Père,\n\nJ'ai commencé cette lettre à la Mission du lac Qu'Appelle ; je la finis dans une hutte de sauvages, ayant été appelé dans les bois pour préparer au baptême cinq familles sauvages, autrefois protestantes. Leur conversion est l'œuvre de la grâce, et je ne puis résister au plaisir de vous la raconter, pour vous témoigner ma reconnaissance pour tout le bien que m'a fait votre retraite.\n\nL'été dernier, je fus appelé près du lit de mort d'un enfant de douze ans. Après l'avoir administré, je dus voir un autre enfant de sept ans, appartenant à une de ces familles que j'attends aujourd'hui. Ses parents me donnèrent toute autorisation pour le préparer à la mort, il mourut, en effet, quelques jours après dans d'excellents sentiments.\n\nPeu de jours après mon arrivée de la retraite, par un temps exceptionnellement froid et à une heure déjà avancée de la nuit, quelqu'un venait frapper à notre porte, me disant qu'une femme protestante était à la mort et me réclamait immédiatement. Cette mourante était précisément la mère de l'enfant que j'avais assisté l'été dernier. Le messager avait passé à la porte du ministre protestant, mais sans y frapper. Je partis immédiatement et j'arrivai heureusement, mais non sans me geler le bout du nez.\n\nLa malade avait encore sa pleine connaissance ; en me voyant elle poussa un soupir de soulagement en disant : « Ah ! j'avais tant peur de mourir sans voir un prêtre ! » Cette famille avait été fanatique, mais depuis quelque temps on nous regardait d'un œil moins malveillant : deux des enfants avaient même été baptisés catholiques, un par moi et l'autre par le bon Père Decorby, qui a eu grande partie préparé ces conversions, car il a souvent visité ces familles et il y était aimé.\nIl était près de minuit quand j’arrivai chez la mourante ; je commençai tout de suite à l’instruire : ses dispositions étaient admirables, et elle saisissait promptement les vérités principales de notre sainte religion. Vers une heure, je sentis le sommeil m’accabler par suite de la transition du froid à la chaleur, et je dus me reposer un peu. Mais vers trois heures la malade me fit réveiller, me priant de la réconcilier promptement avec Dieu.\n\nC’était une jeune femme qui exerçait une certaine influence sur tous ses voisins ; aussi il y avait dans la maison au moins vingt-cinq sauvages, presque tous païens ou protestants. J’achevai donc l’instruction religieuse de la malade, j’entendis sa confession et la baptisai sous condition. Il était quatre heures et demie du matin. Vers dix heures, je dis la messe, pendant laquelle la malade fit avec une ferveur angélique sa première et dernière Communion. Je profitai de la circonstance pour adresser aux sauvages une bonne instruction dans leur langue ; je sentais, en parlant, une éloquence que je n’ai pas habituellement ; j’étais, en effet, profondément ému, mais les sauvages étaient loin d’être aussi sensibles. Un peu après midi, j’administrai à la mourante le sacrement d’extrême-onction et lui appliquai l’indulgence plénire ; je la reçus aussi du saint Scapulaire. Je dus alors la laisser pour aller plus loin visiter quelques familles catholiques éloignées de l’église et trop pauvres pour y venir, faute d’habillements ou de véhicule. Quand je revins, le lendemain samedi, la malade avait rendu sa belle âme à Dieu la veille, peu après mon départ, mais non sans faire partager ses sentiments admirables aux nombreux sauvages présents, à son mari et à tous ses frères. Ils étaient tous protestants. Quelques instants avant de mourir, me dirent les témoins, la mourante fit appeler son mari et le pria de s’asseoir près de son lit. Ce lit n’était autre chose qu’une peau\nde baffe étendue sur le plancher. La malade demanda alors à son mari de se faire catholique. Celui-ci se mit à pleurer, mais il ne répondit pas : il se contenta de faire signe à ses frères d'approcher. Ceux-ci vinrent s'asseoir près de lui, et la mourante, peinée de l'hésitation de son mari, reprit avec chaleur : « Tu as donc le cœur bien dur, tu vois que je vais mourir, et tu me refuses la seule chose que je te demande avant de te quitter. Je meurs contente d'être catholique, notre enfant est mort déjà dans cette religion. Je veux que tu te convertisses, toi aussi, promets-moi cela avant que je meure. » Le mari hésitait encore, ses frères intervinrent alors pour l'encourager : « Pourquoi hésites-tu à lui promettre cela? tu n'aimes donc pas ta femme puisque tu ne veux pas la suivre, ne crains pas, nous voulons tous nous faire catholiques. » Le pauvre homme se sentit vaincu, il promit à la mourante de se faire catholique, lui aussi. Elle dit ensuite : « Maintenant, je vais vous quitter, j'éprouve justement ce que le Père m'a dit qu'on éprouve à la mort. Ne me donnez plus rien à boire et ne me touchez plus, vous retenez mon âme. » En disant cela, elle se couvrit elle-même la tête avec un mouchoir qu'on avait fait chauffer et elle rendit le dernier soupir : cette fin si touchante fit une profonde impression sur les sauvages, et le lendemain ils me racontaient cela, tout émus. Je restai pour le dimanche, et je dis la sainte messe à côté du cercueil, je prêchai encore en langue crise.\n\nCes fruits de grâce sont dus d'abord à Dieu, qui semble avoir opéré tout seul ce prodige ; mais je ne doute pas que la retraite que vous nous avez donnée et, par laquelle vous avez rendu plus étroits les liens qui doivent nous unir à Dieu, comme les rameaux à la vigne, en faisant de nous de meilleurs Oblats, ne soit pour beaucoup dans ce résultat. Merci donc, bon et vénéré Père, je souhaite que\nvous puissiez revenir parmi nous raffermir et augmenter les fruits de sanctification que vous avez déjà produits.\n\nAgréez, etc.\n\nJ. HUGONNARD, O. I. M.\n\n— Voici ce que nous lisons dans la Sicilia catholica du 11 août :\n\nMARSEILLE\n\nLE CHOLÉRA ET LE CLERGÉ.\n\nÀ ceux qui n’ont pour le clergé que mépris ou indifférence, nous recommandons une chose, une seule : voir de quelle façon il se comporte en temps de calamités publiques. Tandis que beaucoup de personnes se hâtent de fuir les lieux devenus dangereux par la présence de l’épidémie ou par les discordes civiles, le prêtre reste fidèlement à son poste, et si, par hasard, il s’en trouve éloigné quand le danger éclate, il s’empressera de retourner au milieu de son peuple pour relever son courage, lui apporter du secours et lui prodiguer les marques de sa sollicitude.\n\nQue de faits de ce genre n’y aurait-il pas à recueillir à Toulon et à Marseille, ces villes frappées à l’improviste par la terrible maladie que rien ne faisait prévoir, et que l’incurie d’une république insouciante, pour ne rien dire de plus, a laissée pénétrer en France ! C’est aux évêques, aux prêtres, aux religieux, à ces religieux chassés de leurs maisons il y a quelques années à peine par messieurs les républicains, que remontera la reconnaissance de la population pauvre, de cette classe déshéritée, toujours abandonnée au moment de l’épreuve par ceux qui d’ordinaire l’excitent et la poussent au mal; aimée seulement et spécialement protégée par le clergé.\n\nIl serait long d’énumérer les œuvres d’héroïque charité, accomplies par le clergé de Toulon et de Marseille durant ces jours néfastes; impossible de les signaler toutes en détail comme nous l’aurions voulu. Nous devons nous borner à dire quelques mots de ceux qui se sont dévoués à nos ouvriers italiens établis à Marseille.\nLa plupart de ces ouvriers sont originaires des provinces de Naples et, chez eux, l'absence de la patrie n'a fait que rendre plus cher le culte de la religion. Or, le croirait-on? dans une ville qui compte environ soixante mille Italiens, presque tous fidèles à leur religion, il n'y a officiellement ni une église ni un hôpital à leur usage et entretenus par nos gouvernants!\n\nC'est à la charité et à l'insigne générosité de feu Mgr de Mazenod, évêque de Marseille et fondateur de la Congrégation des Oblats de Marie Immaculée, qu'il faut rendre grâce si cette immense famille chrétienne possède, dans la cité, une paroisse où elle peut se réfugier dans les périls et remercier Dieu dans les consolations.\n\nAprès la mort du saint évêque, les Révérends Pères Missionnaires organisèrent l'œuvre charitable sans ménager leur peine, et aujourd'hui tous les intéressés, particulièrement les familles malheureuses au sein desquelles le choléra a porté ses ravages, peuvent dire combien elle était nécessaire, combien elle est utile. On reste épouvanté à la pensée qu'un cinquième des décès a été fourni par cette population ouvrière venue des provinces napolitaines. En peu de jours, soixante de nos laborieux compatriotes ont succombé aux atteintes du fléau.\n\nDemandez maintenant à nos familles revenues de Marseille : Qui donc vous assistait? qui vous consolait? qui vous cherchait du travail et vous procurait des places? qui apportait à vos cholériques les secours de la religion avec les remèdes indiqués, qui en a ainsi rappelé un grand nombre à la vie? Vous les entendrez vous répondre : C'est d'abord le P. Gallo de San Remo, c'est lui l'homme de la Providence pour les pauvres de la colonie italienne : c'est lui notre bon Père. Ils ajouteront que le P. Gallo a eu pour compagnon un digne religieux, le R. P. Bellon, un vrai Français, c'est-à-dire tout cœur et tout charité.\n\nSans exception, tous les missionnaires ont montré dans cette circonstance, comme toujours, qu'ils sont les très vaillants soldats de Jésus-Christ. Dès le début, ils se partagèrent le\ntravail. Celui-ci avait tel quartier, celui-là tel autre ; plusieurs étaient attachés au Lazaret du Pharo, et, de ce nombre, un Corse intrépide, le R. P. d’Istria, qui avait en outre dans son lot les malades les plus éloignés. Le R. P. Gallo, comme recteur de la paroisse, était, d’une manière toute spéciale, chargé de la colonie italienne et efficacement secondé dans ce travail par le R. P. Bellon.\n\nTous, à l’heure présente, sont encore à leur poste et continuent leur œuvre de dévouement. Le R. P. Gallo devait se rendre, vers la fin de juin, à une station d’eaux thermales, en Corse, pour le rétablissement de sa santé ébranlée et déjà il avait bouclé sa valise. Mais à l’annonce du premier cas de choléra, il ne pensa plus à sa santé : avec bonheur, il saisit l’occasion que Dieu lui offrait de prendre part à la lutte de la charité contre le fléau. Il avait conscience d’être aimé de nos pauvres compatriotes ; il ne voulait pas que les familles visitées par le choléra l’appelassent en vain. Sa présence, sa parole, sa bonté paternelle, relevaient promptement le courage abattu et faisaient naître dans le cœur des malades une intime espérance ou, du moins, une douce résignation. Aussi, il fallait voir comme nos braves gens recouraient à lui volontiers ; d’autant plus qu’il entendait et parlait couramment le langage de chacun d’eux (1).\n\nLe travail était écrasant. Il fallait monter dans la mansarde du pauvre, s’enfermer dans l’étroite cabine de l’homme de mer, porter le secours des sacrements et l’aumône matérielle partout où un gémissement se faisait entendre ; et maintenant que la maladie semble cesser ses ravages, le missionnaire se donne encore la mission de cicatriser les plaies de tant de malheureux.\n\nDans les premiers temps de l’invasion cholérique, invasion qui fut, comme nous l’avons dit, soudaine et imprévue, ce fut une providence pour les pauvres, que ces secours matériels des bons Pères, de ces Pères chassés de leurs couvents et\n\n(1) On sait que le napolitain, le toscan et le plémontais diffèrent notablement entre eux.\nà peine tolérés dans leur existence, comme des personnes dangereuses.\n\nVoilà ! voilà les gloires de la Religion !\n\nTerminons ces quelques lignes en envoyant à notre ami le R. P. GALLO, et à ses dignes compagnons, les missionnaires, un salut et un remerciement. Que Dieu les bénisse, qu’il les assiste et qu’il les conserve pour de nouveaux combats, trop faciles à prévoir dans l’avenir de la chrétienté !\n\nL’article qu’on vient de lire, écrit pour des Italiens, insiste naturellement sur le dévouement de nos Pères en faveur de la colonie italienne de Marseille. Nous devons ajouter, pour être complet, que tous nos Pères de Marseille se sont admirablement prêtés aux exigences de la situation et ont refusé d’être relevés de leur poste d’honneur ou secourus dans leur fatigue. Au Pharo notamment, il faut ajouter au nom du P. D’ISTRIA, le nom du P. BOEFFARD, celui du P. BOVIS et celui du R. P. GIGAUD. Deux ou trois fois la semaine, le R. P. GIGAUD se rend à l’hôpital spécial pour y confesser les religieuses; le P. BOVIS n’a cédé la place qu’à l’arrivée du P. D’ISTRIA dont la présence était rendue nécessaire par le nombre relativement considérable d’Italiens parmi les malades. Enfin, le P. BOEFFARD n’a cessé, du premier moment jusqu’à ce jour, d’accomplir son glorieux service.\n\nQu’ils reçoivent tous nos félicitations, et que Dieu les récompense au centuple de leur héroïque charité !", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007702.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11072, "total-output-tokens": 4363, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1679, 1], [1679, 3424, 2], [3424, 5359, 3], [5359, 7263, 4], [7263, 9081, 5], [9081, 11144, 6], [11144, 13202, 7], [13202, 14595, 8]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]