[{"id": "350c3e204e324fd19d4836be5722c09905657e97", "text": "NOUVELLES DIVERSES\n\nLe Bulletin de la Société de géographie, numéro d’avril 1880, publie une lettre du R. P. Petitot, adressée à M. de Semallé, membre de la Société. Nous en citons ici les dernières pages :\n\nUn jour les Cris conduisirent au fort Churchill, où ils s’étaient rendus pour la traite des fourrures, une femme dénue qu’ils avaient faite esclave le long de la rivière susdite et que l’un d’entre eux avait épousée. Lorsqu’elle vit que les Anglais étaient des hommes humains et débonnaires, qui traitaient avec honté les féroces sauvages qui venaient à eux, elle s’enfuit vers le fort et implora la protection de ces étrangers. Elle parlait le cris, comme la majorité des Chippewayans ; elle leur raconta ses malheurs par l’intermédiaire de l’interprète cris du fort ; elle les pria de la protéger contre ses persécuteurs et de la rendre à son peuple, une nation paisible et bienveillante vers laquelle elle se chargea de conduire les Anglais commerçants. Les Anglais se rendirent à ses désirs et, après le départ des Cris, ils envoyèrent avec elle leurs serviteurs, qu’elle conduisit dans sa tribu. C’est ainsi que les Anglais pénétrèrent pour la première fois dans la rivière la Paix.\n\nÀ partir de cette époque, les Chippewayans entrèrent en relations commerciales avec le fort Churchill et se frayèrent peu à peu une voie de communication avec lui au travers des Cris leurs ennemis.\n\nIls en vinrent au point d’être les principaux maîtres du lac Athabaskaw et occupèrent toutes les steppes qui s’étendent de cette petite mer d’eau douce à la baie d’Hudson.\n\nRefoulés graduellement par eux, les Cris se retirèrent le long des rivières Athabaskaw et la Paix, et dépérirent peu à peu. En 1862 il y en avait encore près de trois cents au lac Athabaskaw, en 1879 je n’en ai vu que trois familles, et\nelles viennent de faire abandon complet de leur ancienne conquête.\n\nLes Dénés, au contraire, quoiqu'ils soient un peuple fort pacifique, ont fini par occuper non seulement ce lac et celui du Caribou, mais encore ceux de l'île à la Crosse, du Coeur-Froid, la Bioche, la Rouge, ainsi que les abords des rivières Missi-nipy, Castor et Athabaskaw.\n\nVoilà des données certaines, entièrement nouvelles et qui m'expliquent pourquoi mes Peaux-de Lièvre ont conservé une si grande peur des Castors et des Cris, dont ils sont séparés par près de 500 lieues, et pourquoi un de mes confrères a trouvé à l'extrémité sud du lac Athabaskaw des couteaux de pierre de forme identique à ceux que j'avais trouvés au nord de Good-Hope.\n\nUn autre fait m'était tout à fait inconnu, bien que j'aie passé déjà dix-huit ans avec les Dénés, les interrogant sans cesse sur leurs coutumes et leurs traditions et consignant fidèlement sur le papier les moindres particularités curieuses que m'offre ce peuple : c'est que les Dénés Chippewayans déforment la tête de leurs enfants, ce qui les fait rentrer dans la catégorie des peuples soi-disant touraniens ou altaïques. Quand je me sers du mot *deformer*, je m'exprime mal. Au lieu d'aplatiser artificiellement la tête de leurs enfants comme les Wakish de l'Orégon et les Tongwans ou Kollouches à tête plate, ou de l'allonger en mitre d'évêque comme les Kaïgans ou Kollouches à tête droite, les Dénés prennent le plus grand soin d'arrondir parfaitement la tête encore molle des nouveau-nés, en déprimant toutes les protubérances qu'elle offre naturellement. Ce travail maternel est, me dit-on, l'œuvre de tous les jours, et nous l'avons ignoré jusqu'à aujourd'hui ! Et il a fallu la naïve confiance de mon serviteur déné actuel pour que je fisse cette déconvenue ! Il y a plus de trente ans que nos pères sont parmi les Dénés, et tous ont toujours cru que la tête des Dénés, dans sa régularité, était l'œuvre de la nature. Eh bien, il n'en est rien ; et je soupçonne que la tribu algique des Naskapits du bas Canada, appelés par les Français « têtes de boule » à cause de l'extrême rondeur de\nleur boîte osseuse, soumet la tête des enfants aux mêmes manipulations.\n\nNe voilà-t-il pas de quoi désorienter les craniologistes ? Jusqu’ici on n’avait connu que des crânes aplatis ou allongés artificiellement, je vous en présente maintenant de si bien arrondis, qu’il n’y paraît aucune espèce d’artifice. Que deviennent, après cela, les catégories d’hommes brachycéphales et d’hommes dolichocéphales ? Comment avoir confiance dans les crânes indiens qui paraissent les mieux conformés, et qui nous dit que certains hommes préhistoriques n’arrondissaient pas également les crânes de leurs enfants ?\n\nJe voudrais bien savoir ce que pensent de cela nos anthropologistes, d’autant plus que ce précédent nous empêche désormais de voir rien de naturel dans les têtes en pain de sucre ou surélevées de la généralité des Peaux-Rouges. Qui nous garantit que ces formes ne sont pas artificielles ? Si l’on m’objecte que les Indiens ne soumettent leurs enfants à aucun procédé mécanique, je renverrai à mes Montagnaises qui savent fabriquer de si jolies têtes à leurs enfants, avec l’aide de leurs seules mains.\n\nL’en-tête de ma lettre vous aura appris que je suis maintenant casé dans une autre mission. J’appartiens, en effet, à Mgr Grandin, évêque de Saint-Albert, et me trouve dans la province ou territoire de la Saskatchewan, quoique toujours parmi les Dénés. Je suis entouré de Cris, et les Sioux, les Assiniboines, les Sarcis et les Pieds-Noirs ne sont pas bien loin de chez moi. Quant à ma chère mission du fort de Bonne-Espérance, j’en suis, hélas ! à plus de mille lieues !\n\nDes traités ont été conclus ces dernières années successivement avec les Chippewayans ou Saulteux, les Cris ou Eyiniwok, les Pieds-Noirs ou Sixicaques, les Assiniboines ou Jesga, les Sarcis et les tribus les plus méridionales des Chippewayans ou Dénés. On leur a demandé la cession de vastes territoires qui ne pouvaient plus les nourrir, moyennant une pension annuelle en argent et vêtements, et le don de tous les objets, instruments, animaux et semences nécessaires à former des établissements durables sur une réserve ou lot de\nterre arable, que l'on a alloué à chaque peuplade ou à chaque bande d'après son choix et son goût.\n\nSi vous le désirez, je vous ferai passer la substance de l'un de ces traités. Vous verrez de quelle manière l'Angleterre s'y prend pour assurer sa puissance, tout en faisant le bonheur de ses nouveaux sujets. On ne saurait nier que cette nation n'ait la bosse de la colonisation. Elle fait les choses largement et ne tracasse pas les pauvres Indiens comme le font les Américains. Ses agents sont honorables, probes, et leur patience n'a d'égale que leur bon vouloir.\n\nBref, pour en revenir à ce qui me regarde, mon saint évêque, Mgr Grandin, vient de me confier une de ces réserves, celle des Dénés de la rivière Castor et du Lac-Froid. J'ai là une cinquantaine de familles, dans les veines desquelles sont quelques gouttes de sang français, car beaucoup d'entre elles sont des descendants de Français appartenant à l'ancienne compagnie de la Nouvelle-France ou à celle du Nord-Ouest qui lui succéda. Alliés à des femmes indiennes et ayant laissé leurs enfants dans les bois, ceux-ci s'y sont perpétués jusqu'à ce jour, en engendrant ce que les Espagnols nomment des métis par saut en arrière et des fils de l'air. Je voudrais que quelqu'un de nos utopistes modernes vint ici pour apprendre comment, de civilisé, on peut devenir un pur sauvage au bout de deux ou trois générations. La chose est plus facile qu'on ne le pense chez vous, mais il est bien plus difficile de faire un civilisé d'un sauvage. C'est à quoi je vais essayer de travailler le reste de ma vie, s'il plaît à Dieu.\n\nLa terre de mes Dénés est située de chaque côté de la rivière Castor, un des tributaires du lac Ile-à-la-Crosse. Chaque famille de cinq personnes possède une terre d'un mille carré (2 589 kilomètres carrés), avec bois, savane à foins, terre labourable et eaux douces. Le Missionnaire a droit à la même quantité de terre qu'une famille de cinq. J'ai donc reçu aussi mon mille carré, c'est-à-dire plus d'un kilomètre et demi carré, d'excellente terre exposée au sud-est, avec une petite chaîne de collines boisées de grands sapins à l'ouest et au nord-ouest, une savane à foins très vaste, un lac poisson-\nneux à proximité et un charmant et abondant ruisseau propre à faire mouvoir un moulin et une scierie mécanique.\n\nSur une butte flanquée d'un charmant étang naturel j'ai le projet d'établir ma résidence et mon église. Ma vue embrassera une vaste plaine très fertile dans laquelle seront disposées les fermes de mes Chippewayans; la plaine, arrosée par le ruisseau dont j'ai parlé, est flanquée de chaque côté d'une longue colline boisée. Des étangs sans nombre sont parsemés dans ces collines et assurent une récolte de foin abondante; d'autre part, à peu de distance, plusieurs grands lacs de pêche fourniront journellement à la nourriture de mon peuple d'énormes truites saumonées, des poissons blancs exquis, des carpes, des perches et des brochets. Vingt-huit champs sont déjà défrichés; et cet automne les plus laborieux ont déjà récolté 1352 minots (1 minot = 30 litres) de pommes de terre, de l'orge, des légumes, etc. Ma petite colonie possède déjà dix-neuf bêtes à cornes (bœufs et vaches). Je lui en ai obtenu cinq du gouvernement cet automne, ainsi que vingt sacs de farine, du thé, du sucre, des vêtements.\n\nAfin d'encourager les sauvages au travail, le gouvernement leur accorde gratuitement une prime de 6 livres sterling (150 fr.) pour chaque bâtisse en bois qu'ils construisent et une autre prime de 4 livres pour chaque mille pieux de clôture qu'ils plantent en terre, bien que ce soit pour eux-mêmes qu'ils travaillent. Cet argent ne leur est pas livré en espèces; il est converti en farine, bœufs, pores, sucre, thé et autres comestibles, ainsi qu'en bêtes de somme et de labour. Chaque homme marié reçoit 2 haches, 2 pioches, 4 haches, 2 faux, 2 faucilles, 2 pierres à faux, 4 limes, 2 fourches, etc. Chaque groupe de trois familles a droit à une charrue, une herse et une paire de bœufs de labour. Enfin les semences, les médicaments et un coffre de charpentier sont fournis gratuitement à chaque bande.\n\nVoilà ce que fait le gouvernement et ce qu'un gouvernement seul peut faire. Il faut plus que des sermons et de bonnes paroles pour tirer ces hommes de leur torpeur; il\nfaut les forcer au travail en leur fournissant le pain et le couteau, en leur coupant les morceaux et même en les leur machant.\n\nPetitot, O. M. I.\n\nLe R. P. LACOMBE a fait cette année une nouvelle apparition en Canada pour les intérêts de la colonisation catholique du Manitoba. Le zélé Missionnaire a donné des conférences dans plusieurs villes et est reparti à la fin d’avril pour Winnipeg avec une colonie recrutée par lui. Le Courrier de Saint-Hyacinthe rend compte en ces termes d’une de ces conférences :\n\nLE R. P. LACOMBE ET MANITOBA.\n\nSelon qu’il avait été annoncé, le dévoué et infatigable apôtre de la colonisation du Manitoba était en cette ville dimanche ; et, après avoir donné, à la grand’messe, le discours de circonstance, il convoquait une assemblée qui fut tenue à trois heures de l’après-midi, dans la chapelle-cathédrale, d’où l’on avait enlevé pour la circonstance le très saint Sacrement.\n\nUne foule anxieuse de voir et d’entendre l’homme de dévouement et de bien, dont le nom est si intimement lié à l’œuvre de coloniser et de peupler le Nord-Ouest, était accourue et se pressait à flots tumultueux dans la vaste enceinte de la chapelle-cathédrale.\n\nQuelle perspective invitante, en effet, dans un temps comme celui que nous traversons, où l’émigration à l’étranger est devenue une plaie nationale, où chacun, comme pris de vertige, se laisse aller dans le courant de ceux qui partent, sans considérer si ce n’est pas la misère affreuse au lieu d’un bien-être facile qu’il va chercher là-bas ; quelle perspective invitante que celle d’entendre un missionnaire de la charité,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007656.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8350, "total-output-tokens": 3637, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1806, 1], [1806, 3920, 2], [3920, 6029, 3], [6029, 8219, 4], [8219, 10312, 5], [10312, 11909, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]