[{"id": "fac3dd38f8b8a208740af337e52ad86bd38ad5b6", "text": "nistres et maîtres d’école protestants pullulent. Je ne vous dirai point toutes les contradictions que nous avons rencontrées, toutes les objections ridicules et méchantes qu’il a fallu détruire. Il est pénible de voir des gens, qui prétendent travailler à la civilisation des pauvres enfants de la prairie, profiter de leur ignorance et de leur caractère soupçonneux pour répandre l’erreur et les préjugés les plus absurdes. L’agent des sauvages lui-même, épousant la querelle de ses ministres, nous fit toutes sortes de difficultés, n’exécutant que de très mauvaise grâce les instructions reçues de son département. Malgré tous ces obstacles, nous réussîmes au-delà de nos espérances; nous eûmes le nombre d’élèves fixé d’avance pour cette réserve et il nous fallut refuser quelques demandes. Dieu en soit béni! avec le temps ces préjugés tomberont et nos ennemis resteront avec la honte de leur fraude infructueuse.\n\nPriez beaucoup, mon révérend Père, et faites prier pour nous et nos pauvres sauvages. Je me recommande moi-même aux ferventes prières du noviciat.\n\nLEGAL, O. M. I.\n\n— MISSION DE SAINT-PIERRE DU LAC CARIBOU. Extrait d’une lettre du R. P. Gasté au R. P. Soullier.\n\n15 septembre 1884.\n\nMON RÉVÉREND ET BIEN CHER PÈRE,\n\nVoilà déjà une année révolue depuis que j’ai eu l’insigne bonheur de faire votre connaissance à Prince-Albert et surtout à Saint-Albert. Je remercierai toujours le bon Dieu de m’avoir ménagé cette bonne fortune; j’espère aussi, Dieu aidant, ne pas oublier les fortes pensées que vous nous exposez d’une manière si heureuse et si frappante, pendant la retraite qui précéda la fête du vingt-cinquième anniversaire de la préconisation de\nnotre si vénéré et tant aimé évêque et Père, Mgr GRANDIN.\n\nCette magnifique fête de famille, à laquelle tous étaient si heureux de prendre part, marquera dans les annales de la province et du diocèse, comme point de départ d’une rénovation dans l’esprit religieux et dans l’amour de notre vocation. Chacun de nous, en effet, se sentait heureux, en cette occasion, d’appartenir à la Congrégation ; chacun de nous était disposé à se sacrifier de plus en plus pour le service de Dieu et des âmes, en suivant l’exemple du saint évêque que nous fêtions avec tant de joie. Lorsque l’heure des séparations fut venue, les uns se rendirent sur le théâtre de leurs précédents labeurs, les autres, vers le nouveau champ assigné à leur zèle apostolique.\n\nTandis que vous-même, mon révérend Père, vous continuiez la course de votre visite, de notre côté, le R. P. ANDRÉ, le bon frère GÉRANTE et votre serviteur, nous nous acheminions vers Battleford où nous arrivions huit jours après. Deux jours de repos, passés en l’aimable compagnie du R. P. BIGONNESSE, nous permirent de reprendre plus alertes notre route vers Prince-Albert. En passant au lac Canard, je fis connaissance avec le R. P. TOUZE. Là le R. P. ANDRÉ nous quitta pour aller à la Mission du Sacré-Cœur ; cela fait, il nous rejoignit, en compagnie du R. P. TOUZE, à Saint-Laurent, d’où nous partimes pour Prince-Albert. Je fus heureux d’y rencontrer le R. P. VÉGRÉVILLE que je n’avais pas revu depuis dix-neuf ans, lors de son départ du lac Caribou.\n\nDans le court trajet de Saint-Laurent à Prince-Albert j’avais beaucoup souffert au milieu des nuages épais et continus de poussière que soulevait le trot de nos chevaux. On voulait me retenir à Prince-Albert, jusqu’au printemps, pour me remettre complètement ; je ne pus accepter cette offre gracieuse, car il me fallait, au plus\nvite, initier le P. Ancel à la connaissance du montagnais, prévenir nos sauvages de la visite de Mgr Grandin, et les y préparer; je ne pouvais donc m'arrêter. La navigation des steamboats étant impraticable, je descendis la Saskatchewan sur un petit esquif jusqu'au Fort la Corne.\n\nLà, je rencontrai des gens de Cumberland qui me proposèrent de descendre avec eux, à leur retour de Prince-Albert, où ils se rendaient. J'acceptai leur offre, congédiai mes deux hommes et attendis au Fort le retour de mes nouveaux conducteurs. Comme ce retard ne me permit d'arriver à Cumberland que la veille de la prise des glaces, je dus rester assez longtemps en compagnie de l'aimable Père Lecoq à la Mission de Saint-Joseph. La glace mit du temps à prendre, à se solidifier sur les grands lacs et dans les courants des rivières.\n\nLe 27 novembre seulement, je pus partir en traînes à chiens, ayant deux bons métis pour conducteurs. Vers midi, nous rencontrions le cher Père Bonnald qui se rendait à Cumberland. Il voulait me faire rebrousser chemin, mais je ne pus y consentir et lui promis de l'attendre à une journée de marche. Ce Père se hâta de traiter les affaires qui l'avaient amené, et, deux jours après, il nous rejoignait; puis nous gagnâmes sa résidence, où il me fallut changer de traînes et de conducteurs. Le temps que nous avons passé ensemble nous parut bien court, tant nous étions heureux de nous entretenir. Enfin, je le quittai le 5 décembre au matin, et dix jours après j'arrivai à notre chère mission.\n\nIl était temps, car les grands froids faisaient leur apparition et j'en souffrais déjà passablement; mais toutes les fatigues et toutes les souffrances du voyage furent vite oubliées, je me retrouvais avec joie au milieu de ma famille sauvage. Ces pauvres enfants se montrèrent bien heureux de mon retour. Vraiment, je n'aurais jamais supposé\nnos sauvages, d'ordinaire si froids, capables de telles démonstrations!\n\nOn n'espérait guère me revoir, tant ma santé laissait à désirer lors de mon départ pour Saint-Albert. La nouvelle de mon retour fut portée dans les camps éloignés, et comme les fêtes de Noël approchaient, bon nombre de sauvages, qui n'y seraient pas venus, se promirent de n'y pas manquer.\n\nCes fêtes furent relativement splendides; notre chapelle venait de s'enrichir de belles tapisseries, d'une superbe statue de saint Pierre, due à la générosité de nos bienfaiteurs Lavallois et d'une statue de saint Joseph. La pieuse dame de notre bourgeois nous avait offert de riches vases de fleurs et des candélabres en cristal; ajoutez à ces décorations nouvelles les accords d'un orgue-harmonium, les illuminations, les chants liturgiques et les cantiques montagnais si aimés de nos sauvages, et vous aurez une idée de cette solennité toucheante. Tous furent assidus aux offices de la nuit et du jour de Noël. Le soir, ils étaient là encore pour entendre le récit de mon voyage et des belles fêtes de Saint-Albert. Je leur annonçai la visite de Mgr Grandin, et je profitai de l'occasion pour les engager à s'y préparer par une grande fidélité à leurs devoirs de chrétiens; je leur dis combien je serais heureux en cette circonstance d'admettre un bon nombre d'entre eux à la première Communion et à la Confirmation. Tous, à leur départ, m'exprimèrent leur contentement et me promirent de revenir pour les fêtes de Pâques.\n\nIls furent fidèles au rendez-vous; dès le mercredi de la semaine sainte, ils commencèrent à arriver, et le Jeudi Saint la chapelle se trouva remplie. Les jours suivants l'affluence fut si grande qu'il fallut, pour faire de la place aux nouveaux arrivants, enlever les cloisons qui sépa-\nraient les appartements voisins de notre chapelle. La grande solennité du jour de Pâques se célébra avec toute la pompe possible et laissa une salutaire impression dans le cœur de tous les assistants. Je renouvelai mes appels pour la mission du printemps, pendant laquelle je devais les préparer à la visite de Mgr GRANDIN ; ils me promirent d’y venir, malgré les difficultés qu’ils prévoyaient de se procurer l’écorce de bouleau pour confectionner leurs canots.\n\nAu temps fixé, ces bons Montagnais tinrent parole. La bande du chef montagnais que le R. P. ANCEL accompagnait, dans le but d’apprendre la langue, arriva une des premières. Le Père avait aussi profité de son séjour parmi eux pour apprendre les prières aux enfants, la lettre du catéchisme, un certain nombre de cantiques, voire même une cantate en montagnais qui devait être chantée à la visite de Sa Grandeur. Mgr GRANDIN était venu dans notre Mission en 1867, 1870 et 1875, mais nous n’avions pu lui faire une réception convenable. Il fallait nous dédommager et payer de notre mieux notre dette d’affection et de reconnaissance à notre digne et saint évêque ; cela nous était devenu plus facile grâce aux dispositions meilleures de nos sauvages, et aussi à la générosité de nos bienfaiteurs de France et d’ici même. Notre petit Frère GUILLET s’était ingénié à nous procurer des oriflammes, des cartouches, des devises écrites en belles lettres dorées, les unes en français, en anglais, les autres en montagnais et en cris. Tout, même jusqu’à la crosse en bois doré, était préparé d’avance, de sorte qu’à la première nouvelle de l’approche de Sa Grandeur, il nous fut facile de donner un dernier coup de main aux décorations.\n\nQuand tous les Montagnais furent arrivés, je commençai les exercices de la mission ; ils furent bien suivis, malgré la disette qui se faisait sentir par suite de l’insuf-\nfiance de la pêche. Le temps s’écoulait cependant, un mois se passa dans l’attente et dans la faim ; la Mission se privait de ses ressources pour venir en aide à ses pauvres affamés : *Sed quid haec inter tantos?* Une maigreur effrayante envahissait tous les visages, on songea à la séparation pour aller aux provisions dans les lieux les plus rapprochés et revenir au premier signal donné. À la réunion du dimanche, je dis à mes sauvages que je ne pouvais les garder plus longtemps, car mon cœur saignait de les voir souffrir sans pouvoir les soulager ; je les félicitai du courage qu’ils avaient montré jusque-là. En ce moment même, on vint m’avertir que le R. P. LECOQ arrivait en canot et qu’il annonçait Monseigneur pour le lendemain. Vous pensez bien que la bonne nouvelle fut accueillie avec une grande joie. On hâta les derniers préparatifs de sa réception. Le lendemain avant midi, on signalait la barque qui portait Monseigneur.\n\nLa cloche se mit en branle ; les hommes se trouvaient sur la plate-forme, armés de leurs fusils, la procession se mit en marche en bon ordre. Les RR. PP. LECOQ et ANCEL portaient tunique et dalmatique, et votre serviteur la chappe, en sa qualité de curé. Au son de la cloche se mêlaient les décharges de mousqueterie portant à Monseigneur la première expression de notre commune allégresse. Arrivée à l’arc de triomphe, la procession s’arrêta, fit volte-face et attendit que Sa Grandeur fût débarquée. Au moment où Monseigneur mettait pied à terre, pour passer sous l’arc de triomphe où il pria quelques instants, la cantate se fit entendre. Le prélat revêtit ses insignes, bénit solennellement les enfants et l’assistance, tous agenouillés. Le digne chef catholique du poste de la Compagnie qui nous avoisine, M. d’Eschambault, adressa alors une allocution en anglais à Mme GRANDIN qui y répondit, comme d’ordinaire, par quelques paroles heu-\nreuses. À son tour, le chef montagnais lut, lui aussi, une adresse bien convenable dans laquelle, en son nom et au nom de sa tribu, il exprimait à Sa Grandeur tout le bonheur et la reconnaissance dont lui et les siens étaient pénétrés pour la bonne visite qu’Elle daignait leur faire, malgré les fatigues inséparables d’un long voyage. Il rappela la longue indifférence passée dont Monseigneur et moi nous avions eu à gémir et que la grâce de Dieu avait fait cesser, puis il termina en sollicitant Monseigneur de vouloir bien les visiter plus souvent. Sa Grandeur répondit en montagnais, en exprimant toute la joie dont son cœur était pénétré à l’annonce d’un changement si consolant, et à la vue de l’affluence et des démonstrations qui en étaient la preuve.\n\nLa procession se remit en marche ; à un moment donné j’adressai à mon tour à Sa Grandeur quelques mots en rapport avec la circonstance, puis je présentai nos notables : d’abord, le digne bourgeois de la place et sa dame qui, tous deux, avaient généreusement contribué à l’embellissement de notre chapelle ; puis l’honorable Post-Master de la place, la colonne vivante de notre résidence du lac Caribou. Je n’oubliais point le personnel catholique du Fort, ni le chef montagnais, ni la tribu tout entière dont nous n’avions qu’à nous féliciter. Monseigneur donna le salut solennel du Saint-Sacrement et adressa encore à la foule pressée dans l’enceinte sacrée, quelques bonnes paroles de remerciements et de félicitations. À la sortie de la chapelle, chacun voulut toucher la main du prélat, baiser son anneau et recevoir une bénédiction particulière, à genoux. Le lendemain eurent lieu les belles cérémonies de la première Communion et de la confirmation ; il y eut quarante premières communions et soixante confirmations. Deux de nos enfants montagnais étaient du nombre des communicants et des confirmands.\nC'était une inauguration de la mesure adoptée sur votre avis, mon révérend Père; les parents étant mieux disposés, les enfants ne pourront manquer d'être plus instruits et mieux surveillés.\n\nMonseigneur nous quitta bientôt, trop tôt au gré de nos cœurs; tout le personnel du Fort; tous les sauvages se rendirent au lieu de l'embarquement et reçurent une dernière bénédiction. Nous suivîmes du regard la barque qui emportait le bon et saint évêque, le Père tant aimé et vénéré de tous.\n\nJe finis cette trop longue lettre; puisse-t-elle ne vous avoir pas trop ennuyé! Puisse-t-elle du moins avoir atteint le double but que je m'étais proposé en vous écrivant : me rappeler à votre bon souvenir, et vous être agréable en vous mettant quelque peu au courant de notre chère Mission de Saint-Pierre.\n\nVeuillez, mon révérend Père, ne pas m'oublier dans vos bonnes prières et au saint Sacrifice.\n\nVotre très humble, très affectionné et tout dévoué serviteur et Frère en N.-S. et M.-I.,\n\nM.-J. Gasté, O. M. I.\n\n— Vicariat de Saint-Boniface. Mission de Saint-Laurent de Manitoba. — Nous sommes heureux de donner les extraits suivants de deux lettres adressées au R. P. Boisramé par le R. P. Camper, directeur de cette Mission :\n\nSaint-Laurent, 17 décembre 1884.\n\n... Il n'y a pas que les sauvages du lac Manitoba qui soupirent après le missionnaire. Dans les différentes parties de l'archidiocèse de Saint-Boniface pleurent de pauvres sauvages, sans secours, sans espoir, demandant à grands cris la robe noire. Je regrette de n'avoir pas le temps de vous en faire le dénombrement, de vous dire les distances à parcourir, les sacrifices à s'imposer, etc.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007718.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 10704, "total-output-tokens": 4336, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1671, 1], [1671, 3502, 2], [3502, 5357, 3], [5357, 7135, 4], [7135, 8998, 5], [8998, 10882, 6], [10882, 12752, 7], [12752, 14395, 8]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]