[{"id": "1b096a2dbd3b6243e042e7a0ad5b90908b8ef4bc", "text": "Condamnation, conversion et exécution du sauvage Kakisiskutchin (Jean-Baptiste), le 20 décembre 1879, au fort Saskatchewan, territoire du Nord-Ouest. — Canada.\n\nSous ce titre, le R. P. Leduc écrit un long et émouvant récit, dont nous abrégeons quelques détails trop pénibles pour le lecteur ; il s'agit d'un sauvage que la faim a porté à être le meurtrier de sa famille et que le R. P. Leduc a eu la consolation d'assister dans sa prison et d'accompagner au supplice peu de jours après son retour d'Europe à Saint-Albert. Le Missionnaire nous fait part en ces termes de ses poignantes émotions :\n\nSaint-Albert, le 29 décembre 1879...\n\n« Au mois de mai 1879, un pauvre sauvage, âgé d'environ quarante-cinq ans et connu sous le nom de Kakisiskutchin, était pris par la police du fort de Saskatchewan et conduit en prison, sur le soupçon d'avoir tué et mangé sa mère, son frère, sa femme et ses six enfants. Interrogé sur la disparition de sa famille entière, il prétendit avoir été abandonné, à la fin de février, par sa mère et son frère, dont, disait-il, il ignorait le sort depuis cette époque. Il affirma ensuite, dans un premier interrogatoire, que sa femme et ses enfants étaient morts de faim dans la forêt, à environ 80 milles de la mission de Saint-Albert.\n\nIl fut alors décidé qu'il irait, accompagné de plusieurs soldats, indiquer la place où devaient se trouver les cadavres, ou du moins les ossements des victimes. Bon gré, mal gré, il fallut obéir, et Kakisiskutchin partit sous bonne escorte. Bientôt le capitaine Gagnon s'aperçut qu'il faisait voyager ses compagnons dans un cercle vicieux, se gardant bien de les faire pénétrer au centre de la forêt. Le capitaine et ses hommes prirent alors le parti de chercher eux-mêmes dans une autre direction, tout en gardant leur\nprisonnier à vue. Bientôt ils découvrirent un campement où gisaient des ossements humains, nombreux, brisés, gisants pêle-mêle. Un crâne d'homme ou de femme, trois crânes d'enfants frappèrent péniblement leurs regards. Le prisonnier avoua que c'étaient bien là les restes de sa femme et de ses enfants. « Ils sont tous morts de faim, dit-il, et pour ne pas mourir moi-même, j'ai dû les manger. Pour preuve de ce que j'avance, afin que vous sachiez que la nécessité seule m'a poussé à cet acte barbare, vous trouverez, à un mile et demi d'ici, une fosse où j'ai enterré un de mes fils, mort de faim lui aussi ; mais celui-là est mort le premier ; je n'étais pas encore réduit à la dernière extrémité ; voilà pourquoi je ne l'ai pas mangé comme les autres. » De fait, le cadavre d'un jeune enfant de onze à douze ans fut trouvé à l'endroit indiqué par le prisonnier. Procès-verbal fut dressé de toutes les circonstances susmentionnées ; le capitaine Gagnon prit soin de faire recueillir tous les ossements épars dans le campement, et le prisonnier fut ramené au fort Saskatchewan, pour passer en jugement.\n\n« Dans un second interrogatoire, le malheureux Kakiskutchin avoua avoir tué sa femme d'un coup de feu et étranglé sa plus petite fille encore à la mamelle, pour se repaître de leur chair et assouvir ainsi la faim qui le dévorait. Le jour suivant, ses aveux furent encore plus complets : il confessa avoir tué sa femme et cinq de ses enfants, l'aîné des garçons étant mort de mort naturelle, c'est-à-dire ayant succombé aux rigueurs de la faim. Quant à sa mère et à son frère, le pauvre sauvage soutint toujours qu'ils l'avaient quitté peu avant la perpétration de son crime. Il dut alors entendre la sentence qui le condamnait à mourir par la corde, le 20 décembre suivant, sentence qui devait être préalablement ratifiée par le gouvernement d'Ottawa.\n« Peu après sa condamnation, ce malheureux Indien fut visité dans son cachot par le R. P. Rémas. Il ne tarda pas à se montrer repentant et, docile à la grâce qui lui était offerte, docile à la lumière de la foi, qui commença alors à luire à ses yeux, il accepta avec empressement l'instruction religieuse qui lui était donnée. Oh ! profondeur des mystères de la sagesse et de la miséricorde de Dieu ! Cet ignorant païen et cannibale va subir, sous l'influence de notre sainte religion, une transformation complète. Le barbare qui n'a pas craint de se repaître de la chair de sa femme et de ses enfants, ce cœur sans pitié va bientôt s'adoucir et s'ouvrir au plus sincère repentir. Bientôt il demanda le baptême et voulut embrasser, avant de mourir, cette religion d'amour, de charité, que Notre-Seigneur est venu apporter sur la terre, lorsqu'il vint appeler les pécheurs, et par conséquent tous les hommes, à la pénitence et au salut.\n\n« Ce fut sur ces entrefaites, c'est-à-dire à la fin de novembre, que Mgr Grandin et moi arrivâmes de France à Saint-Albert. Peu de jours après, nous reçûmes avis du colonel Jarvis et du capitaine Gagnon que la confirmation de la terrible sentence était arrivée d'Ottawa. Plus d'espoir de pardon pour le prisonnier : il fallait mourir le 20 décembre à dix heures du matin.\n\n« Le 18, je partis pour la prison avec Mgr Grandin, et le lendemain matin je voyais pour la première fois l'accusé dans sa cellule. Il me reçut avec un vif sentiment de plaisir et me parla tranquillement de la mort qu'il devait bientôt subir. Le R. P. Merer, résidant à Notre-Dame de Lourdes, au fort Saskatchewan, était allé régulièrement l'instruire, prier tous les jours avec lui et réciter le chapelet dans son cachot. Le R. P. Rémas l'avait baptisé sous condition deux mois auparavant. Je dis sous condition, car ce pauvre sauvage disait s'être\nautrefois fait baptiser, sans préparation aucune, sans instruction religieuse préalable, sans même trop savoir ce qu'il faisait, par un ministre méthodiste.\n\n« — Je viens, lui dis-je alors, passer avec toi les quelques jours qui te restent encore à vivre sur la terre. Je viens, au nom du bon Dieu, t'aider à bien mourir. » En quelques moments, je lui fis subir un examen religieux, pour m'assurer qu'il se rappelait bien les instructions des bons PP. Rémas et Merer ; puis de suite je le préparai à profiter de la présence de Mgr Grandin pour recevoir le sacrement de confirmation. Il fut conduit par un soldat dans un salon que le colonel Jarvis voulut bien mettre, pour la cérémonie, à notre disposition ; là il reçut des mains de Monseigneur le sacrement avec les sept dons du Saint-Esprit, qui lui étaient si nécessaires dans la terrible situation où il se trouvait.\n\n« Le lendemain 16, de bonne heure j'étais de nouveau près de lui. Le colonel m'avait donné toute liberté de voir le malheureux prisonnier et de l'entretenir seul à seul aussi souvent que je le voudrais. Ce jour-là le condamné demanda à me parler confidentiellement.\n\n« — Je veux d'abord me confesser, me dit-il, et ensuite je te raconterai en détail les meurtres que j'ai commis. Depuis que le grand prêtre (l'Evêque) m'a donné ce sacrement que j'ai reçu hier, je me sens comme grandir en moi-même; je suis plus fort, et je veux tout te raconter. » Je le confessai et lui promis de revenir le lendemain passer plusieurs heures avec lui. — Tu me raconteras, lui dis-je, tout ce que tu as eu à souffrir l'hiver dernier, sans omettre un seul détail de tes malheurs. Seulement j'ai une chose à te demander, c'est de m'autoriser devant témoins à faire connaître les circonstances et les détails des meurtres que tu as commis. — Oh ! bien volontiers, me dit-il, car je n'ai rien qu'un désir maintenant ; c'est\nde dire toute la vérité et de réparer ainsi les mensonges que j'ai faits dans mes premiers interrogatoires. » Il fit demander un métis qu'il connaissait, et, en sa présence, en présence de ses deux geôliers, il me donna l'autorisation que je lui demandais.\n\n« Un terrible soupçon pesait toujours sur lui, tout le monde pensait qu'il avait tué sa mère et son frère comme il avait tué sa femme et ses enfants, et l'on était aussi convaincu qu'il avait jusque-là célébré ce double meurtre.\n\n« Le 17 au malin, après avoir prié avec moi dans son cachot, il me fit son horrible récit : « J'ai un regret, dit-il, un grand regret ; c'est d'avoir caché la vérité dans mes premiers interrogatoires ; pourtant, cette vérité, je l'ai dite tout entière dans la déposition que je fis un dimanche ; mais je n'entrai alors dans aucun détail ; je ne regardais pas la chose comme nécessaire. Mais à toi qui ne viens pas à moi comme une homme ordinaire, à toi qui viens au nom du bon Dieu me pardonner, me consoler, m'encourager, je veux tout raconter. C'est horrible ; néanmoins, encore une fois, je te donne pleine autorisation de redire tout cela et surtout au colonel. »\n\n« Je vous épargnerai les détails de cette lugubre histoire. J'arrive immédiatement à sa conclusion. Le pauvre sauvage terminait ainsi ses confidences : « Quelques semaines plus tard, j'étais pris par la police, condamné à mort, et dans trois jours je serai pendu. Mais je ne repens sincèrement de ce que j'ai fait ; je t'en demande pardon à toi, ministre du bon Dieu. Je ne connaissais point alors la religion ; pourtant trois de mes enfants étaient baptisés. Je suis le dernier des hommes. Je ne mérite pas même d'être appelé un homme ; aussi tout le monde me méprise, mais toi tu viens, au nom du bon Dieu, me fortifier, me consoler, m'encourager ; tu pro-\nmets de rester avec moi jusqu'au dernier moment ; avec moi tu veux monter sur l'échafaud et prier jusqu'à mon dernier soupir. Je sens que tu m'aimes et que tu m'aimes pour ton Dieu. Je te remercie de tout mon cœur. Mais dis bien à tout le pays que je me repens du fond de mon âme de tous les crimes que j'ai commis. »\n\n« Je lui lus en langue crise une partie de l'histoire de la passion de notre divin Sauveur ; je lui parlai du bon larron, de la promesse qu'il reçut de Dieu même sur la croix. Il m'écoutait avec le plus vif intérêt. Je voyais l'espérance du pardon se peindre sur son visage. J'ai touché du doigt, dans cette circonstance, la puissance de la grâce agissant visiblement, sensiblement sur une nature dure et sauvage, aussi barbare que celle du pauvre condamné.\n\n« Le 18 et le 19, je fus matin et soir passer un temps considérable dans son cachot. Je l'instruisis de mon mieux du grand, de l'adorable sacrement de l'Eucharistie. Il sembla heureux à la pensée qu'il pourrait peut-être recevoir son Dieu avant de mourir. Il se confessa de nouveau avec de vifs sentiments de contrition, et je le laissai, lui promettant d'être de bonne heure le lendemain avec lui.\n\n« Le 20, accompagné du R. P. Merer et des FF. scolastiques Dauphin et Vantigen, je me rendis au fort Saskatchewan. Nous passâmes tous les quatre sous la terrible potence qui bientôt allait être l'instrument de supplice de mon pauvre pénitent. Je comprimai de mon mieux l'émotion et l'agitation que cette pensée faisait naître en moi et, quelques instants plus tard, j'entrais dans le cachot du condamné. Il me parut calme, résigné; il avait assez bien dormi pendant la nuit. « Allons, lui dis-je, du courage jusqu'au bout. C'est aujourd'hui que tu vas quitter cette terre de souffrance, de\nmisère, de peines de toute espèce. Il faut mourir, mais il faut mourir comme un chrétien. Les hommes t'ont condamné, mais le bon Dieu t'a pardonné. Dans quelques instants, tu vas le recevoir dans ton cœur, pour la première et la dernière fois ; il va venir à toi caché sous l'apparence d'un pain qui n'est plus ; dans trois heures, tu vas le voir face à face ; tu vas paraître à son tribunal... Courage ! rappelle-toi ce que je te disais hier du bon larron : confiance sans bornes dans la miséricorde du bon Dieu ! » Je récitai ensuite avec lui des actes de foi, d'espérance, de charité, de contrition, etc., actes que j'appropriai à la circonstance et qu'il répéta amoureusement avec moi.\n\n« Cependant, le P. Merer et les Frères scolastiques avaient, dans la chambre du colonel, préparé l'autel pour l'offrande du très saint sacrifice. Je confessai une dernière fois le malheureux prisonnier, qui se releva de nouveau absous et se disposa à assister, pour la première et la dernière fois, au saint sacrifice de la messe. Avant de commencer, je le revêts du scapulaire du mont Carmel. Il m'exprima le bonheur qu'il avait de porter l'habit de la sainte Vierge et me recommanda de veiller à ce qu'il fut enterré avec ce saint habit. Alors je commençai l'auguste sacrifice, que j'offris de tout mon cœur pour le pauvre condamné. Il suivit avec la plus profonde attention toutes les parties de la messe, demandant continuellement au bon Dieu, par l'entremise de Marie, la grâce de bien mourir. À la communion, je dominaï mon émotion pour lui adresser quelques paroles. Je lui expliquai de nouveau la grandeur de l'action qu'il allait faire, je lui parlai de l'amour infini de Dieu pour les hommes, et lui rappelai enfin que ce Dieu, qui venait de se donner à lui, allait, dans quelques instants, être son souverain juge, juge infiniment juste sans doute, mais en ce moment plein de\nbonté, de douceur, de miséricorde. « Du fond de ton cœur, ajoutai-je, demande encore pardon de tous les péchés de ta vie, offre ta mort, ton agonie, en union avec l'agonie et la mort de Jésus. » Puis je lui donnai la sainte Communion et j'achevai l'auguste sacrifice. Je fis alors avec lui longuement l'action de grâces, lui suggérant toujours toutes les prières qu'il avait à faire, ou plutôt improvisant avec lui des actes en rapport avec les circonstances. Il fut ensuite reconduit dans sa prison ; il était neuf heures du matin. Je le rejoignis bientôt ; je le trouvai courageux, mais bien ému, malgré les efforts qu'il faisait pour ne pas le paraître. J'obtins de l'excellent colonel Jarvis de faire déjeuner le malheureux condamné avec moi. Je le fis asseoir à mes côtés et m'efforçai de l'égayer pendant le repas qui devait être pour lui le dernier. Nous n'avions faim ni l'un ni l'autre. Il tremblait malgré lui et j'avais peine à me contenir moi-même. Bientôt je dis les grâces ; il se leva de table et me demanda la permission de fumer un peu. « C'est bien, lui dis-je ; mais le temps est court : tout en prenant cette récréation, pensons au bon Dieu, parlons du bon Dieu. » Puis, quelques instants après, il demanda à s'approcher du feu. « J'ai froid, dit-il, bien froid. » Je le fis approcher du poêle, et une fois encore, je récitai le chapelet avec lui. Ensuite on le fit changer d'habit. Je regardai à l'horloge, il était dix heures moins dix minutes. « À genoux, lui dis-je alors, je vais, au nom du bon Dieu, te donner l'indulgence plénitude in articulo mortis », et je commençai les litanies des agonisants. Tout d'un coup, il me cria d'un ton ferme : « Allons, mon père, partons ; voici qu'on vient me chercher. » En effet, le colonel, le capitaine et le shérif entrèrent dans la prison et signifièrent au condamné que l'heure était arrivée. « As-tu encore quelque chose à dire au\nPère, » demanda le colonel; et, sur sa réponse négative, il donna ordre de lui lier les bras. Le pauvre sauvage pâlit, mais de suite il présenta ses mains, en demandant pardon et en remerciant ses geôliers. « Prions, lui dis-je, et du courage, du courage jusqu’au bout. » Alors, d’un pas ferme, il se mit en marche. Je commençai une dernière fois la récitation du chapelet, et bientôt nous arrivâmes au lieu du supplice. Tous les soldats étaient sous les armes; le drapeau noir flottait sur le fort, une cinquantaine de Canadiens et de métis, avec quelques sauvages, étaient rangés autour de la potence. Je gravis, le premier, les dix ou douze degrés de l’échafaud; Jean-Baptiste Kakisikuchin monta derrière moi, en répétant à haute voix ces paroles que je lui suggérais tout haut: « — Kije Manito Wekowimisk, ayamihestamawin anotch ka wi nipiyam, Mère de Dieu, prie pour moi maintenant que je vais mourir. »\n\n« Arrivés sur la plate-forme, je le fis mettre à genoux; de nouveau il fit amende honorable à Dieu et aux hommes et reçut une suprême absolution. Alors, sans disconterner de prier avec moi, il se mit debout sur la trappe fatale, le bourreau lui passa la corde au cou et lui couvrit le visage. J’étais debout à côté du malheureux patient : « Courage, lui dis-je en détournant la tête, courage, courage, redis avec moi : Sainte Marie, Mère de Dieu... »; il n’eut pas le temps d’achever, déjà la trappe s’était ouverte sous ses pas. Je tombai à genoux en disant : « Partez, âme chrétienne, etc. » Je vis alors, un peu au-dessous de moi, son corps se balancer entre le ciel et la terre; je continuai les prières de l’agonie. Il faisait un froid de 40 degrés, et, malgré cela, on m’a dit depuis que j’étais tout en transpiration. Bientôt le docteur certifia la mort; on avait ménagé au malheureux condamné une chute d’au moins 6 pieds; la mort a dû\nêtre presque instantanée ; lorsque, au bout d'une demi-heure, le corps fut descendu du gibet, on s'aperçut que le cou était complètement cassé.\n\n« Pauvre sauvage, la justice humaine a dû le condamner ; j'ai la douce confiance qu'il a trouvé miséricorde au tribunal du bon Dieu.\n\n« H. Leduc, O. M. I. »\n\nLETTRE DU R. P. LESTANG AU R. P. AUBERT,\nASSISTANT GÉNÉRAL.\n\nFort Pitt, 30 juillet 1879.\n\nRÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nVoilà bientôt deux ans que l'obéissance m'a assigné un nouveau genre de vie et m'a nommé Missionnaire des Cris. En passant au fort Pitt, cet automne, Mgr Grandin m'a recommandé de vous envoyer un rapport de nos voyages et travaux et des quelques succès dont le bon Dieu a bien voulu bénir nos efforts et notre bonne volonté. Si je parle au pluriel, c'est que nous sommes aujourd'hui six Oblats, principalement et presque exclusivement occupés des Cris : les RR. PP. Moulin, Fafard, Bourgine, Hert, votre serviteur et le F. Letourneau.\n\nAvant de parler de la fondation des nouvelles missions crises, il est nécessaire de dire un mot de la défunte mission de Saint-Paul. Cette mission fut fondée par le P. Lacombe, après la visite du R. P. Vandenberghe en 1862 ou 1863, et a fait un bien immense parmi les Cris, qui, pendant une dizaine d'années, la fréquentaient en grand nombre. Les Pères qui s'y sont succédé ont eu beaucoup à souffrir de toutes manières, mais ils ont reçu aussi beaucoup de consolations, surtout pendant la grande", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007649.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 13840, "total-output-tokens": 5607, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1785, 1], [1785, 3642, 2], [3642, 5502, 3], [5502, 7379, 4], [7379, 9195, 5], [9195, 10963, 6], [10963, 12841, 7], [12841, 14741, 8], [14741, 16595, 9], [16595, 18049, 10]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]