[{"id": "f997d925ae679d2983001233acaae9d639bbaec2", "text": "Nota. La disette de caribous, qui règne ici depuis plusieurs années, avait retenu dans le bois la plupart des Indiens. Je ne pense pas en avoir vu plus de la moitié à la Mission dans le courant de cette année.\n\nAgréez, mon révérend Père, l’assurance de mon profond respect.\n\nX.-G. Ducot, O. M. I.\n\nVICARIAT DE SAINT-ALBERT.\n\nLES MARTYRS DU NORD-OUEST.\n\nLETTRE DE Msr GRANDIN AU PÈRE ET À LA MÈRE DU R. P. FAFARD, MARTYRISÉ AU LAC LA GRENOUILLE.\n\nVoici l’extrait de l’Etendard, numéro du 30 septembre:\n\nM. le docteur Charles Fafard, de Montréal, a eu la bonté de nous communiquer la lettre remarquable suivante, que S. Gr. Msr Grandin a adressée à M. et à Mme Fafard, de Saint-Cuthbert, père et mère du R. P. Fafard, martyrisé par les sauvages au lac La Grenouille.\n\nNous avons déjà eu occasion de dire que M. le docteur Charles Fafard était le frère du martyr du même nom.\n\nNos lecteurs nous sauront gré de leur donner cette belle lettre :\n\nSaint-Albert, 27 août 1885.\n\nÀ M. et à Mme Fafard, à Saint-Cuthbert.\n\nMonsieur et Madame,\n\nJ’ai enfin pu faire le voyage que j’avais tant à cœur, que j’avais voulu faire depuis près de quatorze mois et que, malgré ma bonne volonté, j’ai dû différer jusqu’au commencement de ce mois-ci.\n\nC’est le mercredi cinquième jour d’août que j’arrivais\nà la Mission détruite de Saint-Louis du lac d'Oignon, en compagnie des RR. PP. RÉMAS et LE GOFF. Les sauvages des réserves environnantes y étaient réunis, il ne s'y en trouvait pas un seul de la bande du trop fameux Gros-Ours. Sur cinq cents sauvages à peu près qui étaient réunis, au moins trois cents étaient chrétiens. Ils n'avaient pas espéré une nouvelle visite des prêtres, ils sentaient qu'ils méritaient d'être abandonnés parce que ceux de leur nation en avaient massacré deux qui leur étaient si dévoués et détruit deux établissements fondés avec tant de peine par les missionnaires et pillé plusieurs autres.\n\nDès qu'ils nous aperçurent, ils accoururent à nous, plusieurs en pleurant. Nous allâmes camper près du centre de notre Mission de Saint-Louis, confiée aux soins du regretté P. MARCHAND, sous la direction du non moins regretté P. FABARD.\n\nL'église, la maison, les écuries et décharges, tout était réduit en cendres, nous ne pouvions découvrir dans les décombres que quelques ferrailles brûlées des poêles, différents outils de menuiserie, le tout absolument hors de service. De la sacristie et de la bibliothèque qui, grâce à la charité de la généreuse famille du P. MARCHAND, étaient, on peut dire, richement pourvues, il ne reste absolument rien. Des chrétiens ont pu se procurer quelques lambeaux d'ornements, appartenant à une des deux Missions détruites, différents objets de piété, entre autres le rosaire de votre digne fils, que je vous conserve comme une précieuse relique.\n\nMalheureusement les soldats ont passé avant moi; les catholiques, par pitié sans doute, les autres, par curiosité ou pour d'autres motifs, ont emporté tout ce qu'ils ont pu trouver et se procurer au moyen des sauvages. Quand nous fûmes installés dans notre campement, je réunis tous les chrétiens afin de recueillir tous les détails\npossibles sur les événements du 2 avril. Tous rejetèrent la faute sur Gros-Ours et sa bande et dirent que le coup avait été monté sans qu'ils en eussent eu connaissance. Quelques-uns cependant, comprenant qu'il se tramait quelque chose d'étrange, avaient, la veille ou l'avant-veille, engagé les Pères à s'éloigner, mais ceux-ci s'y étaient refusés. Le jeudi saint, le P. Marchand se trouvait avec son confrère du lac La Grenouille, les chrétiens des deux Missions étaient à peu près tous réunis dans l'église du P. Fafard. Pendant l'office, les jeunes gens de Gros-Ours forcèrent à y entrer tous les blancs de la place, protestants et autres ; ils y entrèrent eux-mêmes en costume de guerre, c'est-à-dire à peu près nus et tatoués d'une manière étrange. Cette circonstance dut troubler les officiants et leur causer de l'inquiétude. À peine l'office terminé, tous reçurent ordre de se rendre au camp de Gros-Ours, missionnaires, sauvages, chrétiens et blancs, quels qu'ils fussent.\n\nProbablement qu'on n'obéit pas sans quelques observations. Les Pères marchaient en tête, récitant des prières ; ils se trouvaient déjà à une certaine distance des maisons lorsque l'Agent du gouvernement auprès des sauvages refusa d'obéir ; aussitôt une balle le fit tomber raide mort. Le signal était donné, presque au même moment ; à côté de cet employé, un Canadien ou métis nommé Gouin tomba mort. Delaney fut frappé, lui aussi, à peu près en même temps. Le P. Fafard pouvait, d'où il se trouvait, voir les victimes tomber ; le P. Marchand, au contraire, se trouvant dans un bas-fond, pouvait entendre les coups de fusil, mais il ne devait rien voir. Le P. Fafard courut donc au secours du mourant et s'arrêta près de Delaney qui respirait encore. Pendant qu'il lui donnait l'absolution, une balle vint le frapper lui-même au cou, le renversa, mais ne le tua pas immédiatement. Le P. Marchand\nse trouvait, comme je l’ai dit, dans un bas-fond, à peu près à trois cents pas de là. Entendant dire qu’on avait tué plusieurs blancs et que son confrère venait de tomber, au lieu de fuir, il accourut pour les secourir, mais à peine avait-il fait quelques pas qu’il reçut lui-même une balle sur le devant de la tête : sa mort fut instantanée. Il paraît que le pauvre P. FAFARD aurait recouvré ses sens et qu’il aurait essayé de se relever, un sauvage passant près de lui lui aurait dit : « Ne remue pas, mon Père, fais plutôt le mort. » Il se serait d’abord rendu à cet avis, mais quelque temps après, n’étant sans doute plus maître de lui, il aurait fait un mouvement qui fit connaître qu’il vivait encore, et un misérable sauvage chrétien déchargea sur lui son fusil à bout portant. Bien que ce sauvage, dans le but de se justifier, assure qu’il n’a achevé le Père que par pitié, sa conduite précédente fait supposer qu’il a agi dans un tout autre but.\n\nD’abord c’était un chrétien fort indifférent et nullement édifiant. Il avait voulu l’hiver dernier, suivant l’habitude des sauvages infidèles, rejeter sa femme légitime pour en prendre une autre ; le P. FAFARD, bien entendu, s’y opposa et fit même des démarches pour lui rendre impossible l’exécution de son coupable projet ; je suis donc porté à croire que la vengeance a été, beaucoup plus que la pitié, le mobile de sa coupable action.\n\nIl est aujourd’hui prisonnier à Régina, et les débats révéleront probablement bien des détails que je n’ai pas pu connaître.\n\nDe tous les sauvages réunis au lac d’Oignon, je n’ai pu en trouver un seul qui ait été véritablement témoin du massacre. Beaucoup m’ont dit : « J’ai entendu tirer des coups de fusil, j’ai vu les établissements en feu, mais je n’ai appris que par rapports qui a-tué et qui a incendié ; j’ai vu les Pères morts, mais je n’ai pas assisté au mas-\nsacre. » J. Pichar, le métis sur lequel je comptais le plus pour avoir des détails, me disait, à Battleford où j’ai pu le voir : « Pendant le massacre j’étais gardé dans ma famille ; tout en entendant les coups de fusil, je pensais qu’on allait venir m’ordonner de sortir pour me faire à moi aussi mon affaire. » On me dit qu’il y avait dans le camp une pauvre vieille sauvagesse qui avait lavé les figures de nos chers martyrs, je la fis approcher et la fis parler de manière à ce que je pusse l’entendre : « Quand j’arrivai près du cadavre, me dit-elle, ils étaient déjà froids, tous les deux avaient la figure et les mains ensanglantées, ils tenaient d’une main leur croix qui était aussi rougie de sang. Le P. Marchand avait la tête percée d’une balle et le P. Farfard, outre la blessure qu’il avait au cœur, avait sans doute une blessure ailleurs, car le sang lui coulait le long du bras ; je fus puiser de l’eau dans le marais et leur lavai la figure, les mains, et je lavai aussi leurs croix. »\n\nLa pauvre vieille sanglotait en nous racontant ces détails, les Pères et moi et peut-être quelques sauvages aussi en faisions autant. « Pendant que je les considérais ainsi, ajoutait-elle, je pensais aux douleurs que dut éprouver la très sainte Vierge lorsqu’on lui remit le corps percé de clous et ensanglanté de son Fils. »\n\nIl me semble que cette bonne vieille me communiquait cette bonne pensée pour vous surtout, chère madame Farfard : vous pouvez comparer vos douleurs à celles de la très sainte Vierge, et avec d’autant plus de raison que la victime que nous pleurons ensemble ressemble plus à la grande victime du Calvaire ; le cher martyr aussi est mort pour le salut de ses frères, pour le salut de ses bourreaux. Vous eussiez été heureuse, sans doute, de rendre à votre missionnaire ces devoirs que lui a rendus une pauvre sauvagesse, cette circonstance vous eût encore rendue plus\nsemblable à la Mère des douleurs, mais votre cœur n'y eut pu tenir et le bon Dieu vous a épargnée. Je félicitai cette bonne chrétienne de sa pieuse action, et pour lui montrer ma satisfaction, je lui donnai une belle image du Sacré-Cœur.\n\n« Mon Père, ajouta-t-elle, je ne puis plus vivre dans un pays où tant d'atrocités ont été commises; j'ai des parents dans les environs de Saint-Albert, je m'y rendrai, mes trois fils travailleront chez les blancs et me feront vivre. »\n\nJe n'en finirais pas si je vous racontais maintenant toutes les choses extraordinaires que les sauvages croient avoir vues. Ceux de la mission de Saint-Charles, du lac En-Long, prétendent avoir vu, le jeudi saint au matin, différentes croix rouges au ciel. Ayant entendu parler du projet des gens de Gros-Ours, vingt-cinq hommes armés, sous la direction du gendre du chef, se rendirent au lac La Grenouille pour défendre les missionnaires : tout était fini lorsqu'ils arrivèrent et ils virent en cela l'explication de l'apparition d'une croix dans le massacre ; ils furent contraints de se joindre à la bande de Gros-Ours. Le vendredi saint, ils disent avoir vu deux hommes vêtus de blanc s'élever au-dessus de l'église brûlée et encore fumante, ils assurent même avoir parfaitement distingué un autel dans le nuage, et même le missel comme si on allait dire la sainte Messe, et un prêtre assis à côté qui semblait se préparer à commencer. Le jour de Pâques, ils assurent encore qu'étant réunis en grand nombre sur un coteau en face de la Mission détruite, ils aperçurent un nuage extraordinaire et crurent y distinguer deux prêtres s'élevant dans les airs. Ce nuage aurait tout à coup pris la forme d'une église, et, avant d'y entrer, l'un de ces personnages qui avait une croix à la main, aurait fait un geste de la main; assez semblable à celui que fait le prêtre en bénissant. Enfin,\non dit que les criminels qui ont mis le feu ont donné pour raison l'épouvante dont ils furent saisis à la vue d'un certain tableau du Sacré-Cœur qui leur aurait paru animé et les menaçant des yeux ; en outre, on dit avoir vu le diable s'attaquant à l'Enfant-Jésus, et pour se défaire de ces visions effrayantes, les sauvages auraient mis le feu à l'église.\n\nJe suis convaincu que l'imagination est pour beaucoup, sinon pour tout, dans toutes ces visions et apparitions, bien que ces croix, que les gens du lac En-Long disent avoir vues, ne puissent guère, il me semble, être attribuées à la même cause, puisque les sauvages de cette localité ignoraient, assurent-ils, ce qui s'était passé. Tout cela prouve au moins la haute estime jointe à la vénération que les chrétiens portaient à leurs missionnaires, et les remords qu'éprouvaient les misérables qui les avaient mis à mort.\n\nLe 6 août, après la sainte Messe, nous laissions le P. Rémas avec les Cris, et le P. Legoff et moi nous nous rendîmes au lac La Grenouille. Notre première visite fut, bien entendu, pour le cimetière ; tous les deux nous priâmes et pleurâmes sur les tombes de nos frères. Le vieux père du misérable sauvage qui a donné le coup de mort au cher P. Fafard était venu du lac d'Oignon en même temps que nous ; bien qu'il n'eût point été témoin du massacre, il savait à quel endroit les victimes étaient tombées, les ayant vues plusieurs fois. Il nous conduisit d'abord à la place où le P. Fafard avait été frappé à côté de Delaney ; il se coucha lui-même dans la position du cadavre de notre frère et s'unit à nous pour prier.\n\nQuelques centaines de pas plus loin, il nous montra l'endroit où était tombé le cher P. Marchand et il se coucha aussi à la place où était son corps.\n\nCes deux places, comme tout le terrain du reste, étaient recouvertes de grandes herbes en fleur ; mais la place même où nos regrettés frères avaient versé leur sang était\nabsolument nue; on n'y découvrait pas le plus petit brin d'herbe.\n\nAprès avoir fait là différentes prières et marqué les places où ces dignes missionnaires étaient tombés, nous retournâmes au cimetière; deux ou trois familles, qui avaient eu connaissance de notre arrivée, nous y attendaient; et deux Montagnais, se trouvant là de passage, se joignirent à nous. Je revêtis les ornements pontificaux, nous chantâmes un Libera sur les tombes, puis, afin que les fidèles pussent s'unir à nous, nous récitâmes ensemble le chapelet. Pendant le chant du Libera, je pus, en m'observant, dominer mon émotion; il n'en fut pas ainsi au chapelet: l'émotion me gagna tellement que je dus le faire réciter par mon compagnon.\n\nQuand nos prières furent terminées, j'engageai les assistants à revenir le lendemain pour les messes, et nous allâmes ensuite visiter les ruines, que nous n'avions pas encore vues. Quelle désolation! cet établissement si propre, si achevé, si complet en tout, grâce, en partie, à votre charité, cher monsieur Fafard, et à l'énergie et à l'activité de votre digne fils, il n'en reste absolument plus rien que des cendres et du fer brûlé; il n'y a pas jusqu'à la cloche, suspendue à un clocher noirci attenant à l'église et que le feu avait laissé intact; elle y était encore le 8 juin; des soldats l'ont descendue, et nous avons eu beau la chercher, nous n'avons pu la trouver. Pour ce qui est du mobilier: voitures, bibliothèque, sacristie, que le cher Père avait pu mettre sur un bon pied, grâce à votre généreuse charité et à celle de ses amis, tout absolument a disparu.\n\nJ'espère que le gouvernement me tiendra compte d'une partie de ces pertes; je le lui demanderai, du moins; mais, supposons qu'il me paye exactement l'équivalent de nos pertes, ce qu'il ne fera pas, il y a quelque chose\nqu'il ne me rendra pas ; ce sont mes dévoués, et zélés missionnaires. Joignez-vous à moi, chers parents, et amis de nos martyrs, pour demander au bon Dieu de m'envoyer d'autres missionnaires, aussi dignes que possible de leurs prédécesseurs. Nos pauvres chrétiens, devenus orphelins, me demandent d'espérer beaucoup de ceux qui, jusqu'à présent ayant résisté à la grâce, semblent décidés aujourd'hui à embrasser la foi. Est-ce qu'autrefois le sang des martyrs n'était pas une semence de chrétiens ? J'espère qu'il en sera encore ainsi, si nous obtenons, par nos prières, des ouvriers comme il nous en faut et les moyens pécuniaires pour les entretenir, pour relever les établissements de leurs ruines et en fonder même de nouveaux.\n\nJe reviens à nos chers défunt. Des chrétiens, n'ayant ni le temps ni la liberté de les ensevelir, les portèrent avec respect dans le caveau de l'église, avec les corps de deux autres victimes ; mais, les malfaiteurs ayant mis le feu à l'église, les cadavres furent passablement endommagés.\n\nIl n'est pas exact, ainsi que certaines personnes l'ont rapporté, que leurs corps aient été mutilés ; les sauvages se sont permis ces traitements à l'égard des soldats, peut-être aussi de quelques employés du gouvernement, mais ils ont respecté les corps des prêtres.\n\nEn ce moment, je reçois le journal du cher P. Le Goff ; il y a longtemps qu'il me l'avait adressé, mais à cause de mes voyages continuels il n'a pu me rencontrer que maintenant. Je vais copier mot à mot les renseignements qu'il me donne, concernant les faits du lac La Grenouille.\n\nCe pauvre Père a été pendant plus d'un mois, avec ses chrétiens, prisonnier de Gros-Ours ; il parle d'une danse superstitieuse dont il a eu la douleur d'être témoin. Je lui laisse la parole :\n« Mais, Monseigneur, ce qui ajoutait encore à l'horreur de cette danse et achevait de lui donner un caractère vraiment satanique, c'étaient les profanations dont ces barbares l'ont accompagnée. Le croiriez-vous? ils ont dansé avec les soutanes de nos deux prêtres et les ornements de nos églises. Vous représentez-vous bien le bel effet que devaient faire une quinzaine de démons de cette sorte, la tête ornée de plumes et de pendeloques, le visage affreusement barbouillé, celui-ci affublé d'une soutane, celui-là le dos revêtu d'une chasuble en drap d'argent, un autre d'une chasuble en drap d'or, tel d'une chasuble en drap noir, tel autre d'une chape, etc.? Enfin toutes les soutanes de nos deux Pères et tous les ornements de leurs églises y ont passé, sauf quelques voiles et manipules que des métis du lac La Grenouille ont pu arracher à des sauvages moins pervers en les payant. Je leur aurais pardonné de bon cœur, s'ils m'avaient fait partager le sort des bons PP. FAFARD et MARCHANT. Je ne pouvais faire un pas hors de ma loge sans voir flotter, au bras ou au cou de quelqu'un, tantôt une étole, tantôt un autre ornement sacré. Pendant le long mois que j'ai passé dans cet enfer, j'ai dû presque chaque jour subir, sans mot dire, le dégoût de voir passer et repasser devant moi un jeune homme vêtu d'une aube, autrefois magnifique, maintenant souillée et coupée à la taille du sire qui la portait. Un autre sauvage avait cru bien de se tailler un capot dans une chape du P. FAFARD, un autre s'était taillé un tapis de selle dans une des plus belles chasubles. Et ce crève-cœur, je l'ai eu tous les jours de ma captivité, bien que pourtant il ait été tempéré par quelques adoucissements.\n\n« Il me fut d'abord bien doux d'apprendre que le sort de mes deux confrères, tombés sous les balles des assassins, avait touché le cœur de quelques personnes compa-\ntissantes qui n'avaient pas craint de rendre aux corps des martyrs, et cela au péril de leur vie, le devoir que leur état réclamait.\n\n« Une vieille femme nommée Malckékekway racontait en pleurant à nos Montagnais ce qu'elle avait fait, malgré le péril auquel elle s'exposait, alors que toute marque d'un intérêt donné à nos deux martyrs ne pouvait qu'exaspérer les Cris ; ce qu'elle avait fait, dis-je, me parut grand à moi.\n\n« Qu'avait-elle donc fait ? Eh bien, elle avait lavé le visage des Pp. Farand et Marchand, lorsqu'ils étaient encore étendus au lieu où ils étaient tombés. Elle remplit cet office de charité dans un état de saisissement facile à comprendre, allant et venant de l'un à l'autre, s'y prenant et s'y reprenant encore avec le respect et la tendresse d'une mère, et avec cela cherchant dans son cœur une prière pour eux et ne pouvant que pleurer.\n\n« Ce premier devoir rempli, il s'agissait de transporter les corps en un lieu où l'on put les ensevelir convenablement. Deux métis, sans calculer les dangers auxquels ils s'exposaient, mais ne consultant que leur respect et leur dévouement, voulurent s'acquitter de ce dernier devoir, et, tenant à faire les choses convenablement, ils revêtront les deux corps d'ornements sacrés et les déposèrent ainsi dans le caveau de l'église, sans les couvrir de terre. Voilà ce que firent ces grands cœurs. Vous savez le reste. »\n\nMa citation est longue, mais je crois que pour votre intérêt elle ne l'est pas trop ; si j'en avais eu connaissance plus tôt, j'aurais pu abréger mon rapport à moi et c'en eût été mieux ; maintenant finissons. Le feu, bien entendu, endommagea les cadavres et, l'église disparaissant, ils demeurèrent découverts.\n\nS'il faut en croire un journal anglais de Winnipeg, je\nne sais plus lequel des soldats leur aurait donné une première sépulture, et cela avec tout le respect et la piété possibles ; et quelques jours après, le R. P. Provost, aumônier du 65e, qui avait tant à cœur d'honorer ses frères martyrs, put satisfaire sa piété fraternelle en transportant les corps dans le cimetière de la Mission, et cela avec toutes les cérémonies de l'Eglise.\n\nLe jour même que les soldats faisaient la première sépulture, le P. Provost se trouvait à 5 ou 6 milles de là, avec les officiers et soldats du 65e.\n\nIls eurent l'excellente idée d'élever une belle grande croix à la mémoire de nos martyrs, et l'aumônier la bénit ; j'ai salué de loin ce monument de la piété des braves soldats canadiens, et ceux qui voyageront sur la Saskatchewan le feront comme moi.\n\nLe 7 août, le R. P. Le Goff et moi offrîmes le saint Sacrifice sur la tombe de nos chers martyrs, entourés des quelques chrétiens qui s'étaient unis à nous la veille ; puis nous allâmes passer quelques jours avec nos bons Montagnais.\n\nLe mardi 14 août je repassais encore, et j'enfonçai autant que possible une planche à la place même où mes chers missionnaires sont tombés, afin de la reconnaître. Le 12 au soir je renouvelais mon pèlerinage avec le bon P. Rémy qui, après avoir terminé sa mission auprès des Cris, voulut se donner la consolation de prier et de pleurer sur la tombe de ses Frères et à la place où ils étaient tombés. Cette fois, nous étions absolument seuls. Je vis cependant avec plaisir que ces tombes avaient été visitées après moi, car on avait déposé une fleur au pied des croix.\n\nMaintenant l'établissement du lac La Grenouille est absolument détruit et je doute qu'il se relève de si tôt ; les sauvages honteux et effrayés s'en tiennent éloignés, ceux\nqui y habitaient vont probablement se joindre à ceux des autres réservés.\n\nSi les circonstances me permettent de relever la Mission du lac La Grenouille, je ferai transporter dans l'église les corps de nos chers Frères ; si je ne puis la relever, je les ferai transporter dans l'église de la Mission la moins éloignée, je ferai en sorte qu'on plante plus tard au moins une croix à chacune des places où nos chers Pères sont tombés.\n\nCher monsieur et chère madame Fafard, je suis presque honteux de ma longue lettre, de tous ces détails si intimes qui n'ont pu que vous faire répandre des larmes. Je ne regrette pourtant point mes longueurs, car j'en suis sûr, ces détails, si tristes qu'ils soient, vous êtes heureux de les apprendre. J'ai si peu de regret de vous les avoir écrits que je vais immédiatement les copier presque mot à mot pour les envoyer à la famille du regretté P. Marchand ; lui et le cher P. Fafard s'aimaient comme deux frères ; ils se voyaient souvent, ainsi que leurs autres Frères des missions environnantes, ils se soutenaient mutuellement dans leurs nombreuses difficultés ; tous deux ont été en même temps victimes de leur dévouement, martyrs de la charité ; tous deux expirant l'un à côté de l'autre, la mort même n'a pu les séparer.\n\nJe regrette que la distance à laquelle les deux familles en larmes sont l'une de l'autre ne leur permette pas de se voir, de se communiquer leurs peines et de se consoler mutuellement.\n\nLa Congrégation des Oblats et le diocèse de Saint-Albert sont comme deux autres familles qui se sentent frappées avec vous, qui mêlent leurs regrets et leurs larmes aux vôtres. Si les peines nous sont communes, nous partageons aussi la gloire et l'honneur de vos chers martyrs, ne l'oublions pas ! Si les familles Fafard et Mar-\nchand ne peuvent se voir et communiquer entre elles, je m'efforcerai de leur servir d'intermédiaire ; bientôt, je l'espère, j'aurai la consolation de vous voir, et tôt ou tard, si Dieu me prête vie, je verrai aussi la famille Marchand.\n\nEn attendant, au nom de nos chers enfants, de nos chers martyrs, je vous bénis en commun et vous prie de me croire votre tout dévoué et respectueux\n\n† Vital J., Evêque de Saint-Albert, O. M. I.\n\nDans une lettre particulière, Mgr Grandin ajoute :\n« Je me suis efforcé de puiser les renseignements les plus précis ; mais je n'ai pu échapper à quelques erreurs. Je m'aperçois, par la lecture de nos Annales, que le P. Provost n'a pas transporté, comme je l'avais supposé, les corps de nos chers défunt d'une place dans une autre. Je n'ai pu voir moi-même aucun témoin oculaire du massacre... D'après ce que je lis dans certains journaux, nous ne savons pas encore quelles seront les suites et les conséquences de cette guerre, et il y a à craindre que nous ne soyons encore qu'au début. Depuis le 1er juin, je n'ai passé que quelques jours à Saint-Albert. J'aurais bien voulu adresser un rapport complètement exact à notre bien-aimé Père général ; mais je ne le puis absolument. Règle générale : Il faut se défier des rapports que l'on écrit dans le temps d'une certaine excitation ; ils se ressentent nécessairement de l'état de l'écrivain. »\n\nCalgary, 3 octobre 1885.\n\nDe son côté, le R. P. Rémas écrit à Mgr Grandin ces lignes, qui jettent quelque lumière sur le caractère de la révolte :\n\nEvêché de Saint-Albert, 25 août 1885.\n\nMonseigneur,\n\nDans le voyage important que j'ai eu l'honneur de faire", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007731.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 19376, "total-output-tokens": 7630, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1283, 1], [1283, 3119, 2], [3119, 4999, 3], [4999, 6864, 4], [6864, 8760, 5], [8760, 10623, 6], [10623, 12547, 7], [12547, 14354, 8], [14354, 16121, 9], [16121, 17985, 10], [17985, 19741, 11], [19741, 21504, 12], [21504, 23281, 13], [23281, 24916, 14]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]