[{"id": "ac7d9da0f6afaee26b4b4292d45300ba4f24557c", "text": "MISSION DE SAINT-ALBERT\n\nLe R. P. LÉGEARD a écrit jour pour jour l'historique de sa maison. Nous faisons les emprunts suivants à cet intéressant résumé, écrit sous forme de lettre.\n\nÎle à la Crosse, le 17 janvier 1875.\n\nMON RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nPour me conformer aux prescriptions du Chapitre de 1873, j'aurais dû vous envoyer au mois de septembre dernier le compte rendu de notre mission de l'île à la Crosse pour 1873-1874. N'ayant pu le faire alors parce que j'étais souffrant, je remis ce travail à cet hiver; actuellement, me trouvant plus souffrant encore et obligé de garder le lit à l'infirmérie, il m'est bien difficile de vous envoyer un rapport suivi ; je vais cependant essayer de rédiger quelques notes qui, j'espère, suffiront pour cette fois. Vous m'excuserez. Je me contenterai de vous donner en quelques lignes connaissance des faits principaux.\n\nLe 22 octobre 1873, le R. P. LEGOFF part en canot pour se rendre chez quelques familles montagnaises, à une quinzaine de lieues d'ici, à l'autre bout du lac. Le 12 novembre, le P. DOUCET part pour aller voir des malades au lac Canot, il est de retour le 17. — Nous recevons la visite de bien peu de durée du R. ministre Bompas, arrivant du fond de la rivière M'Kenzie et se rendant à la\nRivière-Rouge pour se faire sacrer Evêque. Le R. P. Legoff arrive de son voyage chez les Montagnais. — Le 24 novembre, le P. Doucet part de nouveau pour aller donner la mission aux Cris du lac Canot. Un certain nombre de familles crises, insidieuses et endurcies dans leur insidélité, se trouvant à quelques journées du lac Canot, je recommande au P. Doucet d'aller les voir afin d'essayer de les attirer à notre sainte religion. Le 10 décembre, il part du lac Canot ; le 12 au soir, il arrive au lac Poule-d'Eau, où restent ces familles. Malheureusement la plupart sont absentes. — Ces sauvages sont tellement voleurs, que le Père ne doit pas perdre un seul instant de vue ses vivres et son petit bagage ; tour à tour, lui et le sauvage baptisé qui l'a accompagné sont obligés de veiller pour que rien ne disparaisse. Ne trouvant presque rien à faire dans cette place et ayant été averti qu'à une journée de marche de là un sauvage insidieux est bien malade et qu'il désire le voir pour se faire baptiser, le Père part le 14 décembre et arrive le 15. La première nouvelle qu'il apprend, c'est que son malade est remis et qu'il est parti pour la chasse. Pareille aventure nous arrive quelquefois. On vient de bien loin chercher un Père pour aller voir un malade ; quand, après bien des fatigues, il arrive enfin, le malade est souvent guéri et mieux portant que celui qui vient le visiter. Heureusement que le bon Dieu a compté tous nos pas. Le 16, le P. Doucet repartait ; le même jour il repassait par le lac Poule-d'Eau ; passait deux jours avec ses sauvages, dont quelques-uns lui ont promis de se faire instruire ; il repartait le 18 et arrivait le 20 au lac Banot, bien fatigué de ce voyage, dont les résultats avaient été nuls en apparence ; j'espère cependant que tout n'aura pas été inutile, parce qu'avec le temps quelques-uns de ces sauvages se rapprocheront\npeu à peu, de notre sainte religion. Le 26, le P. Legoff partait pour aller voir un malade à quelques journées de marche. Rendu à moitié chemin, il apprenait que son malade n'était plus malade et il revenait sur ses pas. Le 29, le R. P. Doucet nous arrivait du lac Canot. Tout le mois de janvier nous sommes restés à la maison, à l'exception du P. Legoff qui a encore été obligé de faire un petit voyage de quatre à cinq jours pour aller voir un malade. — Le 10 février nous commencions notre retraite annuelle. — Au commencement d'avril, je me voyais arrêté par un mal de jambes qui me forçait à gagner l'infirmerie, et qui m'a privé pendant tout le mois de dire la sainte messe, le saint jour de Pâques excepté. — Quelque temps avant Pâques, le Père chargé des Cris avait l'habitude d'aller passer une quinzaine de jours au lac Canot, mission de la B. Marguerite-Marie, pour y préparer les Cris à la fête de Pâques ; cette année, ces sauvages, n'ayant presque rien à manger, ne sont venus chercher le Père que le mercredi saint ; tous ensemble repartaient dans la nuit du mercredi au jeudi saint. Le lundi de Pâques, notre cher Père était de retour. Le même jour le R. P. Legoff partait avec quelques Montagnais pour se rendre au lac Froid à cinq ou six jours de distance. Cette place, visitée autrefois par nos Pères à différentes reprises, était bien abandonnée depuis quelque temps ; des désordres s'étaient introduits dans quelques familles montagnaises qui, craignant les reproches du prêtre, ne venaient plus à la mission. C'était pour porter remède à ces désordres surtout que notre cher Père entreprenait ce voyage à l'une des époques les plus désagréables de l'année, à l'époque des dégels. Le 24 avril, il était de retour au milieu de nous, harassé de fatigue, ce qui ne l'empêchait pas de repartir le lendemain pour un voyage de sept jours afin\nd'aller voir un malade qui réclamait les secours de son ministère. Tous ces voyages commencent à altérer, d'une manière bien sensible, la santé de ce Père, mais rien ne l'arrête, et quand on le demande il est toujours prêt. Le 4 mai, il nous quittait de nouveau pour se rendre à une journée de distance au milieu de ces familles montagnaises établies à l'autre bout du lac et qu'il visite régulièrement deux fois par an, surtout afin de s'instruire de plus en plus de la langue montagnaise. Nous n'avons été débarrassés complètement de la glace cette année que le 23 mai. Le 26, le R. P. Legoff nous arrivait de l'autre bout du lac.\n\nLe 27, nous commencions un ouvrage qui se voit bien rarement dans le pays ; nous mettions le feu à un four à chaux construit par le F. Bowes afin d'avoir la chaux nécessaire pour crépir notre maison neuve. En France il est facile d'avoir de la chaux, ici elle nous coûte cher. Depuis longtemps nous ramassions une à une sur les bords du lac et dans les champs les roches à chaux que nous trouvions isolées ça et là. C'est comme cela seulement que nous avons pu à la longue trouver assez de pierres pour faire un petit fourneau qui a chauffé pendant sept jours. J'avais fait annoncer aux Cris du lac Vert et du lac Poule-d'Eau que désormais un Père irait tous les ans au printemps et à l'automne au fort du lac Vert, alors qu'ils s'y rendent pour la traite de leurs fourrures. Me trouvant malade ce printemps et dans l'impossibilité de donner moi-même les exercices de la mission aux Cris de l'île à la Grosse, j'ai eu la douleur de ne pouvoir envoyer le P. Doucet au lac Vert. La mission du printemps terminée ici, le R. P. Legoff partait en berge pour aller, selon sa coutume, visiter les Montagnais du grand portage la Loche. Pendant son séjour, le Père a pris possession d'une fort belle place destinée à bâtir la mission,\nquand on le pourra; l'acte de prise de possession a été signé par deux officiers de l'honorable Compagnie de la baie d'Hudson et par bon nombre de sauvages. Il y aurait là une belle mission à faire, d'autant plus que presque tous les Montagnais qui y résident se sont bâti de jolies maisons nettes et ont tous un petit champ de pommes de terre; malheureusement ils ne se montrent pas pressés à aider le Missionnaire. On leur avait fait dire, le printemps précédent, de bâtir une maison un peu grande pour le Père afin qu'il ne fut point obligé de leur donner dans la tente les exercices de la mission, ils s'en sont excusés sous de futilles prétextes et la chose en est encore là, ce qui m'a fort mécontenté, car avec un peu de bonne volonté la chose leur était facile. Le 6 juillet, nous recevions des lettres de Monseigneur nous annonçant qu'il lui était impossible de passer par ici avant de se rendre à Saint-Albert. Je formai immédiatement le projet d'aller rencontrer Monseigneur à Carlton, à une centaine de lieues d'ici, comme on m'en avait donné la permission; l'état de ma santé ne me l'ayant pas permis, j'envoyai à ma place le P. Doucet et le F. Nemoz; j'écrivis en même temps à Monseigneur pour lui exposer dans quel état je me trouvais et le prier de nommer un autre supérieur à ma place. Le 13, les deux voyageurs partaient; je me trouvais alors seul à la mission pendant trois semaines, disant une messe basse le dimanche matin, parce qu'il m'était impossible de chanter la grand'messe. Le 6 août, nous avions la consolation de voir débarquer à la mission le R. P. Legoff et le R. P. Grouard; ce dernier en route pour la France, où on l'envoyait rétablir sa santé; comme c'était un de mes anciens condisciples du petit séminaire, nous passâmes ensemble d'heureux moments en parlant du pays et de nos anciens maîtres et condisciples. Le 8, l'arrivée de l'Évêque anglican, qui passait par l'île à la Crosse pour se rendre\nà la rivière Mackenzie, vint troubler notre joie. Pauvre P. Grouard, comme il avait mal au cœur en voyant ces ministres de l'erreur gagner les missions qu'il était obligé d'abandonner pour cause de santé ! Le 9, le R. P. Grouard nous quittait ; le 10, nous bénissions notre maison neuve et y installions nos bonnes Sœurs. Ce jour-là nous avons remercié bien sincèrement le bon Dieu en voyant enfin terminée cette construction qui nous a tant coûté. Au jugement de tous, c'est une des plus belles maisons du Nord ; pauvre cher F. Bowes, lui aussi était heureux d'être enfin débarrassé de ce travail. Maintenant les sœurs sont bien installées, et depuis que nous occupons la maison qu'elles habitaient précédemment, nous sommes beaucoup mieux. Huit jours après, le R. P. Moulin nous arrivait avec tous nos effets. Monseigneur avait exaucé ma demande, il l'envoyait prendre ma place. Le R. P. Doucet était resté à Carlton, en route pour Saint-Albert ; notre vieux F. Bowes recevait en même temps son obéissance pour se rendre à la même place ; le 22, il nous quittait le cœur bien triste. Pour combler ces vides, le P. Moulin nous amenait un Frère canadien destiné à passer l'hiver à l'île à la Crosse pour de là se rendre le printemps prochain au lac Caribou, et un juniorisé de Notre-Dame de Sion, M. Dauphin, qui devait remplacer le P. Doucet dans la surveillance de nos petits enfants de l'école tout en continuant ses études. Quant à moi, j'ai reçu pour obéissance de me guérir et de me reposer cet hiver. — Voici donc actuellement comment se compose notre personnel : R. P. Moulin, supérieur ; R.R. PP. Légeard, Legoff ; FF. Nemoz, Grezaud, Labelle et Dauphin.\n\nNotre école continue à prospérer ; nous avons eu toute l'année plus de trente pensionnaires : on enseigne depuis la rentrée des classes 1873 l'anglais et le français. Pendant l'hiver 1873-1874 nos enfants nous ont donné bien de la\npeine; depuis, un grand changement s’est opéré. Depuis que les sœurs occupent leur maison neuve, notre ancienne maison, qui en est toute proche, sert d’école. Notre école porte maintenant le titre d’École de Notre-Dame du Sacré-Cœur. — Pendant cet hiver 1873-1874 nous avons essayé de faire fonctionner une petite école crise. C’est une veuve de cette nation qui fait la classe; les résultats n’ont pas été bien grands jusqu’à présent, cependant j’en suis bien content et la maîtresse se montre toute dévouée à son œuvre.\n\nComme en 1873, nous avons eu beaucoup à souffrir en 1874 à cause des mauvais temps continuels; le lac a encore monté; presque toutes nos clôtures sur le bord du lac ont été emportées. Nos récoltes ont été presque nulles; c’est une vraie calamité pour le pays. Dieu veuille que cette année 1875 les choses se passent autrement!\n\nA l’exception de celui qui vous écrit, tous nos Pères et Frères se portent assez bien, quoique personne cependant ne soit bien vigoureux.\n\nJe termine ce rapport assez long, mais bien peu suivi, en vous priant d’agréer mes souhaits de bonne année. Veuillez, mon révérend et bien-aimé Père, prier et faire prier beaucoup pour votre ancien petit frère LÉGEARD. — Depuis les quelques jours que je suis condamné au repos absolu à l’infirmerie, un mieux sensible s’est déjà produit; mes jambes semblent vouloir se guérir. On me fait espérer que, cette maladie une fois passée, je me porterai beaucoup mieux qu’auparavant. Puisse-t-il en être ainsi!\n\nJe suis toujours heureux, mon révérend Père, de me dire comme autrefois votre enfant en Notre-Seigneur et Marie Immaculée.\n\nP. LÉGEARD, O. M. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007574.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 7, "total-input-tokens": 9688, "total-output-tokens": 3795, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1259, 1], [1259, 3129, 2], [3129, 4987, 3], [4987, 6847, 4], [6847, 8783, 5], [8783, 10679, 6], [10679, 12318, 7]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false]}}]