[{"id": "33328c89181dbddb7aad8c8eab1fff2970cfbdae", "text": "progrès ; cela ne va pas vite, mais avec le temps tout s'organisera. J'ai remarqué, il y a quelques jours, qu'on ne distinguait pas assez l'église des autres édifices ; aussitôt j'ai fait faire une grande croix et maintenant le signe de notre salut se dresse sur l'église et indique la maison de Dieu à nos chrétiens.\n\nLes lignes suivantes sont extraites d'une lettre du F. Némoz et datées du lac Chitec, mission du Sacré-Coeur, le 12 janvier de cette année :\n\nJe suis seul ici pour vingt-cinq jours. Le R. P. Bonnald est parti pour la mission Saint-Pierre, au lac Caribou, le 26 décembre dernier. La santé de ce cher Père n'est pas des plus brillantes et quoique jeune encore, il a déjà l'air vieux. Le 30 décembre il a dû se trouver à l'entrée du grand lac Caribou, et justement ce jour-là les grands froids ont commencé à se faire sentir et durent encore. Je crains bien qu'il ne se soit gelé le visage et si cela n'est pas, comme je le désire, je suis convaincu qu'il aura eu besoin de se donner beaucoup de mouvement pour n'avoir pas trop à souffrir. Il voyage avec les gens de la compagnie de la Baie d'Hudson, qui sont allés porter un express au bourgeois en charge de ce poste. Un des meilleurs marcheurs du district se trouve avec eux, les fortes journées qu'il fait sont quelque chose d'extraordinaire. Le P. Bonnald est accompagné du sauvage qui lui sert d'engagé ici pour l'hiver, mais il est loin d'être habile voyageur. Nos chiens ne sont pas non plus de forts marcheurs.\n\nDéjà le 11 décembre précédent le R. P. Bonnald m'avait laissé seul pendant dix jours pour se rendre à la mission Saint-Joseph. Une nuit, pendant son absence, je m'éveillai en sursaut, suffoqué par la fumée. Je couchais sur quelques planches que j'avais posées sur trois so-\nlives à hauteur d'homme. Je fus vite à bas, et me précipitant dehors, j'aperçus la fumée qui sortait à travers le toit de la maison. Le feu avait pris derrière la cheminée, dans les pièces de bois qui forment le mur de la maison. Je compris le danger qui me menaçait et je craignis de ne pouvoir réussir à éteindre seul ce commencement d'incendie. Avant de me mettre à enlever la couverture je volai vers le petit poste de la compagnie qui se trouve à quelques centaines de mètres de la maison. Je criai : Au feu ! Aussitôt tout le monde fut debout. Deux jeunes gens arrivèrent promptement à demi vêtus, mais déjà la couverture était défoncée et l'eau fut versée en abondance. Nous nous rendîmes maîtres du feu et il n'y eut d'autre accident que de légères dégradations à la maison et une fière peur pour moi. Depuis ce temps-là, je m'éveille souvent la nuit en rêvant au feu.\n\nNotre résidence actuelle n'est qu'une pauvre baraque qui fut bâtie à la hâte, il y a trois ans, par le F. Guillet et un sauvage. Tout a été fait à coups de hache. Elle a 14 pieds carrés. Le jour y pénètre par trois châssis, dont un a six petites vitres. Le second était fermé au moyen d'un parchemin tout troué ; j'ai dû le boucher avec une planche. Quant au troisième, le R. P. Bonnald n'avait trouvé rien de mieux à y mettre qu'un vieux linge. Hier soir les chiens l'ont réduit en lambeaux ; demain je devrai encore le remplacer par une planche. C'est pourtant dans cette pauvre mesure que le Dieu trois fois saint daigne résider chaque jour quand le R. P. Bonnald est ici. J'ai hâte d'achever la maison neuve à laquelle je travaille, parce qu'au moins elle aura une chapelle convenable...\n\nLe 15 août dernier je m'embarquai en canot et je me rendis à la mission Saint-Pierre (lac Caribou). Plusieurs fois le R. P. Gasté m'avait prié d'aller le voir. Le F. La-\nBELLE m'accompagnait, se rendant à sa mission. Pour traverser l'immense lac, nous primes passage sur une des berges de la Compagnie. Le vent gonfla les voiles et les trois berges furent secouées par des vagues épouvantables qui ne nous engloutirent pas, mais nous causèrent beaucoup de frayeur. Nous arrivâmes le 25 août. Le R. P. Gasté et le F. Guillet, qui semblait vouloir m'étouffer en m'embrassant, vinrent nous recevoir sur le bord du lac. Le R. P. Gasté se fait vieux et le F. Guillet est presque chauve. Les fatigues et les privations de tous genres se trouvent là plus qu'ailleurs.\n\nUne chose me fit de la peine à la mission : ce fut de voir une église, belle à la vérité, mais qui penche beaucoup, je crains qu'elle ne tombe et ne cause quelque malheur. J'espère pouvoir aller passer quelque temps à cette mission, durant l'été prochain, pour essayer de porter remède à la chose. En attendant, je prie Dieu que rien de fâcheux n'arrive. Le temps me manque pour vous donner des détails plus étendus sur ce voyage...\n\nVoici quelques extraits d'une lettre du R. P. Fourmond, écrite de la mission Saint-Laurent (Carlton), et datée du 27 décembre 1878.\n\n... Pour vous donner une idée exacte de ma vie de Missionnaire, je vais vous raconter comment j'ai passé ces trois dernières journées.\n\nLe 24 décembre, vigile de la grande fête de Noël, après la prière du matin, la méditation et la sainte Messe, prévoyant de nombreuses confessions pour la journée, je récite de suite mes petites heures et le chapelet. Dans la matinée j'entends environ vingt-cinq confessions, et je profite des temps libres pour faire mon office de prêtre sacristain et décorer ma chapelle. Je dine à midi, et aussitôt après je veux continuer mes travaux d'orne-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007634.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1642, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1761, 1], [1761, 3602, 2], [3602, 5341, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]