[{"id": "66285551697cac88d8f279f72c8b6294164c3dd3", "text": "vincial du Midi. Je me séparai là de mes deux compa-\ngnons de voyage, et je continuai seul ma route. Qua-\nrante heures après mon départ de Rome, et après cinq\nsemaines d'absence, je réintégrais domicile à la rue de\nSaint-Pétersbourg. Ma mission était finie.\n\nAgréez, avec ce simple récit, mon très Révérend Père,\nl'hommage reconnaissant de mon religieux et filial\nrespect en Notre Seigneur et Marie Immaculée.\n\nM. DE L'HERMITE, O. M. I.\n\nSERVICE FUNÈBRE CÉLÉBRÉ À CHATEAUGIRON, LE 11 AOUT 1885,\nEN MÉMOIRE DU R. P. FÉLIX MARCHAND, OBLAT DE MARIE,\nMASSACRÉ LE 2 AVRIL 1883 AU LAC LA GRENOUILLE (CANADA).\n\nLe P. Marchand naquit à Châteaugiron au mois de mars 1858.\nSon éducation, commencée au foyer de la famille sous l’œil\nde parents chrétiens, fit naître en son âme avec la piété tendre\net naïve de l’enfance ces premiers éclats d’un cœur que Dieu\nappelle spécialement à lui pour en faire un de ses ministres.\nL’institution Saint-Martin, qui a fourni tant de saints prêtres\nau diocèse de Rennes et tant de zélés missionnaires à l’Église,\nfut choisi par la famille du jeune Félix pour développer ces\npremiers germes de vocation sacerdotale. À Rennes, comme à\nChâteaugiron, Félix Marchand sut, par l’aménité de son carac-\ntère, la franchise et la simplicité de ses rapports, sa gaieté\ndouce et son bon esprit, se concilier l’estime et l’affection de ses\nmaîtres et de ses condisciples. Dans cette atmosphère de piété et\nde travail, sa vocation ne fit que s’affermir, et, à la fin de sa rhé-\ntorique, en 1878, Félix entrait au Grand Séminaire de Rennes.\nDeux années s’y écoulent : mais la vie austère du séminariste\nne lui suffit plus ; à son cœur d’apôtre, brûlant de se dévouer\nau salut des âmes et désireux de la perfection, il faut la vie\nreligieuse. La persécution commençait alors à gronder sur la\nFrance ; les décrets contre les congrégations étaient parus de-\npuis quelques mois ; quelques semaines encore, et la force\nbrutale devait disperser au loin les membres des familles religieuses. Le moment était critique, mais Dieu parle : Félix Marchand fait taire toute considération humaine et va frapper à la porte du noviciat des Oblats de Marie, à Nancy. C'était en octobre 1880 ; dès le mois de novembre la persécution le forçait d'aller avec ses nouveaux frères demander à la Hollande une liberté qu'on lui refusait dans sa patrie : celle de se préparer par la prière et le travail à cette vie de dévouement qu'il devait couronner par le martyre. Après y avoir séjourné dix-huit mois, il fut désigné par ses supérieurs pour se rendre dans l'Amérique du Nord : il n'était que tonsuré. Après avoir embrassé une dernière fois un père et une mère qu'il laissait dans les larmes, et avoir dit un dernier adieu à ses frères et à ses sœurs, il partit pour le collège d'Ottawa, où il devait se familiariser avec le climat rigoureux de ces contrées. En septembre 1882, il se rendait à Saint-Albert, et, le 8 décembre, il avait le bonheur d'y faire sa consécration religieuse : peu après il quittait cette résidence et faisait route pour le lac Sainte-Anne. Dans le trajet, il connut par expérience les souffrances et les privations de la vie de missionnaire et faillit même ne pas arriver au terme de son voyage, ayant été pendant trois jours privé de nourriture. Le 9 septembre 1883, il était promu aux ordres mineurs ; le 22 du même mois, il recevait le sous-diaconat et le diaconat, et le lendemain il était ordonné prêtre par Mgr Grandin. Le 24, il avait le bonheur de monter à l'autel pour la première fois, et ce jour même, son Évêque l'envoyait au lac d'Oignon fonder une mission chez les Cris. Tout était à faire, résidence et chapelle. En attendant que les constructions fussent terminées, le P. Marchand devait rester au lac La Grenouille, situé à 10 ou 12 milles du lac d'Oignon et s'initier, auprès du R. P. Farand, aux éléments de la langue crise. Les négociations avec les chefs sauvages trainèrent en longueur, et ce fut seulement le 28 octobre 1884 qu'il put s'installer au lac d'Oignon, au milieu des sauvages qui lui étaient confiés : il devait en même temps servir d'aumônier à la garnison du fort Pitt, situé à quelques lieues.\nLe P. MARCHAND se mit à l'œuvre avec courage et entrain; mais l'insurrection de Riel devait venir anéantir ses premiers travaux. Que s'est-il passé depuis le 14 mars, date de sa dernière lettre? On l'ignore : on sait seulement que le jeudi ou le vendredi saint il était massacré au lac La Grenouille ainsi que son confrère, le P. FAFARD.\n\nTelle a été la vie du jeune martyr, dont la paroisse de Châteaugiron voulait honorer la mémoire, avec tout l'éclat et la solennité dont elle était capable. Aussi, le 11 août, une foule nombreuse et recueillie se pressait dans son église devenue trop petite, tandis que plus de quatre-vingts prêtres formant une double couronne autour de l'autel remplissaient le sanctuaire : MM. Maillé, chanoine; Durand, curé de Saint-Aubin de Rennes; Tupin, professeur au Grand Séminaire de Rennes; le R. P. SOULLIER, assistant général des Oblats de Marie; le R. P. CHEVREL, supérieur de l'Institution Saint-Martin; le R. P. GAHIER, supérieur de l'Institution Saint-Sauveur de Redon, etc., etc. Le long des murs courent de larges tentures noires et au milieu de la vaste nef se dresse un immense catafalque. Pendant que les cloches lancent au loin leur tintement funèbre, le chœur commence le chant des Matines, où l'exécution large et correcte des Psaumes dénote un travail tout spécial de la psalmodie. Les Matines finissent, les voix se taisent : c'est aux instruments de venir apporter leur tribut à cette cérémonie tout à la fois funèbre et triomphale. L'excellente musique la Concorde remplit l'église de ses accords pénétrants, et la sûreté ainsi que le fini de son exécution expliquent les nombreuses palmes et médailles qui décorent sa bannière, maintenant voilée d'un crêpe de deuil.\n\nLe saint Sacrifice commence : il est célébré par M. Grandin, chanoine de Laval et frère de Mgr GRANDIN, évêque du diocèse de Saint-Albert (Canada); deux condisciples du P. MARCHAND remplissent les fonctions de diacre et de sous-diacre. L'ampleur et la majesté des cérémonies font l'étonnement et l'admiration des nombreux étrangers accourus pour honorer le jeune martyr, tandis que le chœur exécute les chants liturgiques en faux-bourdon, que le violoncelle soupire ses mé-\nlancoliques mélodies et que des solos, interprétés avec goût et heureusement entremêlés, donnent à cette cérémonie un éclat digne du jeune missionnaire tombé victime de son désir de sauver les âmes.\n\nMgr l’Archevêque de Rennes, par une autorisation toute spéciale, avait permis de faire l’éloge funèbre du martyr. Cet honneur revenait de droit au R. P. Soullier, Assistant général, qui avait connu le P. Marchand au Canada : il le fit avec le cœur d’un père brisé par la mort de son enfant, mais heureux de la grandeur et de l’héroïsme de sa mort. — Rien ne manquait à cette cérémonie, qui laissera de profonds souvenirs à tous ceux qui y ont assisté.\n\nHeureux sont les martyrs. — Heureuses les familles dans lesquelles Dieu les choisit. — Heureuses les paroisses qui les ont vus naître et qui savent les honorer dignement. — Heureux celui qui voit dans leur mort héroïque un stimulant à combattre le bon combat et à tout sacrifier pour l’accomplissement du devoir.\n\nUn condisciple du P. Marchand.\n\n(Semaine religieuse de Rennes, du 29 août 1885.)\n\nPour compléter cet article, il convient de mentionner la part que prit à la belle cérémonie de Châteaugiron le R. P. Marais, notre excellent supérieur de Saint-Andelain. Il fut l’un des quatre prêtres placés en étole aux quatre coins du splendide catafalque. Autour de ce catafalque, le clergé de Châteaugiron, qui, dans l’organisation de la fête, a fait preuve du goût le plus exquis, avait aussi rangé six petits enfants en tunique blanche, ayant sur la tête une couronne de roses blanches et à la main une palme, fidèle et gracieux symbole de l’idée du martyr qui était dans l’esprit de tous les assistants et donnait à la cérémonie son véritable caractère.\n\nLe prédicateur, pour justifier cette qualification de martyr attribuée par la voix publique à notre cher P. Félix", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007734.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5536, "total-output-tokens": 2590, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1924, 1], [1924, 4146, 2], [4146, 6339, 3], [6339, 8163, 4]], "primary_language": ["fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]