[{"id": "4dba5aa4cecd3b89989408690583564b780dc35e", "text": "ger sur nos projets d'établissement pour nos missions dans ce district. Le R. P. Paquette va, lui aussi, se rendre ici avec le F. Némoz, qui arrive de l'île à la Crosse. Je laisserai ici le F. Labelle pour aider le F. Némoz. M. Bélanger, premier officier du district, nous sera d'une grande utilité pour notre établissement. On va se hâter de profiter de ses bons offices. Je suis arrivé ici avant-hier et je repars demain avec les berges.\n\nVous voudrez bien excuser, mon très-révérond Père, l'incorrection de ma lettre. Je l'avais commencée au lac Pélican et je la termine ici au fort Cumberland, au milieu du tapage.\n\nLaissez-moi recommander à votre charité paternelle les besoins de ma pauvre âme ; daignez me donner votre meilleure bénédiction. Je me sens toujours pour votre Paternité les sentiments et l'affection d'un enfant reconnaissant de toutes vos bontés et plein de respect filial.\n\nBonnald, O. M. I.\n\nEXTRAIT D'UNE LETTRE DU R. P. MOULIN.\n\nMission Saint-Pierre du lac Caribou, le 6 février 1877.\n\n...Nous allons tous bien pour le moment et nous continuons à travailler, chacun selon sa spécialité, à l'œuvre qui nous est confiée. Longtemps avant nos belles fêtes de Pâques de l'année dernière, le R. P. Bonnald était parti pour la mission du Sacré-Coeur au lac Pélican, afin d'y voir les sauvages Cris et de les initier à la connaissance de la religion. Ce cher Père les trouva généralement bien disposés et goûta parmi eux beaucoup de consolations. Vous vous rappelez sans doute, mon très-\nrévérend Père, que nous avons entrepris cette mission il y a deux ans seulement. Mon cher compagnon doit s'y rendre de nouveau, sur les dernières glaces, pour y continuer l'instruction des sauvages et présider à la construction d'une maison de 36 pieds de long sur 20 à 25 de large, destinée à servir de chapelle provisoire. Il aura à sa disposition pour ce travail nos deux chers Frères du lac Caribou, peut-être aussi le bon F. Némos, de l'île à la Crosse, ainsi qu'un sauvage Montagnais d'ici.\n\nLe R. P. Bonnald, après avoir terminé la mission des Cris, rentrait avec nos berges au commencement d'août. Un mois et demi après son retour, je partis moi-même en canot pour me rendre aux terres de nos Mangeurs de Caribous, qui se trouvaient réunis, et dont le chef me faisait appeler pour continuer leur instruction. J'acceptai d'autant plus volontiers que l'absence de nos sauvages, ce printemps, les avait privés du bienfait de la mission. Je m'embarquai avec trois jeunes gens qui étaient venus traiter au fort de la compagnie qui nous avoisine. Je ne vous raconterai pas en détail les difficultés du voyage; elles sont toujours de même nature et le récit vous en a été fait bien souvent. Huit jours suffirent pour nous rendre au terme du voyage. Bien que les sauvages ne fussent pas encore tous réunis, il y avait cependant déjà un camp d'une vingtaine de loges. Avant mon arrivée, deux sortes de désordres régnaient dans ce camp : l'impureté et la passion du jeu. Je tonnai avec force contre le premier et le fis bientôt disparaître. Quant au jeu, qui était devenu une habitude généralement répandue et auquel on ne voyait pas de mal, si ce n'est dans l'abus qu'en faisaient quelques-uns, ce fut plus difficile ; je parvins cependant à en diminuer la fréquence et à obtenir qu'on ne négligerait pas les instructions pour ce motif. Ces deux abus à déraceriner me donnèrent\nbien du souci pendant mon séjour parmi ces sauvages. À part cela, je fus content de leur fidélité à suivre les exercices. Ce qui me consola le plus, ce fut l'ardeur que mirent les enfants à se faire instruire des prières et du catéchisme.\n\nJe logeais chez un de nos vieux sauvages catholiques. Encore que ce local ne présentât pas toutes les commodités désirables, je pus y célébrer chaque jour la sainte Messe et entendre les confessions. J'eus le bonheur d'y admettre à la première communion un vieillard et une vieille sauvagesse, malades depuis longtemps, et qui semblaient n'attendre que cette grâce pour partir pour leur éternité. J'y fis aussi deux mariages. Je trouvai le nombre des confessions trop restreint pour la population ; je devais, il est vrai, tenir compte de la difficulté du local ; mais il était évident pour moi que mes sauvages, bien qu'ils voulussent tous de la prière, n'en désiraient cependant prendre que le moins possible. Je crus bon de frapper un grand coup avant mon départ, afin de réveiller leur zèle. Je menaçai nos Mangeurs de caribous d'écrire à Monseigneur pour le prier de nous retirer de cette mission, s'ils ne voulaient pas me promettre d'être plus dociles à la parole de Dieu et d'observer plus exactement les ordonnances de notre sainte Religion. Je montrai même une lettre que je venais de recevoir du R. P. Bonnal, et dans laquelle ce cher Père me signalait ce moyen d'agir sur eux. Le coup produisit son effet ; on crut à une résolution déjà arrêtée et on en fut atterré. Le chef prit alors la parole en me priant de surseoir à cette détermination. « Dès que je serai arrivé au Fort, me dit-il, je verrai l'autre Père, et, s'il n'a pas encore écrit, je le prierai de n'en rien faire ; je lui dirai, comme je te le dis à toi-même, de patienter encore un peu, et vous verrez tous deux que nous finirons par vous rendre plus\ncontents. Mais enfin, à part les folies de jeunes gens, que nous déplorons comme vous, mais que nous ne pouvons pas empêcher, parce que la plupart d'entre eux, étant orphelins, ont grandi dans l'indépendance et ne veulent écouter personne ; à part cela, qu'avez-vous tant à nous reprocher ? Ne vois-tu pas, toi-même, que nous sommes bien loin d'être aussi mauvais que nous l'avons été par le passé et que nous voulons tous prier maintenant ? — Je sais cela, sans doute, lui répondis-je ; mais ce n'est pas tout de vouloir prier, l'important, c'est de prier comme il faut. N'est-il pas vrai que, parmi vous, il y en a plusieurs qui ne se gênent pas assez pour bien observer le repos du dimanche ? Qu'il y en a beaucoup qui ne se confessent pas régulièrement et qui ne craignent pas d'enfreindre le commandement qui ordonne de se confesser au moins une fois chaque année ? N'est-il pas vrai que depuis tant d'années que le Missionnaire vous visite, il y a encore bien peu de communiant parmi vous ? Si vous étiez tels qu'on se montre dans d'autres camps, il y a longtemps déjà que tous auraient dû être admis à la communion. Quant aux jeunes gens, s'ils n'écoulent pas les remontrances, quelle en est la cause, si ce n'est le défaut d'autorité parmi vous ? — Tu as raison, me répondit le chef ; tout ce que tu viens de dire n'est que trop vrai ; mais encore une fois, prends patience ; n'écris pas encore à l'Évêque et tu verras qu'à l'avenir nous te contenterons mieux. Pense donc quelle honte ce serait pour nous si, après nous avoir si souvent visités, vous alliez nous abandonner tout à coup. Que dirait-on partout de nous, sinon que nous sommes des méchants qui ne méritent pas que le prêtre demeure avec eux ? Prêche nos jeunes gens ; ne les ménage pas ; nous t'aiderons de notre mieux, et tout ira bien. »\n\nCe brave chef parlait du fond du cœur, j'en suis per-\nDepuis son baptême, qu’il reçut, comme vous vous le rappelez sans doute, aux fêtes de Noël de l’année précédente, il semble animé des meilleures intentions. J’espère qu’il nous aidera beaucoup, comme il le dit, à christianiser ses compatriotes...\n\nEXTRAIT DES LETTRES DU R. P. DOUCET.\n\nNotre-Dame de la Paix, Rivière des Arcs, 13 mars 1876.\n\n... Comme vous le voyez, je vous écris de la rivière des Arcs, en plein pays pied-noir. L’hiver dernier, j’ai passé six longs mois tout seul, au milieu d’une forte population métisse, ayant de la besogne autant et plus que je n’en pouvais faire. À la fin d’avril, je partais pour aller rejoindre le R. P. Scollen, qui résidait alors à 20 milles d’ici, plus près des montagnes Rocheuses. C’est là que je restai seul avec un petit sauvage, jusqu’à la fin du mois d’octobre, pendant que le P. Scollen allait visiter les divers camps sauvages et les métis disséminés dans la prairie. Après avoir été très-occupé pendant l’hiver, je dus demeurer plusieurs mois dans l’isolement et la solitude. Des circonstances imprévues m’imposèrent ce sacrifice. Figurez-vous, mon très-révéré Père, un lieu sauvage, tout près des montagnes, où l’on n’entend guère que le bruit des torrents, le cri des bêtes sauvages et le sifflement du vent ; les orages y sont fréquents et terribles en été. De rares voyageurs, sauvages ou autres, y passent quelquefois, mais sans s’arrêter. Je trouvai cependant, grâce à Dieu, le moyen de ne pas m’ennuyer dans cette solitude, la plus complète que j’eusse encore vue.\n\nJ’attendais l’arrivée de Mgr Grandin et du P. Scollen pour la fin de septembre. Une maladie longue et opinio-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007621.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 6920, "total-output-tokens": 2654, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1505, 1], [1505, 3382, 2], [3382, 5251, 3], [5251, 7117, 4], [7117, 8754, 5]], "primary_language": ["fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]