[{"id": "f7baf815fd1edfccd99ade0bbea3d7e6ae67cd82", "text": "NOUVELLES DIVERSES\nDES MISSIONS ÉTRANGÈRES\n\nSAINT-ALBERT.\n\nRAPPORT DU R. P. GASTÉ ADRESSÉ AU T. R. P. SUPÉRIEUR\nGÉNÉRAL.\n\nMission de Saint-Pierre du lac Caribou, le 3 janvier 1876.\n\nMON TRÈS-RÉVÉREND PÈRE,\n\nSi ma mémoire ne me fait défaut, je crois vous avoir écrit vers le milieu de juin, au départ des berges de notre poste. Dans cette lettre, ou au moins dans la précédente, je vous faisais part des espérances de succès que nous laissaient entrevoir certains changements heureux dans les dispositions de nos sauvages. Depuis ce moment ces premiers indices sont devenus plus apparents. Aujourd'hui la plupart des préventions contre la religion se sont dissipées ; on ne dit plus maintenant que c'est la religion qui fait mourir, mais on attribue à la méchanceté des hommes et à l'indifférence pour la religion l'invasion du fléau qui, depuis si longtemps, décime cette malheureuse tribu. Le retour aux pratiques religieuses est presque général. La visite de Mgr GRANDIN et la conversion d'un des chefs de notre tribu ont sans doute contribué pour beaucoup à amener ce bon résultat, mais la vraie cause est l'infinie miséricorde de Dieu, que vos bonnes prières ne cessent de solliciter en notre faveur. Veuillez donc,\nmon très-révérond Père, continuer à cette chère mission et à ceux de vos enfants qui en sont chargés l'âme de vos prières et de vos saints sacrifices, afin de hâter le complet succès de nos travaux demeurés trop longtemps, non pas entièrement stériles, mais beaucoup trop infructueux.\n\nJe vous parlais de la visite de Mgr GRANDIN ; nous n'avons pas joui longtemps du bonheur de sa présence. Monseigneur n'a pu nous donner que huit jours, qui se sont écoulés comme un rêve pour le F. Guillet et pour moi. Nos occupations ne nous laissaient à l'un et à l'autre que fort peu de temps, et Monseigneur avait de son côté beaucoup à faire. C'est le samedi soir, 10 juillet, qu'il arriva au milieu de nous. Sans être renseignés d'une manière exacte sur l'époque de cette bonne visite, nous nous y attendions cependant depuis plusieurs jours, parce que les bords du lac étaient dégagés de leurs glaces. J'avais espéré que Monseigneur pourrait venir pour la fête de saint Pierre, patron de notre mission ; un certain nombre de sauvages, sur mon invitation, avaient même retardé leur départ. Le 10 juillet, en voyant la nuit venir, je ne comptais plus sur l'arrivée pour ce jour-là, lorsque le F. Guillet, qui, par un secret pressentiment, avait conservé son espérance pour le soir même, me cria tout à coup : Mon Père, mon Père, Monseigneur arrive ! Quelques coups de fusil tirés par les compagnons de voyage de Sa Grandeur avaient donné l'éveil et des sauvages rôdant en canot sur le lac étaient venus, à force de rames, apporter la bonne nouvelle. Je sortis en toute hâte pour aller recevoir Monseigneur au rivage ; mais déjà il abordait, je ne pus que me jeter à ses genoux pour recevoir sa bénédiction et j'embrassai bien cordialement notre petit F. LEBELLE, qui l'accompagnait et qui devait demeurer avec nous. Notre cloche, mise en branle après le son de\nl'Angelus, annonçait aux habitants du fort et aux sauvages qui pouvaient encore l'ignorer la venue de notre bon Evêque. En un clin d'œil tous les habitants se trouvèrent réunis sur le rivage et à la porte de la chapelle. Quand Monseigneur eut touché la main à tous, il s'avança, suivi de la foule, vers notre chapelle pour y adorer le saint Sacrement. Un salut solennel fut donné, mais nous étions si émus, que plus d'une fois les larmes nous gagnèrent pendant les chants de la bénédiction et du Te Deum. Le reste de la soirée jusqu'à une heure avancée de la nuit fut donné à la joie et aux nouvelles. Le F. Guillet et moi étions tout oreilles quand Monseigneur nous parlait du Saint-Père, de la France, de vous, mon très-révéré Père, de la Congrégation et de nos familles.\n\nLe lendemain était un dimanche ; Monseigneur officia pontificalement. Nos Montagnais ouvraient de grands yeux à la vue de nos cérémonies. Durant la semaine, il y eut plusieurs grand'messes, l'une d'entre elles fut suivie d'une procession expiatoire pour demander à Dieu la cessation du fléau qui depuis si longtemps désole nos pauvres populations. Le dimanche suivant eut lieu la première communion des enfants du fort et de quelques vieilles Montagnaises. Monseigneur leur administra ensuite la confirmation. Le soir, aux vêpres solennelles, on fit la rénovation des vœux du baptême. J'oubliais de vous dire que le matin, à l'issue de la messe, avait eu lieu une splendide procession du saint Sacrement. Nous l'avions renvoyée à dessein jusqu'à cette époque. Tout s'y passa à merveille. Les gens du fort et les sauvages défilaient sur deux rangs au milieu d'une allée plantée de sapins jusqu'au reposoir artistement décoré par les soins du F. Guillet. C'est là qu'avant la bénédiction du très-saint Sacrement Monseigneur voulut consacrer notre mission au Sacré Cœur de Jésus.\nTout le monde était heureux de la présence de Monseigneur et des belles cérémonies auxquelles elle donnait occasion ; on voyait arriver avec peine le moment de la séparation. Dès le lendemain, Monseigneur nous quitta au bruit des décharges répétées. Nos deux Frères, l'interprète du fort et moi, nous allâmes en canot lui faire la conduite jusqu'à une heure de marche environ. Nous prîmes ensemble le dernier repas et nous nous séparâmes le cœur bien gros et les larmes aux yeux. Monseigneur emmenait notre cher petit Pierre. C'est un orphelin que nous avions élevé avec beaucoup de soin et qui, la veille, avait fait sa première communion. Ce cher enfant, ayant fait une chute en s'amusant, avait gravement compromis sa santé, le mal augmentait toujours et ne nous laissait plus d'espoir de guérison. Monseigneur, en nous entendant cet enfant, voulait essayer des ressources qu'offre Saint-Albert et le faire soigner par un docteur assez habile qui s'est établi dans ces parages. Le départ de Monseigneur fut le signal de celui des sauvages ; leur absence ne devait pas être longue. Au bout de quinze jours ils revenaient pour se trouver à l'arrivée des berges qu'on attendait à cette époque. Je recommençai aussitôt les exercices de la mission. Cependant le temps avançait et les berges n'arrivaient pas. L'inquiétude commençait à gagner les sauvages ; les uns attendaient des ressources pour aller ensuite à la chasse du caribou ; les autres avaient des membres de leurs familles employés sur ces berges, il tardait à tous de les voir arriver. Pour nous, nous étions aussi fort inquiets au sujet du P. Bonnal que nous savions en chemin pour le lac Caribou, et aussi pour divers envois qu'on nous avait annoncés de France et d'Angleterre. Enfin on signale une berge. On court bien vite aux renseignements pour connaître la cause du re-\ntard et savoir ce que devenaient les autres berges. Tout s'expliqua naturellement par l'insuffisance des marchandises apportées par le steamboat, qui devait faire un second voyage. Beaucoup de sauvages attendirent l'arrivée de la seconde berge jusqu'aux premières neiges et ne partirent qu'au moment où ils craignirent de se trouver pris par les glaces. Ce temps d'attente leur avait été fort pénible ; il eut cependant son bon côté, en ce sens qu'il me permit de les instruire plus longuement. Espérons que cette semence fécondée par la grâce de Dieu ne restera pas sans porter des fruits tôt ou tard.\n\nQuelques jours après le départ de nos derniers sauvages arrivait enfin la seconde berge ; mais elle ne nous amenait pas encore le cher P. BONNALD. Il arriva enfin dans une troisième, qui nous portait en même temps la plupart des pièces que nous attendions. Nous fûmes heureux de faire connaissance avec ce cher Père, que nous aimions déjà. Son répertoire bien fourni de nouvelles de la Congrégation et de la France fut mis à contribution et nous passâmes une soirée bien intéressante. Nous nous occupâmes le lendemain à ouvrir nos caisses qui renfermaient un petit harmonium, deux petits vitraux, une croix avec quatre chandeliers pour l'autel, deux superbes chasubles et une chape de soie moirée bordée de galons d'argent. Nos cœurs débordaient de reconnaissance envers nos bienfaiteurs. Ne pouvant les remercier de vive voix, nous voulûmes du moins acquitter notre dette de la seule manière qui nous fut possible. Profitant de l'autorisation que nous avait accordée Monseigneur de donner le salut du très-saint Sacrement lorsqu'il y aurait un certain concours de fidèles, nous pensâmes que l'occasion était bonne. Nous avions ici nos sauvages employés dans les berges, plusieurs métis catholiques du fort Cumberland, dont quelques-uns\nn'étaient jamais entrés dans une église, enfin tout le personnel du fort, composé tout entier de catholiques. Il fut donc décidé que le soir nous aurions un salut solennel où nous prions tous ensemble pour nos bienfaiteurs. L'autel fut paré comme aux grands jours de fête, toutes nos richesses furent étalées et à l'heure fixée l'excellente dame Deschambault, femme du bourgeois, voulut bien prendre place à l'harmonium pour accompagner le chant. Lorsque j'entendis ces harmonies résonner sous les voûtes de notre petite chapelle du lac Caribou perdue dans les bois, je fus si ému de bonheur, que je ne pus retenir mes larmes. Presque tout le monde partageait visiblement mon émotion. Non contents de ce premier témoignage de reconnaissance pour nos bienfaiteurs, nous chantâmes une grand'messe, le dimanche suivant, à leur intention.\n\nQuelques jours plus tard, nous remplaçons le petit Pierre, qui était parti avec Msr GRANDIN, par un autre orphelin bien digne à tous égards de notre pitié. Ce pauvre enfant, âgé seulement de quatre ans et demi, avait eu le malheur, l'an dernier, de perdre son père et sa mère à quelques semaines d'intervalle. Successivement recueilli par divers membres de sa famille ou de sa tribu, qui s'en dégoûtaient bientôt, à cause de ses infirmités, il végétait dans la malpropreté et la misère, manquant le plus souvent du nécessaire. Il se trouvait en fin de compte chez un oncle qui était censé le garder. Plusieurs fois notre F. LABELLE l'avait aperçu en allant à la pêche, il nous avait parlé de l'extrême misère de ce pauvre enfant et nous étions disposés à faire quelque chose pour lui, quand l'oncle, fatigué à son tour et craignant de le voir mourir par suite du peu de soin que sa femme en prenait, vint de lui-même nous l'offrir. Je promis de m'en charger.\nQuand nous allâmes le chercher, il était dans l'état le plus dégoûtant, il était vêtu d'une manière insuffisante pour la saison et plusieurs parties de son corps étaient déjà gelées. On eut dit, à voir son air triste et morne, qu'il comprenait son état de délaissement ; à peine répondait-il quelques mots à mes questions. Quand on lui présenta un morceau de viande sèche, il était si affamé, qu'il se jeta dessus avec la voracité d'un petit dogue. Toute l'après-midi il garda le silence et parut tout triste. Vers le soir, quand nous fûmes rentrés à la maison, le F. Guillet présida à sa nouvelle toilette et le délivra de ses pauvres guenilles dégoûtantes, le lava de la tête aux pieds et le vêtit de nouveaux habits qu'il avait préparés à la hâte ; il le fit manger, puis le coucha sous l'escalier qui conduit à nos appartements d'en haut. Nous venions de monter pour faire en commun notre lecture spirituelle et nous commencions à peine, lorsque nous entendîmes notre petit bonhomme, si taciturne jusqu'alors, chanter de tout son cœur de petites ritournelles d'enfant. Sans doute revenu comme d'un rêve, à la vue des soins dont il avait été l'objet et goûtant un bien-être qu'il n'avait jamais connu, même entre les bras de sa mère, il n'avait pu résister à cet élan de bonheur. Il semble depuis ce moment avoir complètement changé de nature, il est devenu joyeux et grand parleur, il nous amuse souvent par ses reparties et nous aime comme on aime un père et une mère. Espérons que, Dieu aidant, il fera, lui aussi, plus tard un bon sujet, aimant bien le bon Dieu et qu'il sera la consolation de ceux qui lui ont prodigué leurs soins ou la joie de ceux qui les remplaceront. Plus la charité que nous avons montrée envers ce pauvre petit déshérité a été généreuse, plus elle saura, n'en doutons pas, parler éloquemment auprès du bon Dieu en notre faveur et en faveur de notre œuvre Comment pourrait-il en être autrement\nlorsque nous voyons qu'elle fait une si grande impression aux hommes que l'on pourrait croire les moins accessibles à ce langage? Dernièrement, le chef de notre tribu ne pouvait taire son admiration à la vue des soins prodigués devant lui à cet enfant. J'ai lieu de croire qu'il n'est pas le seul de sa nation à partager ce sentiment. Oh! que ne nous est-il donné de pouvoir disposer de ressources plus abondantes! Quel bien n'y aurait-il pas à faire de tous côtés! Espérons du moins que le divin Maître voudra bien tenir compte de notre bonne volonté et de nos bons désirs.\n\nJe ne sais si le bon Dieu voudra nous conserver notre petit Simon, c'est le nom du nouvel orphelin. Il vient d'être pris depuis trois jours d'une terrible maladie qui n'a pas coutume de faire grâce aux petits enfants, surtout quand ils sont privés comme celui-ci des secours de la médecine. Il est aux prises avec la fièvre typhoïde. Nous désirerions bien le conserver, cependant que la volonté du bon Dieu soit faite!\n\nAprès le départ de nos derniers Montagnais employés dans les berges, tandis que le R. P. Bonnald pendant l'été continuait à se livrer à l'étude de la langue crise, je faisais moi-même l'apprentissage de la varlope et du rabot. Il s'agissait de faire un petit magasin, qui devait être pris sur la salle réservée aux sauvages. Il fallait raboter, faire une porte, un guichet et des étagères. J'étais effrayé de mon inexpérience, mais confiant dans ce proverbe: Aide-toi et Dieu t'aidera, je me mis à la besogne et pus heureusement terminer, tant bien que mal, tout mon travail pour l'arrivée de nos premières bandes montagnaises sur les premières glaces. De leur côté, les Frères n'étaient pas restés inactifs. Le F. Guillet, tout en s'occupant de la cuisine, avait trouvé le temps de nous faire un couloir pour relier notre maison à la cuisine qui\nnous serons toujours de réfectoire. Cette nouvelle disposition a l'avantage de nous mettre tout à fait chez nous et donne à notre établissement un petit air de communauté. De cette manière l'accès de la cuisine, pour laquelle nos sauvages ont tant d'attraction, est rendu bien plus difficile. Quant au F. Labelle, il nous rendait, de son côté, un immense service en prenant presque à lui seul dans ses rets plus de quatre mille pièces de poissons. Sous les premières glaces, à l'aide d'un sauvage, il augmenta encore notre provision d'un millier de poissons frais.\n\nDès l'arrivée des sauvages, nous pûmes constater que leurs bonnes dispositions n'avaient pas changé et que la semence de la parole divine jetée dans leurs cœurs l'été dernier avait porté ses fruits. J'étais appelé dans deux camps pour la visite de quelques malades ; je me mis en route avec les sauvages dès qu'ils eurent terminé leur traite. La fête de l'Immaculée Conception de notre bonne Mère me trouva dans le premier des deux camps. Nous la célébrâmes de notre mieux. Il y eut trois réunions, deux pour les grandes personnes et une pour les enfants ; dans l'intervalle je visitai les malades, que je trouvai en assez bon état. Le lendemain je me mis en route pour l'autre camp qui, fort heureusement, s'était rapproché depuis notre départ. Nous étions à peine, le F. Guillet et moi, installés dans la loge que nous avions choisie pour y passer la nuit, que la neige commença à tomber à flocons pressés, le vent souffla avec rage et une poudrerie affreuse nous enveloppa. La tempête était si violente, que nous avions peur de voir notre loge emportée. Cet ouragan dura deux jours, que j'employai à visiter les loges et à baptiser quelques enfants. Les malades n'étaient pas dans ce camp, mais j'appris qu'ils allaient mieux. Je trouvai une vieille femme que je confessai, en l'engageant à venir à la mission pour la fête de Noël,\népoque à laquelle je me proposais de lui faire faire sa première communion. C'était la mère de notre chef. Nous repartîmes le lendemain accompagnés d'un sauvage, nous marchâmes tout le jour et toute la nuit, sauf deux heures que nous passâmes blottis auprès d'un maigre feu pour y attendre le lever de la lune, et le surlendemain, vers quatre heures et demie, nous arrivâmes à la mission pour donner le Benedicamus au P. BONNALD et au F. LABELLE.\n\nCe voyage avait duré treize jours ; il nous restait bien peu de temps avant la fête de Noël, nous voulions nous préparer de notre mieux pour l'arrivée des sauvages, qui nous avaient promis de venir nombreux. Je chargeai notre F. Guillet de faire une crèche. Il s'en acquitta à notre grande satisfaction. Il disposa une niche de façon à pouvoir y mettre au fond un de nos vitraux représentant l'Assomption de la sainte Vierge, ce vitrail devait être éclairé par derrière, de manière à ce que le dessin pût parfaitement ressortir. Au-dessous se trouvait une statuette de la Vierge ayant à ses pieds l'enfant Jésus couché sur un coussin. Sous la table servant de support à la niche, un transparent éclairé d'une faible lumière laissait apercevoir l'étable, les bergers et l'étoile. Le chœur était tapissé d'oriflammes aux couleurs de la sainte Vierge et du Pape. De magnifiques fleurs récemment arrivées de France et disposées en bouquets par les mains habiles de notre Frère, paraient les gradins découpés de l'autel sur lesquels on voyait déjà nos beaux chandeliers dorés. Notre autel avec ses gracieuses découpures faisait un effet superbe. De vieilles chasubles, rajeunies et transformées en dalmatiques, devaient servir pour les offices de la nuit.\n\nNos sauvages furent fidèles au rendez-vous, ils arrivèrent la veille de Noël en grand nombre. Jamais, je\ncrois, depuis l'établissement de la mission, je n'en avais vu autant à pareille fête. Parmi eux se trouvait le chef à qui j'avais promis, lors de son dernier voyage ici, de conférer le baptême à la messe de minuit. Ce sauvage, aux mœurs douces et régulières, aurait obtenu depuis longtemps déjà cette faveur, si je n'avais cru remarquer en lui une certaine indifférence puisée sans doute au contact des ministres qu'il avait vus autrefois. Il y a six ou sept ans, j'avais eu quelque espoir de le gagner, il s'était confessé et j'avais reçu de lui et de sa femme un mutuel consentement de mariage. Il s'en était rapporté à moi pour son baptême, mais sans en exprimer un bien vif désir, ni sans me laisser apercevoir une volonté assez déterminée de pratiquer les observances de notre sainte religion. J'espérais toutefois parvenir à un bon résultat, quand la mort vint frapper successivement et à peu d'intervalle deux de ses frères qu'il aimait tendrement. Cette circonstance le replongea plus que jamais dans son indifférence. L'an dernier il commençait à revenir ; une maladie sérieuse qu'il fit, loin du prêtre, lui donna à réfléchir et détermina les dispositions bien meilleures dans lesquelles je le trouvais l'automne dernier. Je résolus alors de ne plus différer à l'admettre au saint baptême, et pour rendre la chose plus solennelle, je fixai le moment de la cérémonie à la messe de minuit, en lui faisant remarquer que c'était dans une circonstance semblable que le premier grand chef de mon pays, Clovis, avait vu, lui aussi, couler l'eau sainte sur son front. Ce rapprochement parut le flatter beaucoup. Il me restait toutefois certaines explications à recevoir de lui avant de procéder à la cérémonie, je voulais aussi le préparer plus immédiatement. Je l'attendis toute la soirée, mais ce fut en vain, je dus ajourner le baptême.\n\nNotre office de la nuit fut splendide. La cérémonie\ncommença, selon l'usage, par le chant du *Te Deum*. Après l'Evangile je fis un discours en montagnais sur l'objet de la fête et à l'Offertoire le F. Guillet, accompagné par l'harmonium, entonna un cantique montagnais sur la naissance de Notre-Seigneur; il fut chanté par tous nos sauvages. Il me semblait que tout cet ensemble de décorations, de cérémonies et de chants me rendait plus fervent, mais je ne doute pas que nos sauvages n'en aient été vivement impressionnés, car ensuite ils ne cessèrent de parler de ce qu'ils avaient vu et entendu. J'aurais vivement désiré pouvoir faire le baptême de notre chef avant les vêpres, mais je compris qu'il serait difficile de le voir pour le préparer à cette cérémonie. Nos sauvages devaient avoir un grand festin, dont j'avais moi-même donné l'idée, en leur faisant présent d'une chaudière remplie de patates et d'une livre de thé. Je pensais que le bourgeois ne se refuserait pas à fournir le reste, et, en effet, il s'exécuta de bonne grâce en distribuant de la farine et du sucre. Quant à la viande, ils en avaient. Tout se passa pour le mieux, les sauvages étaient contents.\n\nLe soir, après les vêpres, je vis enfin notre chef que je n'avais fait qu'entrevoir le matin. J'eus bientôt toutes les explications qu'il me fallait, après quoi ne trouvant plus d'obstacle, il ne me resta plus qu'à le préparer. La cérémonie fut indiquée pour le lendemain, dimanche, fête de saint Étienne. M. et Mme Deschambault, sur leur demande, furent choisis pour parrain et marraine. L'interprète du fort et sa femme furent désignés pour remplir le même rôle auprès d'un jeune homme que je devais baptiser en même temps.\n\nLa cérémonie fut annoncée à la grand'messe avec invitation à tous les sauvages d'y assister. Le moment venu, je me revêtis de la chape, et, à genoux au pied de\nl’autel, j’entonnai le *Veni Creator*. Le P. Bonnald m’assistait pendant les cérémonies, que je commençai aussitôt et durant lesquelles les sauvages chantèrent, en montagnais, le cantique du baptême. Par une attention délicate du parrain et de la marraine, on donna au chef les noms des deux Pères, Étienne-Alphonse. Il était visiblement ému pendant les cérémonies préparatoires, mais son émotion fut à son comble au moment où l’eau sainte coula sur son front. Ses parrain et marraine, qui tenaient alors leurs mains sur ses épaules, sentirent comme un tremblement qui parcourait tout son corps. La sueur ruisselait sur son visage. La cérémonie se termina par le chant du *Magnificat* et une instruction dans laquelle j’expliquai l’heureuse, mais toute mystérieuse transformation qui venait de s’opérer dans l’âme des nouveaux baptisés. M’adressant spécialement à notre chef, je lui dis que le jour précédent était l’anniversaire du baptême du premier des rois ou grands chefs de mon pays, Clovis; je lui fis un résumé de la vie de ce grand prince après son baptême et lui indiquai la conduite qu’il devait suivre lui-même, dans sa vie privée et dans sa vie publique, s’il voulait marcher sur les traces de ce grand chef et arriver au royaume éternel du souverain maître de la terre et du ciel. Comme complément de la fête, le chef eut l’honneur d’être admis le soir à notre table, en compagnie du bourgeois du fort, son parrain. Nous espérons qu’il gardera longtemps le souvenir de ce grand jour. Ce soir-là il était vraiment heureux. Deux jours après j’eus occasion de le revoir à son camp, où j’étais appelé par un malade. Sa joie durait encore et ses bonnes dispositions paraissaient s’affermir de plus en plus. Le petit récit par lequel je termine cette longue lettre va vous en faire juger par vous-même.\n\nIl y avait au camp un bon sauvage qui par la vente de\nses pelleteries avait eu la bonne fortune de se procurer un demi-sac de farine ; jamais sans doute le cher homme ne s'était vu si riche. Comme on était à la veille de se disperser par groupes, il voulut le soir réunir une dernière fois ses compatriotes pour les faire participer à son abondance. Tous les hommes furent en conséquence invités à un festin, et comme j'étais au camp, je dus être de la partie. Toutefois, mon très-révérend Père, ne vous scandalisez pas à ce mot de festin. Quand vous en connaitrez le menu, vous verrez qu'il n'y avait rien qui fût contraire à l'esprit de mortification que nous devons pratiquer. Il n'y avait ni viande, ni vins généreux, ni dessert et pour bonne cause. Une exception était faite cependant en ma faveur. Notre chef avait, dans sa loge, une tête de petit caribou tiré le jour même et dont on n'avait encore apporté que ce seul morceau ; il donna ordre de la faire cuire chez lui et de l'apporter dès qu'elle serait prête, car il n'était pas convenable, disait-il, que le Père prît part au festin sans qu'on eût un seul morceau de viande à lui offrir. Au signal ordinaire, qui consiste en quelques coups de fusil, chaque invité arriva portant son couvert, c'est-à-dire une assiette et un pot ; les plus huppés se chargent, de plus, d'une chaudière remplie de thé ; aussitôt on se range autour de la loge. Bientôt apparaît la principale pièce du festin, ce sont deux chaudières remplies de sorte de biscuits préparés dans la graisse et que le maître du logis distribue à ses convives. La fameuse liqueur du Nord, le thé, est partagée entre tous. Déjà plusieurs, sans autre préoccupation, allaient se mettre en devoir de faire honneur au régal, quand le chef, assis à ma droite, fit observer gravement qu'on n'avait pas encore prié ; puis, se tournant vers moi, il m'invita à faire la prière. Je récitai en langue montagnaise le Benedicite, après quoi chacun se mit à l'œuvre. On rit, on plaisanta, on raconta force\nhistoires de chasse. Après le repas je récitai les grâces, et les histoires recommencèrent. Le moment de fumer était venu ; le maître du logis fit les honneurs du tabac, il avait eu soin d’en faire hacher à l’avance, il en distribua une certaine quantité par groupes et chacun puisait au tas le plus voisin. Quand je crus le moment venu de me retirer, j’invitai tout le monde à la prière ; je la récitai à haute voix et chacun la répétait après moi.\n\nTel est, mon très-révérend Père, le récit fidèle, mais trop long peut-être, de ce qui s’est passé chez nous depuis ma dernière lettre. Vous voudrez bien me pardonner ces détails peut-être peu intéressants, pour ne voir que mon désir de vous tenir bien au courant de ce qui concerne vos enfants du lac Caribou, non moins que mon bonheur de pouvoir m’entretenir longuement avec vous.\n\nVotre enfant obéissant et tout dévoué,\nA. GASTÉ, O. M. I.\n\nP.-S. Grâce à Dieu, et aussi un peu à Notre-Dame de Lourdes, notre petit orphelin Simon paraît sauvé. Il court et s’amuse de plus belle.\n\nLe R. P. BONNALD écrit également de la Mission Saint-Pierre au lac Caribou :\n\n« L’été dernier j’étais au fort Cumberland, où je dus faire un séjour de plus de trois mois, par suite du retard du steamboat, qui n’amena dans son premier voyage aucune pièce pour le poste du Caribou. Le district du Cumberland est très-étendu ; il forme la partie est du diocèse de Saint-Albert, et c’est la plus abandonnée. C’est le pays des Cris surnommés Maskégons, tous ou presque tous protestants. Les Missionnaires catholiques ont quelque-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007585.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 20760, "total-output-tokens": 8047, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1220, 1], [1220, 3071, 2], [3071, 4923, 3], [4923, 6761, 4], [6761, 8602, 5], [8602, 10397, 6], [10397, 12321, 7], [12321, 14164, 8], [14164, 16065, 9], [16065, 17870, 10], [17870, 19765, 11], [19765, 21578, 12], [21578, 23444, 13], [23444, 25402, 14], [25402, 26957, 15]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]