[{"id": "78aa1db53869285fb43912ebd43078fe8f62003f", "text": "tenante, qu'ils viendraient dès le lendemain faire leur soumission, ce qu'ils firent, en effet. D'abord il fut décidé que cinq d'entre eux seraient livrés prisonniers. Mais le général en chef, arrivé sur ces entrefaites, les gracia. On eut lieu de s'en réjouir, car depuis ils ont été très utiles à nos troupes pour les guider.\n\nHier, nous avons appris que les Cris des bois et les Cris des prairies s'étaient séparés : les premiers se dirigent vers le Fort-Pitt, emmenant leurs prisonniers. On pense qu'ils veulent se rendre et qu'ils espèrent obtenir plus facilement leur pardon par l'entremise des captifs. Nous nous attendons de jour en jour à être rappelés dans nos foyers. Personne n'en sera fâché. Le R. P. Le Goff est bien. J'espère qu'il écrira un rapport circonstancié de sa captivité.\n\nVeuillez me bénir, mon Très Révérend Père, et me croire comme toujours et plus que jamais\n\nVotre fils dévoué en N.-S. et M. I.\n\nPAUVOST, O. M. I.\n\nNous trouvons dans le Manitoba, journal hebdomadaire qui s'imprime à Saint-Boniface (numéro du 2 juillet), l'article suivant, qui nous donne quelques détails sur les démarches de Mgr Grandin, à la suite de ces tristes événements :\n\nFort-Qu'Appelle, Assiniboia, 24 juin.\n\nMgr Grandin arrivait ici lundi matin, accompagné du R. P. Leduc et du R. P. Lacombe ; celui-ci venait voir l'école industrielle, et il est reparti pour Calgary, mardi soir.\n\nMonseigneur va faire la visite de ses Missions et surtout de celles qui ont le plus souffert de ce malheureux soulèvement.\nMardi matin, Monseigneur chantait dans notre église un service pour le repos des âmes de ses deux missionnaires, les RR. PP. FAFARD et MARCHAND. La messe avait été annoncée le dimanche précédent, aussi l’assistance était nombreuse. Il était facile de lire sur la figure de Monseigneur la douleur et l’inquiétude qui remplissaient son âme ; mais c’est surtout après la messe, lorsque, à la demande du Supérieur de la Mission, le R. P. LEBRET, il adressa la parole aux métis, que l’on put comprendre toute l’étendue de sa peine. En parlant de cet horrible massacre du lac La Grenouille, Sa Grandeur disait :\n\n« Trois mois auparavant, les sauvages me protestaient de leur respect et de leur obéissance envers ces mêmes missionnaires qu’ils ont massacrés. Ils étaient loin alors de vouloir les tuer ; comment un tel changement s’est-il donc produit en eux ? Pourquoi se sont-ils portés à de tels excès ? Ah ! c’est que des gens plus instruits et plus coupables qu’eux leur ont donné de mauvais conseils et leur ont fait croire que le prêtre était leur ennemi et était vendu au gouvernement pour les perdre ; et, grâce à ces mauvais conseils, les deux excellents missionnaires, pour lesquels vous êtes venus prier aujourd’hui, ont été massacrés par ces mêmes sauvages pour le salut desquels ils avaient tout quitté ; ils sont tombés victimes de leur zèle à défendre la vie de leurs frères, et cela le Vendredi saint (1), quelques instants après avoir renouvelé la mémoire d’un sacrifice qui a dû être pour eux une excellente préparation au martyre.\n\n« N’est-ce pas aussi pour avoir rejeté les conseils de leurs prêtres, pour s’être laissé persuader qu’ils étaient leurs ennemis, pour s’être laissé tromper par un insensé\n\n(1) D’autres relations disent que le massacre a eu lieu le Jeudi saint, 2 avril. Nous saurons plus tard exactement quelle est la date véritable.\n\n(Note de la Rédaction.)\nque nos pauvres métis de la Saskatchewan, si bons auparavant et dont beaucoup sont vos parents, ont attiré sur eux tant de malheurs et même ont en quelque sorte apostasié dans la foi? S'il faut en croire ces récits que j'entends tous les jours et qui m'attristent de plus en plus, ce n'est pas en vain que Notre-Seigneur a dit à ses apôtres : « Celui qui vous méprise me méprise ; celui qui vous touche me touche à la prunelle de l'œil. » Ces menaces de Notre-Seigneur ne se sont-elles pas vérifiées et ne se vérifient-elles pas tous les jours? Quoi de plus triste que de rencontrer sur le chemin nos pauvres métis de la Saskatchewan si misérablement vêtus, eux qui, l'année dernière, avaient encore des établissements si prospères! J'ai versé tant de larmes que je n'en trouve plus pour pleurer de tels malheurs. »\n\nEt, en disant ces mots, Monseigneur éclata en sangulots. Beaucoup d'assistants pleuraient avec lui. La vue de ce bon et saint vieillard pleurant la perte de ses missionnaires et les malheurs de ses diocésains était de nature à arracher des larmes aux cœurs les plus durs. Les pleurs finirent éloquemment ce discours, qu'il ne put continuer, et l'assistance se retira pénétrée de compassion pour Sa Grandeur, si compatissante elle-même pour les maux de son peuple.\n\nCette cérémonie laissa de salutaires impressions.\n\nMonseigneur et le R. P. Leduc partirent mercredi pour Saint-Laurent.\n\nEXTRAIT D'UNE LETTRE DE MÈRE FARAUD AU T. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Notre-Dame des Victoires, le 6 juin 1885.\n\n..... Nous étions déjà arrivés au 17 avril, et je n'avais pas la moindre idée de ce qui se préparait. Ce jour-là,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007726.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1550, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1512, 1], [1512, 3399, 2], [3399, 5034, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]