[{"id": "fb3104a6cdd90bc109050cd7145b93d2d79db553", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÉE\n\nN° 27. — septembre 1868.\n\nMISSIONS DU VICARIAT DE LA SASKATCHEWAN.\n\nCe nouveau vicariat, confié, depuis peu, au zèle intelligent de Mgr GRANDIN, évêque de Satala, a été détaché du vicariat de la Rivière-Rouge. Il comprend les bassins des deux grandes rivières de la Saskatchewan et de Churchill ou rivière aux Anglais, et celui de la rivière Attabaskaw, jusqu’au petit lac des Esclaves inclusivement, et les parties orientales de l’isthme de Raë et de la péninsule Melville. Il est borné, à l’est du cap Churchill jusqu’à Hoppen Ilet, par la baie d’Hudson ; au nord et au nord-ouest par les hauteurs des terres, qui le séparent du bassin de l’Attabaskaw, à l’exception de la partie dont nous venons de parler ; à l’ouest et au sud-ouest, par le sommet des montagnes Rocheuses ; au sud, il est borné en partie par la frontière des États-Unis, qui s’avance dans ces régions jusqu’au 49ᵉ degré de latitude, et en partie par les hautes...\nteurs des terres qui le séparent du bassin de la Rivière-Rouge. Au sud-est, il est limité par le bassin du fleuve Nelson. Ce vicariat dans sa longueur moyenne une étendue de 1,670 kilomètres et 745 kilomètres dans sa largeur, et une superficie d'environ 1,200,000 kilomètres, coupée par de nombreux cours d'eau. A peu près celle de la France. Notre dessin n'étant point de donner ici des notions géographiques plus complètes sur ce vicariat, mais de faire connaître son état sous le rapport religieux, nous empruntons, à ce sujet, aux notes que Mgr Grandin nous a laissées, ce printemps, avant de reprendre le chemin de sa lointaine mission, les renseignements que nous publions ; quoique très-peu étendus, ils suffiront, nous l'espérons, à donner une connaissance exacte de l'état religieux de ce nouveau vicariat et de ses nombreux besoins.\n\nLe vicariat de la Saskatchewan ne comptait, à la date du mois d'août dernier, que douze Missionnaires y compris l'Évêque, répartis dans six résidences, dont quelques-unes sont séparées des autres par une grande distance ; outre le service qui se fait dans les résidences, à peu près chaque résidence a à desservir un ou plusieurs postes de missions, ce qui nécessite, de la part des Missionnaires qui en sont chargés, des voyages longs et très-pénibles. Voici les noms de ces résidences, auxquelles on a donné dans ces régions le nom de missions.\n\nI. Mission de Saint-Jean-Baptiste, à l'île à la Crosse, la plus ancienne en date dans cette direction et autrefois la plus importante, mais qui a été gravement compromise par le désastreux incendie qui a dévoré en peu d'heures les travaux de plusieurs années.\n\nDeux Pères y résident avec trois frères convers ; ils n'ont pour logement actuellement qu'une assez méchante baraque, qui sert également d'orphelinat à une vingtaine de jeunes garçons ; cette mission a également une école\nde jeunes filles, sous la direction de trois Sœurs grises du Canada. Les Missionnaires y desservent les métis du fort, et les Indiens Cris et Montagnais qui le visitent. Ces sauvages sont à peu près tous catholiques. Les deux Pères ont, en outre, à visiter : 1° le poste du Portage à la Loche, où se réunissent de six à sept cents sauvages, presque tous baptisés, mais qui sont moins bons chrétiens que ceux des missions où les prêtres résident, et ceci s'applique à tous les postes qui sont simplement visités, surtout quand les visites sont rares et irrégulières. La raison de ce fait est facile à trouver : outre que ces sauvages ont beaucoup moins de secours religieux et sont beaucoup moins instruits de leur religion, la présence seule du prêtre a pour effet de leur rappeler celle de Dieu, ce qui les rend plus fidèles à leurs obligations et plus persévérants dans leurs bonnes résolutions ; 2° le poste du lac Vert, qui est fréquenté par une centaine de Montagnais, tous chrétiens, et deux ou trois cents Cris, presque tous infidèles, mais qui se convertiraient si un Missionnaire pouvait résider à ce poste.\n\nII. À près de deux cents lieues de l'île à la Crosse, dans la direction du nord-est, se trouve la résidence de Saint-Pierre, sur les bords du lac Caribou, dans la partie septentrionale. Cette mission est desservie par deux Pères et un frère convers. Environ quatorze cents Indiens s'y rendent, même de très-loin et à des époques différentes. Tous sont ou baptisés ou catéchumènes ; mais la situation de cette mission ne peut-être que précaire, à cause des difficultés matérielles qu'elle rencontre. Toute culture y est impossible, soit à cause de la longueur des hivers, soit à cause de la stérilité du sol. Le bois de construction y est très-rare, aussi n'a-t-on pu y élever que de misérables baraqués, qui à peine peuvent tenir debout. Le bois de chauffage y manquera bientôt, ce qui forcé-\nment obligera les Missionnaires d'aller ailleurs fixer leur résidence, car comment, dans un pays où le mercure gèle et où l'hiver est de sept mois, se passer de combustible ? La difficulté sera de trouver, dans ces régions désolées, un lieu où l'on puisse se procurer les avantages matériels de première nécessité, et qui soit assez central pour servir de rendez-vous aux sauvages qui habitent cette partie du vicariat de la Saskatchewan.\n\nLes Missionnaires de la mission Saint-Pierre sont chargés de visiter : 1° le poste du lac Ronge, où se trouve établie une mission protestante, dont l'influence a été désastreuse aux deux cents Indiens qui la fréquentent, parce que nos Missionnaires ne peuvent la visiter assez régulièrement ; 2° le poste du fort de traite, fréquenté par environ deux cents Indiens, dont les dispositions pourraient être meilleures ; 3° le poste placé à l'extrémité sud du lac Caribou, fréquenté par cent familles indiennes, peu instruites de notre sainte religion.\n\nUn des Pères s'est avancé, il y a un an, sur les terres dites des Montagnais, et y a trouvé un grand nombre de vieillards qui n'auraient jamais reçu la grâce du baptême, s'il ne les avait point visités sur leurs terres. Plus loin, sur les côtes de la baie d'Hudson, se trouvent des Esquimaux qui, jusqu'à ce jour, n'ont pu encore être visités par nos Pères, sans qu'on puisse prévoir quand il sera possible de leur porter la bonne nouvelle. Au sud-est de la résidence de Saint-Pierre, il y a plusieurs postes de traite qui sont fréquentés par les Sauvages, connus sous le nom de Maskegons, de la nombreuse famille des Cris, mais qui, malgré leurs demandes, plusieurs fois réitérées, n'ont pu encore obtenir d'être visités par un Missionnaire, par la raison que les deux Pères de la résidence au lac Caribou ont déjà plus de travail qu'ils ne peuvent en faire. Il est à craindre que les ministres pro-\ntestants ne profitent de cette pénurie des ouvriers évangéliques, pour venir s'implanter au milieu de ces pauvres tribus, et, profitant de leurs dispositions pour la prière, ne les séduisent et ne leur fassent embrasser leurs erreurs.\n\nLes autres missions sont établies dans la partie ouest du vicariat.\n\nIII. La résidence de Sainte-Anne est établie sur les bords du lac Manitou, appelé plus communément par les chrétiens lac Sainte-Anne. Elle possède une église en bois. Les fidèles de cette localité sont métis ; ils vivent des produits de la chasse et de la culture ; leur nombre varie de sept à huit cents. Sous le rapport religieux, généralement ils laissent peu à désirer, et, sans les flatter, on peut dire qu'ils forment une excellente chrétienté.\n\nIV. A vingt lieues environ de Saint-Anne, près de l'embouchure d'un affluent de la Saskatchewan, on a fondé la mission de Saint-Albert, qui désormais va devenir la résidence du vicaire apostolique, parce que de cette mission, qui est centrale, les communications sont plus faciles avec les autres résidences qu'à l'île à la Crosse, où d'abord Mgr Grandin s'était fixé, quand il n'était encore que coadjuteur de l'Évêque de Saint-Boniface. Cette mission, comme celle de Sainte-Anne, a une population métisse et ne lui cède en rien en bonnes dispositions religieuses. Deux Pères y résident, et trois Sœurs grises y sont chargées de l'instruction des enfants. Elle ne possède point encore d'église : une salle assez vaste, mais d'une architecture plus que modeste, en tient lieu provisoirement. Les Pères de cette mission et ceux de Sainte-Anne ont, en outre, à desservir les postes du petit lac des Esclaves, du fort Gasper et quelques autres encore. Ils ont, en outre, à faire le service religieux au fort Edmonton, où un frère réside d'ordinaire pour l'instruction des jeunes garçons.\nCe poste n’est, du reste, qu’à deux lieues de la résidence de Saint-Albert, et comprend presque exclusivement les métis employés au service de l’honorable Compagnie de la baie d’Hudson.\n\nV. A environ quarante lieues de Saint-Albert et dans la direction du nord-ouest, se trouve la mission de Notre-Dame-des-Victoires, au lac de la Biche ; cette mission a peu donné de consolation, jusqu’à présent, deux Pères et trois Sœurs grises y résident ; une grande salle sert de chapelle, elle est fréquentée par quatre ou cinq cents métis et sauvages Cris, mais il y a dans la circonscription de cette mission un grand nombre d’Indiens qui sont encore infidèles. Les Missionnaires de Notre-Dame-des-Victoires ont à desservir le poste du fort Pitt.\n\nVI. La dernière des missions établies dans ce vicariat est Saint-Paul des Cris, sur l’une des rives de la branche nord de la Saskatchewan et au-dessus d’Edmonton. Les deux Pères qui y résident s’y trouvent dans une extrême pauvreté. Cette mission est fréquentée par un grand nombre de Cris, dont la plupart sont encore infidèles. L’un des deux Missionnaires de Saint-Paul est chargé de visiter le poste du fort Carlton. Mais ce service, toujours incomplet, ne saurait suffire à ce poste, qui aurait besoin qu’un prêtre y résidât, pour y desservir une centaine de familles de métis qui ne participent point à la vie nomade des purs Indiens, et pour les sauvages, dont un certain nombre, quoique baptisés, vivent peu en chrétiens. Plus loin, dans la direction de l’ouest, habitent les Pieds-Noirs ; un de nos Pères, qui les a déjà visités et qui a su captiver leur esprit, a planté dans cette région une croix, comme prise de possession pour une résidence, mais quand serait-il donné à un de nos Pères d’aller s’établir parmi cette nation, pour la rendre chrétienne ? Dieu seul le sait. Jusqu’à présent les ouvriers et les moyens ont manqué\nMaintenant que nous avons donné un aperçu sur les missions de ce nouveau vicariat, nous allons faire connaître les travaux de quelques-uns de nos Pères qui y exercent leur ministère apostolique, en leur laissant à eux-mêmes le soin de nous raconter leurs succès, comme leurs peines et leurs fatigues.\n\nLETTRE DU R. P. RÉMAS AU T. R. P. GÉNÉRAL.\n\nMission de Sainte-Anne, le 23 novembre 1866.\n\n« MON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\n« Je ne saurais vous exprimer la joie que m’a fait éprouver la réception de votre bonne et affectueuse lettre, en date du 20 mars de cette année. Je crois que l’éloignement où nous nous trouvons de votre personne vénérée et l’isolement où nous sommes, nous rendent plus chers les témoignages d’intérêt et d’affection paternelle que vous voulez bien nous donner et dont nous sentons, du reste, tout le prix. Aussi vous-prierai-je de vouloir bien, autant que vos nombreuses occupations vous le permettent, me favoriser de temps en temps de l’une de vos bien-aimées communications. — Vous me rappelez, très révérend Père, dans votre lettre, que je vous ferais un grand plaisir, si je vous racontais mes travaux et mes courses, et faisais connaître les sauvages que je suis chargé d’évangéliser. Je voudrais bien pouvoir répondre à vos désirs ; mais, vous le savez, notre genre de vie favorise peu le sens littéraire. Cependant, pour vous montrer ma bonne volonté, je vais essayer de vous raconter mon genre de vie dans cette région, où tout est si différent des usages et des mœurs de la France. — Je dois d’abord commencer par vous faire connaître le champ du père de famille, dont la culture m’a été confiée. La résidence de Sainte-Anne est", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007494.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 7, "total-input-tokens": 9688, "total-output-tokens": 3584, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 996, 1], [996, 2871, 2], [2871, 4782, 3], [4782, 6673, 4], [6673, 8515, 5], [8515, 10394, 6], [10394, 12065, 7]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false]}}]