[{"id": "5349059220ee2aa52c2f869da89e3d124574c1e1", "text": "Il ne me reste plus, très révérend et très aimé Père, qu’à me recommander, ainsi que toutes nos œuvres, à vos saintes prières, et à vous assurer de ma constante estime et persévérante affection. Tout continue d’aller bien ici.\n\n† Henri, Év. d’Anemour, O. M. I.\n\nLETTRE DU R. P. COCHIN.\n\nSainte-Angèle, le 28 avril 1885,\ncamp des sauvages rebelles.\n\nIl y a un mois environ que nous sommes en guerre dans les environs de Battleford. Les métis catholiques de Bressylor, mes paroissiens, étaient bien tranquilles, lorsque, sans être attendu, M. J. Mac-Kay, fermier-instructeur des sauvages, arriva de la réserve Strike him on the back. Ce bon monsieur faisait ici beaucoup de bien, et il assistait les sauvages en prenant même sur son nécessaire. Sa charité ne put empêcher que, le lundi 30 mars, il ne fût réveillé en sursaut, avant le lever du soleil, et immédiatement pillé. Les mêmes sauvages, qu’il avait souvent secourus, entrèrent chez lui comme une bande de brigands, demandant la bourse ou la vie. « Tous les magasins sont pillés à Battleford, dirent-ils ; si tu veux vivre, donne-nous à chacun 50 piastres. » Un d’eux, tirant son couteau, dit : « Si on te frappe, je veux mourir avec toi, parce que tu as été charitable ; mais tu vas rester avec nous comme prisonnier, et nous ne répondons pas de ta vie quand les autres arriveront. » Pendant cette scène, les deux enfants de M. Mac-Kay, deux petites filles, se réveillaient épouvantées et poussaient des cris déchirants. Les sauvages, poursuivant leurs recherches, visitèrent l’écurie, prirent un cheval du propriétaire et un\nsecond appartenant au gouverneur. Le pillage continua et fut complet ; les sauvages ne laissèrent à M. Mac-Kay et aux siens que ce qu'ils avaient sur le dos. Lui, sa femme et ses enfants furent conduits dans la cabane du chef et laissés sous la garde d'un sauvage. Les deux petites filles lui prirent la main en pleurant et en criant : *Aie pitié de nous ! passe-nous de l'autre côté!* Le sauvage, touché de leur chagrin, y consentit. Une fois traversés, les quatre fugitifs n'avaient que 6 milles à faire pour se rendre chez des parents. Ils partirent sans avoir déjeuné, se dirigeant comme ils purent à travers les bois et les marais, dans l'eau et la glace fondante, jusqu'aux genoux. La Providence les dirigea elle-même, et ils arrivèrent, après quatre heures de marche, par des chemins qu'ils ne connaissaient pas, à la maison de M. Poitras, beau-frère de M. Mac-Kay. Quand je vis arriver dans cet état Mme Mac-Kay et ses deux petites filles tout exténuées, je ne pus m'empêcher de pleurer. La famille fugitive fut reçue admirablement par M. Poitras, qui est un bon métis du vieux temps, c'est-à-dire un bon chrétien.\n\nCes événements du matin et les nouvelles colportées de tous côtés mirent la population en émoi, et aussitôt nos chrétiens commencèrent à régler leurs comptes avec le bon Dieu. J'entendis un grand nombre de confessions, et le lendemain, chez M. Poitras, où je m'étais retiré pour ne pas être seul, je donnai la communion à quinze personnes. Pendant la messe, Mme Mac-Kay, épuisée par les fatigues et par les émotions de la veille, tomba sans connaissance. À peine la messe terminée, nous vîmes arriver le bon vieux Frère Géranté ; il venait de Battleford, accompagné d'un petit métis, élève du P. Bigonessé. Il m'apprit que la population de la ville s'était enfermée dans le Fort. Les sauvages ont tout saccagé sur la rive sud de la rivière Bataille ; les Assiniboines ont tué leur\nfermier-instructeur, et, après avoir déchiré son corps, l'ont jeté sur un fumier.\n\n..... Je pensai que mon devoir était de rester avec mes catholiques. C'était le temps de Pâques, et tous, à peu près, se sont approchés des sacrements. Le jour de Pâques, le chef Poundmaker, suivi de vingt Assiniboines bien armés, vint dans notre camp proposer aux métis d'aller camper avec ses sauvages de l'autre côté de la rivière ; mais on lui fit comprendre par de bonnes raisons dont il reconnut la justesse, que nous ne voulions nous mêler en rien à la rébellion et que nous entendions rester neutres.\n\nQuelque temps après, nous sauvâmes la vie à des Canadiens qui venaient de couper du bois à 100 milles plus haut et qui se rendaient dans leurs familles à Battleford ; nous les cachâmes, au risque d'être saisis nous-mêmes. Pour ce motif, les sauvages crurent que nous voulions les trahir, et ils formèrent le complot de nous enlever de force ou de nous massacrer en cas de résistance. Les sauvages, au nombre de deux cents, tous à cheval, commencèrent à se disperser dans toutes les directions, mettant le feu aux maisons. Ils saccagèrent ma chapelle, brisèrent le Chemin de croix, s'emparant des saintes Huiles et de tout ce qui restait là en fait d'ornements ; puis ils volèrent aux métis une partie de leurs chevaux. Pour avoir la vie sauve, il fallut se laisser emmener. Il y en avait, parmi eux, qui voulaient me fusiller, pour la seule raison que j'étais un blanc ; un d'entre eux me menaça de son revolver ; d'un vigoureux coup de poing je fis sauter l'arme : deux bons sauvages, que j'avais faits chrétiens l'année dernière, vinrent à mon secours, et leur protection m'arracha au péril. Alors bien des sauvages cris vinrent me toucher la main et me donner l'assurance qu'ils étaient prêts à exposer leur vie pour me défendre.\n\nMaintenant, nous sommes campés avec eux sur la rive\nsud de la rivière Bataille, à 40 milles de Battleford. Nous sommes à la merci des révoltés, et ils nous font toutes sortes de misères. Depuis que je suis ici, les sauvages ont mis ma Mission de Sainte-Angèle en cendres. Je suis en compagnie de mes chers chrétiens, métis et sauvages, et parmi eux il y en a de bien bons. Je partage leur captivité et leur infortune. Je prie sans cesse avec eux, et j'ose espérer que le bon Dieu, oubliant mon indignité et mon insuffisance, aura égard à ma bonne volonté et exaucera les prières de tous.\n\nCOCHIN, O. M. I.\n\nEXTRAIT D'UNE LETTRE DU R. P. BIGONESSE.\n\nNous trouvons ce document dans l'Etendard du 11 juillet 1885 :\n\nBattleford, 7 juin 1885.\n\nLe P. COCHIN est rendu ici avec moi depuis deux semaines. Il a été prisonnier deux mois environ chez les sauvages, qui l'ont forcé, lui et ses gens (les métis neutres), à se joindre à eux. Il a été témoin de la bataille du Cut Knife Creek, où trois cents soldats sont allés attaquer le camp de Poundmaker, composé de trois cent soixante sauvages environ. Les balles lui ont sifflé aux oreilles et effleuré le corps. Il a pu échapper à la mort en se jetant à terre et dans les bas-fonds.\n\nEn voyant venir les soldats, il essaya d'aller au-devant d'eux par des sentiers détournés, pour leur conduire ses gens prisonniers. Mais les soldats, ne le connaissant pas pour un prêtre, tirèrent sur lui de leur mieux. D'un autre côté, les sauvages, tenant pour suspects les métis, les gardaient. Cette bataille dura, le 2 mai, de cinq heures", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007728.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5536, "total-output-tokens": 2183, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1583, 1], [1583, 3488, 2], [3488, 5367, 3], [5367, 6885, 4]], "primary_language": ["fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]