[{"id": "0207fe7e3d22840b4ca1a491bde6b64ad4084c0b", "text": "MISSIONS ÉTRANGÈRES\n\nSAINT-ALBERT.\n\nJOURNAL DE VOYAGE DE Mgr GRANDIN.\n\nÀ la rivière aux Castors, en canot d'écorce, me rendant au lac Vert et à l'île à la Grosse,\n20 mai 1880.\n\nMon très révérend Père,\n\nJe crains bien d'entreprendre une œuvre au-dessus de mes forces, en essayant, dans la position où je me trouve de vous tracer un récit des incidents de mon voyage. Mais quand je suis de passage dans nos diverses missions, il m'est absolument impossible d'écrire, et à Saint-Albert je ne suis pas plus libre de mon temps. Ici je suis gêné dans tous mes mouvements, à demi couché dans mon petit canot d'écorce, les jambes emprisonnées et dans l'impossibilité de les allonger. Pour peu que je remue, je risque de faire chavirer mon embarcation, et chaque coup d'aviron que donnent mes deux sauvages imprime au canot et par suite à ma personne une secousse qui ne favorise pas la rédaction d'une lettre. Mais il y a un inconvénient plus grand encore : ce sont des gouttes d'eau que mes maladroits rameurs font rejaillir à chaque instant sur mon papier, ce qui m'oblige forcément à interrompre mon travail. Comptant toutefois sur votre indulgence ordinaire, je commence mon journal ou relation de voyage. Si vous daignez en agréer l'hommage, que votre secrétaire veuille bien s'armer de patience et de courage pour me déchiffrer jusqu'au bout.\nQuand on entreprend un voyage par terre dans nos pays, un grand voyage surtout, il faut s'y préparer longuement, disposer bœufs, chevaux, attelages et charrettes, provisions, vêtements, chapelle, etc., et surtout ne prendre que des compagnons capables. Cette dernière précaution est particulièrement nécessaire au printemps, parce qu'alors les rivières sont gonflées par la fonte des neiges et qu'il faut des hommes entendus pour nous les faire traverser sans trop de danger. J'ai eu la chance de m'associer un brave commerçant de Saint-Albert, qui se rend pour son commerce à Winnipeg et à Saint-Boniface. C'est un excellent chrétien et tout son monde aussi. Je puis donc compter dans l'occasion sur son concours et sur celui de ses hommes. Tous les deux nous avons hâte de partir afin de pouvoir traverser sur la glace plusieurs petites rivières, passage qui serait bien difficile à effectuer une fois la glace disparue. Mais le printemps se fait bien attendre, après s'être annoncé comme devant être précoce. Je dois en partant visiter la mission de Notre-Dame de Lourdes, laquelle se trouve à 12 ou 15 lieues de Saint-Albert. Le 8 avril, le R. P. VIGREVILLE, qui doit partir avec moi, s'y rend le premier, afin d'aider le père MÉRER à préparer ses gens à la confirmation.\n\nLa neige est encore assez abondante pour qu'il soit obligé de prendre un traineau d'hiver. J'espère partir le 10 en voiture, mais le temps a été si mauvais et j'ai été si souffrant les jours précédents, que je préfère remettre mon départ au 12, d'autant plus que M. Chatelain, ce digne commerçant dont je viens de parler, assure ne pouvoir partir avant le 14. Le lundi, 12 avril, il fait bien froid, 11 degrés centigrades et un fort vent ; je crois pourtant ne pas devoir retarder plus longtemps, car le temps presse ; je pars donc avec les PP. Leduc et Grandin, qui viennent m'accompagner jusqu'à Notre-Dame de Lourdes.\nNous avons deux wagons, voitures volantes d'été, que nous appellerions, je crois, tilburys en France. Ces véhicules n'étaient nullement ceux qu'il nous fallait alors, il y avait encore trop de neige ; elle ne fondit point, si bien que nos roues étroites enfonçaient à plaisir, ce qui retardait les chevaux, et il nous fut impossible de nous rendre le jour même à Notre-Dame de Lourdes. Nous fûmes contraints de nous arrêter au moulin où nous espérions aller dîner. Ce moulin, bien-aimé Père, a une certaine importance. Je vous prie de vouloir bien me permettre de vous en dire un mot, d'autant plus qu'il est pour la moitié la propriété de la mission. Nous l'avions fait venir autrefois des États-Unis afin d'encourager nos chrétiens à la culture, d'utiliser nous-mêmes nos céréales et de pouvoir enfin manger du pain. Nous fûmes successivement, pour le mettre en état, des travaux considérables, qui furent détruits à deux reprises différentes par des inondations.\n\nCes contre-temps furent bien pénibles au cher Père Leduc, qui avait tout dirigé, à nos bons Frères qui avaient travaillé, à moi et à la colonie tout entière. Voulant pourtant utiliser notre moulin, nous l'avons vendu à des personnes qui nous semblaient devoir réussir, mais elles n'ont pas été plus heureuses que nous, et le moulin nous est revenu. Cependant, plus que jamais, le besoin s'en faisait sentir. La Compagnie de la Baie d'Hudson a voulu, elle aussi, avoir son moulin ; comme nous elle en a été quitte pour ses frais, mais il faut dire que l'inconvénient et la perte sont moins grands pour elle que pour nous. Pendant que j'étais en France, un Canadien a découvert sur la rivière Esturgeon, à 10 lieues plus bas que Saint-Albert, une chute d'eau qui ne gèle pas en hiver. Là, le moulin pourra moudre en tout temps et le terrain est situé de telle sorte qu'une inondation ne peut être nuisible.\nC'est ce Canadien qui a construit la chaussée et tout ce qui est nécessaire au moulin et qui en est propriétaire pour la moitié. Plus que nous aussi il en profite, parce que c'est lui qui le fait valoir. Mais dussions-nous n'en tirer aucun avantage, nous aurions déjà lieu d'être satisfaits du résultat, car sans ce bienheureux moulin les habitants de Saint-Albert, de Sainte-Anne, d'Edmonton, de Victoria et jusqu'à ceux du lac du Poisson-Blanc, tout près du lac la Biche, auraient souffert de la fin cet hiver et auraient été obligés de sacrifier tous les animaux domestiques. La récolte a été partout abondante et la chasse absolument nulle; notre petit établissement a donc fonctionné jour et nuit. Le meunier, malgré son activité, n'a pu satisfaire tout le monde. Qui pourrait en effet satisfaire tout un public? Bien des gens se plaignaient à nous; on venait souvent de loin et l'on subissait des retards à cause de l'affluence. Toutefois, tout le monde a pu faire moudre à son tour, chacun a conservé ses bœufs et ses chevaux; nous avons en moyenne fourni chaque jour le pain à cent personnes, pères, frères, sœurs, enfants et sauvages. Le gouvernement, de son côté, a fourni de la farine à quantité de sauvages affamés. Je vous demande pardon, mon bien-aimé Père, de m'étendre avec une telle complaisance sur ces détails. C'est que je prévois que dans un an ou deux chacun pourra faire moudre à son gré dans de magnifiques minoteries qui se construisent. On se souviendra alors des reproches adressés à notre meunier, mais on oubliera ses services et ceux du moulin.\n\nOutre le moulin, il y a une petite baraque de 15 pieds sur 12 au plus, laquelle sert d'habitation au meunier, et c'est là qu'il nous donne l'hospitalité. Il avait trois hommes avec lui, nous étions trois de notre côté, il ne fut cependant pas plus géné pour nous recevoir que vous ne l'êtes vous-même pour me recevoir à Paris quand j'y passe,\nmoins encore parce qu’il n’a ni chambres à préparer, ni lits à faire ; nous avions, en effet, avec nous nos provisions et nos couvertures que nous étendîmes sur le plancher.\n\nLe lendemain nous pûmes dire nos messes avant de nous remettre en route. Le mauvais temps continuait, nous n’arrivâmes que tard à Notre-Dame de Lourdes, petite mission nouvellement fondée sur la rive gauche de la Saskatchewan. Sur cette même rive sont établies quelques familles canadiennes, sur l’autre sont construites la prison et les habitations de colons de diverses croyances et de différentes origines. C’est le P. MÉRER qui dessert actuellement cette mission, et, comme les paroissiens ne sont pas encore nombreux et que plusieurs ne donnent pas beaucoup d’ouvrage aux prêtres, c’est aussi au P. MÉRER que j’ai provisoirement confié mon grand séminaire, ou, pour parler plus juste, mon scolasticat ; c’est là que le F. DAUPHIN, jeune Oblat, et le F. VANTIGHEN, junioriste et postulant, font leurs études de philosophie. L’établissement consiste en une chapelle en bois qui peut avoir 34 pieds sur 20 ; elle n’est pas achevée, cependant on y fait les offices ; une fois terminée, elle sera convenable. La maison, également en bois, peut mesurer 24 pieds sur 20 ; elle se compose d’un rez-de-chaussée seulement divisé en quatre pièces. La principale sert de cuisine, de salle de récréation, de salle de réception, de dortoir, etc. En face du poêle, qui est toujours ardent, se trouve la chapelle où l’on conserve le Saint Sacrement pendant l’hiver. C’est un tout petit appartement, je dirais mieux une alcôve de 8 ou 6 pieds sur 3 ou 4. De chaque côté de cette alcôve sont deux petites cellules, la première pour le R. P. Modérateur ou pour Monseigneur quand il est en visite ; la seconde avec deux lits disposés comme dans la cabine d’un vaisseau et destinée pour les scolastiques. Il n’y a dans cette petite communauté ni fête ni cuisi-\nnier ni frère sacristain, les chers scolastiques les rempla-\ncent; au besoin on trouve même parmi eux des menuisiers.\nLeurs récréations se passent presque exclusivement en\ntravaux manuels. Ce n’est pas, je vous assure, ce dont je\nme plains, car il s’agit de former des scolastiques mission-\nnaires pour le diocèse de Saint-Albert. Je dois du reste\nvous dire, bien-aimé Père, que cette petite commu-\nnauté est vraiment régulière, excepté pourtant quand j’y\npasse, car alors il y a un peu d’encombrement. Elle se rend\nà Saint-Albert pour les retraites. Je n’ai pas à reprocher\nà nos scolastiques d’être dissipés ; loin de là.\n\nOn était convenu d’un signal pour annoncer mon ar-\nrivée à la population; le capitaine, averti un des premiers,\nvint nous faire visite et nous invita à dîner au nom du\ncolonel. Le soir nous allâmes donc, les PP. Leduc, Végreville\net moi, dîner avec ces messieurs. On m’avait pré-\nparé une chambre, mais je préférai faire découvrir le\nP. Modérateur et rester en famille. Le P. Leduc se rendit\nà la prison pour visiter un prisonnier du lac la Biche, qu’il\nfaudra probablement plus tard accompagner au supplice.\nLe lendemain 14, il y eut grand’messe pontificale, ser-\nmon pontifical et confirmation. Après le dîner, les PP. Le-\nduc et Grandin reprenaient le chemin de Saint-Albert par\nun froid toujours vif et piquant. Nous doutons du départ\nde nos compagnons de Saint-Albert, et s’ils sont partis,\nnous ne supposons pas qu’ils aient pu arriver au rendez-\nvous. Le lendemain il fait froid comme à Noël et de huit\nheures du matin jusqu’à neuf heures du soir la neige ne\ncessa de tomber. Cependant, le soir, le premier élève du\nP. Grandin arrive à Notre-Dame de Lourdes avec un autre\ncompagnon de voyage et m’annonce que les deux hommes\nqui doivent m’accompagner sont partis le matin même.\nM. Chatelain, voyant le mauvais temps, s’était rendu à\nl’évêché pour avertir qu’il allait retarder son départ. Il\nétait trop tard, on ne pouvait plus me le faire savoir et mes jeunes gens étaient partis. Le samedi, craignant de mettre mes compagnons de voyage dans l'embarras, je me dirigeai vers le rendez-vous. Un homme engagé et un jeune enfant sauvage, élève à la mission, ne tardèrent pas à arriver et m'apprirent la résolution de M. Chatelain. Ils amenaient trois charrettes plus ou moins chargées de colis à laisser au fort Pitt, plus deux bœufs, deux vaches et cinq chevaux. Nous campons avec eux sur les bords de la rivière Esturgeon, dans la neige, comme en hiver. Je dis la messe le dimanche, puis je les envoie explorer la rivière et la glace pour préparer le passage du lendemain. J'aurais pu facilement passer la journée à Notre-Dame de Lourdes, mais il fallait avoir un peu l'œil à tout et veiller aux nombreux bagages.\n\nLe dimanche il fit beau, la neige fondit et le lundi nous pûmes traverser la rivière sans aucune difficulté. Nous gravîmes ensuite des côtes assez abruptes et nous restâmes là jusqu'au soir. M. Chatelain avec sa grosse caravane nous rejoignit alors. Nous pouvons maintenant marcher en suivant le pas de nos chevaux et de nos bœufs, maigres et misérables montures. À l'heure du coucher un cavalier fut signalé. C'était le P. Ledec, qui revenait de Saint-Albert; il passa la nuit avec nous, et le lendemain, après avoir dit la sainte Messe, il se rendit à Notre-Dame de Lourdes et m'envoya le P. Végreville, qui se rendait à la mission de Saint-Laurent. Le mardi 20 avril, il nous rejoignit au campement de midi. Voilà donc maintenant notre caravane au complet, le P. Végreville et moi, deux serviteurs et un postulant convers. Nous voilà installés dans un petit tilbury, mais souvent je pars du campement à pied et je marche lentement jusqu'à ce que la caravane me rejoigne ou jusqu'à ce que je rencontre une rivière.\nDepuis Saint-Albert nous en avons eu plusieurs à traverser; voici les principales, je ne sais si elles sont indiquées sur les cartes que vous avez entre les mains : la rivière Esturgeon, que nous traversons au départ sur un pont et qu'il faut encore traverser 18 ou 20 milles plus loin ; la rivière Creuse ; la rivière Vermillon ; la rivière de la Carpe ; la rivière Victoria ; la rivière des Têtes blanches ; la petite rivière Rouge ; la rivière du lac la Selle ; la rivière du lac des Œufs ; la rivière Croupe-au-Chien ; la rivière d'Orignal ; la rivière du Milieu et la rivière Grenouille, sans compter plus de trente ruisseaux qui, au printemps, sont transformés en vraies rivières et en offrent tous les dangers. Nous avons eu la chance de passer la plupart de ces rivières sur la glace. Pendant quelques jours, il y a, avant la débâcle, un double courant, l'un sous la glace et l'autre dessus, causé par la fonte des neiges. Nous marchons aussi souvent dans l'eau, les bœufs et les chevaux en ont jusqu'au ventre, mais le fond est solide et nous sommes prudents. En moins d'une demi-heure, nous avons opéré le passage des rivières, passage qui m'a retenu, dans d'autres circonstances, plusieurs jours. Le 27 avril nous arrivions sur les bords de la rivière la Selle ; elle n'est pas très profonde, mais elle n'est pas entièrement débarrassée de sa couche de glace. Il y a des glaçons échoués sur le passage des voitures ; plusieurs hommes travaillent longtemps dans l'eau afin de leur frayer un chenal et n'y réussissent qu'avec peine ; toutefois, nous passons sans accident. Le lendemain, après dîner, je prends les devants, comme toujours, et je pousse plus loin que de coutume. J'attends la caravane à quelques centaines de mètres de la rivière Croupe-au-Chien, sur le bord d'un ruisseau devenu un torrent dangereux. Pour y arriver, il faut descendre des côtes à pic, les voitures mettent plus d'une heure à les\ndescendre. Ne pouvant m’expliquer ce retard et me dou-\ntant de quelque mésaventure, je voudrais revenir sur mes\npas, mais je suis bien las. Après une anxieuse attente, un\njeune homme arrive enfin avec les chevaux qui ne sont pas\nattelés, et m’apprend qu’en descendant la côte le cheval\ndu P. Végreville s’est abattu et a brisé sa voiture. Le ruis-\nseau, qui en temps ordinaire n’a qu’un mètre de largeur,\nest grossi considérablement. À nous deux, nous veillons\nnon sans peine au passage des chevaux ; deux furent sur le\npoint de se noyer, nous dûmes pour les repêcher leur lancer\nune corde, puis tirer comme nous pûmes par les jambes et\npar la tête afin de faciliter leurs efforts, et ainsi, nous\neûmes la chance de les ramener vivants. La caravane\narrivait à ce moment. Le P. Végreville venait à pied, sa\nvoiture, ou plutôt la voiture du P. Lestang, était attachée\nà une charrette, et ne se composait plus guère que des\nroues et d’une partie de la caisse ; tout le devant était en\npièces. Il fallait en venir aux inventions pour traverser.\nPendant que les uns préparaient le souper, les autres\nconstruisaient une embarcation et notre homme réparait\nla voiture. Le soir, nous avions un vrai bateau fait avec\ndeux roues de charrette et notre voiture était remise\nen état sans y avoir ajouté ni un clou ni une planche, des\nlanières de cuir en faisaient tous les frais. Ma calèche\nn’était pas élégante, mais elle était aussi solide qu’au-\nparavant ; en arrivant au fort Pitt, trois jours après,\nelle n’avait rien perdu de sa solidité. Elle aura, je n’en\ndoute pas, pu transporter le P. Végreville jusqu’à sa\ndestination.\n\nLe lendemain, 29 avril, dès que les messes furent dites\net que nous eûmes déjeuné, ce qui se fait chaque jour\ndès quatre heures et demie du matin, tout le monde se\nmit à l’ouvrage. Deux jeunes gens se lancèrent les pre-\nmières dans notre barque. La rivière était débordée et\nsur ses bords l'eau était peu profonde, il était donc impossible que l'embarcation, lourdement chargée, pût aborder la terre ferme. Nos jeunes gens étaient dans l'eau jusqu'à la ceinture, chargeant et déchargeant les colis successivement ; à neuf heures tout était fini. J'avais pris avec moi, prévoyant ces misères si communes dans ces sortes de voyage, une bouteille de cognac pour compléter ma pharmacie ; j'en donnai, pour me servir de l'expression du pays, un filet à tous ceux qui avaient dû patauger dans l'eau de glace pendant plusieurs heures ; puis, remettant en lieu sûr ma bouteille, qui contenait un cordial pour tout mon voyage, je n'oubliai qu'une chose : ce fut de la boucher. Le soir je ne pouvais m'expliquer une odeur de feu qui avait envahi tout le campement. Je craignais que quelqu'un de nos jeunes sauvages m'eût joué un tour, mais quel était le coupable ? Ce ne fut qu'à la mission du fort Pitt que le mystère fut expliqué.\n\nLe lendemain matin nous arrivons à la rivière d'Orignal : des voyageurs qui nous ont précédés ont trouvé une place convenable pour y jeter un pont et nous en profitons. Ces sortes de ponts sont tout simplement des pièces de bois qui vont d'une rive à l'autre et que nous recouvrons de petites branches pour que les chevaux ne se cassent pas les jambes. Ces sortes de ponts ne sont pas éternels ; la glace du printemps les emporte généralement ; le nôtre était flottant. Le reste de la journée et le jour suivant, nous ne fîmes que monter et descendre des buttes, parfois fort escarpées, qui bordaient l'autre rive ; nos bœufs et chevaux étaient essoufflés, il fallut absolument les dételer.\n\nCependant, nous voulions nous rendre au fort Pitt pour le samedi 1er mai. Nous y arrivâmes grâce au secours de M. Chatelain qui pouvait, lui, disposer d'au moins vingt chevaux et n'en attelait chaque jour pas plus de quatre ou\ncinq. Au printemps, les chevaux qui ont passé l'hiver dehors sont maigres et affaiblis, n'ayant eu pour nourriture que l'herbe sèche qui a été imprégnée d'humidité ; aussi ils ne peuvent résister longtemps. Nous complions sur nos bœufs, mais ils se fatiguèrent vite eux aussi, au point que nous dûmes en laisser un sur le chemin, il ne put arriver que quelques jours après nous. Cela vous explique nos bandes de chevaux, chose qui étonne souvent les Européens, qui nous croient riches en jugeant de notre fortune par notre cavalerie. Hélas, il n'en est rien et vingt chevaux ici, sur des terrains impraticables, ne valent pas plus qu'un seul sur les belles voies carrossables de vos pays.\n\nNos nombreux chevaux ne suffisent même pas ; il faut leur adjoindre des bœufs et même avec ce puissant attelage nous ne nous tisons pas toujours d'affaire. Tous les ans, dans nos voyages, nous perdons par accident quelques-unes de nos bêtes, ce qui devient pour nous l'occasion de nouvelles dépenses.\n\nMais je m'oublie en ces détails ; reprenons notre voyage et parlons de la mission de Saint-François-Régis du fort Pitt.\n\nNous y arrivons le 1er mai, à l'entrée de la nuit. Des décharges de coups de fusil annoncent ma caravane. Les P. Fafard, Bourgine et Petitot accourent aussitôt et nous embrassent avec effusion. Ils terminaient en ce moment leur petite retraite du mois ; jugez si la clôture en fut bruyante. N'en faites pourtant pas de reproche aux retraitants, moi seul suis ici coupable. M. Chatelain et ses hommes établirent leur campement près de la mission, avec l'intention de repartir deux jours après. Mais une pluie de neige fondante commença le lendemain 2 mai, pour ne cesser que le 12. Je dus, pour être agréable aux gens du fort Pitt, rester jusqu'au 5, fête de\nl'Ascension. Le P. Petitot, qui devait repartir avec moi, avait hâte de retourner à sa mission.\n\nLa mission du fort Pitt est encore moins avancée matériellement que celle de Notre-Dame de Lourdes. Elle se compose en ce moment de deux maisons d'à peu près trente pieds sur vingt. La première a l'honneur de garder le Saint Sacrement, dans une sorte d'alcôve, appelée chapelle, dont la porte est un simple rideau. Le reste sert d'église pour les réunions générales des fidèles, de salle d'exercices, de réception et de récréation. L'autre maison est habitée par deux époux métis ; le mari est infirme et ne peut nous rendre grand service, la femme fait la cuisine et tient le ménage. Ces braves gens, n'ayant pas d'enfants et redoutant la pauvreté pour leurs vieux jours, se sont donnés à la mission, selon l'expression reçue ici, avec tout ce qu'ils possédaient : croyez que c'est fort peu de chose. Ils nous sont bien utiles ; mais, semblables à beaucoup d'autres, ils ne se plaisent que là où ils ne sont pas, et voudraient être à Saint-Albert et non au fort Pitt. Grâce à ces dispositions d'esprit, ils font vraiment payer cher aux Missionnaires les services qu'ils leur rendent, et si l'on pouvait se passer d'eux, ce serait un débarras. Mais comme ils sont dévoués, nous nous estimons encore heureux de les avoir. C'est dans leur maison que sont établis le réfectoire et le dortoir des religieux.\n\nLe P. Farard est chargé de cette mission et de plusieurs autres sous la direction du P. Lestang, lequel réside le plus souvent à Battleford. Le bon P. Farard dépense la bonne santé dont il jouit en voyages entrepris pour la gloire de Dieu et le salut des sauvages. Le P. Bourgine, souffrant, garde la maison, instruit les sauvages qui viennent le visiter, fait beaucoup de bien à poste fixe et empêche beaucoup de mal. Il faudrait ici une église comme à Notre-Dame de Lourdes, mais il en faudrait encore à tant\nd’autres endroits! Cette mission n’a pas plus de deux ans d’existence, et il y a déjà sur le registre 287 baptêmes inscrits, dont le quart au moins d’adultes, et 25 mariages bénis.\n\nAux environs du fort Pitt, c’est-à-dire à deux, quatre et même huit jours de marche, il y a cinq postes à visiter, tous dépendant de la mission. À chacun d’eux, il faudrait aussi un prêtre résidant, une chapelle et une école. Le P. Fafard visite tous ces points excentriques; ce sont : le lac En-Long, dédié à saint Charles ; le lac la Grenouille, dédié à Notre-Dame de Bon-Conseil ; le lac d’Oignon, dédié à saint Denis ; le lac de Roches, dédié au Bon Larron, et le lac la Selle, dédié à Saint-Paul des Cris. Ces divers emplacements sont occupés généralement par des sauvages qui vivaient autrefois de la chasse aux buffalos et qui, aujourd’hui, demandent à la pêche et à la mendicité une sauvegarde contre la famine. Le gouvernement les secourt généreusement ; dans chaque localité il y a un agent qu’on appelle fermier, représentant l’autorité civile, avec la mission d’enseigner aux sauvages les principes de l’agriculture. Sans être prophète, je crois pouvoir prédire que les résultats attendus seront loin d’être en proportion avec les dépenses. Les Missionnaires réussiraient incomparablement mieux que les fermiers s’ils avaient les mêmes ressources, et c’est à eux que les agents du gouvernement doivent leurs quelques succès.\n\nNous avons dans toutes ces réserves, c’est le nom que l’on donne ici aux terres choisies par les sauvages, nous avons, dis-je, des chrétiens qui fréquentaient autrefois la mission de Saint-Paul, des catéchumènes, des hérétiques et des infidèles. Le Missionnaire va les visiter, les instruit des mystères et des vérités de la religion, et, de plus, il les dirige dans leurs travaux et ne dédaigne pas de leur\napprendre à atteler les bœufs et à conduire une charrue. Le P. FAFARD est maintenant aidé dans cet office par le cher F. LAMBERT.\n\nLes divers postes que je viens d'énumérer reçoivent également la visite de ministres protestants de diverses sectes. Les apôtres de l'erreur se recrutent plus facilement que ceux de la vérité ; on est moins exigeant pour eux et ils subissent moins d'épreuves préparatoires. Ils arrivent généralement dans le pays comme maîtres d'école, puis on apprend un beau jour qu'ils sont devenus Révérends et agissent comme tels. On rencontre parfois des métis et des sauvages qui, hier encore, ne savaient que tout juste lire la Bible en anglais et la traduire incorrectement en langue sauvage, parvenus promptement à la dignité de ministres. Leurs compatriotes les regardent comme des savants, parce qu'ils lisent dans de gros livres ; mais les gens civilisés, qui arrivent chaque jour plus nombreux, sont humiliés de leurs Révérends et ne font pas mystère de leurs sentiments.\n\nLe 4 mai, le P. VÉGREVILLE et notre jeune malade reprenaient leur voyage avec M. Chatelain. J'espère qu'ils auront été heureux, mais ils auront eu à souffrir du froid et aussi des difficultés que présente le passage des rivières. Pour moi, je dus, à cause du mauvais temps, attendre jusqu'au 8. Le P. PETITOT a emmené trois charrettes chargées de mobilier, de provisions et de divers objets envoyés de France ou que j'ai moi-même apportés de Saint-Albert. Nous cheminons à pied à côté des charrettes, et nous n'y montons que lorsque nous rencontrons des cours d'eau. Le chef des sauvages du P. PETITOT a cependant un tilbury, moins élégant encore que celui que j'ai laissé au P. VÉGREVILLE. On le met gracieusement à ma disposition, mais il est conduit par la nièce du chef, laquelle est la femme du serviteur du P. PETITOT. Bien\nque touché de l'offre, j'en use donc le moins possible. Nos bons chrétiens ne jugent pas le prêtre en pharisiens, et ne se doutent nullement de ma répugnance à voyager côte à côte avec la sauvagesse. Cependant, il a bien fallu s'y résoudre à certains moments, sous peine de ne pas pouvoir suivre la caravane. Le P. Petitot, lui, intrépide marcheur, avance toujours et, arrivé au campement, ne se ressent nullement de la fatigue. Je ne puis en dire autant, malgré l'état relativement assez bon de ma santé. Je redoutais la reprise de mes douleurs ; le voyage m'en a préservé, et, à part un peu de fièvre due à un gros rhume, je n'ai pas eu trop à me plaindre.\n\nJe renonce à vous dépeindre l'état des chemins que nous avons dû suivre ; je préfère arriver. Le 14, à midi, nous nous arrêtons pour dîner à l'emplacement choisi pour la mission Saint-Raphaël. C'est peut-être le meilleur et le plus convenable à nos établissements que l'on puisse rencontrer dans mon diocèse. La terre y est excellente, le bois de construction et de chauffage abonde, les pâturages sont gras et plusieurs lacs poissonneux sont espacés ça et là. Les sauvages installés dans cette réserve et placés sous la direction du P. Petitot sont chrétiens et fréquentaient autrefois l'île à la Crosse ; je les connais donc presque tous. Ils étaient précédemment établis au lac Froid et dans les environs, et c'est là que le P. Legoff venait les visiter chaque printemps, au prix de grandes fatigues. Il a eu la consolation d'en faire de bons chrétiens. Compris dans le territoire du traité, ils ont dû accepter les conditions offertes. Je ne doute pas qu'ils ne deviennent de bons colons si, comme je l'espère, le P. Petitot peut rester avec eux.\n\nCe Père est l'homme d'action par excellence ; rien ne l'arrête, rien ne l'épouvante. Seul avec son serviteur, il a abattu et disposé les bois nécessaires pour une con-\nstruction considérable. On ne saurait se faire une idée du travail qu’ils ont fait tous les deux durant trois mois. Abattre des sapins, dire la messe sous la tente, quand le froid n’était pas trop piquant, et avec cela aller de temps en temps visiter ses frères du fort Pilt et les chrétiens du lac Froid, étaient une distraction plutôt qu’un labeur pour ce bon Père.\n\nC’est à cette place que nous appellerons désormais Saint-Raphaël que nous laissions deux de nos charrettes et deux chevaux exténués de fatigue. Un peu allégés par l’abandon d’une partie du bagage, nous aurions pu hâter le pas, n’eût été la neige qui s’obstinait à tomber. Nous atteignîmes ainsi les côtes qui bordent la rivière aux Castors, puis le lac Froid. Les sauvages, réunis autour de l’habitation du chef, nous reçurent avec force salves joyeuses. Immédiatement nous nous dirigeâmes vers la petite habitation du P. Petitot. Nos gens voulaient, sans nous laisser le temps de souffler, se confesser pour la fête de la Pentecôte, qui était le lendemain ; mais nous étions si fatigués, que nous dûmes nous reposer quelques heures. Le jour de la fête il y eut office pontifical et nous pûmes confesser tout le monde. On chanta la messe sous l’étroit hangar, et je prêchai en montagnais, ce que je n’avais pas fait depuis huit ans.\n\nLe 18 mai, le P. Petitot partait pour son chantier avec un bon nombre de sauvages et moi je reprenais mon voyage. Nous nous rendîmes ensemble à la rivière aux Castors, où j’avais caché au haut d’un arbre mes provisions, ma chapelle et autres objets. Le chef devait encore m’accompagner jusqu’à la rivière pendant que le P. Petitot ferait ses préparatifs de départ. Pour éviter un passage difficile, je me mis en route à pied. Ce départ inopiné contraria un peu les sauvages, qui voulaient m’escorter à cheval. Moi parti, les hommes coururent à\nleurs fusils et j'entendis les décharges lorsque j'étais déjà loin. Bientôt le P. Petitot et de jeunes sauvages me rejoignirent à cheval et le chef avec sa voiture ; mais son pauvre cheval marchait à peine, se ressentant encore du voyage précédent ; le chef le conduisait à pied, passant dans les marais comme sur la terre sèche, bien qu'il eût de l'eau au-dessus du genoux. Mon Antoine Sébaux conduisait une charrette sur laquelle se trouvait un canot d'écorce. La charge n'était pas lourde, mais elle était fragile ; aussi, quand il se rencontrait quelque mauvais pas, des sauvages soutenaient la charrette de chaque côté, pour que l'embarcation ne fût endommagée par aucune secousse. Deux hommes la portèrent à dos quand il fallut descendre les côtes. Arrivés sur les bords de la rivière, nous étions ensemble, puis nous nous séparâmes, le P. Petitot pour aller à son chantier et moi pour voyager sur ma frêle embarcation conduite par deux sauvages. Nous descendions le courant et avancions rapidement ; cependant la pluie nous fait perdre une demi-journée et la rivière est tellement débordée, à certaines places, et forme des lacs si considérables, que mon guide ne reconnaît plus la direction à suivre.\n\nLe 22 mai, je surprenais les habitants du lac Vert, mission Saint-Julien. En même temps que moi, un bateau arrivait de l'île à la Crosse, et m'apportait des nouvelles de nos Pères. Le P. Chapelière, ayant passé ici une partie du Carême, avait préparé plusieurs personnes à la confirmation. Nous avons ici une maison et une chapelle, comme au fort Pitt. Le P. Moulin y a passé quelques années, pour soigner une excellente population que nous avons eu la douleur d'abandonner provisoirement, pour aller au secours de sauvages plus délaissés encore. Les braves chrétiens du lac Vert m'avaient envoyé une pétition, lors de mon passage à Carlton,\nl'automne dernier, se plaignant de ce qu'on les avait abandonnés. Ils me disaient que les quelques jours que les Missionnaires leur donnaient chaque année ne leur suffisaient pas; que les sauvages des environs ne prendraient suffisamment et sérieusement la prière que lorsqu'un Missionnaire serait définitivement établi au milieu d'eux. Pauvres gens, j'étais aussi convaincu qu'eux de ce qu'ils me disaient, mais que puis-je faire? Je suis d'autant plus affecté à cette population qu'elle se compose de familles venues de l'île à la Crosse, d'enfants que j'ai baptisés et que j'ai vus grandir, et qui ont été élevés parmi nous; il y a ici au moins sept ou huit jeunes femmes, sauvagesses ou métisses, élevées à notre orphelinat de l'île à la Crosse et autant d'hommes mariés aujourd'hui, faisant honneur à l'établissement d'où ils sortent.\n\nJe m'installe en arrivant dans notre maison, j'y suis chez moi. Antoine fait ma cuisine. Je me mets de suite au confessionnal et confesse toute la soirée; le lendemain, messe moins pontificale qu'au lac Froid, mais grand' messe royale cependant, avec grand sermon et confirmation. Je confesse le reste de la population entre les offices. Ce matin, 24 mai, à cinq heures, tout le monde attendait à ma porte. J'ai dit la sainte Messe, à laquelle ont communié ceux qui n'ont pu le faire hier. Maintenant, tout le monde est au travail. Je suis à présent à peu près tranquille, sauf quelques visites qui me viennent de temps en temps. Ce soir, je vais encore voir mon monde; demain matin peut-être aussi, puis je me mettrai en route pour l'île à la Crosse. Je reprendrai mon entretien avec Votre Paternité dès que j'aurai un moment libre.\n\n† Vital,\nEvêque de Saint-Albert, o. m. i.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007661.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 25004, "total-output-tokens": 9996, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1341, 1], [1341, 3239, 2], [3239, 5111, 3], [5111, 7030, 4], [7030, 8950, 5], [8950, 10874, 6], [10874, 12713, 7], [12713, 14634, 8], [14634, 16528, 9], [16528, 18396, 10], [18396, 20167, 11], [20167, 22080, 12], [22080, 23908, 13], [23908, 25739, 14], [25739, 27619, 15], [27619, 29466, 16], [29466, 31318, 17], [31318, 33035, 18]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]