[{"id": "4a400f0582fe2b9986cfa0a11736c431feedfa69", "text": "missions si éprouvées, j’irai prier et pleurer sur des ruines, sur les cendres de mes pauvres missionnaires. On dit qu’après avoir été fusillés, ils furent transportés dans leur maison que l’on incendia ensuite. Je donne ces renseignements sous toute réserve, car je ne suis sûr de rien, que de la mort de deux Pères, et je regarde comme très probable que quatre ont été massacrés.\n\n(Missions catholiques, 3 juillet 1885.)\n\nDEUXIÈME LETTRE\nDU R. P. FOURMOND AU T. R. P. SUPÉRIEUR GÉNÉRAL.\n\nSaint-Antoine, 11 mai 1885.\n\nVoilà près de deux mois que nous sommes comme prisonniers, sans pouvoir donner de nouvelles ni à vous, ni à Mgr GRANDIN, ni même à notre cher supérieur, le R. P. ANDRÉ. Tout le temps nous avons été au milieu de la rébellion.\n\nUne vingtaine de rebelles obstinés, victimes des paroles fallacieuses du trop fameux Riel, ont commencé la guerre par la proclamation du gouvernement provisoire, avec Gabriel Dumont pour président, assisté d’un conseil composé d’une douzaine de métis les plus âgés. Puis, à l’aide de cette petite bande armée, le chef a réuni de force à Batoche (Saint-Antoine) tous les autres métis en les menaçant du pillage et même de la mort s’ils ne prenaient pas eux aussi les armes pour soutenir leurs droits. Quelques-uns ont résisté, le plus grand nombre a cédé à la force.\n\nAlors Riel a voulu singer le madhi, et, tout à la fois pour satisfaire son orgueil et se venger de notre résistance et de la terrible opposition que nous lui avons faite, il s’est fait sectaire, fascinant nos pauvres gens par\nses trompeuses paroles, rejetant le Pape et l'Église,\nfaisant du samedi comme autrefois le jour du Seigneur,\nrenouvelant les erreurs des anciens et des nouveaux\nhérétiques, se donnant comme le grand réformateur de\nla religion, obligeant ses gens jour et nuit à la prière.\n\nJ'ai eu plusieurs disputes publiques avec lui. Les bons\nen ont été affermis ; mais beaucoup, terrifiés par ses me-\nnaces ou séduits par ses promesses et ses airs hypocrites,\nont renoncé à tout ce qu'il a voulu pour croire à ses rêve-\nries ; ils le regardent comme un saint, un persécuté, et\nnous comme des esclaves de Rome, des gens vendus au\ngouvernement, des traîtres, des ennemis de notre peuple.\nIl n'y a pas de sottises qu'il ne nous ait dites, de menaces\nqu'il ne nous ait faites pour nous ébranler et faire de nous\nses premiers apôtres.\n\nSous prétexte de nous défendre, il nous a tous réunis\navec nos fidèles religieuses de Saint-Laurent ici à Saint-\nAntoine de Padoue, où nous n'avons plus la permission\nde circuler librement, même pour les besoins du saint\nministère. Il était défendu à nos gens de venir nous visi-\nter et nous demander conseils et consolations.\n\nQue de terreurs, de dangers, de peines de tous genres\nsont venus fondre sur nous pendant tout ce temps ! Voilà\nle troisième jour que nous sommes au milieu de la ba-\ntaille entre l'armée canadienne, commandée par le géné-\nral Middleton, et nos pauvres gens, qui se battent avec un\ncourage et une habileté dignes d'une meilleure cause. La\nfusillade et la canonnade nous assourdissent sans pour-\ntant faire grand ravage. Les uns et les autres se cachent\ndans des trous et des tranchées. Nous n'avons pas plus\nd'une vingtaine de tués ou blessés. J'ai été mis par erreur\nau nombre des premiers et j'ai eu la surprise de lire,\ndans le Soleil de Winnipeg, l'annonce de ma mort.\n\nUn événement plus triste et plus sérieux, c'est la bles-\nsure du R. P. Moulin, frappé ce matin d’une balle égarée. Par une protection visible de N.-D. de la Miséricorde dont nous célébrons la fête, la blessure n’est pas grave. J’ai pu, malgré la fusillade qui nous entoure, faire entrer quelques soldats canadiens qui ont emmené le cher blessé à l’ambulance. Le général vient à l’instant de nous dire que la balle a été heureusement extraite et que la guérison ne sera pas longue.\n\nL’armée canadienne a le dessus. Nos gens se sont retirés en grande partie sur la rive opposée de la Saskatchewan ; une bande seulement tient encore dans un ravin tout près d’ici, en sorte que nous sommes maintenant hors de danger et en liberté. J’en profite pour vous rassurer par cette lettre. Les religieuses se portent bien.\n\n(Missions catholiques.) FOURMOND, O. M. I.\n\nLETTRE DU R. P. PROVOST AU T. R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Raphaël du lac Froid, 19 juin 1885.\n\nMON TRÈS RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nIl y a déjà longtemps que j’aurais dû vous écrire. J’étais en train de le faire à Montréal lorsque l’ordre m’arriva de suivre le 65e bataillon comme aumônier dans l’expédition du Nord-Ouest.\n\nNos Pères ou les journaux vous ont appris que nous avions laissé Montréal le 4 avril pour arriver à Winnipeg le 10 et à Calgary le 12. Dans ces différentes missions, j’ai rencontré la plupart de nos Pères, et j’y ai éprouvé d’une manière bien sensible le bonheur d’appartenir à une famille religieuse. De Calgary à Edmonton, j’ai rencontré les RR. PP. SCOLLEN et GABILLON ; à Edmonton, le R. P. GRANDIN. J’ai visité la belle mission de Mgr GRANDIN", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007724.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1589, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1538, 1], [1538, 3413, 2], [3413, 4998, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]