[{"id": "c393e8aa0ce8951be4e3b3297baa6b3144ea3300", "text": "ce jour solennel, tous, prêtres et fidèles accourent à l'envi autour de ce pasteur si bon, pour célébrer son jubilé épiscopal et demander à Dieu de le conserver de longues années encore à la religion et à notre amour.\n\n« Pour nous, Très Saint-Père, religieux Oblats, et prêtres séculiers, nous nous prosternons humblement aux pieds de Votre Sainteté, La priant de nous bénir, ainsi que nos Missions, pour que nous soyons de dignes ouvriers apostoliques et de saints religieux.\n\n« Nous sommes, Très Saint-Père, de Votre Sainteté, avec le plus profond respect, les très humbles et très dévoués fils. »\n\n(Suivent les signatures.)\n\nOutre cette adresse au Souverain Pontife, nous en rédigeâmes une autre destinée à Votre Paternité. C'était un besoin de notre cœur, un devoir de piété filiale, qu'il nous a été bien doux de remplir¹.\n\nAgréz, Révérendissime et bien-aimé Père, l'expression bien sincère de ma respectueuse et toute filiale affection.\n\nH. Leduc, O. M. I.\n\nLETTRE DU R. P. FOURMOND.\n\nSaint-Laurent, Saskatchewan, le 26 décembre 1885.\n\nTrès révérend et bien-aimé Père,\n\nHier, nos métis ont célébré avec piété la fête de Noël. On lisait sur leurs visages la foi et la simplicité des bergers de Bethléem. Je puis dire qu'ils en ont aussi la pauvreté. En effet, depuis la disparition du buffaloo, leur misère devient de jour en jour plus grande. L'agriculture, qui, seule, pourrait les indemniser des ressources que\n\n¹ Cette adresse a paru dans le numéro précédent des Annales.\n\n(Note de la Rédaction.)\nleur refuse la prairie, n'a pour eux aucun attrait. Ils y sont inexpérimentés, et, du reste, ceux qui, parmi les colons anglais, réussissent le mieux, éprouvent eux-mêmes en ce moment une grande gêne, parce que le commerce languit et parce qu'ils n'ont pas de débouchés pour les produits de leurs terres. On se découragerait facilement si l'on écoutait les réclamations de la nature qui souffre, mais nous nous garderons bien de nous laisser aller à ce mauvais sentiment.\n\nL'année qui s'achève a été pour nous une année de grâces, et l'envoi que vous nous avez fait, dans la personne du R. P. Soullier, d'un visiteur si bon religieux, si dévoué à notre chère congrégation et si capable de nous la faire aimer, nous a dédommagés de nos peines. Pourquoi ces visites ne sont-elles pas plus fréquentes? Elles nous retrempent et nous font vivre dans une atmosphère de piété, de vie fraternelle qui renouvelle nos forces au sein de la solitude.\n\nLe jour de la fête de saint Pierre, si je m'en souviens bien, Mgr Grandin nous arrivait à l'improviste. Il arrivait seul, à pied, tout couvert de sueur et de poussière. Un de ces accidents, si fréquents dans nos pays, la rupture d'un timon de voiture dans un marais où les chevaux s'étaient embourbés, l'avait obligé à venir pédestrement à la Mission chercher du secours pour ses compagnons de voyage restés en détresse à quelques milles de là. Lui seul connaissait la route et pouvait s'aventurer ainsi à la découverte. Grâce à lui, nos autres honorables visiteurs arrivèrent un peu plus tard. C'étaient : les RR. PP. Soullier et Tabaret, et les Sœurs, Fidèles Compagnes de Jésus. Oh! quel bonheur de voir nos bons Pères! Quel accueil! Quelles effusions réciproques de charité fraternelle au milieu de ce désert où nous vivons éloignés les uns des autres!\nNos visiteurs voulaient entrer immédiatement à l'église. Je lisais sur leurs physionomies l'impression d'étonnement mêlé de tristesse que leur causait la vue de la maison de Dieu, si pauvre et si misérable. Ils semblaient, à la vue de cette construction toute faite de gros pins superposés, vouloir s'écrier avec le roi Salomon : Est-il croyable que notre Dieu daigne habiter ici ! Ergone credibile est ut habitet Deus cum hominibus super terram ! Nous eûmes un salut solennel. Tout le monde chantait, mais l'émotion faisait trembler les voix, et des gens difficiles trouvèrent que nous ne chantions pas d'accord.\n\nAprès la bénédiction ce fut un feu croisé de questions et de réponses. Nous parlions de vous, mon bien-aimé Père, de tous les nôtres de la France. Ah ! qu'il fait bon vivre en communauté et rencontrer des Frères quand on vit si isolé ! C'était bien pour moi l'Ecce quam bonum et quam jucundum.\n\nOutre notre évêque vénéré, Mgr Grandin, et nos honorables visiteurs, nous avons parmi nous le vénérable supérieur de Saint-Laurent, le R. P. André, fondateur des Missions de ce district. Tout le monde l'aime : catholiques et protestants ; il a gagné tous les cœurs. Il réside habituellement dans la ville naissante de Prince-Albert, au sein d'une population presque en entier composée d'Anglais et de protestants dont il fait ce qu'il veut. Avec lui étaient : les PP. Végréville et Moulin, deux vétérans de nos Missions du Nord-Ouest, qui ont déjà vu trente hivers canadiens passer sur leurs têtes. Que de combats livrés à la nature et à l'ennemi des âmes par ces vaillants apôtres ! Le bon F. Paquette, qui, depuis bien des années aussi, se dévoue dans nos Missions, était aussi présent et représentait nos bons Frères dont le concours nous est partout si précieux.\n\nMais ce n'était pas là tout le personnel apostolique\narrivé à Saint-Laurent avec Mgr Grandin. Les Sœurs, Fidèles Compagnes de Jésus, faisaient leur entrée sur notre territoire. venues de France, sans crainte des fatigues d'une longue traversée et de pénibles voyages, ces saintes religieuses, désireuses de sacrifices et de dévouement, arrivaient parmi nous pour être les anges gardiens et les mères des pauvres enfants de nos Missions. Renonçant à la mère patrie et à ses aises, elles acceptaient la perspective des plus rudes privations au milieu de nos glaces pour exercer leur ministère de charité. Ces dignes filles de Mme d'Houet nous donnent un grand exemple de désintéressement et de confiance en la sainte Providence.\n\nQuatre d'entre elles étaient destinées à notre Mission de Saint-Laurent et quatre à celle de Prince-Albert. Mgr Grandin a bien voulu les installer lui-même avec une grande solennité dans ces deux postes. Le premier de ces deux couvents est sous la protection de sainte Anne, patronne de la Bretagne, où ces saintes âmes ont leur maison de noviciat.\n\nL'école de Saint-Laurent, à peine terminée, fut bénite par S. G. Mgr Grandin, avec toutes les cérémonies du Rituel. Il y eut même procession, chants et prières solennelles. Mais la bénédiction du pontife ne tomba pas que sur les murs; elle descendit aussi sur le mobilier de l'école, et le crucifix, qui, nous dit-on, est parfois en France l'objet d'indignes profanations, fut béni avec une solennité émouvante et reçut les hommages de tous. Monseigneur adressa aux religieuses un touchant discours, empreint d'une éloquence du cœur dont nous fûmes tous attendris. Son allocution peut se résumer dans cette phrase : Vous êtes venues de bien loin, mes Filles, en ces contrées glaciales et sauvages, attirées par le seul désir des privations et par l'espérance de vous dévouer davantage. Si le cœur de Jésus vous a choisies entre\ntant d'autres, c'est que, portant son nom et étant les fidèles compagnes de sa vie, vous l'avez plus aimé, et que vous avez voulu lui faire cortège partout où il va. Lui aussi il vous a aimées plus que beaucoup d'autres, en vous destinant à ces pénibles Missions; c'est cet amour mutuel, source de toute force et de toute consolation qui vous soutiendra dans l'avenir dans l'œuvre pénible que vous entreprenez aujourd'hui: Fortis ut mors dilectio.\n\nNos bonnes Religieuses, depuis quelques mois à peine qu'elles sont parmi nous, ont déjà fait des merveilles. La pieuse tierciale canadienne qui les avait précédées, Mme Dorval, avait sans doute préparé les voies, mais tout son dévouement n'avait pu réussir à faire tomber tous les préjugés contre les Sœurs. Aussi les commencements furent-ils un douloureux temps d'épreuve pour ces dernières. Les enfants, malgré nos instances, ne venaient que peu ou point à l'école. On craignit même un moment de ne pas atteindre la moyenne de quinze, exigée par le gouvernement comme condition du secours qu'il accorde. Les révérendes Mères avaient beau multiplier les industries et faire déborder la mesure de la bonté, on se tenait à distance. À ces difficultés, nées du préjugé et de la nouveauté, se joignait, pour plusieurs, celle du passage de la rivière Saskatchewan; un grand nombre de familles sont séparées de nous par cet obstacle naturel, et il n'est pas toujours facile de passer d'une rive à l'autre.\n\nEnfin, je puis le dire : après des essais pénibles, la charité devait l'emporter. Les Mères se firent si aimables, si douces, si admirablement patientes, que toutes les objections tombèrent et tous les préjugés disparurent. Elles ont conquis les cœurs des enfants et gagné l'esprit des parents. Plus rien n'arrête, et la Saskatchewan a beau rouler des flots courroucés, on n'hésite plus à tenter chaque jour le passage. Une grande chaloupe est mise à\nla disposition des enfants, et il se trouve toujours quelqu'un à point nommé pour les faire passer d'une rive à l'autre, soit le matin, soit le soir. Un jour, un petit jeune homme de treize ans, sans expérience, se trouva seul près de la chaloupe à l'heure du passage. Pour ne pas manquer l'école, on fit la traversée sous sa direction, et, malgré un temps épouvantable, et une fière peur de la part des petites filles, dont une se trouva mal de saisissement, on arriva sans naufrage, et la classe ne fut pas manquée. C'est assez vous dire quel a été, à la longue, le succès des Sœurs. Une cinquantaine d'enfants se sont déjà fait inscrire. L'œuvre paraît bénie de Dieu, et les fidèles compagnes de Jésus deviendront et sont déjà les meilleurs auxiliaires du Missionnaire.\n\nL'année 1883, qui nous a apporté tant de grâces : la visite des RR. PP. Soullier et Tabaret, l'arrivée et l'installation des Religieuses et les noces d'argent de notre bon et saint évêque, ne s'effacera pas de nos mémoires.\n\nAgréz, mon très révérend et bien-aimé Père, le profond respect de votre enfant bien affectionné et bien obéissant en N.-S. et M. I.,\n\nJ.-V. Fourmond, O. M. I.\n\nLETTRE DU R. P. VANTIGHEM AU R. P. LEDUC.\n\nMac-Leod, le 11 novembre 1883.\n\nMON RÉVÉREND PÈRE LEDUC,\n\nVous me pardonnerez, je l'espère, mon trop long silence, car c'est à peine si je respire enfin un peu, après des voyages sans bout, pour ainsi dire. Me voilà enfin là où l'on veut que je sois, pour quelque temps du moins. Je suis ici dans un local appartenant aux Sœurs ; c'est", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009626.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 3181, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1506, 1], [1506, 3303, 2], [3303, 5134, 3], [5134, 6987, 4], [6987, 8889, 5], [8889, 10426, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]