[{"id": "c8404f12ff70985e423e366f39b8ed0c4249c8b1", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÈE\n\nN° 88. — Décembre 1884.\n\nMISSIONS ÉTRANGÈRES\n\nVICARIAT DE SAINT-ALBERT.\n\nLETTRE DU P. CLAUDE AU R. P. SOULLIER.\n\nCalgary, le 25 août 1884.\n\nMON RÉVÉREND PÈRE,\n\nLe R. P. LACOMBE vous ayant annoncé un rapport sur nos Missions, je m’empresse de satisfaire son désir, qui est pour moi un ordre.\n\nIl y a un peu plus de deux ans que je fus envoyé dans cette Mission pour prendre la place des RR. PP. LEGAL et DOUCET, qui devaient aller déployer leur zèle chez les Pieds-Noirs, Gens-du-Sang et Piéganes, dont les réserves sont situées à une centaine de milles au sud de Calgary. J’avais à m’occuper ici de la population métisse crise, assez considérable alors, et des quelques Canadiens fixés dans cette place.\n\nT. xxii.\nCe qu'on appelait le Fort Calgary était un petit groupe composé des maisons de la police montée, du magasin sans importance de la Compagnie de la baie d'Hudson, du magasin d'approvisionnements de la place appartenant à la Compagnie Baker, et de quelques maisons de colons ou métis disséminées çà et là sur les buttes ou dans les bas-fonds de la prairie. La Mission se trouvait à un mille du Fort de la police montée et de la rencontre de la rivière du Coude avec la rivière des Arcs, dans la direction du Nord-Est au Sud-Ouest, sur le bord de la rivière du Coude, en face d'une jolie prairie qui s'étend sur la rive opposée. Cette prairie est couronnée de hauteurs ornées de sapins, et le tout forme, sans contredit, un des plus beaux sites de Calgary. La Mission était bien pauvre alors. Vous l'avez vue, mon Révérend Père, cette pauvre maisonnette de pièces rondes à peine enchevêtrées les unes dans les autres, donnant jour à tous les vents, la plus modeste assurément de toute la place, encore qu'elle eût reçu bien des améliorations à l'arrivée du R. P. Lacombe. Ajoutez-y un petit champ et quelques chevaux et vous aurez une idée de notre richesse.\n\nJusque-là le pays était sans avenir. Bientôt le bruit courut que le projet de concession de la ligne du Pacifique canadien par Battleford et Edmonton était abandonné. Dès lors on conçut l'espérance de voir le chemin de fer traverser nos prairies et donner à Calgary une chance de développement. Cette espérance ne tarda pas à se changer en certitude. Bientôt en effet les campements d'ouvriers vinrent s'échelonner de mille en mille. Les travailleurs n'avaient fait que passer, semblait-il, et déjà la ligne était prête à recevoir les rails, et chaque jour la locomotive approchait de 4 ou 5 milles. Il y a de cela juste un an, et bien que la ligne ait exigé de gros travaux à partir de Calgary, les trains se rendent\ndéjà plusieurs fois par semaine jusqu'à 160 milles plus loin.\n\nJe vous ai parlé de ces chantiers d'ouvriers que l'on compte par centaines et dont les nombreuses et larges tentes forment comme une multitude de villages échelonnés sur la ligne. Pour approvisionner ces camps, il a fallu en créer d'autres destinés aux commerçants et aux spéculateurs de toutes sortes. Ils s'établissent momentanément partout où ils espèrent faire du profit. Calgary devait nécessairement attirer l'attention de ces marchands nomades ; là on trouverait, en effet, une petite clientèle ; aussi vit-on s'élever plus de cinquante tentes dans l'espace de huit jours, et peu après quelques maisons. La locomotive traversa la rivière, et l'on vit arriver du Canada, et même de l'Europe, des visiteurs distingués venus pour examiner cette place si agréablement située au pied des montagnes Rocheuses et si favorable à la colonisation. Ils ne firent que passer, mais après eux arrivèrent bientôt des industriels et des colons résolus à se fixer dans le pays. Telle est l'histoire du développement de notre place. Ce n'est plus une modeste ville de toile, mais un bon commencement de ville qui occupe 1 mille de parcours avec plusieurs rues garnies de maisons d'assez belle apparence.\n\nVoilà un long préambule, mon Révérend Père, mais il était nécessaire pour donner aux lecteurs de nos Annales l'idée du surcroit de travail que ce mouvement de colonisation nous apporta. J'étais alors seul à la Mission, car le R. P. Lacombe mettait à profit sa présence au milieu des sauvages pour évangéliser les pauvres infidèles et en même temps composer un dictionnaire français-pied-noir, lequel sera d'une grande utilité aux prêtres employés à l'évangélisation de cette tribu. Je ne parlais pas encore anglais, je dus donc mettre de côté les langues sauvages\npour me rendre utile aux populations nouvelles qui nous arrivaient, m'occuper de la Mission, où j'avais jusqu'à quatre catéchismes par jour et une école à faire, sans compter deux classes de philosophie, la visite aux camps d'ouvriers et aux tentes des nouveaux colons, tentes qui surgissaient de partout. Je ne suffisais plus à la besogne; il fallut que le R. P. Rémas vint ici prendre la conduite de la population métisse, tandis que, de mon côté, je m'appliquais à l'étude de la langue anglaise et visitais les postes de blancs établis dans le pays et des camps plus éloignés dans les montagnes, jusqu'à 270 milles Est de Calgary. Là, on compte plusieurs établissements qui ont une population catholique plus ou moins considérable. Ce fut mon travail jusqu'à la précieuse mais trop courte visite que vous fites à notre Mission de Calgary.\n\nVotre départ précipité, rendu malheureusement nécessaire par l'état de votre santé, nous privait aussi de la présence de notre cher Père Supérieur. Il ne devait nous revenir qu'en juin, après une mission très fructueuse auprès du gouvernement canadien en faveur de nos œuvres.\n\nEntre votre départ et le retour du Père Supérieur j'eus à m'occuper de mes différents postes de Maple-Creek, au sommet des montagnes Rocheuses, sur un parcours de 410 milles, sans négliger toutefois ma petite Paroisse. Vous avez appris sans doute, en Canada, le pénible ministère que je dus remplir auprès d'un pauvre nègre que la crainte d'être dénoncé à la police, pour un vol, porta à commettre un horrible assassinat. Après avoir reçu son abjuration et l'avoir préparé à la mort, je l'accompagnai à l'échafaud le 29 mars dernier. Depuis lors je fus presque continuellement en mission sur les stations du chemin de fer jusqu'à l'arrivée du R. P. Lacombe.\nInutile de vous dire avec quelle joie ce bon Père fut accueilli après une si longue absence. Que de choses à se dire de part et d'autre! Il fallait bien que tous se ressentissent de notre bonheur. Les Pères des autres Missions attendaient avec impatience, eux aussi, le retour de notre bien affectionné Supérieur. Le Révérend Père lui-même désirait ardemment se retrouver au sein de sa petite famille réunie. Il avait donc tout prévu pour appeler ici les PP. DOUCET, LEGAL et VANTIGHEM. Un jeune Père, le P. DESRACHES, et quelques Frères venus du Canada avec le R. P. LACOMBE grossissaient un peu notre nombre. Nous pouvions goûter pendant quelques jours les bienfaits de la vie de famille, joie délicieuse dont nous nous trouvons si souvent privés en mission.\n\nLe temps était venu pour chacun de retourner à sa Mission. Je partis le premier pour reprendre mon ministère de l'année dernière dans les campements d'ouvriers, espacés sur une zone de plus de 60 milles. Pour me rendre jusqu'aux premiers tout alla bien, grâce à la vapeur qui m'emportait à toute vitesse jusqu'au sommet des montagnes. Je me délectais à traverser sans obstacle ces marais où je m'étais embourbé l'automne précédent; ces collines que j'avais gravies si péniblement, ma chapelle sur le dos; ces vallons, dont la rapide descente m'avait valu plus d'une chute; ces pics élevés qui m'avaient si audacieusement menacé de la chute de pierres énormes; ces beaux gazon qui m'avaient servi de matelas quand le ciel d'automne déployait sur mes membres engourdis une blanche couverture de neige; ces lieux autrefois déserts, aujourd'hui témoins des progrès de la civilisation; ces anciennes places de campement où j'avais essuyé de rudes affronts et aussi vu plusieurs merveilles de la grâce. Mais le passé devait avoir son retour et tout me disait que mes souffrances n'étaient\nsuspendues que momentanément. Je me résignais d'avance, et avec bonheur, en pensant que les grâces de salut doivent coûter au missionnaire une pleine mesure d'épreuves. J'avais à en goûter déjà les premières amertumes, car au beau temps avait succédé, à moitié chemin, une pluie torrentielle dont je devais désormais recevoir, chaque jour et quelquefois la nuit, dans de pauvres campements, les glaciales averses.\n\nLa locomotive crie et s'arrête. La lisse de fer manque sous ses pas et son orgueil doit réprimer ses bouillantes ardeurs en présence des austères et imposantes beautés du lac Kicking-horse (cheval qui rue).\n\nC'est ici mon champ de bataille. Adieu donc, chars rapides porteurs de la civilisation ! Chapelle au dos, bagages sous le bras, il me faut aller en avant et livrer au démon le premier combat pour lui disputer, au nom du Sauveur, l'empire des âmes. Ministère difficile entre tous que ces missions d'un nouveau genre ! Voyez-vous le prêtre armé de la croix gravir péniblement les raboteux sentiers de la montagne, tantôt se frayant un passage au milieu des rochers que les ans détachèrent des plus hautes cimes pour combler la vallée, tantôt passant d'un abîme dans un autre, n'ayant pour pont qu'un tronc d'arbre, une corde pour garde-fou et sous les pieds des profondeurs que l'œil n'ose sonder. Ailleurs, il trouvera un chemin coupé dans le roc ; mais alors d'autres dangers l'attendent : à défaut de vallée, le sentier se déroule au flanc d'une montagne, tandis que les explosions de la mine couvrent le flanc de la montagne opposée d'une grêle de pierres de toute grosseur, qui causent chaque jour des accidents, tuant, blessant, brisant tout, hommes, chevaux et voitures. C'est au milieu de ces dangers que le missionnaire va d'un camp à l'autre, demandant à Dieu le retour des brebis égarées et se tenant\nprêt à porter partout aux blessés et aux mourants les dernières chances du salut.\n\nMais au camp où il arrive trouvera-t-il au moins un accueil sympathique ? C'est souvent un pêle-mêle de religieux et de nationalités diverses. S'insinuer dans les bonnes grâces du patron afin de se ménager une entrevue avec les ouvriers, se faire tout à tous pour connaître les fidèles du troupeau, les grouper autour du pasteur, leur distribuer le pain de la parole divine, les préparer par une bonne confession à la communion du lendemain, c'est un travail difficile, qui exige du missionnaire autant de délicatesse que de zèle, et, des hommes, le courage de s'avouer chrétiens et catholiques en face de compagnons qui ne partagent pas leur croyance.\n\nJ'étais un soir occupé à entendre les confessions dans un camp. Au fur et à mesure que mes pénitents rentraient dans la grande tente qui leur servait de commun dortoir, un groupe d'impies les accueillaient de leurs sarcasmes : « Ils peuvent aller aux mines maintenant, disaient-ils, ils sont all right (en règle), les pierres ne les toucheront plus. » Eh bien ! ils sont allés aux mines, mes catholiques qui ont tous bien professé leur foi dans ce camp, ils y sont allés le lendemain et les jours suivants, et les pierres ne les ont point atteints, tandis que deux de ces plaisants railleurs furent peu de jours après mis en pièces par la dynamite. A peine put-on recueillir une partie de leurs membres pour les ensevelir. Plût à Dieu qu'ils eussent été prêts, eux aussi !\n\nAprès avoir confessé une partie de la nuit, le missionnaire rassemble de nouveau son monde de grand matin, avant la reprise des travaux ; il dit la messe sous une tente ou dans un local qu'il s'est procuré dès la veille, et après quelques mots d'encouragement et de persévérance, il laisse les hommes se rendre à leur\ntravail. Pour lui, il reprend le chemin de la montagne et se dirige vers un autre camp où l'attendent d'autres âmes et d'autres difficultés.\n\nQue de fois il arrive au missionnaire fatigué d'une course rendue très pénible par des obstacles et des dangers de toute nature, de se présenter, sans le savoir, dans un camp d'orangistes ou de mormons. Ces gens-là abondent, en effet, sur cette ligne. La réception, croyez-le bien, n'est pas ordinairement des plus enthousiastes, ni l'hospitalité des plus pressées. Mais dans un tel milieu on ne saurait s'en étonner; et, à tout prendre, il est encore plus pénible de rencontrer des catholiques assez lâches pour refuser la grâce de la mission et même pour ne pas se faire connaître pour tels au missionnaire. J'ai vu plus d'une fois cette grâce méconnue, méprisée par les Enfants de Lumière, produire d'admirables fruits de conversion dans des âmes élevées au sein de l'hérésie.\n\nCes missions ne sont pas sans quelque consolation. Elles ont ordinairement pour résultat de toucher quelques cœurs endurcis et de ramener plus d'un vieux pécheur. C'est une compensation surabondante.\n\nTel est, mon Révérend Père, le ministère que j'exerce depuis un an au sein des populations ouvrières du Pacifique Canadien. Cet été surtout a été marqué au coin des épreuves. La santé m'a fait défaut pour quelque temps. Le manque d'air dans les gorges étroites de la montagne, l'humidité, la pluie reçue sur le chemin, la boue dans les camps, le contact journalier avec les malades des hôpitaux et des camps m'ont causé les fièvres de montagne, qui ne sont rien autre chose que la fièvre typhoïde à son moindre degré. Le bruit de ma mort s'est même répandu dans quelques camps.\n\nEnfin, je touchais presque aux derniers de ces camps. Un aimable contracteur m'avait donné un excellent cour-\nsier, sans lequel j’eusse difficilement franchi plusieurs mauvais pas. En escaladant une roche qui obstruait mon passage, je m’aperçus que ma selle glissait sur la croupe du cheval; je voulus m’arrêter, mais forcé d’avancer ou de reculer, le cheval se lança en avant, et ses efforts pour atteindre le sommet de la roche me firent tomber en arrière; au même instant, il ria pour se débarrasser de la sangle qui le génaît et m’atteignit à la tête et en pleine poitrine. Heureusement j’avais alors près de moi quelqu’un qui put me relever et me prodiguer les soins que réclamait mon état; ordinairement je voyage seul, mais je m’étais adjoint cette fois des compagnons pour leur confier ma chapelle et mon bagage. Ce coup dans la poitrine, le seul un peu sérieux, me fit cracher le sang et m’obligea de suspendre mon travail. Ce ne fut qu’au bout de huit jours que je pus reprendre mes missions, et toute douleur est à peu près passée aujourd’hui.\n\nCependant deux mois s’étaient écoulés et je sentais le besoin de venir me retremper au sein de la vie de famille et d’y prendre quelque repos. D’ailleurs mon vin de messe et mes hosties étaient presque épuisés.\n\nJe me disposais à redescendre ou plutôt à remonter sur notre versant, lorsqu’un nouvel accident vint s’ajouter à tant d’autres que nous avions eus cet été. Une locomotive avait déraillé; un homme avait été tué et trente-cinq autres blessés. Je me hâtai donc de me rendre sur le lieu de l’accident pour offrir à ces pauvres gens les secours de la religion; puis je pris place sur l’engin à côté du mécanicien, et j’arrivai à Calgary le 4 août entre onze heures et minuit.\n\nJe ne fus pas peu surpris de me trouver en face d’une nouvelle maison-église. Elle me parut vraiment imposante avec son joli clocher et ses dépendances. J’étais\nattendu avec impatience, je dirai même avec anxiété, car certains voyageurs avaient parlé de mes difficultés; aussi l'accueil fut-il vraiment fraternel de la part de la communauté. Elle n'avait jamais été aussi nombreuse. Elle se composait du R. P. Lacombe, supérieur, du P. Rémas, des FF. Little et Boulet, de M. Lhca, précédemment soldat de la police, aujourd'hui postulant convers, et d'un petit jeune homme que le R. P. Lacombe a amené du collège de l'Assomption, et qui se prépare à devenir Frère convers. Un autre jeune homme nous est arrivé ces jours derniers des montagnes Rocheuses pour faire aussi sa postulance.\n\nToute la communauté s'associe à moi, mon Révérend Père, pour vous remercier une fois de plus du bienfait de votre visite, dont nous nous plaisons à rappeler le souvenir, et pour vous saluer avec la plus respectueuse vénération.\n\nM. Claude, O. M. I.\n\nLe signataire de cette lettre, après l'expédition apostolique qu'il vient de nous raconter, eut une pénible mission à remplir: préparer et assister à la mort un nègre condamné pour meurtre. Après l'avoir instruit et baptisé, après lui avoir fait faire sa première Communion, il eut la consolation de l'accompagner à l'échafaud, sur lequel le pauvre malheureux mourut en pénitent converti et résigné.\n\nDans une lettre adressée à Mgr Grandin, et datée de Calgary du 1er mai 1884, le P. Claude fait le récit suivant:\n\n...La veille de l'exécution, je me rendis de nouveau à la prison pour y dire une messe à laquelle assistèrent plusieurs soldats catholiques. Le condamné communia pour la dernière fois dans les sentiments de la plus\ngrandes prières. À partir de ce moment, je ne le quittai plus, l’exhortant et l’encourageant, priant sans cesse avec lui.\n\nVers onze heures du soir, je l’invitai à prendre son repos ; pour moi, je me retirai à l’écart pour prier. Jusqu’à minuit il ne fit que prier, puis un léger sommeil s’empara de lui ; mais il était toujours agité. Dès le grand matin, je le réveillai ; sa première parole fut une parole de résignation et de fermeté tout à la fois ; nous commencâmes la prière et la préparation à la messe et à la mort. Il priait comme de coutume avec une grande ferveur et n’était préoccupé que de la pensée de se préparer à paraître devant Dieu. Après la messe, nous priâmes jusqu’au déjeuner. Un bon déjeuner ; je crois qu’il a mangé de bon appétit. Vint ensuite la préparation immédiate à la mort, car le moment redoutable pour lui et pour moi approchait ; mais j’avais demandé au bon Dieu la grâce d’être tous les deux inébranlables à ce triste moment. Pendant la préparation à la mort le silence se fit dans la salle des gardes ; le condamné se tourna vers moi : « Mon Père, je crois que c’est le temps », me dit-il. Je lui dis de ne pas s’inquiéter, qu’on l’avertirait. Quelques instants après le shérif arrive et me demande s’il est prêt : « All right », dit-il ; puis, se levant et priant toujours, il se remit à genoux pour recevoir la dernière absolution, car le shérif avait manifesté le désir que je la lui donnasse à la prison plutôt que sur l’échafaud. Il sortit de la cellule dans la salle des gardes où le député-shérif, qui était le bourreau, lui mit le corsage de cuir pour fixer ses mains, qu’il plaça de lui-même dans la position voulue pour être liées ; on lui enleva le boulet. Pendant tout ce temps et pendant toute la marche funèbre, il ne cessait de répéter les prières que je lui suggérais.\nPour un instant, la vue des assistants, qui, du reste, avaient été tenus à distance, l'impressionna un peu, sans cependant le troubler. Il gravit courageusement les marches de l'échafaud, lequel avait été préparé dans une espèce de petite chambre aux murailles plus élevées, afin que le public ne pût rien voir, à l'exception des jurés et de quatre ou cinq autres personnes. De lui-même il se plaça sur la trappe, toujours en priant. Quand le bourreau lui demanda s'il n'avait rien à dire, il se retourna : « Messieurs, dit-il, me voici arrivé à mon dernier moment ; je dois mourir : je reconnais que ma sentence est juste, car le crime que j'ai commis est horrible. Mais je ne crains pas la mort, c'est la troisième fois que je l'affronte, non pas que j'aie commis d'autres crimes ; je n'aurais probablement pas commis celui-ci si je n'avais pas été pris de hoisson ; mais j'ai été soldat, exposé à des dangers ; je n'ai jamais craint la mort, et cette fois-ci je la crains moins que jamais, parce que je n'ai jamais été si bien préparé. Depuis longtemps j'ai fait ma paix avec Dieu, j'espère que je vais au Ciel ; puissé-je y retrouver ma victime ! je le souhaite. Je remercie les officiers, les soldats, qui ont bien pris soin de moi. Je demande pardon à la ville pour le scandale que je lui ai donné ; je pardonne à tous ceux qui m'auraient fait de la peine. Je meurs, croyez-le, content et sans haine. » Puis il se retourna vers moi : « Merci, mon Père, adieu, ne m'oubliez pas. » Il me dit auparavant quelques autres paroles que je ne pus saisir, à cause de mon émotion et du tremblement qui m'agitait. Le bourreau lui mit la corde au cou, lui rabattit le bonnet noir, un coup de hache fit partir la trappe, et l'homme disparut. La chute fut de 7 pieds ; il vécut sept minutes et demie. J'eus le temps de réciter deux fois les prières jusqu'à ce que les convulsions de l'agonie eussent cessé ; cette agonie fut longue\net pénible, car le cou du patient n'avait pas été cassé. Je ne voyais plus clair pour descendre de l'échafaud; je me hâtai de regagner la Mission à travers une foule dont je ne pus reconnaître une seule personne. À peine arrivé, le corps me fut apporté. J'étais seul; je dus l'enterrer moi-même, ce qui m'acheva complètement; pendant deux jours, je fus dans un état de surexcitation qui ne me permit de rien faire : j'avais perdu l'appétit, et je souffrais dans tout mon être.\n\nTel est, Monseigneur, le récit détaillé de ma douloureuse mission.\n\nM. Claude, O. M. I.\n\nOn lit dans le Manitoba du 14 août 1884, sous ce titre : DEUX SERMONS, l'article suivant :\n\nLe 3 du présent mois, dans l'église de la Trinité, à Winnipeg, le révérend Sullivan, évêque anglican d'Algoma, a donné sur l'unité de la foi un sermon que nous trouvons reproduit dans le Free Press du 4 courant.\n\nL'éminent orateur, étranger à la province, est surtout étranger aux rapports sociaux qui unissent à Manitoba les différentes nationalités, quelles que soient leurs dénominations religieuses. Des journaux de Winnipeg, rendant compte de son sermon, ont donné à entendre que sa manière de parler des catholiques n'avait pas satisfait tout le monde, et que ceux mêmes à qui il croyait faire un compliment s'étaient trouvés passablement froissés. En effet, le rang de parias auquel il relègue les catholiques, et le mépris odieux auquel il les voue, ne pouvaient que blesser les protestants bien élevés et bien pensants, accoutumés à n'avoir que de bons rapports avec nous.\n\nQuant à la doctrine de son sermon, nous ne voulons pas entreprendre de la discuter; ce serait trop long pour un article de journal : seulement nous lui dirons en passant que sur le principe de l'unité de la foi, nous sommes parfaitement d'ac-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009628.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 19280, "total-output-tokens": 6745, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 775, 1], [775, 2649, 2], [2649, 4470, 3], [4470, 6249, 4], [6249, 8094, 5], [8094, 9927, 6], [9927, 11756, 7], [11756, 13569, 8], [13569, 15360, 9], [15360, 16964, 10], [16964, 18786, 11], [18786, 20710, 12], [20710, 22494, 13]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]