[{"id": "904d3849619b205ea5f40963cb43ca667a076a60", "text": "MISSION DE SAINT-JEAN-BAPTISTE.\n\nLETTRE DU R. P. CAER AU TRÈS-RÉVÉRENDE PÈRE\nSUPERIEUR GÉNÉRAL.\n\nMission de Saint-Jean-Baptiste, île à la Croase\n1er janvier 1866.\n\n« MON TRÈS-RÉVÉRENDE ET BIEN-AIMÉ PÈRE,\n\n« Pour répondre à un désir exprimé par le R. P. Vandenbergh, j'adresse à votre paternité un rapport simple et rapide des travaux que j'ai accomplis depuis mon arrivée dans ces missions lointaines, où l'obéissance m'a envoyé, et particulièrement depuis mon départ de Saint-Albert.\n\n« Il y a eu six ans le 9 avril dernier que je quittais le grand séminaire de Marseille pour aller trouver Mgr Grandin, qui se disposait alors à reprendre la route de l'immense diocèse de Saint-Boniface. Nous étions un heureux voyage, et après quelques jours de repos à Saint-Boniface, l'obéissance m'envoya aux missions de l'Ouest, où j'ai passé cinq ans et demi sous la direction du R. P. Lacombe, au lac Saint-Anne, à Saint-Albert, et au fort Edmonton. J'ai eu à exercer le saint ministère tantôt auprès de Canadiens, d'Irlandais et de métis, tantôt auprès des nombreuses tribus sauvages qui sont répandues sur les bords de la Saskatchewan, et dans les immenses plaines qui s'étendent à l'ouest jusqu'aux montagnes Rocheuses, et au sud jusqu'au Missouri. Le P. Lacombe n'aura pas man-\nqué de vous faire connaitre la dégradation morale, l'ignorance et les besoins extrêmes de plusieurs milliers d'Indiens qui habitent ces contrées. Jusqu'ici ils n'ont pas eu de prêtres, n'ont aucun secours religieux et sont menacés d'être séduits par les ministres protestants, à moins que nous ne puissions bientôt nous établir au milieu d'eux. Je n'ai pu voir, dans les divers voyages que j'ai entrepris jusqu'ici, qu'un petit nombre de ces sauvages. Nous aurons peut-être encore longtemps la douleur de ne pouvoir les arracher à leur grossière idolâtrie.\n\n« L'hiver dernier nous avons eu le bonheur de recevoir la visite du R. P. Vandenberghe, envoyé au milieu de nous comme visiteur extraordinaire. Sur son ordre, je dus abandonner ma chère mission du lac Saint-Anne, pour aller rejoindre à Saint-Jean-Baptiste de l'île à la Crosse Mgr Grandin, avec qui je devais résider. J'ai fait pour cela un voyage, de vingt jours. Dans ce voyage, j'ai passé douze jours dans un méchant canot, où je n'avais qu'un seul compagnon de route, auquel la rivière très-dangereuse et pleine de rapides, sur laquelle nous dirigions notre frêle embarcation, était inconnue aussi bien qu'à moi. Nous arrivâmes cependant au terme de notre voyage, et j'eus le bonheur de trouver à l'île à la Crosse, quand j'y débarquais, notre cher et vénéré seigneur de Satala. Combien ma joie de le revoir était grande !\n\n« Dès le lendemain, je visitais la mission et ses alentours. J'ai trouvé le site de cette maison vraiment magnifique ; on pourrait y avoir une très-belle résidence. Ce qui m'a causé le plus de surprise, c'a été de trouver à l'île à la Crosse une école composée de trente enfants métis et sauvages, bien propres, bien polis, parlant aussi bien le français que de jeunes écoliers de notre beau pays. La mission gagne à cela une considération et un certain air de civilisation que je n'avais rencontré en aucune autre,\ndepuis mon départ de Saint-Boniface. Mais aussi que de peines et d'embarras pour la pieuse sœur, aux soins de laquelle l'école est confiée ! De quelle patience n'a-t-elle pas besoin !\n\n« Je trouve admirable et vraiment héroïque le dévouement de cette bonne sœur qui use ses forces, consacre sa vie à l'éducation de petits enfants qui, lorsqu'ils lui sont confiés, sont rebutants sous tous les rapports.\n\nCette école, qui produit de si heureux résultats, est à la charge de la mission, qui ne peut la soutenir qu'à force de privations et de sacrifices. Aussi, que je voudrais voir, témoins de nos travaux et de nos fatigues, quelques-uns de ces riches et généreux chrétiens qui abondent en France ! Ils verraient un évêque accablé, non sous le poids des années, mais sous celui d'infirmités précoces, se livrer à tous les travaux les plus durs et les plus repoussants, afin de soutenir les diverses œuvres de la mission, et de la faire prospérer d'avantage. Ils le verraient, à tous les instants qui ne sont pas consacrés à ses exercices religieux ou au saint ministère, occupé à arracher de la terre les racines, les pommes de terre, à défricher quelque champ inculte, à couper du bois, ramasser du foin ; ils le verraient aider à battre le blé, etc. Sans doute nous nous faisons un devoir et un bonheur de le seconder autant que nous le pouvons, mais, malgré nos efforts, sa part demeure toujours pénible ; nous aurons beau nous multiplier tous, Frères, Sœurs et Pères, la tâche de l'Évêque demeure rude et fatigante.\n\n— Mais pourquoi, me direz-vous peut-être, vous livrer à ces sortes de travaux qui ne sont point faits pour vous ? Pourquoi ne pas consacrer aux études, aux voyages nécessaires, au ministère sacré, une vie si précieuse dans les contrées où les prêtres sont si rares et les secours religieux si peu abondants ? — Personne, hélas ! ne regrette plus que nous d'être obligés à cultiver la terre, et à entre-\nprendre les divers travaux dont je viens de parler; mais il nous faut vivre, il nous faut soutenir la mission, il serait trop pénible de laisser tomber une école qui en fait la gloire et l'espérance. Voilà pourquoi, malgré la répugnance que des Missionnaires ne peuvent manquer de ressentir pour les occupations dont je parlais tout à l'heure, nous nous livrons aux travaux pénibles de la culture de la terre et de la construction des bâtiments, lorsque les circonstances le demandent. Il est des sacrifices plus lourds, des privations plus dures, auxquels notre pauvreté nous oblige souvent à nous soumettre.\n\n«Ainsi, depuis quatre mois je suis seul, à cinquante lieues de Mgr Grandin, que j'ai laissé dans un isolement semblable à celui dans lequel je me trouve. Avant-hier il m'écrivait : « Mon cher Père, j'éprouve un véritable besoin de vous voir pour vous consulter sur les affaires de la mission; je ne saurais vous dire combien je désire vous voir avant le départ des lettres, mais le voyage est si long, si coûteux, et nos finances sont dans un si triste état que je crois devoir me priver de la consolation que j'aurais à vous voir venir ici. »\n\n« Je m'aperçois que je me laisse trop entraîner à ces réflexions. Je reviens à mon sujet : Trois semaines après mon arrivée à l'île à la Crosse, les sauvages commencèrent à y arriver pour prendre part aux exercices religieux de la mission d'automne. Les sauvages qui viennent assister à ces exercices sont des Cris et des Montagnais. Les Cris se montrèrent très-heureux de me voir, parce que je connais assez bien leur langue, et c'est surtout pour cette raison que j'ai été envoyé ici.\n\n« Comme il n'y avait point, depuis quelque temps, de Père qui les compriit très-bien, ils n'auraient pas tardé à se décourager, et à ne point venir à la mission, et ils auraient fini peut-être par abandonner la prière. Pendant tout\nle temps que dura la mission, je ne m'occupai guère que d'eux ; je connaissais peu les Montagnais ; d'ailleurs les Cris réclamaient tout mon temps. Je leur disais la sainte messe, pendant laquelle ils chantaient des cantiques, et leur faisais chaque jour trois instructions. J'ai trouvé chez tous ces sauvages beaucoup de bonne volonté ; ils ont été très-assidus aux exercices de la mission. Plusieurs d'entre eux ont manifesté le désir de confier à nos Sœurs l'éducation de leurs enfants, mais notre pauvreté est malheureusement si grande, que nous n'avons pu accepter leur offre, quoique féconde en heureux résultats pour la religion. La mission fut clôturée par la procession ordinaire du saint sacrement, qui se fit avec un ordre et un ensemble que je n'attendais pas de nos pauvres sauvages. On se rendit processionnellement à la croix de mission, au pied de laquelle nos industrieuses Sœurs avaient établi un autel, où l'on ne voyait briller ni l'or ni l'argent ; mais qui, cependant, était beau, et présentait des formes agréables. À la suite de la belle croix de mission, qui était portée en tête de la procession, s'avançaient deux à deux les jeunes filles de l'école, toutes vêtues en blanc, et tenant à leur main les nombreux rubans qui ornaient les oriflammes et les bannières. J'étais vraiment surpris de voir tous nos Indiens marcher à la suite dans l'ordre le plus parfait, faisant retentir dans les airs leurs cantiques si pieux et si touchants ; j'ai la confiance que Notre-Seigneur, en l'honneur duquel ils les chantaient, aura baissé sur eux un regard de bonté et les aura comblés des grâces qui leur sont nécessaires. Je goûtais un vrai bonheur à contempler ce spectacle consolant. Il est beau, en effet, de voir une procession comme celle à laquelle j'assistais, au milieu de ces vastes déserts où, il y a quelques années à peine, personne ne connaissait le christianisme. C'est là le fruit de bien des travaux, de bien des tribulations. C'est\nle fruit également de l'œuvre admirable de la propagation de la foi qui, par les secours qu'elle nous accorde, soutient toutes nos missions. Que ne peut-elle faire pour nous encore davantage ! Si nos ressources étaient plus grandes, le bien que nous ferions serait aussi beaucoup plus considérable. Nos bonnes Sœurs possèdent toute la confiance de nos Indiens, aussi verrions-nous bientôt tripler le nombre des enfants que nous élevons, s'il nous était donné de pouvoir les nourrir. Notre extrême pauvreté nous impose le dur sacrifice de ne pouvoir admettre qu'une faible partie de ceux que les parents nous offrent. De toutes les missions de ce pays, celle de l'île à la Crosse est, sans contredit, celle qui jusqu'à ce jour a obtenu le plus de succès. Sous ce rapport, Dieu l'a visiblement béni.\n\n« Durant le temps des exercices religieux dont je viens de parler, nous reçûmes de tristes nouvelles d'un poste que nous desservons et qui est appelé le portage de la Loche. On nous apprit qu'une épidémie y sévissait, et qu'un grand nombre de sauvages y mourraient, privés des sacrements, puisqu'ils n'avaient auprès d'eux aucun prêtre. C'en fut assez pour décider Mgr Grandin à m'y envoyer. Je partis avant même que la mission fût entièrement achevée, et arrivai après six jours de marche à ce poste, qui se trouve à la hauteur des terres qui séparent le bassin d'Attabaskaw de celui de la rivière aux Anglais. Il y a au portage à la Loche un petit poste de la compagnie de la baie d'Hudson, fréquenté par une cinquantaine de familles montagnaises, et quatre ou cinq familles crises.\n\n« En arrivant à ce poste, je trouvais les sauvages dans la plus grande consternation. Tous avaient à pleurer quelques membres de leurs familles. Il y a des parents qui ont perdu quatre et cinq enfants. Je m'empressai de confesser les sauvages malades ; plusieurs ne tardèrent pas à mou-\nPauvres sauvages ! quelle dure épreuve, pour ceux-là surtout qui n'ont pu, à leur lit de mort, être assistés par le prêtre! Hélas ! leur nombre a été grand. Cinquante-neuf sont morts en implorant à grands cris, mais vainement, le secours du Missionnaire. Je n'ai pu m'empêcher de pleurer en apprenant ces détails de la bouche des Indiens eux-mêmes ; malgré moi, je reportais alors ma pensée vers la France, ma patrie, où les secours religieux ne manquent pas, puisqu'elle a le bonheur de posséder un nombreux clergé.\n\n« J. N. CAER, O. E. I., »\n\nPrêtre missionnaire.\n\n(La fin au prochain numéro.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009551.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11900, "total-output-tokens": 3455, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1273, 1], [1273, 3175, 2], [3175, 5098, 3], [5098, 6974, 4], [6974, 8939, 5], [8939, 10811, 6], [10811, 11407, 7], [11407, 11407, 8]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]