[{"id": "7b0ec938e0722c4272696d1a281e374b1f696393", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÉE\n\nN° 39 et 40. — Septembre et décembre 1872.\n\nMISSIONS DE SAINT-ALBERT.\n\nLETTRE DU R. P. FOURMOND\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission du lac Sainte-Anne, le 26 décembre 1870.\n\nTRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nPour me conformer à l'avis que m'a donné Mgr GRANDIN, notre bon et vénérable Père, je vous envoie le récit des tristes événements de mon voyage à la Prairie. J'aurais voulu n'avoir à vous faire part que de consolations, afin de soulager votre cœur si paternel du poids énorme d'épreuves qui doit l'accabler par le temps qui court; mais, ici comme par toute la terre, la main adorable du bon Dieu s'est appesantie sur nous, pour nous faire expier nos iniquités et nous rendre moins indignes de son amour. Toutefois la vue des beaux sentiments de pénitence...\ntence et de résignation avec lesquels nos pauvres chrétiens ont subi ces douloureuses épreuves sera certainement pour vous, vénérable Père, comme elle l’a été pour nous, une bien douce consolation.\n\nJe ne devais pas, cette année, accompagner les chasseurs à la Prairie ; il avait été décidé, dans le conseil épiscopal, que je passerais toute l’année dans la résidence du beau lac Sainte-Anne, pour achever l’instruction théologique de nos deux Frères scolastiques, le F. Dolcet et le F. Blanchet. Déjà, je m’étais trouvé très-heureux de passer l’hiver, le printemps et une partie de l’été dans cette aimable solitude ; j’espérais bien jouir encore du même bonheur pendant l’automne ; mais l’homme propose et Dieu dispose. Que de fois déjà n’ai-je pas éprouvé la vérité de ces paroles pleines de sagesse, aussi bien que de ces autres : La vie de l’homme sur la terre est un combat continué !\n\nVoilà donc tout à coup l’heure de l’épreuve et du combat qui sonne.\n\nIl y avait environ deux mois que je n’avais eu le bonheur d’embrasser mon cher confrère de Saint-Albert, le R. P. Leduc, lorsque soudain il nous arriva au moment où les Frères scolastiques et moi faisions notre oraison du soir devant le saint Sacrement. Aussitôt je cours l’embrasser ; mais quel n’est pas mon chagrin et ma crainte, en le voyant tout d’abord répondre à mes saluts affectueux par une petite toux sèche, saccadée, indice certain d’une maladie sérieuse !\n\n— Ah ! mon Père, lui dis-je, vous avez eu trop de courage, et votre bon cœur vous a fait commettre une véritable imprudence ; je le vois, vous êtes tout malade ; tout content que je sois de vous voir, je préférerais que vous fussiez resté à Saint-Albert, où nos bonnes Sœurs vous soigneraient comme il faut.\n— Ce n’est rien, reprit le Père : un petit rhume qui ne mérite pas attention.\n\nMalheureusement nos craintes ne furent que trop justifiées. Dès le lendemain notre cher Père avait tous les symptômes d’une grave maladie, les jours suivants le mal ne fit qu’empirer et cependant le courageux Père voulait repartir pour se faire soigner à Saint-Albert. J’eus beaucoup de peine à le décider à rester et à faire venir deux Sœurs de Saint-Albert. Grâce aux soins de ces bonnes religieuses, le mal fut arrêté à temps, et quelques jours plus tard, le Père, encore tout affaibli par les terribles assauts de la maladie, put arriver à Saint-Albert, où il trouva le P. Bourgine, également tombé malade, ainsi que tous les enfants de l’hospice. La terrible picote ou petite vérole commençait ses ravages effrayants dans notre chère colonie. Vite le Père me mande d’accourir au plus tôt à son aide. Sur-le-champ je quitte ma récolte d’orge déjà commencée, et je pars avec un mauvais cheval qu’il faut frapper à coups redoublés pour le faire avancer et qui, entin, n’en pouvant mais, finit par se coucher au beau milieu de la rivière des Esturgeons, à 4 kilomètres de Saint-Albert. Il était bien l’heure de se coucher, car c’était environ onze heures du soir, mais la place était mal choisie par la pauvre bête ; force nous fut de laisser reposer notre voiture dans les eaux limpides du fleuve. Nous arrivâmes vers minuit à Saint-Albert. Les jours suivants, il fallut courir de loge en loge pour porter aux pauvres victimes de la peste les secours si consolants de notre sainte religion.\n\nMais nous étions à la veille du départ pour la chasse d’automne. Comment faire ? Impossible à la plupart de nos colons de rester plus longtemps dans la colonie, sous peine de mourir de faim ; d’un autre côté, le départ se présentait pour tous sous de bien noires couleurs. Par-\ntir, n'était-ce pas aller mourir au milieu de ce vaste désert, au milieu des bêtes fâvées, loin de la maison de prière, loin de cette croix de mission, si chère au cœur de tous nos bons métis ? Cependant, comme la famine menaçait d'ajouter ses horreurs à celles déjà si terribles de la picote, on choisit, comme on fait toujours en pareil cas, de deux maux le moindre, et le jour du départ fut fixé, à condition qu'un Père accompagnerait la caravane, autrement la plupart eussent préféré mourir de faim autour de la mission. Or il fut décidé que ce Père serait le P. Fourmond, comme étant seul capable, pour le moment, de supporter ce pénible voyage. C'était, en effet, une mission bien pénible et bien douloureuse que me connaît la divine Providence. Partant en compagnie de la terrible picote, il m'était facile de prévoir tous les dangers, toutes les peines qui allaient nous accabler ; aussi m'attendant à tout, je me résignais à tout, à la mort même, si tel devait être le bon plaisir du Seigneur. Cette mort, du reste, je l'avoue, me sourit, comme la mort sur le champ de bataille sourit au brave qui part pour le combat. Mais une telle grâce ! j'en suis trop indigne pour que le bon Dieu me l'accorde. Et puis, que seraient devenus nos pauvres chasseurs ? qui les eut consolés ? qui les eut absous ? Qui les eût béni au milieu de leurs terribles angoisses ?\n\n— Ce n'est rien que la maladie, ce n'est rien que la mort, disaient-ils, pourvu que le bon Dieu ne nous enlève pas notre cher Père qui nous console et nous ouvre le chemin du ciel !\n\nJe partis donc, le dernier jour, je crois, du mois d'août 1870, après avoir reçu la bénéédiction du tres-saint Sacrement et les aieux bien touchants de tout le personnel de la mission.\n\n— Ne craignez pas, mon Père, me disait tout le monde, nous allons bien prier pour vous.\n— 477 —\n\n— Oh, leur répétai-je le cœur bien emu, priez beau-\ncoup pour moi, car je sens que je vais avoir besoin plus\nque jamais de toutes les grâces du bon Dieu et de l'as-\nsistance de la très-sainte Vierge. L'horizon est bien noir.\n\nLe bon F. Scottly, Irlandais de nation, m'accompa-\ngnait jusqu'au fort des Prairies, qui domine la majes-\ntieuse rivière de la Saskatchewan. Nous couchâmes à\ncette place, dans la belle maison bâtie pour les Mission-\nnaires catholiques par les généreux agents de la Com-\npagnie de la baie d'Hudson. Nous trouvâmes ces pau-\nvres agents tout transis de frayeur. La crainte de la\npicote leur glaçait presque le sang dans les veines ; il\nétait déjà question de fermer les portes du fort avec dé-\nfense au fleau de Dieu d'en franchir les palissades, me-\nsure qui fut prise peu de temps après notre pas-sage.\n\nEn attendant le moment de traverser la rivière, je fus\noccupé à confesser les catholiques du fort, et comme la\nmaladie assiégeait déjà le fort lui-même, je dus visiter\nles malades. Le jour même de notre départ un de nos\nchasseurs tomba foudroyé par le fleau dans les magasins\ndu fort, ce qui mit le comble à l'épouvante des officiers.\nÀ peine eus-je passé le fleuve sur le beau bac de la Com-\npagnie, que sur l'autre rive je trouvai une jeune fille\ndangereusement malade, à laquelle j'administrais les\nderniers sacrements. Nous gravîmes ensuite les côtes fort\nescarpées de la Saskatchewan, puis nous campâmes tout\nprès, sur les bords d'un lac, à l'entrée de la forêt qu'il\nfaut traverser pour arriver dans la grande Prairie. Là,\nnous trouvâmes déjà campée une forte brigade de chas-\nseurs et, heureusement, aucun malade. Ce fut là que,\npour la première fois de mon voyage, je dormis sous la\ntente et sur le lit de campement d'une simplicité toute\npaternelle, comme cela convient si bien aux pauvres Re-\nligieux de Marie Immaculée. Pendant la nuit, mon som-\nmeil fut troublé par une étrange vision : une figure presque diabolique m'apparut tout à coup et me remplit d'un certain effroi. Qu'était-ce ? Un pauvre chien pressé par la faim avait eu l'impolitesse de forcer le passage et de venir manger ma chandelle sous mon nez ; mais à peine eus-je levé la tête qu'il s'enfuit, comme un voleur qu'il était.\n\nLe lendemain matin, le soleil se leva radieux, signe de beau temps, tandis que, les jours précédents, le ciel était toujours couvert de sombres nuages qui nous amenaient des orages fréquents accompagnés de pluies ; depuis longtemps on n'avait pas vu d'été si orageux et si pluvieux. Notre départ fut retardé ce jour-là par la perte d'un de nos coursiers, incident qui arrive souvent dans ces longs voyages à travers l'immense prairie. Une fois partis, nous essayâmes de rattraper le temps perdu en marchant bon train à travers les ravins de la forêt, et le soir nous arrivâmes sur le bord d'un beau lac, uni comme une glace, où se jouaient des milliers de mouettes et de canards. C'était la seconde fois que je campais en ce lieu. J'éprouvais là un peu de fatigue que j'attribuais aux rudes cahots dont j'avais été bercé toute la journée dans ma sauvage charrette, je pensai qu'un bon repas de pemmikan, suivi d'un sommeil réparateur, me ferait oublier ces petites misères. Tout au contraire, au beau milieu de la nuit je me sentis réveillé tout à coup par de terribles accès de toux accompagnés de frissons ; en même temps j'entendis un de mes voisins continuer l'antienne et chanter sur le même ton. Nous voilà sans doute pris de la picote, pensai-je, sans pourtant avoir beaucoup d'inquiétude, m'étant complètement abandonné, avant mon départ, à la providence si paternelle du cœur de Jésus. Ces symptômes pouvaient cependant devenir sérieux, et ils le sont devenus, en effet, pour\nmon cher voisin de campement, puisqu'il est mort depuis, tandis que je voilà parfaitement rétabli, continuant de combattre les combats du Seigneur. Toutefois je fus mal à mon aise toute la journée du lendemain. Je trouvais alors plus insupportables encore les secousses de ma charrette; aussi, à la débridée de midi, n'eus-je rien de plus pressé que de me jeter sur mon lit de camp, n'ayant aucune intention de faire honneur au festin que mon guide et son excellente femme me servirent, comme toujours avec tout le bon cœur et l'empressement dont ils étaient capables. J'allais pourtant essayer d'avaler quelque chose lorsqu'un cavalier arrivant au galop me demanda de retourner en arrière à l'endroit même d'où nous étions partis le matin; il y avait là, disait-il, une jeune fille bien malade. C'était le samedi à midi, 3 septembre; le soir même, j'espérais, après une forte marche, rejoindre le campement pour y chanter la grand'messe le lendemain, dimanche. J'étais donc fort embarrassé. J'eus l'idée de m'informer d'une manière plus exacte de l'état de la malade, et reconnaissant alors qu'il s'agissait simplement d'une crise sans danger prochain, je pris le parti de marcher en avant, fort inquiet et de cette malade que je ne pouvais aller visiter et des diverses brigades qui m'avaient précédé et que j'allais bientôt rejoindre.\n\nNous arrivâmes le soir, d'assez bonne heure, au campement général de la Jolie-Butte, à l'entrée de la grande Prairie. Je fus heureux d'apprendre que tout le monde était en assez bonne santé. Malheureusement il ne devait pas en être longtemps ainsi. Nous eûmes la chance de trouver campé en cette place le beau-père de mon guide, le bon vieux Nabès-Weyan, avec toute sa famille, enfants et petits-enfants. Alors il était dans la joie, comme la plupart d'entre nous; quelques jours encore, et il reviendra sur ses pas, pleurant la mort de trois de ses plus\ngrands enfants. Quel coup fondroyant pour ce pauvre vieillard ! Mais n'anticipons pas, l'heure de la douleur et des lamentables épreuves va bientôt sonner. Pour le moment nous fûmes enchantés de voir que le bon vieux avait déjà eu la chance de tuer une magnifique biche, dont il avait découvert les pistes dans la forêt. La viande fraîche vint fort à propos nous délasser du prosaïque pemmikan, mets tout à fait sauvage, qui, assurément, ne serait pas trouvé bien délicieux, même par les bouches les plus affamées des pays civilisés. Ici, c'est différent, on trouve ce mets excellent, lorsqu'on n'a rien de meilleur à se mettre sous la dent. Pour moi, je m'en trouve fort bien.\n\nNous fîmes donc festin, mon guide et moi, à notre repas du soir, grâce à la générosité de Nabès-Weyan ; heureusement, l'appétit nous stimulant, nous dépêchâmes vite notre souper, ce qui nous épargna de le voir interrompu par un coup vraiment tragique. À peine, en effet, la femme de mon guide avait-elle desservi, qu'éclata une terrible bourrasque qui ébranla jusqu'aux fondements ma petite maisonnette de toile. Vite, je me levai pour la soutenir, tandis que mon guide s'empressa d'aller chercher quelques cordages pour la consolider. Cependant l'aquilon redoublait de fureur et en un instant je me vis sur le point d'être renversé et enseveli sous mon édifice ; alors, sauve qui peut ! Ma tente vola d'un côté et moi je me trouvai planté un peu plus loin, sans asile et exposé à toutes les fureurs de la tempête. Je dus coucher dans la loge enfumée de mon guide, qui voulut bien me donner l'hospitalité avec sa cordialité ordinaire.\n\nLe lendemain, 4 septembre 1870, à peine étais-je éveillé, que le bon Paul Fayaux, mon guide et mon sacristain en même temps que mon maître d'hôtel, fonctions qu'il exerce gratuitement, me prit à part d'un air\ntout mystérieux pour me conter un rêve qu’il trouvait bien beau, mais qui lui donnait beaucoup à réfléchir :\n\n— Père, me dit-il, c’est bien extraordinaire, ce que j’ai vu cette nuit dans mon sommeil ; il me semblait voir le ciel ouvert. Ah ! que c’était beau ! quelles belles loges ! quels beaux arbres ! quels beaux anges j’ai vus ! Puis il y avait comme une immense traînée de lumière, de la couleur de l’arc-en-ciel, qui venait jusque sur la terre. Là se trouvaient de grands arbres couverts de verdure et au pied de l’un de ces arbres une femme assise, dont le visage était voilé, ce qui fait que je n’ai pu la connaître ; mais aussitôt une voix est venue d’en haut qui m’a dit :\n\n— Celle que tu vois au pied de l’arbre, c’est celle qui va monter par ce chemin dans la gloire du Grand Esprit.\n\nAinsi parla Paul ; puis, ses yeux fixés sur les miens, la bouche à demi ouverte, il attendait respectueusement ma réponse.\n\n— Eh bien ! mon ami, lui dis-je, il faut bien croire qu’un si beau rêve vient du bon Dieu et que quelque belle âme de notre compagnie va s’envoler dans la demeure du Grand Esprit. Qui est-ce ? Nous le saurons peut-être plus tard ; pour le moment le bon Dieu nous le cache, peut-être pour ne pas nous contrister d’avance.\n\nQuelques jours plus tard, sa pauvre femme, l’une des meilleures et des plus saintes de la colonie, tombait malade et mourait après une douzaine de jours de souffrances terribles. Elle est morte de la mort des saints, comme la plupart de nos catholiques, souffrant avec une patience et une résignation admirables. Elle eut la consolation d’être assistée à ses derniers moments par Mgr GRANDIN.\n\n— Ah ! mon Père, me disait le pauvre Paul, devenu veuf avec un petit enfant de six mois sur les bras, le bon Dieu est bien bon ! Il m’avait donné la meilleure des\nfemmes, je n'étais pas digne de la posséder ; il me l'a enlevée pour la mettre dans son beau paradis, je l'en remercie de tout mon cœur et je le remercie aussi du beau rêve qu'il m'a envoyé, sûrement pour me consoler dans mon malheur.\n\nPlus d'une fois il semble vraiment que le bon Dieu ait inspiré quelques-unes de ces âmes qu'il appelait à jouir d'une vie meilleure. Un jour, un petit garçon de huit à neuf ans, le fils de notre grand chef, appelle son père et lui parle ainsi :\n\n— Mon papa, j'ai vu le chemin que je dois bientôt suivre, il va me conduire tout droit à la belle maison du Grand Esprit, où je dois avoir beaucoup de plaisir ; cependant celui qui m'a montré ce beau chemin m'a dit que, si je le voulais, je pouvais encore rester avec toi ; ainsi, cher papa, si tu le veux, pour ne pas te faire de peine, je ne vais pas partir encore, ce sera pour plus tard.\n\nAlors notre bon chef, ne prenant conseil que de sa foi vive et généreuse, lui répond les larmes aux yeux :\n\n— Mon cher enfant, je serai heureux de te conserver auprès de moi, mais je serai encore plus heureux de te voir partir pour la belle maison du Grand Esprit ; je ne veux pas être un obstacle à ton bonheur, prends donc le beau chemin qui t'a été montré.\n\n— Ecoute encore, mon petit papa, reprend le pieux enfant : je ne dois pas partir le premier. Le chemin que j'ai vu est fort court, j'arriverai vite, mais celui que doit suivre ma mère est bien plus long ; c'est elle qui doit partir avant moi, puis moi quelques jours après, et nous nous rejoindrons, et pour te prouver que je dis vrai, je vais te dire ma prière en français ; tu sais que je ne l'ai jamais dite ainsi ; celui qui m'a montré le chemin me l'a appris.\n\nEt en effet, aussitôt, l'enfant, pour la première fois de sa\nvie, dit parfaitement sa prière en français. Tout, du reste, est arrivé comme il l'avait annoncé : la mère est morte la première et ensuite l'enfant.\n\nLa terrible picote commença presque tout de suite à envahir notre camp de la Jolie-Butte.\n\nLe dimanche, 4 septembre, je réunis dans la soirée tous les chasseurs pour l'élection du grand chef, de huit conseillers, de huit capitaines. Le chef de la dernière chasse fut élu presque à l'unanimité. Louison Montagnais est son nom. C'est un homme remarquable par sa haute taille ; une belle et longue chevelure, noire comme l'érable, retombe en ondoyant gracieusement sur ses larges épaules et encadre une figure bronzée dont le principal caractère paraît être la bonté. Cependant la moustache qu'il porte et qui le distingue des autres chasseurs lui donne un certain air martial qui annonce de l'énergie.\n\nJe m'informai ensuite s'il y avait des malades et je fus fort heureux d'apprendre qu'on n'en connaissait pas pour le moment. Mais dès le lendemain, 5 septembre, on venait me chercher au camp, pour retourner en arrière administrer un pauvre malade en grand danger de mourir. Quelques heures de course à cheval me conduisirent auprès du moribond, que je trouvai dans le plus triste état. Je Padministrai de suite, après quoi nous revînmes tranquillement au campement où, le lendemain, je lui donnai le saint viatique. Le surlendemain 7, il expirait au même moment que l'un de ses enfants, encore dans l'âge d'innocence. Ils furent tous deux enterrés dans la même fosse sur une butte voisine. Et, comme déjà la maladie gagnait de proche en proche, nous prîmes la résolution de planter une belle croix sur la première tombe qui venait de s'ouvrir devant nous. Je la bénis solennellement et au pied de cette croix sainte qui étendait ses deux bras salutaires sur l'immense prairie, comme pour la bénir et la\nprotéger contre les funestes influences de l'esprit de ténèbres, je fis, au nom de tous, une amonde honorable au sacré cœur de Jésus expirant pour les péchés du monde, puis je dis quelques paroles, pour inspirer à tous l'amour de ce divin cœur si aimable et si aimant. Nous revînmes en chantant un cantique à la très-sainte Vierge.\n\nOh! comme toutes les voix prenaient un accent suppliant en répétant ces touchantes paroles : *Ki pakucihutin, Nega natotawin : Je t'en supplie, ô ma Mère, exauce-moi...* Il était facile de voir qu'alors tous les cœurs étaient sous l'empire de la crainte autant que de l'espérance. Mais, sans doute, nos crimes étaient trop nombreux pour que la colère du Très-Haut fût apaisée sans victimes. Tous les jours l'ange de la mort va désormais venir frapper quelques coups terribles dans nos rangs et les éclaircir de plus en plus. En vain nous redoublerons nos prières matin et soir, les victimes tomberont toujours nombreuses. Bientôt nous comptions dans notre caravane d'abord une vingtaine de malades, puis trente, quarante, soixante, cent... enfin, arrive un moment où les deux tiers au moins de la population sont atteints par le terrible fléau.\n\nAlors quelle misère! quels embarras, quand il s'agit de changer de campement ! Souvent il se trouve à peine un nombre suffisant de gens bien portants pour chercher et atteler les chevaux; et le long du voyage à travers cette prairie sauvage, où l'on ne rencontre à chaque pas que buttes, aspérités, trous de toutes sortes où les renards et autres bêtes fauves ont établi leurs repaires, quelles secousses interminables, quelles souffrances pour nos chers malades! Aussi, comme nous marchons lentement et avec précaution! Les pauvres bêtes qui nous traînent semblent comprendre instinctivement notre triste position, et dociles à la main qui retient captive leur ardeur, elles marchent d'un pas grave et\nlent, la tête basse; les roues de nos petites charrettes paraissent à peine tourner; on dirait que la terrible mort, de son bras lugubre, s'y accroche pour les retenir et nous ensevelir dans l'immense désert! Mon Dieu, que c'est triste!\n\nQuelque lamentable que fût l'aspect de notre caravane en marche, bien plus navrant encore était le spectacle qu'elle offrait à son arrivée au lieu du campement. Quoique la distance entre chaque lieu d'arrêt fût ordinairement assez petite, nos pauvres malades arrivaient broyés par les secousses des charrettes; alors, s'il faisait beau temps, à l'arrivée on les déposait sur l'herbe desséchée de la prairie; si au contraire il faisait mauvais temps, le plus vite possible, les gens encore valides dressaient la loge, ce qui demandait à peu près cinq minutes; ensuite on étendait tout autour de vieilles peaux de buffalo, ou quelques vieilles couvertures: c'était le lit des pauvres malades. J'en ai vu maintes fois qui n'avaient d'autres couches que le foin de la prairie... Pour réchauffer les malades, préparer les tisanes et faire cuire le pot-au-feu, on courait vite, une hache à la main, chercher au plus près un peu de bois sec, avec lequel on allumait le feu au milieu des loges. Ces loges n'occupent pas une surface bien étendue, ordinairement elles n'ont pas plus de 3 mètres de diamètre. Dans ce petit espace, autour du foyer placé au centre, étaient couchés trois, quatre ou cinq malades; une fois, j'en ai compté dix. Alors on peut à peine trouver où placer le pied. C'est là que nuit et jour il me fallait exercer le saint ministère; j'avais souvent une soixantaine de loges à visiter, il me fallait entrer à quatre pieds et manœuvrer avec toute l'attention possible pour ne pas m'exposer au danger de froisser quelque membre ou de mettre le feu à mes vêtements. Je ne parle pas de l'infection qui remplissait le plus souvent ces tristes\nasiles de la douleur ; lorsque la maladie entrait dans la phase de la dessication, chaque malade était un foyer vivant de pourriture ; souvent c'est à peine si l'on pouvait reconnaître en eux les traits d'une créature humaine ; la face du malade était toute gonflée et couverte d'une croûte de gales noires et infectes qui présentaient un spectacle aussi affreux que lamentable. Cependant, sous cette hideuse enveloppe, il y avait une âme créée à l'image du bon Dieu ; une âme immortelle destinée à porter dans la sainte patrie une couronne de gloire incorruptible ; une âme pour laquelle le bon Jésus a versé jusqu'à la dernière goutte de son sang. Cette pauvre âme était souvent plus défigurée encore par le péché que le corps par la maladie, il fallait la sauver en la réconciliant avec son Dieu. C'était pour moi une tâche pleine de consolations célestes.\n\nAh ! que de fois mon cœur, déjà bien ému par le triste spectacle que j'ai essayé de vous décrire, a été profondément attendri et grandement édifié quand je voyais couler les larmes du repentir le plus sincère, lorsque je voyais éclater les sentiments les plus vifs de foi, de repentir, d'espérance, d'amour, de résignation :\n\n— Mon Père, me disaient le plus souvent ces pauvres malades, c'est pour mes péchés que le bon Dieu me frappe ; bien des fois j'ai fait fâcher le Grand Esprit, il ne me punit pas encore autant que je le mérite ! Ah ! je ne comprenais pas, dans mon aveuglement ce que c'est que le péché ! aujourd'hui je remercie le Grand Esprit et sainte Marie de me le faire comprendre. Ah ! si je vis, comme je le servirai fidèlement.\n\n— Je veux, disait celui-ci, me corriger de telle mauvaise habitude qui a fait mon malheur.\n\n— C'en est fait, s'écriait un autre d'un accent vraiment énergique et avec une pantomime des plus expres-\nsives, j'ai beaucoup péché, trop souvent j'ai fait fâcher le Grand Esprit ! Eh bien ! désormais rien au monde ne pourra me porter à recommencer.\n\nMais comment dire l'admirable résignation que tous montraient, même dans les plus terribles douleurs, dans les plus sensibles épreuves ? Je puis assurer que, dans toutes mes nombreuses visites à ces pauvres malades, je n'ai pas entendu une seule plainte contre la main adorable qui les frappait si rudement.\n\n— Qu'il soit fait comme il plaît au Grand Esprit ; pourvu qu'il me pardonne et prenne en pitié ma pauvre âme, je serais content ; je me remets entièrement entre ses mains avec toute ma famille. Je ne crains pas de mourir, j'espère aller voir le bon Jésus et la bonne sainte Marie.\n\n— Ainsi parlaient-ils ordinairement. Beaucoup expiraient en invoquant les noms si saints de Jésus et de Marie : Pretiosa in conspectu Domini mors sanctorum ejus !\n\nParce qu'en péchant nous avions poussé la folie et l'ingratitude jusqu'à nous révolter contre le Seigneur, jusqu'à nous servir de ses dons pour l'offenser et le combattre, tous les éléments dociles à la voix de leur créateur et souverain Seigneur, semblaient s'être déchaînés contre nous. De quelque point de l'horizon que le vent soufflât, c'était toujours la maladie et la mort qu'il nous amenait.\n\nUn jour, c'était le 9 septembre, nous étions, je crois, à notre second ou troisième campement dans la prairie ; dès le matin un vent sec et impétueux soufflait sur notre camp ; et au loin, mais bien loin encore, nous apercevions d'énormes tourbillons de fumée qui en s'élevant dans les airs obscurcissaient la lumière du soleil et cachaient sa face, comme sous un voile funèbre. Depuis quelques jours déjà, nous avions sous les yeux ce spectacle, qui nous annonçait que le feu avait embrasé un coin de l'immense\nprairie. Nous n'avions cependant pas beaucoup d'inquiétude et parce que le foyer de l'incendie paraissait fort éloigné, et parce que le foin était encore à moitié vert. Il n'en fut pas de même dans la matinée du 9 septembre ; alors il devint évident, même pour les moins clairvoyants et les moins expérimentés, que l'incendie s'étendait de plus en plus et que les tourbillons embrasés se rapprochaient de nous avec une effrayante rapidité. L'inquiétude et la crainte étaient dans tous les cœurs.\n\n— Si le Grand Esprit, disait-on, ne nous prend pas en pitié et ne détourne pas le vent, le feu va venir sur nous. Peut-être allons-nous tous brûler.\n\nLe grand chef, Louison Montagnais, voyant le danger, arbora son pavillon. C'était le signal convenu pour la réunion du grand conseil. Aussitôt il est entouré de ses conseillers auxquels il demande avis sur le parti à prendre dans cette périlleuse circonstance. Pendant ce temps, occupé que j'étais auprès de mes nombreux malades et croyant encore le danger éloigné, j'étais peut-être le moins inquiet de tous. Le grand conseil convint, à l'unanimité, de deux choses, savoir : que les craintes du public étaient sérieuses, et en second lieu, qu'il n'y avait que le Grand Esprit qui pût nous sauver. Sur-le-champ, on m'envoie un exprès pour me demander des prières publiques. Je me hâtai de faire sonner ma grosse clochette pendant que le crieur public invitait tout le monde à venir prier, et bientôt tous ceux qui pouvaient encore se traîner furent réunis devant ma tente, qui tenait lieu à la fois de chapelle et de presbytère.\n\nNous commençâmes par réciter le chapelet, puis nous chantâmes trois fois le Parce, Domine, trois fois les invocations au cœur adorable de Jésus et au cœur immaculé de Marie, à saint Joseph, à tous les saints, et enfin aux bons anges gardiens, ce que nous faisons tous les jours, ma-\ntin et soir. Il pouvait être environ midi. Ces prières terminées, tout le monde restait à genoux continuant de prier. Nous sentions de plus en plus l'haleine brûlante de l'aquilon, et j'étais comme les autres, ne sachant plus que penser et que faire. Je tâchai, par quelques paroles, d'inspirer la confiance à tous, puis je les engageai à se retirer pour veiller sur leurs loges et sur leurs malades. Les tourbillons de fumée s'épaississaient de plus en plus et approchaient plus rapidement ; cependant on n'apercevait pas encore la terrible flamme qui, comme un immense serpent de feu, semblait se cacher dans les massifs d'osiers et de saules qui nous entouraient, comme pour mieux nous surprendre et nous dévorer.\n\nChacun était retourné à son poste. Resté seul avec mon guide, le bon Paul, j'avais toujours les yeux fixés sur les noirs tourbillons, la crainte au cœur et ne sachant quel parti prendre. Impossible de fuir avec tous nos malades et nos mourants. Et puis où fuir ? La place que nous occupions ayant été pacagée par les chevaux, nous offrait encore plus de chances de salut. Alors Paul, plus expérimenté que moi, qui voyais le feu pour la première fois, courut chercher ma charrette qui, comme les autres, servait à former le rond où nous parquions nos chevaux la nuit ; puis le voilà qui, d'un bras vigoureux charge mes valises et mon mobilier.\n\n— Il est temps de prendre ces précautions, me dit-il ; si le feu paraît, nous allons tout trainer dans le rond, où peut-être il ne nous atteindra pas.\n\nCette besogne terminée, il courut vite à sa loge prendre les mêmes précautions. De tout côté on fait à la hâte la même manœuvre : Dans le rond, dans le rond ! criait-on de toutes parts. C'était un branle-bas général ; charger les charrettes, les rentrer dans le rond, abattre les loges, transporter les malades, courir après les chevaux, tout se\nfaisait à la fois et avec une incroyable rapidité ; c'est qu'il n'y avait plus une minute à perdre. Comme les autres, vite, bien vite, j'abattis ma tente et la traînai comme je pus dans le rond, et en courant je revins chercher les bois qui servent à la soutenir.\n\nIl était grand temps. Déjà le feu apparaissait de tous côtés et accourait sur les ailes de la tempête avec une effrayante célérité, nous lançant de noirs et épais tourbillons de fumée. En un instant les ténèbres de la mort semblent nous envelopper de toutes parts. On ne s'aperçoit plus qu'à la lueur des flammes livides, la respiration manque, il semble qu'on va étouffer. Pendant que l'intrépide Paul, s'oubliant lui-même, courait au secours de son beau-père, le vieux Nabès, dont la femme et plusieurs enfants étaient malades, je me jetais sur sa loge pour la sauver, quand il me cria :\n\n— Mon Père, mon Père, vite à mon secours, je ne puis seul sauver ma belle-mère !\n\nJ'accourus, et l'aidai à transporter dans le rond sa chère malade pendant que la flamme inexorable dévorait déjà la tente du vieux Nabès et la loge même de Paul.\n\nJe voulus alors me précipiter d'un autre côté pour m'assurer si tous les malades étaient en sûreté, mais la fumée m'aveuglait et m'étouffait, et la tempête de feu me rejeta en arrière. Je m'étais armé de scapulaires, deux fois je les jetai dans le feu et deux fois l'ouragan furieux les emporta. Le brave Paul courut à moi :\n\n— Mon Père, mon Père, me cria-t-il, vous allez vous brûler en vain. Accourez vite dans le rond, je pense que tous les malades sont sauvés.\n\nJe me jetai donc, à mon tour, au milieu de ce pêle-mêle de malades, de charrettes, de bois, de loges, de bagages qui encombraient le rond, et, comme les autres, je me mis la face contre terre pour ne pas étouffer dans cette\nespèce de fournaise embrasée au milieu de laquelle nous nous trouvions. Chacun pensait être à sa dernière heure. De nouveau je recommandai au bon Dieu mon âme et celles de mes pauvres sauvages, en lui faisant le sacrifice de ma vie. Auprès de moi était Paul et sa famille, ils ne cessaient de me crier :\n\n— Ah ! mon Père, priez pour nous.\n\nCependant les tourbillons de flammes et de fumée avaient passé aussi vite qu'ils étaient venus. Bientôt la lumière du jour reparut. Chacun se releva, chercha, appela les siens, plein de crainte que quelqu'un ne manquât à l'appel. Un seul avait été surpris par le feu. Ce n'était pas l'homme le plus édifiant de la caravane ; seul, il n'était pas venu prier avec nous, prétextant quelque occupation. Surpris par l'incendie, il s'était roulé dans les flammes pour empêcher ses habits de prendre feu ; il avait ainsi réussi à échapper à la mort ; mais dans quel état il se trouvait ! Les deux mains, la figure et une partie du corps avaient reçu d'effreuses brûlures et sa loge tout entière, avec tout ce qu'elle contenait, était devenue la proie des flammes.\n\nLa tempête de feu et de fumée qui avait failli nous consumer tous, s'éloignait avec la vitesse d'une locomotive lancée à toute vapeur, elle ne laissait derrière elle qu'une immense couche de cendres noires remplaçant ce beau foin qui faisait vivre nos coursiers, et recouvrant partout le sol comme un immense linceul. Autour de nous brûlaient encore plusieurs loges, plusieurs charrettes qu'on n'avait pas eu le temps de rentrer dans le rond. Je me dirigeais vers l'une de ces loges pour voir s'il n'y avait pas encore quelque chose à sauver, quand tout à coup, en passant près d'un char embrasé, une forte détonation se fit entendre et des débris de toutes sortes volèrent dans l'espace. Je me crus encore une fois aux portes de la mort ;\ncette fois encore j'en fus quitte pour la peur. Ne trouvant plus moyen de rien sauver de ce que dévoraient les flammes, je revins bien triste au camp, où je m'informai des pertes de chacun. Les uns avaient perdu toute leur loge et se trouvaient à l'entrée de l'hiver, si rigoureux dans ces contrées, sans abri et sans vêtements. D'autres n'avaient pu sauver qu'une partie de leur loge et de leur mobilier. Ici étaient couchés, tout saisis encore de frayeur, de pauvres malades qui n'avaient échappé à la fureur du feu qu'en faisant un suprême effort et en se traînant péniblement dans le rond; là, on voyait de petits enfants presque morts de frayeur, embrassant convulsivement leurs pauvres mères éplorées qui s'efforçaient de les rassurer.\n\nUne nouvelle inquiétude vint nous assaillir : — Les chevaux? Que sont devenus les chevaux? crie-t-on de toutes parts. Chacun alors de courir à droite et à gauche aux informations. Le plus grand nombre furent heureusement trouvés sains et saufs dans un marais voisin. Un petit nombre, cependant, avait été consumé par le feu. Mes deux chevaux et ceux de mon guide avaient été sauvés par le courage et le sang-froid d'un jeune sauvage cri, chargé de les garder. On lui avait dit, à l'approche du danger, de les chercher et de les pousser dans le marais. Il s'était mis en devoir de le faire sur-le-champ, mais ces pauvres bêtes, au lieu d'obéir aux cris et aux coups de fouet du jeune William, cherchaient à fuir devant le feu, qui accourait terrible sur eux. Alors l'intrépide sauvage sauta sur l'un d'eux et, à force de cris et de coups, voulut les contraindre à passer à travers les flammes. Dix fois peut-être ils s'épouvantèrent et s'enfuirent au galop : dix fois William les poursuivit de toute la vitesse de son coursier et les ramena en face des flammes, malgré la fumée qui l'étouffait et l'aveuglait. A deux reprises il tomba de cheval, presque asphyxié,\nmais se relevant aussitôt, il sauta de nouveau sur sa monture. Le feu prit à la couverture qui protégeait ses épaules, vite il l'étendit, en courant toujours après les chevaux de plus en plus épouvantés. Enfin, par un suprême effort, il vint à bout de les faire passer à travers les flammes et ainsi leur sauva la vie.\n\nAutre sujet de graves inquiétudes. Le jour précédent, une trentaine de chasseurs étaient partis pour aller chasser une petite bande de buffalos aperçue dans le lointain. La plupart revinrent heureusement le soir même. Ils avaient échappé à l'incendie, les uns en se retirant dans quelque marais, d'autres en mettant eux-mêmes le feu à la place où ils étaient et se retirant ensuite sur le terrain brûlé, autour duquel venaient mourir les flammes qui les menaçaient. Ces bons chasseurs revenaient donc sains et saufs, mais bien inquiets de leur côté sur notre sort.\n\nLe matin même de ce jour extraordinaire du 9 septembre ils avaient été témoins d'un spectacle étrange qui les avait émerveillés. S'étant levés dès l'aurore, afin de partir de bonne heure ils avaient vu le soleil levant montrer à l'horizon son disque coloré de sang, par la boucane qui remplissait l'atmosphère. Mais, ô merveille ! ô prodige ! dans ce disque tout empourpré apparut tout à coup une belle croix, puis un ostensorio, puis un cœur et enfin une église, tout cela successivement et aux yeux émerveillés des trente chasseurs, qui, tous, ont rendu le même témoignage. De toutes parts on me demandait des explications sur cette merveilleuse apparition, de toutes parts on criait au miracle : mamaskats! mamaskats! Voici à peu près l'explication que je crus pouvoir leur donner : La croix, depuis que Jésus-Christ l'a arrosée de son sang adorable, a toujours été un signe de pardon et de miséricorde. Le cœur est le signe de l'immense amour du bon\nDieu. L'ostensoir rappelle que le très-saint Sacrement est le plus grand, le plus ineffable de tous les miracles de sa divine charité pour les hommes ; enfin l'église que vous avez vu doit vous faire penser à cette sainte maison du bon Dieu, où, nuit et jour, il fait sa demeure parmi les hommes, et à cette autre maison bien plus sainte encore qu'il habite au ciel et où ses enfants doivent partager sa gloire éternelle. Ainsi donc, mes enfants, prenez bien courage, le Grand Esprit ne vous frappe d'une manière si terrible que pour vous rendre dignes de ses miséricordes et de son amour et vous placer dans son beau paradis. Vous l'avez bien offensé, bien des fois vous l'avez fait fâcher, continuez de lui demander pardon du fond de votre cœur. Continuez, comme vous le faites tous les jours, à vous abandonner entièrement à sa divine providence et à souffrir patiemment pour l'expiation de vos péchés.\n\nCes paroles parurent les toucher et les consoler.\n\nNous quittâmes bientôt le camp incendié pour aller nous établir dans quelques-unes de ces oasis de foin que, de distance en distance, la divine Providence nous avait miséricordieusement et presque miraculeusement conservées. Notre marche, si triste déjà avant le passage du feu dévastateur, l'était bien plus encore après. Au lieu de ces belles prairies que nous foulions aux pieds, ce n'était plus qu'un immense et noir désert où le vent, à chaque instant, soulevait des tourbillons de cendres noircâtres qui, pénétrant partout, nous aveuglaient et nous noircissaient le visage. Quel surcroît de gêne et de souffrances pour nos pauvres malades ! L'accroissement du nombre des malades nous retenait cloués trois, quatre et cinq jours dans le même campement. Vers le 12 septembre, les malades devinrent si nombreux et le danger de mort si pressant, que je craignis d'être débordé et de\nne pouvoir plus suffire à tous les besoins. Le 14 septembre, jour de l'Exaltation de la sainte Croix, je fis faire une grande croix, comme à la Jolie-Butte ; je la bénis solennellement, puis le grand chef et les membres du grand conseil la portèrent pieusement sur leurs épaules tout autour du camp, pendant que j'aspergeais les loges d'eau bénite et que nous chantions les litanies de la très-sainte Vierge et celles de tous les saints. Partout, sur le passage de la croix, les malades semblèrent éprouver du soulagement, ce qui nous fit croire pendant quelques jours que le fléau allait cesser. La croix fut plantée au milieu de notre cimetière. Deux fois nous campâmes non loin de ce cimetière, ce qui nous donnait la facilité d'y enterrer nos morts. Toutefois, au dernier campement, comme la distance était d'environ 3 kilomètres, je montai à cheval pour y conduire les morts, j'avais chaque jour trois ou quatre morts, et quelquefois plus, à conduire ainsi.\n\nCe serait peut-être le moment de vous dire quelques mots sur les sépultures sauvages. Aussitôt après le décès, les parents et les amis du défunt l'ensevelissent et font, presque toujours, un cercueil, se servant pour cela des planches de leurs charrettes. Quand il n'y a plus de planches, on va dans le bois voisin en tailler à coups de hache. Pendant ce temps, je fais sonner le glas avec ma grosse clochette ; puis, quand tout est prêt, on amène les morts, en charrette, jusqu'à la porte de ma tente. Je revêts le surplis et l'étole, et tenant d'une main mon petit rituel, et de l'autre une petite fiole d'eau bénite, je fais l'absoute et aussitôt après je conduis les pauvres défunts à leur dernière demeure, montant à cheval quand le campement est un peu éloigné du cimetière. À mon costume ecclésiastique j'ajoute, selon qu'il fait froid ou chaud, un pardessus ou un chapeau. Au lieu de la sépul-\nture, il n'y a rien de particulier. Rarement on y entend d'autres soupirs que ceux de la prière, tant est grande la résignation de ces pauvres gens dans, la perte de ceux qu'ils aiment le plus sur la terre. Une cérémonie tou-\nchante termine les prières de l'Église. On présente sur une pelle un peu de terre au prêtre, pour que, le premier,\nil ait la charité de couvrir de terre les restes mortels\nde son frère défunt; après lui les assistants prennent chacun une poignée de terre, qu'ils jettent aussi dans la fosse.\n\nUn jour (c'était, si je ne me trompe, le 16 septembre),\nje revenais seul de conduire ainsi un convoi funèbre; je laissais aller à son gré ma paresseuse monture et je profi-\ntais de la gravité de son pas pour réciter mon breviaire.\nTout à coup j'entendis le galop d'un cheval qui arrivait par derrière moi. Je crus d'abord que c'était quelque\ncavalier qui revenait de la sépulture; mais quelle ne fut pas ma surprise en entendant une voix qui criait à pleins poumons :\n\n— Monseigneur! Voici Monseigneur qui arrive!\n— Que dis-tu? criai-je à mon tour au courrier en me retournant du côté d'où venait la voix; je ne comprends pas ce que tu veux dire.\n— Mais, c'est Monseigneur qui est tout proche, répli-\nqua-t-il.\n— Quoi! m'écriai-je, croyant presque à une illusion,\nest-ce possible?\n— Oui, assurément, c'est bien Monseigneur; suivez-\nmoi, je vais vous conduire à sa rencontre.\n\nAussitôt je donne quelques coups de fouet à mon che-\nval, et me voilà parti au galop à la suite du porteur de la bonne nouvelle, brûlant de me jeter dans les bras de ce tendre ami, de ce bon Père, que je n'avais pas eu le bon-\nheur de voir depuis son départ pour le Caribou, c'est-à-\ndire depuis environ dix mois. Au bout de quelques instants, je rencontrai en effet notre bon et saint Evêque, assis dans le wagon de la mission et escorté de quelques cavaliers. Bien vite je saute de cheval, pendant que lui-même mettait pied à terre, et me voilà à ses genoux ; il me presse entre ses bras en m’arrosant de ses larmes et en me donnant sa sainte bénédiction. Quel heureux moment ! quelle consolation dans la triste position où je me trouvais, au milieu de cette immense plaine brûlée et entouré tous les jours de morts et de mourants ! Jamais le souvenir de cette heureuse rencontre ne s’effacera de ma mémoire.\n\nJe laissai mon coursier funèbre pour prendre place à côté de Monseigneur sur le char épiscopal, et pendant le court trajet qui nous séparait du camp il s’empressa de s’informer de la santé de nos pauvres malades, et moi je lui demandai des renseignements sur son voyage si long et si pénible du Caribou. Il me raconta en abrégé les épreuves et les consolations que le bon Dieu lui avait envoyées; comment un des Frères avait failli se noyer au passage d’une rivière; comment, en passant au fort Carlton, il avait été reçu comme un sauveur par les habitants de ce fort, atteints de la terrible picote. Les protestants de l’endroit avaient écrit à leur ministre une lettre pressante pour le solliciter de venir à leur secours; le ministre s’était contenté d’écrire une longue épître d’excuse et de consolation en les exhortant à mourir avec confiance. Pendant ce temps, un autre ministre résidant à Victoria fermait sa porte à ses coreligionnaires pestiférés, et, pensant que la prudence est mère de la sûreté, leur faisait passer ses médicaments par la croisée, au bout d’un bâton. Bien différente fut la conduite de Mgr Grandin. Partout il passait en consolant, en bénissant, en soignant lui-même les pauvres pestiférés, Partout\nil se montrait comme le bon pasteur qui donne sa vie pour ses brebis.\n\nMais nous voici arrivés en face de notre camp. Déjà la grosse clochette, grâce au bras vigoureux du bon Paul, sonnait à toute volée et annonçait la bonne nouvelle dans toutes les loges. Bientôt tous ceux qui avaient encore la force de se traîner vinrent à la rencontre de leur bien-aimé pontife, qui leur apparut alors comme un ange consolateur envoyé du ciel. Nous descendimes du char et Monseigneur se mit à bénir chacun de ses enfants en leur imprimant sur le front le signe sacré de la croix. À la vue de tous ces fronts, de tous ces visages déjà flétris par la souffrance, Monseigneur ne put retenir ses larmes, et c'est en sanglotant qu'il adressa à tous des paroles de consolation et d'encouragement. Puis, sans vouloir prendre de repos, il me pria de le conduire dans toutes les loges pour qu'il pût aussi bénir et consoler les pauvres malades qui n'avaient pu se traîner jusqu'à lui. Quelle joie! quel bonheur pour tous de voir et d'entendre leur saint Evêque!\n\nLe soir, Sa Grandeur présida la prière en commun et voulut encore adresser à l'assemblée quelques bonnes paroles, comme sa bouche sait si bien les dire :\n\n— Mes yeux pleurent, disait-il dans sa profonde émotion ; oui, mes enfants, mes yeux pleurent en voyant votre profonde affliction ; mais mon cœur est dans la joie de tout ce que j'ai vu et entendu au sujet des saintes dispositions avec lesquelles souffrent et meurent les malades.\n\nPendant la visite générale que Monseigneur fit aux nombreux malades de notre camp, nous en découvrîmes quelques-uns tombés dans un danger prochain de mort et non encore administrés. Nous les confessâmes et les administrâmes, nous partageant cette pieuse et sainte besogne. Mais comment faire pour ne pas priver ces pauvres\nmalades des grâces ineffables du saint viatique ? Vivant toujours sous la tente ou sous la loge enfumée du sauvage, je ne pouvais convenablement conserver l'adorable Eucharistie. Cependant le bon Dieu, dans son extrême amour pour les hommes, se fait tout à tous. Le divin cœur du bon Jésus ne brûle-t-il pas encore d'un amour plus ardent pour tous ceux qui sont plus accablés de peines et de souffrances ? N'est-ce pas à ceux-là qu'il adresse cette invitation si pleine de tendresse : *Venez à moi, vous tous qui succombez sous le fardeau qui vous accable, et je vous soulagerai !* M'inspirant donc des sentiments si charitables du divin cœur de Jésus, j'avais trouvé le moyen de mettre le comble au bonheur de mes chers malades et de satisfaire les ardents désirs du cœur de Jésus ; voici comment :\n\nJe prenais note chaque soir des malades en état de recevoir le saint viatique, puis le lendemain matin, avant ma messe, je les visitais de nouveau, et, après m'être assuré qu'ils pouvaient encore faire la sainte communion, je venais aussitôt dire la sainte messe et je consacrais autant d'hosties que j'avais trouvé de malades en état de communier. Après le saint sacrifice, nous chantions les invocations et les prières accoutumées pour la cessation de la peste, puis le *Tantum ergo* ; après quoi je donnais à tous la bénédiction du très-saint Sacrement. Ensuite nous partions en procession autour du camp, chantant soit le *Parce, Domine*, soit l'*Adoremus*, ou bien encore quelques cantiques en l'honneur de la sainte Eucharistie. Nous faisions autant de stations qu'il y avait de loges à visiter, C'est ainsi que presque tous nos malades ont eu le bonheur de recevoir le pain vivant descendu du ciel, précieux gage d'immortalité et de glorieuse résurrection. Plusieurs même, parmi les adultes, ont fait ainsi leur première communion. Que de fois j'ai été édifié des saintes dispositions de ces pauvres sauvages !\nMonseigneur, pendant son court séjour au camp pestiféré, suivit le même procédé pour faire communier les malades que nous avions administrés la veille. Alors la procession quotidienne du très-saint Sacrement était encore bien plus solennelle et bien plus touchante. Le premier jour nous portâmes ainsi le saint viatique à une jeune sauvagesse qui se mourait, la fille du Poisson-Blanc Oetikamek, de la tribu des Cris. Ce pauvre sauvage a perdu presque tous ses enfants. Dans la même loge, Sa Grandeur donna la confirmation au frère de la jeune fille, qui se mourait aussi. Pendant ces saintes fonctions, j’assistai Monseigneur autant que le permettait la petitesse du lieu, où l’on ne pouvait manœuvrer qu’à genoux et en s’exposant à chaque instant à brûler ses vêtements. Aussi étais-je plus attentif à préserver Sa Grandeur de tout incendie qu’à exécuter les cérémonies de l’assistance épiscopale, et, tout en lui rendant ce service important, j’étais bien aise que d’autres mains charitables me le rendissent à moi-même.\n\nDurant ses visites aux pauvres pestiférés, Monseigneur avait chaque fois recommandé aux parents et aux amis de bien prendre soin de leurs chers malades, ce dont généralement ils s’acquittaient avec beaucoup de charité. Il y a eu, à ce propos, des dévouements admirables. J’ai connu plusieurs sauvages qui, quoique déjà épuisés par les fatigues de leurs occupations journalières, passaient encore les nuits à courir, de loge en loge, pour servir les malades et leur faire du feu. Cependant quelques-uns étaient bien délaissés, soit que la peur eût fait fuir leurs proches, soit que ceux dont ils auraient pu attendre quelques secours fussent malades eux-mêmes, ce qui arrivait fort souvent. Monseigneur avait eu le cœur désolé en apprenant que trois malades, le père, la mère et le fils, se trouvaient dans cette situation, Il voulut\ndonner à tous le bon exemple de la charité et du dévouement en se constituant lui-même, pendant la nuit, le garde-malade de ces trois pauvres moribonds. Le soir, il me laissa donc seul et, une chandelle d’une main, son breviaire de l’autre, il se dirigea vers la loge des délaissés. Avec un pareil exemple sous les yeux, il ne m’eût pas été facile de clore l’œil et de dormir sans remords de conscience sur ma peau de buffalo; d’ailleurs l’exemple, comme la peste, n’est-il pas contagieux? C’est ce que j’éprouvai. Me souvenant que mon pauvre Paul avait lui aussi son mourant et qu’il était épuisé de veilles et de fatigues, je me rendis dans sa loge après le départ de Monseigneur, et lui commandai d’aller prendre ma place dans ma tente pour se livrer au sommeil pendant que je veillerais son cher malade. Le pauvre homme ne se le fit pas dire deux fois, tant il était accablé; à peine couché, il s’endormit comme un mort. La nuit avançant, comme je ne sentais pas le besoin de sommeil, je laissai mon guide profiter largement de cette bonne occasion. Je ne songeais nullement à le déranger de sitôt, quand je le vois arriver vers trois heures du matin, les yeux à peine ouverts:\n\n— Comment, lui dis-je, te voilà sitôt? Pourquoi n’as-tu pas attendu que j’allasse t’avertir?\n\nIl balbutia quelques mots, comme un homme embarrassé ou qui a fait quelque mauvais rêve. Je ne sus que plus tard, de la bouche même de Mgr GRANDIN, ce qui s’était passé. Le pauvre homme avait bien bonne intention de dormir de son mieux et depuis plusieurs heures déjà il s’en acquittait assez bien, ronflant comme un soufflet de forge, lorsque le Prélat, remplacé par un autre garde-malade, vint se coucher. Voyant quelqu’un endormi à côté de lui, il pensa naturellement que c’était son cher P. FOURMOND et fit le moins de bruit possible pour ne point l’éveiller, d’autant plus que je lui avais dit que je ne\ndormais que d'un œil et que le moindre bruit me faisait aussitôt ouvrir l'autre. Mais à peine Monseigneur eut-il clos sa paupière, qu'on vint nous demander pour un malade. Sa Grandeur, se tournant du côté de son voisin, cria à plusieurs reprises :\n\n— Père Fourmond, père Fourmond, levez-vous donc et allez à votre tour !\n\nUn fort ronflement fut toute la réponse ; deux ou trois fois, Monseigneur redoubla ses cris, ajoutant enfin cette réflexion :\n\n— Mais c'est singulier, ce bon Père me dit encore qu'il ne dort que d'un œil, en voilà bien la preuve !\n\nEnfin, comme la parole ne suffisait pas, il en vint aux voies de fait et secoua fortement son ronflant voisin. Aussitôt, à surprise ! c'est le bon Paul qui répond :\n\n— Que voulez-vous, Monseigneur ?\n\nEt Monseigneur, stupéfait de sa méprise, à la vue d'une pareille transformation pouvait à peine en croire ses oreilles, car ses yeux n'y pouvaient rien dans le cas présent, étant plongés dans la plus parfaite obscurité.\n\nCe ne fut que pendant quelques jours seulement que nous eûmes le bonheur de posséder Mgr Grandin. Il avait hâte de repartir pour sa chère mission de Saint-Albert où il n'avait fait que passer. Là aussi la poste sévissait toujours avec rigueur et moissonnait, aussi bien que dans notre camp, plusieurs victimes par jour. Cent vingt-neuf sauvages avaient déjà succombé sous le coup du terrible fléau, dans cette malheureuse mission ; notre camp, de son côté, en avait perdu cent vingt, ce qui donne un total de deux cent quarante-neuf. Aujourd'hui il faut compter au moins trois cents victimes ; c'est le tiers de la colonie.\n\nMonseigneur nous laissa donc fort tristes de son départ, mais bien consolés des saintes paroles dont il nous avait édifiés et des précieuses bénédictions qu'il nous avait\napportées. De notre côté, nous continuâmes notre vie errante à travers la prairie, partout dévastée par le feu, dont chaque jour encore nous apercevions à l'horizon la lueur sinistre. Plusieurs fois nous expédiaîmes au loin, en diverses directions, quelques-uns des meilleurs cavaliers pour explorer le pays et chercher les grosses bandes de buffalos. Mais chaque fois ils revenaient tristes et découragés, n'ayant découvert que quelques buffles isolés, que la main paternelle de la divine Providence semblait avoir retenus en arrière, pour nous empêcher de mourir de faim. Nous pensâmes alors qu'en passant la rivière Bataille, nous serions peut-être plus heureux ; mais non. Sur l'autre rive, aussi bien que sur celle-ci, la prairie était en feu, à l'exception pourtant d'une grande lisière de foin, sise dans le voisinage même de la rivière. C'est là que nous passâmes plusieurs semaines, vivant au jour le jour, de ce que voulait bien nous envoyer notre Père céleste : buffles, loups, castors, biches, chevreuils, ourdades, rats, etc., mais sans pouvoir faire de provisions pour l'hiver. Nous ne pouvions pas davantage nous lancer à travers les immenses solitudes qui étaient devant nous, tant à cause de nos nombreux malades qu'à cause de l'extrême pauvreté de tout le monde. Tous, en effet, étaient trop mal vêtus et trop mal approvisionnés pour braver les rigueurs d'un froid terrible dans ces déserts, où l'on ne rencontre pas une branche de bois pour faire du feu, tandis que jusqu'à ce jour nous n'avions pas manqué de bois sec.\n\nSur ces entrefaites, nous fûmes un peu plus agréablement surpris par un secours imprévu, venu fort à propos pour soulager l'extrême misère de nos gens et leur redonner un peu de courage, dans l'état d'abattement et de grande désolation où ils étaient plongés.\nUn jour, c'était, je crois, deux semaines après le départ de Monseigneur, deux étrangers, conduisant une charrette chargée, arrivent au camp et viennent directement à la porte de ma tente ; ils me remettent des lettres du fort des Prairies et de la mission, puis, de suite, déchargent les caisses que contenait la charrette.\n\n— Qu'est-ce que cela ? qu'est-ce que cela ? disait-on de tous côtés, parmi la foule des curieux avides de nouvelles.\n\nC'était un don magnifique que, dans sa générosité, nous envoyait le bon M. Christie, officier supérieur et membre de la Compagnie de la baie d'Hudson. Ce don consistait en barils de sucre et de poudre de chasse, caisses de thé, provision de balles et de plomb.\n\nLe jour même et le lendemain nous nous empressâmes de distribuer ces articles, à la grande satisfaction de tout le monde, surtout des malades, qui, pour la plupart, n'avaient plus ni sucre, ni thé, ni médecine aucune pour soulager leurs souffrances.\n\nUne fois de plus dans ma vie j'ai vu combien il est doux de secourir la misère et la souffrance et de faire des heureux. Ah ! si tous les riches connaissaient ce qu'il y a de bonheur dans la charité, assurément il n'y aurait bien-tôt plus assez de pauvres pour les satisfaire et la grande question du paupérisme, qui empêche tant de hauts personnages de dormir, serait admirablement résolue ! tandis qu'il est bien à craindre que ces bons messieurs ne s'épuisent en vain de veilles et de fatigues, en cherchant toujours cette précieuse solution là où elle ne se trouve pas. C'est ainsi que le bon M. Christie, tout en fermant soigneusement à tout le monde la porte de son fort, de peur d'y voir entrer furtivement la peste, ne laissait pas, suivant la juste expression de Mgr Grandin, de nous offrir à tous son bon cœur, et ce qu'il a fait pour nos pestiférés de la Prairie, il l'a fait avec la même générosité.\npour ceux de Saint-Albert ; ces jours-ci j'apprenais de plus qu'il venait encore de donner une forte souscription en faveur de notre orphelinat.\n\nVers la fin du mois d'octobre, le grand chef, voyant approcher l'hiver avec sa froide compagnie, la neige, la glace, la poudrerie, etc., et ne découvrant plus aucune chance de réussir à atteindre les buffalos, réunit tous les chasseurs en assemblée générale, selon la coutume dans les questions graves. Chacun fut appelé à donner son avis et déclaré libre de prendre un parti quelconque. L'assemblée se partagea en deux opinions. Les uns prirent le parti d'aller passer l'hiver à la Mission, où ils avaient encore quelques ressources pour vivre ; les autres, en plus grand nombre, résolurent de bâtir des maisons sur le bord de la rivière Bataille, pensant trouver, dans ce pays de chasseurs, un moyen d'existence qu'ils n'eussent trouvé que bien difficilement partout ailleurs. Toutefois ces derniers ne prenaient ce parti qu'à la condition qu'un Père leur serait donné pour passer l'hiver avec eux. Je fis part immédiatement à Monseigneur de ces décisions, lui demandant ses ordres. Peu de jours après on m'écrivait de revenir à la Mission le plus vite possible, ce que je m'empressai de faire, n'ayant plus que quelques malades, et ayant donné les derniers sacrements à ceux qui étaient en danger de mort. Après deux journées et demie de marche, j'arrivai à Saint-Albert, d'où il me fallut repartir dès le lendemain matin, pour voler au secours de mes pauvres chrétiens du lac Sainte-Anne, attaqués à leur tour par la terrible picote. Le R. P. Bourgine, qui était avec eux, alla me remplacer à la Prairie.\n\nVoilà deux mois que la maladie règne ici ; je compte déjà vingt-neuf décès. Il n'y a peut-être pas dix de ces sauvages qui n'aient passé par la terrible épreuve du fléau.\nPriez bien pour nous, mon très-révérend Père, afin que nous profitions tous de ces coups effrayants de la justice divine, et veuillez agréer l'hommage du profond respect avec lequel je suis votre enfant tout dévoué en Notre-Seigneur et Marie Immaculée.\n\nFOURMOND, O. M. I.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009607.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 35, "total-input-tokens": 50694, "total-output-tokens": 18205, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 831, 1], [831, 2570, 2], [2570, 4421, 3], [4421, 6244, 4], [6244, 8139, 5], [8139, 9972, 6], [9972, 11866, 7], [11866, 13690, 8], [13690, 15491, 9], [15491, 17254, 10], [17254, 19109, 11], [19109, 20991, 12], [20991, 22880, 13], [22880, 24685, 14], [24685, 26499, 15], [26499, 28359, 16], [28359, 30219, 17], [30219, 32010, 18], [32010, 33848, 19], [33848, 35754, 20], [35754, 37594, 21], [37594, 39437, 22], [39437, 41303, 23], [41303, 42982, 24], [42982, 44839, 25], [44839, 46641, 26], [46641, 48560, 27], [48560, 50418, 28], [50418, 52304, 29], [52304, 54075, 30], [54075, 55875, 31], [55875, 57744, 32], [57744, 59571, 33], [59571, 59844, 34], [59844, 59844, 35]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]