[{"id": "6c69ee88bb3a52644cfeff0fac1471c9b5625140", "text": "CANTIQUE.\n\nNinnan, spomo kinnan\nsputch kitchi tapl\nikoy kitchi katna nitslo\nkidad jimohlikkan.\nNinnan, spomo kinnan,\nn' t' akomijimman\narsiw kitchiphorshin;\nnatoyé kristikoyé,\nkitorkokkipinnan\nn' t' akomiyimán.\n\nNotre Père, aide-nous, d'en haut\noù tu demeures ; beaucoup je\nte demande la religion.\nNotre Père, aide-nous ;\nj'aime\nta belle parole ;\nle dimanche\nque tu nous donnes,\nje l'aime.\n\n« Je termine cette longue lettre en vous demandant,\nmon très-révéré et bien-aimé Père, de bien vouloir bé-\nnir le dernier de vos enfants et tous les pauvres sauvages\nqu’il évangélise, et qui n’ont de secours à attendre que de\nvous et des oblats de Marie Immaculée. Que ne pouvons-\nnous faire pour eux davantage ? Que n’avons-nous des\nressources pour ériger quelque mission au milieu de\nleurs prairies ! Il y a là plus de douze mille Indiens dont\nje suis le seul Missionnaire, et dans toute la vaste étendue\nde la terre qu’ils habitent, il n’existe pas une mission\nproprement dite ; nous n’y avons aucune chapelle.\n\n« Daignez agréer, mon bien-aimé Père, l’hommage du\nprofond respect, etc.\n\n« Votre fils tout dévoué et tout affectionné :\n\n« ALBERT LACOMBE, O. M. I.,\nPrêtre missionnaire.\n\nLETTRE DU MÊME AU T. R. P. SUPÉRIEUR GÉNÉRAL,\n\nMission Saint-Paul-des-Cris, sur la Saskatchewan,\njour de Pâques, 31 mars 1866.\n\n« MON TRÈS-RÉVÉRÉ ET BIEN-AIMÉ PÈRE,\n\n« Nous venons de célébrer une grande et belle fête ; le\njour de Pâques est un jour bien cher au cœur de tous mes\nnéophytes, et comme les peines et les joies de mes pauvres\nsauvages sont devenues mes peines et mes joies, j’ai moi-\nmême ressenti aujourd'hui de bien douces consolations : ils étaient si heureux, mes bons chrétiens, en recevant Notre-Seigneur Jésus-Christ dans l'Eucharistie que j'ai eu le bonheur de leur donner ! Dieu récompensait leur foi naïve des joies les plus suaves !\n\n« Malgré l'heure déjà avancée de la nuit, je ne veux pas, mon très-révéré et bien-aimé Père, aller prendre le repos dont j'ai cependant besoin, avant d'avoir tracé les premières lignes d'une lettre que je me fais un bonheur de vous adresser. Je n'aurai à vous raconter que des événements qui offrent peu d'intérêt, et comme je suis inha-bile à écrire, ma plume ne leur donnera point le charme qui leur serait nécessaire pour être lus avec plaisir ; je suis assuré néanmoins que vous accucillerez avec bonté le simple récit de mes derniers travaux.\n\n« La dernière lettre que j'avais l'honneur de vous adresser remonte, je crois, au mois de janvier 1865. J'étais alors à la mission de Saint-Albert ; je vous parlais de mon voyage à l'intérieur de la tribu des Pieds-Noirs et de la bataille fameuse qui avait eu lieu au mois de septembre de l'année précédente. Et, maintenant, me voici à la mission de Saint-Paul-des-Cris. Quand, l'hiver dernier, le R. P. Vandenberghe traversait ici la rivière Saskatchewan, pour se rendre, en la compagnie de Mgr Taché, à la mission de Saint-Albert, il ne se doutait probablement pas qu'un peu plus tard un Oblat viendrait ici planter la Croix et fonder une mission. Cette mission de Saint-Paul se trouve à l'entrée des terres de chasse des Cris, qui habitent les grandes prairies. Notre bien-aimé vicaire de missions et le R. P. Visiteur avaient plusieurs fois exprimé le désir de me voir aller donner mes soins à ces pauvres sauvages, et c'est pourquoi, malgré les contrariétés de tout genre qu'il m'a fallu surmonter, j'ai entrepris d'établir ici une mission. Dieu aidant, mon\ncourage a été plus grand que les épreuves auxquelles il n'a pas manqué d'être soumis.\n\n« Je laissai Saint-Albert, l'an dernier, au lendemain de la grande fête du 25 janvier. Après avoir embrassé les frères que je quittais à regret, et placé sur un traîneau attelé de quatre chiens, tout mon bagage (léger bagage, hélas!), je me mis en route, en raquette, ayant pour unique compagnon un jeune métis. Notre voyage dura quatre jours et fut heureux. Comment vous exprimer, bien-aimé Père, avec quelle joie je fus reçu! C'était plaisir de voir l'allégresse de tous les sauvages au milieu desquels j'arrivais. Elle était d'autant plus grande que le bruit de ma mort s'était répandu parmi eux; on croyait que j'avais été tué chez les Pieds-Noirs. Aussi c'était vraiment un spectacle touchant de voir mes bons Indiens se précipiter sur moi, criant tous à la fois: « Merci, merci, mon père vit. » Puis ils traduisaient leur contentement du geste et de la voix, aussi bien qu'ils le pouvaient. Tous me disaient qu'ils avaient beaucoup prié pour moi et remerciaient Dieu de leur avoir manifesté, en ma faveur, sa puissance et sa bonté.—« Quand j'ai appris ta mort, me disait l'un d'eux, j'ai plus pleuré que lorsque j'ai perdu mon père. » Un autre ajoutait: « A l'annonce de cette triste nouvelle, nous nous sommes dit, entre nous: Fuyons, fuyons bien loin, car si le Père a été tué chez les Pieds-Noirs, il n'y a plus de vie pour nous. — Pour moi, me disait encore un de ces chers sauvages, pour moi, j'ai dit: Je ne fuirai pas. S'il est vrai que Dieu ait appelé notre Père à lui, j'irai à la mission, j'irai le pleurer sur les champs qu'il avait labourés pour nous, et j'attendrai son successeur. »\n\n« Le parti qui avait prévalu, cependant, à la nouvelle de ma mort, avait été celui qui conseillait de prendre la fuite. Les Cris, malgré la neige très-abondante qui cou-\nvrait la terre et le froid rigoureux, s'étaient éloignés du pays où je les avais rencontrés précédemment, mais plus tard ils y étaient revenus, après avoir ou dire que ma mort n'était pas certaine, et ce fut alors que je les rencontraï. La disette était fort grande à leur camp, lorsque j'y arrivai ; ces pauvres gens étaient obligés d'y garder un jeûne des plus rigoureux. Point de buffles dans le voisinage ; du moins, c'était à peine si quelques-uns y apparaissaient de temps à autre, et tombaient sous les coups de leurs chasseurs.\n\n« Dès lors, trêve forcée à cette effrayante gloutonnerie des sauvages dont j'ai été souvent témoin, et dont, je suis sûr, un Européen se fait très-difficilement une idée. Pour ma part, je ne le soupçonnais pas ; ainsi je n'aurais jamais cru qu'une famille pût, dans un seul repas, manger jusqu'à quarante et même cinquante livres de viande ; et cependant il en est ainsi.\n\n« Les circonstances dans lesquelles se trouvaient les Cris, lorsque j'arrivai au milieu d'eux, étaient donc fâcheuses. Ce qui m'incommodait surtout, c'est que la disette forçait mes sauvages à changer, chaque jour, de campement, afin de s'approcher des troupeaux de buffles. Je ne pouvais alors que très-difficilement travailler à l'instruction religieuse de la tribu. Ce ministère, d'ailleurs, pénible dans tous les temps, est particulièrement dur et fatigant pendant l'hiver. On ne peut alors réunir que bien peu de sauvages dans des huttes, petites et misérables, où il faut se grouper autour d'un foyer dont la fumée vous aveugle et vous étouffe.\n\n« Pourtant, grâce à Dieu, ces épreuves ne me rebutèrent point. À tous les campements, je réunissais autour de moi autant de sauvages que je le pouvais, les hommes d'abord, ensuite les femmes, et vers midi les enfants ; parfois je pouvais en avoir quatre-vingts assemblés dans\nune plus grande loge qu'on me prêtait dans ces circonstances.\n\n« Imaginez-vous donc cent vingt et même cent trente loges sauvages que recouvre une neige abondante et d'où s'échappe une épaisse et noire fumée. Approchez-vous de la principale; relevez cette peau grossière qui en ferme l'entrée, et voyez. Autour d'un feu, dont la fumée, ne pouvant trouver d'issue, s'échappe en tourbillonnant de tous les côtés, sont assis, ou mieux, accroupis, tous mes petits Indiens. Ils se pressent le plus qu'ils peuvent autour de la Robe noire, pour réciter leurs prières et apprendre leur catéchisme. « Mais, me direz-vous, il est impossible d'y tenir. Quel moyen de ne pas être asséché par cette fumée, ou de ne pas être gelé par ce froid rigoureux qui se fait sentir, quand même? » Hélas! je l'avoue, le froid et la fumée ont de graves inconvénients, surtout dans de pareilles habitations; mais il faut bien se résigner à souffrir, et après s'être rappelé la belle devise de notre chère famille: « Evangelizare pau- « peribus misit me, » se dire que l'honneur de relever et sanctifier les pauvres mérite bien d'être acheté par quelques sacrifices; et puis l'on s'approche du feu, autant qu'on le peut, on a soin de ne pas se tenir debout, pour ne pas être étouffé par la fumée; de la sorte on se tire d'affaire.\n\n« Pour ma part, je me suis toujours trouvé si heureux d'instruire mes pauvres sauvages, que je me suis peu aperçu de la misère et des inconvénients de leur pauvre hutte. Une seule chose ici m'affligeait grandement et me causait bien plus de peine que les privations et les épreuves dont je viens de parler, c'était l'impossibilité dans laquelle je me trouvais de dire la sainte messe.\n\n« J'avais eu d'abord l'intention d'élever une cabane un peu plus convenable que les autres; en la chauffant au\nmoyen d'un poêle, j'aurais pu me procurer le bonheur après lequel un pauvre Missionnaire soupire le plus. Il me fallut abandonner à regret le projet que j'avais ainsi conçu : je vis que nos ressources ne me permettaient point de le réaliser.\n\n« Vous parlerai-je maintenant, un instant, de la manière dont nos Cris font la chasse aux buffles pendant l'hiver? Je ne sais trop si vous y trouverez quelque intérêt, mais voici en peu de mots comment ils s'y prennent :\n\n« On construit, au moyen d'arbres solidement disposés, une forte palissade d'une hauteur de sept à huit pieds. L'enceinte circulaire formée par cette palissade peut avoir, d'ordinaire, de quatre-vingts à cent pieds de diamètre : elle porte le nom de parc (Pittonkahan). Ce parc est presque toujours construit au pied d'une petite colline ; on lui laisse pour porte d'entrée une ouverture de dix pieds environ.\n\n« Des deux côtés de cette porte, des poteaux sont plantés et disposés de façon à former une avenue qui va s'élargissant toujours davantage jusqu'à la distance d'un demi-mille. Près de ces poteaux se tiennent des chasseurs qui attendent les buffles que quelques Indiens plus habiles sont allés chercher dans le voisinage, et parfois même jusqu'à quinze milles de là. Lors donc que ces sauvages sont parvenus à les diriger vers l'avenue du parc, on les pousse du côté de la porte d'entrée, à laquelle ils arrivent, en se pressant les uns contre les autres, étourdis qu'ils sont par les cris des chasseurs et les aboiements des chiens. Dès qu'ils sont entrés dans l'enceinte fortifiée où la mort les attend, on ferme la porte du parc, et les chasseurs font pleuvoir sur ces pauvres bêtes, conduites dans ce piège, une grêle de balles et de flèches ; mais ce n'est que percées de coups qu'elles tombent. C'est d'ailleurs l'affaire de quelques instants.\nLes chasseurs contemplent alors leur proie tout à leur aise ; souvent le nombre des buffles qu'ils ont abattus s'élève à plus de cent. C'est à l'un des chefs principaux qu'il appartient de désigner la part de la chasse qui revient à chacun ; après quoi, hommes, femmes, enfants, se précipitent dans le parc ! On dépèce les buffles, et chaque famille emporte, pour les mettre à la marmite ou pour les faire rôtir, les morceaux qui lui semblent les meilleurs, et ceux-là seulement ; car, dans l'abondance, le sauvage devient délicat à sa façon, et l'on ne saurait croire combien de viandes, en ces circonstances, sont laissées dans le parc, pour y servir de pâture aux chiens, aux loups et aux corbeaux.\n\n« J'ai eu beau reprocher bien souvent à mes sauvages cette manière d'agir, qui leur est ordinaire, et leur dire que c'était un mal de perdre ainsi une nourriture qui leur était donnée par la Providence. Bien souvent j'ai cherché à les faire sortir de leur insouciance pour le lendemain ; je n'ai jamais pu rien en obtenir ; du reste, l'expérience, qui est le meilleur des maîtres, n'est jamais parvenue à les éclairer ; les jeûnes qu'ils sont obligés de faire après les jours d'abondance, jeûnes qui se renouvellent plus souvent que ceux du carême, ne peuvent les amener à ménager leurs provisions pour les temps de disette.\n\n« Je reviens maintenant à mes sauvages et aux exercices que je leur donnai durant la mission. Malgré la rigueur de la saison, c'était au mois de février, je les réunissais à diverses reprises, parce que je n'en pouvais rassembler qu'un petit nombre à la fois dans la loge qui était à ma disposition, j'eus tout le temps de me convaincre qu'il faudrait bien de la patience et bien des efforts, dans ces conditions, pour éclairer des esprits aussi grossiers et pour convertir tout ce pauvre peuple. Mais, je l'espère avec confiance, Dieu nous donnera de\nvaincre, par la prière et la persévérance, les difficultés qui s’opposent à la réussite de notre œuvre ; elle est la sienne, et, avec le secours de la grâce, nous ferons ici de bons chrétiens, des chétiens capables de résister aux séductions du vice et de l’erreur, lesquelles pourraient bien arriver prochainement jusqu’à nous, avec le flot de l’émigration.\n\n« Au commencement de mars, je revins à notre résidence pour avoir le bonheur de dire au moins quelquefois la sainte messe, et prendre un peu de repos. J’en avais un si pressant besoin, qu’il me semblait voir notre divin Sauveur m’y inviter lui-même, et me dire comme autrefois à ses apôtres : « Venite seorsum in desertum locum et requiescite pusillum. » Combien j’aurais été heureux de trouver un confrère pour partager un instant ma solitude et pouvoir me confesser !\n\n« Je n’étais à la mission que depuis cinq jours, quand un courrier arriva pour m’apprendre que les deux camps des Cris et des Pieds-Noirs se trouvaient assez rapprochés. Les deux tribus étaient tout au plus à une journée de distance l’une de l’autre. Les Cris, redoutant une vengeance de la part des Pieds-Noirs, m’envoyaient prier d’aller trouver ces sauvages pour apaiser encore une fois leur colère. Je me mis en route, avec deux jeunes gens qui se rendaient chez les Cris. Ceux-ci m’attendaient avec impatience et me reçurent avec beaucoup de joie. On me pria, en plusieurs beaux discours, d’assurer les Pieds-Noirs des bons sentiments d’amitié que les Cris nourrissaient pour eux, et de leur grand désir de la paix.\n\n« Je me dirigeai alors vers le camp des Pieds-Noirs, qui furent très-surpris de me voir. Je restai pendant cinq jours au milieu d’eux. Ils consentirent à faire la paix avec les Cris ; le tabac des deux nations fut haché ensemble, et les grands calumets de paix furent apportés,\nOn les fuma en signe de bonne intelligence ; je représen-\ntais les Cris. — Je ne sais pas et Dieu seul peut savoir com-\nbien durera la paix cimentée de la sorte. Peut-être n’ai-\nje fait que retarder de quelques mois les scènes de\ndésordre, les massacres et les vols qui accompagnent ou\nsuivent la guerre ; mais enfin, j’ai sauvé la mission de\nSaint-Paul, au moins pour quelque temps, d’un très-\ngrand danger, car une guerre avec les Pieds-Noirs nous\neut été très-funeste en ce moment-ci. Dès que la paix\nfut assurée, je quittai les Pieds-Noirs, et rentrai à Saint-\nPaul, le 14 mars.\n\n« Cependant, j’avais promis de me rendre au fort Pitt,\nafin d’y faire faire les pâques aux chrétiens qui s’y trou-\nvent. Le jour de saint Joseph, je me mis en route pour m’y\nrendre, en compagnie d’un jeune sauvage qui conduisait\nmon traîneau. Après deux nuits passées à la belle étoile,\nj’arrivai, vers le milieu du troisième jour, au fort Pitt, mis-\nsion de Saint-François Régis. Je commençai de suite les\nexercices de la retraite préparatoire à la communion pas-\nchale, pour les Canadiens et les métis employés ou ser-\nviteurs de ce poste, ainsi que pour quelques sauvages qui\ns’y trouvaient réunis, et que la disette faisait alors beau-\ncoup souffrir ; elle se faisait surtout sentir depuis le fort\nEdmonton jusqu’à celui de Carlton.\n\n« Le dimanche des Rameaux, j’eus le bonheur d’admi-\nnistrer la sainte eucharistie à trente personnes ; c’était\nici les seules qui eussent déjà fait leur première commu-\nnion. Je me rappelais au fort Pitt, que l’année précédente,\nle jour aussi du dimanche des Rameaux, je me trouvais\nau fort des Montagnes-Rocheuses, où les chrétiens qui\nl’habitaient m’avaient donné tant de consolation. Je ne\nfus pas moins satisfait des dispositions des chrétiens\ndu fort Pitt ; je ne puis m’empêcher, en particulier, de\npayer un tribut d’éloges à la conduite admirable de\nM. Châtelain, bourgeois du fort, et à celle de sa respectable famille.\n\n« Conformément aux instructions qui m'avaient été données par Mgr Taché, je fis construire, non loin du fort, une modeste maison, qui put servir à constater notre prise de possession de cette mission. Je quittais à regret le fort Pitt, où je voyais encore beaucoup de bien à faire; mais comme je devais rentrer à Saint-Paul pour y célébrer la fête de Pâques, il fallait me mettre en route, sans retard. J'arrivai le jeudi saint, au milieu de notre petite population chrétienne de la mission de Saint-Paul-des-Cris. J'y ai célébré la fête de la Résurrection de notre divin Sauveur, dans la plus grande pauvreté que l'on puisse s'imaginer. Chapelle, ornements, fidèles, tout était pauvre, très-pauvre. L'espérance de voir, quelque jour, cette mission sortir de l'état misérable où elle se trouve me console, mais la vue des bonnes dispositions dans lesquelles se trouvent mes chrétiens me console encore davantage.\n\n« J'attends ici, chaque jour, mes sauvages de la prairie; ils doivent au printemps se réunir auprès de moi pour faire diverses semaines.\n\n« Je vais maintenant, avant de terminer cette lettre, et pour vous donner une idée de certains usages sauvages, vous parler de ce que l'on appelle la cérémonie du calumet. Les sauvages aiment beaucoup à fumer, C'est là un de leurs passe-temps les plus doux. Quelqu'un entre-t-il dans une loge, on lui présente une pipe; ce serait une grande impolitesse de manquer à cet acte de prévenance. J'ai entendu des sauvages me dire qu'ils préféreraient rester deux jours sans manger, que de passer deux jours sans fumer. Aussi, parmi eux, quand un malade ne peut plus fumer, il est condamné, personne n'attend plus sa guérison.\n« Mais ce n’est pas seulement comme passe-temps, que les Indiens usent du calumet : il a de plus un rôle important dans toutes les cérémonies superstitieuses des sauvages encore infidèles ou qui ne connaissent que très-imparfaitement notre sainte religion. C’est ce qui explique le respect et même la vénération qu’ils ont pour le calumet. J’ai dit le calumet, il serait plus exact de dire le manche auquel il est adapté, car le récipient du tabac n’est compté pour rien, parmi eux. C’est dans le tuyau qui sert à en aspirer la fumée que, selon ces pauvres Indiens, réside toute vertu. Dans toutes leurs cérémonies civiles et religieuses, sa présence est indispensable. Une assemblée tenue où ce fameux manche de calumet serait absent serait par ce seul fait radicalement illégale ; tout y serait nul et sans effet. Ce manche est un tube long de deux pieds et demi environ, que l’on a soin d’orner de plumes d’oiseau. Il s’adapte à un vaste récipient de pierre rouge ou noire. On l’enveloppe toujours de quelque étoffe précieuse, et quand la tribu est en marche, quelques vieux chefs sont chargés de le porter. Son exhibition ne se fait que dans des circonstances importantes, telles que dans les réunions où il faut conclure la paix, etc.\n\n« Quand donc une assemblée de cette sorte a lieu, le calumet est apporté ; on l’ensence avec la fumée de plusieurs herbes odoriférantes. Il est ensuite présenté poliment au Soleil, et cela se fait en le tournant vers les quatre points cardinaux. Le même cérémonial s’observe pour la Terre, à laquelle on l’offre aussi. Enfin, après plusieurs pompeux discours, le calumet est fumé par ceux qui composent l’assemblée.\n\n« Pendant qu’on le fume, personne ne doit passer devant lui, et s’il était nécessaire de le faire, on le déposerait un instant. Si nos sauvages devenus chrétiens s’abstiennent des assemblées et cérémonies superstitieuses,\nils ne comprennent pas toujours très-vite qu'ils doivent s'abstenir de fumer dans nos « assemblées religieuses. Un jour je confessais ; plusieurs personnes se tenaient tout près de moi et s'examinaient ; je vois tout à coup un sauvage allumer gravement son calumet, et se disposant à le fumer. Je dus lui apprendre, à sa grande surprise, qu'il y avait inconvenance de fumer dans un lieu de prière.\n\n« Il est à regretter que, dans tout le vaste district de la Saskatchewan, nous ne puissions travailler davantage à évangéliser les sauvages, et cela par défaut d'établissements suffisants dans les lieux qu'ils fréquentent. Nos résidences de Sainte-Anne, de Saint-Albert et du lac de la Biche, ne sont fréquentées que par un très-petit nombre de sauvages, quelques familles seulement, unies à nos métis par les liens de la parenté. Jusqu'ici nos ressources ont été absolument insuffisantes pour établir, ce qui serait indispensable, une mission destinée spécialement aux sauvages. Mais Dieu, qui a béni nos œuvres jusqu'ici, ne manquera point d'en assurer le développement. Vous nous viendrez aussi en aide, nous l'espérons, bien-aimé Père, votre grand zèle pour le salut des âmes nous en est un gage assuré. Nous tâcherons de le seconder, en travaillant toujours, de toutes nos forces, à faire ici le plus de bien possible.\n\n« Permettez-moi, très-révérend et bien-aimé Père, en achevant ces lignes, de me jeter à vos pieds, pour vous prier de bénir le dernier de vos enfants et les pauvres sauvages qu'il évangélise.\n\n« ALBERT LACOMBE, prêtre missionnaire, O. M. I. »", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009549.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 17804, "total-output-tokens": 6658, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1574, 1], [1574, 3447, 2], [3447, 5308, 3], [5308, 7146, 4], [7146, 8947, 5], [8947, 10772, 6], [10772, 12653, 7], [12653, 14484, 8], [14484, 16363, 9], [16363, 18107, 10], [18107, 19987, 11], [19987, 21553, 12]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false]}}]