[{"id": "1860ed75bbeba5051e1f252e961154b601e3782a", "text": "gion chrétienne. À vrai dire, c'est bien ici la seule civilisation véritable. Mais, encore une fois, dans l'ordre purement humain, il n'est capable que d'une demi-civilisation, et encore faut-il qu'il la reçoive de ceux qui ne sont conduits par aucune spéculation, mais uniquement par l'intérêt de l'humanité souffrante. Un vieux sauvage à cheveux blancs, le vrai patriarche de sa tribu, me disait un jour : « Pour nous sauvages, Dieu ne nous a faits qu'à moitié, « vu que nous vivons à la façon des animaux, et ne con- « naissions pas la manière de le servir. Mais il vous a laissé, « à vous qui êtes ses ministres, le soin de nous finir en per- « fectio nant son ouvrage. » Oui, pauvre sauvage ! et c'est la mission qui nous a paru la plus belle, la seule que nous ambitionnons, celle que nous voulons accomplir au prix de tous les sacrifices et de notre vie même.\n\n« Je finis, mon très-révéré et bien-aimé Père, cette lettre déjà trop longue. Veuillez continuer de prier pour nous tous, mais surtout pour les Pieds-Noirs et leur indigne Missionnaire, qui est votre enfant tout dévoué en Jésus-Christ et Marie immaculée.\n\n« LACOMBE, O. M. I. »\n\nEXTRAIT D'UNE LETTRE DU R. P. MOULIN,\n\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Jean-Baptiste (île à la Crosse),\n16 août 1869.\n\nIl y a peu de monde à la mission pour le moment. Hier, fête de l'Assomption, la plupart des gens du fort ont pu s'approcher de la sainte table. Hier encore nous est mort un petit sauvage. J'ai bien admiré la résignation\ndu père, qui a perdu tous ses enfants, à l'exception d'un seul. Il me disait naguère : « Dieu est mon maître ; s'il veut guérir mon enfant, il en est le maître ; mais, quoi qu'il arrive, je suis résigné. » Ce sont assurément des sentiments bien beaux pour un sauvage peu instruit. Si notre ministère semble pénible, nous ne sommes cependant pas sans consolation, Dieu, dans son infinie miséricorde, veut bien soutenir notre faiblesses.\n\nMOULIN, M. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009568.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 2, "total-input-tokens": 2952, "total-output-tokens": 661, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1503, 1], [1503, 1953, 2]], "primary_language": ["fr", "fr"], "is_rotation_valid": [true, true], "rotation_correction": [0, 0], "is_table": [false, false], "is_diagram": [false, false]}}]