[{"id": "2f948193ba8a20a52f8bc5c7128df3c1d65f19be", "text": "Maintenant que nous avons donné un aperçu sur les missions de ce nouveau vicariat, nous allons faire connaître les travaux de quelques-uns de nos Pères qui y exercent leur ministère apostolique, en leur laissant à eux-mêmes le soin de nous raconter leurs succès, comme leurs peines et leurs fatigues.\n\nLETTRE DU R. P. RÉMAS AU T. R. P. GÉNÉRAL.\n\nMission de Sainte-Anne, le 23 novembre 1866.\n\n« MON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\n« Je ne saurais vous exprimer la joie que m'a fait éprouver la réception de votre bonne et affectueuse lettre, en date du 20 mars de cette année. Je crois que l'éloignement où nous nous trouvons de votre personne vénérée et l'isolement où nous sommes, nous rendent plus chers les témoignages d'intérêt et d'affection paternelle que vous voulez bien nous donner et dont nous sentons, du reste, tout le prix. Aussi vous-prierai-je de vouloir bien, autant que vos nombreuses occupations vous le permettent, me favoriser de temps en temps de l'une de vos bien-aimées communications. — Vous me rappelez, très-révérénd Père, dans votre lettre, que je vous ferais un grand plaisir, si je vous racontais mes travaux et mes courses, et faisais connaître les sauvages que je suis chargé d'évangéliser. Je voudrais bien pouvoir répondre à vos désirs; mais, vous le savez, notre genre de vie favorise peu le sens littéraire. Cependant, pour vous montrer ma bonne volonté, je vais essayer de vous raconter mon genre de vie dans cette région, où tout est si différent des usages et des mœurs de la France. — Je dois d'abord commencer par vous faire connaitre le champ du père de famille, dont la culture m'a été confiée. La résidence de Sainte-Anne est\nchargée de quatre missions distinctes. Sur une étendue de pays de forme triangulaire et dont les angles sont éloignés du centre d'environ soixante lieues, elle comprend le versant oriental des montagnes Rocheuses, situé dans le vicariat de la Saskatchewan, où j'ai deux postes à visiter, et s'étend au nord jusqu'aux limites du vicariat d'Attabaskaw. — J'ai appris que Mgr Farad avait le projet de fonder une résidence entre nos deux missions des montagnes Rocheuses et celle de Saint-Bernard, chez la nation des Castors ; il serait plus facile, de cette résidence, de visiter les postes qui sont à l'ouest et au petit lac des Esclaves, que du lac Sainte-Anne ; l'exécution de ce projet nous épargnerait, à nous, de longs voyages et de grandes dépenses, et il nous resterait encore assez de travaux pour nous occuper, et nous pourrions alors visiter les Assiniboines, qui fréquentent le fort qui porte leur nom. Quoique notre mission ait une grande étendue, le nombre des personnes qui en dépendent n'est pas considérable : il s'élève à peine à onze cents, dont sept cents environ sont baptisés. Ils sont de tribus et de races diverses. Les sauvages diminuent ou restent dans un état stationnaire, tandis que les métis augmentent et d'une manière assez rapide : un seul fait le démontrera. Il y a une quarantaine d'années que trois Iroquois et un Canadien vinrent s'établir au pied des montagnes Rocheuses et y épousèrent des sauvagesses. De ces quatre familles sont sorties cent trente personnes ; elles forment une tribu.\n\n« Je vous ai parlé de l'étendue de la mission qui m'est confiée ; pour que vous ayez une idée de la manière dont je la dessers, je vous prierai de me suivre dans les diverses excursions que mon ministère m'impose.\n\n« Au commencement du mois de mai de cette année, je me dirigeai vers le poste du petit lac des Esclaves.\nLe lac Sainte-Anne était encore pris par les glaces et tous les bancs de neige n'avaient point disparu, ce qui augmenta les difficultés de mon voyage. Outre les peines physiques qui se rencontraient plusieurs fois par jour, je portais avec moi une peine morale qui venait augmenter mon inquiétude : je laissais ma mission aux soins mercenaires d'un domestique, car je me trouvais seul alors des nôtres, et l'expérience m'avait appris qu'il me créerait de graves embarras pendant mon absence, que mon retour ne ferait pas cesser. Pour se rendre, en été, de Sainte-Anne à la mission de Saint-Bernard, on se sert de chevaux durant trois journées de marche ; le reste se fait en canot, mais on est obligé alors de faire un grand détour. Comme je tenais à m'y rendre par une voie plus directe, je m'avançai en droite ligne à travers la forêt, ayant eu la précaution de prendre un guide avec moi. Mais, après trois journées d'une marche incertaine et fatigante, je dus abandonner ce projet, deux de mes chevaux se trouvaient épuisés ; je dus reprendre la voie par eau, que je pus suivre à l'aide d'un vieux canot que je me procurai à grand'peine. J'arrivai enfin au fort des Assiniboines, mais une grande déception m'y attendait : les sauvages qui portent ce nom et qui fréquentent ce poste en étaient partis ; on m'apprit que plusieurs, parmi eux, étaient malades et auraient ardemment désiré de me voir. Quel parti dois-je prendre ? le plus naturel est de courir après eux, afin de les rencontrer. Mais ici se présente une grave difficulté : les uns ont pris la direction de l'ouest, d'autres celle du nord ; en outre, on m'apprend qu'un homme gravement malade m'attendait sur les bords du petit lac des Esclaves, et je ne pouvais aller à lui que par la voie d'eau. Je pensai qu'il fallait d'abord me rendre au désir de ce malade ; c'est ce que je fis, en m'embarquant sur une des branches de la rivière d'Attabas-\nkaw ; mais, à mon arrivée au lieu désigné, je n’y trouvai point le malade : la famine avait forcé sa famille à s’enfoncer dans les bois pour y trouver quelque nourriture, et il avait dû la suivre. Plus tard, je pus le rencontrer.\n\n« J’avais à me rendre à la mission de Saint-Bernard, et pour cela, je devais traverser le petit lac des Esclaves dans toute sa longueur ; mais, quoique nous fussions arrivés dans la dernière quinzaine du mois de mai, ce lac n’était pas encore pleinement dégagé de ses glaces, ce qui m’occasionna beaucoup de retard, m’exposa à plus d’un péril et me procura de grandes fatigues, car je dus faire une partie de la route à pied, n’ayant pas d’autre chemin que la grève, et chargé d’une partie de mon bagage.\n\n« L’avant-veille de la Pentecôte, j’atteignais le but de mon voyage ; c’est à dix heures du soir que je faisais mon entrée au poste de Saint-Bernard, à la grande joie de mes sauvages. C’était le dix-septième jour depuis mon départ de Sainte-Anne.\n\n« Le lendemain, je commençai les exercices de la mission, qui devaient durer une vingtaine de jours, exercices toujours très-fatigants, parce qu’on ne peut se permettre, tant qu’ils durent, un seul moment de repos, et qu’il faut faire une très-grande dépense de paroles, les catéchismes, les instructions, le chant, les confessions, occupant tour à tour tous les instants de la journée. Sans doute, ces missions produisent d’heureux résultats, mais ils seraient beaucoup plus grands, si l’on pouvait les réitérer plusieurs fois dans l’année et demeurer plus longtemps avec ces pauvres sauvages.\n\n« L’arrivée du commis du fort, le 6 juin, apportant les marchandises, fut comme le signal du départ de nos Indiens, parce qu’ayant pu se procurer les objets qui leur sont nécessaires, ils retournaient dans leurs forêts. Me trouvant\npar là privé de mon troupeau, je pris le parti de retourner à ma résidence. Mon cœur était profondément agité à la pensée que je laissai ce poste qui ne verrait pas de prêtre pour longtemps encore, et où les fidèles qui y reviendraient n'auraient pas la consolation d'y rencontrer leur Père. Je levai alors mes mains vers le Ciel, et je conjurai Notre-Seigneur de vouloir bien disposer les événements, de manière à ce que mon vœu fût exaucé, m'offrant moi-même, si c'était son bon plaisir, pour venir me fixer dans cette solitude profonde.—Ces pensées agitaient encore mon âme, quand déjà, monté sur mon canot, je fendais les flots pour traverser le petit lac des Esclaves, ainsi appelé, non parce qu'il est en réalité petit, puisqu'il a au moins cent milles de long, mais parce qu'il est moindre que le grand lac au nord, qui porte le même nom.\n\n« Mais bientôt la tempête vint nous assaillir, et fournit à mon esprit une diversion nouvelle, en mettant sous mes yeux un danger imminent; heureusement qu'il nous fut possible, après de grands efforts, de gagner terre. Dans la soirée, le temps s'étant calmé, et nous donnant le vent en arrière, mes rameurs voulurent en profiter pour continuer la route. J'avoue que je partageais peu leur avis, j'étais même fort inquiet, car je n'ignorais pas que la navigation en canot, durant la nuit et sur un grand lac, est peu sûre; mais, craignant de les contrarier, je ne m'opposai pas à leur projet. Le canot fut donc lancé à l'eau. Bientôt, grâce à la fatigue, le mouvement régulier des rames et le balancement de l'esquif m'endormirent dans le sommeil, lorsque tout à coup j'en fus tiré par le craquement du canot, qui avait été lancé sur le tronc d'un grand arbre, caché sous l'eau. Le guide, en jetant un regard au fond du canot, s'aperçoit qu'il fait eau et jette le cri d'alarme. L'un de nous prend de suite un vase pour puiser l'eau et faire l'office de pompe : nous\ndégageons le canot du récif où il était venu échouer,\net nous cherchons à nous diriger vers le rivage. Malheu-\nreusement le temps était couvert et nous trouvant plon-\ngés dans la nuit la plus profonde, nous ne savions de\nquel côté nous diriger pour gagner le plus proche ri-\nvage ; ajoutez à cela que, malgré les efforts de celui qui\npompait, l'eau montait toujours dans notre frêle embar-\ncation, et que nous étions menacés de sombrer dans les\neaux profondes du lac, avant même d'avoir découvert le\nrivage. Grâce à la divine Providence, après de grands\nefforts, nos avirons touchèrent le sable, ce qui nous an-\nnonçait que la rive n'était pas éloignée, et bientôt après,\nen effet, nos pieds touchèrent terre.\n\n« Notre premier soin fut d'allumer un feu afin de sécher\nnos vêtements qui étaient un peu mouillés, et à peine\nétions-nous installés, que le vent et la pluie se déchaînèrent\nsur nous. Quoique leur visite fût fort peu agréable, dans la\nsituation où nous nous trouvions, je bénis cependant le\nbon Dieu, avec un grand sentiment de reconnaissance,\nd'avoir attendu que nous fussions sortis du lac, pour\nnous les avoir envoyés. C'est préoccupé de ces pensées\nque je fus me coucher au pied d'un arbre, et y trouver\nun paisible et doux sommeil. Le lendemain, nous re-\nprimes notre route, malgré que les eaux fussent en-\ncore agitées. Bientôt le vent étant devenu plus fort, nous\nfûmes obligés de gagner la seule île qui se trouve dans\nce lac ; c'était la Providence qui nous y poussait, car\nelle nous y avait préparé comme une nouvelle manne,\nnous y trouvâmes une quantité d'œufs si considérable,\nque, ne vivant pendant quatre jours que de cette nour-\nriture, la provision n'en parut pas diminuée; ces œufs\nne nourrissent point comme ceux des poules domestiques,\nil nous en fallait une plus grande quantité pour nos re-\npas, qu'il fallait encore renouveler plusieurs fois par jour.\n« Notre route se continua, après quelques jours de repos, sans interruption. Sans doute, quand on navigue dans des rivières comme l'Attabaskaw, où les rapides se succèdent fréquemment, il est rare de ne pas y éprouver quelques accidents ; mais, enfin, nous nous en tirâmes sain et sauf. Les chevaux que nous avions laissés à notre départ, au moment où il avait fallu prendre la navigation, avaient eu le temps de se reposer et de prendre de l'embonpoint. Après une journée de recherches, nous les trouvâmes non loin des lieux où nous les avions laissés, et, trois jours après, je rentrai dans ma chère résidence de Sainte-Anne, que je trouvai hélas ! solitaire, c'est ce qui modère la joie que l'on éprouve de rentrer chez soi. À mon arrivée, beaucoup de travaux m'y attendaient, outre ceux du saint ministère : j'avais à sarcler, à biner mon jardin et à cultiver mes légumes ; j'avais aussi à visiter mes confrères de Saint-Albert, à vingt-quatre lieues de ma résidence, afin de pouvoir me confesser.\n\n« C'est au milieu de ces soins, qu'un jour, vers la mi-septembre, je vis venir à moi un jeune homme exprimant sur sa figure la joie qu'il avait de me revoir. Comme ses traits ne m'étaient point familiers, je ne le reconnus point d'abord, mais bientôt je le remis pour l'un de mes bons métis iroquois des montagnes Rocheuses. Il venait, comme délégué des siens, pour m'inviter à me rendre dans leur tribu.\n\n« Il était porteur d'une lettre que m'adressaient, en sauvage, ses compatriotes, portant ces simples mots, plusieurs fois répétés : « Toi, prêtre, maître au lac Sainte-Anne, viens donc nous voir ; douze enfants te demandent pour être baptisés, et tous les autres pour se confesser. Tu ne viendras pas inutilement, nous te donnerons des pelleteries. » Il y avait longtemps que j'avais le désir\nd'aller visiter ces pauvres gens, mais les moyens m'avaient manqué; ils me manquent plus que jamais au moment où je reçois leur invitation, mais comment refuser de me rendre à une demande aussi pressante? Il me faut quatre chevaux pour me rendre chez eux, et je n'en ai que deux; deux compagnons me sont nécessaires pour la route difficile que je dois suivre, et je n'ai rien pour les payer. Dieu va y pourvoir. Un excellent chrétien arrive sur ces entrefaites de la Rivière-Rouge, et se propose comme moi de diriger ses pas vers les montagnes Rocheuses, non point pour y gagner les âmes, mais pour y trafiquer. Nous concertons ensemble le moyen de nous y rendre, ce qui consistait en grande partie à partager les mêmes peines et les mêmes fatigues, et à fournir chacun deux chevaux, et le 17 septembre, nous quittons la résidence de Sainte-Anne, nous dirigeant vers l'ouest, ayant pour guides les métis iroquois qui étaient venus me chercher. Nous avions à suivre des chemins impossibles et par un temps affreux, car durant les dix jours que dura le voyage, la pluie et la neige tombèrent alternativement presque tous les jours; à ces misères je pourrais ajouter celle de la nourriture la plus chétive.\n\n« Le 27 septembre, arrivé aux pieds des montagnes Rocheuses, je fis la rencontre de quelques familles de ces métis iroquois, qui nous dressèrent une tente auprès des leurs. Aussitôt, il s'en détacha plusieurs courriers qui se hâtèrent d'aller annoncer mon arrivée à ceux de leur tribu qui étaient répandus dans les vallées. Bientôt je pus commencer les exercices de la mission, qui me procurèrent, vu les excellentes dispositions de ces excellents chrétiens, les plus douces consolations. Oh! comme je me sentais amplement payé de mes fatigues, quand je les voyais si fidèles aux pratiques de la religion et si généreux pour le service de Dieu!\n« Le 9 novembre, ma mission était terminée ; je dus quitter ces bons métis pour reprendre le chemin de Sainte-Anne, n'ayant avec moi qu'un seul compagnon de voyage. Toute la population, y compris les femmes et les enfants, voulut m'accompagner durant quelques milles, voulant par là me témoigner leur affection et leur reconnaissance. Je ne vous raconterai point les difficultés du retour et les fatigues qui en étaient inséparables. J'arrivai à Sainte-Anne le 17 novembre, par un temps de neige. J'avais porté avec moi, dans ma mission, toute la provision de vin de messe que j'avais ; à mon retour, je ne pus donc dire la sainte messe ; je dus repartir le lendemain pour Saint-Albert, afin de la renouveler et voir par la même occasion mes frères. Je passai quelques jours au milieu d'eux, jouissant de la vie de famille, bonheur dont on ne connaît bien le prix que quand, comme moi, on en est privé. Après ces jours de joie et de consolation passés à Saint-Albert, je dus revenir à ma mission de Sainte-Anne, qui réclamait ma présence. J'ai à faire ma provision de poisson, couper le bois de chauffage, et puis charrier les foins. N'ayant qu'un seul domestique, je dois m'occuper comme lui et autant que lui de ces divers travaux. Ces préoccupations des soins matériels et le temps qu'ils absorbent ne nous empêchent pas, sans doute, de remplir nos devoirs de religieux et de missionnaire, à l'égard de ceux dont les intérêts spirituels nous sont confiés ; mais il ne nous disposent point à faire des rapports intéressants : je vous donne cette raison comme excuse pour la pauvreté de ma lettre.\n\n« Veuillez agréer, très-révéré et bien-aimé Père, l'hommage du respectueux dévouement de votre très-dévoué fils en Jésus-Christ et Marie-Immaculée.\n\n« M. Rémas, prêtre, O. M. I. »", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009543.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 15036, "total-output-tokens": 4978, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1671, 2], [1671, 3516, 3], [3516, 5427, 4], [5427, 7240, 5], [7240, 9154, 6], [9154, 11039, 7], [11039, 12841, 8], [12841, 14691, 9], [14691, 16470, 10]], "primary_language": ["None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]