[{"id": "9dbc273a149347b6dc153e711ccf11634254af2d", "text": "LETTRE DU R. P. LACOMBE AU T. R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Albert, fête de l'Epiphanie,\n6 janvier 1866.\n\n« MON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\n« Voici revenue, une fois encore, une époque pendant laquelle je puis me donner la consolation de vous écrire et de vous adresser le rapport des travaux qu'il m'a été donné d'accomplir, cette année surtout. Il me semble ne pouvoir mieux commencer ce travail qu'en ce beau jour de l'Epiphanie, qui fut le jour où commença la vocation des Gentils. Ah ! combien je ressens le besoin de vous dire les peines et les joies que j'ai trouvées sur ma route, en tâchant de gagner à Dieu les pauvres sauvages infidèles, au milieu desquels l'obéissance m'a envoyé, et au salut de qui je dois consacrer mes forces, ma santé, ma vie tout entière.\n\n« Ordinairement seul ici parmi eux, ne pouvant converser qu'avec des infidèles et tout au plus avec des gens qui ne font que commencer à prier, j'éprouve un sentiment de bonheur difficile à rendre à la seule pensée que j'écris à un père auquel rien de ce qui touche le dernier de ses enfants ne saurait être indifférent, qui m'écoute avec bonté, partagera mes peines et mes espérances.\n\n« Peut-être, au reste, bien que je ne sois pas exercé dans l'art d'écrire, ne vous sera-t-il point sans intérêt d'entendre parler des sauvages de la Prairie. Bien que vous ayez souvent entendu parler des sauvages, je pense que vous avez rarement entendu parler de ces tribus nomades et barbares, dont je tâcherai de vous donner une idée. Elles habitent les terres qui s'étendent depuis la Saskatchewan jusqu'au Missouri. Dans mes rapports à\nmes supérieurs, je tiendrai toujours à les mettre au courant non-seulement de ce que je puis faire pour la gloire de Dieu, mais de tout ce qui concerne les besoins et l'état de ma mission, et les espérances qu'elle donne pour l'avenir. Je voudrais leur bien faire comprendre combien nos pauvres missions ont un pressant besoin de leur secours. Il n'y a que le cœur du Missionnaire qui y travaille qui soit capable de le comprendre entièrement; bien des fois, je l'avouerai avec simplicité, j'ai versé des larmes abondantes, à la vue de ces vastes camps de malheureux Indiens encore assis à l'ombre de la mort: « Pourquoi pleures-tu, venaient-ils me dire alors ? Est-ce que quelqu'un d'entre nous t'a causé de la peine ? — Non, leur disais-je, personne d'entre vous, et cependant je pleure sur vous. Je pleure de voir que vous ne connaissez pas encore la prière. » Mais il faut être ici, vivre au milieu de ces tribus, pour comprendre les sentiments que doit éprouver un prêtre, un Missionnaire, témoin des misères de toute nature que l'on y trouve.\n\n« J'entre maintenant en matière et je tâcherai de n'être pas trop long.\n\n« Je vous parlais, dans ma dernière lettre, au mois d'avril dernier, si je ne me trompe, d'une grande mortalité qui avait eu lieu dans ce pays, et principalement au milieu de la tribu des Pieds-Noirs. Une grande partie des enfants que je baptisai à cette époque sont morts, comme j'ai pu m'en assurer depuis lors. Plusieurs adultes aussi ont eu le bonheur de rendre leur âme à Dieu peu après leur baptême.\n\n« Après avoir passé une partie du printemps avec les Cris, et avoir choisi l'emplacement convenable pour une nouvelle mission au milieu d'eux, je revins à la résidence de Saint-Albert, où je passai les fêtes de Pâques, tout en desservant la mission de Saint-Joachim. Jeus, pendant ce\ntemps-là, l'occasion d'aller faire une mission au fort des Montagnes-Rocheuses, et cela sur les instances réitérées du bourgeois du fort des Prairies. À la fin de mai, je remontai la rivière Saskatchewan jusqu'à la nouvelle mission de Saint-Paul. Là, je trouvai beaucoup de sauvages qui m'attendaient, pour faire sous ma direction quelques semences d'orge et de pommes de terre. Il n'y avait pas deux heures que j'étais débarqué que déjà ma charrue était prête à fendre la terre. J'étais seul avec mes Indiens ; je n'avais pas un seul blanc pour m'aider, si ce n'est le cher Gaspard qui, depuis deux ans, ne cesse de se sacrifier pour secourir les missionnaires. C'est donc à moi qu'il revint de conduire la charrue ; deux sauvages conduisaient les bœufs. Vous n'auriez pu vous empêcher de rire, en voyant ce laboureur improvisé, entouré et suivi par des Indiens au nombre de plusieurs centaines, hommes, femmes, enfants, qui ne pouvaient se rassasier de voir la terre s'ouvrir si facilement devant le soc.\n\n« En quelques jours, j'eus labouré un morceau de terrain assez considérable, que je divisai en petits carrés, dont chaque famille eut le sien, pour y déposer ses semences, ce qui se fit avec beaucoup d'ardeur. J'en étais d'autant plus heureux qu'on ne saurait croire combien j'avais eu de peines et de difficultés à me procurer ces diverses semences. Ce fut un travail bien pénible que celui auquel il fallut me livrer pendant tout le temps que je restai à ce poste. Je ne pouvais dire la sainte messe que de très-grand matin, et, dans le cours de la journée, afin de pouvoir réciter mon office et vaquer à mes exercices de piété, j'étais obligé d'aller me cacher dans un bois voisin. À midi et vers le soir, je réunissais les enfants pour leur faire le catéchisme. J'avais de plus à visiter les malades ; vous voyez que tous mes instants étaient bien employés.\n« Je passai ainsi quelques semaines avec mes nouveaux laboureurs, dont beaucoup étaient déjà chrétiens et quelques-uns catéchumènes, puis ils se préparèrent à partir pour la chasse aux buffles, car c'est là la seule ressource pour ne pas mourir de faim. J'eus bien de la peine à me séparer d'eux. Ils se montraient si pleins d'attachement pour moi et manifestaient de si bonnes dispositions, que je leur promis de venir les revoir dans le courant de l'été, pour peu que le bon Dieu me conservât la santé jusqu'alors. Il fallut deux jours pour que toute la tribu traversât la rivière. Je crois qu'il vous serait bien difficile de vous faire une idée du spectacle que présentaient tous ces sauvages, au nombre au moins de mille, au moment où ils traversaient la rivière large et rapide de la Saskatchewan. Les uns avaient construit, pour effectuer ce passage, un large radeau ; les autres avaient fabriqué avec leurs tentes une sorte de bateau sur lequel une famille sauvage se tenait du mieux qu'elle pouvait, tandis qu'un bon nageur la conduisait avec effort à l'autre rive, dirigeant, à l'aide d'une ficelle qu'il tenait entre ses dents, la frêle embarcation qui la portait. Il eût fallu surtout entendre les cris de toute cette foule et le vacarme qu'elle faisait.\n\n« Mais pour que vous compreniez mieux le tableau que présente toute une tribu en marche, il sera bon de vous dire en quoi consistent la fortune et le ménage d'un sauvage nomade, dans nos contrées. La richesse s'estime principalement par le nombre des chevaux ; on est censé riche quand on en possède de huit à quinze. J'ai vu cependant, chez les Pieds-Noirs, des chefs qui avaient jusqu'à soixante chevaux, ce qui est ici une fortune très-considérable ; aussi un pareil sauvage ne peut manquer d'obtenir une grande considération dans sa tribu. Plus quelqu'un parmi eux a de chevaux, plus il est chef. Presque toutes les guerres qui ont lieu entre des tribus\ndifférentes ont pour principale cause le désir de l'une d'entre elles de s'emparer des chevaux de l'autre. On ne saurait dire les haines, les vols, les massacres, qui naissent à cette occasion. Autrefois, disent les vieillards, il n'en était pas ainsi, il n'y avait pas de chevaux, il n'y avait que des chiens, et alors tous les sauvages étaient frères. Ils regrettent ce vieux temps.\n\n« Chaque famille sauvage a une tente formée d'un certain nombre de peaux de buffle, allant jusqu'à vingt-cinq, selon la dignité de celui qui les occupe. On les construit au moyen d'une quinzaine de perches, disposées de manière à donner à cette maison ambulante la forme conique. Au sommet est pratiquée une ouverture, par laquelle la fumée s'échappe tant bien que mal. C'est à la femme qu'il appartient d'élever chaque soir la loge au moment du campement, et de la défaire le lendemain matin, au moment du départ. Il faut, de plus, qu'elle prenne soin de se procurer le bois destiné à chauffer toute la famille au moment du campement, et c'est là souvent une rude besogne, car il lui faut apporter de bien loin et sur son dos le bois nécessaire à cet usage. À l'intérieur sont disposés, autour de la loge, les lits ou plutôt les misérables peaux de buffle qui en tiennent lieu ; au milieu est le foyer.\n\n« Quant aux objets de ménage qui se rencontrent en ces huttes, ils consistent simplement en plusieurs chaudières, deux ou trois haches et quelques couteaux. Nos sauvages ne possèdent rien autre chose, sinon leurs fusils et leurs flèches, qui, après les chevaux, sont les objets les plus estimés chez eux.\n\n« Après le départ de toute cette tribu de Cris, je me préparai à rentrer à la mission de Saint-Albert, où je devais trouver notre nouveau supérieur, le P. Tissot. Je laissai, en la confiant aux soins du cher Fr. Alexis, notre petite ferme, à laquelle je me promettais bien de\nrevenir le plus tôt possible. Après un voyage de trois jours, j’étais de retour à la résidence de Saint-Albert, où j’embrassais des frères avec lesquels j’étais heureux de pouvoir venir passer un peu de temps.\n\n« Je tâchai, pendant ce nouveau séjour à la mission, d’aider le bon P. Tissot, dans les travaux auxquels il présidait; je fis quelques jours de retraite, et me préparai à aller rejoindre les Cris dans les prairies, où ils chassaient. Je m’embarquai donc, le 7 juillet, dans un canot que j’avais fait construire pour la mission, et, deux jours plus tard, j’avais le bonheur de revoir le cher Fr. Alexis, et les champs que j’avais cultivés avec lui.\n\n« Comme les sauvages n’étaient pas rentrés à Saint-Paul, je me disposai à les aller chercher dans la prairie, et, après avoir fait les quelques préparatifs nécessaires pour cette excursion, je partis avec une famille qui se rendait au milieu d’eux. Nous les rencontrâmes après quatre jours de marche. J’avais avec moi une charrette, deux chevaux, une tente, une caisse renfermant ma chapelle et quelques couvertures pour me servir de couche, pendant la nuit. C’était là tout mon bagage.\n\n« Les Cris me revinrent avec bonheur, mais avec mon arrivée coïncidèrent quelques fâcheuses circonstances qui faillirent causer une bien mauvaise impression sur ces pauvres gens, encore trop superstitieux et tout à fait ignorants. J’arrivais à peine dans le camp qu’un vent violent s’éleva, et renversa, en un instant, une partie des loges. Un enfant de huit ans fut tué raide, une des perches qui forment les loges lui ayant fracassé la tête. J’arrivai trop tard à son secours, bien que je fusse accouru de suite, pour lui conférer le saint baptême. Pour comble de malheur, le feu s’échappa bientôt des loges renversées, et l’incendie gagna la prairie avec une très-grande rapidité. En vain chacun fit tous ses efforts pour\nl'arrêter, il fut impossible d'y réussir, car le vent poussait à des distances considérables de nombreux tourbillons de flamme. Je craignais beaucoup que ce malheur n'eût des conséquences plus funestes encore que celles qui apparaissent aux yeux à la suite de tout désastre de ce genre; heureusement il n'en fut rien. Une forte pluie que le bon Dieu nous envoya, arrêta les progrès du feu, et mit fin à la grande terreur dont la tribu avait été frappée. Tous les esprits retrouvèrent le calme.\n\n« Je commençai dès lors à suivre les Cris dans leurs différentes marches; ils étaient toujours à la recherche des buffles. Quand, un jour, on avait fait bonne chasse, la tribu demeurait au même campement pendant tout le temps nécessaire pour faire sécher la viande et préparer les peaux de buffle. C'était surtout pendant ces jours-là que j'avais plus de facilité pour instruire mes sauvages. Le matin, après mes exercices de piété, je réunissais les femmes au milieu du camp; je leur apprenais leurs prières et divers cantiques, puis je leur faisais une instruction. Elles retournaient après cela à leurs occupations et je commençais de suite mes visites aux malades; après ce ministère de charité, je me rendais auprès de ceux qui ne voulaient pas venir aux instructions, ou, en d'autres termes qui ne voulaient pas prier; je répondais aux objections qu'ils me présentaient. J'avais ensuite à remplir les fonctions de juge de paix et à vider les différends qui s'étaient élevés entre eux; il n'était pas toujours aussi facile d'accommoder les parties adverses que je l'aurais désiré.\n\n« Vers midi, je sonnais de nouveau ma clochette, et je réunissais les enfants, dont l'empressement à venir assister à mes instructions me donnait beaucoup de consolation. J'étais, en un instant, entouré de tous ces petits Indiens, qui m'aimaient comme leur père, et chantaient\ndes cantiques de toute la force de leurs poumons. Après cet exercice, je me rendais au bois voisin, afin d'y trouver un peu de tranquillité et de réciter mon breviaire. Puis, je rentrais au camp, pour continuer à visiter ceux de mes pauvres sauvages que je n'avais pu voir le matin. Enfin, dans la soirée, je réunissais les hommes, auxquels j'adressais une instruction, après laquelle, tout en fumant le calumet, chacun me faisait des questions relatives aux superstitions du pays et à notre sainte religion. Le dimanche, tout le monde assistait, en même temps, aux divers exercices de piété, à la sainte messe et au chapelet. Ce fut ainsi que je passai à peu près toutes mes journées pendant un mois et demi.\n\n« Comme il serait trop long et trop ennuyeux de raconter les incidents de ce voyage, je reviens de suite à Saint-Paul, où j'avais laissé le cher Fr. Alexis. Ce bon frère, avec l'aide d'un sauvage, avait construit une sorte de maison, qui était loin d'être un château ; comme elle était encore inachevée, je me mis à la besogne, pour terminer les travaux de construction, et au bout de quelques jours nous entrions dans cette nouvelle demeure, un peu plus confortable qu'une loge.\n\n« Au commencement de septembre, j'allai rendre visite aux Pères qui résident à la mission du lac La Biche. Le P. Maisonneuve me reçut avec la plus grande bonté. Je repartis après avoir eu la consolation de me confesser et de faire ma retraite du mois.\n\n« Quand je rentrai à Saint-Paul, je trouvai mes sauvages qui y arrivaient eux-mêmes. Ils venaient revoir leurs travaux de culture. Je vous assure que leurs récoltes ont été bien promptement faites, et peut-être plus promptement encore consommées. Au reste, nous n'avions voulu faire qu'un essai, et chercher à apprendre aux Gris à cultiver leurs terres, qui sont fertiles. Notre\ndébut n'a pas été malheureux, et si M. Taché peut venir à notre aide, malgré les charges si lourdes qui pèsent sur lui, nous avons l'espérance de réussir assez bien dans la suite.\n\n« Les sauvages passèrent une vingtaine de jours campés aux environs de la mission. Ils se décidèrent ensuite à reprendre le chemin de la prairie pour se préparer à la grande chasse de l'hiver. De mon côté, je tâchai de mettre ordre à mes affaires ; je donnai au bon Fr. Alexis les recommandations convenables, lui adjoignis quelques serviteurs, et je pris la route qui devait me reconduire à Saint-Albert.\n\n« À mi-chemin, j'eus pour la troisième fois l'occasion de voir la mission protestante qui porte le nom de Victoria. Elle est située, comme la nôtre, sur le bord de la rivière, et le fanatisme wesleyen a fait de très-grandes dépenses pour la rendre un établissement important. Les ministres y font aux sauvages beaucoup de présents et surtout beaucoup de promesses pour les engager à embrasser la prière anglaise. Ils réussissent malheureusement assez bien auprès d'un certain nombre de ces pauvres gens, qui ne comprennent point la différence entre la vraie et la fausse religion. La Compagnie de la baie d'Hudson vient de bâtir un fort de traite à Victoria, et cela suffit pour attirer les sauvages à ce poste, où les attendent toujours le ministre et ses catéchistes.\n\n« Vous avez, sans doute, déjà entendu dire que les ministres commencent à prendre, en ce pays, beaucoup d'influence. Pendant plusieurs années, ils n'y ont presque rien fait ; puis leurs ressources ont augmenté. En outre, on a mis à la tête de leurs établissements des hommes plus capables, sachant bien mieux les moyens à employer pour gagner les pauvres sauvages à leur secte. Or, lorsque quelqu'un dans notre contrée est devenu pro-\ntestant, c'est-à-dire s'est converti à la religion anglaise, il est presque impossible de le ramener à la vérité, surtout s'il s'agit d'un sauvage. Il n'y a à cette règle que de rares exceptions. C'est pour cela que nous regardons comme une chose si importante de nous trouver les premiers auprès des infidèles, et de leur donner nos soins avant qu'ils aient vu aucun ministre. Nous n'avons jamais aucune discussion publique sur la religion avec ces ministres, et de pareilles discussions nous feraient plus de mal que de bien, aux yeux des sauvages. Mais si l'on nous questionne, comme il arrive très-souvent, sur la différence de croyances religieuses, entre nous et les protestants, nous expliquons simplement la doctrine catholique, par rapport surtout aux points attaqués par l'hérésie : le célibat des prêtres, la confession auriculaire, etc.\n\n« Cette doctrine prévient beaucoup en notre faveur l'esprit des sauvages, et je dois dire, à ce sujet, que j'ai trouvé parmi tous ceux qui habitent les prairies cette double croyance : 1° qu'il faut, pour obtenir le pardon d'un grand crime, en faire secrètement l'aveu à un homme de conduite sage ; 2° que, pour accomplir dignement un grand acte religieux, il faut être chaste.\n\n« Je rentrai à la maison de Saint-Albert, au commencement d'octobre, et j'eus le bonheur, une fois encore, d'y embrasser des frères. Que l'on est heureux en ces circonstances ! Pour bien comprendre la consolation que l'on goûte, il faut l'avoir éprouvée soi-même. Mais je ne devais pas tarder à quitter de nouveau Saint-Albert. Mme Taché et le R. P. Visiteur, lors de leur passage ici, m'avaient chargé d'aller voir les Pieds-Noirs et les tribus alliées qui habitent les prairies. C'était une pénible mission que l'on me confiait, car un long voyage, en la saison rigoureuse où je l'entreprenais, ne peut avoir lieu sans que le Mission-\nnaire qui l'accomplit n'ait beaucoup à souffrir. Cependant, je l'avoue, j'étais bien content d'avoir cette nouvelle occasion de faire pénitence pour mes nombreux péchés. Puis, j'allai vers une mission naissante qui, naguère, m'avait appelé à son secours au moment même où une si terrible épidémie la décimait, qu'il me serait impossible de jamais oublier les scènes douloureuses dont je fus le témoin, et dont je vous ai parlé dans une lettre précédente. J'étais donc heureux d'aller revoir ces sauvages, auxquels j'avais promis alors de venir les retrouver le plus tôt que je le pourrais.\n\n« Ainsi, après avoir pris les ordres de notre Père Préfet, je me mis en route pour le fort de la montagne de Roche, à la suite de la caravane que la Compagnie de la baie d'Hudson y envoyait. C'était à ce poste que j'espérais rencontrer les Pieds-Noirs, qui viennent y échanger leurs vivres et leurs pelleteries pour des fusils, du tabac, des habits, etc. De plus, je devais y trouver M. Hardisty, dont l'hospitalité bienveillante et toutes les prévenances ne pouvaient manquer d'être et ont, en effet, été d'un grand secours pour moi.\n\n« Nous voilà donc en route. Nous partons par un temps magnifique, après avoir reçu les bons souhaits de toute notre population. La distance qui sépare Saint-Albert du fort de la montagne de Roche est de cent cinquante milles. Nous n'en avions pas fait trente, qu'une neige épaisse commença à tomber, et cela dura pendant trois jours. Cette neige abondante et inattendue rendit notre route bien difficile. Nos chevaux ne pouvaient avancer qu'avec grand'peine, car les roues de nos voitures, embarrassées par la neige et les glaçons qui s'y attachaient, ne faisaient plus que difficilement leur service. En outre, si nous avions le malheur de heurter quelque arbre dans notre marche, nous faisions tomber sur nos têtes une avalanche.\nCe ne fut donc pas sans efforts que nous atteignîmes, après quatorze jours de voyage, le fort de la montagne. Ma course n'était pas achevée. Je ne trouvai au fort qu'un petit nombre de Pieds-Noirs, car la plus grande partie d'entre eux, fatigués d'y attendre trop longtemps notre arrivée, s'étaient éloignés de ce poste où les vivres manquaient. Au bout de deux jours, les échanges entre les Pieds-Noirs et la Compagnie étaient terminés, et je pus partir avec mes sauvages, pour me rendre à leur camp, où toute la tribu m'attendait depuis longtemps et avec impatience.\n\n« Mon intention était de me rendre le plus rapidement possible au lieu où ils avaient campé, et de rester au milieu d'eux aussi longtemps qu'il me serait permis de le faire ; mais je dus faire beaucoup plus de chemin que je ne pensais, avant d'arriver au milieu d'eux, car la disette se faisant toujours sentir, ils s'avançaient de plus en plus loin à la poursuite des buffles. Nous avions nous-mêmes bien peu de vivres, et si la divine Providence ne nous eût offert, le long de notre route, quelques lièvres et quelques perdrix, nous nous serions souvent couchés sans souper.\n\n« Après six jours de marche, j'arrivai à un camp de Piéganes, que je connaissais et dont plusieurs enfants avaient déjà été baptisés. Je dus passer deux jours au milieu d'eux, pour leur donner quelques instructions, baptiser leurs enfants et visiter leurs malades. Puis, je repartis avec quelques sauvages. Nous rencontrâmes encore, avant d'arriver chez les Pieds-Noirs, les Gens-du-Sang sur les bords de la rivière La Biche.\n\n« J'étais à peine arrivé aux premières loges que le chef de cette nation, Sotena, qui est mon grand ami, vint se jeter dans mes bras, tant il était heureux de me revoir, après une absence aussi longue que celle que j'avais faite. Je fus obligé de m'arrêter encore, et de passer quelques\njours avec les Gens-du-Sang. J'avais déjà composé quelques prières et quelques cantiques en leur langue; je m'occupai, jour et nuit à les leur apprendre. Pour les instructions, je dus me servir d'interprète, et je fus assez heureux pour en trouver un qui parlait bien le cris.\n\n« La tribu, que j'évangélisai ainsi quelques jours, souffrait beaucoup de la disette, et nous étions bien heureux quand le soir nous pouvions avoir un peu de viande sèche pour apaiser notre faim.\n\n« Un soir nous ne fûmes pas même assez heureux pour nous procurer ce léger souper; c'était après une journée bien fatigante, passée tout entière à voyager dans la neige et par le froid le plus piquant. Le lendemain, je dus marcher à jeun pendant toute la journée, mais enfin j'arrivai vers le soir au camp des Pieds-Noirs, sur les bords de la rivière Bataille, et là, bien que les vivres n'y fussent point abondants, nous pûmes nous réconforter un peu.\n\n« Au camp des Pieds-Noirs, je fus logé dans la demeure même du grand chef de la tribu : ce chef s'appelait Nutous, c'est-à-dire le Soleil.\n\n« Les Pieds-Noirs avaient formé trois camps. Celui dans lequel je me trouvais, et où j'espérais me reposer enfin des fatigues de mon long voyage, tout en étudiant la langue des Indiens que je venais évangéliser, se composait de quarante-cinq loges. Un autre en possédait cinquante, et le troisième soixante. Je vous donne ces détails pour que vous puissiez mieux comprendre l'épouvantable scène qui ne devait pas tarder à avoir lieu. De mémoire d'homme, l'on n'a entendu parler de choses semblables dans ces prairies.\n\n« Le jour même de mon arrivée, j'avais engagé fortement les Pieds-Noirs, à se réunir en un seul camp, parce qu'il était important pour eux de se tenir en garde contre leurs ennemis. Soit par négligence, soit pour quelque\nautre motif, je ne fus pas écouté, et les camps restèrent divisés.\n\n« Le 4 décembre, au soir, j’avais terminé la réunion des hommes ; nous avions récité la prière et chanté des cantiques. Chacun était retourné à sa loge pour se reposer. Resté seul avec le chef et sa famille, dans leur loge, étendu sur ma modeste couche, j’allais aussi prendre mon repos. Mon Dieu ! je ne me doutais pas, dans ce moment, qu’une foule d’ennemis, cachés tout près de nous, au milieu des arbres, n’attendaient que le moment où le feu de toutes les loges aurait été éteint, pour attaquer notre camp. On dit que le nombre de ces ennemis était d’un millier d’hommes, et se composait d’Assiniboines, de Sau-teux et de Cris, venus jusque des bords de la rivière Castor. — Tout le monde dormait profondément. Tout à coup Natous se lève avec précipitation, et saisissant son fusil, il crie en pied-noir d’un ton lugubre : Assinaw ! Assinaw ! Les Cris ! les Cris ! » Il n’avait pas achevé ces mots qu’une terrible détonation se fait entendre, et que des balles viennent de toutes parts percer nos loges. C’était celle du chef, dans laquelle je me trouvais, qui était la plus exposée. Mais, je dois vous dire que les ennemis ignoraient que je fusse au milieu des Pieds-Noirs, car, jamais nos Indiens n’auraient osé attaquer le camp, s’ils avaient su qu’un prêtre s’y trouvât, tant ils ont de respect pour lui, lors même qu’ils sont encore infidèles. Mon bien-aimé Père, je me reconnais incapable de vous exprimer ce que j’ai vu et ressenti dans cette épouvantable nuit du 4 au 5 décembre. Mon chef s’était jeté, avec sa famille, en dehors de la loge qu’il habitait et encourageait tous ses hommes à donner courageusement leur vie. Dès la première décharge, deux perches de notre loge avaient été brisées et je voyais des bourres de fusil enflammées tomber à mes pieds.\n« Je me levai, sans être trop effrayé pourtant, car depuis quelques jours je m'attendais un peu à ce que je voyais se passer. Je saisissais ma soutane et je la revêtais promptement, j'attachai mes souliers, puis je baisai ma croix, faisant à Dieu de bon cœur le sacrifice de ma vie. Je suspendis ensuite à mon côté le sac qui contenait les saintes huiles. J'entendais siffler les balles autour de mes oreilles, pendant tout ce temps. Je sortis enfin et, me tournant vers les ennemis, je tâchai de me faire entendre et reconnaître ; c'était impossible, le tumulte était à son comble. On ne peut se faire une idée de la confusion qui régnait alors.\n\n« Imaginez-vous une nuit obscure, éclairée seulement par la sinistre lueur de la poudre enflammée, produite par les coups de fusil vivement répétés ; ajoutez à cela les chants de guerre, les discours des chefs qui encouragent les jeunes gens, les cris de désespoir des mourants et des blessés, les lamentations des femmes et les pleurs des enfants qui ne savent où s'enfuir, le hennissement des chevaux et les aboiements sourds et prolongés des chiens : tout faisait de cette scène d'horreur quelque chose d'effrayant et avait de quoi épouvanter les plus intrépides.\n\n« Pour comble de malheur, nous étions presque sans défense, car le plus grand nombre de nos hommes étaient depuis deux jours partis pour la chasse. Si Dieu ne nous avait protégé d'une manière toute spéciale, il est sûr que personne d'entre nous n'eût échappé à la mort ! Notre camp était rasé.\n\n« Quand je vis qu'il m'était impossible de me faire entendre des assaillants et d'arrêter ce combat nocturne, j'encourageai les chefs à donner courageusement, s'il le fallait, leur vie pour leur nation. Pour moi, je courus vers les mourants et les blessés. Ces pauvres sauvages me prenaient par mes habits, me serraient les mains, qu'ils ne\nvoulaient plus lâcher, et me disaient : « Kimmo kinnan, djimo hikkat : «prends pitié de nous, prie pour nous.\n\n« La première victime que je rencontrai fut une jeune femme qui venait de recevoir une balle au front, tout près de moi, au moment où elle sortait de sa loge. En voulant moi-même rentrer dans cette loge, je pressai sous mes pieds le corps de cette malheureuse femme baignée dans son sang. Je me baissai aussitôt et demandai à cette infortunée si elle voulait mourir chrétienne. Sur sa réponse affirmative, je saisissi, à la lueur de la fusillade, un vase d'eau qui se trouvait près de là, heureusement ; je lui en versais sur la tête une partie et la baptisai. Quelques minutes plus tard, les ennemis s'emparaient de la loge de cette femme, à laquelle ils enlevèrent la chevelure, et égorgèrent un enfant à la mamelle, que je n'avais pu voir, bien qu'il se trouvât dans cette même loge. Les ennemis s'emparèrent ainsi de vingt-cinq loges, qui furent mises en pièces. Tout ce que je possédais fut enlevé et porté je ne sais où. Mon breviaire seul me fut laissé. Un Assiniboine s'en était déjà emparé, m'a-t-on dit, quand une balle vint renverser ce malheureux, et l'étendit mort tout près du lit où je reposais un instant plus tôt. Un Pied-Noir, qui l'avait aperçu, s'était élançé sur lui, lui avait enlevé la chevelure et pris mon breviaire, qu'il me remit un peu plus tard.\n\n« Cependant les guerriers des autres camps de Pieds-Noirs, ayant entendu la fusillade, ne tardèrent pas à arriver pour porter secours à leurs frères. Le feu ne discontinue point. Trois fois les ennemis essayèrent de s'emparer de tout notre camp, et trois fois ils furent repoussés. — Que j'attendis le jour avec impatience, et que cette horrible nuit me parut longue ! — Enfin, l'aurore vint à paraître, je me revêlis alors de mon surplis et de mon étole ; puis, tenant d'une main le drapeau de parlementaire et de l'autre ma croix, je m'avançai vers les combattants. Les\nPieds-Noirs cessèrent le feu, car ils pouvaient, eux, facilement me voir et m’entendre, mais un épais brouillard et la fumée que la fusillade avait produite me dérobaient à la vue des Cris. J’avais beau leur faire des signes, le feu continuait, les balles tombaient à mes pieds ou sifflaient à mes oreilles. Les combattants dont j’avais arrêté le feu me criaient de me retirer, quand une balle, qui sans doute avait déjà touché la terre, rebondit sur mon épaule gauche et vint de là me frapper au front. Je faillis être renversé ; je crus alors devoir me retirer et revenir près des Pieds-Noirs.\n\n« Le combat recommença alors avec une nouvelle ardeur, mais les combattants étaient à distance les uns des autres. Ce ne fut qu’à onze heures du matin que nos ennemis commencèrent à reculer définitivement. Un Pied-Noir leur avait crié, paraît-il : « Vous avez blessé le prêtre. C’est assez. » Et les Cris répondirent : « Nous ne savions pas que le prêtre était au milieu de vous. Puisqu’il en est ainsi, nous ne voulons plus nous battre. »\n\n« Du côté des Pieds-Noirs, douze personnes ont été tuées, deux enfants ont été enlevés et faits prisonniers. Quinze hommes ou femmes ont été blessés, trois dangereusement ; deux cents chevaux au moins ont été enlevés ou tués par les Cris. Du côté de leurs ennemis, il y a eu dix hommes tués et cinquante blessés, dont plusieurs mortellement. Telle a été cette triste affaire, dans laquelle j’ai failli perdre la vie, ainsi que tous les sauvages du côté desquels je me trouvais et qui, après la bataille, venaient m’embrasser, me remercier et me dire que j’étais divin, puisque les balles n’avaient rien pu sur moi. Je n’ai jamais moins redouté la mort que pendant le combat dont je viens de parler. Je m’attendais bien, à chaque instant, à être renversé, et je n’en étais pas effrayé. Dieu n’a pas encore voulu de moi ; son but a été peut-être de\nmontrer à mes pauvres infidèles sa puissance et sa bonté à l’égard de ceux qui mettent en lui leur confiance, et de leur faire comprendre la vérité de cette parole du Psalmsle : *Scuto circumdabit te veritas ejus ; non timebis a timore nocturno, a sagittâ volante in die, a negotio perambulante in tenebris.*\n\n« Natous et deux autres chefs pieds-noirs ont montré, pendant tout le temps du danger, un grand courage, et un sang-froid qui leur fait honneur.\n\n« Les habits de Natous ont été criblés de balles ; ce n’est qu’après avoir eu la jambe fracassée d’un coup de fusil, qu’il a cessé de faire entendre à ses hommes des paroles encourageantes.\n\n« J’ai perdu au pillage du camp tout ce que je possédais, habits, couvertures, etc. Mes chevaux aussi m’avaient été enlevés ; de ma vie, je n’avais été si pauvre qu’à l’issue du combat nocturne entre les Pieds-Noirs et les Cris. Il ne me restait pas même assez de quoi me couvrir la tête, pour me protéger contre le froid si intense de la saison.\n\n« Le lendemain de la bataille, malgré l’épuisement de tous et la rigueur du temps, nous nous mêmes en route pour aller rejoindre, à vingt milles de là, un autre camp de Pieds-Noirs. On me prêta quelques couvertures pour m’empêcher de geler. Je passais encore une dizaine de jours avec mes chers sauvages, puis je me préparais à retourner au fort de la Montagne. La chose n’était pas facile, dans l’état de misère où je me trouvais ; j’étais mal habillé, il faisait très-froid, il y avait beaucoup de neige. Il fallut cependant partir. Trois Pieds-Noirs s’offrirent pour m’accompagner. J’avais promis de me rendre à la mission pour la fête de Noël, mais tous mes plans se trouvaient dérangés par les funestes événements dont j’ai parlé. Je ne dis rien des nouvelles difficultés que je rencontrais.\naussi sur ma route ; pendant six jours que dura le voyage qui me ramena au fort, le froid, la faim et la lassitude m'éprouvèrent tour à tour. J'arrivais enfin, mais épuisé.\n\n« J'espère que le bon Dieu se servira, pour sa gloire, des événements si tristes dont je viens de parler. De loin, on pourrait en juger autrement, et penser que le combat qui a eu lieu entre les Pieds-Noirs et leurs ennemis est de nature à nuire au succès de la religion, en augmentant la haine entre des tribus différentes et en paralysant les efforts des Missionnaires. Pour moi, qui ai vécu au milieu des sauvages des prairies, telles ne sont pas mes craintes. Je crois plutôt que ces sauvages trouveront dans les événements qui ont eu lieu, au milieu d'eux, des enseignements propres à leur faire comprendre la beauté de la religion et le courage du prêtre. Partout on entend parler de la protection visible de Dieu sur le camp des Pieds-Noirs. Les Cris sont abattus et tout honteux. Ils ont montré bien du regret d'avoir entrepris ce qu'ils ont fait, et m'en ont demandé pardon. Nous pouvons donc espérer que le bon Dieu se servira de ces événements pour le bien de tous. Veuillez prier et faire prier, afin que nous obtenions cet heureux résultat.\n\n« A mon arrivée au fort de la Montagne, M. Hardisty vint, avec sa famille, à ma rencontre. Il versait des larmes en voyant l'état de misère et de pauvreté où j'étais réduit.\n\n« Il voulut changer mes vêtements, m'offrit la meilleure nourriture qu'il put se procurer et me traita comme si j'avais été son propre père. Une hospitalité si généreuse me fit bienôt oublier mes misères et mes fatigues précédentes. Je passais deux jours à encourager et confesser toute la population du fort de la Montagne. Après cela, je partis avec M. Hardisty, qui m'obligea de monter dans son meilleur traîneau, tiré par ses chiens, les\nplus robustes coursiers de la contrée. Nous arrivâmes heureusement, après cinq jours de marche, au fort des Prairies, autrement appelé Edmonton, où je fus reçu comme un revenant. On avait pu dire que j'avais été tué, et l'on était tout heureux de me revoir en bonne santé.\n\n« Je restais au fort le quatrième dimanche de l'Avent ; j'y célébrai la sainte messe ; puis, le soir du même jour, je me rendis à Saint-Albert, où j'eus le bonheur de retrouver et embrasser des frères, de revoir les bonnes sœurs qui avaient tant prié pour moi, pendant mon absence, et tous nos petits orphelins, à qui je porte tant d'intérêt.\n\n« Voilà, mon très-révéré et bien-aimé Père, ce que j'ai fait depuis le printemps dernier. Quoiqu'il me répugne beaucoup d'écrire le peu de bien que je tâche d'accomplir dans la partie du champ du père de famille qui m'est confiée, je n'ai pu m'y refuser, l'obéissance m'en faisait un devoir. Un autre que moi l'eût raconté d'une manière plus intéressante. J'ai compté sur votre indulgence et vous donne la preuve de ma bonne volonté.\n\n« Je vais maintenant vous donner quelques notions sur le caractère, les mœurs, les usages et la langue des sauvages des prairies,\n\n« Le sauvage des prairies diffère beaucoup des autres sauvages de l'Amérique du Nord, par le caractère, les mœurs, et par les idées religieuses. Ce grand pays, qui s'étend depuis les montagnes Rocheuses, c'est-à-dire depuis le point où l'une des branches septentrionales de la rivière Saskatchewan prend sa source, jusqu'à la rivière Rouge, était habité autrefois par un très-grand nombre de sauvages. Leur nombre a beaucoup diminué et j'attribue cela à trois causes différentes : 1° les guerres que se sont livrées entre elles ces différentes tribus, qui, au dire des anciens, étaient très-fréquentes ; 2° les maladies qui, à certaines époques, ont causé de très-grands ravages.\nvages au milieu de ces sauvages, très-inhabiles à se pro-\ncureur les soins que réclamaient leur état, quand ils venaient\nà être atteints par une de ces maladies; 3° et leurs rapports\navec les Européens, qui leur ont communiqué bien des\nvices et leur ont procuré l'eau-de-vie, si funeste aux\npauvres Indiens.\n\n« Oui, nous devons le dire en gémissant, l'homme ci-\nvilisé que l'amour du gain amène au milieu des sauvages,\nau lieu de donner le bon exemple, scandalise ces pauvres\nignorants, tout étonnés de voir commettre le mal par des\nhommes connaissant la prière. Je me ferai pourtant un\ndevoir d'ajouter que, depuis l'arrivée des Missionnaires\nen ce pays ci, les choses ont beaucoup changé; tout en\ninstruisant les Indiens, ils ont rappelé à ses devoirs l'Eu-\nropéen. Il me faut aussi donner des éloges à la conduite\nqu'a tenue la Compagnie de la baie d'Hudson, prohibant,\ndans tous ses forts, la vente de liqueurs enivrantes.\nPuissent les commerçants ne jamais s'éloigner de cette\nrègle sage, pour la tranquillité de nos chrétientés et pour\nle bien des sauvages!\n\n« On peut partager en trois grandes tribus ou nations\nles sauvages des prairies, compris dans le diocèse de\nMsr Taché, savoir : les nations des Pieds-Noirs, des Cris\net des Assiniboines.\n\n« Ces nations sont divisées en petites tribus qui se re-\ngardent comme étrangères les unes aux autres, bien\nqu'elles aient la même langue, la même manière de vivre;\nmais, en cas de guerre, elles se réunissent et ne forment\nqu'une seule tribu. Chaque tribu, surtout chez les Pieds-\nNoirs, se divise en grandes familles, dont chacune a un\nchef particulier.\n\n« Les notions que je vais donner sur les sauvages des\nprairies se rapportent surtout aux Pieds-Noirs, mais con-\nviennent à peu près également bien aux Cris et aux Assini-\nboines. La nation des Pieds-Noirs se partage en quatre tribus qui sont celles des Gens-du-Sang (Kéna), des Piéganes (Piéganiw), des Sarcis, et des Pieds-Noirs proprement dits (Sixika). Chacune de ces tribus se subdivise en dix-huit grandes familles de vingt à quarante loges. La tribu des Sarcis est presque éteinte aujourd'hui. Celle des Piéganes paraît être la plus nombreuse, mais la plus grande partie habite les terres qui avoisinent le Missouri.\n\n« Les mœurs des sauvages des prairies, encore infidèles, sont très-mauvaises, et cela tient surtout à deux causes difficiles à guérir : 1° l'oisiveté : vivant, au jour le jour, du produit de leur chasse, les sauvages ne songent à autre chose qu'à jouer et à fumer, à moins que la faim ne les presse de chasser les buffles ; 2° l'état d'agglomération dans lequel se trouvent réunies tant de personnes qui ne sont retenues par aucun sentiment de religion, de pudeur et de crainte. Les sauvages qui vivent par moindres groupes sont certainement bien plus moraux et d'un caractère plus doux que les sauvages ayant pour habitude de former de grands camps. Chez les Pieds-Noirs, les conversations sont licencieuses, et cela sans exception, tant de la part des hommes que de celle des femmes et même des enfants, les paroles les plus libres sont pour eux comme des choses indifférentes. Sous ce rapport, du moins, le sens moral est complètement éteint chez eux.\n\n« Les femmes sont vêtues modestement parmi eux ; les hommes et surtout les enfants semblent ignorer l'obligation où ils sont de se couvrir.\n\n« Un des principaux défauts de ces sauvages, c'est d'être incapables d'oublier une injure. La vengeance est une de leurs passions les plus difficiles à guérir. Un Pied-Noir attendra des années entières le moment de la satisfaire, sans rien laisser paraître de la disposition de son esprit;\npuis, quand l'heure propice, selon lui, sera venue, malheur à celui qui l'a offensé ! Il s'est passé, à cet égard, des choses vraiment sataniques, même entre parents.\n\n« Ces sauvages sont encore voleurs ; ils enlèvent et pillent tout ce qu'ils trouvent à leur convenance, et si le possesseur de l'objet volé vient à le retrouver entre leurs mains, ils exigent un salaire avant de le lui remettre. Ne songeant point à trouver son bonheur dans la vie future, le sauvage met tout en son pouvoir pour se le procurer dans la vie présente. Il saura, dans ce but, entreprendre des choses difficiles, souffrir de grandes misères, la faim, le froid, la fatigue. Quelle n'est pas sa persévérance quand il s'agit de réussir dans une entreprise nocturne du genre de celle dont je vous ai parlé plus haut ? quand il faut commettre quelque grand vol, ou satisfaire une passion ? Mais autant il est résolu dans de pareilles circonstances, autant il est irresolu et mollasse quand il s'agit de faire le bien et de réprimer ses passions.\n\n« Le grand amour des sauvages pour l'eau-de-vie a été, pendant tout le temps qu'ils ont pu s'en procurer, la cause des scènes les plus lamentables et des misères les plus navrantes. Comme ces pauvres gens ne travaillent jamais et n'ont d'autre occupation que celle de la chasse, qui est un exercice passager et peu fatigant, ils ont beaucoup de temps pour jouer à divers jeux de hasard, qui sont la source de divisions et de disputes entre eux et même de meurtres. Ils ne sont pas cependant sans avoir quelques qualités, celle, par exemple, d'être hospitaliers ; ils se feront gloire de recevoir, aussi bien qu'ils le pourront, l'étranger qui les visitera. Ils ont en outre beaucoup de respect pour le prêtre, l'homme de la prière, qu'ils regardent comme puissant auprès de Dieu. Ils sont, au reste, pleins de considération pour tous les blancs. Je me rappelle, à ce sujet, qu'un vieux chef me disait un\njour : « Dieu a fait les blancs entièrement, ou, si vous vouliez, ce sont des œuvres achevées ; pour nous, nous n'avons été faits qu'à moitié, nous n'avons qu'une demi-existence. »\n\n« La femme indienne, dans les contrées dont je parle, est réduite dans l'état le plus abject. Elle est esclave, et des plus misérables encore. A peine a-t-elle atteint douze ans, qu'on la vend comme une marchandise. J'ai vu des pères spéculer sur la vente de leurs filles, pour augmenter le nombre de leurs chevaux. Ce qui nous étonne en voyant la triste condition où les femmes sont réduites, c'est qu'elles-mêmes paraissent ne pas s'en douter. N'ayant jamais vu les personnes de leur sexe plus heureuses, elles s'habituent tout naturellement à n'être que des victimes de la brutalité des hommes. Très-souvent, les femmes sauvages portent sur elles les marques sanglantes des mauvais traitements de leurs maris, qui ne se font aucun scrupule de leur couper le nez, de leur donner un coup de couteau dans le bras ou à la jambe, et même de leur enlever leur chevelure. La malheureuse femme maltraitée de la sorte pleurera quelque temps, mais bientôt, le croiriez-vous ? elle ira rire de son sort avec ses compagines. Il n'est point rare, chez les Indiens infidèles, qu'un mari, emporté par quelque honteuse passion, ôte la vie à sa femme, et personne ne l'en punira.\n\n« La polygamie est une coutume générale dans les tribus qui habitent les prairies. Ce n'est pas seulement un des plus grands obstacles qui s'opposent à leur conversion au christianisme, c'est la cause de divisions et de misères sans nombre, pour les femmes elles-mêmes ; il y a toujours des disputes et des querelles entre elles. Les enfants n'ont aucun respect pour leurs parents ; ils ne leur obéissent point et ne paraissent guère les aimer. Vous ne sauriez croire de quelle manière indigne on y\ntraite son père et sa mère ; mais aussi, il est très-rare de voir les parents corriger leurs enfants. Quand un jeune sauvage a quinze ans, si, par hasard, son père ne veut pas lui donner des chevaux, il s'éloigne de la maison paternelle, va au loin, gagner sa vie comme il peut. Ces sortes de jeunes gens, appelés orphelins ou abandonnés ne paraissent avoir d'aptitude que pour faire le mal.\n\n« Les vieillards devenus incapables de travailler, et, par conséquent, d'être utiles à la tribu, sont méprisés et fort maltraités ; ils ont beaucoup à souffrir sous tous les rapports. Il faut excepter quelques vieux jongleurs et quelques anciens chefs, traités avec honneur jusqu'à leur mort. Ce que j'ai dit relativement à la polygamie ne s'applique pas aux Cris ; car ces sauvages ont, depuis plusieurs années, écouté les instructions et les recommandations des Missionnaires ; ils ont cessé d'avoir plusieurs femmes. Au reste, toutes les autres coutumes opposées au christianisme disparaissent peu à peu, à mesure que nous gagnons du terrain.\n\n« Les sauvages de la prairie, comme tous les autres sauvages, n'ont aucun gouvernement proprement dit. À part le temps de la grande fête du Soleil, qui a lieu en été et dont je parlerai plus loin, chacun vit, comme bon lui semble, va et vient au gré de ses désirs.\n\n« Les chefs ne sont chefs que de nom, en dehors de la guerre et des vols de chevaux. Ce titre est conféré, soit par droit héréditaire, soit par droit électif, comme il a lieu quand quelque sauvage a fait un grand acte de bravoure. On est encore chef quand on a une grande loge, et surtout lorsqu'on peut donner de grands festins, quand, en un mot, on ne se montre pas avare de son bien, le donnant à qui le demande.\n\n« Bien que, à proprement parler, il n'y ait pas de gouvernement chez les Pieds-Noirs, il y a certaine hié-\nrarchie militaire, composée de sept classes différentes de soldats, dont chacune a un chef et qui forment, outre la milice, une espèce de sacerdoce. L'on est initié à ces sortes de fonctions, et l'on ne monte aux différents degrés qu'elles comprennent qu'à la suite d'un très-grand nombre de cérémonies, dont plusieurs se rapprochent d'une manière étrange des cérémonies de notre sainte religion. D'après les règles données par Napi, son fondateur, la nation des Pieds-Noirs est gouvernée, pendant l'été, par les Akkanakatsex ou les sept ordres militaires que j'ai mentionnés. Le gouvernement patriarchal, ou par chef de famille, cesse au printemps, à l'arrivée de l'Aigle, un des grands génies de la tribu.\n\n« Ces diverses institutions me semblent avoir pour but de conserver et d'enraciner de plus en plus, au sein de la nation, l'amour de la guerre et certain polythéisme très-compliqué, qui me paraît ne ressembler en rien à la religion des autres tribus de ce pays. Les jeunes gens (Tokas) ou Associés ont des réunions dans lesquelles ils étudient avec soin l'art de la guerre, telle qu'elle se pratique chez eux, et tâchent de se perfectionner dans la connaissance de leur grossier paganisme. C'est pendant les cérémonies et les initiations de ces associés, principalement à l'époque de la fête du Soleil, que se racontent les merveilles opérées par les fameux génies de l'Aigle, de l'Épervier, du Corbeau, du Loup, du Chien, du Buffle, de l'Ours, etc. C'est là aussi l'école des traditions de la nation : on y redit les hauts faits d'armes des ancêtres ; on y apprend les rites, les chants, les préceptes de la religion du pays.\n\n« Aux Associés appartient de donner l'ordre des marches, des chasses, d'administrer la justice, de faire la police, de gouverner le camp durant les jours qui précèdent la fête du Soleil et quelques semaines encore après. Mais,\nà part cette époque, chacun est parfaitement libre ; nulle autorité ne pèse sur lui. Pour ce qui est des délits qui viendraient à se commettre, ils ne restent pas toujours impunis, ce sont les parents qui, ordinairement, infligent le châtiment au coupable, à moins que celui-ci n'apaise leur colère en leur donnant ses chevaux et tout ce qu'il a ; quelquefois, cela ne suffit point, il faut alors qu'il se réfugie dans une autre tribu. Quand il s'agit de faire la guerre, chacun peut y prendre part, y aller ou demeurer chez soi, comme bon lui semble. Dans le combat, on n'observe aucun ordre, chacun tire ses coups de fusil comme il l'entend et d'aussi loin que possible, ce qui rend peu meurtriers leurs combats, à moins d'une surprise. Leurs guerres offrent presque toujours le caractère de celle que j'ai racontée plus haut ; elles consistent à surprendre, pendant la nuit, des ennemis moins nombreux et endormis, à massacrer des femmes et des enfants sans défense, à voler des chevaux. Le sauvage qui a paru habile dans de semblables circonstances est reçu en triomphe dans son camp, on lui donne un autre nom, et il monte de droit à un grade plus élevé.\n\n« J'en viens maintenant aux croyances et pratiques religieuses des Pieds-Noirs. D'après tout ce que j'ai pu connaître relativement aux traditions de cette nation, il me paraît certain qu'elle n'a jamais connu Dieu ou l'Être suprême. Contrairement à ce qui existe dans toutes les autres tribus de ce pays, les Pieds-Noirs n'ont aucun mot dans leur langue pour désigner Dieu. C'est là, sans doute, une chose étrange, puisque, dans les nations les plus barbares, on a toujours trouvé l'idée de Dieu, plus ou moins nettement ; les Pieds-Noirs ne paraissent attirément connaître d'autre divinité que Natous, le Soleil matériel et visible, leur père et fondateur. Depuis que les Missionnaires ont pénétré au milieu d'eux, les\nPieds-Noirs connaissent Dieu et l'appellent « Notre Père, qui est en haut. » Mais leur première divinité a toujours été Natous, le Soleil, ou Napi, le Vieux. C'est à lui que se rapportent toutes les invocations, toutes les supplications ; c'est au Soleil que l'on fait des sacrifices sanglants, qu'on présente des offrandes sacrées pour être heureux dans la guerre, avoir bonne chasse, vivre longtemps...\n\nLes traditions portent que c'est du Soleil qu'est sorti celui qui a fait les Pieds-Noirs ; il a passé plusieurs années sur la terre sous le nom de Napi et a opéré toutes sortes de merveilles. Il y a dans la prairie, plusieurs lieux regardés comme sacrés, parce que Napi y a fait tel et tel prodige. C'est lui qui a donné aux Pieds-Noirs leur religion, leurs lois, toute leur façon de vivre. « Les blancs, » disent-ils, ont été créés par un autre Dieu, et nous par celui-là ; c'est pourquoi nous vivons différemment. »\n\nOutre le Soleil, ils ont des dieux secondaires ou génies, en grand nombre. Ils leur offrent aussi des sacrifices et leur adressent des prières pour se les rendre favorables. Ils révèrent en particulier la lune, qu'ils appellent la Vieille, et les étoiles, sur le compte desquelles ils ont les fables les plus étranges. La terre a aussi sa part à leurs hommages ; dans les festins, on lui offre sa portion de nourriture, ou, mieux, on la lui jette ; dans les assemblées, le calumet lui est toujours présenté, après avoir été présenté au Soleil.\n\n« Les Pieds-Noirs ne regardent comme péché que le meurtre, le vol entre parents et alliés, le mensonge et la colère. La luxure, la vengeance et l'orgueil ne sont point des choses défendues à leurs yeux ; ce sont des choses indifférentes et dont ils se vantent.\n\n« Ils reconnaissent de mauvais génies qu'ils cherchent à apaiser, mais n'ont point l'idée du démon et de l'enfer. Ils n'ont aucune connaissance des récompenses et des peines de l'autre vie ; ils pensent que la mort n'est\nqu’un passage de cette terre à une autre terre de chasse où ils seront plus heureux et où n’existera pas de distinction entre les bons et les méchants. Plus quelqu’un aura été grand et puissant en cette vie, plus il le sera dans l’autre. Ils sont persuadés que les méchants n’ont point à attendre de châtiment après cette vie ; mais si quelqu’un parmi eux tombe malade ou éprouve quelque malheur, ils considèrent ces maux comme une punition des péchés qu’il a commis.\n\n« S’il me fallait énumérer toutes les superstitions qui existent chez ces pauvres Indiens, je n’en finirais point ; ils rendent divers hommages au calumet, à la peau de certains animaux et de certains oiseaux… Que n’y aurait-il point à dire sur les ridicules cérémonies accompagnant leurs vaines observances, sur leurs danses, leurs chants, la singulière façon dont ils soignent leurs malades ? Mais je ne veux point trop prolonger ma lettre.\n\n« Lorsque quelqu’un vient à mourir, chez les Pieds-Noirs seulement, on ne l’enterre pas. Si c’est un chef, on le laisse dans sa loge, revêtu de ses plus beaux habits, on lui donne son fusil et sa pipe, puis on tue à la porte de sa loge les chevaux qui lui appartenaient, afin qu’il puisse s’en servir sur la terre nouvelle où il est allé chasser. Si le défunt n’avait aucune dignité dans la tribu, on l’élève sur un monceau de terre, où il reste jusqu’à ce que les loups et les corbeaux en aient fait leur proie. Tous les sauvages de la prairie ont une très-grande frayeur des morts. — Les tribus autres que celle des Pieds-Noirs enterrent généralement leurs morts ; elles conservent seulement, comme souvenir, les cheveux du défunt ; on les met dans des sachets, que souvent les vieillards portent sur le dos. Ces sachets occupent, dans les loges indiennes, une place d’honneur, et c’est vers eux que se fait l’offrande des plats du festin, et celle du calumet toujours\nen usage dans les assemblées religieuses ou politiques.\n\n« Les Cris ont l'habitude de célébrer, auprès de la fosse du défunt, le festin des morts, qui est toujours accompagné de sanglots et de chants lugubres.\n\n« Comme les peuples civilisés, les Indiens observent le deuil, mais un deuil à eux, un deuil sauvage. C'est à la femme qu'en revient la part la plus pénible. Si quelqu'un vient à perdre un de ses parents, il se met à crier en pleurant : Rendez-moi digne de compassion. Alors arrive toute sa parenté, qui entre dans sa loge, et tout y est mis au pillage. Quand cette scène est terminée, la plus proche parente du défunt ou de la défunte sort de la loge en pleurant, elle se coupe les cheveux, se dépouille d'une partie de ses vêtements, ne conservant autre chose que quelques haillons ; elle se fait des incisions aux bras et aux jambes ; le sang coule en abondance ; on commence alors les pleurs et les chants lugubres, que l'on renouvelle fréquemment pendant plus d'un mois.\n\n« Ne sont-ils pas bien dignes de pitié et de compassion, ces pauvres enfants de la prairie, qui ne connaissent point Dieu et la vraie religion, et qui, sans le savoir, sont le jouet du démon ? Que Dieu daigne couronner nos efforts et nous donner de les lui gagner !\n\n« Fête du Soleil. — J'ai cru vous être agréable en vous donnant ici quelques détails sur la grande fête du Soleil, qui s'observe chez les Pieds-Noirs.\n\n« Cette fête est annuelle ; elle est d'obligation pour toute la nation. Au commencement du mois d'août, les sept ordres de la hiérarchie militaire et sacerdotale prennent en main la direction des affaires du gouvernement du camp, sous la présidence du grand prêtre du Soleil. Dès lors, personne ne doit abandonner le camp. Une partie de l'été est employée aux préparatifs de la grande solennité. Tout le monde est mis à contribution, afin de\npourvoir aux nombreux festins du grand prêtre et de ses Associés. Les langues des buffles tués précédemment sont précieusement conservées pour le festin de la fête du Soleil ; on réserve aussi, pour cette importante circonstance, divers fruits sauvages que l'on a fait sécher.\n\n« Quatre jours avant la nouvelle lune d'août, la tribu arrête sa marche ; on campe dans un endroit propice ; la suspension des chasses est annoncée. Des détachements de soldats à cheval veillent jour et nuit à l'exécution des ordres du grand prêtre. Il ordonne, pour ces quatre jours, des jeûnes et des bains de vapeur. C'est durant ce temps-là que, assisté de son conseil, il fait choix de la vestale qui doit représenter la Lune à la fête du Soleil.\n\n« Cette vestale est choisie parmi les vierges ou parmi les femmes qui n'ont eu qu'un mari, et, dans ce cas, celle qui est nommée a dû s'abstenir de cohabiter avec son époux depuis un certain temps. Si après la fête on venait à découvrir qu'elle a rempli les fonctions de vestale sans se trouver dans les conditions prescrites, elle serait mise à mort, et sa famille serait soumise à la vengeance terrible de toute la nation. On a vu des vestales égorgées au milieu même de la fête du Soleil, parce qu'on avait découvert qu'elles ne se trouvaient point dans l'état de chasteté exigé pour remplir cette fonction. — Le troisième jour des préparatifs pour la fête, après que la dernière purification est terminée, on construit le temple du Soleil, pendant que le grand prêtre compose le Eketstokisim ou fagot sacré ; c'est un faisceau composé de quelques centaines de petites branches de bois sacré, recouvert d'une magnifique peau de buffle ; le tout doit être placé au sommet du temple du Soleil. Ce temple est de forme circulaire ; il est construit au moyen de pieux enfoncés dans la terre, à six pieds de distance les uns des autres, et entre lesquels on dispose des traverses qu'on recouvre de feuil-\nlages. Au centre de l'enceinte du temple est le poteau sacré, sur lequel repose principalement la toiture.\n\n« L'entrée du temple est à l'orient ; au fond est le sanctuaire, appelé par les Pieds-Noirs la terre sainte. On y élève un autel de la dimension d'un pied carré ; il est entouré d'herbes odoriférantes. Sur cet autel est placé une tête de buffle, peinte en noir et en rouge ; tout près est la place réservée à la vestale.\n\n« Quand le moment de la fête est venu, le grand prêtre, accompagné de la vestale et suivi de toute la nation, se rend au temple processionnellement au son de tous les instruments de musique en usage chez les Indiens. On plante d'abord le poteau sacré, ce qui se fait avec un grand nombre de cérémonies très-burlesques ; après quoi, le feu sacré est allumé et le calumet est préparé. Ce calumet est présenté au Soleil dès que le Soleil paraît à l'horizon. À ce moment, tout le monde se jette à terre en poussant de grands cris. Puis, la vestale allume au feu sacré le calumet, et le grand prêtre adresse une prière à l'astre du jour, auquel il demande d'étendre sa protection sur tout le peuple. Ensuite, il impose les mains sur les mets qui doivent servir au repas sacré, et présente au Soleil une des langues de buffle qui doivent servir à ce festin ; il la dépose sur l'autel, pendant que la vestale sort du temple pour distribuer la portion du festin qui revient à chaque sauvage pour son déjeuner. Cela fait, la vestale quitte sa chaussure, se jette sur un lit préparé, et dort, on le prétend du moins, le sommeil de guerre (Okân).\n\n« Dès ce moment, un vacarme épouvantable se fait entendre : ce sont des chants, des cris, des hurlements ; tous les sauvages rentrent dans l'enceinte du temple.\n\n« Alors commencent les grandes harangues ou le récit des hauts faits d'armes de la nation. Chacun vient ensuite\nfaire son offrande au Soleil, lui présenter ce qu'il a de plus précieux. Les sept ordres de soldats viennent après et successivement exécuter leurs danses ; ils racontent leurs exploits. On applaudit ; les musiciens alors entonnent le chant du départ et battent la mesure sur les tambours du combat.\n\n« Le chef portant sur la tête un diadème formé de plumes d'aigle, et autour de son corps les chevelures enlevées aux ennemis, ayant la figure horriblement tatouée, monte sur son cheval de guerre, tenant sa lance à la main. Après en avoir frappé le poteau sacré, il fait quatre fois le tour de l'enceinte du temple, en chantant un chant de triomphe Ses amis redissent sa bravoure, on l'applaudit, on lui fait des présents. D'autres chefs après lui viennent recevoir les mêmes hommages. La fête dure enfin quatre jours. Pendant tout ce temps, le grand prêtre reçoit les offrandes que viennent lui apporter les sauvages, et les présente au Soleil ; ce sont comme des ex-voto.\n\n« Je ne puis énumérer toutes les sortes d'offrandes que l'on présente ainsi au Soleil, pendant ce temps. Les pauvres sauvages pratiquent en son honneur des expiations, au prix desquelles celles qu'on s'inflige par les hères et les cilices ne sont rien. Il n'est pas très-rare, par exemple, de voir des jeunes gens pousser le dévouement jusqu'à lui sacrifier un doigt de leur main. D'autres se font des incisions larges et profondes dans lesquelles ils passent des courroies, qui leur servent à se suspendre au poteau sacré ; le sang ruisselle, et quand, ainsi qu'il arrive souvent, le patient tombe à terre, parce que le poids du corps a déchiré les chairs, ce qui produit toujours des plaies affreuses, il paraît ravi de joie. S'adressant au Soleil : « Mon père, lui dit-il, tu vois que je ne suis pas un ami avare de mon corps. Fais que je sois heu-\n« reux et fortuné dans le chemin de la vie, que tu tâ-\ncheras de rendre long. Obtiens-moi de voir la vieillesse. »\n\n« Pendant ces sacrifices singuliers, la vestale, qui est\ncensée avoir dormi son sommeil de guerre, s'occupe à en-\ntretenir le feu sacré au moyen d'herbes odoriférantes, et\nprésente de temps à autre le calumet au Soleil, son époux,\ncar vous savez qu'elle représente la Lune. Elle fait part\nensuite au grand prêtre du rêve qu'elle a eu pendant\nqu'elle dormait, et le grand prêtre le fait connaître so-\nlennellement à la nation, au son du tambour.\n\n« Quand, au quatrième jour, le soleil est sur le point\nde disparaître de l'horizon, la fête se termine par de lon-\ngues prières et des chants variés.\n\n« Ainsi est célébrée cette fameuse fête du Soleil, qui a\ntant de charme pour toute la nation, et à laquelle elle\nest si fortement attachée. Elle est aussi, hélas ! le prin-\ncipe et la fin de toutes ses superstitions et de ses jongle-\nries.\n\n« Deux choses m'ont toujours singulièrement frappé,\nlorsque j'ai étudié les usages et la religion de ces pauvres\nIndiens : c'est de voir d'abord comment le démon qui règne\net domine en maître sur eux, prend soin de leur demeu-\nrer inconnu, de leur laisser ignorer les peines de l'autre\nvie, car les Pieds-Noirs n'ont aucune idée du démon et\nde l'enfer ; c'est de voir ensuite qu'une sorte de malé-\ndiction particulière pèse sur ces Indiens, car, par leur\nmanière de vivre et leurs mœurs grossières, ils sont plus\néloignés que tous les autres sauvages de la prairie de la\ncivilisation et du christianisme. Pauvres Pieds-Noirs !\nqu'ils sont dignes de pitié !\n\n« Je ne les en aime pas moins, ou plutôt c'est parce\nqu'ils sont réduits à ce triste état que je suis plus\nheureux d'avoir été envoyé pour les sauver : Evangelizare\npauperibus misit me. Hélas ! quand donc auront-ils, eux\naussi, le bonheur de connaitre la vérité, de pratiquer la religion et d'en goûter les avantages! Ils comprendront alors combien le joug du Seigneur est plus doux que celui qu'ils portent. Quand donc, au lieu d'adorer ce soleil matériel dont les rayons les éclairent, reconnaîtront-ils et adoreront-ils le vrai Soleil de justice?\n\n« Ma consolation a toujours été de penser que le jour viendrait où il en serait ainsi. Quand j'arrivais au milieu de ces pauvres Indiens, lorsque je faisais couler l'eau sainte de la régénération sur le front de jeunes enfants et de pauvres mourants, et que j'annonçais à tous la bonne nouvelle, un Dieu créateur et rédempteur, juste, mais bon, récompensant ses élus par une éternité de délices, et punissant les méchants de supplices éternels, il me semblait voir les anges gardiens de cette nation veiller à ce que mes paroles ne fussent point perdues, et user de leur puissance pour que le résultat consolant de ces paroles et de tous mes efforts fût de donner gloire à Dieu et paix aux hommes de bonne volonté: Gloria in excelsis Deo et in terrâ pax hominibus bona voluntatis!\n\n« Je vous donnerai, en terminant cette longue lettre, quelques notions sur la langue des sauvages de la prairie.\n\n« Ces sauvages, étant partagés en quatre grandes tribus, ont quatre langues ou dialectes différents : Le cris, le pied-noir, l'assiniboine et le sarcis. Je ne puis rien dire de ces deux derniers dialectes, que je n'ai pas eu occasion de parler. Le sarcis me paraît ressembler au montagnais et être très-difficile. Mais, comme les Sarcis sont peu nombreux et parlent tous également le pied-noir, il n'est pas nécessaire pour le Missionnaire d'apprendre leur langue.\n\n« Le cris, langue des sauvages qui portent ce nom, est compris et parlé aussi par les Assiniboines, les Sau-teux et par nos métis. Il n'offre pas de grandes difficul-\ntés, surtout à qui veut se servir, pour l'apprendre, d'un dictionnaire et d'une grammaire composés par les Missionnaires, avantage précieux, que l'on n'a pas encore pour étudier le pied-noir. Le cris est une langue très-riche et renferme une multitude de mots pour exprimer une même pensée. Avec la connaissance des racines de cette langue, on peut composer soi-même un grand nombre de noms, d'adjectifs et de verbes. Parfois un simple mot rend avec beaucoup de justesse une pensée qu'on ne saurait rendre en français sans employer toute une phrase. Le cris n'a point de sons durs ou gutturaux ; il possède un accent qui donne à la prononciation, dans un sermon surtout, beaucoup de majesté et d'harmoie.\n\n« Le pied-noir est plus pauvre que le cris, mais n'a pas moins aussi ses qualités. Cette langue a une prononciation encore plus douce et plus agréable que le cris. Les règles de sa grammaire offrent bien de l'analogie avec celle de la grammaire criée ; elles présentent moins de difficultés.\n\n« En cris comme en pied-noir, tous les noms peuvent devenir verbes, et tous les verbes devenir des noms.\n\n« Plus j'étudie ces langues et plus je trouve grande leur perfection ; elles ont l'avantage de ne jamais varier, elles sont maintenant ce qu'elles étaient il y a cent ans, et seront après un siècle, si l'état social ne change pas chez ceux qui les parlent, ce qu'elles sont aujourd'hui. Une chose remarquable, c'est qu'un enfant de huit à dix ans les parle d'une manière aussi correcte que le meilleur des orateurs, et cela bien qu'elles aient des règles assez compliquées.\n\n1° QUELQUES MOTS EN CRIS :\n\nKijé-Manito. | L'être parfait, Dieu.\nN'ottawiy. | Mon père.\nNigawiy.  \nKukaw.  \nSibiscaw.  \nNipty.  \nIskoutew.  \nMasinahigam.  \nMasinahikew.  \nAyamihaw.  \nAyamihiwiniw.  \nAyamihe-wikamik.  \nPisim.  \nTibiskawipisim.  \nNamawiya.  \nN' iyaw.  \nN' t' atchak.  \nMistaim.  \nAltum.  \nN' t' em.  \nPimatisiwin.  \nPimatisiwin.  \nPimajihew.  \nNipiwin.  \nNipiwin.  \nNipahew.  \nMiyoisiw.  \nMiyoisisiwiw.  \nMiyoeyitam.  \nMiyoeyimew.\n\nMa mère.  \nIl est jour. Jour.  \nIl est nuit. Nuit.  \nEau.  \nFeu.  \nCe qui est dessiné. Livre.  \nIl écrit.  \nIl prie. Il est chrétien.  \nLa prière; la religion.  \nL'homme de la prière, le prêtre.  \nMaison de prière. Eglise.  \nLe soleil.  \nLe soleil de la nuit, ou la lune.  \nNon. Ne pas.  \nMon corps.  \nMon âme.  \nCheval.  \nChien  \nMon cheval ou mon chien.  \nIl vit.  \nLa vie.  \nIl le fait vivre.  \nIl est mort.  \nLa mort.  \nIl le fait mourir.  \nIl est beau.  \nIl est d'un bon caractère  \nIl est content.  \nIl le trouve beau; il l'estime.\n\nSIGNE DE LA CROIX EN CRIS.\n\n† Weyollawimit, mina wekosissimit,  \nmina meyositanito,  \no wiyowinik pitane ekusi ik kit.  \n† Le Père et le Fils,  \net le bel Esprit,  \nen son nom, qu'il en soit ainsi !\n\n« Afin de vous donner une idée de la construction des phrases et du génie de la langue crise, autant que faire se peut, quand on ignore le dialecte, je donne le mot à mot, en français, de la traduction du Pater noster en cris.\n\nPATERNOSTER EN CRIS.\n\nN' ottanàn, kitchi kijikok eyáyan,  \nPitane miyweyitchikatek ki  \nwiyowin.  \nPitane otchitchipayik kilipeyit-chikewin.  \nKa jji nantottakawiyian. kijikok,  \npitane ekusi yi waskitaskamik.  \nNotre Père, au ciel qui es,  \nQu'il soit aimé, ton nom.  \nQu'il vienne, ton règne.  \nComme ta es écouté au ciel,  \nqu'il en soit ainsi sur la terre.\nAnotch ka kijikâk miyânâ ni pakkwejigani miyânâ miya lattewaw kijikaki.\n\nKa jî kassinamowatlwaw kaki matchitoukayakaw ekusi kassinanawinân ka ki matchitotamak Pisisyeiminân kitchi Eka matchi totamâk. Tyékatenamawinân ka mayatâk. Pilane ekusi ikkit!\n\nAujourd'hui, en ce jour, donne-nous notre pain et ainsi, chaque jour. Comme nous pardonnons à ceux qui nous ont fait du mal, de même pardonne-nous ce que nous avons fait de mal. Veille sur nous pour que nous ne fassions pas de mal. Eloigne de nous le mal. Qu'il en soit ainsi!\n\n2° QUELQUES MOTS, EN PIED-NOIR.\n\n« N'ayant pas trouvé de mot pour exprimer la Divinité, j'en ai composé un :\n\nOmakko-naloyé tapi. Le grand esprit. Dieu.\n\nNinna. Mon père\nNikristu Ma mère.\nKristoy. Le jour.\nKokoy. La nuit.\nOrki. De l'eau.\nIstchi. Du feu.\nSinakisin. Livre.\nEsinakew. Il écrit.\nAdjimokikkâw. Il prie.\nAdjimokikkân. La prière.\nNatoyapikowan. L'homme divin, le prêtre.\nNatous. Le soleil.\nKokoyé-natous. La lune (soleil de la nuit).\nN' osiorumâ. Mon corps.\nN' atak. Mon âme.\nPonokamita. Cheval.\nEmita. Chien.\nN' otasi. Mon cheval ou mon chien.\nStowâ. Couleau.\nN' ottowanâ. Mon couteau.\nPistarkân. Tabac.\nNamaw. Fusil.\nNichipistarkân. J'ai du tabac.\nNichipistarkowaw. Je lui donne du tabac.\nMoyis. Loge.\nPotochikoy. Chemin.\nPoka. Enfant.\nNapi. Un vieillard.\nStoyé. Il fait froid.\nSa. Non.\nN'tiskisinowaw. Je le connais.\n\nSIGNE DE LA CROIX EN PIED-NOIR.\n\n† Hounnima, ki orkoyémumma, ki arsatousé, otchimikasimâ, ka manistioupâ.\n« Je termine cette longue lettre en vous demandant, mon très-révéré et bien-aimé Père, de bien vouloir bé- nir le dernier de vos enfants et tous les pauvres sauvages qu’il évangélise, et qui n’ont de secours à attendre que de vous et des oblats de Marie Immaculée. Que ne pouvons-nous faire pour eux davantage ? Que n’avons-nous de ressources pour ériger quelque mission au milieu de leurs prairies ! Il y a là plus de douze mille Indiens dont je suis le seul Missionnaire, et dans toute la vaste étendue de la terre qu’ils habitent, il n’existe pas une mission proprement dite ; nous n’y avons aucune chapelle.\n\n« Daignez agréer, mon bien-aimé Père, l’hommage du profond respect, etc.\n\n« Votre fils tout dévoué et tout affecté :\n\n« ALBERT LACOMBE, O. M. I.,\nPrêtre missionnaire.\n\nLETTRE DU MÊME AU T. R. P. SUPÉRIEUR GÉNÉRAL\n\nMission Saint-Paul-des-Cris, sur la Saskatchewan,\nJour de Pâques, 31 mars 1866.\n\n« MON TRÈS-RÉVÉRÉND ET BIEN-AIMÉ PÈRE,\n\n« Nous venons de célébrer une grande et belle fête ; le jour de Pâques est un jour bien cher au cœur de tous mes néophytes, et comme les peines et les joies de mes pauvres sauvages sont devenues mes peines et mes joies, j’ai moi-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009547.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 39, "total-input-tokens": 57702, "total-output-tokens": 21502, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1621, 1], [1621, 3435, 2], [3435, 5305, 3], [5305, 7231, 4], [7231, 9104, 5], [9104, 10977, 6], [10977, 12836, 7], [12836, 14660, 8], [14660, 16454, 9], [16454, 18320, 10], [18320, 20179, 11], [20179, 22041, 12], [22041, 23850, 13], [23850, 25691, 14], [25691, 27543, 15], [27543, 29502, 16], [29502, 31387, 17], [31387, 33179, 18], [33179, 35025, 19], [35025, 36889, 20], [36889, 38669, 21], [38669, 40509, 22], [40509, 42435, 23], [42435, 44283, 24], [44283, 46113, 25], [46113, 47977, 26], [47977, 49858, 27], [49858, 51811, 28], [51811, 53695, 29], [53695, 55544, 30], [55544, 57477, 31], [57477, 59318, 32], [59318, 61145, 33], [61145, 62978, 34], [62978, 64837, 35], [64837, 66505, 36], [66505, 68192, 37], [68192, 69657, 38], [69657, 70834, 39]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]