[{"id": "9daea9d971249ee133d9dba31167fffed0043abe", "text": "MISSIONS DE SAINT-ALBERT\n\nLETTRE DU R. P. LEDUC\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nSaint-Albert, le 20 décembre 1869.\n\nMON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nJe viens encore vous parler de la mission Saint-Albert, et vous faire part des travaux, des peines et des consolations de vos enfants dans cette partie du vicariat de Siskatchewan. Je vous donnerai aussi un aperçu aussi exact que possible des travaux matériels les plus urgents à faire dans ce Vicariat.\n\nLe R. P. André ainsi que le P. Fourmond, novice, sont partis au commencement du mois de mai pour aller accompagner les chasseurs à la prairie. Le camp se composait d'environ six cents personnes. Dans cet immense désert que l'on nomme prairie, les Pères ont eu successivement à supporter les rigueurs du froid, de la soif et de la chaleur. Notre climat est ainsi fait que parfois dans le cours de notre été une excessive chaleur fait place à une forte gelée. Les deux Pères ont été admirables de zèle et de dévouement pour catéchiser les enfants, instruire les adultes, et réprimer les désordres qui peuvent se glisser si facilement dans ce pêle-mêle de six cents personnes vivant au milieu des prairies. Les chasseurs, sauf un seul\nqui a donné du scandale, se sont parfaitement bien conduits; aussi le bon Dieu a-t-il béni leur long et pénible voyage. Ils n'ont eu aucun accident grave à déplorer, et sont revenus après deux mois et demi, chargés de vivres.\n\nQuelques familles, parties avant la grosse brigade, n'ont pas été si heureuses. Surprises par les Pieds-Noirs, plusieurs chevaux ont été volés. On en est même venu aux armes. Un Pied-Noir est resté sur le terrain : un métis a eu la jambe percée d'une balle ; un Cri a reçu deux balles dans le poignet. Ces deux balles l'ont atteint au moment où il allait faire feu sur un Pied-Noir. Après lui avoir traversé le bras, elles sont allées se loger toutes les deux dans la bouche de ce pauvre Cri. Le R. P. André est arrivé avec la caravane quelques jours après ce combat. Il a administré le blessé, l'engageant à rebrousser chemin, et à venir se faire soigner par les Sœurs de Saint-Albert. Vraiment ces sauvages ont la vie plus dure que des bœufs. Ce Cri est arrivé à la mission dans un état effrayant. Il avait la mâchoire toute brisée, la lèvre percée et la langue coupée. À force de soins, la Sœur a pu cicatriser ses blessures, et environ quinze jours plus tard elle pouvait lui extraire une balle par-dessous le menton. Quelques jours après, le blessé extrayait lui-même l'autre balle. Je l'ai confessé et fait communier pendant qu'il était en danger; Monseigneur, à son retour de l'île à la Crosse, lui donna la confirmation; aujourd'hui il est hors de danger. À part cet accident, le voyage de la prairie a été heureux sous tous les rapports.\n\nEn s'en revenant avec les chasseurs, le R. P. André et son excellent compagnon ont fait planter une jolie croix dans le désert, à quelques jours de marche d'ici. Ils ont fait aussi une magnifique cérémonie pour la première communion des enfants. Une cinquantaine préparés avec soin par le bon P. Fourmond, ont eu le bonheur de rece-\nvoir pour la première fois Jésus dans leur cœur. L’autel, dressé ainsi au milieu du désert, cette messe célébrée aussi solennellement que possible en plein air, l’instruction si profondément sentie, donnée par le P. André, la musique dirigée par le P. Fourmond, tout a laissé dans le cœur des chasseurs de la prairie une impression salutaire qui ne s’effacera pas de sitôt.\n\nVers la fin de juin, le cher P. Fourmond arrivait à Saint-Albert avec deux charges de vivres. Craignant pour nous les rigueurs d’un jeûne forcé, le P. André avait eu la bonne pensée de profiter de la première occasion pour envoyer avec des vivres son compagnon à la mission. Et de fait il était temps. Je n’avais plus dans le hangar que quelques livres de pémikan ; je songeais déjà à assommer quelqu’un de nos bœufs de travail. Quelques jours plus tard, j’apprenais avec joie l’arrivée du P. André lui-même. Le cher Père venait se reposer un peu à Saint-Albert, et se préparer à un second voyage. Profitant de la présence de tous nos métis et du séjour du P. André, je disposai tout pour faire la procession de la Fête-Dieu le premier dimanche d’août. À l’époque où tombe cette fête, il n’y a presque personne à la mission, tout le monde est à la prairie. Donc le premier dimanche d’août nous avions à quelque distance de l’église, dans une petite éclaircie au milieu d’une touffe de bois, un magnifique reposoir. Sur le parcours que devait suivre la procession, s’élevaient de distance en distance des arcs de triomphe ; pendant la procession l’air retentissait souvent des coups de fusil tirés par nos métis ; c’est là la musique instrumentale du pays. Après la bénédiction du saint Sacrement, le R. P. André, debout sur les degrés du reposoir, exhorte vivement les chrétiens de Saint-Albert à l’amour de la sainte Eucharistie. Jamais on n’avait vu dans ce pays une procession si belle et si solennelle. Outre le P. André\net moi, y prenaient une part active les deux Pères novices,\nles deux Frères scolastiques, nos chers Frères convers et\nnos Sœurs.\n\nLe dimanche suivant, autre cérémonie, autre proces-\nsion. Nous faisions la fête de la Tempérance. Un autel\naussi splendide que possible avait été dressé au pied de\nla croix plantée le printemps passé par le R. P. LACOMBE\nà la clôture de la retraite.\n\nC'est à cet autel que nous nous rendîmes procession-\nnellement avec tous les membres de la société de Tempé-\nrance. Tous venaient ainsi renouveler la promesse de\nne point user de liqueur enivrante. Le R. P. ANDRÉ fut\nencore prié d'être le prédicateur de la fête. Après avoir\nfélicité les bons, il reprit avec force les vendeurs de bois-\nsons et plusieurs furent remarqués baissant humblement\nla tête pendant la prédication.\n\nLa cérémonie est à peine terminée, qu'on aperçoit sur\nle coteau opposé à celui de la mission la voiture de Mon-\nseigneur lui-même, revenant de son long voyage de\nl'île à la Crosse. Avec quelle joie nous nous empressons\nau-devant de Sa Grandeur, avec quel bonheur nous re-\nvoyons au milieu de nous notre vénéré Vicaire et notre\nbien-aimé Père. Hélas ! Sa Grandeur ne devait pas tarder\nà nous quitter de nouveau. Dix jours après, Elle repren-\nnait le chemin de Saint-Paul des Cris, allant ainsi causer\nune délicieuse surprise au R. P. DEPIN.\n\nVers le 20 du mois d'août, le R. P. ANDRÉ se mettait de\nnouveau en campagne. Il retournait accompagner les mé-\ntis dans leur second tour de chasse à la prairie. Cette fois,\nil laissait le cher P. FOURMOND finir en paix son noviciat à\nSaint-Albert ; tandis que le P. BOURGINE, novice, partait à\nson tour pour aller faire ses premières armes à la prairie.\nComme dans le premier voyage, le zèle, le dévouement,\nl'abnégation n'ont pas fait défaut aux Missionnaires.\nPendant que les B.R. PP. André, Fourmond et Bourginé parcouraient ainsi la prairie à la suite des chasseurs de buffle, le R. P. Lacoube se rendait à Benton, traversait les États-Unis, arrivait au Canada et revenait à Saint-Boniface, après avoir fait tout ce qui était en son pouvoir pour accomplir fidèlement la mission qui lui avait été confiée. Cette mission il l’a remplie au milieu de fatigues et de dangers de tout genre. Enfin, il nous est revenu sain et sauf en novembre, au moment où nous commencions à craindre de ne pouvoir le revoir qu’au printemps prochain.\n\nTandis que mes Frères entreprenaient ainsi de longs et pénibles voyages pour la gloire de Dieu et le salut des âmes, j’étais resté à Saint-Albert. Heureusement, l’ouvrage ne me manquait pas non plus. J’avais à desservir la mission Saint-Albert, à visiter de temps en temps celle de Sainte-Anne dépourvue de Missionnaire, à environ quinze lieues d’ici, et celle de Saint-Joachim au fort Edmonton, à trois lieues. Outre cela la direction du noviciat et la classe des scolastiques me demandaient chaque jour un temps plus ou moins considérable. Puis sont venus les travaux des champs, le labourage, les semences, les récoltes, le foin. Aidé des Pères novices, des scolastiques et des Frères convers, nous avons fait par nous-mêmes une grande partie de la besogne, afin de diminuer d’autant les dépenses. Les Sœurs elles-mêmes ont mis à contribution leurs forces et leur dévouement pour les travaux des champs qui se sont présentés. J’ai dû faire extraire une quinzaine de toises de pierre pour les fondations de la future cathédrale. Pour ce travail on me demandait 300 francs. Les Pères novices et les Frères se sont immédiatement offerts pour faire eux-mêmes ce pénible ouvrage et ont ainsi épargné cette somme à la mission.\nVers le 20 d'octobre, Mgr Grandin, après avoir passé près de deux mois avec les sauvages de Saint-Paul des Cris, revenait à Saint-Albert pour présider notre retraite annuelle. Il amenait avec lui le R. P. Dupin qui venait pour la première fois visiter ses Frères de Saint-Albert. Quelques jours après, le R. P. Végreville venait avec le F. Gérenté prendre part avec nous aux exercices de la retraite. Le R. P. André a été chargé de nous distribuer le pain de la parole divine. Nous n'oublierons jamais l'humilité avec laquelle il a demandé à Monseigneur à nous baisser les pieds avant de faire son discours d'ouverture. Il a commencé par nous prêcher d'exemple, sa parole n'est pas tombée sur une terre stérile. Le jour de la Toussaint a été pour nous un jour de fête et de bonheur. A la grande messe célébrée pontificalement par Mgr Grandin, le R. P. Fourmond a fait son oblation perpétuelle ; les FF. Alexandre Lambert et Paul Grizeau ont été admis à leur première oblation. Après cela a eu lieu la rénovation des vœux. Ce jour-là, nous étions douze Oblats réunis, tous contents et heureux, nous disant les uns aux autres : de tels jours font oublier bien des peines, bien des souffrances inséparables de la vie de Missionnaire dans ces contrées sauvages.\n\nQuelques jours après la fête, chacun reprenait le chemin de ses missions respectives, avec un nouveau courage et un désir de plus en plus vif de faire le bien et de se dévouer au salut des âmes. Le R. P. Végreville retournait au lac Labiche, le R. P. Dupin à Saint-Paul des Cris. Ce cher Père, surpris par la neige et le mauvais temps, égaré au milieu de la prairie, aurait infailliblement péri si le bon Dieu ne lui avait envoyé un secours tout providentiel. Le R. P. Fourmond, devenu Modérateur de nos scolastiques, allait s'installer dans la jolie petite mission du lac Sainte-Anne, avec ses deux Frères, élèves\nen théologie. Le 4 novembre, le F. Doucet recevait les ordres mineurs et le F. Blanchet la première tonsure.\n\nVoilà, bien-aimé Père, les nouvelles que j'ai pensé les plus propres à vous intéresser; à présent, je vais vous parler des travaux urgents à entreprendre dans le Vicariat.\n\n**État matériel des missions du vicariat de la Siskatchewan.**\n\n1° Saint-Albert. — Saint-Albert est la résidence du R.R. Vicaire. Cette mission possède un établissement pour les Sœurs. Cet établissement commence à avoir besoin de réparations; de plus il est bien insuffisant pour que nous puissions recevoir plus de douze ou quinze orphelines. Il serait bien à désirer aussi que les Sœurs eussent un appartement convenable pour recueillir les malades. De cette façon bon nombre de protestants sans famille pourraient être recueillis par les Sœurs, et mourir catholiques. Nous n'avons point encore d'église, néanmoins la future cathédrale est en voie de construction. Après cela il faudra songer à bâtir des étables pour la ferme que nous sommes à tout prix obligés d'entretenir. Les chevaux et les bœufs sont indispensables pour le transport de nos matériaux. Nos étables sont tout à fait insuffisantes et tombent en ruine. La bicoque qui sert de palais épiscopal demande instamment à être remplacée. Nous aurions également besoin d'un hangar pour mettre nos vivres. Ce printemps il nous faudra songer à construire une forge pour le F. Leriche.\n\n2° Sainte-Anne. — Cette mission est assez bien pour le moment. La maison des Pères est en bon état. L'église a été réparée cet automne. Cette mission se trouvant à proxi-\nmité de Saint-Albert n’a pas besoin actuellement d’un temporel considérable. Elle est soutenue et entretenue en grande partie par Saint-Albert.\n\n3° Saint-Paul des Cris. — Cette mission, fondée il y a seize ans par le R. P. Lacombe, doit être déplacée. Le bien des sauvages l’exige impérieusement ; c’est donc, pour ainsi dire, une mission toute nouvelle à établir, par conséquent une nouvelle maison à bâtir pour les Pères ; une autre pour servir de cuisine et de demeure aux deux filles de service qui font la cuisine et prennent soin du linge ; enfin, c’est une étable qu’il faut construire pour les bêtes à cornes.\n\n4° Ile à la Crosse. — Les ravages causés par l’incendie il y a trois ans n’ont pas encore pu être réparés. C’est donc une maison considérable qu’il s’agit de construire promptement pour abriter les Sœurs et leurs nombreux orphelins.\n\n5° Le lac Caribou. — Nos Pères y sont dans le plus complet dénuement, n’ayant qu’une misérable baraque qui leur sert de maison et d’église.\n\n6° Notre-Dame de la Paix. — Mission des Pieds-Noirs, qui n’est pas encore fondée. Néanmoins, il est de toute urgence de s’occuper de la fondation de cette mission. Des milliers de Pieds-Noirs infidèles n’ont point encore de mission. Cette année le R. P. Lacombe va passer l’hiver avec eux, et aviser aux moyens de fonder là une mission le plus vite possible.\n\nQu’on juge par là, si nous avons besoin de secours de la Propagation de la foi, pour couvrir toutes nos dépenses. S’il en avait les moyens, combien d’autres missions importantes pourrait entreprendre notre bien-aimé Vicaire ! Qu’on ajoute à tous ces frais de réparations continues et de constructions, les frais des voyages qu’on est obligé d’entreprendre à chaque instant. Pourtant que de\nfatigues, que de privations nous nous imposons tous volontiers pour économiser le plus possible.\n\nAgréz, etc.\n\nH. Leduc, O. M. I.\n\nLETTRE DE MGR GRANDIN A MM. LES MEMBRES DES CONSEILS CENTRAUX DE LA PROPAGATION DE LA FOI¹.\n\nFort Pitt (mission de Saint-François-Régis, 10 janvier 1870.\n\nMESSIEURS,\n\nC'est en voyage, comme presque toujours, et en préparant à la grâce du Jubilé une cinquantaine de chrétiens que je rencontre ici, que j'entreprends de vous écrire. Je n'ai point les notes qui me seraient nécessaires pour satisfaire pleinement votre juste curiosité. Cependant sachant que tout ce qui concerne les missions vous intéresse, comptant sur votre indulgence, et voulant m'acquitter autant que possible d'un devoir de reconnaissance envers vous et les associés de la Propagation de la foi, je vais vous écrire comme je pourrai, autant qu'on me laissera en paix. Me rendant actuellement dans la partie nord-est de mon Vicariat, je ne vous en parlerai qu'au retour de mon long voyage. Je ne vous parlerai donc cette fois que de la partie nord-ouest où je me trouve encore ; mais avant de commencer, laissez-moi vous dire, messieurs, combien\n\n¹ Cette lettre, à laquelle se réfère celle du 1er septembre 1870, publiée dans le tome précédent, p. 355, s'était égarée dans la dispersion forcée de nos papiers au temps de la Commune Nous ne l'avons retrouvée que depuis peu. On comprendra, après l'avoir lue, combien sa perte eût été regrettable.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009606.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 15082, "total-output-tokens": 4680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1191, 2], [1191, 3099, 3], [3099, 4999, 4], [4999, 6808, 5], [6808, 8603, 6], [8603, 10477, 7], [10477, 12077, 8], [12077, 13821, 9], [13821, 15266, 10]], "primary_language": ["None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]