[{"id": "37edb7381afd68cf0bcc912ffdd617e2d8c2224f", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY.\n\nPRINCE ALBERT, N.W.T.\n\nTERMS.—$25 per annum in advance, payable quarterly.\n\nIn no case will goods be inserted in this paper. By publication, buyer is liable.\n\nAll letters to be addressed to the Proprietor.\n\nTHE OLD YEAR AND THE NEW.\n\nThe last month of the old year is rapidly running out, and before the next issue of our paper the year Eighties hundred and eighty-three will have numbered with the past, and the New Year of one thousand eight hundred and eighty-four will arrive at high hopes and aspirations which have been born of existence. It is becoming at this time that like the earliest merchant or town man, the balance wheel has been taken off his business, so ought we at the close of another year to take measure of our affairs, and to form new resolutions for guiding us into the New Year which we shall shortly enter.\n\nThe new clearing has not been marked by any striking features, but a public nature in connection with Prince Albert. Business has been rather dull during the closing months, and a very limited period during which the navigation of the river was open this season. The crops have been good, and let our farmers have cause to be thankful for a bountiful harvest, stored for the winter's use and for their little debt, and from the erection of churches and buildings (including two churches and a brick Presbyterian Church), have been gained in this quarter. We have just closed which have added greatly to the appearance and prosperity of the place. The greatest event of the New Year is the thank promising and favorable. Under the regime of the new Ministry of the North-West, there is assurance that many of our grievances will be removed, and our Patents granted without further delay. An offer of the government to extend the terms will shortly arrive in Prince Albert with full authority to acquire land and settle. The most important local event has been the extension of the Telegraph line into this district, which although it has not been accomplished without considerable difficulty and hard feeling being excited, will be of great advantage to the course pursued by the Government in District Solicitorship. We trust that the term will shortly arrive in Prince Albert with full authority to acquire land and settle. The most important local event has been the extension of the Telegraph line into this district, which although it has not been accomplished without considerable difficulty and hard feeling being excited, will be of great advantage to the course pursued by the Government in District Solicitorship. We trust that the term will shortly arrive in Prince Albert with full authority to acquire land and settle.\n\nTHE MILE BELT.\n\nAfter a long delay the Government are about to make an appeal of advice to make partial amends to the settlers of the North West for a great grievance which has acted as a dead hitch to the settlement of the country for eighteen months or more. The lands in the Southern reserve so called, that is between the International boundary belt and the International boundary which were withdrawn from settlement or sale since 1882, have been thrown up for sale, and the lands bought by the latter at the old price, $2.50 an acre. This involves some of our members of valuable farms and will make valuable impetus to South Western Manitoba. The mile belt also, that is, all the lands south of the Fourth principal meridian, has been thrown open for sale and settlement and on these terms. The lands in question have been sold at a great change in the appearance of the country along the great national highway. The lands in question have been thrown up for sale, and the lands bought by the latter at the old price, $2.50 an acre. This involves some of our members of valuable farms and will make valuable impetus to South Western Manitoba.\n\nJ. O. DAVIS & CO.\n\nDon't talk unless you have something to say.\n\nThe Boom is off!\n\nWe are determined to sell out at actual cost. Hard Lines. Better luck next time.\n\nWhat cannot be avoided\n\nTwo children witness to lament.\n\nHow often in affairs of men we fall helplessly into bad hands?\n\nThis must not be made, dear sir,\n\nAnd with proceeds of the sale buy sheep.\n\nCold that's put to温柔ing begins.\n\nBRANCH STORE\n\nNear the building occupied by the late firm of Addison & Anew, in the west end.\n\nMr. W. C. Rossney is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO., Wholesale and Retail.\n\nPrince Albert.\n\nREMVED.\n\nDR. BAIN\n\nHas removed his office to the new building in rear of the Presbyterian Church.\n\nOFFICE HOURS:\n\nFrom 9 a.m. to 12 p.m.\nFrom 7 p.m. to 8 p.m.\n\nWM. R. BELL.\n\n1879.\n\nImportant Circular\n\nFROM Buffalo Hall!\n\nOwing to a change in our business, which will take effect on Jan. 1st, 1884, all accounts due and not provided for by that date, will be placed in the hands of our solicitor for collection.\n\nBETTS & Gwynne.\n\nMANITOBA WEEKLY FREE PRESS.\n\nThe Monarch of the Weeklies.\n\nTHE LARGEST PAPER IN CANADA!\n\nTHREE MONTHS FREE.\n\nThree Handsome Cash Prizes of $500-$200-$100.\n\nThe MANITOBA WEEKLY FREE PRESS is now entering upon its Twelfth Year of publication. It has, therefore, been distinguished with several Northwest almost from its origin. During the whole of this period it has been an acknowledged authority and leader in the field of news and information. The MANITOBA WEEKLY FREE PRESS has always been the first to bring to the attention of its readers the most important developments of the day. It has never failed to give the most accurate and up-to-date information on all matters of importance. It has always been the first to bring to the attention of its readers the most important developments of the day. It has never failed to give the most accurate and up-to-date information on all matters of importance.\n\nNOW TO SUBSCRIBE.\n\nEnclose TWO DOLLARS\n\nRegistered Letter (writing name of Subscriber and Post Office very legibly)\n\nMANITOBA WEEKLY FREE PRESS.\n\nWINNIPEG, MANITOBA.\nOUR GRIEVANCES.\n\nDear Doctor, our problem you'll want to solve.\n\nWhen you hear of the various ills we endure,\nThe pain we're suffering, you'll want to solve.\n\nYour numerous remedies we desire and seek,\nAnd really our case is alarming.\n\nYou've blistered and bled us for a moment's time,\nWe've swallowed while corpses of loved ones lie.\n\nUntil the next shock, such as this, we'll die.\nAnd guess what? You'll be making us worse.\n\nFor really our case is alarming.\n\nFifty cents on a million pounds put on our back,\nYou've ruined our clothing and bedding and shoes.\n\nOur clothes have been washed in a bath of oil,\nAnd guess what? You'll be making us worse.\n\nStill really our case is alarming.\n\nYou've taken our wages, machinery and tools,\nOn the promise, incidentally, taxes and dues.\n\nWe've lost our homes, our cars and modes,\nThat's why we're here, hoping for a quick fix.\n\nTo stand still as much of your counting as possible,\nYou've made reservations, you've cancelled and stalled.\n\nThe result? All the public lands are paid,\nWith the timber and minerals and quarters paid.\n\nTill one section in three you have left quite bare.\n\nWhere the hayseeds may work at their farming.\n\nThere's a time on a houseboat you say,\nWhen the patient you'll patch up my flat right away.\n\nIf you've done what I'm doing, but took here I say,\nI'll be living in Prince Albert where I've grown quite pale.\n\nBut thanks for your help—your patience is exceeding,\nAnd we'll make sure when you come again.\n\nTHE TIMES CONTAINS ALL ORIGINAL MATTER.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nSubscribe! Subscribe!\n\nJOE PRINTING.\n\nLetter Heads,\nBill Heads,\nEnvelopes,\nCirculars,\nDodgers,\nBusiness Cards,\nLegal Printing,\nPamphlets,\nEtc., Etc., Etc.,\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETTY,\nPROPRIETORS\n\nRIVER STREET,\nPRINCE ALBERT\nSANTA CLAUS IS COMING.\n\nHeadquarters, The Horse Shoe Store.\n\nGOOD LUCK FOR THE COMING YEAR.\n\nToys, Boys Tool Chests, Games, Picture Books, Nursery Rhymes, Dolls, Scrolls, Paper Mache, Card Receivers, Brackets, Plush, Velvet, Metal and Rustic Frames, all sizes, at prices that will surprise you; Mufflers, Berlin Wool, Parlor Decorations, Christmas Tree Decorations, Albums, all sizes and quality, from 50c to $10; Autograph Albums, Pocket Books, Lady's Satchels, Sets Jewelerly, Necklets, Looking Glasses, Dressing Cases, Xmas and New Year Cards, all and everything for the Holidays.\n\nAlso Choice Groceries, Dry Goods of all descriptions, Gent's Furnishings, Caps, Hats, Gloves, Mufflers, Ready-made Clothing, Moccasins, Over Shoes, Felt Boots.\n\nMoney may mean cash. Money also means Big Bargains at the Horse Shoe Store.\n\nExpect Big Bargains and you will get them.\n\nTHOMAS O. DAVIS.\n\nCOMMUNICATIONS.\n\nLEGAL PRECEDENCE.\n\nTo the Editor of The Times.\n\nSir,—In your last issue I notice a communication over the name of W. V. Maclean which for elegance of style and language is certainly not in any way a production of modern authors. I had thought that the golden age of English Literature was past, I find it was mistaken, that so fine a writer as being the case, I am satisfied that the brightest star in our literary firmament is only just appearing above the horizon. I would strongly advise that gentleness for the future to devote himself to literature, as he has already shown his success is assured. With regard to his letter, it is an interesting as well as an important question, whether it is proper for the general public to know that Mr. Maclean has \"travelled and seen strange wonders,\" and that he has been to \"every body's\" adventure to an open question. I do not consider that \"stranger\" displayed any ignominy in his letter, but that he had let himself agree with \"stranger\" that the course taken by Mr. Maclean was not only false but personal, but also against the Judge and the other barristers present but improper in the eyes of the public. I have no doubt that any Court in the Dominion or any where else, and also amongst Barristers, and even amongst the laity, would condemn his youth, inexperience and ignorance of professional courtesy as well as his conduct in every day life. The usual practice where a regularly constituted Bar Society meets for the Masters of the Bar to draw up rules relative to the bar which is read by the President or the Secretary of the bar as may be directed by the Masters of the Bar. All who have no Law Society, therefore when an address is to be presented by the bar society, the President or the senior barrister present should read the address, and I am strongly of the opinion that such an address should be regulated by the date of admission of the several barristers in the respective Provinces. If Mr. Maclean had referred to the Bar, Mr. Maclean knew that there was to be an address read to Judge Redfern, an address in which he fully concurred, as he already had done before he made his speech, just as he would have wished the Address had been made by the President and then supplemented by any remarks he saw fit to make, he would have been perfectly justified in doing so. Mr. Maclean is well merited reliance which he has received at the hands of \"stranger\" and others, and I am sure that Mr. Maclean will not address the Judges on his own behalf as representing the Bar of Prince Albert, for I am sure that no respectable able barrister who was ever called would do so, and in fact some of the barristers were obliged to do so. There are many who are afraid of the \"persecution\" and although it is said to be a hard school yet it is to be hoped that Mr. Maclean will succeed through it not without some benefit to himself. I agree with Mr. Maclean that amongst the barristers in this province the practice has lasted years that he would take precedence over all others, provided he had an organization at the Bar and that he had a Law Society. As regards the allusion in the conclusion of Mr. Maclean's letter to the \"adventures\" of the Judge, of himself and other pioneers \"which laid the foundations of business\" in this place, every one is prepared to give him credit for the hardships he has under-\n\nLONG SERMONS.\n\nSir,—I think it would be a move in the right direction, and one which would be generally appreciated by church goers, if some of our local ministers would reduce their sermons to a half hour in length, with the purpose of providing a controversy on the subject, but because I know that it meets the views of large numbers of the congregants, I am quite familiar with the arguments used by ministers in their sermons, and I am also quite prepared to meet them if necessary. I hope that his suggestion will be adopted by our clergyman, so that I have the most profound respect, and that we will have sermons of a reasonable length.\n\nMODERATION.\n\nIt is a delicate matter to approach upon the province of the ministers, for whom also are held the highest respect, without venturing into particularities, we think that there is a good deal worth in what our correspondent says. It is impossible to compress within the space of twenty to twenty-five, or so special cases thirty subject, what runs over that time had better perhaps be left out. Religious services are now conducted in a condensed form, than weakened and watered by many additions. In old times, we have heard of the \"longer service,\" as the \"longer service,\" but by that time the most of their congregation resided in the land of the living, while the remainder of their Sunday dinner being spoiled, its moderate in all things is a good thing, and I believe that it is more common as to any other species of excess.\n\nPUBLIC NOTICE.\n\nGovernment House,\n\nPrince Albert, Dec. 26, 1883.\n\nHis Excellency the Governor-General of Canada,\n\nTo the Right Honorable the Honorable the Acting Superintendent-General of Indian Affairs, in and for the North-West Territories, respectfully,\n\nThat the second section of the Act mentioned above, does and hereby does repeal and annul all Acts, laws, orders, regulations, instructions, rules, directions, and provisions, made, issued, promulgated, or ordered by any person or persons whatever, in pursuance thereof, and that all Acts, laws, orders, regulations, instructions, rules, directions, and provisions, made, issued, promulgated, or ordered by any person or persons whatever, in pursuance thereof, are hereby made void and repealed.\n\nAnd whereas, the said Act mentioned above, does and hereby does repeal and annul all Acts, laws, orders, regulations, instructions, rules, directions, and provisions, made, issued, promulgated, or ordered by any person or persons whatever, in pursuance thereof, and that all Acts, laws, orders, regulations, instructions, rules, directions, and provisions, made, issued, promulgated, or ordered by any person or persons whatever, in pursuance thereof, are hereby made void and repealed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert—N.W.T\n\nHUDSON'S BAY CO'Y FARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great fertile Belt, and now offer for sale 500,000 acres already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Steinbach, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIGGS, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883122801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9408, "total-output-tokens": 3666, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6018, 2], [6018, 7853, 3], [7853, 7853, 4], [7853, 7853, 5], [7853, 15537, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]