[{"id": "5511fe5358d9cdd5c82ed16b490ef57747942039", "text": "HORSE SHOE STORE\n\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\n\nFifty Chests Choice Congo Tea\n\nWhich we will sell until further notice at 25c per lb.\n\nFresh importations in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\n\nFull Lines of Windowcurtains\n\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\n\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC.\n\nBOOTS AND SHOES ARRIVING WEEKLY\n\n10,000 CHOICE CIGARS!\n\nAt Manufacturer's Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS\n\nIN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Uitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\nTERRITORIAL NEWS\n\nBATTLEFORD\n\nFrom the Herald, July 26.\n\nThe top of the Battle River bridge caused by the current carrying away the sand from beneath one of the mudflats has been repaired. The river is several inches higher than when last seen, but not higher than it has been at this season of the year for the past seven years.\n\nThere was considerable difficulty experienced by the police in obtaining their shooting drill on it. They had recourse to a range fire on the opposite side of the school, where they finished up their practice.\n\nCoast. Higgins had his collar broken on Tuesday under peculiar circumstances. He was out shooting and watching the herdiers trying to catch some horses. Most unexpectedly one of the herdiers came up to the fence corner where Higgins was standing, and the top rail was broken and thrown against his shoulder with the result above stated.\n\nQU'APPELLE\n\nFrom the Progress, July 26.\n\nMr. and Mrs. Dewdney and Hayter have come down from Regina on Saturday last and went north to Touchwood Hill. They are expected to return this evening.\n\nEDMONTON\n\nFrom the Bulletin, July 21.\n\nA severe hail storm on Wednesday afternoon cut down some crops in this vicinity. Very heavy rain and high winds followed the hail. Fortunately the storm was narrow and it passed where settlement was not close.\n\nCALGARY\n\nFrom the Tribune, Jan. 18.\n\nSunday night the heaviest rainstorm of the season came on. It was accompanied by hail and lightning. The wind was very strong and gusty. The storm lasted about an hour.\n\nFather Lacombe tells us that he has word of a very heavy hail which occurred near the Blackfoot Agency on Sunday night. The growing crops were greatly damaged, if not wholly destroyed. The hail was so heavy that it killed several Indians down who ventured from under covering.\n\nHis Worship Mayor Nelson has called a public meeting to be held in the fire hall on Thursday evening at 8 o'clock, to take into consideration and discuss the location of the new fire hall.\n\nConst. Dennis, of the N.W.M.P., was arrested on Saturday for being intoxicated while on duty. He was tried before Capt. McMillan, Halifax, found guilty of the charge, and sentenced to one year at hard labor.\n\nThe principal topic of conversation in town to-day was the announcement of the granting of a license to the Banff Springs Hotel. It appears that the license is similar to those given to the P.R. dining cars and allows the hotel to sell wine and malt beverages to its guests. The sale of the license has not been authorized officially yet, but it is understood to have been very high.\n\nREGINA\n\nFrom the Leader, July 31.\n\nCommissioner Hetherington arrived this morning from Ottawa.\n\nMr. A. Dorsey's crop is one of the finest in Canada.\n\nTwelve farmers have received the M. Police land contract at the rate of $8 per acre and rolled. The tenders ranged from $7 to $10.\n\nThe crops could not look better. A splendid spring and summer Friday morning improved the appearance of everything. They had it at Craven, and all the way south to Regina. Very little, however, fell in the field.\n\nMr. Hayter Reed has been visiting the File Hills reserve, where he found the Indians very friendly and hospitable. Their crops are very fine. The Commissioner made arrangements for the establishment of a school there.\n\nA Mounted Police detective named Johnson was arrested at Brandon last Wednesday.\n\nDuring a train excursion pale in Eastern Canada on Sunday night a partially finished hotel at White Rock was attacked. When the train started from Weyburn the hurdlers halted it and demanded the luggage be delivered. The Board of Trade has received its certificate of incorporation from the Secretary of State.\n\nMagnificent weather.\n\nAt a meeting held on Friday afternoon the Regina branch of the Dominion Rifle Association was formed, with President Mr. Macdonald and members as follows: Sec.-Gen. Col. Benson, of Ottawa, has written to fix rules, etc.\n\nFORT MACLEOD\n\nFrom the Gazette, July 25.\n\nD Division, N.W.M.P., has received orders to remain in British Columbia until the end of August. Indians believe the American Government are trying to settle on the Flat Head reservation are getting into trouble, and the Police will be there to keep them quiet.\n\nFor several evenings during the past week terrific storms have been raging in the vicinity of McLeod, but none of them touched us. On Friday evening last a terrible storm visited the country around the station, extending north and east of McLeod, and struck Kipp and Latchbridge, and the line east of Latchbridge. The wind was very high, hail, wind and rain, all three being very severe. The storm is said to have been the worst experienced in this part of the country for years.\n\nDUNN'S BAKING POWDER\n\nTHE COOK'S BEST FRIEND\n\nFOR SALE BY DEALERS AND RETAIL GROCERS\n\nA FRIGHTFUL SKIN DISEASE\n\nSuffering intense heat, burning, rawness, itching, inflammation, etc., caused by the fattening breeds.\n\nMoses Stevens & Brothers, Montreal Co.,\n\nBoston, Mass., Oct. 2, 1897.\n\nI have been suffering from this disease for two months ago, and on my recommendation I bought a bottle of Dunn's Baking Powder. I used it every day, and now I am perfectly well.\n\nW. M. S. STEPHENSON,\n\nWinchester, Mass.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nA Dead Drop!\n\nPRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nSTEVENS & BRUNER\n\nCultivate, the great skin cure, and Cultivate Cream, the great skin cream. Cultivate Cream, the new blood purifier, is the best remedy for the cure of skin and blood diseases, from pustules to ulcers.\n\nSold everywhere. Price Cultivate Cream, 5c; Cultivate Cream, 10c; Cultivate Cream, 15c; Cultivate Cream, 25c.\n\nEASY TO USE.\n\nG. H. CAMPBELL\n\nGENERAL Railroad and Steamship TICKET AGENT,\n\n471 MAIN STREET, WINNIPEG, MAN.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nCRICKET MATCH TOWN COUNCIL\n\nOn Wednesday afternoon last the P.A. Cricket Club and F Division Cricket Club again tried conclusions with the willow. The P.A. club could hardly have got through playing cricket without having been very much puzzled since the last match, and everyone thought it would be an easy victory for the latter, but the latter’s tactics were not in the least bit good that day, not that they played at all badly but every chance given by them was seized upon by the P.A. team. The bowling of the P.A.s was remarkably good with few exceptions. Way gathered in a very strong manner, and when the first came within running distance, their batting was good considering the few practice they had, and the bowling of Black Agnew was also very effective. The police were in fine trim and had quite a bit of practice after the last match. They showed some teamwork both in field and in fine style, although they did not win the game they played without any difficulty. In fact, but for the fielding, their bowlers Brown, Doug, and deservable mention. We must commend the police for their excellent fielding and their drive, and P.H. Irving have something to be proud of in their cricket team. Only one of the players was absent, the late Walter Murray, double figures—McKay, of the P.A.s, and Staff-Sgt. Parker, of F Division. Going by the result of the last price list, he is having an average of nine and two-thirds runs. Parker next best with seven runs. The following is the score:\n\n| P A. CRICKET CLUB | F DIVISION CRICKET CLUB |\n|-------------------|-------------------------|\n| Runs              | Runs                   |\n| Harley, W.        | 12                      |\n| Jones, J.          | 6                       |\n| Smith, J.          | 8                       |\n| Parker, R.         | 4                       |\n| Powers, D.         | 5                       |\n| Douglas, J.        | 3                       |\n| Boulton, H.        | 2                       |\n| McKee, G.          | 1                       |\n| Robertson, H.      | 1                       |\n| Murray, W.         | 1                       |\n| Total             | 36                      |\n\nTotal Grand Total: 36\n\nFrom this above store it will soon be seen that the P.A. Cricket Club are the victors by one run and three wickets.\n\nMr. Geo. Northcaves and Constable Warren performed the arduous duties of umpire very efficiently.\n\nLOCAL NEWS.\n\nPermits are now being issued to all hotels in the Northwest with a capacity of twelve bedrooms and stabling for five horses, the permits carrying a tax of ten cents per cent of alcohol. The tax is to receive a flat rate of ten cents per gallon. Douglas has issued a warrant temporarily suspending the levy to be issued on a doctor’s certificate.\n\nThe Canadian shot for the Kolpner Cup at Windsor, Ontario, Canada, Jersey and Guernsey, England has won the cup thirteen times and Canada four times. The English commissioner admits that while the Canadians are not physically handicapped, as he has the pack of them, whereas the Canadians have only twenty-eight, the strongest English team possible to select made only sixty-three points at the three ranges, Canada making sixty-one. The American team scored seventy-five hundred points.\n\nThe day before the match the Canadians, at a trial at the same range, compiled an insignificant total of 177, but the midgets were able to improve on the match.\n\nINTERESTING TO PARENTS.\n\nMr. John Laidlaw, of the Ottawa Free Press, says: Our baby was so choked up she could hardly breathe. In fact she was so choked she could choke to death. However, because of the difficulty every minute, for which we could get no relief for the most part, formerly, we used to put a little bottle of Nasal Balm in the baby’s mouth and set it trying, and in twenty minutes from the first application she was able to stop coughing and breathing easily, and in twenty-four hours not a sign of trouble remained. It is an invaluable remedy for children as well as grown people.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., 12 Spruce St., New York.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThe Powder is made of the finest flour and is guaranteed to be free from all adulteration. It is sold in boxes of one pound each.\n\nC. D. NORTHCAVES,\n\nWatchmaker and Jeweller,\n\nAt T. N. Campbell’s New Store\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO\n\nPRINCE ALBERT BREWERY!\n\nPure and Sparkling AMBER-Hop-ALE.\n\nDelivered to all Parts of the Town.\n\nMINTON & GERMON WALL PAPER\n\nAND BORDERS!\n\nA Large Stock at CANN’S BOOK STORE.\n\nOpposition is the Life of Trade\n\nA First-class Grocery, Meat and Fish Market.\n\nWe would like to invite the public who in former times have visited our establishment to come again and see what we have done to improve our premises and make them more attractive and comfortable. We have added a new department and are now prepared to give the public the best service possible.\n\nH. MACDOUGALL\n\nGO TO AGNEW’S\n\nFOR MACHINE OILS,\n\nSCYTHES AND SNAITHS\n\nHAY FORKS,\n\nWINDOW SASH,\n\nPANEL DOORS.\n\nDonaldson & Pembbridge.\n\nT.J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888081001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 3167, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1229, 2], [1229, 7605, 3], [7605, 12836, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]