[{"id": "f8f7886f8ccc39fe43d293338ff83000269f5f79", "text": "The PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, MAY 30, 1883.\n\n$2.50 A YEAR.\n\nBanking Houses\n\nMacArthur & Knowles, Hugh J. Montgomery,\nPrince Albert. Principals of Real Estate Agent.\nMacArthur Knowles & Co., auctioneers.\nMacArthur Knowles & Co., auctioneers.\n\nNorth West Council Election\n\nNotice is hereby given that we propose to make an extraordinary sale of grain at Prince Albert, N.W.T., on the second day of June. We will sell the goods in lots at the following times:\n\nSaturday, the 2nd Day of June, at 9 a.m.\n\nPhysician and Surgeon\n\nDr. T. MacDowell.\n\nBank Notices\n\nOffice—Mason's Block Office—Mason's Block Office—Mason's Block Office—Mason's Block\n\nNotice to Creditors\n\nIn the Goods of William Oliver, deceased.\n\nNotice to Creditors\n\nIn the Goods of William Oliver, deceased.\n\nAuction Sale\n\nValuable Property, Canada.\n\nWestern Wagons, Farmers' Implements, etc.\n\nHugh J. Montgomery, Auctioneer.\n\nFor further particulars apply at our offices:\n\nResidence—Albert Street.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\n\nHugh J. Montgomery, Auctioneer.\nMAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers Northcote and Manitoba\n\nWe have decided to sell at special prices for the next two months. Call and get the best value for cash ever offered in Prince Albert.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing 20 bls Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes Baskets, etc., etc.\n\nSTEWART & WOOTTON\nPRINCE ALBERT, The Great Commercial and Railway Centre in the North West.\n\nPRINCE ALBERT, the trade centre of the Great North West, is situated on the south bank of the North Saskatchewan River, about thirty miles above its junction with the south branch of that great stream. With the last three years the peninsula thus formed has been more or less thickly settled for a hundred miles from its point, and now comprises a population of about 6,000 souls, exclusive of Indians.\n\nOriginally a Mission establishment of the Presbyterian Church, and the germ of the Settlement, Prince Albert proper, has grown into a busy, well-defined and substantially built town of about 2,000 inhabitants. A marked feature of the place is its entire freedom from the well understood \"Far West\" characteristics of frontier towns generally; everything is well-governed and orderly.\n\nImaginary buildings on maps have no place here, and neither are the principal buildings made of canvas. The leading structures are of brick, stone and wood, and the permanent features of Eastern Towns forcibly suggested. Our places of business, including mills, etc., will not suffer by comparison with those of Western Ontario. The different branches of trade correspond with any respectable town of the West, and may be particularized as follows:\n\nTwo large steam grist mills, with a grinding capacity of 35,000 lbs per day, two steam sawmills, shingle mills with a cutting capacity of 10,000 feet of lumber per day, one large steam planing mill and sash and door factory; thirteen general stores, wholesale and retail; two furniture stores, two boot and shoe stores, eight boarding houses; two tailoring establishments; two millinery and dress making establishments; one harness shop; three hardware stores; two banking houses; two jewellers' shops; one drug shop; two bakeries; three livery stables, etc.; which together did business last year to the amount of three-fourths of a million of dollars. Building material can be had cheaply, the best quality of brick is made at the town, and lime stone is abundant near by.\n\nThe Church of England has several missions throughout the Settlement, and a Church College and School at the west end of the town, all governed and regulated by a resident Bishop. The Presbyterians also have a fine church and school and several missions in the outlying districts, and the Methodist and Roman Catholic Churches are well represented.\n\nPrince Albert has always been regarded as the wheat raising belt of the North West. From Lake of the Woods northwesterly it is about half way to the Rocky Mountains, and is also midway up the great Saskatchewan and finally it is on the ever green fringe of timber which marks the boundaries between the great fertile plains of the east and south and west, and the unbroken forest which stretches over hundreds of miles to the northern limit of the Pine. The old time difficulties in the way of reaching Prince Albert are quickly disappearing, a line of fast passenger steamers make weekly trips to Carlton, Banfffield and Edmonton on the West, and Grand Rapids, Selkirk and Winnipeg on the east side of the line. By stage coach from Prince Albert to Winnipeg is easy and also a two days. And meanwhile this is the objective point of the Portage, Westhampton and Northwestern Railway which is under agreement to give us train connection with the main line within eighteen months. The South Saskatchewan Valley Railway also is to begin at once by starting 500 men to work here and double as many more at Qu'Appelle. This road is only 200 miles from Prince Albert, and the Canadian Pacific at Fort Macleod will thus be pushed rapidly forward from both ends, and its early completion insured.\n\nThe soil found about Prince Albert is common to a vast country whose limits are not fixed, and is known as a rich sandy loam splendidly adapted to the raising of wheat and other cereals grown in the Western States, and it is safe to say that as far as the eye can see, the soil is excellent and the satisfaction in quality, the acreage placed under cultivation is well nigh doubled each succeeding year.\n\nSo many natural advantages uniting as they do at Prince Albert, experience has shown, unmistakably have but one result: a Chicago, a Minneapolis, a Winnipeg; and as the relative distance is maintained, our great city of the near future on the banks of the Saskatchewan.\n\nPractically we are at the foot of a great river, a direct descent of country equal in net greatness that drained by the Mississippi, at the northwestern limit of the plains and at the lower edge of an immeasurable forest reaching to the Arctic Ocean.\n\nAlready the growth of the Settlement is wonderful, and thus early in its history one receives the comfort blessings and security of the Eastern homes left behind. As we are 500 miles from Winnipeg, the business done there is ours. There is a growing demand from the farther West for supplies of all kinds and if the future may be judged by the past, Prince Albert will be to the Great Peace River Valley in process of settlement what Winnipeg was still is to the valley of the Saskatchewan, the base of supplies.\n\nRailway connection with the steamer of the Saskatchewan at this point will make it the distributing centre of a country half the size of Europe, and when the Hudson's Bay Company takes across the Atlantic is an accomplished fact, who can say what possibilities may not be opened up?\n\nCapitalists, Farmers, Mechanics and men generally whose minds are practical cannot fail to readily understand that the advantages offered herein have stood alone unequalled in the world.\n\nA few of the natural causes which operate to make Prince Albert and surrounding country a desirable field for agriculturists and capitalists will be mentioned in order of their importance:\n\nSituated on the banks of a mighty river draining a country greater in extent than that drained by the Mississippi, and navigable through a thousand miles of its most important supply of wood and coal, and the boundless and fertile prairie stretching away to the east, south and west, awaiting but the advent of the husbandman to cause it to yield its fields of golden grain. The past growth and present prosperity of the town, notwithstanding the adverse influences with which its citizens have had to contend augurs well for its future advancement, and we may safely prophesy that it will continue to advance with giant strides until it takes its place as one of the great cities of the West.\n\nMARKLEY & ORR,\nReal Estate, Insurance & General Ag'ts\nAUCTIONEERS & CONVEYANCERS\nTown Property, Wild Lands and Improved Farms\nValuations Given.\nBOUGHT AND SOLD ON COMMISSION\nMoney Invested\nCorner of King and River Streets.\nA. W. R. MARKLEY.\n\nGeneral Merchandise\n\nSTEWART\nAND\nWOOTTON,\nGENERAL MERCHANTS.\nPRINCE ALBERT - E.W.T.\nMacarthur & Knowles,\nBANKERS & BROKERS.\nPRINCE ALBERT - E.W.T.\nA. E. PORTER\nPHYSICIAN and SURGEON.\nPRINCE ALBERT - E.W.T.\nPRINCE ALBERT\nPlanning Mills and\nSash and Door Factory\nPRINCE ALBERT - E.W.T.\nHUGH M'DOUGALL\nBoiler and Undertakers.\nPRINCE ALBERT - E.W.T.\nPRINCE ALBERT\nBoot and Shoe Store.\nPRINCE ALBERT - E.W.T.\nR. B. WAY\nFINE WATCHES.\nTHOS. O. DAVIS\nGeneral Merchant.\nWOODRING BILLIARD PARLOUR.\nFarmers' Restaurant.\nJ. O. DAVIS & CO.,\nImporters and Dealers\nIt was rather late in the afternoon when we decided\n\n**Spink & Maveety.**\n\n**James O'Brien & Co.,**  \nPrince Albert, N.W.T.\n\n**Wholesale Clothing.**\n\n**The Gable House.**\n**The Best Beer and Cigars**\n\n**Farmers' Restaurant.**\n\n**R.J.Oleary.**\n\n**Hudson's Bay J.R. McPhail.**\n\n**G.D. Northcraives.**\n\n---\n\n**Notice.**\n\nTo Merchants and Others.\n\nParsons who require\n\nAccounts collected or Business Books written up, balanced, etc.\n\nWill be pleased to apply either personally or by letter to the Post Office or Trans Office.\n\n---\nQUEEN'S BIRTHDAY\n\nCelebration in the North West\n\nThursday last being the sixty-fifth anniversary of Her Majesty's birthday, the residents of Prince Albert and the adjoining country turned out in large numbers for the purpose of celebrating the event as well as for the usual meet and race day. Nearly all the places of business were closed for the day, and anyone who could not get away took advantage of the opportunity to see the best of their ability. A committee had been appointed to form a programme of events, but the committee was unable to do so by 10 a.m., thus the programme had everything in readiness and a start was made. The first item on the programme was:\n\nSTANDING JUMP.\n\nFor this contest there were many entries, and several good jumps were made. Wright took first place with 10ft. 2in.; A. Hudson, 2nd; 10ft. 3in.; H. Porter, 3rd; 9ft. 6in.\n\nTHREE STANDING JUMPS.\n\nFor this there were four competitors entered, D. McLeod taking first prize with 11ft.; H. D. Peterson, 2nd, with 10ft. 8in.; N. McLeod, 3rd; and J. Smith, 4th.\n\nNINE STANDING JUMPS.\n\nNine competitors entered for this contest was very keen. D. Peterson, 1st; 2nd; 10ft. 5in.; James Mac, 2nd; 10ft. 3in.\n\nRUNNING RACE.\n\nThere were two entries for this, D. Peterson winning and easily clearing 10ft.; A. Hudson, 2nd; 9ft. 11in.\n\nFIFTY-YARD RACE.\n\nThis was the longest affair of the day. Two entries, H. D. Peterson, 1st; 2nd; 8ft. 6in.; N. McLeod, 2nd; 7ft. 10in.\n\nVARIED WITH POLE.\n\nThree entries were made for this contest, which was considered as good as we would wish to have seen it. A. Hudson, 1st; 7ft. 10in.; A. Morrison, 2nd; 7ft. 11in.\n\nHUNDRED-YARD RACE.\n\nFour competitors took part in this race, which had been looked forward to with much interest, owing to the well known swiftness of some of the contestants. This was the only race of the day that was won by a horse having a foot start being claimed, but not allowed. The first place was awarded to D. Peterson, 1st; 10ft. 11in.\n\nTHREE-LEGGED RACE.\n\nThis was a very amusing race, and was won by H. D. Peterson, 1st; Kay Linklater and Nelson coming in second.\n\nTwo hundred yards race.\n\nFor this race there were three entries. The first place was taken easily by S. McLeod; A. Morrison, 2nd; 10ft. 11in.\n\nThere was not much excitement over this race, it being a straightaway track and not so easy viewing as the others. The first place was taken by McKay, and the second by Linklater.\n\nSMOKING RACE.\n\nThe third race of the afternoon, the contestants in this race experienced considerable difficulty in getting up smoke, but after considerable smoking, smoke credits were getting away pretty well together, J. Linklater securing first prize.\n\nBoots and Shoes.\n\nSHANNON & MCLEOD,\n\nFirst door east of Campbell's Block.\n\nPrince Albert Auction Rooms\n\nReal Estate Exchange.\n\nPETERSON,\n\nHANAFIN & KEENAN,\n\nAuctioneers, Valuers, Real Estate, Commissions and Insurance Agents.\n\nPRINCE ALBERT\n\nWALTERS\n\nAND\n\nBAKER,\n\nGeneral Merchants.\n\nJ. O. DAVIS & CO.,\n\nImporters and Dealers.\n\nPRINCE ALBERT, N.W.T.\n\nMEDICAL HALL,\n\nT. E. JACKSON,\n\nCHEMIST AND DRUGGIST,\n\nHAS ON HAND A LARGE SUPPLY OF\n\nBlue Stone, Duster Oil, Limeseed Meal,\n\nKneem Salts, Sulphur, Horse Medicines,\n\nPatent Medicines,\n\nJobbers supplied on reasonable terms.\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nCENTS' IF YOU WANT\n\nSummer Straw Hats,\n\nDress Shirts, Ties,\n\nSuspenders, Hose,\n\nUnderclothing,\n\nStylish Suits of Clothing in great variety.\n\nCALL AT THE\n\nHORSE SHOE STORE.\n\nRIVER STREET.\n\nAll and every kind of goods at Reduced Prices.\n\nTHOS. O. DAVIS.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nMusical Instruments,\n\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 2,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information on request. In these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. DRYDEN, Commissioner.\nLOCAL AND GENERAL NEWS.\n\nParagliders printed at the Times office. J. C. MacKenzie has received a large order of boots and shoes this week, and he is determined to dispose of all his stock.\n\nIf you want a saving, make your purchases on the installment plan, monthly or quarterly payments, without interest, at MacKenzie's Office.\n\nTenders are invited for the erection of a brick house for the Presbyterian church. The building is to be completed and ready for occupation by September next.\n\nThe steamer Northcote, Capt. Wabber, took on board Mrs. MacKenzie, etc., here, which she will distribute at various points along the river. She goes up as far as Fort MacKenzie.\n\nJudging from the number of steamboat boats that have landed there during the past week, we would be led to believe that not only a landing but a town has been established in the vicinity of Mr. Kay's mill.\n\nStewart's Western Transportation Company have purchased a large consignment of goods of all descriptions by boat from Cumberland, where it had been stored during the winter, which they propose to sell at a low figure.\n\nWe have received the first number of the Gladstone Age. It is a very well got up and printed paper, twenty-eight columns, quite a large vessel for its size about. We hope the proprietors, Modde Bros., may succeed.\n\nThe regular number of the Moose Jaw News has come to hand. It is a neat little six-page paper, well printed and neatly bound. We give credit to both the town and its enterprising proprietors. We wish it all prosperity.\n\nThe Hon. Lawrence Clarke informs us that the Presbyterians of Prince Albert decided not to make any charges for goods sold in Cumberland last winter. Various reasons were given why these charges can have been refunded, such as the willingness of the H. R. Co.\n\nThe Hon. Lawrence Clarke left town by boat on Saturday morning for Edmonton, Fort Pitt and other points. The hon. gentleman has been obliged to attend to personal business before the election, and to vote for MacKenzie, even if he has to charter a steamboat at his own expense.\n\nRev. J. Sweright has been authorized by the Presbytery of Manitoba to erect Prince Albert Church. He will be joined by members from a congregation. This will be the first Presbyterian congregation in the Territorial District. Voting papers have been issued to the voters for the purpose of electing two elders.\n\nMr. VanLaren, machinist and mechanic, has recently received a large order of goods from a lumber yard. He has been engaged in buying lumber for his boat last day and week, and before evening has disposed of them all. Last Monday he received a large number of orders for sawing machines, with the hope of preparing to sell a few this fall.\n\nCharles Thompson, general blacksmith, etc., has received by boat a splendid assortment of bent runners, and shafts for wagons, plows, buggies, wagons, sleds, lorgnoses, and various other articles of the kind, so that last material, which we are sure will be greatly prized by farmers and others in this country. Mr. Thompson deserves a call.\n\nBill Books neatly and promptly printed at this office.\n\nThe following items of the last meeting of the Foreign Mission Committee of the Presbyterian Church may be of interest to our readers. The minutes of the meeting were read and the proposed establishment of a College in Prince Albert. The district committee of the Western Division were officially notified that the committee cannot see its way to recommend to the regional Assembly the raising of half the property required.\n\nCom. J. H. Davis, Superintendent of the Winnipeg & Western Transportation Co., came to Prince Albert today. The gentleman informs us that he is the first connection of the company this season to run a steamer from Prince Albert to Grand Rapids via Prince Albert, and will go on to Edmonton, making close connection with the steamer from Winnipeg to Grand Rapids. This will be a great convenience to the traveling public during the season of navigation and will do much to take away the complaints and others. The Commissioner left Prince Albert by steamer North West for below on Saturday afternoon, expecting to return here about the last July.\n\nCirculars printed with quick dispatch.\n\nPRINCE ALBERT\n\nBOOT & SHOE STORE.\n\nJUST RECEIVED another lot of boots with the greatest variety and best value in Prince Albert.\n\nCheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nBUFFALO HALL\n\nOUR STOCK CONSISTS IN PART OF\n\nBAKING POWDER\n\nROYAL\n\nA COMICALLY INTERESTING\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory\n\nPRINCE ALBERT, N.W.T.\n\nGOODFELLOW BROS. - PROP'S.\n\nFits, Epilepsy, or Falling Sickness.\n\nPRINCIPAL CLINICIAN.\n\nTO THE LADIES.\n\nNEW\n\nSpring & Summer Goods\n\nJUST RECEIVED BY EXPRESS\n\nMillinery,\n\nLadies' and Childrens' Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK,\n\nRIVER STREET.\n\nPRINCE ALBERT\n\nPRINCE ALBERT\n\nAT LAST\n\nThe Raymond Steering Machine has come.\n\nLadies, now is Your Chance\n\nI will guarantee the Raymond equal to any other steering machine in the market. The boasted advantages of the Raymond are:\n\nLIVE and LET LIVE, it is my Motto.\n\nI will sell the Raymond with the extra wheel, drive, leaf and two drawbars for $65. If you want a new wheel, I will give you it for $15. I will also give you the instructions given at J. C. MacKenzie's boot store in Brown's block building.\n\nS. W. VANLUVEN,\n\nWinnipeg and Western TRANSPORTATION CO.\n\nThis Company will run a WEEKLY LINE during the Season of Navigation between Prince Albert and Fort MacKenzie, consisting of the steamer MARCUS, Capt. A. R. Russell; NORTHCOATE, Capt. Jerry Webber; NORTHWEST, Capt. James Sheets, making close connection with the PRINCESS, Capt. James Smith, for Winnipeg.\n\nThe steamer Marquis, Capt. J. W. Lee, will run as a regular packet, but will be fitted for freight and passengers, making monthly trips.\n\nSpecial attention will be paid to the comfort of passengers, and prompt delivery of freight. Rates reasonable.\n\nJohn H. Davis Sept.\n\nS. W. SWINNARD, Prop.\n\nNo. 1 Campbell Building, Winnipeg.\n\nJ. L. JOHNSON & CO.\n\nHave just received\n\n15 TONS\n\nOF\n\nNails, Glass, Oils,\n\nHarvest Tools, and General Hardware.\n\nS. B. - Prices reduced to bottom figures.\n\nNew Stock!\n\nGOODS\n\nJUST IN.\n\nPOTATOES\n\nWanted. The Highest Price paid.\n\nJ. M. CAMPBELL.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nResidence - Near Presbyterian Church\n\nGRAND UNION\n\nLivery & Sale Stables.\n\n4 Nickel Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nA bus will run the entire route of all regular trains to convey passengers to any part of the town.\n\nS. J. DONALDSON, Prop.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883053001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 5201, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1343, 1], [1343, 1785, 2], [1785, 9106, 3], [9106, 9633, 4], [9633, 13996, 5], [13996, 20951, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]