[{"id": "dcc4b7fd7c9808cedb83ef99a31a7ab43f4484dc", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 17, 1888.\n\nLOCAL ITEMS.\n\nJudge McGeirn and family are expected home in about two weeks from date. Harvesting operations are to begin on the farm of Mr. George Miller on Monday.\n\nThe walls of the Nisbet Academy are nearly up, and the work is progressing rapidly.\n\nDouglas Porter is to be present on Wednesday for a trip to Carlton. He will return in time for the annual meeting.\n\nThe steamer Northwest is expected in town on Sunday, this will probably be her last visit until next spring.\n\nThe last cricket match between the Prince Albert and Citizens teams to be played this season will take place Saturday afternoon at the latter club.\n\nThe crops are looking their best just now, and if the weather continues fine they will have a good harvest of reaping the best harvest ever reaped here.\n\nMr. Henry Gibson has been in a few days. Mr. Gibson has been away for some time, and he has brought with him many warm friends during his stay in Prince Albert, who will be glad to see him again.\n\nR. C. Wigmore & Co. have evidently come to stay, judging from the fact that they have a fine set of fixtures in the Medical Hall. W. J. Carter is the contractor for the work.\n\nMr. H. H. Hughes has been engaged for some time past collecting funds with which to build a pantechnicon, for the use of the Mechanics' Institute, and he has been doing so from time to time. We believe the requests were responded to very liberally and that the building is in course of erection.\n\nThe close season for duck shooting over, several enterprising sportsmen have gone out for specimens. Sergeant W. Parker, and his brother Harry, succeeded in tagging 120 ducks, besides a number of geese, while Mr. J. A. Fraser, Mr. T. Campbell, and Mr. Thekney, also brought down a good bag full the other day.\n\nNews papers will be paid for inserting this advertisement.\n\nA. BOYD PERRY, Sept.\n\nMISS AULD\n\nMiss Auld informs the ladies of Prince Albert and vicinity that she has opened up in the vacant rooms occupied by Mrs. J. A. Fraser. Long may she prosper.\n\nMillinery and Fancy Goods.\n\nHaving secured the services of a First-class Dress and Mantle Maker\n\nBoarders taken at reasonable prices.\n\nN.B. Our rigs are new, and not liable to break down.\n\nNEILSON & McBEATH\n\nQUAPPETTE STATION.\n\nFarm Implements and Machinery\n\nBreakfast of Light Steel Binders,\n\nBreakfast of Mowers,\n\nPerfection Rakes,\n\nSulky & Gang Plows\n\nBreakfasting on Cross Floors,\n\nThreshing Machines,\n\nJoin Wagons,\n\nBinding Tines, etc.\n\nA large stock of repairs kept constantly on hand.\n\nAn inspection of our stock cordially solicited.\n\nWM. SHANKON & CO.\n\nWarehouse Opposite Queen's Hotel.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporter.\n\nMr. E. Queller has been at Batoche the last few days.\n\nShooting Match, Prince Albert.\n\nPrize, Alfred, $50; Melchior, $25.\n\nHilliard Mitchell, M.L.A., of Duck Lake was in town this week.\n\nFine Japan and Ceylon teas, W. Walker & Co., 36 Main Street.\n\nMrs. D. Ford returned on Wednesday from a visit to friends at South Bradshaw.\n\nFruit Salt, Warner's Safe Cure, T. J. Johnson's.\n\nThe public school has been cleaned and repaired, ready for reopening on Monday next, the 26th inst.\n\nThe new post office building near the Post Office has been completed and presents a neat and attractive appearance.\n\nMcKay's New Residence on McKay Street is nearing completion.\n\nMasons, Garvin and Holmes are the contractors.\n\nMessrs. Cockrell & Nelson are erecting a fine palatial residence for Mr. Thorpe on the McKay estate, which will soon be completed.\n\nW. R. Fish is building a new store immediately west of his present one, Messrs. McLeans & Co., hardware and saddlery.\n\nButter clocks of all sizes—$100 each. Fine milk is wanted in the dairy.\n\nWalker & Baker, the butchers, who have already patronized him so liberally and will endeavor to give satisfaction to all who will patronize him.\n\nJ. Hodgson and Dan. Gould, of Prince Albert, who passed through Edmonton last summer, have returned from a successful mining hunt winter, turned up all right this spring.\n\nThe old and famous \"Winnipeg\" will sell the choice cut of beef for 10 cents per pound. This is the biggest in the Territories, and you can try it as a tender and juicy steak or roast.\n\nThe residents of the town have been interested in the contest between an inter-racing race between two of our prominent citizens and a horse with buggy attached. The race was run on the main street and was decided in favor of the horse.\n\nThe Winnipeg Club has now got into the personal question, and is issuing a list of the best competitors in the association. The Club has been laboring under great difficulties, as it was thought to be \"old stuff\" these months ago, but in the future its subscribers can rely on all and the most authentic news of the day.\n\nOF GREAT VALUE.\n\nCapt. D. P. Maclean, Capt. W. E. P. Maclean, Capt. W. H. W. & Co., prairie ferry, Pretori, says I used Nasal Balm for a prolonged case of cold in the fall of 1887, and I am now perfectly well and through cure in less than 24 hours. I would not take $100 for my bottle of Nasal Balm if I could not re-\n\nThe annual meeting of the Saskatche-\nwan Provincial Agricultural Asso-\nciation will be held on Thursday, the 23rd inst. This is expected to be the most successful meeting ever held by the as-\nsociation. Prize money greater than of\ngreater number than formerly will be given for competition. We hope the attendance will be large, and we will be raising a large amount by subscription.\n\nThe trustees of the Nisbet Academy of Prince Albert have arranged for a few very handsome silver bowls to Kinloch Institute, A.F. & A.M., No. 16 G.L.M., on the occasion of the opening of the Nisbet Academy building on the 29th June last. The bowls are handsomely mounted in a mahogany box, being solid silver with an oxeye design, and the whole beautifully engraved.\n\nThe wholesome and refreshing Moun-\ntain Spring Water is now for sale at the Medical Hall.\n\nWalker & Baker, the butchers, say on hand, Walker & Baker's Fine Beers and Tobacco. A choice lot of the above.\n\nWe have received the newspapers at Cass's Booksellers. Subscriptions received for the Prince Albert, Assiniboia and Fort Garry Publications at lowest rates.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nNEW YORK\n\nFRIDAY, AUGUST 17, 1888.\n\nTHE BEER QUESTION.\n\nThe regulation allowing barley to be imported and still beer will be, we fear, not prove satisfactory. We assume that it is the wish of the people of these Territories to have beer. But the people do not wish to import it. It is just as easy to say that rye is as good barley as any in the land for making gin-seeds, and that we can manufacture as good an article as any made elsewhere. Again, the beer we are to be allowed to import must be of such strength that it contains alcohol. Beer of that description might answer very well along the line of railway where there will be no difficulty of importation, but will not be the Saskatchewan. It will be impossible for the beer to arrive up here in the winter months; therefore a hotelkeeper will have to lay in his winter supply before cold weather, and beer of the strength limited will scarcely keep from Winnipeg to here. Well, beer will likely be all winter; it is simply what is called \"pot beer,\" made to be drunk forthwith. We require an article containing at least seven per cent. alcohol. Until we have had experience established, it occurs to us that we are as well off with the beer now present manufactured in such enormous quantities all over the Territories, and from which the Government derives one million dollars revenue. We believe, as we said before, that Lieut.-Governor Royal has taken a step in the popular direction, but we think that His Honour should have gone a step further, he should have given the maximum strength of our beer at four per cent., and he should assert himself in the direction of some manufacture by using his influence for the establishment of a brewery in districts of population. No doubt there are a large number, and strong amongst them, such as the Dominion Attorney, who will do object to any concessions made in this respect, but speaking from our own personal information we can say they do not make any concessions of a majority of those immediately interested, and should not be allowed more than such influence as their numerical strength entitles them to in such matters. This question will eventually have to be taken hold of by the Dominion Government and settled, either by direct\nA HANDSOME DONATION.\n\nThe following has been handed to me by a prominent citizen of Prince Albert, who desires me to make known existing between the police and the Hudson's Bay officers and clerks.\n\nDear Major Perry,\n\nThe officers and members of the Hudson's Bay Company, serving in the Saskatchewan District, desire to present a cup to F. and C. Division of the North-West Mounted Police, for the purpose of doing a good turn to the men of the force who have been so kindly feeling that exists between the officers, non-commissioned officers and constables of the two troops and companies.\n\nWe enclose a cheque for $100, and will be pleased if you will forward it to Sergeant Major McPhee. We also, if successful, will be in Toronto to purchase a cup and kindly bring it back with him.\n\nIf possible, Mr. Captain Howe, of C. Division, would assume the responsibility of deciding under what conditions the cup shall be competed for, you will consider it a favor.\n\nWe are, dear Major Perry\n\nSincerely,\n\nL. Clark, J. H. Macdonald, J. C. T., S. Davison, J. A. Wm. Macdonald, J. T. T., Philip Turner, Chas. N. Cameron, Jas. K. Simpson, John M. Smith, A. G. Murray, James B. Parker, Francis Duffus, Richmond J. Hart, Albert C. Davison, A. R. A. Speed, Thos. E. Parker, Capt. J. H. Macdonald, Major Perry, Commanding F Division, Northwest Mounted Police.\n\nDear Mr. CLARK,\n\nI have to acknowledge the receipt of your letter dated August 12th, together with a cheque for $100.\n\nI desire in the name of the officers, non-commissioned officers and constables of F Division to thank you and the officers and gentlemen of the Hudson's Bay Company, Saskatchewan District, for the trophy which you have presented for competition between C and F Divisions.\n\nWe hope that the good feeling of which the cup will be a symbol will continue to grow stronger. I have forwarded a copy of your letter to Captain Howe and will confer with him regarding the conditions of competition. I will inform you as to what conclusion we come to. It will be the endeavor of the officers of F Division to retain your handsome trophy.\n\nAgain thanking you and the officers and gentlemen of your company for the generous gift.\n\nBelieve me,\n\nMy dear Mr. Clark,\n\nYours very sincerely,\n\nA. BOWEN PERRY.\n\nHon. L. CLARK, Chief Factor, Hudson's Bay Company, Prince Albert.\n\nWILL REJECT THE TREATY.\n\nPresident Cleveland's Tactics. Rebellion Against Canada Expected.\n\nWASHINGTON, August 5.—A Democratic Congressman of prominence, in the course of his speech last night before the Republican Senate caucus, the Fisherman Treaty the President will take the earliest opportunity to carry out the resolutions of Congress, and that military measures even to the extent of proclaiming non-intercourse with Canada. He said: \"There is no question but that in the speeches of the Republican Senators on the Fisheries question. The Canadian government, of course, never took any steps to prevent the passage of American fishing vessels, and the first case of outrage clear enough to awaken popular indignation will be answered by a proclamation of non-intercourse. There will be no lack of opportunity when he is on the look-out. The President will not be able to throw the whole burden of responsibility on the Republican Senate with the full knowledge of the situation.\"\n\nThe Senate will undoubtedly reject the treaty. No different result is expected by anybody.\n\nTHE N.W.M. POLICE WILL LIKELY BE ABOLISHED IN THE NORTH-WEST, IN THE NEAR FUTURE, AND THE MILITIA SYSTEM INTRODUCED.\n\nSeveral North-West papers are urging the extermination of the Mounted Police in the North-west and abolishing the police. It is becoming evident to the militia authorities that this will have to be done. It is found that the expense incurred by the Mounted Police is more than the expenditure required for the whole of the militia force. The Hon. Mr. Justice of Mitika was interviewed on the subject. He said: \"Oh, yes, I have seen all that has appeared in the newspapers upon the subject. It is a very large question, however, and nothing can be done until parliament decides, but course shall be followed.\"\n\n\"Are you in favor of the militia system being introduced in the North-west?\"\n\n\"There is no question about it but that every province should be treated alike. Force is required there as much as here.\"\n\n\"Do you think the militia could be introduced?\"\n\n\"I am sure it will come to that sometime or other. At any rate parliament will decide the question.\"\n\nIt is believed that if the question is raised at all and is decided to have militia in the North-west, that the levies made will consist for the most part of cavalry, as the militia, under certain circumstances of troops at various points would be a very easy matter.—Ottawa Free Press.\n\nMr. T. Oram, the popular hotel-man, gives us some advice. Says he: \"I have no expectations to make a short time with the necessary requirements for a first-class bar, under the new regulations in regard to the sale of beer.\"\n\nA FRIGHTFUL SKIN DISEASE.\n\nA Frightful Skin Disease—Body Covered with Sores—Cured by Paine's Celery Compound.\n\nMrs. Stevens & Bremer, Monroe Co. N.Y., write: \"In obedience to your recommendation, I bought a bottle of Paine's Celery Compound, and used it twice daily for three weeks. My husband was afflicted with eczema for a long time, and I thought it best to try your remedy. After using it twice daily for three weeks, his skin became smooth and soft, and the eczema disappeared. His skin is now perfectly smooth and soft, and he is free from all complaints.\"\n\nPrice $1.00. Sold by Drugists.\n\nWELLS, RICHARDSON & CO., Prop'ts.\n\nCall and Examine Our Stock\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nA DEAD DROP!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT NEW SPRING GOODS Far surpassing any previous seasons, both for richness design and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nNot trouble to show Goods.\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nTERRITORIAL NEWS\n\nEDMONTON.\n\nFrom the Bulletin, July 28.\n\nSeveral schemes of timber for new appearance of streets are under consideration at present.\n\nA meeting of the business board of the Methodist Church, Edmonton, was held in the church on Tuesday evening to take into consideration the question of improving the church. It has been decided to take steps to have the walls of the church painted. The work will be done by a crew employed by the church.\n\nFORT MACLEOD.\n\nFrom the Gazette, August 1.\n\nA colonist gentleman arrived from Calgary by train Monday morning. He had been away for several weeks, but returned by rail.\n\nREGINA.\n\nFrom the Leader, August 7.\n\nThe Hon. E. Dewdney arrived from Regina on Monday morning. He will run for the constituency of Regina if he is elected, he announced.\n\nMr. W. D. Parry has been named to the Senate.\n\nJ. J. Terrill, M.L.A., was here during Tuesday and Wednesday. Speaking of the new Minister of the Interior, he says the minister is doing his best to secure the election of Mr. Dewdney, who is an able and popular man.\n\nThe Regina council has decided to invite Godkin South to Regina to lecture on municipal reciprocity.\n\nCALGARY.\n\nFrom the Tribune, August 2.\n\nThe trial of Mr. Kennedy for killing Acton at Medicine Hat will take place at Medicine Hat on August 6th.\n\nGrainshippers, it is said, are playing hams with the crops in northern Alberta. A large quantity of grain was loaded on William's Lake a field of thirty-five acres of grain was eaten perfectly clean. The grain was loaded in the attempt to drive the grain shippers out of business. At Calmar the hoppers were filled so thick as to prevent the cattle from feeding.\n\nA correspondent sends a receipt for the prevention of cattle from bloats. It is said that the receipt is made by boiling two quarts of oil of colic 1 oz, of olive oil 1 oz, of linseed oil 1 oz, glycerine 2 oz, per acre.\n\nThe herd of cattle brought from the Stewart ranch, which it was expected would be loaded to-day for Montreal, was loaded to-day for Winnipeg on the prairie. It is said that a large number more of cattle will be brought to the prairie to-day. It is thought that the herd will be loaded to-day for Montreal, where a steamer will be chartered to carry the Calgary consignment.\n\nFrom the Herald, August 6.\n\nA new departure in wool shipping from Calgary is being made by Mr. D. W. Wilson. This innovation of shipping in bulky cases is having it pressed by horse power with a pressing machine. The cases are said to be more convenient to handle and will enable him to get 24,000 pounds in a car. It is thought that other wool growers will follow Mr. Wilson's example.\n\nFor why not the wool raisers combine and start a wool factory in Calgary? The factory shipper could be here at 3 o'clock to-night. It consisted of fourteen cars containing 225 head. The owner was Mr. Wilson. Mr. Eakin, members of an eastern syndicate, and were consigned to R. Bickerton & Co., Montreal. The train, which will run through Winnipeg, will be loaded with padding, left here with a twenty-five mile order, which brings them to Winnipeg on Wednesday morning.\n\nNEW GOODS NOW OPEN.\n\nLacies' Jerseys and Jackets, Corsets, Bustles, Hosiery and Gloves, and a full line of General Dry Goods.\n\nMen's and Boys' Hats!\n\nIn Fall and Spring. A Full Line of Men's and Boys' Clothing & Mens' Furnishings.\n\nGROCERIES,\n\nAll New and Fresh in both Staple and Fancy Goods.\n\nBEITTS & Gwynne\n\nR. C. W. & Co.\n\nA Large Assortment of Summer Dress Goods,\n\nThe Latest Shades of Muslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies.\n\nHATS, CAPS AND STRAWS\n\nThese Goods will be sold at bottom prices. Inspection invited.\n\nNOTICE!\n\nBest Assorted Stock of Confectionery\n\nGO TO\n\nH. McDougall's Bakery.\n\nCentral Store.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall\n\nGo To\n\nAgnew's\n\nFor Machine Oils, Scythes and Snaiths, Hay Forks, Window Sash, Panel Doors.\n\nDonaldson & Pembridge\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888081701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 4643, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6276, 1], [6276, 8648, 2], [8648, 15140, 3], [15140, 19125, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]