[{"id": "00638a2dcc776d9d5483b04ee4ddcb89152f5772", "text": "INCORPORATION.\n\nSince our last issue this question has assumed a new phase. Instead of calling a public meeting at which the views of the people could have been heard, a few prominent citizens drafted and signed a large number of signatures to a petition to the North West Colonial government for incorporation and defining the eastern limits of the town as between the Hudson Bay Company's town site and Mr. John Macdonald's property. The residents of the east end requested to be included in the proposed town limits, but their privilege being denied them they have sent another petition requesting that, if the town be incorporated, their property shall be included. This will mean the incorporation of both petitions and the drafting of a General Municipal Ordinance, under which we will have to apply for incorporation.\n\nOBITUARY.\n\nThe death is announced of Hon. Wm Elder, Provincial Secretary of New Brunswick. Mr. Elder, who was a member of the Protestant ministry, in which he labored for several years, was a brilliant scholar, having studied at Edinburgh, Dublin and Glasgow Universities. He mourned his death most profoundly; however, and may be said to have been the George Brown of New Brunswick. For many years he has been the editor and proprietor of the St. John Telegraph, the oldest Liberal newspaper in the Province, and was acknowledged to be one of the most finished writers and speakers in Canada. A few months ago he became the Provincial Secretary of the Blair administration, and the success of which he contributed much. His death will be a serious loss to the Liberal party and press of New Brunswick.\n\nWHO MAKES OUR LAWS?\n\nWe endorse the statement of the Toronto Telegram when it says: \"The English press is once more discussing the giddy young Marquis of Randolph. The last time it discussed him was in connection with a scandal in which the young man was involved, but not a contemptible part. This time it is in connection with his election to the dukedom of Marlborough. He is reported to be one of the most immoral respectable persons in English society, which, to say the least, can hardly be said to be flattering. The fact that by the most accidental birth he has been placed beyond the reach of bodily harm, enables him to rank the duke and also to a seat in the House of Lords, where he will make laws for the benefit of more respectable members. This is one of the beauties of the English system of primogeniture, by which the eldest son or next of kin steps into a vacant chair in the Lords, no matter though he be the biggest rascal in the three kingdoms. What chance would such a man have of being made a peer of those who sit in the House of Lords were chosen by the people whom they are supposed to represent?\"\n\nTHE LONDON HORROR.\n\nA little more than two years ago London was dismayed by the disastrous results of a calamity which at that time visited the city, and once more the hand of the destroyer has been laid upon her. The inhabitants of London were treated to a Friday evening of the 14th July, and the morning they were called upon to wage a desperate struggle with the elements, the horrors of which will remain fresh in the memories of those who participated in the battle against the forces of nature. The loss of life is put down at about twenty. Under the circumstances it is surprising that it was not greater. It is impossible as yet to estimate the loss to property. In the words of the London Evening News, \"a population of upwards of 2,000 persons have been well nigh bereft and at least a score of lives have been lost. About a score of houses have been destroyed and perhaps three or four times that number wrecked by being floated away from their foundations and stranded on the streets or upon the banks of the river.\" It will be many days before the inhabitants of the flooded valley recover from the disastrous effects of the late calamity. Much hard work will have to be done before the victims of this disaster have been rendered completely destitute. So far the burden of assisting the victims has been left to the City of London, whose inhabitants have been very generous. Much will still require to be done, however, and some general scheme should be adopted. There is not a town or village in the Province Ontario but would contribute substantially to a general relief fund.\n\nTHE MERCER HEAT CASE.\n\nThe Mercer case has been before the courts for the last twelve years and has been the subject of a political storm as well as the center of a great party division. The action of the Ontario Government has, however, been sustained by the highest legal authority in the country. The point at issue out of the case of the late Andrew Mercer, a wealthy citizen of Toronto who died intestate in 1871. Every effort was made to lay claim to the property without any title. The real estate held by Mr. Mercer was eventually transferred to the Crown, who was claimed to be represented in Ontario by the late Mr. Justice Gordon. In the meantime, however, Mr. Andrew Mercer, an illegitimate son of the deceased, had taken possession of the property and disputed the title of the Crown. The case was finally decided by the Court of Chancery. The Vice-Chancellor overruled the demurrer. His decision was applauded, one of the pleas being that Mr. Mercer had been without heirs and the estate consequently having escheated to the Crown should revert to the Dominion which alone represented the Crown. This decision was rejected by the Ontario Court of Appeal. The decision of the Ontario Court was appealed and reversed by the Supreme Court. The Ontario government has determined to appeal to the case to the Privy Council which will give a decision in their favor. Apart altogether from party lines the decision will assist in settling the powers of the Provincial Governments.\n\nCROP PROSPECTS.\n\nFrom all parts of the District we are in receipt of the most encouraging reports of the crops. Hay is abundant, but very few of our farmers have as yet commenced to cut. Very favorable weather the cut deserves to be delayed. Of the grain and root crops it may be too early to speak, but as some of the grain is beginning to ripen, we are in hopes that any danger from frost is now over. We have seen some oats eight weeks old, which are full headed and almost ripe already to harvest. Altogether the initial signs are that we may average yield of from thirty to forty bushels per acre. The wheat is naturally abundant over the prospects and they certainly are to be congratulated. From other parts of Canada we have been encouraged reports. Apparently the season has been unusually dry and later reports tell of rather severe frosts. In Manitoba the yield is not likely to average unusually large while Ontario reports generally indicate a good growing crop in general, corn and fall wheat a failure, roots fair but fruits a failure. Reports from private sources are even more discouraging. Some have been grown in place seed which had been sown rotting instead of sprouting owing to the excessively wet season; in others some crops were so poor that they were plowed under. In others land that was prepared was never sown at all. We only want settlers and means to work our lands to make this one of the best growing sections in the Dominion. The farms which have import crops in many localities have passed us by. The small amount of low lying land, the broken nature of our prairie and our sheltered location all tend to keep us safe from either cold winds or fogs.\n\nOUR SCHOOLS.\n\nThe opening of the new school on Monday last reminds us that we long for a larger building for our High School. Prince Albert was the first place in the North West Territories for which a school was erected and owing to this and to the otherwise excellent condition of our school it has been able to maintain its high position. Parents and others in the district owe much to the liberality of the Rev. Mr. Macdonald and the Canadian Presbyterian Church for their assistance in establishing and maintaining it, but owing to the increase in the population this assistance has been withdrawn and we have been left to shoulder the entire expense ourselves. The next question of paying the salaries of teachers and other contingent expenses has been eagerly met by the public, but in view of our school census the accommodation is only of a temporary character and unless additional seats have to be provided, in order the Mission one is now unfit for use. The plan of expanding a new school building is now being considered and it will become a more serious burden than the erection of a new school building. Possibly by the end of the year there will be a surplus for the past year amounted to over fifty dollars and an expenditure of not less than $500 will be required in order to fit it up for use during the incoming winter. The time will soon come when it will be necessary to provide for matriculation in Manitoba or Saskatchewan Universities. The question of the location of the school is one of the greatest interests of the different parts of the town will soon be such as to make the school a vital importance. Will not our men and women be the makers of a more commendable school system.\n\nMAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers Northcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods\nGroceries\nProvisions\nCrockery\nHardware\nBoots and Shoes\nWooden Ware\nFancy Goods\nClothing\n20lbs Mess Pork\nBacon and Ham\nCanned Fruits\nMaple Sugar\nBiscuits\nCigars and Fancy Pipes\nBaskets etc., etc.\n\nNOTICE.\n\nIn making your customary purchases for the coming winter, please take care to see that the goods purchased are of good quality. Kindly note that the goods are sold under the name and style of\n\nO. E. HUGHES & CO.\n\nAll defective items must be paid for.\n\nSTOBART, EDEN & CO.\n\nSTEWART & WOOTTON\nBOYS AND GIRLS.\n\nThe Prince Albert Times\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nGovernment House.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., etc., printed with neatness and dispatch.\n\nSPINK & MAVETTY,\n\nProprietors,\n\nRiver Street,\n\nPrince Albert.\nInstructions for Willie Jones.\n\n\"Did you ever strike Bridgerton?\" asked Willie Jones, who was sitting in his history lesson, who was not up to date in his history lesson.\n\n\"Aye,\" said Mr. Jones, who was sitting on a chair behind the teacher.\n\n\"I was speaking philosophically,\" said Mr. Jones.\n\nThere was silence for a few moments. Then Willie came to another speech in his history.\n\n\"Ma, who was Julius Caesar?\"\n\n\"An old soldier man who lived with Julius Caesar,\" said Mrs. Jones.\n\n\"What did he say about him there?\"\n\n\"It says his wife's name was Cleopatra.\"\n\n\"The very same. Old Cleo used to wash for us. It's strange how they come to be in such beds.\"\n\n\"Honey, honey (she murmured), Jones, so young, while Willie looked at his ma with wonder and admiration that one day he could carry all she knew. Presently he found his mother had to ask,\n\n\"Who, who, who was Julius Caesar?\"\n\nWhip, which was one of the pupils of his history and Mrs. Jones, trying to thread the point of her needle.\n\n\"But what made him famous?\" persisted Willie.\n\n\"Everything,\" answered Mrs. Jones, emphatically.\n\n\"Everything,\" echoed Willie. \"That's right, Miss Jane. Which is how people would take its oats. He dressed in a sleek and pillar-case uniform, and when his ears were surrounded him he shouted, 'Give me liberty or give me death,' and ran away.\"\n\n\"Bully for Julius!\" answered Mrs. Jones, enthusiastically.\n\n\"That's right, Miss Jane. Which is how people would take its oats. He dressed in a sleek and pillar-case uniform, and when his ears were surrounded him he shouted, 'Give me liberty or give me death,' and ran away.\"\n\n\"CARROT RIVER.\n\nThe present population of Carrot River is about 125. It would have been far easier to settle a town of that size, had it not been for the surveys which have been ordered by the government in the survey of the surrounding townships. They have been ordered because the surveys which have been ordered do not cover the whole area. As there are no even roads, no bridges, no fences, no houses, and only isolated farms, a large number who intended to have settled permanently in the town are now looking for some other spot in which to settle. However, the main purpose of our Ottawa rulers is to make sure that the town is not deserted by any monopolists who obtained their votes. Very patriotic, is it not? The town will be able to send representatives into the legislature in the near future.\n\nTHOMAS O. DAVIS.\n\nT. N. CAMPBELL.\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT - N.W.T.\n\nHUDSON'S BAY CO'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Terrible Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynn, Rat Portage, Portage la Prairie and Gunshan, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. For further information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nJ. B. HAYES, Agent.\n\nPRINCE ALBERT BOOT & SHOE STORE.\n\nJUST RECEIVED another lot of boots with the greatest variety and best value in Prince Albert.\n\nBoots & Shoes\n\nCheap, Cheap for Cash.\n\nAll Kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n\n2-4 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nREMOVED.\n\nHORSE SHOE STORE,\n\nRIVER STREET,\n\nHas been removed to CAMPBELLS BLOCK, next door east.\n\nMiss Mark's Millinery Establishment.\n\nI have opened out in my new premises, and will be glad to meet all my old customers.\n\nAn early inspection of my stock invited. All goods marked down to lowest cash prices.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and Estimates furnished when required.\n\nResidence: Near Presbyterian Church.\n\nFURNITURE!\n\nFurniture!\n\nC. & G. E. CARTER,\n\nSideboards, Bureaus, Bedsteads, Couches, Teets, Bedroom Sets, Chairs of nearly all descriptions, Cradles & Cribs for babies, Rocking Chairs for ladies, Matresses Single & Double to suit Customers.\n\nCanada Pacific Ry Co. Western Division.\n\nTRAIN SERVICE.\n\nCHANGE OF TIME.\n\nOn and after June 30th, 1883, trains will move as follows:\n\nGatineau West\n\n10:00 a.m. Portage la Prairie\n\n10:40 a.m. Winnipeg\n\n1:40 p.m. Edmonton\n\n2:00 p.m. Regina\n\n2:20 p.m. Saskatoon\n\n3:00 p.m. Medicine Hat\n\n3:30 p.m. Calgary\n\nGatineau East\n\n10:00 a.m. Winnipeg\n\n10:20 a.m. Edmonton\n\n11:00 a.m. Regina\n\n12:00 p.m. Saskatoon\n\n1:00 p.m. Medicine Hat\n\n2:00 p.m. Calgary\n\nGatineau South\n\n10:00 a.m. Winnipeg\n\n10:40 a.m. Edmonton\n\n12:00 p.m. Regina\n\n1:00 p.m. Saskatoon\n\n2:00 p.m. Medicine Hat\n\n3:00 p.m. Calgary\n\nGatineau North\n\n10:00 a.m. Winnipeg\n\n10:20 a.m. Edmonton\n\n11:00 a.m. Regina\n\n12:00 p.m. Saskatoon\n\n1:00 p.m. Medicine Hat\n\n2:00 p.m. Calgary\n\nCREDIT VALLEY RY.\n\nWHEN GOING\n\nEAST\n\nBe sure you take the CANADA SOUTHERN and CREDIT VALLEY RAILWAYS.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS.\n\nJAMES HUNTER, J. W. LEONARD.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha and Chicago & Southern Railways.\n\nPassengers using the Royal Route have all the luxuries of Modern Railway Travel. Our cars are fitted with luxurious sleeping berths and elegant Day and Night Dining Cars. We also run Sleeping Cars with change of cars for passengers between Minneapolis, St. Paul and Chicago. Rates quoted to all stations between St. Paul and Council Bluffs, with connecting rates to Chicago and Omaha.\n\nIf you wish the best travelling Accommodations, use the ROYAL ROUTE.\n\nROYAL ROUTE.\n\nH. HIGHLAND, Gen. Manager.\n\nJ. W. THOMPSON, Gen. Pass. Agent.\n\nSt. P., M. & M. Railway.\n\nTime Table.\n\nNORTHWARD.\n\nExpresses leave St. Paul at 6 p.m. arriving at Winnipeg at 10:40 a.m. following day, making their connections with lines running northward.\n\nNORTHWARD.\n\nExpresses leave St. Paul at 6 p.m. arriving at Winnipeg at 10:40 a.m. following day, making their connections with lines running northward.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nThe water in the river is rising. The farmers are getting busy. The weather is very fine. Wheat will be ready to cut out in a few days.\n\nThe farmers in this vicinity have commenced cutting their barley. The telegraph operators still sit on strike, but there is no excitement.\n\nWe have received a communication from Justice J. Campbell which will appear shortly.\n\nKnow A Barker, contractor for the erection of the future hall are pushing the work along.\n\nNo news of the Lily, further than she had left for Edmonton. She may be looked for any day.\n\nMr. Fred Baker, of the firm of Walters & Co., has left for the east yesterday. He will visit his family.\n\nMr. J. J. Fanning, representing James O'Hara's wholesale clothing, of Winnipeg and Montreal, is here.\n\nThe body of Capt. Walsh has been found, buried and unmarked. It has been forwarded back to Winnipeg.\n\nA regular meeting of Kinloch Lodge, A.F. & A.M., was held last night in the Masonic Hall Friday, 15th inst.\n\nThe Indian department of this district have about 1,000 acres under crop this year. The crops are looking good.\n\nTenders are being asked for the erection of a new school building at the Blackfoot Reserve.\n\nA.M. Mitchell, Esq., has been appointed to the position.\n\nThere was an exchange of polite words between the Presbyterian and Methodist ministers last Sabbath evening. This exchange of friendly feeling gave satisfaction to all present.\n\nThe trustees of the public school have been unable to pay Mr. John Stewart, balance of money from school match, and $47.25, per Mr. H. R. Ross, of Calgary.\n\nThe town of Cassiar, near Naples, has been nearly destroyed by an earthquake. The buildings of Cassiar, Nelson and Lillooet are greatly damaged. The loss of life is estimated at about 600.\n\nThe business hitherto carried on and known as the firm of Stobart, Eden & Co., will be continued by Messrs. Stobart & Co., with the same name and style of O. E. Hughes & Co. All debts due the old firm must be paid to the new firm.\n\nOn Monday afternoon, Mr. W. A. McLean while enjoying a concert on his favorite instrument, was hit and killed by his horse stumbling and falling. Happily the only result was a slightly broken shin bone.\n\nMr. Wm. Dobbin is erecting a brick cottage in rear of the Presbyterian Church. The contractor is doing the brick work. Mr. Geo. Brown, made quick time with his part of the building, by getting it completed last week.\n\nNo summons against anyone will be issued from the office of the clerk of the court, until after (or) during the proper fees in advance. Service fees and mileage must be arranged for with the bailiff, as he shall be responsible for them.\n\nJames Clark, the laborer who was killed by a mule, was killed July 27th, south of Prince Albert. He was employed by Mr. Peter Hansen, who lives near the College, Prince Albert.\n\nThe Hon. L. Clarke received a message from Battleford saying that the Mambert had arrived at Battleford on the 27th inst., and left again at 3 p.m. for Prince Albert. Mr. Mambert had been away for some time.\n\nAlso that the Northcote had arrived here on the 27th inst., and that Mr. Mambert had returned for eighty tons loaded as per message from Battleford.\n\nThe water was high and rising.\n\nMr. Mambert was returning home back while on his way to Carrot River last Wednesday morning, when he met with an accident. While engaged in feeding cattle, the wheel of the buckboard struck a stone, Mr. Mambert fell from the seat over the dashboard. In half fall his legs were caught in the buckboard, and the wheel of the buckboard, locked fast as in a vice, crushed his legs. He died instantly near the house boat. The tightened bowstring prevented the buckboard from going the danger of the position. Further explanation would be useless, as it proved any more dangerous result than a severe beating.\n\nBAKING POWDER!\n\nABSOLUTELY PURE!\n\nROYALTY\n\nCanada Life Assurance COMPANY\n\nESTABLISHED\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $8,000,000.\n\nAnnual Income, over $1,000,000.\n\nA general agent of the Company will visit this district and make personal and confidential inquiries regarding the best insurance for the individual and the family.\n\nA. SPROAT,\n\nASS'Y,\n\nPrince Albert District, N.W.T.\n\nNOTICE.\n\nFrom this date no Summons or any other process will be issued from my office, except on payment of the proper fees in advance. Service fees and mileage will be assessed against the Defendant, as I shall not be responsible for them.\n\nJOSEPH FINLAYSON,\n\nClerk of the Court.\n\nA MEADOW LAWN MOWER\n\nTO EXCHANGE FOR A COW.\n\nCan be seen at Mr. Peter Hansen's near the College, Prince Albert.\n\nREMOVED!\n\nJ. M. Campbell\n\nHouse is in moderate demand at this time.\n\nIt will be seen by advertisement, the Canada Life Assurance Company have purchased an old residence, now with Mr. H. B. Porter, left yesterday to take up residence in the new house on Mr. J. Agnew's building. We trust he will find it to his satisfaction.\n\nW. J. Nevin of Winnipeg arrived here last week. He brought with him two buggies, two wagons, six horses and quantity of miscellaneous goods, all of which will be sold at public auction without reserve, at the Grand Union Hotel, Prince Albert, Friday the 26th inst., at noon.\n\nSHANNON & MCLEOD have removed into their new store, one block west of their old stand, and are now prepared to give to the people of Prince Albert a quality of Boots and Shoes never before offered in this town.\n\nThe entire stock has been personally selected and none but first-class material purchased. We keep no shoddy goods, and we sell at prices that cannot be competed with. Our motto is small profits and speedy returns.\n\nOrdered work done in first-class style. Reporting promptly attended to. Workmen employed for the purpose of doing first-class work.\n\nAlways in hand a good supply of leather, shoe findings, etc.\n\nOwing to our loss at the Troy fire, we are compelled to conduct our business on a strictly cash system.\n\nSHANNON & MCLEOD.\n\nREMOVED.\n\nJ. L. JOHNSON & CO.\n\nHave removed to their new building four doors west of the old stand.\n\nN.R.—We claim to have the best assortment of Shelf and Heavy Hardware in Prince Albert.\n\nPrices Guaranteed Satisfactory.\n\nBUFFALO HALL\n\nChoice Selections in DRESS GOODS at BUFFALO HALL.\n\nInfants' Elegant ROBES & CLOAKS at BUFFALO HALL.\n\nClapp & Bailey's celebrated LACE REMNANTS can be had only at BUFFALO HALL.\n\nThe largest and most reliable stock of READY MADE CLOTHING in Prince Albert at BUFFALO HALL.\n\nThe popular Double-stitched OVERALLS are made expressly for BUFFALO HALL.\n\nFresh arrivals per steamer Marquis for BUFFALO HALL.\n\nLong Clear Bacon, Canadian Ham, Tea, Sugar, Salt, Coffee Tobacco, Canned Goods, and a full line of Staple Crockery and Patent Medicines.\n\nThe Leading House of Prince Albert is BUFFALO HALL.\n\nBETTS & Gwynne.\n\nMESSRS.: PETTERSON, HANAFIN & KEENAN,\n\nWill sell by Private Sale until the First of September next the following property:\n\nParcel No. 1. 101 acres or 76 lots according to the survey of Geo. McKay property.\n\n2. Part of lot 9, Block C, Mission property.\n\n3. Lot 4, Geo. McKay River front, 66ft x 132ft.\n\n4. Lots Randell & Grant, Town Taylor property.\n\n5. Lots 17, 18, 19, 20, north side of Fourth street.\n\n6. Lots 17, 18, 19, south side of Fourth street.\n\n7. Lots 27, 28, 29, 30, north side of Fourth street.\n\n8. Lots 27, 28, 29, 30, south side of Fourth street.\n\n9. Lots 1, 2, and 3, south side Victoria street.\n\n10. Lots 1, 2, and 3, north side Victoria street.\n\n11. Lots 1, 2, and 3, north side Victoria street.\n\n12. Lots 1, 2, and 3, north side Victoria street.\n\n13. Lots 1, 2, and 3, north side Victoria street.\n\n14. Lots 1, 2, and 3, north side Victoria street.\n\n15. Lots 1, 2, and 3, north side Victoria street.\n\n16. Lots 1, 2, and 3, north side Victoria street.\n\n17. Lots 1, 2, and 3, north side Victoria street.\n\n18. Lots 1, 2, and 3, north side Victoria street.\n\n19. Lots 1, 2, and 3, north side Victoria street.\n\n20. Lots 1, 2, and 3, north side Victoria street.\n\n21. Lots 1, 2, and 3, north side Victoria street.\n\n22. Lots 1, 2, and 3, north side Victoria street.\n\n23. Lots 1, 2, and 3, north side Victoria street.\n\n24. Lots 1, 2, and 3, north side Victoria street.\n\n25. Lots 1, 2, and 3, north side Victoria street.\n\n26. Lots 1, 2, and 3, north side Victoria street.\n\nWith a large addition of other valuable property in the Town and country.\n\nFor further particulars apply to\n\nJ. D. HANAFIN or H. KEENAN.\n\nCITY AUCTION MART.\n\nMARKLEY & ORR,\n\nReal Estate and General Agents—Sale Lots in this district for the\n\nThe Celebrated New York Singer Sewing Machines!", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883081501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9500, "total-output-tokens": 6267, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9961, 2], [9961, 10515, 3], [10515, 10515, 4], [10515, 16664, 5], [16664, 25294, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]