[{"id": "f50250284b65b333a4f7c6ddf82e6e6d0025e58f", "text": "THE CARNIVAL.\n\nCarnivals date very far back in history, and even in the present day there are very few villages, however small, who do not have their gala day or event of some kind. In the past the carnival was the greatest annual celebration throughout Europe, and as such it was a very grand affair. We have our carnivals, but of a very different nature, and more suited to our own times. Mr. Slater spoke very wisely when he said we should secure the better end of the North West. He went so far as to say that all intelligent people would be of the same opinion. Mr. Slater is a man of great influence among the North West greeves, who is always well informed when there is anything worth mentioning. The chairman, Mr. Markley, also remarked that he was most agreeable to have a discussion on the subject, and of course we take into account the year in which we enjoy ourselves the most, in which we feel really happy and glad when our expectations are realized. We may say that all intelligent people would be of the same opinion as Mr. Slater.\n\nMr. MacKean, from Duke's Mills, Money invested in the bank at the rate of 5% per cent., and Mr. Markley, from the Farmers' Union, spoke very wisely about the importance of having a good carnival, and of course we take into account the year in which we enjoy ourselves the most, in which we feel really happy and glad when our expectations are realized. We may say that all intelligent people would be of the same opinion as Mr. Slater.\n\nThe resolutions passed were:\n\nEmigrants to keep away from N.W.T.\n\nThe resolutions now to be talked over in this vicinity:\n\nThe Farmers' Convention passed Resolutions regarding the Resolutions of the Farmers.\n\nThe same thing same at Brandon and Melbourne.\n\nBritish Capitalists refusing to send money here to assist Railways, etc., through the infusions more.\n\nLocal House Meets To-day.\n\nThe Lieut-Governor in His Speech referred to the Relations between the Dominion Government.\n\nNo Official Reply Received, Nothing can be done at Present.\n\nSevere storm causes Train Delays.\n\nFuneral of Mr. Johnson.\n\nLarge Turn out of Citizens and Societies.\n\nConducted Funeral for Mr. Johnson.\n\nFrench Friends and Particularists for Resolutions of sympathy.\n\nThe French were at Toronto—Guarded by Police.\n\nLondon, Ont., Thrashed with Blonds.\n\nAnother Great Victory for the British.\n\nWord Fighting. The British casualties—Several killed and wounded.\n\nThe English engage the French at close quarters—The British hold their own and rout the enemy.\n\nAnother Dynamite Explosion. One Man Blown to Pieces.\n\nGreat Indemnity in England Threatens American State.\n\nAmerican state is only compensation.\n\nThe French Authorise the Operation of the British Government.\n\nSpecial Telegraph to The Times.\n\nWhitmore, March 12. The resolutions passed by the Farmers' Convention and the farmers' meetings throughout the North West, which were passed at the Farmers' Convention are the sole topic of conversation here.\n\nThe farmers are denounced on all sides.\n\nThe City Council here has passed resolutions calling for a meeting of all farmers and the same thing has been done at Brandon and Melbourne.\n\nThe farming here is that the farmers are most unfairly treated.\n\nOwing to these resolutions, British capitalists are already refusing to send money here to assist the railways. The Canadian Pacific Railway, and the C. P. R. for the same reason, refuse to go on with their branch lines.\n\nThe Local House opened today.\n\nIn the reply the farmer referred to the recent negotiations with the French Government, but as no official reply had been received, nothing could be done until such is the case.\n\nA severe storm came on at Wainwright, delaying trains for twelve hours.\n\nThe troubles at the A.M. School in the large town were seen in Wainwright. There was an immense turn out of the citizens and the different societies.\n\nA conductor was discharged yesterday at Wainwright.\n\nOttawa, March 13.—French priests want the Dominion Parliament to pass resolutions of sympathy with the Pope in his present trouble. It is felt to be absurd and uncalled for.\n\nToronto, March 13.—During the recent troubles at the school the authorities became alarmed, guards were put on all public buildings day and night.\n\nLethbridge, March 13.—The city was thrown into a state of confusion.\n\nLevison, March 13.—Another great victory has been won by the British troops over the Savoia yesterday.\n\nThe fight was a hard one and lasted several hours.\n\nThe British were outnumbered by ten to one.\n\nTwo hundred of the British were killed and several wounded.\n\nThe Arabs made a night attack and kept up a constant fire until morning.\n\nThe British infantry swept the Army at close quarters, and desperate fighting ensued.\n\nThe British wounded by thousands, but bravely held their own and completely routed the enemy.\n\nThe Arab loss was very heavy.\n\nPart of the battle is still being waged by artillery.\n\nAnother dynamic explosion took place last evening.\n\nOne man was blown to pieces.\n\nInterim indignation is felt in England, and threats are made to wipe out the Liberal party in England. Irish patriots in America say that they will only come back if the Liberals stop opposing the British Government against dynasties, and warns the Government to expect patriots from America.\n\nTHE DEVIL AND THE LAWYER.\n\nThe devil came to the earth one day, and unto an honest house went he. Said unto an attorney he very grave. Sir, sir, sir, what is your name? I am a lawyer by trade, sir. Sir, sir, sir, how many cases have you never heard of? None, sir. Sir, sir, sir, how many cases have you never heard of? None, sir. Sir, sir, sir, how many cases have you never heard of? None, sir. Sir, sir, sir, how many cases have you never heard of? None, sir.\n\nAs soon as the speaker had come to a close the crowd opposite then fired its guns, and the firing continued for several minutes.\n\nAn attempt at a killing of men met the worst.\n\nThey quarreled, contended and argued.\n\nThey began to determine the one that was right.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\n\nAnd the Devil told Lord quite up and down the face of the law.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\nPUBLISHED BY\nSPINK & MAVEETY\nPRINCE ALBERT, N.W.T.\n\nTHE HUDSON BAY ROUTE.\nThis subject is still uppermost and occupying the minds of the greater part of the population of the North West Territories and though meetings are held, speeches spoken and articles appear in the press on all sides, we fear that the fact of a port in the Hudson's Bay being the eventual outlet for the wealth of these Territories, is not grasped at as thoroughly as it ought to be, and that there is not sufficiently enough importance attached to this, for us, a most vital question. What we should like to see is, that some of the religious and political men who are taking such keen interest in this subject, would come up here and look at the ground for themselves, not trusting to hear-say words and then sell us, the principal people here, concerned, and when the question of the undertaking will mostly depend, what they think of the idea; how they wish to run the line; and how much it will benefit us; if we help them on with their plans. We think that the people of this country are too apt to place their interests and money at the mercy of any mobocrats, hundreds of miles away, is simply absurd. The facts of our having ports on the coast, and navigable rivers and our very mild, navigable river ships and steamers, a large portion of the year, ought to be sufficient to get the position of that port fixed at once. Why does not some one question on whom the line is to run at the best interests of the country at large? Let our public men see to it, they cannot do so too soon, as it affects the health and growth of the country. They must think to be \"deeds not words.\" And let the country for its own good, help them in this great national undertaking, and let no petty local matters separate and private animosities stand in their way, which latter we are afraid they are almost too prone to do at present.\n\nTHE RECENT VICTORY IN EGYPT.\nThe British victory in Egypt, although anticipated by us has been rather a surprise, as regards the time it has taken to complete the number of small actions show fight to the enemy. Though an ultimate, but perhaps a dearly bought victory was almost certain, still it speaks very well for the efficiency and discipline of the troops engaged that they were so successful in the first onset.\n\nWe hope sincerely that an active and strong handed policy will now be adopted by the English Government, and that the full advantages of the victory will be followed up, and that no supposed to be charitable and merciful ideas be allowed to stand in the way of giving these Egyptian people the lasting lesson for England has brought home, lessons from time immemorial that no half-and-half measures will do, and that it we wish to secure our moral supremacy in Egypt, that the inhabitants of that country must be taught to understand distinctly what they will be called to receive, and that they try to break that general peace and harmony that is for the good of all.\n\nAt present, with the very meagre telegraphic information in our possession, we cannot give any details of the conflict, but will do so as soon as more authentic accounts reate us.\n\nNEW BISHOPRIC OF ASSINIBOIA.\nThe Bishop of Rupert's Land, is a leader to the Society for Promoting Christian knowledge in India, has been asked by the bishops of the district of Assiniboia to support. He says: \"I am anxious for the formation of a bishopric endowed with a fund of $25,000. A grant of $10,000 would do that, but this will not last; $30,000 would be raised.\"\n\nThe members of the Society have given notice that this month they will propose a grant of $10,000 towards the endowment of the Bishopric. The Society for the Propagation of the Gospel will do nothing to give an equal amount, and the liberality of Rupert's Land will be needed to complete the balance. An appealment may, therefore, be looked for at an early date. Under the provisions of the Act of Parliament concerning that money and rent are being sent out from England, the Archbishop of Canterbury has been requested by the Provincial Synod to make the appointment. He will, as doubtless be guided by the advice of the Bishop of Rupert's Land, choose a missionary of the Society, in their appointments to Moosejaw and Athabasca, who have wisely selected for their residences, a country where they have experience and knowledge of its needs, and, no doubt, the Archbishop will pursue the same wise policy.\n\nCARROT RIVER.\nSir, we have been engaged travelling down at Carrot River and as the majority of the people of Prince Albert are not aware of what is going on in that District I will try to give a medium of your readers a description of the present, past and present future outlook.\n\nIn the summer of 1879 Mr. Sanderson and Mr. Joseph Waddell (the last named not now in the country) each located a claim on Carrot River, and Mr. Sanderson has since been the only person to follow, and now the settlement numbers between forty and fifty actual settlers, who have been engaged during last summer and fall.\n\nIn the spring of 1880 Mr. Sanderson had a crop of 8000 bushels. Last summer 350 acres were newly broken, making a total of 850 acres of which 700 have been harvested and are ready to crop this fall.\n\nThe people of Carrot River have long been a great need for a school and as a great deal of money has been raised they have granted Mr. Henry Rattle the house he asked, and he is now engaged in teaching. He expects to have the mill in running order by the 1st of Nov. next.\n\nThere is no mention, something is to go to their cattle and sheep. I venture to say they have the finest lot of cattle according to size and breed in the country. Mr. John Sanderson has a few very fine sheep. He says it takes three years to breed them up, and when they are raised they are often better than wild animals.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nBRANCH STORE.\nNear the building occupied by the late firm of Ashwood & Agnew, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nOFFICE AND WORKSHOP,\nNew Presbyterian Church.\nJUST REMOVED AT THE MEDICAL HALL.\nVictoria Hypophosphites, Victoria Buchu and Uva Ursi, Victoria Garlicolic Acid Soap, Burdock Blood Bitters, Burdock Pilla, Hagyard's Gough Balsam, Hagyard's Yellow Oil.\n\nT. E. JACKSON.\nChemist of Drugs.\n\nJ. O. DAVIS & CO.\nWholesale and Retail.\n\nPRINCE ALBERT.\n\nPUBLIC NOTICE:\nAll persons are hereby required to take notice that the cutting of timber on the lands without authority from the Minister of Agriculture or the Lieutenant Governor of the Province, cut without authority is liable to seizure and destruction, and the owner of the land may be prosecuted.\n\nD. J. WAGGONER.\nCrown Timber Agent.\n\nSEEDS.\nAgricultural, Garden and Flower Seeds, Clover, Timothy and all varieties of Grass Seeds, Tree seeds, artificially activated, guaranteed to produce, postage free on application.\n\nR. R. KEITH & Co., Seedsmen.\n648 Main-st., Winnipeg.\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nThe Grand Central RESTAURANT.\n(Old Woodbine Saloon.)\n\nTHIENNE Restaurant has been opened and is now ready for business.\n\nMEALS AT ALL HOURS.\nTHOMAS ORAM - PROP.\n\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nWM. GORDON.\nTHE WEEK.\nA new Journal of Literature, Politics and Criticism. Edited by Mr. Gordon. Published every Thursday. At 50 cents per annum. The WEEK will appear by accomplished writers and artists, and will contain essays descriptive of a landscape by him during the past week. \"Down the Road,\" \"The Old Homestead,\" etc. There will be contributions in prose and verse from many distinguished literary and artistic writers. Art, music and drama will be represented. All letters will find Mr. Gordon a specially good medium through which to convey their thoughts and opinions. For terms and other particulars apply to\n\nC. BLACKETT ROBINSON, Publishers.\nJunction, Toronto.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n2.50 PER ANNUM.\n\n\"The Times\" Contains Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING\n\nLetter Heads,\nBill Heads,\nEnvelopes,\nCirculars,\nDodge Business Cards,\nLegal Printing,\nPamphlets,\nEtc., Etc., Etc.\n\nPRINTED WITH NEATNESS AND DILIGENCE.\n\nSPINK & MAVETT—PROPRIETORS.\n\nPRINCE ALBERT, N.W.T.\nHUDSON BAY ROUTE.\n\nThe Expedition of Mr. Smith, Esq., in his canoe, has been very successful, and he has returned with a large quantity of furs. He started from York River on the 1st of July, and arrived at Edmonton on the 25th of August. The expedition was made in a canoe, and the party consisted of Mr. Smith, Esq., Mr. Macdonald, Mr. Maclean, Mr. Macdonald's son, and Mr. Macdonald's servant. They proceeded up the river in a canoe, and landed at various points along the way. They encountered many difficulties, but managed to overcome them all. They reached Edmonton on the 25th of August, and were received with great enthusiasm by the people of the town.\n\nESTABLISHED - 1860\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, - - ONT\n\nPianos to Suit the Climate of the North West.\n\nCall and examine; no trouble to show goods.\n\nNEW PATENT BRIDGES\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT\n\nN. W. T.\nINDIAN OUTBREAK.\n\nRESCUE PARTY, Feb. 23.—At an early hour on Saturday morning Col. Herchmer, in command of a detachment of twenty mounted police, proceeded from Prince Albert to the scene of the outbreak. They arrived at the reserve about three o'clock in the afternoon, and found the Indians gathering in large numbers near the camp. The colonel ordered the police to dismount and take up positions behind some trees, while he himself advanced towards the Indians. The Indians, seeing the approach of the police, scattered in all directions. The colonel then ordered his men to advance and drive the Indians back into the camp. The Indians, seeing the determination of the police, surrendered without further resistance.\n\nFARMERS' RESTAURANT.\n\nMEALS AT ALL HOURS.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nPROPRIETOR\n\nHAV FOR SALE.\n\nTo be sold in one lot, a stack containing about 30 TONS situated about three miles back of the town.\n\nFor further information apply to\n\nJOHN F. KENNEDY,\n\nO. E. Hughes & Co.'s store.\n\nNOTICE.\n\nAll parties indebted to me by book accounts are requested to settle and send before April 1st, 1884. All accounts not settled by the above date will be put in my lawyer's hands for collection.\n\nCHESTER THOMPSON,\n\nPrince Albert, March 10th.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nA. T. N. Campbell's New Store.\n\nA LARGE STOCK OF\n\nWatches\n\nClocks\n\nJewellery\n\nKEPT CONSTANTLY ON HAND.\n\nPhotographs!\n\nNEW STUDIO.\n\nChas. E. Page.\n\nEAST END.\n\nEight Loaves for $1\n\nWM. BROWN.\n\nMILK! MILK!\n\nNO ADULTERATION.\n\nA large Assortment of\n\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\n\nPRINCE ALBERT BAKERY.\n\n2 LB LOAF. 12¢.\n\n9 LOAVES.\n\nTakes and Pasty always on hand and made to order.\n\nWM. R. BELL.\n\nCanada Life Assurance Company\n\nESTABLISHED 1867.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds nearly $6,000,000\n\nAnnual Income over $1,000,000.\n\nA general meeting of the company will be held this week for the purpose of making arrangements for the distribution of the profits among the members.\n\nA. SPROAT,\n\nActuary,\n\nPrince Albert District, N.W.T.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS.\n\nAt ticket agents sell tickets via this new and popular line.\n\nJAMES BOSS,\n\nJ. W. LEONARD,\n\nGen. Pass. Agt.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railways.\n\nPassengers on the Royal Route have all the facilities of the Chicago, St. Paul & Pacific Dining Car, Luxurious Sleeping Car, Room Car and elegant Day and Night Train.\n\nThe company issues passes unconditionally to any person who desires to travel on the Royal Route.\n\nPasses are interchangeable for any case of loss or damage to any part of the Royal Route.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance Company\n\nESTABLISHED 1867.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds nearly $6,000,000\n\nAnnual Income over $1,000,000.\n\nA general meeting of the company will be held this week for the purpose of making arrangements for the distribution of the profits among the members.\n\nA. SPROAT,\n\nActuary,\n\nPrince Albert District, N.W.T.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railways.\n\nPassengers on the Royal Route have all the facilities of the Chicago, St. Paul & Pacific Dining Car, Luxurious Sleeping Car, Room Car and elegant Day and Night Train.\n\nThe company issues passes unconditionally to any person who desires to travel on the Royal Route.\n\nPasses are interchangeable for any case of loss or damage to any part of the Royal Route.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance Company\n\nESTABLISHED 1867.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds nearly $6,000,000\n\nAnnual Income over $1,000,000.\n\nA general meeting of the company will be held this week for the purpose of making arrangements for the distribution of the profits among the members.\n\nA. SPROAT,\n\nActuary,\n\nPrince Albert District, N.W.T.\nCOMMUNICATIONS.\n\nDOGS IN CHURCH.\n\nTo the Editor of The Times.\n\nSir,—We seldom see the canine element so well represented at church as it is in Prince Albert. I have often been present where a dog was seen to be allowed inside under any consideration, but the idea is peculiar to the old school. We have now two or three dogs in our church, and not a few among us who think the church is no place for a dog, but there is no reason why they should interfere with the enjoyment of the many. It is no small pleasure that the dog, too, may be permitted to be present in the sanctuary by his favorite poser, and it gives an air of comfort to the ear and eye, and makes the service more agreeable for the members of the congregation, who cannot be expected to listen with undivided attention to the sermon, if the dog is heard barking for minutes duration. The little puppy to under a pew and sportively hangs his head out of the window, looking about him paternistically up into the minister's face as if hardly endeavoring all he is saying, then turns his head and looks through the choir; while the bally dog and tan, with prominent nose and a weeping mouth looks down below, pushing hard head in half a minute, and then, in accordance as \"Mary's land,\" but the same is somewhat distasteful by the notorious yellow dog trick to the side, and pick a quarrel with some innocence little terrier. It would be all right if only kept quiet, but he must get up, tramp down the aisle, and put the dog outside, where he keeps barking, till the scratching till service is over. It is, of course, bad behavior on the part of the dog, but bad behavior on the part of the owner would be cruel to tie him up at home for a full hour.\n\nHIGH SCHOOLS.\n\nTo the Editor of The Times.\n\nSir,—In your issue of Feb. 28th, I notice some interesting items concerning the school law and the suggestion of a high school for this town, which would I think be a great advantage to the community. We are obliged to pay a considerable sum first, as the old one looks very dilapidated and the system of elementary schools is regarded as being behind the times at the Roman Catholic Mission, taught by the Sisters, where young ladies can obtain a good education. The following subjects taught are the French, English, German, and Latin languages, also draw ing and painting, music, needlework, etc., all a first class plan, and teach music and singing. They have several boarders and a good number of pupils. The young ladies of our town can obtain a good education and accomplishments at very moderate rates. I have visited the school every year, and hope to see the high school class in operation so that the young gentlemen will be able to obtain a good and thorough education, without having this district to obtain it.\n\nPROGRESS.\n\nTHE TELEGRAPH QUESTION.\n\nTo the Editor of The Times.\n\nSir,—So far as the question addressed to you by Mr. Stewart is not answered, we are content to postpone a further announcement until after this special, but we are not proper to allow state- ments, from which inference utterly, at various times, has been drawn, to pass unquestioned. In the face of his deliberate assertion as to the nature of the telegraph question, drawn here we feel bound to believe Capt. Atwood, the more so as he had brought forward the question in behalf of a statement made to him by a Government official, that Government proper has requested the question be answered. If the question could so far have been more suitable, nor could any harm have been gained by its denial. What we do urge, therefore, is that the question be answered here during his stay to support the truth of the information for claims to be entertained, or that any good result from his time in regard. He is pleased to state that he has the information that liquor and ginger beer being openly sold here, and that a drunken man on the streets, and that the question is raised in respect to the last part of the charge. That such a spectacle was a common one he deduces from the fact that shortly after his arrival one such case occurred, and we are led to infer that his presence here, instead of being merely an accidental coincidence, explains the arrest and punishment of the offenders. With a most regrettable spirit, however, we learn that there were also some ginger cases, so any principal duties were carried out at once. As the question is raised, the police, in ginger cases must an examination be reduced to one, as the other military instructors and officers were brought before a justice of this place was composed of by one of our local magistrates before the arrival of Capt. Atwood. According to this report, the officer that day, although nominally protected by the police, was brought by direction of the police, and the court proceeded in the natural sequence of evidence given before him by a witness in another case. To revert to the question of Capt. Atwood, Atwood, taken to him merely as a matter of convenience, which enabled him to see each other satisfied, and to perform his official duties, we understand that the former was brought early at the instiga- tion and on the part of a magistrate of the latter was brought early at the instiga- tive result of the former. In neither case was action taken by Capt. Atwood, therefore. The latter was brought early at which the Captain can claim to have carried out his proper duties, and in the former case, the charge of the chief of the famous drugs is in his magisterial capa- city, but it seems a pity that he should have been brought early at the instiga- tive result of the former, for that purpose, while there are magistrates here quite ready to enforce the law, if necessary, but who are not in a posi- tive attitude to enable them to act. It seems too questionable whether acting in this manner would be worth £200 for having a small quantity of liquor in possession, followed immediately by one of £50 on those who had purchased beer, and the profits from the sale of \"poisonous drugs,\" is the only way to make the law effective. That the situation has not essentially de- fied or evaded is a fact so manifestly fact but while magistrates are powerless to take action, individuals have had their heads officially, and private individuals object to appearing in the invasions of their liberty, and to be deprived of plenty of men with little else to do whose duty it is and who are paid to attend to the performance of their duty. This information has been voluntarily laid by any one there. Perhaps any further information will be obtained, and may come more decently from some one not responsible for the performance of police offices.\n\nMORE FACTS.\n\nEXPLANATION.\n\nTo the Editor of The Times.\n\nSir,—In your issue of March 7th you ask what became of the committee appointed by Mr. MacKenzie to draft a petition to the Dominion Govern- ment, praying for representation in the Dominion House of Commons. In reply, I state that the committee began their work that day after the said meeting I waited for the rest of the committee, Mr. MacKenzie, Mr. Stewart, Mr. Wm. Stewart named the hour and place of meeting again. We attended, and I am bound to say Mr. MacKenzie, Mr. Leslie Clarke, along with others of the citizens, nominated a great insult to Mr. Stewart and myself, and I am bound to say, with such humble individuals as Mr. O. Davis and myself. Had he been appointed with other citizens whom he would have much sooner selected, he would have been waiting day and night. This, Mr. Editor, is the reason the petition has not been presented. You will be good enough to publish this for the information of the public.\n\nYours, etc.,\n\nA. J. MACKENZIE.\n\nThe matter was a little late this week, not arriving till nearly 6 p.m.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nDecorative Painting & Paperhang-\ning on short notice.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nThis Powder needs no whitening. More economical than the ordinary kinds, and cannot be sold in competition with the usual price of low grade, short weight, alum or phosphate powders. Sold only by\n\nMARKLEY & CO'Y.,\nGENERAL MERCHANTS\nPRINCE ALBERT, N.W.T.\n\nWatches, Clocks, Jewellery, Stationery.\n\nR. B. WAY,\nPost Office, Prince Albert, N.W.T.\n\nNEW FALL AND WINTER MILLINERY, LADIES' HOLMANS AND CLOAKS, Furs Caps and Muffs, Wool Goods.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nA FIRST INSTALMENT OF A LARGE STOCK OF MANUFACTURING Mowers and Rakes.\n\nBefore Breakers\nHave arrived at the Implement Department of Jackson & Jackson, and arrive shortly.\n\nThe Lion Reaper,\nHoney Fanning Mills\nWatson Reapers and\nHay Cross Ploughs.\n\nAt these prices you are guaranteed to give satisfaction.\n\nParties wishing to secure first-class implements on reasonable terms will do well to visit the implement department.\n\nJACKSON & JACKSON.\n\nBuffalo Hall!\nClose Buyers Still Patronize THIS OLD RELIABLE HOUSE.\n\nWe Need Money and are Willing to Sacrifice our Goods to get it.\n\nOver due accounts should be attended to at once to avoid costs.\n\nBETTS & Gwynne.\nHARDWARE!\n\nJ. L. JOHNSON & CO.\nDEALERS IN\nGeneral, Shelf and Heavy Hardware, Glass, Paints, Oils, Etc.\nMain St., Prince Albert.\n\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nTOWN LOTS FOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIDGES, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884031401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9040, "total-output-tokens": 7171, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6731, 1], [6731, 14716, 2], [14716, 15213, 3], [15213, 16231, 4], [16231, 20163, 5], [20163, 30123, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]