[{"id": "e16695c1a2bd787560eab8243cedebdc12783358", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVETTY\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\nSt. Alban's—Service, 11 a.m., Rev. Mr. Macdonald, Archdeacon of McKay.\nSt. Paul's—Morning Service, 10 a.m., Rev. Canon Fleet.\nSt. Andrew's—Morning Service, 10 a.m., Rev. Dr. McNair.\nSt. John's—Morning Service, 10 a.m., Rev. Mr. Wright.\nSt. Mark's—Morning Service, 10 a.m., Rev. Mr. Smith.\nMasses—Morning Service, Lower Hill and\nDundas Cemetery—Sunday morning—Rev. Mr. Smith.\nMasses—Evening Service, St. Mark's Church—Rev. Mr. Smith.\nMasses—Evening Service, Dundas Cemetery—Rev. Mr. Smith.\n\nTHIS PAPER may be found at the following places:\nNew York—The Times Building.\nBoston—The Boston Post Office.\nMontreal—The Montreal Post Office.\n\nFRIDAY, DEC. 28, 1888.\n\nMDCCCLXXXIX.\n\nNotwithstanding the very many difficulties and disadvantages under which we labor in this district, the year has been productive of much good to town and settlements make some advance. We may almost say that we have been prosperous. If we have not increased greatly in wealth, we have certainly increased in numbers. The farming community were blessed with a fair crop, and they got fair prices for their grain; they have been able to dispose of all the cattle they could produce and realize good prices. Dairy products are doing a good business on the market here, and this year the supply was about equal to the demand for local consumption. We believe that the husbandman is in a better and more hopeful condition now than he was one year ago. Our town gives evidence of progress and prosperity. There have been quite a number of substantial buildings erected in the last twelve months, among them being the new school, all of which are occupied. One or two of the old business men have left to seek their fortunes elsewhere, but others have taken their places and are progressing. The large amount of business agent in building is a strong evidence that our people have not lost heart or confidence in the future. Our prospects are brighter than today they have been for years past, and we believe that the next year will see this District joined to the commercial world by a railway. The year 1888 marks an important era in the political history of the Northwest. We have advanced another step in the direction of full responsible local government. We this year elected a popular Assembly to manage our local affairs, and the first session—just ended—has been a success, doing credit service for the country. The Northwest Territories has this year, owing to the exertions of the Province of Manitoba, also received another boon in the repeal of the R. R. Act. This latter question did not affect us directly, but the time would have came when it might. Great events have transpired in other portions of the world during this year, but we have not had to witness any event. As aforesaid Canada, one of the most important was the negotiation of the Fisheries Treaty with the neighbor-\n\ning Republic, but which was subsequently rejected by the latter. Our Dominion has prospered throughout its length and breadth, and peace and happiness has reigned within our borders.\n\nThe present prevalence of fever in town, which has already proved fatal in some cases, brings forcibly before the necessity for a public hospital. We believe there is nothing such an institution in town, and at least one life would have been saved. In this place there are large numbers of young men who have no friends and in the event of sickness they have no one to care for them, and indifferent charity of those who have no interest in them. Some kind of provision should be made for such cases, and we consider that the Town Council is justified in taking steps to take action in the matter. We may be permitted to ask what has been the funds raised for the volunteers' memorial? We understand that memorial was to take the shape of an hospital, and that it was to have been built before now.\n\nThe Dominion Customs authorities should do something to remove the very great inconveniences that exist to people in places like this in regard to dutiable matter coming in by express or through the mails. We believe that we ought to have import bonds paid partly from the United States and other foreign countries, both because prices are lower than in Canada and often because the desired article cannot be obtained in a well-grown old country. It is evident that it is not right on such soils and the duties should be paid, but the present system of collecting the duty at a mopping-up or Q.C. Appellate court meeting is not satisfactory. After all, the duty is paid by the importer, involving as it does, a delay of at least three weeks. We do not claim that places like this should be made regular Ports of Entry, but we think that the goods should come through the mails, an arrangement might be arrived at between the Customs and Post Office departments whereby the local postmasters could collect the duties on the goods. Such a step would be a great convenience to people on the Saskatchewan, and need not entail any expense on the country, while it would meet with the hearty approval of all who are interested in the welfare of the town and the carrying out of the Dominion Parliament should urge this matter on the attention of the government.\n\nBIRTH—At Prince Albert, on the 5th inst., the son of Mr. & Mrs. J. Prichard, of a son.\n\nDEATH—At Prince Albert, on the 8th inst., the wife of Mr. Wm. Fletcher, M.D., of a daughter.\n\nFOR THE BEST ASSORTED STOCK OF CONFECTIONERY GO TO H. M'Dougall's BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACGUGAL\n\nR. C. WIGMORE & CO.\nMen's and Boys' Underclothing\nMen's Cardigan Jackets\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\n\nR. C. WIGMORE & CO.\nBuffalo Hall!\nFor Dry Goods, Clothing,\nGent's Furnishings and Groceries\nWe are showing the Largest and Cheapest Stock in town.\nDrives in Dress Goods\nDrives in Hats and Gloves\nDrives in Shirts and Drawers\nDrives in Shawls and Jerseys\nJackets\nWe can supply any one in want of Dry Goods, Furs, Carpets, Clothing and Gent's Furnishings, Groceries, etc., that the Stock is unequalled for Quality and Price. Call and Inspect Our Stock.\n\nBETTS & Gwynne\nT. N. Campbell\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK\nALL SIZES—WRITING AND COPPING\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed uitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nCOMMUNICATIONS.\n\nTHANKS FROM THE BOYS.\n\nTo the Editor of the Times:\n\nOn behalf of the boys of the public school, I desire to thank Mr. Sheriff Hughes for his kindness in presenting us with a very fine football which we will do our best to keep in the wind this year. We wish Mr. Hughes a happy and pleasant New Year.\n\nSigned,\n\nJACK MACKAY\nALEX. J. CAMERON\nDOUGLAS MACKAY\n\nN.W.M.P. XMAS DINNER.\n\nChristmas at the N.W.M.P. barracks was one which will be long remembered by the members of the force. The boys of F Division and the citizens of Prince Albert, both the sergeants and men, performed their part in making the evening what it was such men had invited a number of friends to join them at their Christmas dinner.\n\nThe boys and their civilian friends sat down to dinner at 6 o'clock p.m., and a more sumptuous repast never before given to the boys was prepared. It was given in such an artistic and magnificent manner that only a solder knows. The menu was a most attractive one, and was only equalled by the continued attention of the heads to the entertainment of their guests. Serge-Major Duffield, the present chief of police, and his wife were seated civilians at a sergeant's table. Staff Sergeant Redden, one of the first sergeants posted in Prince Albert, ably filled the vice-chairman.\n\nAfter the wants of the inner man had been fairly satisfied the dinner was removed and one of the most enjoyable pleasant evenings ever spent in Prince Albert was passed in specifying and singing songs. Sergeant Redden, Sergeant Serges, Redden, Gordon and Alexander made able speeches and dealt on the relations existing between the police and the people of the town. Staff Sergeant Redden gave away reminiscences of the old days in Prince Albert which were very amusing. Several songs were sung by Mr. Ryer and others during the evening and the party broke up late and thoroughly enjoyed themselves.\n\nThe CONSTANTINE DINNER.\n\nIn the constantine messroom about 7 o'clock p.m., the dinner was consumed in a hearty and good cheer. A second chairman interpreted among the red coats and a number of civilians. The dinner was substantial part of the mess had been done justice to and the cooks received a very pleasant surprise when they saw how the constables treated their fellows, and that was the presentation of an address and prize of $10 to Sergeant Taylor, who, when asked why he was leaving the force, Sergeant Taylor, in reply, heartily thanked the boys for the honor they had conferred upon him and he would keep the address saved as a remembrance of the good time he had spent with them. After dinner there were the order of the evening and its messages to say that every one enjoyed his Christmas dinner and that they looked far to show the amicable relations between the police and civilians of our town.\n\nDUCK LAKE.\n\nSurveyor Stewart of the P. R. R. arrived at Saskatoon last week and left here for Cremona on Christmas day. They made four round trips from Cremona to the south branch and a man will remain all winter to watch the rise of water in the agency. The lake is now very much packed with the country, and there will be no engineering difficulties in building the railway.\n\nMr. A. McNeil arrived from the east on Wednesday evening. He goes north at once with Col. Evans.\n\nMr. H. E. Corbin returned in 1000 pounds of white fish from the north; he reports weather fine and fish never so plentiful.\n\nThere being no snow at all, Christmas passed off very quietly here; services were held in the Catholic churches which were very attended.\n\nAmong those regarded at the Duck Lake House this week were D. B. Smith and Miss Anna Pringle, Miss J. Dana, Miss Clara's Crossing, J. Fiddler of Fish Creek and Moses Pook, a Peterman T. Laver, and G. Carter and wife from Callander.\n\nWeather fine; two inches snow.\n\nHORSE SHOE STORE.\n\nStatistics state that there are nearly one-third more women than men in the city of Prince Albert, and the ratio is likely to remain so for a few years. To keep pace with these facts and the desire to have the best wares, and better still, the new approach of Xmas I have decided to sell my stock of\n\nBoys' Overcoats at Cost.\n\nGive me a call and convince yourselves that we have the Only First-class Stock in All Lines in the Saskatchewan, so please remember that if you fail to find your requirements elsewhere, come to the Horse Shoe.\n\nTHOS. O. DAVIS.\n\nRUSSELL & DAVIS\n\nTHE WEEKLY EMPIRE\n\nCanada's Leading Paper.\n\nThree Months Free\n\nThree Months Free\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.\n\nGO TO AGNEW'S FOR Stoves Stoves Stoves Heating Drums Stovepipe Coal Oil\n\nT.J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888122801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 2808, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6944, 2], [6944, 6944, 3], [6944, 11568, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]