[{"id": "b95cbb8fbce520dbc29910b7a1813e0c8f2f08ba", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JUNE 4, 1866.\n\n$2.50 A YEAR.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nBeautiful Weather.\nCloud still rising.\nBusiness steadily improving.\nDavid Pollock has opened a leading house in town. See advertisement.\nThe town is very strong for some days to come. Indians.\nJ. D. Hibberts, one of Beulah's scouts received his scalp by last mail.\nMrs. Ross McKay left here on a visit to her daughter Mrs. Kelly.\n\nThe school building is now a fact just announced. We wish its pupils success.\n\nThe Prince Albert volunteers who took part in the Black Lake fight are in fine shape.\n\nThe first loads of the season from Fort Qu'Appelle are expected about the 15th inst.\n\nWork commenced on the Courthouse on Monday morning last. About thirty men will be employed in raising the building and the court-house construction.\n\nA large number of the settlers were out town during the sitting of the court, most were away from Saska but a few came back for a short time.\n\nThe typhus for the prevention of any more cases running, a large bed better be passed, and put in force immediately.\n\nThe large crops appear to be promising.\n\nMr. Gurney has received the finest and largest specimens of Cheyenne ever brought into this town. It is worth while to see them, as they are sets of china.\n\nThe detachment of Police which recently went out to Waskesiu came back on Monday morning last. They were all well and healthy when they returned and left the place to return, arrived back on Monday morning last.\n\nNews arrived of the N.W.M.P. under command of Mr. Macdonald, had been in residence in connection with orders from headquarters. They will remain at their post until further orders.\n\nWaskesiu, town of Saskatchewain, is in town. Hospitality times as usual in Saskatchewain this summer. People are back well.\n\nMr. McCord is building a blacksmith shop on Church Street near Main Street. He expects to have it finished and commence operations by the middle of next week.\n\nThe crops are looking well, but we may expect a heavy fall as the weather is generally considered a rainy month, we may expect some of the refreshing rain.\n\nThe fish farming is booming as we notice another of our citizens going into it. An application for information has been made by Mr. Macdonald, Fish, Saskatchewan Salmon or Fry, can it be shipped by the West End.\n\nA large arrival of goods inside India was received last week. The goods being placed by some parties coming to Prince Albert. We do not know who they are, but we believe they are for Prince Albert in fact.\n\nTwo policemen failed to turn up at the call on Wednesday morning last. It is supposed that they are ill. One of them is reported to be ill and Judge Richard is said to have disappeared the same night. The application for the same has been denied by the judge saying \"not enough evidence.\"\n\nJudge Pollock, for what must be considered good and sufficient reasons, declined to lend any credit to the wanton destruction of property. The case will be referred to be held on the third March half. This is also, according to the law, nothing more than the right that people should be put to the inconvenience and expense of having here a hearing. We shall then be able to see what is done and not unduly so.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVERTY\nPRINCE ALBERT, N.W.T.\n\nTERMS.—5¢ per number, or 25¢ per year.\nSingle copies, 1¢ each; 5¢ per year.\nNo advertisements inserted for less than 10¢.\nAdvertisements without instructions will be inserted until paid for.\n\nTHIS PAPER IS NOT TO BE SOLD IN NEW YORK\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—His Lordship, the Bishop.\n1 p.m.—Sunday School.\nThe St. Andrew Chapel.\n11 a.m.—Rev. A. B. Wright.\n1 p.m.—Sunday School.\nSt. John's.\n11 a.m.—His Lordship, the Bishop.\nSt. Paul's.\n11 a.m.—Rev. A. B. Wright.\nSt. Andrew's.\n8 a.m.—Rev. J. Matheson.\nSt. John's.\n1 p.m.—Rev. J. Matheson.\nSt. Paul's.\n6 p.m.—Rev. Archdeacon McKeon, R.C.\nSt. Anne's, R. C. Catholic.\n6 p.m.—Rev. Mr. McWilliams.\nSt. Paul's, Presbyterian.\n1 a.m. and 3 p.m.—Rev. Mr. McWilliams.\n\nFRIDAY, JUNE 4, 1886.\n\nDirect traffic between Canada and Japan will commence on the next mail; when the first ship will leave Yokohama for Victoria. Her cargo will consist principally of tea. Freight is being taken at a very low rate. This will tend to revolutionize trade, and the price of tea may be expected to fall.\n\nThe Hon. Mr. Longley, in the course of a speech in the Nova Scotia Legislature in support of repeal of the union with Canada is reported to have said \"that a man would make a fortune by exhibiting a Nova Scotian in the centre of a circus. It is a pointer for some enterprising showman. Why not engage Mr. Longley to exhibit himself?\" Besides an exhibition of the nasal productions of Nova Scotia might induce the ugly people of the province to favor the granting to the illustrious of better terms.\n\nFrye, the leading blatherite of the American Senate, admits that the schooner Adams not only visited the treaty of 1848, but violated the laws of her own country by leaving her port of registry without a \"touch and trade\" permit which those laws require her to obtain from the collector of the port before sailing for Canadian waters. Why raise the question of the validity of the treaty then? Or does Mr. Frye imagine that because American citizens may break the laws of their own country with impunity, that they should be allowed to violate treaty obligations without punishment?\n\nJust where the Government intended to locate the N.W.T. Police barracks is a matter which greatly concerns the people of this town. The presence of a large detachment of police here is not only a protection, but is a benefit from a commercial point of view. But linked with this question is the other and more important question, as to whether we have a railway station here, because it is evident that if we are to have no station we will have no permanent police barracks. The most logical place to locate the barracks this evening was perhaps a little late, but it may be productive of good results. Of course it is not necessary to have the barracks erected in the town, or very close to it. A mile or two away would be just as well, if not better than if they were situated within the corporation. But it seems to us that unless we receive some definite assurance that we are to have a railway station here, the question of the police barracks here. Upon the latter depends the location of the former.\n\nThe report of the census commissioners gives the total number of acres occupied in the Prince Albert and Carrot River (Carrot) River districts as 385,052 acres cultivated, 15,263 acres of horses and mules, 1,929 acres of sheep, 1,758 acres of cattle, 2,690 acres of swine, 1,290 acres of butter made for year previous to 24th August, 1884, 5,298 acres of land, 3,550 acres of land cultivated in the same year, 1,976 acres of oats, 276 acres of potatoes, 296 acres of hay, 662 acres of grain, 1,436 acres of land in cultivation. Total capital invested in industrial establishments in the agricultural district of Carrot River is $1,412,397, wages paid, $21,237, value of raw materials, $48,200, value of articles produced, $17,500.\n\nTotal population of Saskatchewan, 16,246; population of Prince Albert and Carrot River including part of the old Cumberland district, 7,443.\n\nTEN YEARS OF THE N.P.\n\nThe following statement is indicative of the attitude of the Liberal party toward the National Policy. The Liberals deprecated protection of any kind, and regarded all restrictions on the part of the Government with the industrial operations of the country as pernicious. They assumed that self-interest would always lead men to employ their capital in the most profitable field, and that the state were to interfere, by the adoption of a protective tariff, to encourage the application of enterprise to any particular branch of industry. The general public for the purpose of enriching the few. We do not, of course, believe in enumerating every operation of life with a network of regulations, but in the practical working out of the principles and doctrines as actually practised by the Liberal party should never govern the conduct of those who are appointed to rule over the destinies of Canada. The National Policy is a system of managing public affairs, will, in the absence of all disturbing causes, most conducive to the accumulation of national wealth. The Liberals though they say that the question is a one-sided free trade, and though year after year producing, hence the purchasing power of the people was decreasing, still they persisted in urging their wild theories until an intelligent people swept them from power, and the National Policy came into force.\n\nWe have now had ten years of the National Policy, and what has been the result of its adoption? We venture to say that the benefits of its adoption exceeded the expectations of its most sanguine supporters. We have shown—or, at least, it was very apparent during the five years the Liberals were in power—that Canada was going forward. We will now show the result of the National Policy at least so far as the business done by our railways for the past ten years will serve to prove.\n\nIn 1876 the railways carried 216,640 barrels of flour, 8,829,072 bushels of wheat, 91,286 head of live stock, 112,249,659 feet of lumber, 66,972 tons of firewood, 2,453,367 tons of manufactured goods, 4,074,774 tons of all other articles. Reducing all to tons, the freight carried by our railways in 1876 amounted to 8,358,757 tons, the bill for freight being $1,322,298. The total amount of freight carried was equivalent to an average rate of $162 per ton.\n\nIn 1885 the railways carried 11,806,674 barrels of flour, 8,991,714 bushels of wheat, 114,909,738 feet of lumber, 6,497,499 cords of firewood, 2,494,660 tons of manufactured goods, and 6,418,179 tons of all other articles. Reducing all to tons, the freight carried by our railways in 1885 amounted to 13,961,383 tons, the bill for freight being $2,109,962.38, which is equal to $152.88 per ton. There has therefore been an increase in the flour carried of 15.50 per cent.; grain, 8.6 per cent.; live stock, 25.2 per cent.; firewood, 44.08 per cent.; manufactured goods, 35 per cent.; and all other articles 5.7 per cent.; while the reduction in the cost of transportation is $6.38 per ton. It is also worth noting that according to the freight carried in 1885, the freight bill would be $2,817,725, or $829,996.02 more than it actually is. This shows the National Policy outlived its critics, having accomplished what it set out to do, but the cost of transportation has decreased. Not only that, but labor is better paid now than ten years ago. The price of wheat may have fallen, but the price of other articles of trade probably has not. The reduction in the price of wheat is more than made up by the diminished cost of articles which the farmer must buy. Of course, to the development of our railway system and the consequent expansion of trade and freighting, is, in a great measure, the marvel which the country has made during the past ten years. It has enabled the manufacturer to reach his market, and has reduced our manufacturing costs, not only within the limits of practical statesmanship to develop the trade, commerce and industry of Canada, but that it is the boundary line of the policy of the Liberal party, to encourage the growth of the industries of the country, even at the sacrifice of their own pet theories.\n\nThe British salmon Sisters, from Vancouver, N.W.T., with a cargo of 20,000 pounds of salmon, left Portland, Oregon, May 24th. The salmon was valued at $10,000. The Sisters had been loaded at Portland, but had been delayed in paying the fine due vessel and cargo were seized.\nPUBLIC MEETING.\n\nIn accordance with notices issued by Mr. Macdonald on Monday morning, a public meeting was held at the Town Hall in Prince Albert, assembled by the Public School House (Missouri) to decide whether or not they should join the movement for the proposed new police barracks about to be built by the Government.\n\nMr. Beatty, Acting Mayor, called the meeting to order, and explained that the Council had decided at its last meeting that the time had come when something must be done to improve the welfare of Prince Albert. He stated that the citizens of Prince Albert were anxious to see the town grow and prosper, and he called upon them to take action now.\n\nMr. Macdonald then moved that a committee be appointed to investigate the possibility of obtaining a grant from the Government for the construction of a new police barracks. The motion was seconded by Mr. Sprat, and carried unanimously.\n\nMr. Beatty then moved that the meeting adjourn until next Tuesday, when a final decision will be made.\n\nTO THE LADIES.\n\nNEW GOODS\n\nAT\n\nMISS MACK & CO\n\nFirst Door East Telegraph Office.\n\nCALEDONIA BREWERY\n\nEAST END.\n\nThe proprietors of the above concern is respectfully informed that persons who wish to purchase beer in bottles may do so.\n\nPint Bottles, 15 cents per dozen.\n\nQuart Bottles, 30 cents per dozen.\n\nLIVERY & FE D STABLE\n\nCHAS. WOODMAN\n\nPROPRIETOR\n\nCHAS. WOODMAN\n\nPROPRIETOR\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 75 feet extra\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nBUFFALO HALL!\n\nOUR SUMMER STOCK IS NOW COMPLETE.\n\nLadies should examine our stock of\n\nFancy Dress Goods,\nPrints, Cottons, etc.\nClothing and Furnishings.\n\nFamilies should be entirely supplied from the finest stock of\n\nStaple & Fancy Groceries\n\nEverb Opened Here.\n\nA LARGE STOCK OF THE LATEST STYLES\n\nFURNITURE!\n\nClose at hand and expected to arrive here in a few days.\n\nPRICES\n\n15 per cent below all prices quoted by dealers here.\n\nFurther notice will be given on what day this sale opens.\n\nSale Rooms will be in central part of town.\n\nW.J. JOHNSON & Co.\nIron, Ware,\nTinware,\nFlatware,\nGroceries.\n\nC.G. NEWHALL\n\nFarmers - Call and see our\nChurns!\nJ.S. SIMSON & Co. 1866\n\nSPRING SEASON\n\nWM. STOBART & CO.\n\nHaving received a full assortment of STAPLE and FANCY\n\nDry Goods,\nGroceries, etc.\n\nNew Goods!\nJust Arrived.\n\nGreater Selections.\n\nCENTS' FURISHIKES\n\nWe beg to call the attention of our customers and the public to our fine\n\nlady's new stock, now mostly completed.\n\nBusiness is very good under new management, the public will receive the best attention, and we will endeavour to keep on hand the requirements of our customers.\n\nYour importation is solicited.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886060401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3890, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3307, 1], [3307, 11863, 2], [11863, 13869, 3], [13869, 15048, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]