[{"id": "a3bee5932414948cee8e03c7e8441b2d1db99c73", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nTHE NEW BRITISH PARLIAMENT WILL ASSEMBLE ON THE 22ND OF JANUARY.\nIT WILL BE OPENED BY THE LORD CHANCELLOR, FOLLOWED BY THE LORD PRESIDENT OF THE COUNCIL, AND THE RIGHT HONOURABLE THE LORD SECRETARY OF STATE FOR DOMINIONS.\n\nA. H. CUMMING, Secretary of the Prince Albert Agricultural Society, received the following telegram from the Hon. T. E. White: \"Order in Council granting seed grain to be distributed at the fair held today. Arrangements to supply the grain will be made at once.\"\n\nThe Dominion Government is treating handsomely those who have upheld the honour of Canada by their skill in the Old Country. Colonel Goodwin, for being captain of the Winnipeg Rifle Corps; Sergeant W. M. Goodwin and Private Mitchell of the Thirteenth Battalion, for being members of the Canadian team which won the Kolaro cup; have received handsome gold medals from the Dominion Government.\n\nANNUAL MEETING\n\nThe first annual meeting of the trustees of the Prince Albert Public Protestant School District No. 4 was held in the school house on Thursday evening, the 7th inst., Mr. James Macarthur, chairman of the Board, was in the chair. The meeting was called to order at eight o'clock. On motion of Mr. Sinclair, seconded by A. H. Clark, H.W. Newlands was made secretary. The following reports were then read out to the meeting by the secretaries:\n\nTreasurer's Report\n\nTo the Trustees of Prince Albert Protestant Public School District No. 4:\nGentlemen, — In accordance with the School Ordinance for the North West Territories, we respectfully submit the following report of your school for the year ending Jan. 31, 1886:\n\n1. That the school was kept open 59 days.\n\n2. That the total number of children attending school was 55, of whom 33 were boys and 20 were girls.\n\n3. That the youngest in attendance was 5 years and the oldest 16 years, and the average age of such pupils was 8 years.\n\n4. That of the 55 children attending school 52 were of the Protestant faith and 3 were of the Roman Catholic faith.\n\n5. That the average daily attendance was 45.\n\n6. That the branches of education taught were reading, writing, arithmetic, grammar, spelling, and history, of which 5 pupils taught reading, 26 writing, 53 arithmetic, 23 spelling, 11 grammar, 11 history.\n\n7. That there were no dismissals for misbehaviour or other cause except for sickness.\n\n8. In conclusion, I would say that the school has been attended by more than usual during the last quarter, it will be necessary to get an assistant teacher as soon as possible, as the present teacher will not be able to keep up his work satisfactorily until the school is closed.\n\nTRUSTEES REPORT\n\nTo the Ratepayers of the Prince Albert Protestant Public School District, No. 4:\n\nWe, the Trustees of this School District, do hereby submit our report. Our district was organized in January last, under the provisions of the School Act of February last, and we are pleased to announce that the school has been opened for the season of August. We have incurred considerable expense in making the necessary arrangements, and we trust that the ratepayers will appreciate the importance of the school and the value of the education which it affords.\n\nWe also wish to express our thanks to Mr. J. E. Smith, our principal, for his efficient services, and to Mr. A. E. Forget, our assistant teacher, for his hard work and devotion to duty.\n\nWe are confident that the school will prove a valuable institution to the community, and we urge all parents to send their children to school regularly.\n\nWe respectfully request that all ratepayers will contribute their share of the school taxes promptly and willingly.\n\nSigned,\n\nA. H. CLARK,\nChairman.\n\nH. W. NEWLANDS,\nSecretary.\n\nPROCLAMATION\n\nVICTORIA, capital city of the Kingdom of Great Britain and Ireland, QUEEN, Defender of the Faith, &c., &c.\n\nD. EDWARDS.\n\nLieutenant-Governor.\n\nWHEREAS an ordinance has been passed by the Legislative Assembly of the North West Territories, entitled \"An Act respecting Bills,\" it is ordered that the Lieutenant-Governor may designate any portion of the North West Territories where, and on and from each time or times hereinafter mentioned, such ordinance shall come into force and take effect.\n\nAnd whereas application has been made to me to issue the said ordinance for the purpose of the administration of the said North West Territories:\n\nNow know ye, that under and by virtue of the powers imposed upon and conferred by the said ordinance, I hereby proclaim and declare that the said ordinance, No. 16 of 1886, shall come into force and take effect throughout the entire of the following portion of the North West Territories, namely:\n\nWest of the Second Principal Meridian:\n\nTownships numbered 45, 47, 48 and 49 in Ranges 23, 24, 25, 26 and 27 of the First Principal Meridian.\n\nTownships numbered 40, 41, 42, 43 and 44.\n\nOf which all persons whom these provisions may affect are requested to make known their intentions accordingly.\n\nGiven under my hand and the Seal of the Lieutenant-Governor, this twenty-sixth day of November, in the year of our Lord one thousand eight hundred and eighty-six.\n\nBy Command,\n\nA. E. FORGET,\nClerk of the Council.\n\nSTEWART BROS.,\nTRADERS,\nGENERAL MERCHANTS\n\nHave just received a large stock of\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\n\nTobaccos,\n\nCoffee,\n\nOatmeal,\n\nSugar,\n\nCanned Goods,\n\nCal. Pears,\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nLAST NOTICE\n\nAfter the 31st December all the old firm accounts will be handed over for collection.\n\nSTEWART BROS.\nCALGARY.\n\nFrom the Herald.\n\nThe council of the Board of Trade held its regular meeting Monday night. The object of the meeting was to make arrangements for collecting all necessary provisions for the winter, in order to form a train to Ottawa. Mr. Major Walker will accompany them there. Mr. Millis will accompany the return.\n\nThe funeral of the late Sergeant-Major Brown, of the Alberta Mounted Rifles, was held at the church on Sunday afternoon, at the Grand Central hotel.\n\nThe auction sale of horses, etc., under the management of Mr. Farnell, will commence at 10 o’clock this morning at the Grand Central hotel.\n\nThe sale of Canada beef will be held at the same place this evening.\n\nThe Nor West Farmer\n\nWANTS\n\nMANITOBA AND THE NORTH WEST\n\nWe have received the following notice:\n\nSome months ago a series of charges of official irregularity were laid against Mr. Thompson, Auditor of the Provincial Land Office. We believe that there is a venture in which the success is in the nature of things insured.\n\nQUAPPILLE.\n\nFrom the Globe.\n\nAll the heads got up to dinner last Christmas day.\n\nThe Globe is now undertaking to be in the field for election of councillors for this municipality—Messrs. A. M. Smith, T. T. Thomson, J. H. John, Mr. Murray, Mr. Murray, Mr. Murray, Mr. Murray, Mr. Murray, Mr. Murray, Mr. Murray, Mr. Murray.\n\nA tea and concert was given by the ladies and friends of the Presbyterian Church, on the evening of Tuesday, Dec. 26th. The concert was arranged from 7 p.m. to 8 p.m. in the Hudson’s Bay store, immediately after which all returned to the Presbyterian Church for refreshments and to listen to the organist. The programme consisted of music, speeches, readings, etc.\n\nLETHBRIDGE.\n\nFrom the Herald.\n\nThe Police have things ready for the boys to see a few highlights, but so far our records are blank.\n\nMr. McLean has arrived here last night from Calgary for the wedding of Miss Mary Macdonald at the Union Bank on Thursday last. He purchased a new outfit largely needed by his proprietors of the Star Restaurant, and also bought several sheep for Mrs. Macdonald in the old home village near a bowling alley.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nMr. Henderson of British has been in town. He leaves for Prince Albert next week.\n\nThe following ladies will be married at St. Paul’s Church on Saturday afternoon: Miss Anna E. L. Foster, to Mr. William Macdonald; Miss Anna E. L. Foster, to Mr. William Macdonald; Miss Anna E. L. Foster, to Mr. William Macdonald; Miss Anna E. L. Foster, to Mr. William Macdonald.\n\nFather Macdonald has been appointed Bishop of the Diocese of Calgary.\n\nRobert Thomson,\n\nSign & Ornamental Painter\n\nLincoln College.\n\nCOLLEGE.\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nDry Lumber.\n\nWishes to inform the Public that they have on hand and for sale a half million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nHelp Along the Good Work\n\nBy subscription at once.\n\nONLY $1 A YEAR.\n\nWe are prepared to contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions, done quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\nTOWN COUNCIL.\n\nThe Council met on Monday at 7 p.m., present—Coms. Brown, Beattie and Macdonald.\n\nChairman in the chair.\n\nThe minutes of last meeting were read and adopted.\n\nMoved by Com. Beattie, seconded by Com. Brown, that the Council authorise the Town Clerk and council secretaries to attend Council meetings.\n\nCarried.\n\nCom. Beattie gave notice that at the next meeting he would move to introduce a by-law for public health.\n\nThe by-law to regulate the proceedings of the Council and the committees was read a third time and passed.\n\nMoved by Com. Beattie, seconded by Com. Macdonald, that the Acting Mayor be authorised to get bonds or insurance for Council rooms. Carried.\n\nCouncil then adjourned.\n\nThe Council met in Council Chamber at 7 p.m., present—Coms. Beattie, Brown, Beattie and Macdonald.\n\nCom. Brown in the chair.\n\nCom. Beattie gave notice that at the next meeting of the Council he would propose an order for the piling of cordwood on the streets.\n\nCom. Goodfellow gave notice that he would introduce a by-law for making it unlawful to deface fences.\n\nMoved by Com. Beattie, seconded by Com. Macdonald, that the Finance and Works Committee recommend that at the next meeting of this Council the names of fit and proper persons for nomination in this connection now on the table be handed over to said committee.\n\nThe by-law for Public Health was read first and second time.\n\nThe Council adjourned to meet on Monday, 11th inst., at 7 p.m.\n\nCOMMUNICATIONS.\n\nTHE SKATING RINK CO.\n\nTo the Editor of The Times,\n\nSir,—Would the intelligent body of Directors of the Prince Albert Skating Rink Co. consider the propriety of the shareholders, and give an account of what has been done in the past year, and what they expect to do during the ensuing year, or are they like members of the Senate, elected for life? No doubt there are some who would like to know what is being done with it.\n\nA SHAREHOLDER.\n\nAt a regular meeting of Manitou Lodge, A.F. & A.M., G. R. No. 16, held on St. Patrick's Day, the following officers were elected: W. M., Mr. J. McLean; V. P., Mr. J. F. Smith; Sec., Mr. J. O'Brien; Treas., Mr. A. W. Murray; W. M., Mr. W. E. Baker; V. P., Mr. W. H. Ross; Sec., Mr. A. H. Taylor; Treas., Mr. Harry B. Smith; A.C. Davison; J.D.W. J. Carter; Chap., Mr. W. Hard; S.N.J. Mr. Todhunter; J.S. Mr. J. L. Johnson.\n\nMANITOBA.\n\nPOETIGE LA PRAIRIE.\n\nFrom the Tribune-Editor.\n\nThe M. N. & W. are now prepared to enter into wood contracts.\n\nA skid road will be laid between Prince Albert and the Government camp, which will be completed in about two weeks.\n\nThe Wabamun branch, the prairie line, will be completed in about four weeks.\n\nThe length and passenger burdens of the M. N. & W. are very heavy, and it is thought an additional main line will prove a great convenience to the settlers.\n\nThe Portage Milling Co. are still working with orders. The new machinery installed has greatly increased the capacity and improved the grade of the flour, which, by the way, is being sold successfully at the eastern markets.\n\nThe Manitoba News of Red River Lodge gave an excellent report of the Grand Banquet Room at Monday evening, December 28th.\n\nThe evening W. M., W. Ross, J. F. Kennedy, was presided over by a past master.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAVE ONE OF THE FINEST STOCKS OF\n\nDomestic and Imported Cigars\n\nWagner's\n\nALL CHOICE GOOD AND SEASONED.\n\nBEITTS & Gwynne\n\nExamine Our Stock of Xmas Confectionery and Biscuits.\n\nBUY YOUR\n\nHardware,\n\nStoves,\n\nTinware,\n\nCoal Oil,\n\nGroceries,\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert—N.W.T.\n\nWAR DECLARED!\n\nEAST END BAKERY\n\nW. C. Ramsay\n\nBREAD unsupervised by any west of Winnipeg.\n\nHugh McDougall,\n\nEast End Bakery.\n\nAlex. Lang\n\nGENERAL BLACKSMITH.\n\nHe opened a shop in the east end directly opposite the old East End grain mill.\n\nHorseracing, harness racing, thoroughbred racing promptly and cheaply.\n\nAll kinds of farm machinery repaired and put to work.\n\nA. Goodfellow,\n\nPrince Albert, N.W.T.\n\nAlex. Lang", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886010801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3466, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5611, 2], [5611, 9217, 3], [9217, 13436, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]