[{"id": "bf4e4b4febcba73cc37042fb25d5b576d20b6c0d", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nBUTTERFLIES—Butterflies in advance.\n\nIn case will be inserted in this paper.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\n11 a.m.—The Rev. Mr. Principal.\n7 p.m.—Mr. Wright.\n\nThe Mission Chapel.\n11 a.m.—Rev. Mr. McLeod.\n12 noon.—Rev. Mr. Macdonald.\n\nSt. Peter's.\n11 a.m.—Rev. Mr. Macdonald.\n\nSt. Andrew's.\n10 a.m.—Rev. Mr. Macdonald.\n\nSt. John's.\n3 p.m.—Rev. Mr. Wright.\n\nCarrot River Church.\n11 a.m.—Rev. Mr. Macdonald.\n\nSt. Anne's, Catholic.\n10 a.m.—Rev. Mr. Macdonald.\n\nSt. Paul's (Presbyterian).\n11 a.m.—Rev. Mr. Macdonald.\n\nCatholic Church, Guelph.\n3 p.m.—Rev. Mr. Macdonald.\n\nC. M. Church, Red Deer Hill.\n10 a.m.—Rev. Mr. Macdonald.\n\nC. Methodist Church, Mission.\n3 p.m.—Rev. Mr. Macdonald.\n\nFRIDAY, JANUARY 9, 1885.\n\nSETTLEMENTS RIGHTS.\n\nThe Regina Leader contains a lengthy report of a large meeting held at Moose Jaw to discuss Requirements. The editor remarks, \"Everything was discussed in a perfectly unimportant manner.\"\n\nThere was a total absence of any attempt at demagoguery or political agitation among all who attended, according to their views, and supporting them in such a manner as deserves the most respectful and weighty consideration which any government is bound to give to the wishes and aspirations of the loyal people of the district.\"\n\nThe resolutions arrived at were briefly to the following effect—\"The principle of allowing individuals or companies to acquire large tracts of land without prejudice to the rights of any others on the part of colonization companies already organized to faithfully fulfill conditions should be adhered to, and conditions should be altered to provide for the advancement of the settlers' interests by the awarding of more free grants of land to assist construction of branch lines running east and west, be extended judiciously to encourage lines running north and south, and the extension of the navigation of the Hudson's Bay and Strata having been amply proved, the construction of a railway to some point on the shores of the Hudson's Bay in connection with the same.\"\n\nThis course, the editor said, was necessary of giving representation in the Senate and Parliament of Canada to the people of the N.W. Territories; that there should be given to Saskatchewan and Alberta that one Local Government for the whole of the N.W. Territories will best suit the requirements of the people; that Timber Regulations should be amended to exempt dead wood from taxation; that the government should provide the sale of claims of Hallsteads, as well done in the Province of Manitoba, and thus determine a question calculated to disturb the peaceful development of the country.\n\nWe have heard in all cases that the result of the discussion was that each having been repeatedly advocated in our columns. We may say the same thing about the general spirit and tone of the proceedings.\n\nThe cold weather has worked its usual malice in the statement of the crops in the province. However, as long as strictly municipal arrangements are made for the necessary protection against the ravages of the cold, the crops will be saved.\n\nEDITORIAL COMMENTS.\n\nWith regard to the difficulties in wheat growing by the natives of this district, it is interesting to note that Mr. Bennett, Director of Agriculture in that Empire, estimates the cost of producing 45 ½ cents per bushel.\n\nIn this calculation he takes the proportion of straw to bring the grown crop to 7 rupes, and the larger the amount cultivated the smaller the price for which wheat will be sold. If the grain is excellent, we may expect 45 cents per bushel, and say 45 cents per bushel.\n\nNow if we in the North West enjoy the reduced cost of all that we have to import, and now pay so much less for wheat which can be raised by the Hudson's Bay Company, we could produce wheat for a smaller sum than this, and would be able to put it on a handsomely paying market with ease.\n\nAs far as scientific investigation is concerned, seems common that for forty years past little or no attention has been paid to the direction of the South Pole, while so much has been directed toward the North, seeing that there is no longer a question of practicable ocean routes to India from the latter. It seems that the second great Arctic explorer, Nordenfeldt, is about to undertake an expedition to the frozen coast.\n\nThe most successful attempt that has been hitherto accomplished by Capt. J. Ross, who pierced the ice barrier to nearly the 79th parallel. It is to be presumed that with experience, a section of the expedition will be chosen with regard to their own quarters, and they will be better prepared for future starting. We presume to imagine a new flavor, they will be total abstainers from alcohol and tobacco.\n\nThe New West has an editorial directed against agitators—a satiric method of \"giving up\" and attacking upon principles affecting the North West is fast becoming unpopular with the sober thinking people of the country.\n\nThe worst feature of these agitators is that they are endeavoring to create a panic among the honest settlers.\n\nThe New West is well aware of the humbugging motives and results of agitation meetings in the North West. Some of the demands made upon the Dominion Government, by means of meetings, if not dangerous, are at least premature. Our own opinion of what we have explained to be our idea of the difference between legitimate and illegitimate agitation is probably shared by many others.\n\nWe are glad to see that those views, on this subject which we have for long advocated are beginning to be widely more and more recognized as best for the real interests of the Territories by the whole of its press.\n\nAccording to private letters from officials in the East, we are on the verge of another Indian outbreak. Symptoms of this kind can not but fill the minds of men best acquainted with the situation there with the gravest fears, especially in view of the recent occurrences, which are the horrible massacre of women and children at Caxton, which so quickly followed upon signs misunderstood at the time. There are many reasons why such an outbreak is very possible.\n\nThe present state of the native population, of which the Government has a monopoly, would go far towards its prolongation. The prolonged resistance of the natives in the South, and the Metropolitan authorities, our failure to lend active aid to that population in Turkey against the Russians, or sympathy with regard to resisting Russian demands in Manchuria, and the definite declaration of the French, the intrigues of Russian agents in India, the unhindered and abused license given to the native Indian press, all tend toward one result.\n\nThe few thousand Indians who grow wheat, 20 acres to the tree will be in an awful position should an outbreak occur, and the very possibility of such a combination is a constant threat to the peace of the South Coast and any coast.\n\nThe attitude of respect shown to their rearing Government need not impair our confidence, as it is from the lower class of masses of the people that the danger threatens.\n\nHanging Prize—A prize of $100 will be awarded to the person, place, date per opinion, whose opinion, increased by calculation, very strongly, particularly in the case of the wheat, is creating in and about for rectum; the private parts are sometimes affected. It also affects the liver, and the patient may follow.\n\nSWAYNE'S OINTMENT—A pleasant and sure cure. Made at Prince Albert, Sask., Head, hyoscyamus, tartar, camphor, all salve, cream skin remover. Sold by SWAYNE & SON, Prince A., Smith Drugstore.\n\nJAMES SHILLANS\n\nMerchant Tailor,\n\nGENTS' FURNISHINGS.\n\nJOHN H. HADDOW,\n\nPRINCE ALBERT, SASK.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended to.\n\nJ. M. CAMPBELL\n\nGeneral Agent and Auctioneer.\n\nTHOS. POWERS,\n\nPRINCE ALBERT, SASK.\n\nCONTRACTS\n\nfor Brick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nPRINCE ALBERT\n\nPlumbing and Gas Factory.\n\nTHOMAS AND MACLAY LTD.\n\nPrince Albert, N.W.T.\n\nTERMS STRICTLY CASH.\n\nOUR FAMILY KNITTING MACHINES.\n\nRecognized throughout the world as the only machines that make Family Knitting Machines and Umbrellas.\n\nOUR RIDER IN PERFECTION.\n\nMakes the Pearl Rib Stitch and all other stitches, and is the only machine that makes the stitch in the center of the rib.\n\nHOSEYERY IN THE WORLD.\n\nWith the exception of the Royal Umbrella, which is made in England, every article manufactured by us is made in Canada.\n\nCREELMAN BROS.\n\nGEORGETOWN, ONT.\n\nThe Dominion Organ and Piano Co.\nNOTICE.\n\nJ. L. JOHNSON & CO.\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nBuffalo Hall!\n\nCertain business men have just KETCHED UP! To the fact that their wool cases we offer at\n\n$250.\n\nDry Goods, Fur Caps, Mitts and Mocassins.\n\nWe have the finest range of these goods in town, and they must be sold.\n\nFresh Goods, Butter, Cheese, Lard, Beef, Pork, White Fish\n\nJust received a large assortment of ROOM AND PICTURE MOULDDING.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE\nVictor Well Boring & Rock Drilling Machinery.\n\nWe are most pleased to prepare to illustrate the fact that THE WELL MERITED SUCCESS which has been so effectively obtained hitherto over the entire world by EXCLUSIVE operators of ALL in every country in the world under the MANCHURIA copyright, AND they range in sizes from\n\n3 Inch to 4 Foot in Diameter and will bore and drill ANY REQUIRED DEPTH. They will bore successfully any mineral or coal, or rock formation, or minerals or rocks, containing Titanium, Iron Ore, Coal, Slate, Hard Pan gravel, Lava, Boulders, Serpentines and other difficult rock, and guarantee to make the very best Wells in Quick Time. They are built to withstand the worst conditions and give the longest life. They have won the highest prizes at all Expositions throughout the world. They are ordered by some of the largest producers of iron, steel and timber.\n\nProspecting for Coal, Gold, Silver, Cassel Oil and all kinds of Minerals.\n\nAnd for sinking Artesian Wells and Coal Pits, &c., they are essential. We also furnish Ropes, Bolsters, Wind Mills, Hydraulic Rams, Horse Pawses, Brick Bks, etc., and can erect Furnaces for Forging, Blacksmithing and Machinery of all kinds.\n\nGood Agents wanted in every County in the world.\n\nAddress: VICTOR WELL AUGER & MACHINE CO.,\n\n211 Pine Street,\n\nST LOUIS, MISSOURI, U.S.A.\n\nNote what you pay you get, note what you get you pay!\nWedding Bells.\n\nOn Thursday evening last a very interesting event took place at the residence of Mr. J. F. Betts, the occasion being that of the marriage of our neighbor and friend Mr. E. T. Brown to Miss Janet Grainger, of the firm of Betts & Grainger, to Miss Jessie Casely, daughter of Mr. George Casely. Mr. Francis McIlwain, of Moose Jaw, was also assisted by Mr. W. E. Fish, while Miss Macdonald acted as bridesmaid, Miss Chalmers as assistant, and by her aunt, Mrs. T. Brown. After the ceremony—which was conducted by Rev. Mr. Black—the usual congratulations extended, the P. A. C. Band on music arrived, and an hearty round of cheering followed, and after playing several choice selections Mr. R. Way, on behalf of the band, invited Mr. Betts to present Mr. Thomas Parsons presenting the groom with a handsome and costly water pitcher.\n\nTo Richard Braden.\n\nDear Friend,—As this casual period of life, we cannot allow the opportunity to be missed of expressing our appreciation of your valuable services in connection with the P. A. C. Band, and we assure you that nothing would be more agreeable or in any sense complimentary than to see such an admirable part in the band. As our engagements may seem to require the necessity of watching you, wishing you all success and prosperity.\n\nOn behalf of the band,\n\nYours sincerely,\nH. L. St. Louis,\nR. B. Way,\nT. Parsons\n\nMr. Grainger, in a humorous manner replied that he had never been so frightened as he was when it was announced that he was to be presented as a brand new member of an organization which contained in their absence. The men then rose up and wished our bridegroom and his wife many years of happiness, congratulated them upon the occasion, asked them to refreshments, and enjoyed the company and conversation with the bridegroom and his wife for a considerable time.\n\nThe next day, Mr. Grainger received a letter from Mr. Betts inviting him to spend the Christmas holidays with him at his residence. He accepted the invitation and spent a most enjoyable time with Mr. Betts and his family.\n\nTHE CARNIVAL.\n\nThe first carnival of the season was held last Saturday evening on the R. A. Coulding and Skating Rink. The weather was fine, and the district felt much milder than the previous days, and a good attendance of spectators turned out to enjoy among other things, the ski jumping season. The ice was all that could be desired, owing to the exertions of one of the energetic citizens, who had prepared the ice beautifully and tastefully, and the skating was worthily assisted by the ladies in winter dresses. A great many races were to be had cheaply. Miss Katy Baltzlyana, whose great credit it is said was added, showed the character of \"Wood Lock,\" also Miss Hannah Baltzlyana, who represented the character of \"Nun,\" while the familiar characters moving about on the ice was a \"Blackshepherd,\" and arriving at midnight, the ice was well attended by Miss Jessie Casely, who also turned out the evening in good style.\n\nDRY LUMBER.\n\nWe have pleasure in announcing the opening of a new store of Dry Lumber, by the Kinloch Mutual Improvement Society. On Friday morning at ten o'clock the president, Mr. Johnson, gave a short and appropriate address. Immediately following the address a party consisting of the members of the society set out for a camping trip provided by the ladies and husbands of the members, and the outing was thoroughly enjoyed.\n\nA dress committee was formed, consisting of Mrs. Thomson, Mrs. Smith, Mrs. Peckham, Mrs. Nichols, M. Robertson, Hamilton and Patterson. After the program had been arranged, the ladies asked that they could best serve the committee by purchasing some new suits that are now needed. After all this, a vote of thanks was passed to the ladies contributing liberally to this delightful event.\n\nBIBLE COMPETITION.\n\nThe popularity of the popular science weekly paper, \"Our Jambsman's Reporter,\" amongst the intelligentsia of Red Deer, was further emphasized by the number of copies offere\n\n**AVIS PUBLIC**\n\nWe are prepared to Contract for Buildings of any kind\n\n**MOORE & MACDOWALL**\n\nThe Prince Albert Times\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\n**J. D. MAVEETNY, PUBLISHER AND PROPRIETOR**\n\nTHIRD ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885010901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3586, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8627, 2], [8627, 10768, 3], [10768, 15166, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]