[{"id": "607d02048210dfdea55ebf5bcc520c632cbe5100", "text": "The Prince Albert Times\n\nNotice\n\nCall and inspect our improved Heating Drums\n\nStoves and Stovepipes put up and cleaned in short notice\n\nPanel Doors and Sash,\n\nT. J. Agnew's\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNan's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Reps, Window Hidings in Green and Yellow, Door Matting, Bedding, Bed Curtains, Couch Coverings, Empress Cloth in Black and Garret, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beecroft Veiling, Ladies Silk Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Readymade Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Pigs, Dates and Tinned Goods of all kinds.\n\nInspection is solicited.\n\nTHE SUN!\n\nDAILY AND WEEKLY.\n\nIndependent in Politics.\n\nThe Leading and Popular Paper of the CANADIAN NORTHWEST.\n\nHas a City Circulation Greater than the Combined Circulation of the Other Winnipeg Newspapers.\n\nGreat Advertising Medium.\n\nIt is the Brightest, Swiftest and Wildest Read of all the Manitoba Bulletins.\n\nSUBSCRIPTION PRICE:\n\nDaily 6 months $1.00\nWeekly 6 months $1.50\nStrictly in advance.\n\nAdvertising rates moderate, and published in every issue of Daily and Weekly.\n\nAddress\n\n\"The Sun,\" Winnipeg.\n\nPRINCE ALBERT BREWERY!\n\nPure and Sparkling AMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERFORD\n\nThe Morning Call\n\nOnly Conservative Morning Newspaper in Famous or N.W.T.\n\nFull cable and telegraphic reports of all European, Canadian and United States News.\n\nSpecial reports compiled by resident correspondents throughout Manitoba, the Western Territories and all foreign countries.\n\nComplete reports of Parliamentary proceedings, etc., etc.\n\nTHE MORNING CALL alone records the night dispatches of the United Press, and has a news service unequaled west of the Mississippi.\n\nSubscription rates: One year $2; six months $1.50; three months $1; single copies 5 cents each.\n\nSubscription free to any address on application.\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS\nPresident and Editor-in-Chief\n**TERRITORIAL NEWS**\n\n*From the Leader, Oct. 4.*\n\nEighty-three fires burned last week. The atmosphere was thick with smoke on Saturday night, beginning near the proximity of Prairie House.\n\nIndications are good and the large number of buildings going up indicate that Regina, like the Leader, is flourishing.\n\nA gang of thieves, consisting of Mr. W. Macdonald and an employee of contractor Mclean left last week for Wood Mountain where they will soon be heard from.\n\nThis has been a season of mammals equalling the North-West as well as Manitoba. We expect that the vegeta- tive shows more than ever before to old residents of the Territories.\n\nA correspondent writing from Wapella says: \"On Saturday the 24th, about 11 a.m., a party of three white men, armed with revolvers, came into the brigantine settlement, its course being N.E. by S.W. They approached with intent to rob the settlers of their wagons and stores. When seen our party were 15 miles south of Elkhorn. Should any young man be interested in this affair, he will perhaps say where they saw it.\"\n\n**EDMONTON**\n\n*From the Bulletin, Sept. 17.*\n\nW. Humbertson burned 80,000 bricks this season.\n\nFred Halland and Sons have secured a five years lease of the privilege of mining coal under the McLennan estate in the hands of Messrs. Macdonald and Co.\n\nThere is talk of raising a new apple hall in Edmonton this fall or winter. A Macdonald & Co. have offered a lot for that purpose but the project has not yet taken definite shape.\n\nMonday was rainy and a few snowflakes fell. The first snowstorm of the season occurred on Tuesday night. A hailstorm, which wound up vegetable growth for the season, struck in the same way, causing damage to crops. Later came the first heavy frost which marks the line between summer and fall occurred on Sept. 29.\n\nJ. C. Cassel, H. R. chief factor in charge of Macdonald river district, with his family, including chief factor's son-in-law, Mr. Douglas, chief factor's daughter-in-law, Mrs. Douglas, and C.F. Gaudet in charge of Fort Good Hope, Mr. Gaudet's wife and children, arrived from Winnipeg on Thursday last. They leave for the north to morrow, accompanied by Dr. McKay of Peace River district, who is returning from a visit to England and will be met at Fort Chipewyan.\n\n**BATTLEFORD**\n\n*From the Herald Oct. 1.*\n\nThe threshers are all busy, and the fields fully equal the most sanguine expectations.\n\nArchdeacon J. A. M. Kay and the Rev. J. Wright, both of Prince Albert, visited this place on Friday morning.\n\nDr. Thomas, who has been engaged with the Prince Albert, Masters James Johnston and John Wright went down to Battleford on Friday afternoon.\n\nLong Dalhousie, who visited the community in the lock-up here for having two free men sign signatures without backs, is now back in town.\n\nCardinal Taschereau has declined the offer of the Quebec chateau as temporary residence.\n\n**CALGARY**\n\n*From the Tribune Oct. 7.*\n\nGeorge Brown, left on Wednesday for New Westminster, B.C., will arrive there next week.\n\n**THE PRINCE ALBERT TIMES**\n\n*TO AGENTS*\n\n**SASKATCHEWAN DIRECTORY**\n\n**THE PRINCE ALBERT TIMES**\n\n*AND*\n\n**SASKATCHEWAN REVIEW.**\n\n$2 50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\n**JOB PRINTING**\n\nOf all descriptions done neatly, quickly and cheaply\n\n**J. D. MAVETTY.**\n\nPublisher and Proprietor.\n\n**DRY LUMBER.**\n\n**MOORE & MACDOWALL**\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Uddressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\n**MOORE & MACDOWALL.**\nSEED GRAIN.\n\nThe following good news is in a copy of a letter received at the local Dominion Land office, and which will be read with interest by every farmer.\n\nOffice of the D. L. Commissioner,\nWinnipeg, 4 Oct. 1887.\n\nSir,—I am directed to request you to forward a copy of the Prince Albert newspaper that appeared yesterday, in order that the Minister of Interior may endeavor to secure the release of the seed grain which was held up by the government pending the decision on this question. We are authorized to accept the seed for deposit on account, and to issue a formal receipt hereafter.\n\nI have the honor etc.,\n(Signed) F. R. Burge.\n\nGeneral News.\n\nMontreal, Oct. 9.—Senator Murray, the minister of the interior, has been requested to take steps for improving the railway system, and is expected to do so throughout the province.\n\nToronto, Oct. 9.—Cardinal Taschereau died at government house last night, and laid the cornerstone of St. Paul's church in Ottawa on Friday evening.\n\nMontreal, Oct. 9.—Four young men performed the feat of running the fastest marathon distance this afternoon. This has never been done before to human knowledge.\n\nMontreal, Oct. 9.—Mr. Craig Bayley, secretary of McGill college, made very notable this morning, age 75.\n\nQuebec, Oct. 9.—A disastrous fire occurred at St. Philippe, Kamouraska, a few days ago. The fire started from a broken oil lamp, caused St. Jean, warned by the panic, to rush to the scene and put out the fire. The fire was extinguished there with the help of neighboring towns. He was assisted by a number of volunteers, who came to assist during the fire. The fire destroyed a number of houses and the main streets of the town.\n\nMontreal, Oct. 9.—Mr. J. M. Campbell, Pacific traffic manager, denies the telegraphed statement that the company has abandoned its plans to build a new line. An official statement just arrived. It appears that 40,000 tons of wheat have been shipped from Montreal to points during the past week, and 200 cars have been ordered for traffic, while 300 cars were on hand to supply them.\n\nMontreal, Oct. 9.—There has been another hitch connected with the fire, and a half million loan which Premier Macdonald promised to raise for the fire department, has been delayed. It is difficult to understand what is the matter, but the trouble has been removed.\n\nMontreal, Oct. 9.—Hon. Mr. Chapleau, who returned from Europe Saturday, has no intention of accepting the governorship of Quebec and appears of Sir John A. Macdonald to participate in Mercier's election contest.\n\nMontreal, Oct. 9.—Railroad officials of the French Chamber of commerce have decided to send a delegation to the government to protest against the proposed legislation, having a tendency to reduce the value of local currency.\n\nGatineau, Oct. 9.—A very severe storm occurred at a height of two thousand feet, and was caused by a hailstorm. The hail was caused by a hot air current, and the hailstones fell twenty-eight feet in diameter. The descent was a magnificent sight, the hailstones striking the ground like bullets. Attenay struck the ground very lightly and remained standing.\n\nSeattle, W. T., Oct. 9.—L. H. Shaw, a prominent citizen, has been taken into custody on complaint of his wife. He is charged with maintaining a common lodging-house for women, aged 14. The crime was first perpetrated when the child was 12 years of age. The case is all the details being investigated and will be heard in court. Shaw remains in jail.\n\nJ. M. Campbell\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nHURRAH! FOR THE QUEEN'S JUBILEE!\n\nTHE VICTORIA\n\nSale and Seed Stables\n\nFirstclass Turnout\n\nAt reasonable prices.\n\nJ. M. Campbell\n\nFall and Winter Goods\n\nDress Goods\n\nVelvets, Satins, Ribbons,\n\nWool Hoods and Clouds\n\nReady Made Clothing\n\nFancy Underclothing\n\nBoots and Shoes\n\nMitts and Moccasins\n\nGlass and Crockery\n\nFlour\n\nOats, Wheat and Barley\n\nGO TO CANN'S BOOK STORE\n\nFor Fine Stationery, Staple do., School Books, Fancy Goods, etc.\n\nNew Goods Arriving Daily.\n\nR. C. Wigmore & Co.\n\nBoys' and Men's UNDERCLOTHING!\n\nAt Wholesale Prices\n\nAT\n\nR. C. Wigmore & Co.'s\n\nBuffalo Hall!\n\nTO HAND THIS WEEK:\n\nElegant Jerseys and Jersey Jackets.\n\nSatin and Felt Skirts.\n\nBlack and Colored Shawls.\n\nWool Prizes and Overcoats.\n\nFur Gages and Jackets.\n\nBurrus, Crete and Lace Curtains.\n\nCorsets—Best makers only.\n\nTapestry Table Covers.\n\nKnitted Stockings.\n\nAnd a Long List of Men's Fur Caps.\n\nNew open and ready for inspection.\n\nBETTS & Gwynne.\n\nESTABLISHED: 1879.\n\nUPRIGHT AND BOX\n\nHeating Stoves\n\nFrom the Plainest to the Most Elaborate Design.\n\nHeating Drums\n\nIn Great Variety.\n\nAmerican Coal Oil\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowscring and Overcoating WORSTEDS,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887102101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2925, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2346, 2], [2346, 6341, 3], [6341, 11306, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]