[{"id": "95ca8b1ab20995ef9e982b2ff57febcd2620dcc6", "text": "JUST RECEIVED\n\nMAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers\n\nNorthcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods\nGroceries\nProvisions\nCrockery\nHardware\nBoots and Shoes\nWooden Ware\nFancy Goods\nClothing\n20 lbs Mess Pork\nBacon and Ham\nCanned Fruits\nMaple Sugar\nBiscuits\nCigars and\nFancy Pipes\nBaskets etc., etc\n\nSTEWART & WOOTTON\nHEINTZMAN AND COMPANY,\nPiano Manufacturers,\n117 KING - ST. WEST,\nNEXT ROSSIN HOUSE,\nTORONTO - ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\nPRINCE ALBERT - N.W.T.\nWEDNESDAY, JUNE 27, 1883.\n\nKNOX & BARKER,\nCarpenters and Builders.\n\nPRINCE ALBERT\nBOOT & SHOE STORE.\n\nBOOTS & SHOES\n\nCheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACK'NEE,\n\nSIGN OF THE BIG BOOT.\n\nGENTS' IF YOU WANT\nSummer Straw Hats,\nDress Shirts, Ties,\nSuspenders, Hose,\nUnderclothing,\n\nStylish Suits of Clothing in great variety.\n\nCALL AT THE\nHORSE SHOE STORE.\nRIVER STREET.\n\nAll and every kind of goods at Reduced Prices.\n\nTHOS. O. DAVIS.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nPrince Albert - N.W.T.\nHUDSON'S BAY CO'Y.\n\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 5,000,000 acres in the Great\nPrairie Belt, any new offer for sale 500,000 acres, already surveyed by\nthe Government of Canada.\n\nALSO\nTOWN LOTS\nFOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and\nGrosvenor, W. W. T.\n\nThe above are disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the\nCompany, Winnipeg and Edmonton.\n\nC. J. HOPKINS, Land Commissioner.\n\nAT LAST\nThe Raymond Sewing Machine\nhas come.\n\nLadies, now is Your Chance.\nLet me explain how the Raymond equalizes\nyour work and makes it easier.\n\nLIVE AND LET LIVE, is my Motto.\n\nI will sell the Raymond with the same\nguarantee as any other machine in the market. The greatest\nadvantage is that it does not require much\nskill or practice to use. It is easy to learn\nand will save you time and money.\n\nS. W. VANLIEN,\n\nWinnipeg and Western\nTRANSPORTATION CO.\n\nThis Company will run a\nWEEKLY LINE\nduring the season of Navigation between\nPrince Albert and Winnipeg.\n\nMARQUIS, Capt. A. F. Rossel,\nETHOTHE, \"Jerry Weber,\"\nOETHEWEY, \"Jim's Sheets.\"\n\nmaking close connection with the\nPRINCES,\n\nat Prince Albert.\n\nThe steamer Marquis, Capt. J. W. Lee,\nterminal, will run as a regular packet, the\nsame as the steamer Ethothe, making\nweekly trips.\n\nSpecial attention will be paid to the con-\nvenience of passengers and the comfort of freight. Rates reasonable.\n\nJohn D. VIVIAN, Agent.\n\nPRINCE ALBERT\nPrinting Mills and\nSash and Door Factory\n\nGood Beer and Cigars always\non hand.\n\nGood Boarding Stable in connec-\ntion.\n\nR. J. O'LEARY,\nPROPRIETOR.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nResidence - Near Presbyterian Church.\n\nGAND UNION\nLivery & Sale Stables.\n\nHorses and Buggies always on hand.\n\nRates for driving horses promptly attended to. Charges moderate.\n\nThe only licensed Livery in the\nTown.\n\nA. J. DONALDSON, Prop.\n\nCOMMUNICATION\nQUEEN'S BIRTHDAY SPEECH\nTo the Editor of The Times.\n\nSir,-In a former letter I simply noted\nfrom the press that there was dissatisfaction\nwhich seemed to exist in connection with the\nlate 24th of May sports, and as the\nname of Mr. Alexander Taylor was mentioned\nin the honesty of every member of that\ncommittee. Judge then of my surprise\nto receive a communication from Mr. Taylor\nwhich will have no doubt in the mind of\nany one that for some unknown reason\nthe committee did not want to publish\nthe statement made by him. Had he\nnot been silent would they not have waited\nfor the name of anyone before doing\nthe thing? If the committee had been\ncollectors and expenditures have been\nbalanced why not publish the fact as a curi-\nosity? But the silence of the committee\nof Mr. Alexander's name being known\nwill not excuse the committee from\nresponsibility. If the shoe does pinch, let a meeting be\ncalled and let each collector be charged\nwith having been the sole cause of the\nsports and for the benefit of the public.\nTo the front.\n\nBoots and Shoes.\n\nShannon & McLeod,\nBoot and Shoemakers.\n\nHave opened out in Morrison & Morrison's\nold store building, where we will be\npleased to see the residents of Prince\nAlbert and surrounding district, and by\nstrict adherence to honesty, hope to gain\na share of their patronage.\n\nWe expect our stock of Ready Made Boots\nand Shoes to arrive in about two weeks.\n\nSHANNON & MCLEOD,\nFirst door east of Campbell's\nBlock.\n\nA. L. ASHDOWN,\n\nGroceries and\nProvisions.\n\nPRINCE ALBERT, N.W.T.\n1879. BUFFALO HALL. 1883.\nThe Old, Reliable Dry Goods, Clothing, Grocery, Crockery and Patent Medicine House still to the front\n\nRETTS & Gwynne\n\nNo longer known to the public of Prince Albert and surrounding country, take great pleasure in announcing that every department of their business is again complete with a fine assortment of the Latest and Best Selected Class of Goods. An endless variety of every kind of\n\nDRY GOODS\n\nNow on exhibition, conspicuous among them being some choice selections in\n\nBunting and De Beige, Dress Goods, Elegant Infant Robes, Evening Shaws and Kid Gloves. Frillings, Lace Trimmings, Corsets, Hosiery, Smallwares and a full line of Crout's Celebrated Black Silk Capes. Our Brown and White Ducks, Ticking, Sheetings, Jeans and Cambrics, together with our English and American Prints\n\nMake this branch of our business the most complete ever opened here, and at prices without an equal in the country. Grand Display of\n\nREADY-MADE CLOTHING BOUGHT AND PAID FOR.\n\nMen's, Youth's and Boys' Suits, representing one of the largest, and most fashionable clothing units ever shown in this district, and owing to our disappointment in not securing larger premises, we have decided to offer for the next THREE DAYS every article in this department at coal prices which cannot help our existing opposition.\n\nMen's Knit Jerseys, Shirts, Ties, Collars and Gloves, Hard and Soft and American Hats and Helmets and a Big Outfit of Straw Goods—Every article new and stylish\n\nTWENTY-FOUR DOZEN PAIRS OF\n\nOur now Celebrated Double-stitched Overalls\n\nREADY FOR INSPECTION.\n\nWe take pleasure in assuring that we are still in a position to maintain the reputation we have gained in our\n\nGROCERY DEPARTMENT.\n\nAs usual, our stock of Canned Goods is unequalled, while our Groceries, Spices, etc., will be found pure and unadulterated. Every article has been selected for its usefulness, not cheapness.\n\nSTAPLE CROCKERY—The best in the market. In PATENT MEDICINES we show a full line of every kind of staple goods.\n\nWe employ no agents to buy our goods. The entire stock has been selected with a knowledge of the requirements of this country, and every article will be found as represented.\n\nLOCAL AND GENERAL NEWS.\n\nWhat about Johnny and his wife?\n\nRiver bathing is being indulged in by the boys.\n\nLadies Visiting Cards, best quality, at the Town.\n\nA special train for the H.R.C. passed down this morning.\n\nJ.M. Campbell is erecting a store front of Campbell's block.\n\nMessrs. H. F. Fletcher, J.C. Macdonald and Locks left for the Appalacian Mountains.\n\nThe citizens of Moose Jaw expect to have cool this coming winter for 25 degrees.\n\nThe Ferry Johnson boat race took place at East Portage on the 14th of June.\n\nFerry was very good.\n\nEvery rig was in great demand last Sunday, the weather being beautiful and the river smooth.\n\nThe engine and boiler for Mr. Thomas McKay's new mill is expected to arrive by the first week in July.\n\nThe last few days have been excessively warm, and the black fly is consequently becoming quite numerous.\n\nDon't forget the skating match on Dominion Day. We hope to see every keen and enthusiastic skater there.\n\nWe are by the East Portage Post Office, Mr. D. Nisbet, who lives in this place, has written us from his home.\n\nNearly every mail which arrives in this town comes against a good or bad wind, and the post office is always wet.\n\nJ.O. Davis & Co. foremen arrived on Saturday, and went off with good things to eat and drink, and plenty of the most substantial.\n\nWe would like to see the stock holders in the Royal Curling and Skating Club that the first half payment is due on the 1st of July.\n\nMr. J.O. Davis is so occupied at this work another large supply of hardware, among other things a splendid assortment of curling sticks.\n\nSawing has commenced in Moose & Macdonald's saw mill, and there are now a fifth lumber yard in the town.\n\nApplications to building operations.\n\nThe Tripos affair has met with a great loss, dear old Zola has been killed by a horse. Any case arising out of this affair will be prosecuted.\n\nIt is expected that Bishop Cranston will arrive here from Winnipeg this week.\n\nRev. A. Whitehouse has been transferred to the Montreal Methodist Conference.\n\nThe Stationery Committee has assigned him a new field of labor at Goose Basin and will be glad to see him there.\n\nA horse belonging to Mr. Wm. Dalworth ran away Sunday evening and was found in the woods near the school house.\n\nThe horse afterwards made his own way to the stable with only the broken shoe.\n\nMr. Shannan, of the firm of Shannan & McLeod, arrived back home from Winnipeg last Monday. He has purchased a fine horse, which he will ride when he goes on the road and will arrive here in a few days.\n\nThere is a curious hall at large in the west end of the town and the owner had better secure a lock or else it will be broken into and the contents stolen.\n\nSeveral ladies and gentlemen have been disturbed by the noise of the hall, and they have complained and had hardly got inside the door closed when the hall butted the door with great force. We will tip the gentlemen a rifle.\n\nMAHAFFY AND CLINKSKILL General Supplies\n\nHave now received their Extensive Stock of\n\nStand—Next Post Office,\n\nIn Front of McKay's Mill.\n\nTAILOR AND CUTTER Brick Machines\n\nCall on Scotty, the Tailor, for Your Clothes.\n\nFit Guaranteed.\n\nCutting a Specialty.\n\nFOR SALE.\n\nTwo No. 4 Penfield Brick Machines (one with harness, capacity 6000 bricks per day) with each machine. For terms apply to\n\nAUBREY SMITH,\n\nDominion City, Man.\n\nCITY AUCTION MART.\n\nHaving closed a General Auctioneering and Commission business in the city of Prince Albert, Messrs. J. H. Ross & Co., bankers, are prepared to run a second-hand auction mart for the benefit of all private residences and others desirous of disposing of any surplus, either for public auction or private sale.\n\nBAKING POWDER!\n\nThis Powder never loses its flavor, and is guaranteed to be free from the ordinary碱性 taste. It is also free from the alkaline taste of old types. Sold weight, 100 grams. Price, 10 cents.\n\nROYAL\n\nJ.M. CAMPBELL, MARKLEY & ORR,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883062701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 2979, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 457, 2], [457, 457, 3], [457, 805, 4], [805, 5080, 5], [5080, 11193, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]