[{"id": "277ac031796b55652b6110abd605e40a08381b99", "text": "HORSE SHOE STORE\n\nThe Only First-Class Store in the District.\n\nWe Are Right ON THE BOOM\n\nThis is no Bogus Sale. We are not Dissenting Partnership. Our Health is Good and Our Friends not Wary. We Don't Try to Give You Chestnuts.\n\nBut we can give you Goods Cheaper than any other House in town.\n\nWe have just received a Marvellous Stock—All\n\nFresh, Clean Goods!\n\nLATEST STYLES, PATTERNS AND DESIGNS.\n\nWhich we will sell at cost, just to make things interesting for our friends.\n\nRemember—we offer you old sizes, worn goods or winter stock, but new Spring Importations. Look at the following prices, and SMILE—\n\nGingham 10c. Grey Cottons 6, Prints 8,\nWhite Cottons 8, Flannels 20, Plush $1.\n\nClothing—Men's Suits $5, Felt Hats 25c,\n\nGROCERIES\n\nBlack Tea 25c, Tomatoes 20c, Corn 20c, California Fruit 45c, Dried Apples 12½c, Evaporated Apples 17c, Rice 8c, Matches 15c, Lollipops 6c, Oyster Fish 70c,\n\nAll Other Goods in Proportion.\n\nBoots and Shoes at Cost.\n\nTHOS. O. DAVIS\n\n'79. '88.\n\nNOTICE!\n\nT. J. AGNEW takes stock and Closes his Books on 30th of April. Parties indebted to him would greatly oblige by arranging their accounts previous to that date.\n\nUntil said date all goods will be greatly REDUCED FOR CASH.\n\nFULL LINES ON HAND OF\n\nBREAK PLOWS, CROSS PLOWS,\nIRON HARROWS, GARDEN TOOLS, COAL OIL,\nBOSS CHURNS, MILK PAILS, CREAMERS,\nBUILDING HARDWARE\n\nAT\n\nT. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING.\nOffice Stationery, etc., etc.,\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department is IMMENSE.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra\n\nLath, '75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nMASONIC SERMON.\n\nThe following sermon was delivered by the Rev. Canon Flatt, D.D.G.M., at the northern of Kinloch Lodge, A.F.A., M.M., at Allens Church, and published at the request of the members present.\n\nThe sermon's text was taken from I Peter ii, chapter 50 verses. \"Ye also, as lively stones, build yourselves up an house, an holy priesthood, to offer up spiritual sacrifices, acceptable to God through Jesus Christ.\"\n\nIt has been our custom, brothers, at this season of the year, to take a moment's glance at the condition of our temporal affairs, and to reflect upon the progress made by Prince Albert and his government in the advancement of the country.\n\nThe town certainly compares most favorably with many of the towns in Canada, and even with some of the villages of the United States. A good house has been built, and the town is now filled with commercial and agricultural produce. The future promises well, and we may look forward to prosperity for the future. The line of coal and iron will be completed, and the line of railway. I speak from personal knowledge, and I believe that within a few weeks thousands of tons of coal will be transported in the Territorial, with whom we have a close connection.\n\nWhen the character of this section of the country is considered, it is evident that there will be rapid and extensive settlement. The town of New York is in regard to the future of the Eastern and Western Territories of Canada. The pioneer in speaking of the western territories is often met with a great expression to ideas that have been already formed and brought into being by those who have been engaged in the same work. We can apply only our own experience to the future of the Eastern and Western Territories of Canada. And while we are engaged in watching the mighty sweep of the map held out before us, we must not forget the strength, while the reverse of the westward movement is going on around us, and you by them are enabled to build your stable kingdom and to dwell in peace and prosperity for all time to come.\n\nThe impossible barrier of the Atlantic Ocean is broken down, and the way is open for the advance of the Eastern and Western Territories of Canada. The west is illimitable. States and provinces are being added to the Union, and back to those who are now taking possession of the new lands. The American continent is thus still more extended, and the advance of commerce and industry is still more rapid than ever before. The east will be compelled to surrender its supremacy, and the west will be called upon to take its place.\n\nWe must be prepared for the coming of the new era, and we must be ready to meet the challenges of the future. The west is the land of opportunity, and we must be prepared to take advantage of the opportunities that will come our way.\n\nPRINCE ALBERT BREWERY.\n\nDelivered to all Parts of the Town.\n\nAMBER--Hop--ALE.\n\nPure and Sparkling.\n\nBETTS & Gwynne.\n\nR.C.W. & Co.\n\nClearing Sale!\n\nWe beg to notify the people of Prince Albert and vicinity that we have decided to dispose of our entire Stock of Ready Made Clothing, Dry Goods, Groceries, Glassware and Crockery.\n\nAt prices which cannot fail to satisfy intending purchasers.\n\nAll parties indebted to us will please settle at once as our books are closed.\n\nR.C. Wigmore & Co.'s.\n\nNEW GOODS\n\nAnd Close Prices go to J.R. McPhail's.\n\nThe balance of our Trading Stores and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on J.R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS.\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888033001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 1731, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1582, 2], [1582, 2504, 3], [2504, 6353, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]