[{"id": "96b1d6ef5d27192ff0f31860bb3a690e57c928d5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 25, 1885.\n\nBANKING HOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTraders & General Banking Business.\nInterest paid on Deposits.\nNotes Discounted.\nDrawncheques available at all points in the Dominion.\nCollections undertaken and promptly attended to.\nBANKERS—Merchant Bank of Canada\n\nLINCOLN COLLEGE\nOpen Lower Canada, Middle and Upper Canada, and Ontario. Courses from Oxford and Cambridge Universities. Students most successful in Public Examinations.\nHENRY JULIAN LITTLE, Principal.\n\nNOTICE\nTwo Horses, Wagon and Harness\nFrom J. O. Davis, and claim them as my property.\nTHOS. O. DAVIS.\n\nDEATHS\nPRINCE—At Prince Albert, on the 23rd September, Augustus Hartman, husband of Mrs. H. Peard, aged 37 years, and seven months.\n\nST. ANDREW'S SOCIETY\nMeeting of the Society will be held in Stewart Hall, Prince Albert, on Friday evening next, at 8 o'clock p.m.\n\nTENDERS\nTenders will be received by Col. Spratt, up to 6 o'clock on Tuesday evening next, 29th inst., for the fencing of two acres of the Presbyterian Cemetery. For further particulars apply to COL. SPRATT.\nChairman of Trustees.\n\nHOUSE TO LET\nThe dwelling house formerly occupied by Mr. J. F. Kennedy, on lot 1st special survey, will be let on short or long lease. Very suitable for small family. For further particulars apply to J. F. KENNEDY, or to W. R. GUNN.\n\nFURNITURE!\nCheaper than ever.\nGILBERT E. CARTER.\nRobert Thomson, Sign & Ornamental Painter, Catamining and Paperhang-\ning on short notice.\nDecorative Painting a Specialty.\n\nCITY BILLARDSALOON\nCorner Church and Main Streets.\nChairs, Beer and Cigars always on hand.\n\nA.W.R. MARKLEY,\nGun Agent and Auctioneer.\n\nPUBLIC MEETING.\nA Public Meeting of the residents of Prince Albert and surrounding country will be held in the PUBLIC SCHOOL HOUSE, Monday, Sept. 28, at 7.30 p.m.\nBy Order,\nALEX. LANG\nGeneral Blacksmith.\n\nA number of shipments of Montana cattle have been sent from Maple Creek. A case of leprosy has been reported at Victoria, British Columbia.\n\nDEATHS\nPRINCE—At Prince Albert, on the 23rd September, Augustus Hartman, husband of Mrs. H. Peard, aged 37 years, and seven months.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\nShannon & McLeod.\n\nThe Annual Meeting of Shareholders of the Saskatchewan Curling and Skating Rink Company, will be held in the Town Office, on Tuesday, Sept. 29 at 7.30 p.m.\nBy Order,\nT. N. CAMPBELL\nSecretary.\n\nPUBLIC MEETING.\nA Public Meeting of the residents of Prince Albert and surrounding country will be held in the PUBLIC SCHOOL HOUSE, Monday, Sept. 28, at 7.30 p.m.\nTo make arrangements for the reception and entertainment of the Hon. Thomas White, Minister of Interior on his visit to this town.\nBy Order,\nCOMMITTEE.\n\nTHE VERY LATEST NEWS BY WIRE\n(By Special Telegraph.)\nOTTAWA, Sept. 24.\nA number of members of the Red River settlement recently returned from Regina where they had been on trial for felony and upon a report that they had met with a slight set back in their attempt to assist the first police force who interfered with them five policemen were sent out to meet them when they did not arrive in which manner they were finally used, but happily without serious effect. The trouble was arrested and the prisoners returned to their homes.\nGodwin Macdonald, a half breed who was suspected last spring of supplying whisky to the Indians, has been arrested for selling liquor to last night disturbers of the peace.\nThe telegraph line for some months past has been out of order and no message has been received from the East, between Edmonton and the East End, but the telegraph company has now employed in putting up the line, and it is again working order.\n\nOTTAWA, Sept. 24.\nJudge Ramsden has just issued an arrest warrant on the following named Indians—Wandering Spirit for the murder of Aquinas, aged 16 years, on the 28th November, Fort Sky Thunder 14 years, Colling Bull 10 years, Little Wolf 10 years, Old Man Wolf 10 years, Erect Man Wolf 10 years, Old Man Wolf 4 years, Roman Nose 4 years, Idle Man 2 years. All for horse stealing and raids.\n\nOTTAWA, Sept. 24.\nSheriff of the Territorial Court has been notified in bail and in Montreal. A public subscription to pay his fine and costs is called for.\n\nOTTAWA, Sept. 24.\nCapt. Dobson, wounded at Fish Creek has undergone an operation here by which he hopes to be able to go home.\n\nOTTAWA, Sept. 24.\nThe following Cabinet changes have taken place: Hon. Mr. Pope, Minister of Agriculture; Hon. Mr. Thompson, Minister of Agriculture; Sir Alex. Campbell, Postmaster General; Judge Thompson, Minister of Interior. Hon. Nova Scotia has resigned and will take the portfolio of Justice of Medicine, liberal member for Antigonish in the province, accepts the vacant position previously held by Mr. Thompson.\n\nSir Clan. Tupper was last heard from as having returned to England where he intends returning from British Columbia by the C. P. R. Hon. Thos. White received a petition from the settlers of Portage Laprairie, asking for a post office.\n\nThe officers of the census department who have been in the North West Territories appointing a number of enumerators have returned to Ottawa. It is expected that the work of taking the census in the Territories will be completed by the end of October and the returns prepared in time to present at the session of Parliament.\n\nIt is understood that the Indian Department has decided to throw open the Monomotapa reserves in October next for ordinary settlement.\n\nTurkey and Russia. Russia is not settled yet. Turkey is seeking the permission of the Powers to recover her control.\n\nOTTAWA, Sept. 24.\nThe Hon. Thos. White and Sir Clan. Tupper have arrived at Winnipeg. Mr. White intending to proceed along the Main Line, South Western and Canadian Pacific railroads, thence proceed West to Red River and thence proceed to Prince Albert by the shortest route possible. He will return, going West via Qu'Appelle.\n\nOTTAWA, Sept. 24.\nSir Clan. Tupper is here in connection with the Imperial Colonial Exhibition to be held in London next year. His Excellency the Governor General arranged a meeting with Sir Clan. Tupper, and was presented with an address by Mr. Appolinier. He spent one day at Regina. He expressed great confidence in the future of our country.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 25, 1885.\n\nBANKING HOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTraders & General Banking Business.\nInterest paid on Deposits.\nNotes Discounted.\nDrawncheques available at all points in the Dominion.\nCollections undertaken and promptly attended to.\nBANKERS—Merchant Bank of Canada\n\nLINCOLN COLLEGE\nOpen Lower Canada, Middle and Upper Canada, and Ontario. Courses from Oxford and Cambridge Universities. Students most successful in Public Examinations.\nHENRY JULIAN LITTLE, Principal.\n\nNOTICE\nTwo Horses, Wagon and Harness\nFrom J. O. Davis, and claim them as my property.\nTHOS. O. DAVIS.\n\nDEATHS\nPRINCE—At Prince Albert, on the 23rd September, Augustus Hartman, husband of Mrs. H. Peard, aged 37 years, and seven months.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\nShannon & McLeod.\n\nThe Annual Meeting of Shareholders of the Saskatchewan Curling and Skating Rink Company, will be held in the Town Office, on Tuesday, Sept. 29 at 7.30 p.m.\nTo make arrangements for the reception and entertainment of the Hon. Thomas White, Minister of Interior on his visit to this town.\nBy Order,\nCOMMITTEE.\n\nTHE VERY LATEST NEWS BY WIRE\n(By Special Telegraph.)\nOTTAWA, Sept. 24.\nA number of members of the Red River settlement recently returned from Regina where they had been on trial for felony and upon a report that they had met with a slight set back in their attempt to assist the first police force who interfered with them five policemen were sent out to meet them when they did not arrive in which manner they were finally used, but happily without serious effect. The trouble was arrested and the prisoners returned to their homes.\nGodwin Macdonald, a half breed who was suspected last spring of supplying whisky to the Indians, has been arrested for selling liquor to last night disturbers of the peace.\nThe telegraph line for some months past has been out of order and no message has been received from the East, between Edmonton and the East End, but the telegraph company has now employed in putting up the line, and it is again working order.\n\nOTTAWA, Sept. 24.\nCapt. Dobson, wounded at Fish Creek has undergone an operation here by which he hopes to be able to go home.\n\nOTTAWA, Sept. 24.\nThe following Cabinet changes have taken place: Hon. Mr. Pope, Minister of Agriculture; Hon. Mr. Thompson, Minister of Agriculture; Sir Alex. Campbell, Postmaster General; Judge Thompson, Minister of Interior. Hon. Nova Scotia has resigned and will take the portfolio of Justice of Medicine, liberal member for Antigonish in the province, accepts the vacant position previously held by Mr. Thompson.\n\nSir Clan. Tupper was last heard from as having returned to England where he intends returning from British Columbia by the C. P. R. Hon. Thos. White received a petition from the settlers of Portage Laprairie, asking for a post office.\n\nThe officers of the census department who have been in the North West Territories appointing a number of enumerators have returned to Ottawa. It is expected that the work of taking the census in the Territories will be completed by the end of October and the returns prepared in time to present at the session of Parliament.\n\nIt is understood that the Indian Department has decided to throw open the Monomotapa reserves in October next for ordinary settlement.\n\nTurkey and Russia. Russia is not settled yet. Turkey is seeking the permission of the Powers to recover her control.\n\nOTTAWA, Sept. 24.\nSir Clan. Tupper is here in connection with the Imperial Colonial Exhibition to be held in London next year. His Excellency the Governor General arranged a meeting with Sir Clan. Tupper, and was presented with an address by Mr. Appolinier. He spent one day at Regina. He expressed great confidence in the future of our country.\nSUNDAY CHURCH SERVICES\n\nSt. Mary's,\n11 a.m.—Rev. Mr. Maidin.\n1 p.m.—Rev. Mr. Wright.\nThe Mission Chapel.\n10 a.m.—Rev. J. J. Pritchard.\n3 p.m.—Sunday School.\n\nSt. John's,\n7 p.m.—Rev. Mr. Bannister.\n\nSt. Catherine's,\n10:30 a.m.—Rev. Mr. Matheson.\n3 p.m.—Rev. E. Macdonald.\n\nSt. Paul's,\n12 p.m.—Rev. Mr. Craig.\n\nSt. Andrew's,\n10:30 a.m.—Rev. Canon Flatt, B.D.\n\nSt. James',\n3 p.m.—Rev. Archdeacon McKean, B.D.\n\nSt. Anne's (Protestant),\n8 a.m.—Rev. Mr. Brecknock.\n10 a.m.—Rev. Mr. McCollum.\n\nFRIDAY, SEPT. 25, 1885.\n\nGOVERNMENT RELIEF.\n\nWhen Mr. S. Bedson went away from the scene of his duties as chief of the Transport service and supply department, he left instructions for Superintendent Gagnon of the N.W.M. Police Force to distribute among those who were really in distress the supplies which were left over, and which it was infinitely better to have used up in of any way than to carry back again. This distribution of Mr. Gagnon made in the most impartial manner he knew how, referring applicants, personally unknown to himself, for certificates to local officials—unto whose well-quafilested with the true state of their circumstances, lest any should unfairly obtain what was urgently required by the really needy. The fact of this distribution having got about, has resulted in claims for relief being put in by great numbers—probably some of whom we are credibly informed who offered employment for themselves and tenants refused it on the ground that the Government wished to help to feed them—any how. To gentlemen of this class we wish to say a word or two. To begin with the petition sent into the Government by the enrolled residents would have framed agreeably to the expressed feeling of a largely attended public meeting, in a spirit rejecting charity but asking that some work might be given by means of which the necessaries for themselves and families might then be decently earned. This is what we have since advocated, nor have we any reason to doubt that as far as the bulk of the manly and independent spirited farmers of the district are concerned, there is still obtains. It will therefore be a gross injustice to the many if consequence of the conduct of the few, the impression should get abroad that the settlers wish to take advantage of what has happened to compel the government to support them for a season in idleness. We may as well tell such men plainly that they need cherish no such expectorution, for by the time the government has compensated the settlers for their losses, which there appears very inclining, as do in the past spring, they will have further the reason to refuse the inclination to fed men who refuse to accept work at fair remuneration. Again it may be well to point out that up to the present no government grant is promised or even asked—such claim simply involves more for the consequences of the crop not having been put in. Should such claim be recognized at all, it can only become valid after half-time as the farmers appear to be awaiting the course of events to bring them to reap the fruits of his labour in the spring and that means at the time when crops usually have been gathered in and treasured out. That has certainly been a situation of no sort, rather than some general public work will be provided, we must sincerly hope, because we are aware that it is absolutely necessary. Without the majority of the settlers will be in a bad plight, because owing to the late arrival of train, some of them who retained a little seed grain were able to put in the little which they thought might furnish themselves and families with bread and also with food. The result of their small ventures has been caught by the frost, and consequently with the exception of wheat, the growth of which has not been around the town has had but a produce, absolutely nothing for the support of its inhabitants. We have no fear but that if the true state of things is represented to the authorities relief in some form will be afforded, but the product of such must be refused it on the ground that in the year last winter they were perfectly justified in requesting and accepting seed grain for the lands which no one doubted could have been cultivated as usual last spring.\n\nAGRICULTURE.\n\nThe harvest of the agricultural show seems to come on to the present as a suitable time for devoting a little attention to the subject of the farming of our district. The total output of all our arrangements in the spring and summer months it now impossible to take advantage of the very favourable weather for putting in crops, accounts in the main for the destruction of what little was sown at a late date. It is idle however to discuss the fact that there exists, Indian in the section of country that they occupy, a moral enactment that they shall fire a penalty of not less than five pounds but that shall liable to imprisonment for a term of six months and fine not exceeding two shillings and six pence. Now know Ye, that I, the said Right Honorable Sir John Alexander MacDonald, Lieutenant-Governor of India Affairs, considering it be in the interest of Indians and Indians, hereby public notice that the sale, gift or disposal of fixed ammunition or ball cartridges, shall be unlawful from any Indian in the section of country that he occupies, and any Indian within such area loitering, hunting or selling with fixed ammunition or ball cartridges in the hands of Indians is punished by law. Any Indian found without a permit from this bureau may fined as directed by the laws of Canada or throughout any part thereof. All fixed ammunition and ball cartridges become the property of the Government at once and no man shall be permitted to use such ammunition or cartridges. Under the terms of the law, any person convicted of violating these provisions shall be fined two dollars and six cents.\n\nNotice of Dissolution.\n\nNotice is hereby given that the Partnership hereunto existing between J. D. Maveety, Esq., Proprietor of \"The Prince Albert Times,\" and Robert K. Miller, Proprietor of \"The Prince Albert Times,\" \"*Stewart Brothers,\" is dissolved by the death of J. D. Maveety. In consideration of the former, Mr. Stewart, Proprietor of the \"Prince Albert Times,\" transmitting the same to Mr. Stewart, Proprietor of the \"Prince Albert Times,\" by authority of the other partner. Due publication is hereby given of the above Notice, pursuant to Act R.S.O. No. 46, of July 1st, 1883.\n\nTHOS. POWERS.\n\nOffice and Workshop.\n\nKNOX AND BARKER.\n\nNear Presbyterian Church.\n\nJAMES SINCLAIR.\n\nMerchan Tailor.\n\nGENTS' FURNISHINGS.\n\nHILARY BOWCOCK GRANT.\n\nTo all whose names may come:\n\nAn Act to establish grants of land to men actually engaged in agricultural and pastoral services in the North-West Territories.\n\nWHEREAS It is ordained by and in the Act of Parliament of Canada, passed in the thirty-first session of the Queen's Reign, chapter twenty-six and being the Indian Act, 1880, amongst other things in Section II, subsection 1 and 2, wherein the Superintendent General of Indian Affairs is authorized to give out to those persons who considers it is in the public interest to do so, free of charge, or to lend at his own expense, or to sell at his best price to assist him in the execution of this Act, personal property, including cattle, horses, sheep, swine, hogs, poultry, in the amount of twenty-five thousand acres of land, with the land located under the Home Land Order, the land located under the Dominion Land Order, or the land located under the Land Survey Order, or before the first day of August, eighteen ninety-three.\n\nNotice of Dissolution.\n\nNotice is hereby given that the Partnership hereunto existing between Robert K. Miller, Proprietor of \"The Prince Albert Times,\" and Robert K. Miller, Proprietor of \"The Prince Albert Times,\" \"*Stewart Brothers,\" is dissolved by the death of J. D. Maveety. In consideration of the former, Mr. Stewart, Proprietor of the \"Prince Albert Times,\" transmitting the same to Mr. Stewart, Proprietor of the \"Prince Albert Times,\" by authority of the other partner. Due publication is hereby given of the above Notice, pursuant to Act R.S.O. No. 46, of July 1st, 883.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nTerms—50 cents per No. in advance.\nGENERAL NEWS.\n\nGREAT BRITAIN.\n\nLondon, Sept. 14.—The report that Russia and England have signed the pro- tocol delineating the Russian Afghan frontier, is confirmed. The treaty will be officially communicated in November and complete the details. Mr. Leamain, special Russian commissioner, will re- turn to St. Petersburg next Monday, his mission having been completed.\n\nThe Daily News, Berlin, says the Car- olling may already be regarded as ter- ritorial policy. The entire affair can only terminate with the assertion of Germany's claims.\n\nFRANCE.\n\nParis, Sept. 14.—M. Duranton, the French commandant at Amman, has been asked that he be given authority to dispose of the youthful King of Amman if he thinks it necessary to do so; has been granted full liberty of action.\n\nGERMANY.\n\nBerlin, Sept.14.—Count Benonan, the Spanish minister at Berlin, has been notified that he cannot leave Germany unless he signs an apology from the Spanish Government for the affronts given the German Empress at Madrid.\n\nThe members of the German Foreign Office will be summoned for consultation immediately on arrival of the Spanish note in this city.\n\nWASHINGTON.\n\nWashington, D.C., Sept. 14.—The following dispatch has been received at the Post Office Department from the Canadian Post Office Department relat- ing to the message sent yesterday by Acting Postmaster-General Severson:\n\nOTTAWA, Ont., Sept. 10.—To the Hon. A. J. Severson Washington, D.C.-\n\nInstruction have been given to all telegraph offices to forward all matter prior to despatch, all matters to be sent to the United States as requested in your telegram to supply W. H. Green.\n\nNEW YORK\n\nNew York, Sept. 14.—In the twenty-eight mile race over the New York Yacht Club course today, the Puritan defeated the preparatory race by five seconds, ten seconds, or fifteen seconds, received actual time. The wind was extremely light from the start from Sandy Hook to the Hook light, while from the finishing coming in. From the Hook to the light ship behind where there was a gale that had developed swept the race field during the first half of the race, and still coming home.\n\nThe longest fleet of steamships assembled in New York history for a similar short scrimmage swept the yachts over the entire course. The sound of the siren was heard several times that echoed from the sea when each yacht was saluted by every vessel and a gun from Fort Washington, Staten Island, owing to the nature of the race course the trimmings' machines, the inside race is postponed until Wednesday.\n\nBOSTON.\n\nBoston, Sept. 14.—The board of health has ordered quarantine against vessels from Canada and Newfoundland.\n\nPITTSBURG.\n\nPittsburgh, Pa., Sept. 14.—“Formerly, the armoury says her willing to new Company. Will take five votes of five feet (50 ft.) in length; will promptly cover any deposit made by the Union Springs’ order.\n\nMONTRIOU.\n\nMontreal, Sept. 14.—The officials at the health office state that no news of smallpox ware reported, although it is being watched. No case of smallpox was reported.\n\nQUEBEC.\n\nQuebec, Sept. 14.—A young man has been visited recently by serious injuries received on their watch with Mr. Sackett.\n\nA number of articles destroyed by the snowstorm following manufacturing failure as there was not a single person able to visit all the shells that were destroyed. Some clothes were used to keep open in air so they are free from small pocks.\n\nOUT OF THE ARTICLES DESTROYED BY THE SNOWSTORM THE FOLLOWING ARE USING TO KEEP OPEN TO AIR SO THEY ARE FREE FROM SMALLPOX.\n\nCALLEDIA BREWERY.\n\nEAST END.\n\nProprietor of the above concern is prompt to supply Kegs, Quart Bottles (with chalk) Other refreshments used in the various clubs throughout town.\n\nA Pillow Table and Saloon.\n\nIn connection with the Saloon.\n\nCHAS. WOODMAN\n\nPROPRIETOR.\n\nPUBLIC NOTICE.\n\nAll parties interested are warned that the Board of School Directors have permitted the erection of the above building upon the site of the Saint Laurent Catholic Public School District No. 27 within the following limits, that is north of Route No. 3, west of Perfect School House Road, west of avenue B, between Route No. 3 and Route No. 3 which Route No. 3 extends northward and southerly toward the present school, that you have the reassurance of the Directors that you are entitled to the benefits of the proposed school district, that you have been received into the school district that you have been received until you have been placed on the list of the entitled voters, that you have been provided for the accommodation of a large number of ratepayers who have purchased land within a reasonable distance of this district, that you have been provided with the best accommodations and conveniences possible for the use of our children while attending the school, and that you have been placed on the list of the entitled voters for the purpose of electing a school committee. It shall be allowed that the school committee shall have the power to purchase school supplies, and other necessaries for the operation of the school, and that the school committee shall have the power to levy taxes on the property located within this school district to provide for the operation of the school. It shall be allowed that the school committee shall have the power to levy taxes on the property located within this school district to provide for the operation of the school.\n\nWe are prepared to contract for buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nAVIS PUBLIC.\n\nMOORE & MACDOULL\n\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM.\n\nJOB PRINTING\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nFarewell Sermon\n\nSt. Andrew's Church\n\nSouth Branch, Sept. 21, 1865.\n\nThe sermon preached last Sunday in St. Andrew's church will hang forever in the hearts of the people of the parish; being Mr. Prichard's farewell sermon, after a ministry of twenty years in their midst.\n\nIt is not easy to describe adequately this parish and people in such perfect harmony that the united efforts of a whole parish are put forth to retain the services of their minister by choice; but it seems to be the case here.\n\nThe church was crowded, and after service, a meeting was convened for the purpose of expressing our understanding of the position of the parish being left without a resident minister. On due deliberation it was unanimously resolved that the Churchwardens and Vestrymen should draft and present petition to the Bishop, praying that Mr. Prichard be allowed to remain.\n\nAs public men generally get more blame than praise, it may be some consolation to Mr. Prichard to know that his services have been appreciated, and whether he remain or depart, he has the hearty good will of his parishioners.\n\nX.\n\nThe following petition has been since presented to His Lordship the Bishop of Saskatchewan:\n\nMay it please your Lordship,\n\nWe the Church wardens, vestry and members of St. Andrew's Parish in the diocese of Saskatchewan, humbly pray your Lordship to be pleased to grant us:\n\n1st. That we have heard with deep regret the intention of your Lordship to remove from our parish our esteemed pastor.\n\n2nd. That it is apparent that church supplies may be supplied from a distance and by land.\n\n3rd. That we may be without a resident clergyman.\n\n4th. That we have every confidence and regard for our present pastor and that his parish is far in the enjoyment of unity, that the church is in a very healthy condition.\n\nYour petitioners would therefore pray:\n\n1st. That it may please your Lordship to allow Mr. Wainey and Mr. Mackenzie to assist Mr. Prichard, to remain in charge of this parish.\n\n2nd. That it will be very hard to procure the services of clergymen in cases of death, sickness, etc., from a distance.\n\n3rd. That they may not be left without a resident pastor.\n\n4th. That having every respect and esteem for Revd. Mr. Prichard, and your petitioners do not wish to change him, but make it might destroy the unity of the parish, and result in causing an opening between the parish and a footing which appear present unanswerable.\n\nThat though this parish is comparatively poor and small being situated at a school and another school in the district and not supported by any society and that it indirectly receives great impulsion for the sake of your resident pastor.\n\nThat we the residents of this parish humbly pray your Lordship to take into consideration our petition into consideration.\n\nAnd your petitioners will ever pray.\n\nSigned in behalf of the members of St. Andrew's Church,\n\nChas Adams, Churchwarden.\n\nWm. Cuthbert, People's Warden.\n\nJames Murray, Surveyor.\n\nJos. Halcroon, Overseer.\n\nRobert Stevenson, Vestryman.\n\nWm. Robson, Church Steward.\n\nWork of the Mound Builders.\n\nInteresting Discovery of Relics at St. Andrews, Man.\n\nYesterday evening at St. Andrews C. N. Bell discovered the arrowhead workshops and pottery places of the Mound Builders, and secured 182 flint and other hard stones, also 100 arrowheads, some of which were very finely finished. He also brought back 27 fragments of earthenware, some decorated in a most extraordinary way, by impressions of a moulding, some being quite artistic in design and execution. Amongst other articles obtained were arrow points, stone hammers, making flint points, shell beads, small perforated earthenware tube like the stone arrow heads, and several broken points, flint limes for making arrow heads, etc. If there are any flint deposits in this country, they are not generally known. Some of the arrow heads are made from quartz almost transparent. The pottery seems to have been made by boiling decomposing granite and mixing it with clay, when it became a kind of baked. Several lamps of the granite used were found beside the broken pots. The fragments of earthenware were show plainly the granite with the clay. This is the first brick made of stone implements in this part of the country. It is interesting to find where the where the artisans of the Mound Builders used to sit and fashion implements and wax to exchange with those who inhabited and labored.\n\nSeeing the Serpent.\n\nA Monster of the Deep Creatures in Saskatchewan at a Quebec Watering Place.\n\nGreat excitement has been caused at the quiet watering place of Rie, Quebec, by the appearance of a sea serpent, which, from the descriptions given, must have been the giant of the gulf last year by the captain of the steamship Penhale, Capt. MacKenzie, H. A., of Montreal. The steamer was then lying at Rie, was out in the bay shooting wild geese with Mr. Wainey and Mr. Mackenzie, when what at first appeared to them to be a spar or mast of some wrecked vessel, came up out of the water. On reaching it, they were horrified to find that it was a monstrous creature, which on seeing the boat, raised its head out of the water, its eyes, glaring like the head lights of a locomotive, were the size of dinner plates, its mouth (it had no teeth) was the size of a houseboat, and with its open mouth filled with long, prong pointed teeth, it looked like a huge dragon. Mr. Mackenzie and Wainey discharged their rifles, and it is supposed their bullets fell off as streaks of blood were afterwards seen on the shore, several fishermen around the spot. The lashing of the creature was so violent, that it seemed to be quite impossible for the serpents to follow up the chase in a bark canoe. Its color was dark, dirty pinkish red, and its body, from the neck down to under the water, that it was over 100 feet long. When last seen it was making at rail road, and was said to be going towards the lake, where there is a large cave, which it is supposed to inhabit. This cave was the scene, about two weeks ago, of the massacre of over 100 Indians, who were refuge there and were discovered by their enemies and put to death. Means, Mackenzie and Wainey thought it best to send a party to capture the serpent, but as yet they have been unable to get the necessary means of transportation, as the inhabi tants are panic stricken.\n\nCanadian.\n\nThe Capital.\n\nToronto, Sept. 14.—Sir Charles Tupper has received a cablegram from the secre tary treasurer of the Manitoba Board of Agriculture inviting him to be present at the formal opening of the Provincial Exhibition in Winnipeg next month, but will not be able to be present at the Exhibition, but will be in Winnipeg earlier to attend the opening of the Exhibition, the importance of Manitoba being adequately represented at the Colonial Exhibition in London next year.\n\nThe Canadian Pacific and Canadian Pacific will unite in making a Manitoba exhibit at the Colonial Exhibition next year.\n\nJohn Tobin, who has been in charge of the Canadian Pacific exhibit in the North West since the 1st of March, has returned to Ottawa.\n\nToronto.\n\nToronto, Sept. 14.—Toronto beat the Princesses by 6 to 3.\n\nThe Maple Leafs got 6 runs to Toron toto's 3.\n\nJames Griffiths, of Buffalo, defeated Joseph Sinclair, of this city, in a three mile race the day before yesterday for five hundred dollars, by four lengths, time, 19 minutes.\n\nThe English cricketers versus Onta rion first match, was finished at 11 this morning by the Englishmen winning by an innings and 97 runs. The game was commenced after lunch and the English team made 225 runs in their first innings, while their opponents again by an innings and 97 runs.\n\nHardware!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine Plastering Hair, steam refined, Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. Johnson & Co.\n\nBuffalo Hall!\n\nSummer Stock Now Complete\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., Have been selected with the greatest care, while special attention has been given to the new line for our Grocery Department, consisting of An Elegant Line of Carmels, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Sodas, Fruits, Taffy Fingers, Lemon Creams and Iced Sultanas Make a choice addition to our well assorted line of GENERAL GROCERIES.\n\nFor a luxurious smoke we recommend Buffalo Hall.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBetts & Gwynne.\n\nO. E. Hughes & Co.,\n\nGeneral Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising Morton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also one car load Ogilvie's Flour,\n\nWhich we will sell cheap for cash.\n\nT. O. Davis\n\nO. E. Hughes & Co.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJust Received\n\nA Large Assortment of Room and Picture Mouldings.\n\nPictures Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885092501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 7885, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 10552, 1], [10552, 18806, 2], [18806, 24548, 3], [24548, 33792, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]