[{"id": "8aa7386a84a373dea8b33aadde90401434fd958b", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 13, 1888.\n\nLOCAL NEWS.\n\nA new White Sewing Machine for sale.\nThis is the best machine made and will be sold cheap. Walters & Baker.\n\nRossell & Davis have secured the contract for the steamer on the N.W. M. River and will be here shortly.\n\nThe Fisher family, who were here last month, are giving concerts in the town along with Mr. J. C. F. P., and are meeting with considerable success.\n\nA Northern Pacific passenger train was held up a few days ago by twelve men near the town of Red Deer, Alberta, in Montana. The passengers were relieved of their money and valuables in a flight to a ranch at Butte, Montana, and the men who held up the train, of Montana, accidentally fired his opponent, Jim Bates, thereby losing the stake of $1,000 although he had warned him of the danger.\n\nHis Lordship Bishop Grinnell arrived here on the 30th inst. and left for Fort Macleod on the 4th July. His Lordship has been absent from his diocese for over a year, during which time he has visited the United States in the interests of his church in the Territories. His Lordship has not been successful in his mission and has returned without having accomplished anything.\n\nAt the session of the Methodist Conference, just closed at Portage la Prairie, the question of the missionary relations to the work in Manitoba and North-West during the past year. Membership (2,000) the increase during the year being 1,500, the decrease being 500. The total contributions for all purposes reached $87,531. This shows an increase over last year of $16,000.\n\nTHE FIRE-PROOF QUESTION.\n\nIn an important one, but the question of protection against fire is one which should be considered. Mr. John McSwain, Model School teacher, Charles Town, P.E.I., says—“I enclose you $5 for the Fire Proof Question.”\n\nH. U. BAIN.\nPresident.\n\nCOMPLIMENTARY BANQUET\n\nD. H. Macdowall, Esq.\n\nA Public Banquet will be given by the Prince Albert Conservative Association of Prince Albert, to give Mr. D. H. Macdowall, M.P., the Queen’s Hotel.\n\nThursday Evening, July 19, 1888.\n\nTo which all are invited.\n\nTickets may be secured from\n\nH. U. BAIN.\nPresident.\n\nJ. M. KAY.\nSecretary.\n\nTENDERS FOR HAY.\n\nTenders will be received by the undersigned for the following quantities of Hay:\n\nAt Prince Albert 35 tons Hay\nAt Estevan 40 tons Hay\nAt Prince Albert 35 tons Hay\n\nTenders to be sent on or before July 15th.\n\nNo tenders will be accepted after July 15th.\n\nThe undersigned will pay cash for the hay delivered.\n\nD. C. McLellan & Co.\n\nLOOK HERE!\n\nW. SHANNON & Co.\n\nOur goods are noted for their fashionable shape and quality, and are sold at moderate prices.\n\nTrunks, Vaisselle and School Bags.\n\nFull lines of Ladies’ and Children’s Hose.\n\nTo be disposed of at low rates.\n\nWM. SHANNON & Co.\n\nBOOTS AND SHOES\n\nOur goods are noted for their fashionable shape and quality, and are sold at moderate prices.\n\nWestern Wear made and repaired.\n\nBy buying our goods you save at least 50c. on the dollar.\n\nCome in and see what we are doing.\n\nTHOS. ORAM\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nLarge quantities of freight are arriving daily.\n\nMr. H. Mitchell, of Duck Lake, has spent several days in town this week.\n\nA large lot of Hans, Spiced Roll and Sweet Rolls just received at Walters and Baker’s.\n\nMr. John Stewart and family are enjoying the boating season of the country, at their place near the lake.\n\nThe mail arrived on time this week and was the largest of the season so far, reaching the town on Tuesday morning.\n\nMr. Wm. Taylor has been spending a few days in the vicinity of the Swan Lake looking up a herd of cattle he has there.\n\nWe omitted to notice, last week, the departure of Mr. Angus McKay, who has been spending some weeks in town.\n\nHe has been stationed at Fort Pitt since the rebellion.\n\nTuesday last was one of the hottest days of the season. The thermometer stood at 101° in the shade, which is almost enough to make one sigh for a young Dakota blizzard.\n\nThe early opening movement, which was inaugurated last spring in Prince Albert, has proven extremely successful, and the citizens of the town do not have to be compelled by law—as in the east—to give their employees a little recreation after a hard day’s work.\n\nWe have received, through the courtesy of the Local Agricultural Society, a sample of the Kuklauska potato which was grown on Mr. John Stewart’s farm at Island Lake. It was seen on the fair grounds on Monday, July 9th, and will in four weeks or less time be ready for harvest. A sample of the potato was given to the members of the Agricultural Society at the fair grounds.\n\nWe have heard a few loud cries and shouts from the Kuklauska potatoes, and they will soon be seen on the market.\n\nThe most interesting exhibition of the kind of the Cane Indians on River Street last night was the alleged dance of the Cane Indians on River Street last night. About ten or twelve of them, consisting of young men and women, gathered around a fire behind a chief and chief in the center of the dance. They danced through some hay motions said to be a “devil’s dance.” Their dress and actions were enough to give even a teetotaler the idea. It can simply be described.\n\nThe Saskatchewan Rifle Association has been practicing every Saturday afternoon at 3 o’clock and he continued every Wednesday and Sunday afternoon until the 2nd August.\n\nThe members met at the same place.\n\nEach practice a silver spoon will be shot for. The Association will also provide for the marksmen who make the lowest score. At 3 p.m. of each practice day there will be a shooting range.\n\nA number of handsome cups and medals have been presented for competition.\n\nThe officers of the association are as follows: President, Mr. J. L. Johnson; Secretary, Mr. J. L. Johnson; Treasurer, Mr. J. L. Johnson.\n\nSend your white and gray cottons now selling for ten cents per yard. They beat any other cottons.\n\nSubscribers for your newspapers at Cassia’s Bookstore, Subscriptions received for all Canadian, American and Foreign Publications at 10¢ a copy.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. O. MAVETY\nFRIDAY, JULY 13, 1888.\n\nIt is to be hoped that the electors of the Saskatchewan District will turn out and do honor to Mr. Macdowall's representations at Ottawa. We have heard nothing from him since his departure, but we believe he has been doing good work there. Mr. Macdowall has done a great deal for this district and it is nothing but right that his political opponents as well as friends should do him honor by giving him a hearty vote.\n\nA large number of tickets have been issued, and we hope to see them all taken up; they can be had from Mr. Jas. McKay.\n\nTHE ASSEMBLY ELECTION\n\nThe final returns from the various polling divisions in Prince Albert District for the Northwest Assembly have been received and are as follows:\n\n| No. | Votes | Plaxton | Betts |\n|-----|-------|---------|-------|\n| 1   | 17    | 55      |       |\n| 2   | 15    | 17      | 28    |\n| 3   | 19    | 19      |       |\n| 4   | 16    | 10      | 28    |\n| 5   | 9     | 14      |       |\n| 6   | 12    | 10      | 28    |\n| 7   | 17    | 4       | 56    |\n| 8   | 21    | 21      |       |\n| 9   | 10    | 15      |       |\n| 10  | 11    | 6       |       |\n| 11  | 12    | 15      |       |\n\nTotal: 307\n\nThe successful candidates being Messrs. Betts and Plaxton. The official returns will be made to-morrow in the Council Chamber, and we do not think it will materially alter the foregoing statement. While we congratulate Messrs. Betts and Plaxton upon their election as representatives to the Northwest Legislature, we regret the defeat of Mr. Hughes for several reasons. Mr. Hughes is a man of undoubted ability, perseverance, and energy in anything he undertakes. He has been a faithful and trust-worthy representative of the N.W. Council for the District of Lorne during the past three years, and did all in his power to advance the interests and welfare of the district he had the honor to represent. From Mr. Hughes' thorough knowledge of the workings of the N.W.C., he would have been an excellent acquisition in the new Assembly. Had he been elected he would, no doubt, have been one of the advisers to the Lt. Governor. Mr. Hughes' defeat is attributable to two causes: first, that one that militated against him was not working himself; while the successful candidates canvassed hard for the position they attained, he did not canvass. Another cause was the lack of opportunity. Mr. Hughes was that he was a Government official, being sheriff. Had he resigned the shiryness no doubt he would have been one of the representatives of this district. Mr. Plaxton, who has resided in this district for a number of years, and is one of our best and most enterprising farmers, and we predict a very promising Northwest Assembly. Mr. Betts, whose election is attributable to the large vote he received where he was best known, is a young man; has occupied many important positions in our town since its formation. At present he is chairman of the Board of School Trustees. Mr. Betts is a good, clear, and effective speaker, and will be a great acquisition in the new legislature of the Territorial. For nearly ten years Mr. Betts has been one of our most successful business men. From his business ability, his energy, perserverance and attention to anything he undertakes, would make an able member of the Advisory Board to the Lieut.-Governor. Capt. Huey, who was also elected for the constituency, is one of the prominent citizens of this country, and is a successful and enterprising farming and will do honor to the district he represents. The contest between Messrs. Mitc- hell of Lake and Mr. Fisher of Batoche, resulted in the return of Mr. Mitchell by a majority of seventeen. Mr. Clunkaskill, the member elect for Battleford, was at the time a resident of Prince Albert when he was engaged in mercantile business, and from what we know of the gentleman, he is able to hold his own with the ablest of them.\n\nMANITOBA ELECTIONS.\n\n(By Special Telegraph.)\n\nThe election which took place on the 11th inst. in Manitoba has resulted in sustaining the Government by an overwhelming majority. Russell was returned from the constituency of Portage la Prairie, the Independent candidate.\n\nCONSTITUENCY. MEMBERS. MAJORITY.\n\nBattleford. Mitchell, 17, M'Leod, 17, 17.\nBatoche. Fisher, 17, Mitchell, 17, 17.\nBrandon. Crean, 17, Smart, 17, 17.\nCarberry. Graham, 17, Wilson, 17, 17.\nCarrollton. T. Galley, 17, W. Galley, 17, 17.\nCarter. West, 17, Smith, 17, 17.\nDempsey. Reid, 17, Reid, 17, 17.\nDenison. Thompson, 17, Young, 17, 17.\nEmerson. Norquay, 17, Con. 2.\nErin. Dicken, 17, McKeever, 17, 17.\nEstevan. LaTourneray, 17, LaTourneray, 17, 17.\nFort Garry. Wilmot, 17, Wilmot, 17, 17.\nGlenboro. Greenway, 17, Greenway, 17, 17.\nGravelbourg. Martin, 17, Martin, 17, 17.\nGravelbourg. Thomson, 17, Jackson, 17, 17.\nGravelbourg. Harrower, 17, Harrower, 17, 17.\nGravelbourg. Dunlop, 17, Dunlop, 17, 17.\nGravelbourg. Morton, 17, Morton, 17, 17.\nGravelbourg. McMillan, 17, McMillan, 17, 17.\nGravelbourg. Campbell, 17, Campbell, 17, 17.\nGravelbourg. Morton, 17, Morton, 17, 17.\nGravelbourg. Fordergast, 17, Fordergast, 17, 17.\n\n$9,999! IN GOLD TO BE GIVEN AWAY\n\nWe will pay by mail post paid, upon receipt of 10 cents Canadian or 12 cents American postage stamps any one of the following:\n\nCollection No. 10 — 4 Germanias; 4 choice kinds.\n\nCollection No. 11 — 4 Carnations; 4 choice kinds.\n\nCollection No. 12 — 4 Colours; 4 choice kinds.\n\nCollection No. 13 — 4 Fushias; 4 choice kinds.\n\nCollection No. 14 — 4 Heliotropes; 4 choice kinds.\n\nCollection No. 15 — 3 Ivy Leaved Geraniums; 3 very choice kinds.\n\nCollection No. 16 — Begonias; 4 choice kinds.\n\nCollection No. 17 — 3 Tricolor Geraniums; 3 very choice kinds.\n\nCollection No. 18 — 5 Pansies.\n\nCollection No. 19 — 6 Verbenas.\n\nCollection No. 20 — 3 Choice Plants for every culture.\n\nAll letters containing stamps enclosed for plants as appointed above will be numbered in the order received, and the plants will be sent by bell, in red boxes across the face of the label. Return of containers, refuse all substitutes. Price 25 cents per bottle.\n\nDAVIS & LAVERYCO (Limited), MONTREAL.\n\nHORSE SHOE STORE\n\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\n\nFifty Chests Choice Congo Tea\n\nWhich we will sell until further notice at 5¢ per lb.\n\nFresh importations in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\n\nFull Lines of Windowcurtains\n\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\n\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC\n\nBOOTS AND SHOES ARRIVING WEEKLY\n\n10,000 CHOICE CIGARS!\n\nAt Manufacturers' Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS\n\nIN SEIGE, LINEN, ETC.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\n—-\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed uitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books.\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\n\nCATALOGUES FREE.\n\n\" BELL \"\n\nORGANS\n\nUnapproached for Tone and Quality.\n\nSend us a list of wants, and we will quote prices.\n\nAddress all letters to\n\nJ. LAMMER & CO., NURSERYMEN, TORONTO, CANADA\nST. ANN'S CONVENT.\n\nThe Third Annual Distribution of Prizes\n\nOn Tuesday, the 24th inst., the third annual entertainment and distribution of prizes in St. Ann's Convent took place.\n\nThe following day there was a large number of invitations, not only to teachers and guardians of the students but to a great many others, and a very considerable turn out resulted.\n\nThe programme was long and varied, consisting of vocal and instrumental music, dramatic dialogue, pantomime, and performances, all of which were nobly presented by the young lady pupils. The entertainment was very interesting and captivating, and was presented with an address, after the programme, by the Principal, which was well and ably read by Miss Macdonald.\n\nThe presentation of prizes was then proceeded with, a list of which is as follows:\n\nMiss Alice Hovis—1st for general conduct and application; 3rd for English studies and oral history, 2nd class; 1st for composition, 2nd class; 3rd for French, 2nd class; 1st for music, 2nd class.\n\nMiss Hay—1st for conduct; 3rd for needlework, 2nd for drawing; 1st class, 1st prize.\n\nMiss Mary MacDonald—2nd for conduct; 1st for arithmetic; 3rd for French, 2nd class; 3rd for composition, 4th class.\n\nMiss Ernesta MacDonald—1st for English studies; 2nd for French; 3rd for drawing; 1st class.\n\nMiss Hurst—1st for conduct; 3rd for music; 2nd for composition; 4th for English studies, 1st class.\n\nMiss Horn—1st for French; 2nd for English studies; 3rd for composition; 4th for music; 6th class.\n\nMiss Murray—1st for French; 2nd for drawing; 3rd for composition; 4th for English studies; 5th class; 6th for needlework.\n\nMiss Neill—1st for oral history; 3rd for music; 2nd for religion; 4th for composition; 2nd class.\n\nMiss Stott—1st for conduct; 3rd for composition; 2nd for French; 4th class; 3rd for drawing; 1st class.\n\nMiss Weir—1st for conduct; 3rd for music; 2nd for composition; 4th for French.\n\nMiss Wood—1st for English studies; 2nd for French; 3rd for composition; 4th for music; 6th class.\n\nMISS STOTT—2nd for conduct; 3rd for composition; 4th for English studies; 5th class; 6th for French.\n\nFour special prizes were awarded as follows:\n\nMiss Stewart—1st for conduct and application; 3rd for French; 2nd for English studies; 3rd for composition; 4th for music.\n\nMiss Wilson—1st for French; 2nd for composition; 3rd for music; 2nd for drawing; 1st class.\n\nMiss Whitehead—1st for English studies; 2nd for French; 3rd for composition; 1st class.\n\nMiss Young—1st for French; 2nd for composition; 3rd for music; 2nd class.\n\nNotice—A Dead Drop! On Prices at J.M. Campbell's.\n\nFirst Class Goods.\n\nSilk Ribbons!\n\nEvery Night I SCRATCHED\n\nUntil the Skin was Raw. Body covered With Sores and Ulcers, Cured by CUTICULA Remedies.\n\nI am going to tell you of the extraordinary results obtained on me by using these remedies in about a week in April last. I suffered from severe skin eruptions of the most excoriating description, for four months at least. The pain became almost unbearable and I could hardly get up. If I got up I had to sit down again. The pain was so severe that I could hardly move my limbs or feet. Finally I went to see a doctor and he said it was a skin complaint. He prescribed some medicines which did nothing whatever. So I decided to try the Cuticula Remedies. I used them every night for about a week and then I began to feel a little better. After two weeks I felt much better. Now I am perfectly cured. For more details apply to Mr. Cotey.\n\nFOR SALE.\n\nALEX. LOUDOUN,\nSec.-Treas.\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alt.\nMahaffey & Clinkskill,\nBattleford, Sask.\n\nNOTICE\n\nWoodman Bros are dissolving partnership. All parties interested are respectfully requested to present their accounts before the 20th instant. Those who may be desirous of selling goods will be informed by writing to the undersigned when such goods will be placed in solicitor's hands.\n\nThis notice is given in the business of the Wichita Saloon.\n\nJ. Woodman\nHARRY WOODMAN.\n\nWOODMAN BROS\n\nDissolution of Partnership.\n\nwoodman knitwear and Relief asked for the sum of $480. That was granted.\n\nThe resignation of D. D. Hamilton, as collector, was accepted.\n\nDavid Williams was appointed Lice Inspector.\n\nThe license Inspector was instructed to levy fines against those who did not pay.\n\nThe Council then adjourned until Friday night.\n\nSILK RIBBONS!\n\nThose of our lady readers who wish to have some fine silk ribbons (extra fine, assorted Ribbons (by mail), in different widths and all the latest fashions, direct from our wholesale ribbon factory at Dundas, Tenn., Messrs. Straw, Neckwear, Scarfs, Trimming, Wash Bags, Fine Toiletries, Etc., etc., can get an astonishing big bargain.\n\nAddress the Sales Manager, to wholesale Ribbon Manufacturing Co., by name and address, as we cannot give along side.\n\nSilvery soft, this house will give double the amount of any other in America. I will send the names and addresses on a good commission. I am ordering and selling the same colors and fabrics as we do. Satisfaction is guaranteed, or money returned.\n\nTELEGRAPH TO NEW YORK,\n\nCall and Examine Our Stock.\n\nNEILSON & McBEATH\n\nJ. DOULITTLE,\n\nMOORE & MACDONALD\n\nQUAPPELLE STATION.\n\nAgent for the sale of A. BAERES, Sons & Co. Ltd., Farm implements and Machinery.\n\nBradford Light binders, Bradfield Mowers, Perpetual plows, Naftali gang plows, Breaking and Cross Plows, Threshing machines, Batia wagons, Binding twine, etc.\n\nWarehouse opposite Queen's Hotel.\n\nNESTELLE'S\n\nSWISS MILK.\n\nPREPARED IN SWITZERLAND.\n\n\"The Richest in Cream.\"\n\nHalf quart samples sent free. Orders on receipt answered by e-mail.\n\nOS. LEEMING & Co., Montreal.\n\nANY MAN\n\nWho is weak, nervous, debilitated, thin, lacking color, full of weakness, deficient in vigor of body, mind and spirit? Look up the latest remedies—NEW TREATMENTS—GREAT RESULTS—OUTLAWED DISEASES—HEADACHE, RHEUMATISM, FATIGUE, PILES, SCARLET FEVER, DIARRHEA, COLIC, CYSTitis, CATARACTS, DYSPEPSIA, PARALYSIS, DELIRIUM TREMENS, RHEUMATISM, NERVOSIS, INSOMNIA, DYSPEPSIA, ANGINA Pectoris, ARTHRITIS, GOUT, TUBERCULOSIS, BARTONITIS, LYMPHADENITIS, SCABIES, MALARIA, MEASLES, MASTOIDITIS, SYphilis, VARIOUS COMPOUNDS—LAW PERMITTED—EACH REMEDY—FREE SAMPLES ON APPLICATION—SEND FOR BOOK FREE.\n\nThe pattern of a New Panacea. We offer a sample on receipt of twenty-five cents.\n\nF. D. CLARKER, M.D.,\n100 MacArthur Ave., Chicago.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888071301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 5586, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6084, 1], [6084, 13695, 2], [13695, 20084, 3], [20084, 20084, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]