[{"id": "395d03a61c9897e89c4e594894bfaaf3a1a4df6e", "text": "THE PRINCE ALBERT TIMES\nWEDNESDAY, FEBRUARY 21, 1883\n\nTHE BEST POLICY\n\nMr. Macleay Hill, M.P., struck the right key in his remarks during the discussion that ensued at the close of the Bishop of Saskatchewan's address delivered before the members of the Colonial Institute in London in the month of December last. He spoke of the North West Territories more than once, and was, therefore, in a position to speak from actual observation and from personal knowledge. He has had a very great deal to do with the matter of emigration, and knows, probably, as much as the next man of the wants and condition of the laboring classes in England, and, consequently, anything he may say on the subject of emigration will be considered valuable. In contrasting the life of the laborer in England with that in the North West, Mr. Hill is quoted as saying: \"I have been here for two autumns out in the North West. We see there the struggle in farming for the laborer who goes out there to settle. He loses there much that he has gained in England. The laborer in England looks to his landlord and his master to feed and house him; but that he does not do. He has no school for his children, and help in sickness, misfortune and old age. Out there, there is no one to look to but his own strong back and his own right hand. If they are strong enough, and his heart will be good enough, he can make for himself a home; but do not let us persuade laborers to go out there by telling them it is a Paradise in which they will achieve easily a competency. It is only if they are willing to bring to bear the greatest energy and the highest power which a laborer can bring to bear upon the matter of their nature that he will be able to secure to himself a competency. Without that, starvation, penury, and every one of the worst maladies in their worst form which can fall upon the human race will be the lot of the North West. With strength and energy we shall achieve happiness; but unless he can make up his mind to go to work with the utmost power that lies in human nature he had better stay at home.\" Now, we believe he was mistaken or misunderstood. It is neither our desire nor intention to say one single word in disparagement of this great North West country. It is not our province to invite emigration between the old country and the older provinces, but we say, and must conscientiously say, that honesty in speaking of the country will be found to be in the best policy. The man who has been deterred in coming to the North West will, if he returns home, otherwise by letter, work more mischief than we want of. Far better would it have been if he had seen the disadvantages as well as the advantages had been pointed out to him, and himself left the one to decide as to his future. The Settlement of Prince Albert has, we venture to say, been most favorably and systematically written up, than any other portion of the North West Territories. And yet we fear, and we hesitate not a little in expressing the fact, that the whole deal has been said and might have been better explained. The good intentions mentioned in the Settlement cannot be gainsaid, but isn't it just possible that the coloring has been overdone? Isn't honesty the best policy after all? While we firmly believe in the future of this great country and this settlement we cannot overlook the points we have touched upon. If emigrants are disposed to come to the North West their future homes is not likely that any extremes of heat and cold are going to stop them. There is no need for exaggeration in the matter. If the soil and the climate are all that we are told they are, and there is no disputing either the fertility of the soil or the salubrity of the climate, what need is there for untruthfulness about other matters in connection therewith? We believe that every reasonable person will agree with us, that the policy which we have, perhaps imperfectly, attempted to impress upon our readers will be found to be the best policy also, and that it will result in promoting the prosperity, condition and progress of the country in the future than any misrepresentations could possibly effect.\n\nEDITORIAL NOTES\n\nWe regret that no move has yet been made for a meeting to discuss the views and means for a telegraph line to be extended to the North West. We think it a matter of great importance to delay the matter. Before the snow is off the ground the poles ought to be distributed along the route so that when spring comes much time would be saved. We are rather afraid a telegraph line will not be laid by all means here by the telegraph. Who will move in the matter?\n\nThe address delivered by the Bishop of Saskatchewan before the members of the Colonial Institute in London has been in this country read with a great deal of interest, and the assurance on the occasion that the joint interest that is taken in England in anything pertaining to the North West Territories while engaged in his noble mission abroad the Bishop never fails to say a good word for the North West. In whatever part of the world he is immediately enthusiastic, and has invariably reason fails to carry conviction to his hearers. It is gratifying to know that he has been eminent successfully in his avowed object thus far.\n\nCURLING\n\nThe meeting at point for the Royal Canadian Curling Society was attended very splendidly on Saturday last by the members of the Saskatchewan Curling Club, who played a game which was maintained throughout. The match was won by Mr. George T. Brown in playing for the Blue. The following is the score:\n\n| Team | Score |\n|------|-------|\n| Blue | 10 points |\n| Red  | 9    |\n\nJ. D. Johnson was out to St. Lawrence last week, and reports the roads are good. Jackson & Jackson are a first-class set of curlers, and five years' hard training.\n\nThere is promised to be a big rush among the curlers to procure winning tickets for the annual meeting of the club.\n\nThe social hall in the Methodist church was filled to overflowing yesterday afternoon. The first hour was spent in parlor talk of the ample supply of refreshments. After dinner the evening session was opened by Mr. John F. Halle who was called to the chair, and in his opening speech gave an interesting programme of songs, recitations and speeches which put the audience into a fine humor, some of which had been almost sufficient for the organ. Was then sung by the ladies, followed by the chairman. After the National Anthem had been sung and the benediction pronounced, the party dispersed, all highly satisfied with the evening's amusement.\n\nWALTERS & BAKER.\nGeneral Merchants,\nPRINCE ALBERT, N.W.T.\n\nHORSE SHOE STORE,\nRIVER STREET.\n\nA month's work done, John comes to buy a suit of clothes. His friend went to the Horse Shoe Store, and got his thirteenth dollar. He came out in a well made suit. Before he could stand up, his friend, his clothes all played out. He soon shall want some more. Next time he strikes the town he'll go to the Horse Shoe Store.\n\nBoots, Shoes, Mocassins\nUnderclothing, Shirts,\nDry Goods, etc. etc.,\nAll and everything at the same reduction. Give us a call.\n\nTHOMAS O. DAVIS.\nCARD\nTo the Electors of the District of Lorne.\n\nGENTLEMEN:\nI consider it my duty to inform your Excellency that I am now residing in the North West Territories, and have been there continuously for several months, and have had many opportunities to observe the character of the North West Country, and take this opportunity to thank you heartily for the esteem and confidence reposed in me by your members.\n\nYours respectfully,\n\nJ. L. JOHNSON & CO.\nHere on hand a full stock\nContractors' Supplies.\nChopping Axes.\nHudson Bay Axes,\nCross Cut Saws,\nAxle Handles, etc.\nSpecial prices to contractors.\n\nCAMPBELL'S BLOCK,\nTHE GABLE HOUSE.\n\nTHE BEST\nBEER AND CIGARS\nOf the Finest Brands always on hand.\n\nWHEELMANS AND RETAIL\nJOHN WYNEKIRCH, PROP.\nPUMPS!\nFrom Pump Factory.\nWoolen and Pump Co.\nAcorn & Cross,\nGeo. McKay and Victoria Streets,\nPRINCE ALBERT.\n\nPRINCE ALBERT,\nGENERAL MERCHANTS,\nSTEWART & WOOTTON,\nN.W.T.\n\nR. B. WAY,\nPotatoes.\nPotatoes.\nIn hand and for sale. Potatoes in late whitestone and finest.\n\nTAYLOR AND BARBER\nCall on Scotty, the Tailor, for Your Clothes.\nFit Guaranteed.\nCutting a Specialty.\nHair Cutting and Shaving.\n\nJAMES SCOTT,\nGABLE HOUSE,\nPRINCE ALBERT.\nSEE HERE!\n\nA. L. ASHDOWN\n\nThis just received, in addition to his already extensive stock of Groceries, the following:\n\n| Item                  | Description                          |\n|-----------------------|--------------------------------------|\n| Canned Beef           | California & other Canned Fruits     |\n| Lunch Tongue          | Dried Peaches                        |\n| Brown                 | Evaporated Peaches                   |\n| Cod Fish              | Dried Pears                          |\n| Herring               | Dried Pumpkins                       |\n| Sardines              | Dried Apples                         |\n| Fresh Oysters         | Evaporated Apples                    |\n| No. 1 Butter and Cheese | Fitted Cherries, etc.                |\n\nBlack, Japan and Young Hyson Teas,\nGround and Whole Java Coffee,\nA large stock of Toilet Soaps,\nCompressed Vegetables,\nSpices of all kinds,\nTobaccos and Cigars,\nWooden Ware,\nLamp Glasses, etc.\n\nPlease now on hand the best stock of Groceries ever offered to the people of Prince Albert, which I will sell at bottom prices. Give us a call.\n\nA. L. ASHDOWN\n\n1879. 1883.\n\nAs a proof that close buyers are alive to their interests, and that we practice what we advertise, our store has been thronged with customers during the past week, more people being served than during any one week this season.\n\nGRAND ANNUAL CLEARING SALE!\n\nSTILL GOING ON AT BUFFALO HALL\n\nOur business improves every month.\n\nCAUSES:\n\nReliable goods sold at fair profits, and advertising facts only.\n\nBETTS & Gwynne.\n\nT. N. Campbell,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883022101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2407, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8322, 2], [8322, 8322, 3], [8322, 10133, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]