[{"id": "12310388713717525893b52b6b1f9bc02f52fe6d", "text": "THE PRINCE ALBERT TIMES\n\nWEDNESDAY, DECEMBER 13, 1882\n\nDISALLOWANCE\n\nLate Manitoban papers are filled with articles, more or less violent, on the subject of the disallowance by the Dominion Government of the Railway Charters passed by the Manitoba Legislature at its last session. Some of these contain secession and rebellion, independence or annexation; but these expressions doubtless have been hastily used in the heat of the discussion of an exciting subject. One thing is certain, that public opinion is aroused to the highest pitch, and is unanimous on the part of both Conservatives and Reformers, in the determination to resist the Provincial effort to restrict and maintain the independence of the local Legislatures.\n\nWhat intensifies the feeling just now is the fact that the Legislature has been dissolved and generally elections probably event now going on. The leaders of neither political party venture to justify the recent action of the Dominion Government, but the address of the Hon. Premier, Mr. Norquay is not so unanswerable on this point as it might be. The last straw was the disallowance of the Emerson and North Western Railway Charter. This has raised the popular feeling to fever heat, and at an indignation meeting held in Emerson lately, some pretty strong language was used and a delegation was appointed to go to Winnipeg to remonstrate against the action of the Government. Mr. Norquay, it appears in his speech at that place, some time ago, pledged himself to resist, that is, to get a bill introduced at Ottawa to prevent that the people of Prince Albert and the North West generally insist upon their right to a weekly mail, and allow no other once. They will put off on one pretext or another long enough, and they will not stand it any longer. It is a crying shame that whilst other parts of the Dominion have their railroads, telegraph, post offices, etc., the North West Territories should be left without a mail once in three weeks. It is not dealing fairly or justly with this important question of the people of the North West. If the Government expect to retain the support and confidence of the people of those Territories, they must honorably fulfill their obligations and promises both in regard to this matter and also in regard to those other grievances which we particularly specified in our last issue. It is not fair to the present contractor either, nor can it be expected that he will be efficient when faced with the accumulation of three weeks mail matter to forward. This last mail was three days behind hand and we believe it will be before long that the \"fans\" cannot be satisfied in the way they propose to do it. Any pretension of farmers making, and at best but bad pretence, will only make matters worse.\n\nWe have already said that time and again, the people have yet made display of rebellion, and no disposition toward either independence or annexation has been shown. We have heard and seen nothing here and there may have dropped a hasty word in these directions, but the hearts of the people is sound and true to our present Dominion relationship. But if anything can shake our feelings and awaken the spirit, it is the thought that the rights and privileges which we are being deprived of are being adopted in quartered quarters. We stand on our own feet. That is all. We rely on the kindness to investigate the true state of the case, possibly they would come to see that the best mode of quitting the \"fans\" would be to repair that wrong.\n\nTHE MAIL SERVICE.\n\nWe were much disappointed that no word was received by the last mail as to the immediate prospect of a weekly mail between Prince Albert and Qu'Appelle which we were led to believe had been accomplished. As the first issue of our paper we published a letter from Mr. J. T. Taylor, Capt., and Hon. D. M. Hambly of Manitoba, who had interested themselves in the matter, stating that we could depend upon getting a weekly mail shortly, and that the contract for future years was in the hands of the Minister, who had informed him that a contract had been entered into at a yearly cost of over $3,000. Nothing could be more desirable than this, and we could not lose imagination as to what it was. We understand that a letter was received by the Postmaster here, from the mail contractor at Qu'Appelle, stating that he had heard nothing of the promised mail, and that he did not believe that it was going to take place, at all events for some time to come. Now it is just as well for the Government and Post Office authorities at Ottawa to remember that the people of Prince Albert and the North West generally insist upon their right to a weekly mail, and allow no other once. They will put off on one pretext or another long enough, and they will not stand it any longer. It is a crying shame that whilst other parts of the Dominion have their railroads, telegraph, post offices, etc., the North West Territories should be left without a mail once in three weeks. It is not dealing fairly or justly with this important question of the people of the North West. If the Government expect to retain the support and confidence of the people of those Territories, they must honorably fulfill their obligations and promises both in regard to this matter and also in regard to those other grievances which we particularly specified in our last issue. It is not fair to the present contractor either, nor can it be expected that he will be efficient when faced with the accumulation of three weeks mail matter to forward. This last mail was three days behind hand and we believe it will be before long that the \"fans\" cannot be satisfied in the way they propose to do it. Any pretension of farmers making, and at best but bad pretence, will only make matters worse.\n\nWe have already said that time and again, the people have yet made display of rebellion, and no disposition toward either independence or annexation has been shown. We have heard and seen nothing here and there may have dropped a hasty word in these directions, but the hearts of the people is sound and true to our present Dominion relationship. But if anything can shake our feelings and awaken the spirit, it is the thought that the rights and privileges which we are being deprived of are being adopted in quartered quarters. We stand on our own feet. That is all. We rely on the kindness to investigate the true state of the case, possibly they would come to see that the best mode of quitting the \"fans\" would be to repair that wrong.\n\nMISS MACK & CO.,\nRIVER STREET.\n\nJ. SINCLAIR,\nMERCHANT TAILOR.\n\nI have just received my New Goods and I am now showing the finest selection import-\ned to Prince Albert.\n\nA Full Line of French, English, Irish, Scotch and Canadian Tweeds.\nEnglish and French Worsted Beavers and Chesterfield Overcoats.\nDress, Lining and Serge Shirts.\nMen's Underclothing a Specialty.\nFor Caps, Gloves and Mits.\nStocks and Stockings.\nCall at No. 45 Main Street. Ready-made Clothing, Cheapest in Town.\nOrdered Clothing Guaranteed. Suitable for all occasions.\nA Good Fit Guaranteed.\n\nJ. SINCLAIR, Merchant Tailor.\n\nHardware!\nChains,\nRope,\nGlass,\nBroad and Chopping Axes.\n\nSHELF HARDWARE\n\nThe inside of the Church is being newly painted for Christmas. The paint was given by the Rev. Canon Flett. The farmers are now getting their threshing done. The crops are turning out very well.\n\nAt a meeting of Kinmonth Lodge, U.D., A.F.A.M., G.R.M., held in the Masonic Hall, Prince Albert, Nov. 1, 1882, the following officers were elected:\nW.M.: Rev. Thomas J. Agnew, S.W.: Hon. Henry Benson, S.W.: Mr. H. H. Charlesworth, Tho. E. Baker, Treasurer; Rev. J. F. Kennedy, Secretary; Rev. Wm. Brewer, Tyler.\n\nLowest Prices.\n\nJ. R. McPhail, STEWART & WOOTTON\nCLAIM JUMPING.\n\nThe regulations which require a man to be away from his homestead more than six months without leave of absence from the Minister of the Interior, has given rise to a great deal of claim jumping in this neighborhood of late. Some hardship may arise from the regulations in some cases, yet there is no law in the country itself. It is scarcely fair that a man should go out and find work which he never intends to improve. If he wants land he should by all means apply for it under the regulations. Yet the claim jumper is very often no better than the claim taker. If a claim may be taken for speculative purposes, why not also for the purpose of raising crops? We would suggest that the regulations be so amended that the party who cannot prove his residence should be cancelled, as evidence of good faith, be allowed no leave of absence, but be compelled to remain upon his homestead from the date of entry.\n\nTHE CASE.\n\nRemandment for the Attempted Murder of a Child.\n\nHillsboro, Oct. 15.—Mr. Justice McDonald delivered sentence today in the case of Daniel Doyle, convicted of attempting to murder a child under twelve years of age. The prisoner was remanded until the 26th inst., when he will be sentenced. The judge called on the prisoner to stand up and he briefly addressed him to the effect that the crime was not worth the life of the victim, and had found him guilty. One was revolving in his mind that the prisoner had not only been found guilty, but had been found by the jury he entirely concurred. It was now his duty to punish him accordingly. He had no creditable information that the prisoner's whole life had been that of an incorrigible man on whom public trial, for his crimes, had been brought to an end. As he seemed callous to the voice of shame, and as the crime of which he had been convicted was of the most serious nature, he (the judge) would try if his feelings could be reached in another way, and apply a check to the prisoner's way. He then sentenced the prisoner to be imprisoned for the period of one year, with hard labor, and receive twenty lashes on the bare back.\n\nTHE CANADIAN NORTH WEST.\n\nAt Ottawa, October 13th, 1882, an order in Council was issued dividing the great North West Territory, beyond the confines of Manitoba, into four new districts, each to have its own separate Territorial Government. The new names and locations are as follows: Assiniboia, containing about 120,000 square miles, bounded on the north by the international boundary, on the east by the western boundary of Manitoba, on the south by the line traced between 110 and 111 west longitude; Saskatchewan, containing about 110,000 square miles, is bounded on the north by Assiniboia, on the east by Lake Winnipeg and Nelson Lakes, on the north by the line drawn 55° latitude, and on the west by a combination of lines making that boundary of the previous district—the northern boundary of Saskatchewan being bounded on the south by the international boundary, on the east by Assiniboia and Saskatchewan, on the west by British Columbia, and on the north by the continuation of the line bounding Saskatchewan and Athabasca, containing about 120,000 square miles, bounded on the north by Alberta, on the west by British Columbia, on the south by the line bounding British Columbia, and on the east by the line which intersects Athabasca River, then by Lake Athabasca, and following Peace Lake and the Rocky Mountains, which forms the northern boundary. The new Saskatchewan district includes Battleford, Carberry, Prince Albert, Assiniboia, Athabasca, Fort Macleod, Saskatchewan, and Athabasca Rivers and Forts Macleod and Athabasca. It comprises the fertile, well watered, and easily irrigated district of Athabasca taken by the celebrated Pierre Radisson, and now known as the North-West. The Great Bear Land will have the effect of extending the boundaries of the district very considerably, and probably, by having such a capital amongst, it will become a center for settlement more central than the British Columbia or British Columbia.\n\nFor many animals from the British Museum, London, England, have been obtained at a cost of one hundred pounds sterling. The Prince Albert takes the lead.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information and reports to these lands will be given at the offices of the Company, Winnipeg and Toronto.\n\nC.J. FRYDES, Land Commissioner.\n\nSTOBART, EDEN & CO.,\n\nGeneral Merchants and Indian Traders.\n\nSeven Cases of Fancy Goods\n\nLadies', Girls' and Children's Underwear,\n\nBall Dresses,\n\nLadies' Mantles and Paletots,\n\nLadies' and Maids' Winter Jackets,\n\nLadies' and Maids' Costumes,\n\nAnd other articles too numerous to mention.\n\nCall and see our new stock at the old store, which everybody knows.\n\nGRAND WANTED.\n\n3,000 Bushels of Grain\n\n(OATS AND BARLEY).\n\nHighest cash price paid for good grain.\n\nApply to\n\nJOHN WYMERSKIRCH,\n\nPRINCE ALBERT,\n\nN.W.T.\n\nTHE CABLE HOUSE.\n\nTHE BEST BEER AND CIGARS\n\nOf the Finest Brands always on hand.\n\nWHOLESALE AND RETAIL.\n\nJOHN WYMERSKIRCH, PROP.\n\nPRINCE ALBERT\n\nFURNITURE STORE\n\nQ. CARTER & SON\n\nWould intimate to the people of Prince Albert and the surrounding country that they have opened a store at the Ridge, where he will keep a full stock of\n\nBEDSTEADS,\n\nCUPBOARDS,\n\nLOUNGES,\n\nTABLES,\n\nAnd other heavy furniture.\n\nUpholstering and other work done to order.\n\nThey have a large stock coming by rail.\n\nC CARTER & SON,\n\nPRINCE ALBERT\n\nWATCHES,\n\nCLOCKS AND JEWELLERY\n\nIn every style.\n\nBest Joseph Rogers & Sons.\n\nCUTLERY!\n\nSPOONS AND FORKS!\n\nR.B. WAY,\n\nPost Office, Prince Albert, N.W.T.\n\nNOTICE\n\nNotice is hereby given that applications have been made at this office for the purchase of land in the Prince Albert District, and that the same will be sold by the Government of Canada at public auction. Applications may be made at the office of the Postmaster General, Prince Albert, N.W.T.\n\nSPINK & MAVEETY,\n\nPROPRIETORS.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which unfortunately, was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\nTHE LICENSE QUESTION.\n\nThis vexed question is exciting a great deal of attention in the Province of Mani-\ntoba, and before long will have to be met\nand dealt with in the North-West Terri-\ntories. The subject of absolute prohibition,\nhas not been brought before our Legisla-\ntures, but there can be little doubt\nthat the experiment of such a communi-\nty where there has been tried, the proof\nthat it cannot be successfully carried out. The\nattempt to do so has only led to every\nactivity being employed in connection\nwith the introduction and use of deleterious\nessences and extracts which are far more\nharmful than the consumption of the\nuse of unadulterated liquors. Such being\nthe case it becomes a serious question\nwhether a well regulated and properly\nguarded system of licenses would not be\nbetter for this country, now that it is be-\ncoming so thickly settled and accessible\nfor the purpose of the present law which\nwas designed to regulate the habits of\nthe Indians.\n\nIn conclusion we may say that a\nwell and well written article by the second\nmember of the Winnipeg Commis-\nsion, and not by the way, a well conduct-\ned trial would be desirable.\n\nThe extension of a Liquor License\nLaw to the North-West Territories is likely soon\nto be discussed by Parliament. The\nTerritory of the North-West, the\nIndian residents of that part of the lakes,\nhave been subjected to a great deal of\nwrangling over the question of licenses\nwith Premier Neepay on the subject, and some have complained\nof the manner in which the well regulated\nsystem of licenses will work in the North-\nWest.\n\nSince the question has been raised\nin Parliament reports of any increase in\ndrunkenness have been received here,\nand it is very probable that the territo-\nrial government will make some changes\nabout its license laws. People in the\nNorth-West are becoming very suspi-\ncious of the intentions of John\nNeepay's party that \"prohibition\" will\ncome soon by Act of Parliament. If\nit does come, as has been hinted at by Acts\nof Assembly, it will be a great blow to\nanyone who resides in the North-West, as\nit will certainly be extremely difficult\nto find any place to obtain liquor. It\nwill also be very difficult to get any\nlicenses, by reason of a law which was\naimed to regulate only the habits of the\nIndians, but which will affect everyone\nwho resides in the North-West. It is\nnot possible to imagine how anyone\nwould be able to get a license under\nsuch circumstances.\n\nPRINCE ALBERT\n\nLAVING MILLS AND\nSASH AND DOOR FACTORY,\nDOORS, SASH, &c.\nKeep constantly on hand, good quality\nwooden doors, sashes, etc., etc.\nGOODFELLOW BRO'S.\nW. J. CARTER,\nBuilder and Contractor.\nAll Orders Promptly Attended to\nPlans and Estimates fur-\nnished when required.\n\nHEINTZMAN\nAND\nCOMPANY,\nPiano Manufacturers,\n117 KING-ST. WEST,\nNEXT ROSSIN HOUSE,\nTORONTO, ONT.\nPianos to Suit the Climate of\nthe North-west.\n\nALL MADE OF THE BEST MATERIAL\nAND FINISHED IN FIRST-CLASS STYLE\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nFirst-class Workmen Employed in\nTheir Manufacture.\n\nAPPLY AT\n\"The Times\" Office.\n\nPRINCE ALBERT - N.W.T\nTOWN NEWS.\n\nInmars in the Confederation Life Association.\n\nThe skating party on the river will soon be ready for its skaters.\n\nThe Billiard and Pool Tables of J. O. Davis, arrived on Saturday; no more dull nights for the town.\n\nA new dry goods store would be very acceptable at this point. At present we have only one store, Mr. Stewart & Wootton.\n\nMr. D. A. McGregor has started a barber shop in the brick store at the Mansion House, give him a call.\n\nMr. T. R. McLean has removed his drug store down to the Mansion, where he can now be found in his new building.\n\nWe regret to announce the death of Mr. Goddard of Fort La Corne, who with his family is in town visiting friends.\n\nSanta Claus has arrived at the Hotel & Co., where he has been selling a share of his wares.\n\nCall early and get your share.\n\nGentlemen, leave your wives happy when you die by insuring in the Confederation Life Association. A. W. E. Macdonald.\n\nJ. O. Davis, the popular traveller for Jan. O'Brien & Co., wholesale drapers of Montreal, has visited every store in town this week, and did a good business.\n\nThe auction sale of lots in the Town of Hamilton was held last week at the Town Hall. On Saturday evening there was a great success. Over 100 lots were sold, at an average price of $25. Harry Keenan acted as auctioneer.\n\nThere will be no starvation next spring.\n\nJ. O. Davis & Co. have opened a very heavy dry goods and hardware store and have extended their business by opening a store at the South Branch, Mr. W. Fish has been appointed manager.\n\nThe following register was kindly furnished by George Duff, Esq., Dominion Land Agent:\n\n| Date | Description |\n|------|-------------|\n| Dec. 6 | Below zero. |\n| Dec. 7 | Below zero. |\n| Dec. 8 | Below zero. |\n| Dec. 9 | Below zero. |\n| Dec. 10 | Below zero. |\n| Dec. 11 | Below zero. |\n| Dec. 12 | Below zero. |\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nTo the Ladies of PRINCE ALBERT.\n\nWe beg to notify the ladies of Prince Albert that we have just opened up\n\nFIFTEEN CASES GENERAL DRY GOODS Dress Goods\n\nSilks, Silks Velveteens, Velveteens, Cashmere, Tartans, French De Boules, Fancy Dress Goods.\n\nCloakings.\n\nMelton, Fancy Cloakings.\n\nShawls.\n\nTartan, Wool, Fancy Shawls.\n\nHose.\n\nLadies' Fashionable Hose, Ladies' Ribbed Hose, Ladies' Wool Hose, Minors and Children's Hose.\n\nUnderwear.\n\nLadies Underwear, Ladies Felt Skirts.\n\nCollars and Cuffs.\n\nWe show a Select Assortment of Ladies' Collars and Cuffs.\n\nSILK HANDKERCHIEFS.\n\nClouds.\n\nThe stock of Clouds is very large and complete. We would advise an early call, as some of the best lines are nearly all sold out.\n\nHoods.\n\nMinors and Children's Hoods.\n\nLusters, Wineglasses, Window Goods, Flannel, Curtains, Fancy Curtains, Quilting Prints, Linings, Lace Curtains, Cloth Covers.\n\nQuilts.\n\nWhite and Colored Quilts.\n\nComforters.\n\nBlankets, Blankets, Blankets.\n\nOil Cloth.\n\nDouble and Fancy Oil Cloths.\n\nGREEN WINDOW HOLLAND Yarns.\n\nCardinal, Scarlet.\n\nCarpet.\n\nTapestry and Woolen Carpets at very low prices.\n\nBoots.\n\nLadies' Warm Lined Boots.\n\nNEW STORE.\n\nNEW GOODS.\n\nNEW PRICES.\n\nWALTERS & BAKER\n\nHave just Opened a Complete Assortment of Dry Goods, Clothing, Boots and Shoes, Groceries & Provisions.\n\nIn the store formerly occupied by J. O. DAVIS & CO.\n\nThe public are invited to call and inspect the stock before purchasing elsewhere.\n\nH. WALTERS, F. C. BAKER.\n\n1879. 1882.\n\nThe young man cannot carry over thirty pounds for twenty-five cents, yet willingly kills himself trying to hold one inch and forty pounds of girl for two hours! Now!\n\nBETTS & Gwynne's\n\nDry Goods, Groceries and Ready-made Clothing\n\nEXCITE GENERAL ADMIRATION.\n\nBOOTS AND SHOES\n\nSTILL SELLING.\n\nEvery Pair Reduced 25 Per Cent. for Cash only\n\nTime is speeding fast away.\n\nHere's another Xmas Day.\n\nEvery one pretends must buy.\n\nHorse Shoe Store's the place to buy.\n\nOnly give us once a call.\n\nRead our prices they are small;\n\nSwift our sales, our goods go fast.\n\nEvery day, they cannot last.\n\nSecure your presents in good time.\n\nHave your choice in every line;\n\nAnd all step in and see.\n\nAre you dressing your Christmas tree?\n\nShoes and boots we also keep,\n\nCan and tobacco, tea cheap,\n\nClothing that you wish to buy,\n\nRemember here's the place to try.\n\nEvery kind of goods at lowest bottom prices will be found at The Sign of the Horse Shoe.\n\nTHOMAS O. DAVIS,\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\n\nJust arrived, a Large Assortment of Raphael/Tuck's Prize Exhibition Cards.\n\nCall early and make your selections.\n\nJUST RECEIVED - A LARGE STOCK OF Musical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882121301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 5388, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7753, 2], [7753, 14288, 3], [14288, 14288, 4], [14288, 17380, 5], [17380, 22153, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]