[{"id": "524b2d985fda6d6f68f6d37defe235313063f479", "text": "THE PRINCE ALBERT TIMES\n\nFRIDAY, JUNE 16, 1888\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's Church, Services 11 a.m., Rev. Mr. Wright, preacher.\n\nSt. Paul's Church, 2 p.m., Rev. Canon Foster, preacher.\n\nSt. James' Church, 3 p.m., Rev. J. Taylor, preacher.\n\nST. ALBAN'S PARISH\n\nRev. Mr. Wright, Rector.\n\nRev. Mr. Lawrence, Assistant.\n\nRev. Mr. Davison, Assistant.\n\nRev. Mr. Jackson, Assistant.\n\nRev. Mr. Howard, Assistant.\n\nPRAYER MEETING\n\nWednesday evening at St. Alban's Church.\n\nRev. Mr. Howard, pastor in charge.\n\nFRIDAY, JUNE 8, 1888\n\nTHE N.W. ASSEMBLY.\n\nAs nomination day approaches, there appears naturally to be considerable interest manifested in the coming election for the N.W. Assembly. We are interested particularly in the division of Prince Albert, Kinistino and Batoche, but with the exception of Prince Albert—which has to elect two members—it does not appear that sufficient interest is being shown to be in the field. In this division (P.A.) it has been settled for some time that Messrs. O. E. Hughes and J. F. Bett will be candidates, and as we fully approve of the candidacy of both these gentlemen, we announce our determination to give them our support. We care not whether they are brought out by one party or the other as independents. They both good men, and we do not think that there are better likely to offer themselves as candidates. Mr. Hughes has already been tried; he has been our representative in the Legislative Council for three years, and as such has given complete satisfaction. We have never in all that time heard a single complaint against him; even those who are politically opposed to Mr. Hughes have always been satisfied with his past record, and we believe no opposition would be offered were he in the field alone. We consider that it would be very unwise at this time to reject Mr. Hughes because he stands apart from his many other qualifications; he has had three years experience as a legislator, and will be able to turn that experience to good account; while Mr. Bett, though an inexperienced man, a considerable time to get hold of the ropes and make their influence felt, Mr. Hughes will go there well known and familiar with the work devolving upon him as a representative. We therefore urge Mr. Bett because we have every confidence in his ability and integrity. He has been in Prince Albert ten years, and has contributed largely towards making the place what it is; he has been a member of council, a business man and has ever been a strong advocate of the interests of our district and people, and on all questions affecting the public welfare he has always been in the right place, and from our knowledge of Mr. Bett, we feel confident that when elected—as he will be—he will neglect the interests of his constituents and will prove to be one of the most useful men in the Assembly. It may be objected that because the Conservative party have not nominated any candidates in this division, that they are Conservative and running on Dominion party lines. It may be unfortunate that party politics should be allowed to enter into anything. Of that point we do not feel called upon to express an opinion. In Kinistino, we believe, Capt. Horsley is meeting with success. We do not know who is to oppose him, and we would be sorry to see any opposition. In Batoche we understand, soliciting the suffrages of the people, not as a party man, but on his own merits, and we think the electors of that division could not possibly make a worse choice than to give to the man what they always wanted, a farmer representing farmers, and they will have more, they will have a man of good ability, sound judgment and integrity and a man of commendable experience, and who will carry a great deal of weight in the Assembly.\n\nWe are pleased to note the arrival in Town last week of Mr. Hartly Gibbon, Superintendent of Great Western Telegraph Lines in the North West. Mr. Gibbon was here last year and is very surprised at the improvements and growth of the Town in the meantime. He very much approves of the place and the citizens of Prince Albert and promises to make frequent visits to the Town. We are sure that the citizens of Prince Albert will extend a cordial welcome to him at any time and would be very much pleased to see him again. We understand, Mr. Gibbon's headquarters have been for a long time at Battleford, to which place he has returned. He is at present making arrangements for the opening of the Telegraph office at Dark Lake which he hopes will be opened shortly, and will be an added attraction to the lines in the North West.\n\nGlovers or a Big Bone.—When Mr. Gibbon's Handbook first published in our volume, it was a comparatively small book. Some years after, an addition was made of nearly 5,000 pictorial illustrations. A table of contents appeared in an Appendix of new words that had come into use. A year or two later came an entirely new revised edition of larger size, with 3,000 Pictorial Illustrations, then another renewal of the new year, a third edition, containing 4,000 Illustrations, and a Supplement of nearly 5,000 New Words were added, and now there is a fourth edition, containing a Supplement of a Gazetteer of the World, of over 25,000 Titles. The work is now not only the largest dictionary in Canada, but also the largest pictorial Dictionary, a Gazetteer of the World, and a great many other good things in its many valuable Tables.\n\nPROCLAMATION.\n\nCANADA.\n\nNorthwest Territories.\n\nElectoral District of KINSTINO\n\nPublic Notice is hereby given to the Electors of the Electoral District of Kinstino, that in consequence of a writ issued, and to be addressed by order of His Excellency the Governor General, bearing date the fourth day of June, 1888, calling for the return of the said District.\n\nTHE SCHOOL HOUSE\n\nKINSTINO.\n\nSATURDAY, THE 23RD JUNE, 1888\n\nfrom noon until two of the clock in the afternoon, for the purpose of the purpose of nominating ten persons to represent them in the Legislative Assembly of the Northwest Territories, and in case a Poll become necessary, such persons shall be elected by ballot at the time prescribed by law at the polling places appointed by the Returning Officer, as shall, after the nomination, be appointed by the Returning Officer.\n\nOf which all persons are hereby respectfully invited to take notice, and govern themselves accordingly.\n\nGiven under my hand at Kinstino in the Northwest Territories, this twelfth day of June, 1888.\n\nT. N. CAMPBELL,\nReturning Officer.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising by addressing Geo. P. Rowell & Co.,\nNewspaper Advertising Bureau,\n10 Spruce St., New York.\nSend 10c for 100-pg Pamphlet.\n\nHORSE SHOE STORE\n\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauce, etc.\nFifty Chests Choice Congo Tea\nWhich we will sell until further notice at 2½¢ per lb.\nFresh Importations in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\nFull Lines of Windowcurtains\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC.\nBOOTS AND SHOES ARRIVING WEEKLY\n10,000 CHOICE CIGARS!\nAt Manufacturers' Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS IN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING Office Stationery, etc., etc.,\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness in design and quality. The Variety of New Goods in Every Department is IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\n$9.999.\n\nIN GOLD TO BE GIVEN AWAY\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 15' feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL\n\nThe Town Council held a regular meeting on Monday evening last. His Worship Mayor W. H. Chesnutt presiding.\n\nMr. J. T. R. A. inspired by the late Mr. James Jackson for the position of Town Clerk.\n\nA motion was made by Mr. R. E. W. Wilson, 21, Elm Street, N., that Mr. Hobson be appointed Town Clerk in place of Mr. James Jackson; also a motion by Mr. P. W. Wall for the re-election of the late Mr. W. H. Chesnutt as Town Clerk.\n\nThe Board of Works presented a very carefully prepared report, containing full account of the erection cost, which amounted to $5,000.\n\nThe following accounts were ordered to be paid before May 31st, viz.: Henry Teague, $57; Mrs. Eliza Smith, $51; Mrs. Mary Williams, $47; Mrs. Emma Davis, $42; Mrs. Sarah Ray, $39; Mrs. Mary Smith, $36; Mrs. Mary Williams, $35; Mrs. Mary Lisa, $32; Mrs. Sarah Ray, $29; Mrs. Mary Smith, $28; Mrs. Mary Lisa, $25; Mrs. Sarah Ray, $24; Mrs. Mary Smith, $23.\n\nA letter from Mr. Robert M'Ghim reading, \"I have the honour to apply successfully for the office of Town Surveyor,\" signed by Mr. Robert M'Ghim.\n\nThe Council then adjourned.\n\nBERCHAC'S BREWERY\n\nPRINCE ALBERT\n\nBREWERY!\n\nPure and Sparkling\n\nAMBER-Hop-ALE,\n\nDelivered to all Parts of the Town.\n\nOUR STYLE: THE MILTON SYSTEM.\n\nCann's Book Store\n\nTOWNSHIP OF STEPHENSTOWN\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nPaine's Celery Compound\n\nFor the Tubercular, the Debilitated and the Aged.\n\nC. E. Naowego, Atholton, Pa.\n\nBuffalo Hall\n\nNEW GOODS NOW OPEN.\n\nLadies' Jerseys and Jackets,\n\nDresses, Bustles, Knits, Wrists, and Gloves,\n\nORGANIZED CARD GAME\n\nGENERAL DRY GOODS\n\nMen's and Boys' Hats!\n\nTo fit and show, a full line of Men's and Boys' Clothing and Images Furnishings for all ages.\n\nGROCERIES:\n\nAll New and Fresh in both Staple and Fancy Goods.\n\nBETTS & GWITHNEE\n\nR. C. W. & CO.\n\nA Large Assortment of Summer Dress Goods,\n\nMuslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies\n\nHATS, CAPS AND STRAWS\n\nThese Goods will come bottom prices, Inspection invited.\n\nR. C. WIGMORE & CO.\n\nCENTRAL STORE\n\nClose of Season for Winter Trade.\n\nThe Annual CLEARING SALE is going on now.\n\nDon't miss sight, as I have instructed Mr. N. S. Lacy to reduce everything he stores in it to make room for Large Importations,\n\nMany of which are now on the way.\n\nNorth American Horse Co.\n\nW.R. FISH'S CENTRAL STORE.\n\nMONOPOLY BUSTED.\n\nNEW BOOT AND SHOE STORE.\n\nTroupes delivered to all parts of the town free of charge.\n\nFREE LIVERY STABLES\n\nJ. G. GABRIEL'S\n\nOpposition is the Life of Trade\n\nOpportunity is the Life of Trade\n\nG.H.CAMPBELL\n\nGeneral Railroad and Steamship Ticket Agent\n\n471 Main Street.\n\n_ WHITTING, Mass._\n\nConcession and Managers.\n\nPublishers of Campbell's Illustrated Guide.\n\nHorsecar Stages Under $3.00.\n\nSNOW LIMITED IN EVERY CLASS.\n\nWe have a full line of Men's, Women's, Ladies', and Children's Winter apparel in all sizes and styles.\n\nWe buy direct from the Manufacturers, paying full price without commission or brokerage.\n\nAbsolutely an immanship in our market at the lowest prices.\n\nWe want no purchase but the price named.\n\nWE DO NOT ADVERTISE IN CURIOSITY TO THE AMERICAN PUBLISHER.\n\nWe have a full complement of stockists.\n\nMARTIN'S LARGE MISSIONARY durante\n\narrivals for the worst seasons.\n\nApril 28th.\n\nWIRE FOR PARTICULARS DIRECT INTELLIGENCE.\n\nC. H. Campbell & Co.\n\nYour Houses Never Wet by Rain again\n\nEquipment delivered to all parts of The Town free of charge.\n\nGet SHIPS.\n\nS. MEADOW & CO.\n\nT.J. AGNEW\n\nDonaldson & Pembroke.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888061501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 3199, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7828, 2], [7828, 8576, 3], [8576, 12069, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]