[{"id": "694ec23965058474ef32297b26d3b3d8a1de2327", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETTY\nPRINCE ALBERT, N.W.T.\nTERMS—80¢ per month in advance.\nSubscriptions—$1.00 per year.\nAdvertisements—$1.00 per line per issue.\nDisplay advertisements—$1.50 per inch.\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVETTY, Proprietor\n\nSUNDAY CHURCH SERVICES\nSt. Andrew's Church—Services on Sundays at 10:30 a.m., Rev. Mr. McLean, charge. Ambrose B. McLean.\nSt. John's Church—Services on Sundays at 10:30 a.m., Rev. Mr. McLean, charge. Ambrose B. McLean.\nSt. Paul's Church—Services on Sundays at 10:30 a.m., Rev. Mr. McLean, charge. Ambrose B. McLean.\n\nThis Paper is also issued at Prince Albert, Saskatoon, and Regina.\n\nPRINCE ALBERT, OCTOBER 19, 1888.\n\nSTOCK DISTRICTS.\nThere has been a long time on our statute books an Ordinance of the Northwest Council which we consider might very properly be put into force in this District. We refer to the \"Brand Ordinance,\" No. 10 of 1887, which is an ordinance and regulations of former Ordinances relating to the marking of stock. The Lord-Governor has the power, under Sec. 2 of said Ordinance, by proclamation to set apart any portion of the Territory as a stock district whenever he thinks it advisable that such portion should be so set apart. It has, we presume, never been represented to the Lieut.-Governor that this district should be so set apart, but we do consider it undesirable that such action on his part is now advisable, and we therefore take this opportunity of calling attention to the matter. We consider that it would be greatly to the interest of all parties raising stock if such were done. There are now in the district a large number of farmers most of whom are engaged in raising cattle to a certain extent, while there are also a number of persons devoting their entire attention to stock raising, and it may occur that where brands are not registered there may be two or more persons using the same brand, and disputes may arise from time to time, and less litigation arise in consequence. We are of opinion that the Ordinance should be amended so as to compel owners of registered brands to give public notice of the same in a newspaper published in the district.\n\nWe take the present opportunity of calling the attention of our members of the Legislative Assembly to the matter, and refer them to the Ordinance, No. 8 of 1884, \"An Ordinance to regulate the costs of distress for rent and extra judicial seizure.\" As it stands at present it is in nearly every case in a place like this impossible for a mortgagee to avail himself of his remedy of seizure and sale in the event of non-payment of a chattel mortgage, unless he does so at a great loss. The schedule of fees should be amended so as to allow a half mile at least ten cents per mile in going to make a distress and returning, and also the actual cost of removing goods where it may be found necessary to have removed. There can surely be no reason why a distressing mortgagee should pay all costs, and the mortgagee have the full benefit of his security.\n\nMr. Robertson has been on the get election committee in Cardwell to fill vacancies in the House of Commons caused by the death of his father, the late Hon. T. White. He was elected as a straight Conservative by 139 votes over Mr. J. W. Independent Conservative. There was no Liberal candidate in the field, but the Reformers threw their whole support in favor of Stubbs. Cardwell has done well, and we congratulate the Reformers who have been honored, as well as the memory of its representative, by the election of Mr. White, who is a man of ability, and who will prove faithful to Canada and the Empire.\n\nOur able contemporary, the Call, Winnipeg, is again in difficulties. This time it is not a fire, but a libel suit instituted by the Hon. J. Martin, Attorney-General of Manitoba, who has brought his digester into some legal articles published in the Call referred to. We have no doubt but that the Call will be able to justify itself and pull happily through all its difficulties.\n\nVICTORIA\nLivery and Boarding Stables,\nBetween Johnson's and Campbell's Stores.\n\nNEILSON & M'BEATH\n\nPaine's Celery Compound\nCures Nervous Prostration, Nervous Headache, Neuralgia, Weakness, Indigestion, Loss of Liver, and all affections of the Kidneys.\n\nWEAK KIDNEY COMPLAINTS\nPaine's Celery Compound is a Pure Tasteless Remedy, Combining Celery and Cina, these wonderful stimulants, it speeds up the system and restores health.\n\nRHEUMATISM\nPaine's Celery Compound purifies the blood, removes the bad blood, which causes rheumatism, and restores the blood making as effective a cure as the best remedies for this complaint.\n\nKIDNEY COMPLAINTS\nPaine's Celery Compound quickly restores the kidney function, and cures the disease. This curative power combined with the tastelessness makes it the best remedy for all kidney complaints.\n\nDYSPEPSIA\nPaine's Celery Compound strengthens the stomach, and quells the nerves of the digestive system, it even cures the case of Typhoid.\n\nCONSTIPATION\nPaine's Celery Compound is a Colon Cleanser, it is laxative, giving easy and natural stools. Regularity surely comes to those who use it.\n\nPrice 50¢ each. David & Lawrence Co., Propriety Montreal, P.Q.\n\nREMOVED\nR. C. WIGMORE & CO.\nHave removed to their new premises,\nSECOND DOOR EAST OF OLD STAND\nWhere they will be pleased to meet their numerous new and old customers.\nClearing Sale still going on.\n\nR. C. WIGMORE & CO.\n1879.\n\nBuffalo Hall!\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\nNow in stock will be sold\nFOR TWO WEEKS ONLY\nAT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne\nT. N. Campbell\n\nSchool Books and Stationery.\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK.\n\nALL SIZES—WRITING AND CUTTING\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed Suitings,\nTrowsering and Overcoating WORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nGENERAL NEWS\n\nToronto, Oct. 6.—The congregation of Jarvis Street United Church has been discussing for some time the question as to whether church property taxes in its parish should be assessed or not. It was decided at last night's meeting that it would be held by them that church exemption is a form of taxation which should be continued by their denomination.\n\nThe package of confessionalism addressed to a man in New Hampshire which was forwarded, the sender, a reputable merchant here, having called and explained that it was intended for his friend, the traveller. The attempt was made to wired the Government authorities to seize the package as the dead child and rest of the evidence. The police of Ottawa, Oct. 7.—Mr. Vaillant, publicly attacked by Mr. Murray, who objected to the sale of the ordinary tobacco, proved injurious to food.\n\nThe band banquet to the Hon. Mr. Campbell was held off shore on Thursday at the drill hall.\n\nMr. Hamilton, a Michigan contractor, is using the Government for $3,000 duty collected on timber, which he claims is not due him, and which it is said should have been admitted free.\n\nMontreal, Oct. 7.—The chief of police has received a telegram from Winnipeg asking for assistance in arresting Mr. McKay, who committed frauds upon the C. P. R. company at that city. He is wanted in connection with the disappearance of his parents there. McKay is also wanted on a charge of bigamy at St. Paul. He has been living there and also connected a man named Smith with a young girl. McKay is said to have come to Montreal last Thursday, but he has not been located.\n\nKingston, Oct. 7.—A large band entirely composed of lunatics, has been organized in the asylum.\n\nAn official of the coroner's department visited the Kingston news stand on Saturday last and seized all the copies of the New York Illustrated News exposed for sale, on the ground that the paper is an immoral one.\n\nIt is believed here that President David Blair of the defence credit bank will visit Toronto soon, now that he has been acquitted on all the charges preferred against him.\n\nAnother case of smallpox was found yesterday on George street, opposite the public school. There is now eight cases in the ward, including the case since the 14th of last month. The residents of the Matheson ward are hard at work with paint and the disinfection of the post office from their neighborhood. The people generally are agitating for a quarantine against smallpox, which is believed to be endemic. Health officers are laboring industriously to check the spread of the disease, but, as is usually the case, these efforts are in vain, and have friends charging the mayor with being troublesome to the authorities.\n\nThe revenue of last month was $25,490, while the budget was $31,638. The total revenue for July, August and September was $92,827,644, and expenses $92,796,799, leaving a surplus of $2,845,855. The surplus is more than three million and three hundred thousand dollars above the budget for the first three months of the current fiscal year.\n\nThe total debt of the Dominion as of September 30th was $1,200,000,000, a decrease of a million and a quarter as compared with the previous month. The expenditure for the month up to the end of the month was $5,760,000.\n\nGalt, Oct. 8.—Excitement over the promising case continued at least four feet. Examination of the body showed the fact that a hole had been made in the bottom of each one of the chimney-pots in and around the house with a pickaxe. The opinion that there is a woman in the house obtains credence. The ends of the bars were cut off and the window being done manually that only a woman with a pickaxe could have done it. The funeral of Miss Cherry took place yesterday, and was largely attended.\n\nQuebec, Oct. 7.—Innumerable complaints are made that the corporation discredits the work of the Protestant churches in the matter of gas lighting. It is said that although the gas contract stipulates that the light shall be placed in front of each church, the Protestants never get theirs and that now in the electric light contract have been ignored altogether, while the Catholic church has from one to four lights.\n\nThe new policy inaugurated by the steamship companies of carrying their passengers through to Montreal went into effect for the first time yesterday.\n\nThe Dominion Bank Agency said Adam's Line steamship Company, which arrived yesterday morning, only stopped here to land some special freight, but landed nothing else. They proceeded to Montreal where they were delayed west for very few hours.\n\nWinnipeg, Oct. 7.—Mr. Leacock is regarded as likely to be the Conservative candidate in Provencher.\n\nLarge crowds of people visited the scene of the disaster. The victims' bodies could be seen winding their way in that direction and the majority of them tried the bridge by walking over it.\n\nThe members of the league are receiving the congratulations of United States journalists, the check which has been put into the league fund by the River Bay railway. Doubtless approval from that source is more agreeable to the minister than the approval of Manitoba.\n\nThe railway disaster, which occurred in Ramsey county, Dakota, is consequence of the obstruction of the grade by hail, which caused the train to stop and the substantial loss will be forthcoming. The losses of this season will surely show the importance of the protection of depots, grade crossings and the absence of the system of shifting among farmers.\n\nThe charge of criminal libel preferred against Mr. Acton Burrows, of Guelph, will be heard tomorrow at the police court today. Among the witnesses called for the defence are Mr. Jones, J. E. Scott, and Messrs. Duncan Macartney, H. Scottie and other well known public men; Mr. Burrows will be able to show through ventilation. Messrs. Hagley and Munson will defend Mr. Burrows. Mr. Burrows was charged by Mr. Scott.\n\nIt is said in good authority that Great Western will institute criminal proceedings against Mr. Coll for alleged charges connected with the death of Mrs. Collins, who was grounded for Mr. Martin's action.\n\nLachine, Oct. 8.—This town was without state excitement except over the appearance of a pretty and highly connected married lady with a gay young admirer. The husband is frantic and has threatened to hang the string wife to return to her home. All parties connected with affair are well known and their actions as a result of this effort every effort is being made to keep matter quiet. When last heard the runaway was away south for the purpose of life. It is said that the husband is willing to take the wife again to his home.\n\nWashington, Oct. 8.—In the Senate today Mr. Blair offered a resolution, calling on the President for information relative to the trial for treason, which was ordered by the Senate on the 16th of November, 1868, of Louis David Riel, who claimed to have been a naturalized citizen of the United States. Whether the proceedings in the case were according to the law of the land including the fact of his citizenship, is the question.\n\nNew York, Oct. 8.—The afternoon of the wheel at Madison Square Garden began at 2 p.m., to day, and again at midnight. The prices were four hours the score war: Gardner, 120 miles; Turner, 165; O'Connor, 160; Han, 121; Pflueger, 155; Smith, 150; Haggard, 147; Lee, 151; Han, 150; Lagran, 150.\n\nSILK SHIRONS\n\nThese are lady shirons that would like to have an elegant, large package of extra fine American silk shirons, widths and all the latest fashionable shades adopted for Roman blinds, Draperies, Trim, Curtains, Flairs and Drapes, Bows, Fancy Work, etc. We will send you a sample of any shade you may desire, postage paid. As a special offer, this house will give double the amount of any other firm in the city who will sell you a sample of P. O. address of our agency marked below. No pieces less than one yard paid for. We will send you a sample of any shade you may desire, postage paid. Three pack-\n\nHave a Large Stock of LUMBER!\n\nALEX. LOUDOUN, Sec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\n\nBELL & CO., Guelph, Ont.\nTERRITORIAL NEWS\n\nQU'APPELLE\n\nFrom the Gazette, Oct. 4.\n\nAnother 300 feet of sidewalk has been laid this week, thus completing the circuit around the business portion of the town.\n\nPrairie fires have been raging northwest of the town and also to the east. The latter has been burning for several days and cannot have escaped doing serious injury.\n\nWe understand that the fire that has burned near Sillery was caused by the act of a man who put a match to a field of frozen grass. If such as the rash say that the punishment inflicted on him can be too severe, notwithstanding the fact that he has offered to pay for some of the damage done to his neighbors.\n\nFrom the Progressor, Oct. 4.\n\nThe well at McCallum Bros. Mill is now down about 270 feet. Unless water is abundant in this stratum, the intention is to sink it 200 feet.\n\nA charge has been laid against the fireman and the man who were in charge of the C. P. R. engine when the fire went out here on the 19th ult. They will be brought before a magistrate's court to-morrow.\n\nIt has been reported that a large amount of damage has been done on the Pleasant Plains this week. We have heard of no damage being incurred, but cannot obtain particulars.\n\nBATTLEFORD.\n\nFrom the Herald, Sept. 28.\n\nA cricket match played last Saturday afternoon between Old Countrymen and Canadians resulted in favor of the former.\n\nWhen playing was suspended a great deal of hay was not yet being cut, while its being mowed, but the water dried up and people were able to get all needed.\n\nA few weeks ago we quoted a similar effect that tomatoes as a rule had not formed in this district this year. It has been reported that the tomatoes had a fair crop, although the fact was not first stated. We noted that the same state of affairs existed regarding beans that combed and ripened when grown well and blossomed freely while little or no fruit was formed, and asked an explanation of what might be the cause.\n\nSince the publication of that announcement, however, the beans have formed, have been set to ripen, and the other things spoken of have borne very freely and brought their products to perfection.\n\nREGINA.\n\nFrom the Journal, Oct. 4.\n\nA policeman named Ernest Peyton died yesterday on Tuesday morning of the effects of a wound received in the force in the past week. He was killed in the force since July 1st. A military funeral was held Wednesday.\n\nMaster William Miller and Mr. McCor, contractor, was demonstrating a horse on Friday afternoon last, looking in his hands a short gun. The horse went into the saddle and refused to ride. He came to town and Dr. Willoughby dress the wounded member.\n\nFrom the Tribune, Oct. 4.\n\nWheat has been selling at $1.02 and this morning James Belle sold a load at $1.05. One hundred dollars was realized, consisting of expenses, by the failure of the Methodist Church at their dinner and luncheon table at the recent annual general meeting.\n\nStill nothing better than this is being forth. The Means. Smith commenced work yesterday on their building near the Palmer, historic run as afield hall.\n\nHon. Jacobus Watmough sustained a serious injury while celebrating a day or two ago with friends at a dinner given by a party of friends. When crossing the railway opposite his residence his horse stumbled and fell, causing his body to hit the ground and sustaining his collar bone. Dr. Willoughby was immediately called and said the case appeared to be critical, and that he could not give any information as to whether he would recover in a few days.\n\nOn Friday last Mr. Smith, brother-in-law of Mr. Watmough, was driving a cow on the premises of the proprietors a number of cattle distressed for days, the Rev. E. Dewdney being the person. Twenty-three of them and twenty-three cattle trampled on palm tree gardens, and six or seven were die, trained by the latter's servant for the pound fees. Defendant drove the whole land from the premises, and was further summoned. D. L. Scott, Q. C., for prosecution; John Scow for defendant.\n\nFORT MACLEOD.\n\nFrom the Gazette, Oct. 4.\n\nThere is a regular stampede of town people to the mountains.\n\nMr. Archibald, a gentleman mentioned last week as purchasing a large herd of horses from Oregon, fore a ready market, has returned to town.\n\nMr. Frisham, of Calgary, took the first prize in the east for the best specimens of grain and root crops west of Ontario, bringing back a fine stock of sheep.\n\nFifty-five horses and camp outfit belonging to McMahon, Aldrich Brown & Vanclief, were purchased locally for inclusion in the contented haws.\n\nJos. McFarland has some mammoth potatoes. One of potatoes picked at ran and measured nine inches in diameter (28½ in.), and weighed two pounds; the other measured 18x16 and weighed nearly thirty pounds.\n\nThere was only a handful of potatoes of the kind, indeed, in a fair sample of what might be seen in many parts of the district. We might add that the potatoes were perfectly solid.\n\nEDMONTON.\n\nFrom the Bulletin, Sept. 29.\n\nA large shipment of four-per-cent beer arrived here Wednesday afternoon.\n\nJ. F. Smith was injured on Thursday evening while working on his building and falling backwards on him.\n\nOats were sold at town on Tuesday at 80c per bushel, and at 60c per bushel. They have been offered in the local market at 50 cents.\n\nSo far reports have been received concerning the wheat or two of the preceding harvest and murderer Kneekawka on the Stoney Plain Reserve.\n\nHe has one or two companions.\n\nA great deal of grain is still unsold although ripe. The extra heavy crop may be considered a blessing, but the weather is causing considerable delay. Fortunately the weather has been such that no losses have been suffered.\n\nMr. McLean of Little Mountain, recently threshed a hundred of wheat from two pounds weighing of Lodge wheat. He was convinced that he could have saved in ripening than the red Elyte. It is now asserted that the red Elyte may be saved by proper cultivation and still turn out a good yield and compete with other varieties which have ripened earlier.\n\nMr. McLean, Mr. McLev moved to London at the same time as Mr. McLean, side the red Elyte and cut them both on the same day although the Elyte were saved in ripening. Mr. McLean says it will be seen whether or not the theory holds good.\n\nLETHBRIDGE.\n\nFrom the News, Oct. 2.\n\nBeautiful weather for the lot of October. The thermometer was 54 in the shade on Monday.\n\nContracts are being let for the erection of school and recreation rooms at the barracks here.\n\nAssistant P.O. Inspector Carne arrived here from Calgary today. Mr. Carne returned east on Monday morning. During his stay he opened a branch of the Money Order Department here and from now on orders can be sent away here.\n\nOn Thursday afternoon last a short time after school was dismissed Mr. W. H. Baker, of Baker's store, was heard being weighed at Lt. Baker & Co.'s scales on the square, and some of the children, who were there buying the sale of N.W.M. Nails, thought they heard the noise of N.W.M. Nails, climbed upon the loads. As they were about to climb upon the wagons to see what they looked like they jumped from the wagons to between them the wheel of the wagon and the leg of the little fellow below the hip. The little fellow was picked up and carried into Baker's store where he was treated.\n\nOn examination it was found that the left leg was broken below the hip and the hip badly bruised.\n\nThe treatment was re-duced and the little fellow is now doing as well as can be expected.\n\nCALGARY.\n\nFrom the Tribune, Oct. 3.\n\nA number of persons in town will go to hear that D. Cameron has died.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., 1052 Broadway, New York.\n\nDonaldson & Pembrey.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888101901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 5349, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6414, 2], [6414, 14609, 3], [14609, 22399, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]