[{"id": "286a838e34bd001a927a6049a629ad860be2a26e", "text": "BRANCH RAILWAYS.\n\nThe branch lines built in Southern and Northwestern Manitoba last year have already proved of great value to the settlers in the districts traversed by them, and their importance will increase in the Province than the extent to which its credit was pledged to aid the enterprise. The Government has demonstrated the wisdom of the Government in carrying through the Railway Act, and has shown that the difficulties it would have been impossible for either the Manitoba Southwestern Colonization or the Manitoba and Northwestern Colonization companies to have built such a road, a fact which, however much it may be denied by the Opposition, is now readily apparent from the results accomplished by the officers of those companies to the Government.\n\nWith the opening of spring comes a natural anxiety on the part of those still waiting railway communications within the province. The situation will be worse this year. The Moncton line is a position that Mr. Van Horne fully appreciates, and he has stated officially that there is a likelihood of both the Southwestern branches being somewhat extended westward during the present season. The situation at Brandon is not so hopeful, and also of the Souris branch being commenced from Brandon and built northward further in the direction of the Souris coal fields. Of course, this will depend somewhat upon the action of the Board of Directors of the company now before it respecting the repayment of the Government loan by the company, and the ability of the company to meet its obligations, and the ability to borrow money on branch line bonds without increasing the surplus. We believe that every one who has the interest of the province at heart, that it will be worth while making the necessary expenditure, and we hope to see a proposal to make a definite announcement to that effect at an early date.\n\nMr. F. H. Bishop, who has been in England in connection with the Manitoba and Northwestern Railway, has returned, and we understand that he hopes to be in a position to build fifty miles this year. The prospects for the early completion of the line from Brandon by way of Rapid City are anything but favourable, the recent upheaval among the Indians in the Souris district having had a tendency to injure them. Mr. Bishop's most hopeful point of view is that the scheme will prove a success, and that positive proof—promises not taken—that he can complete his work this season, there should be no hesitating in authorizing him to place the franchise in other hands.\n\nThe Hudson's Bay Railway is a branch line of the main trunk railway, but it is difficult to deal with any question of railway communication in the West without taking into consideration the services from Mr. Hugh Sutherland, who is now in England, one of the most hopeful men connected with the railway. He visited with interest by the people of the whole Northwest, and he may rest assured that he has filled a gap in the material supply of the spirits of the capitalists and selfish efforts which have been made by disreputable rivals to their ends. He has set his efforts ever so long ago, and is endeavoring to dissuade persons from acting on the directorate of the company—Moncton.\n\nSTRANGE STREAMS.\n\nA number of rivers that can be found almost anywhere in such remarkable characteristics as those exhibited by the ranch among the natural curiosities of the world. In Algeria, for instance, there is a river stream whose water chemically resembles the bitter salts, trona. It is formed by the union of two rivulets, one of which is extremely impregnated with iron, while the other flows through a peat marsh, imbues galls and sediments. Letters have been written on the subject of these waters, and which unite to form the little river.\n\nIn Colombia there is a river so high, by all accounts, that it is impossible to assure that it is appropriately named Rio de Vinagre, or Vinegar River. The river flows in a deep valley in the large Orange River, South Africa, and the river passes through a rocky region containing copper ores, below which the waters are said to be poisonous, and which unite to form the little river.\n\nA very strange river is the Walker River, in East Africa, which flows and runs down, flowing in fish and crocodiles. Though it flows for hundreds of miles through fertile lands, the immense volume of water never reaches them. A little further south of Equator, the river flows itself in a deep valley a few miles from the Indian Ocean.\n\nVery few great rivers have ever been explored from their sources to the sea. Travelers tried for two thousand years to find the sources of the Nile by ascending the river. They finally gave up the attempt, the difficulties of the streams their stories and energy were exhausted and they could go no farther. It was only when the mountain located near by overland searchers that Schwartzen was able to float down the Yukon, that the secret of the source of the Nile Spoke.\n\nDIED OF HYPOPHORIA.\n\nAfter four days of the most outrageous delirium tremens, Dr. Warner, a young physician of Baltimore, died from hydrophobia. While walking on Christmas day, Dr. Warner picked up a little dog that had been killed by a hunter. The dog was dying. It was death throes that the dog bit him on his right hand. The animal was hydrophobic. The doctor was suffering from a very serious temperament, the doctor wrote a great deal about the dog bite and its effects. He had friends who thought that he believed he would be a victim of rabies. They laughed at his fears. Last Thursday he fell ill with symptoms of rabies. He fell into a fit of nervous exhaustion in the hallway of his residence. He was carried to bed. He died Friday night.\n\n\"I have hydrophobia; keep away from me,\" he screamed.\n\nHis wife heard him for a few minutes later was seized with a terrible paroxysm. Prof. B. R. Arnold was summoned and treated her. She died shortly after. Dr. H. G. Gardner and other physicians came. The prominent in this case hydrophobia, the terrible symptoms of which became more and more apparent.\n\nFrom Friday night until his death he acted just like the New York dog poisoner. He walked about, barked and barked under his bed, barked and refused to take water. His horror for water, which was his greatest fear, was intense. The doctors took him in a closed carage to a Ricard's bath establishment. The bath was given, a sedative injection was given. He fought the physicians until exhausted. Yesterday he exhibited fits of convulsions, and for the last time had a paroxysm of terror, when he died.\n\nAll right, the conclusion followed immediately. The physicians say his sufferings were frightful to behold. He fought the mouth and ground his teeth until bits of them were broken off. He died in a spasm.\n\nTHE C.P.R. CAR.\n\nThe C.P.R. exhibition car has been visited by large crowds daily, and Mr. George F. King, the manager of the subdivision, has been kept busy demonstrating the various products of the resources of the great railway. Formerly prominent members of the city council, the boards of trade and various, the farming leaders, the merchants, the manufacturers, the members of city officials and others visited the car, which has been reserved for the use of the public. The display of the products of our soil, cereals, fruits and all the other products of this great country is really magnificent, and the artistic manner in which they are arranged is worthy of special commendation. Specimens of coal, ore, grain, sheep, etc., are also displayed, and the entire display is a handsome array of plants and flowers. The display and certain speaking volumes for the benefit of the public are expected to pay for everything that Ontario can show in the same lines. Wild and tame animals are also displayed, and the samples shown are of a particularly fine quality. The car was open Saturday afternoon, and again Saturday night, when it was closed for the departure for Hagerman this morning.\n\nPhotographic views of the interior have been taken by Mr. J. Hamilton Spectator.\n\nGeorge F. King, a retail millionaire dry goods merchant, has been elected to the Board of Trade. Mr. King has been a member of the Board for many years, and has always been active in the affairs of the organization.\n\nLIVERY & FE D STABLE\n\nCHAS. WOODMAN\n\nPROPRIETOR\n\nBETTS & GWYNN\n\nExamining Our Stock of Xmas Confectionery and Biscuits\nA FAIR WARNING.\n\nAll Parties indebted to\n\nT. E JACKSON\n\nwho fail to settle before the Fifteenth of FEBRUARY will be sued at the next Court without any further notice.\n\nT. E. JACKSON\n\nNew Stand, in the building lately occupied as a Post Office.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowellings,\n\nDress Goods,\n\nSilks,\n\nLinens, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOOD MERCHANT,\n\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\" \" Over 13 feet extra.\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S.\n11 a.m.—Rev. Mr. Maclean, Bishop.\n1 p.m.—Rev. Mr. Maclean.\n\nTHE MISSION CHAPEL.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nST. ANDREW'S.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nST. PAUL'S.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nST. JOHN'S.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nST. JAMES'.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nST. ANDREW'S (Presbyterian).\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nFRIDAY, MAY 7, 1886.\n\nIt is reported that Sir John Macdonald and Hon. Thos. White will visit Manitoba and British Columbia in June if the former's health permits. The Indians will be asked to make a contribution toward the cost of the trip, not merely by the members of the Conservative party but by all classes. It is to be hoped that his health will permit this indulgence.\n\nA deputation has waited on the Minister of the Interior, requesting that a clause in the Dominion Land Act be amended by substituting \"one\" for six per cent interest on loans of $500 to immigrants taking up homesteads, as the clause as now stands is inequitable. The Minister promised his favorable consideration.\n\nA bill has been introduced at Ottawa calling the Dominion Election Act of 1874 to operate in elections in Manitoba. The object is to have the elections in the province take place at the same time as those in the east. It is the spirit of the bill that the voting should take place throughout the Dominion on the same day, and no circumstances now exist that should place Manitoba in an exceptional position.\n\nThe Dominion Government scheme for the representation of the Northwest Territories at Ottawa has been approved by Sir John Macdonald. It provides for four members, Assiniboina to have two, and Alberta and Saskatchewan one each. This will make a total representation of seven for Manitoba and the Northwest Territories. If so, we should have if the interests of this country are to be properly represented, but a very great improvement on the present state of things. The necessary legislation will be sought in England.\n\nThe Ottawa Journal says: It is evident that the Government intend to carry out the recommendation of Prof. Sanders to establish an experimental farm station at Ottawa. The Hon. John Carling has given notice of the following motion: \"That it is expedient to request the Government in Council to establish an experimental farm station, and to acquire a limited extent of land and set apart a limited extent of public land near Ottawa for such purpose, and for the purpose of tree-planting and timber growing, and also to fix the rate of remuneration of persons employed to carry such provisions into effect.\" The motion was carried by Parliament for that purpose, and further to provide that such samples, plants and other products as are designated by the Minister of Agriculture shall be distributed by mail free of charge, subject to regulations made by the Postmaster General.\n\nThe Land Department of the P.R. is striving earnestly to foster investigation to this country, and has set about the right way to do it. Unlike the advertising of many American Railways, the methods adopted by the P.R. are such as they think best, and they are doing what they can to help the settlers to succeed in the country. They are doing their best to give the settlers every possible opportunity to succeed, and they are doing their best to help them succeed.\n\nThe development of the ranching industry in the Northwest has been most satisfactory. The number of cattle raised in the various districts of the province is increasing rapidly, and the increase is being realized in the form of increased prices. The increase among the cattle is estimated at 25,000 head, and it is estimated that 25,000 head will be brought into the market during the coming year.\n\nThe Dominion Government scheme for the representation of the Northwest Territories at Ottawa has been approved by Sir John Macdonald. It provides for four members, Assiniboina to have two, and Alberta and Saskatchewan one each. This will make a total representation of seven for Manitoba and the Northwest Territories. If so, we should have if the interests of this country are to be properly represented, but a very great improvement on the present state of things. The necessary legislation will be sought in England.\n\nORDINATION.\n\nOn Sunday last, the 2nd May, His Lordship the Bishop of Saskatchewan held an Ordination and Confirmation at St. James' Church in the Island Reserve, South Branch. Mr. John Carling, who had been an Indian student at Emmanuel College, was ordained Deacon, and twenty candidates were confirmed. The Bishop handed over the sum of $58.25 for distribution among the Indians of the reserve, who had suffered loss from having no crops owing to the late rebellion preventing them sowing last spring. The money was contributed by the Guelph Patriotic Relief Society of Ontario.\n\nThe Rev. J. Badger has been appointed missionary to the Indians at Fort La Corne.\n\nSUDDEN DEATH.\n\nWe regret to have to announce the death of Mr. Fitz Cochrane, of Calgary, aged 39 years, of this city. The Calgary Tribune of Friday afternoon Calgary citizens were astonished by the report that Mr. Fitz Cochrane, bachelor, had died suddenly on Friday afternoon while attending the death of his wife. The deceased had been feeling ill, and about half past three walked over to Dr. Henderson's office to seek medical attention. The doctor perceived a glimmer of life in the patient, and he was sent to hospital, where he died shortly afterwards.\n\nThe Prince Albert Times\n\nSAASKTCHewan REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for the Times and get the latest news and happenings around town.\n\nJOB PRINTING.\n\nIf all descriptions done neatly quickly and cheaply.\n\nJ. D. MAVEETY, FUSILLER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nHIRE'S SALE OF LANDS.\n\nUnder the authority of a warrant of Sheriff Ferrier of the County of Northumberland, dated April 26th, 1886, the sale of the land of James Macdonald, Esq., late of Prince Albert, was held at the said town, and the sale proceeded as follows:\n\nAt 1 o'clock the brothers assembled at the lodge-room and formed a procession to Dr. Henderson's residence. Here a short but impressive Masonic service was held when the procession re-formed and proceeded to the church of the Redeemer, where the usual solemn ceremony was conducted by the Rev. Mr. Parks, minister. The procession then set off for the cemetery, and after the beautiful burial service of the Church of England had been concluded, the solemn Masonic service was led by the Master and the brethren, and the body was lowered into the grave.\n\nMassachusetts auctioneer sells principally by account of no low wages paid.\n\nThe amount of the sale was $1,200,000, and the value of silver $1,750,000.\n\nHardware and Tinware.\n\nSee what $1 Cash will buy:\n\n5 Milk Pans, 5 lengths Stove Pipe 9 pounds Shot,\n6 pounds R. p.e. 4 boxes Axle Grease.\n\nCoal Oil 75c gallon,\nblean Ploughs $25,\nBats, from £3 to £3.\n\nUntil further notice I will sell hardware retailled here by men not in the hardware business of real.\n\nAbove made up our stock. However, we can sell lower than any house in town. See our prices before purchasing elsewhere.\n\nEvanston, being gone on short notice.\n\nThe Prince Albert Times\n\nSAASKTCHewan REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for the Times and get the latest news and happenings around town.\n\nJOB PRINTING.\n\nIf all descriptions done neatly quickly and cheaply.\n\nJ. D. MAVEETY, FUSILLER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nHIRE'S SALE OF LANDS.\n\nUnder the authority of a warrant of Sheriff Ferrier of the County of Northumberland, dated April 26th, 1886, the sale of the land of James Macdonald, Esq., late of Prince Albert, was held at the said town, and the sale proceeded as follows:\n\nAt 1 o'clock the brothers assembled at the lodge-room and formed a procession to Dr. Henderson's residence. Here a short but impressive Masonic service was held when the procession re-formed and proceeded to the church of the Redeemer, where the usual solemn ceremony was conducted by the Rev. Mr. Parks, minister. The procession then set off for the cemetery, and after the beautiful burial service of the Church of England had been concluded, the solemn Masonic service was led by the Master and the brethren, and the body was lowered into the grave.\n\nMassachusetts auctioneer sells principally by account of no low wages paid.\n\nThe amount of the sale was $1,200,000, and the value of silver $1,750,000.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886050701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 4276, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8410, 2], [8410, 9462, 3], [9462, 18279, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]