[{"id": "a97dc3fbf1ab9153ca6fc78f2c000d8644453dd5", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nTRAVEL—Half price on mail in advance\nstamps (except Sundays).\n\nThere will be no extra charge for travel\non Sundays, except Sundays, 10 cents per mile.\n\nAll letters to be addressed to the Proprietor.\n\nSUNDAY OBSERVANCE.\n\nA number of years ago, a clergy-\nman of the Presbyterian denomina-\ntion, who was also a Professor of\nTheology, made a startling re-\nformation in the church service, by\nintroducing a pipe organ, instru-\nmental music, and processions into\nthe old church, also preaching\nsermons on interesting subjects, thus\nmaking the whole service more ap-\npealing to the public. The result has\nbeen most satisfactory in the reports,\nand we are glad to see such a spirit of\nreform. Since his death, a complete\nchange has been made, and now that\nwe have heard from him, we are\npleased to say that he has done well.\n\nThe General Assembly of the Cana-\ndian Church has recently issued a\nstatement calling upon all members\nto make their services more attrac-\ntive, and to make their sermons more\ninteresting, so as to attract the atten-\ntion of those who do not attend church.\n\nThe Sunday School is doing a great\ndeal of good work, and we hope that\nmore people will join in this noble\nenterprise.\n\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the\naccuracy of any statement made herein.\n\nFREEMASONRY.\n\nTo the Editor of The Times:\n\nFreemasonry, unlike the\nOrange Institution, never seems con-\nfined to certain sections or at any time\nto disturb the peace and good order\nof society, but quietly goes along\nwith the times, and is always ready\nto assist in any emergency.\n\nPerhaps the most eloquent witness\nare the Masons in India, who are\nworking hard to bring about a better\nunderstanding between the different\nraces.\n\nTHE GABLE HOUSE.\n\nThe first part of the\nPool, Carom & Pinball Hole Tables\nin the Trademark.\n\nThe Best BUSH & CHAMPS of the finest\nquality, guaranteed to be the best.\n\nJOHN WIMMERSKIRCH, PROP.\n\nFRIDAY, JULY 4th, 1884.\n\nTHE WEST END HOUSE\n(PRIEST DOOR WEST OF POST OFFICE)\n\nMeals at all Hours.\nGood Beer and Cigars always on hand.\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\nPROPRIETOR\n\nEAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\n\nHugh McDougall,\nEast End Baker.\n\nPUBLIC NOTICE.\n\nAny person who has heretofore been\nrequired to take notice that the\npublic lands without authority from\nthe Minister of Agriculture, and\nwithout authority from the Com-\nmissioner of Dominion Lands for the\nDistrict in question, has been sold\nwithout authority is liable to serious\nlosses and damage, and is advised\nnot to enter the interior any direct.\n\nFor every unregistered quarter\nsection not having timber on it, or\nany application for a homestead on\nDominion Lands purchased a wood lot not exceeding twenty acres in extent, at $5 per acre.\n\nAny person other than a honest\nsettler who has registered a quarter\nsection must make application therefore to the\nMinister of Agriculture, and must pay\nwith such application according to law.\n\nPersons who have registered a quarter\nsection without authority must pay the dues\ntherefor, and must make application therefor\nhis office on or before the last May, 1884,\notherwise they will be liable to the penalties\nindicated under the Dominion Lands Act.\n\nD. J. WAGGONER,\nCrown Tenant Agent.\n\nFURNITURE\n\nJust arrived. In addition to our former\nlarge stock we have received some\nFancy Parlor and Bedroom Sets,\nSideboards, Bureaus, Bedsteads,\nChairs of nearly all descriptions.\nC. & C. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s\nwill be promptly attended to.\n\nNATHANIEL ACORN\nPrince Albert.\nTERRITORIAL NEWS.\n\nCALGARY\n\nFrom the Herald, June 16.\n\nLast Monday fourteen Indians were present at Okotoks, camping by calling themselves the \"Okotoks Band.\" Mr. Thomas and Mr. Macdonald visited them, and Mr. Thomas administered the oath of allegiance to seven of them. Four of these Indians were present at Okotoks on Friday night, but the others have returned.\n\nMr. F. Clarke of Toronto, who has been appointed Forest Ranger for this District, in the place of Mr. Swan, previously arrived on Wednesday's train.\n\nA number of Indians from the reserve of Calgary waited on Inspector Steele last Monday evening on the eve of his departure to End of the Road, and purchased some tobacco, also purchasing a cigar and a match receptacle, with other articles. One was bound in money and the other was bound in cheap cloth.\n\nFORT MACLEOD.\n\nFrom the Gazette, June 15.\n\nThe plan of surveying river frontage under the late Surveyor General is still being carried out as being quite pleasant, and it is expected that the Crowsnest herd will show particularly fine specimens.\n\nMr. R. K. Kennedy has gone to St. Norbert City to begin work on his claim.\n\nHeavy rain fell last Friday night and continued until Saturday afternoon. Tuesday afternoon and evening, heavy showers fell. Also very heavy snow fell yesterday afternoon. A man set out early Thursday morning and paced steadily all day, a regular old fashioned spring rain. Today is clear and fine.\n\nFort MacLeod parties—quite large—pass frequently through MacLeod, on their way to the south. The weather is very fine for the Colonists, and Mr. D. Coleman, Professor of Geology in Victoria University, is in charge of a party prospecting for a company recently composed of wealthy Winnipeg men.\n\nREGINA.\n\nFrom the Leader, June 19.\n\nA cricket match between the Government officials and the town will take place next week.\n\nThe Local Governor has appointed Joseph C. Irvine, Assistant at Regina, an agent of marriage licences for the town.\n\nA carpenter working on the C.P.R. track in this town, on Tuesday last, was killed by a falling tree. He had been working through the flesh for inches. The Presbyterian Church is to have a new organ installed.\n\nA post has been photographed by Mr. J. A. Brown of Brandon.\n\nOn Friday last Regina and Moose Jaw played a friendly cricket match at Moose Jaw.\n\nBATTLEFORD\n\nFrom the Herald, June 23.\n\nMr. Wainwright, Inspector of Indians, accompanied by Mr. Macdonald, is making his annual tour of inspection.\n\nMr. T. Quinn, acting lieutenant at Fort Qu'Appelle, went out in search of a squatter who had deserted the premises of the new agency buildings at the lake. About the 12th inst., the body of an adult male was found near the lake. It was found on the shores of a small lake a little north of the reserve. He had cut his throat and died by the accidental discharge of a gun.\n\nA band of twenty-four muleteers, going for instructions among the new reserve, left Fort Qu'Appelle for the Indian Department stock farm at West River, north of Carlton, which is under the jurisdiction of Mr. Macdonald.\n\nThe preliminary survey of the Long Lake Railway, north from Regina, was seen to be begun last week.\n\nMANITOBA.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING AND SUMMER MILLINERY.\n\nSTONEWALL.\n\nFrom the News, June 11.\n\nPrairie wild flowers are abundant in Beaudry district.\n\nA large quantity of cord wood has been gathered for the purpose of timber dues.\n\nThe picnic under the auspices of the Transcona branch, held on the Bell farm, Wednesday, was a grand success, a large number of people attending. Several stations were rendered, speeches delivered, etc., quart-pitching was indulged in. Refreshments were plentifully placed with the day's meal. About $80 was raised, which will be used toward repair of the church.\n\nThe third sheet of the Government map of Canada, now out includes the west and central section from Lake Superior to the Pacific, including Manitoba and British Columbia, the fourth sheet, is in press.\n\nMr. Wagner, M.P.P., for Woodlands, started here on Tuesday. He left the same day for the north on a survey.\n\nMINNIPEGOSA.\n\nFrom the Tribune, June 15.\n\nThe heavy rain of last night will be of considerable benefit to the country.\n\nA number of Indians have taken up residence near the town.\n\nThe city council have granted $50 towards the celebration on Dominion Day.\n\nAn action has been commenced against the Government by Mr. H. G. Henderson, of this town, for returning his land as assigned on trust. Messrs. Smith & Co., are having a valuation set on his lands given them by the Government.\n\nA large field (32 acres) on the east side of the town is now planted with wheat, and looks well.\n\nWINNIPEG.\n\nFree Press, June 18.\n\nAbout 200 Indians for the mountains arrived from the south last night. They are now camped near the station.\n\nMr. Walter Newton was struck on Saturday on Main street, and was almost unconscious for a few moments.\n\nA son of Capt. McIlwaine, of the fire department, was killed while fighting a fire.\n\nMr. and Mrs. Hume have a suit for damages, now before the court, on account of the gun discharged by Mr. Newton.\n\nA boy named Tommy Newton was drowned while bathing in the Assiniboine near Armstrong's Point yesterday.\n\nA portion of the railway at the corner of Market and Main streets caved in yesterday, the result of a washout.\n\nLongest day in the year, also the hottest.\n\nThe annual presentation of prizes at Benbow College took place last Thursday afternoon.\n\nYesterday witnessed the completion of the semi-annual examinations of the pupils of St. Mary's Academy.\n\nGENERAL MERCHANTS.\n\nPrince Albert, S.W.T.\n\nPRINCE ALBERT\n\nPlating Mills and\n\nSash and Door Factory\n\nJAMES ROSS & J. W. LEONARD,\n\nProprietors.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railways.\n\nROYAL ROUTE.\n\nJ. H. HIGHLAND, Gen. Traffic Manager.\n\nT. W. TRADALL, Gen. Passenger Agent.\n\nST. PAUL, MINN.\n\nSEEDS!\n\nPatents\n\nR. R. KEITH & CO., Seedsmen.\n\nMoose Jaw, Sask.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nCHANGES OF TIME.\n\nTime Table.\n\nTRAINS RUN ON STANDARD TIME.\n\nWE CAN VARY.\n\nWM. BARKER, Asst. Train Manager.\nITEMS OF INTEREST\n\nTHE VERY LATEST NEWS.\n\nCANADIAN.\n\nYesterday June 21. The name of Mr. C. Titus was struck off the roll of soldiers at Ogdens Hall on Saturday morning.\n\nA shooting on the Kingston Road this morning attacked a July, twenty-five feet from the house. A man named Wallace went to the lady's rescue and was attacked by the dog, receiving an ugly wound in his right leg.\n\nW. H. Wilson, a drifter from Orangeville, was captured here this morning and returned to Orangeville.\n\nToronto, June 22. A fire at the City Carriage Works, causing destruction of valuable horses, including the stallion Iron W. B. and the trotting mare Lady Duke.\n\nMrs. Ramsay, of Guelph, probably the largest woman in Canada, died today. She weighed 500 pounds.\n\nPORT ARTHUR, June 21. A disastrous fire occurred last night, also there, which took place in the morning at Queen's Hotel. The building was entirely destroyed and a number of persons were killed. The guests who had not warning in time enough to escape, with most of their effects, were saved by the efforts of Mr. William Macpherson, traveller to Carcasson & Peck, of Winnipeg, but fire had completely work of destruction. His charred remains were found among the ruins.\n\nMONTREAL, June 22. This morning the chief and valley factory of Sherritt Bros. & Co., St. Hubert, was destroyed by fire. The fire was caused by a spark from a chimney, and the building was destroyed by fire.\n\nGENERAL.\n\nLONDON, June 21. The famous Poveshell, who was arrested for murder, was released from custody today.\n\nNEW YORK, June 22. A young man named Michael, working in the house of Mr. Smith, was killed by a fall from the roof while trying to escape by jumping out of the window.\n\nAMERICAN.\n\nNEW YORK, June 21. A disastrous fire occurred this morning at the wholesale baking house of A. D. Haasen, in Williamsburg. The end of the building was destroyed by fire, and three of these were buried in the ruins. The building was entirely consumed by fire.\n\nPeter McCormick, a wealthy resident of Hunter's Point, was shot and killed by Pat Keenan, one of his tenants, who lives at a liquor store, in a dispute about rent.\n\nPHILADELPHIA, June 22. Capt. Drake, the schooner C. V. Drake, was destroyed by fire, and the vessel was destroyed by a Spanish gunboat while he was entering the Cardenas Bay. The captain says that the fire was caused by the Spanish vessel, and an explosion occurred shortly after the vessel was loaded with dynamite.\n\nA passenger on the steamer F. J. Deane, June 23. A heavy fall of snow caused the lighting system to fail. The passengers were forced to walk through the streets in search of shelter.\n\nBETTS & GWYNNE.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nThe Prince Albert Times\nAND\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVEETY, - PROPS.\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884070401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 3494, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3830, 2], [3830, 10458, 3], [10458, 13802, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]