[{"id": "bbacdf5a40a508bbcb9702f315e58b64a69f2af7", "text": "SUNDAY CHURCH SERVICES\n\nSt. Alban's: 8 a.m.; St. Mary's: Choristers; 10 a.m., service in both churches; and 2 p.m., afternoon service.\n\nSt. John's Church: 9-30 a.m.; Rev. Canon Pitt, R.H.; 10 a.m., Rev. Canon Pitt; 3 p.m., Rev. Canon Pitt; 5-6 p.m., Rev. Canon Pitt; 7-8 p.m., Rev. Canon Pitt.\n\nThe Papal Bull of Exhortation has been sent forth from the Holy See, ordering the bishops of Canada to instruct their clergy regarding the faith which they teach.\n\nImposing Ceremony\n\nThe consecration of the second Bishop of Saskatchewan\n\nOne of the most imposing of Episcopal ceremonies was celebrated in Saint Paul Cathedral June 24th, when the Ven. Archdeacon Pinkham was consecrated Bishop of Saskatchewan.\n\nThe ordinands for the consecration, consisting of the Ven. Archdeacon Pinkham and the Ven. Chaplain MacKay,\n\nhad been ordered to attend the service by letter, every available seat being occupied.\n\nLong before 10 o'clock streams of people gathered outside the church to witness the consecration ceremony, so that by the time the bell ceased tolling it was morally impossible to possess any possibility of obtaining an open seat within the church at the hour appointed when the choir was an exceptionally large one, had been increased for the occasion and selected musicians had performed a nice processional hymn. During the singing of this hymn the church dignitaries and choristers joined in processions up the entire aisle.\n\nThe service\n\nThe celebration of the service on this occasion was of a character not known in the hands of the metropolitan. His grace took the place of the Most Reverend Archdeacon MacKay, the secretary of the House of bishops, who arranged the proceedings. The opening was the reading by the Rev. Canon Pitt, Bishop-elect of the Canons chapter. Then followed the Dean of the cathedral in the choir, who read the service appointed by the metropolitan.\n\nThe procession included the Bishop-elect, his wife, two deacons, the Archdeacon and the Rev. Canon Pope, assisted by the Archdeacon and the Rev. Canon Pope, assisted by the Archdeacon and the Rev. Canon Pope, assisted by the Archdeacon and the Rev. Canon Pope, assisted by the Archdeacon and the Rev. Canon Pope.\n\nThe procession included the Bishop-elect, his wife, two deacons, the Archdeacon, the Hon. Herbert MacNamarra, metropolitan archdeacon, the Hon. Herbert MacNamarra, metropolitan archdeacon, the Hon. Herbert MacNamarra, metropolitan archdeacon, the Hon. Herbert MacNamarra, metropolitan archdeacon, and the Hon. Herbert MacNamarra, metropolitan archdeacon.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT CHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Cream Shams, Curtains, Sheets, Bedding in White and Yellow, Door Mats, Crepe Cloths, Silk Corded Cloakings, Elegant Cloth in Black and Gilt, Fine Crotamones, Ladies' Felt and Embroidery Felts, Ladies' Fancy Frillings, Breeck Veiling, Ladies' Silk Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nGO TO CANN'S BOOK STORE FOR Wall Paper AND Borders\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, August 2.\n\nThe heavy rainstorm has caused considerable damage to crops in the district. Mr. John Dooley, north of Regina, missed his barley harvest last week. Mr. P. J. Williams, Indian Agent at File Hills, will take charge of the school there.\n\nMr. A. H. Battledore, agency, who was to take the principalship of the English Church School in Prince Albert, has been called back to his duties in the east. Two inches of rain fell in the area.\n\nBishop Grinnell, who has been on a visit to France, passed through here last week on his way to his home in St. Albert, near Edmonton. His Lordship visited the new church building, which is expected to be completed by next fall.\n\nThe Leprosy Mission is flourishing marvelously. Some of the finest \"Marmots\" we ever saw are there now. The females are engaged in weaving by hand, while the men play the drums with sticks, but we are told that the city fathers will have to find some more decent work when they present our little bill.\n\nQU'APPÈLE.\n\nFrom the Progress, August 4.\n\nThe showers of rain are interfering somewhat with the harvesting, but are not causing any serious damage.\n\nThe cricketers are preparing for their match with the Winnipeg team on the 16th. It is expected to be a thrilling game.\n\nA few of the crops have lost the wind during the first part of the season, and the devastation of the gophers, but generally there is a good crop of wheat, oats, and barley. The potatoes are particularly good. Potatoes will be an excellent crop.\n\nThe members of the band have decided to play without charge for any local institution or enterprise. They appeal to the generosity of the town for assistance in bearing their heavy expenses. The band consists of about twelve members and each is required to pay $2 per month towards the salary of the bandmaster, Mr. Caswell, and the whole expense. It is therefore intended to ask the assistance of the townsmen and all others interested to assist the members of the band give them time that they should be aided financially, the children being too young until called upon. They can have their subscriptions at Mr. Caswell's bank.\n\nBATTLEFORD.\n\nFrom the Herald, July 30.\n\nThe annual meeting of the Brothers is again at work, and the sound of the wheels marks the hours of labour and of old.\n\nSgt. White, late of Regina, came in by stage from Moose Jaw and presented Major of C Division in the room of Sgt. Major Braden, Inspector.\n\nThe members of the officers and men of C Division have arranged to give a big Monday night in aid of Sgt. Cotton's family. The dance will take place in one of the new barracks buildings. It is also hinted that another compliment is in store for the Sergeant.\n\nSgt. Cotton, late of C Division, has been appointed Inspector Superintendent without a Division, with headquarters at Battleford. He will have the supervision of the Northern district, and will be succeeded in command by Capt. Macdonald, Sept. 1st. A number of other changes are likely to be made, involving a general movement of the officers in the north.\n\nEDMONTON.\n\nFrom the Bulletin, July 23.\n\nHarvesting is commencing. The grass is coming very short and the supply scarce.\n\nHeavy frosts are reported on one or two nights of the week before last and still another night may bring considerable damage. All sails bare.\n\nA heavy fall of snow occurred on Sunday afternoon last along the horse hill creek two or three miles south of Fort Mac-\n\nCALMERE.\n\nFrom the Herald, August 5.\n\nThe harvest is about commencing at Battleford.\n\nTrain loads of tea, eastbound, pass through every day now.\n\nJudge Robson's handsome stone residence is progressing rapidly towards completion.\n\nThe Bishop of Rochester, England, will visit the Territories and the Pacific coast shortly.\n\nLETTRIDGE.\n\nFrom the News August 3.\n\nAbout three hundred tons of coal are being got out of the mines here daily.\n\nThe Indian payments, it is expected, will be made in this section about the beginning of September.\n\nThe crops are looking well since the rain of last week, and most of the farmers look forward to a bountiful harvest.\n\nA rumour was afloat here this week that the Indians were about to be sent back to the Blood reserve on Sunday. We have been unable to learn the truth of the report.\n\nADVICE TO MORMONS.—Are you disturbed at night and broken of your rest by a gnawing sore near your mouth? A pint of coffee Teeth Tonic, as used at most hotels, will make a bottle of Mrs. Winslow's Soothing Syrup invaluable. It will relieve the poor little child of its fretting, soothe the sore gums, cure tympanitis, and, regaining appetite, strengthen the child, reduces inflammation, relieves coughs, etc., etc. Mrs. Winslow's Soothing Syrup is used extensively by physicians and nurses throughout the world. Price 10 cents. Send for free Soothing Syrup and take no other syrup.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling!\n\nAMBER—(Hop)—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROND\n\nRUSSEL & DAVIS,\n\nWHOLESALE & RETAIL\n\nButchers—\n\nBeef, Pork, Mutton, Sauage, Bacon, Ham, and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nNotice to Creditors.\n\nEstate of George Buck, deceased.\n\nThe creditors of G. Buck, late of Winnipeg, who died on the 11th day of May last, are hereby notified that the said estate are hereby notified to send post-petition claims to Mr. H. H. Newlands, Solicitor, Prince Albert, or to below named persons, whose names, addresses and description, the full particulars of the claim, together with their accounts and the nature of the same, must be sent immediately after default thereof and immediately after the said H. H. Newlands, Solicitor, or said George Buck, deceased, will be determined, and the said creditors, having regard only to claims, of which notice shall have been given above, will be entitled to receive from the said George Buck, or having any property in his hands, or in his possession or custody, notice is hereby given that unless the same is paid within thirty days, proceedings will be taken.\n\nOWEN E. HUGHES,\nAdministrator.\n\nH. W. NEWLANDS,\nSolicitor\nPrince Albert, N.W.T.\nJuly 20, 1887.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.,\nNewspaper Advertising Bureau,\n10 Spruce St., New York.\n\nNotice to Creditors.\n\nNOTICE is hereby given that all creditors and others having claims against the estate of Mr. William Morris, deceased, of Prince Albert, in the District of Saskatchewan, Canada, who died on the 11th day of May last, are hereby notified to send post-petition claims to Mr. H. H. Newlands, Solicitor, Prince Albert, or to below named persons, whose names, addresses and description, the full particulars of the claims before the 10th day of July next, or to Mr. William Morris, Administrator of the said estate, or to the said H. H. Newlands, Solicitor, or said William Morris, deceased, will be determined, and the said creditors, having regard only to claims, of which notice shall have been given above, will be entitled thereto, having regard only to claims, of which notice shall have been given above, will be entitled thereto.\n\nNotice this 8th day of Aug., A.D. 1887.\n\nBAIN, PRUD'HEM & ROBINSON,\nSolicitors for the Administrator.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspapers in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of Canadian, American, British, French and United States News.\n\nSpecial news reports compiled by reporters stationed throughout Manitoba, the Northwest Territories and the British Empire.\n\nComplete reports of Parliamentary proceedings in Ottawa, Canada.\n\nTHE MORNING CALL also receives the night dispatches of the United Press, Chicago, and New York, and has a news service unequalled west of the Rockies.\n\nSubscription rates: One year $2; six months $1; three months 50¢. Shortly after publication, the subscription must be paid to any address on application.\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS,\nPresident and Editor-in-Chief.\nLACROSSE\n\nPrince Albert vs. A.W.M. Police.\n\nA very interesting and exciting match took place between the above clubs on Saturday evening last, which resulted in a victory for the former by three games to two.\n\nThe game was keenly contested throughout the game by the members and spectators present, and enthusiastic and valuable demonstrations of enthusiasm and skill were exhibited during the course of the play.\n\nThe weather was everything that could be desired. The individual play of the Prince Albert club excelled that of the Police, their teamwork being very effective. The Police were good at throwing, but the running and dodging was all that could be desired for. And there were several instances where directions of purely elements the spectators, players, and officials, and the players of both teams made some excellent final exhibitions of the game yet made.\n\nMr. Goo. C. A. Land was again chosen as referee, and his decision was always accepted by both teams.\n\nThe men were called out. The names and respective positions on the field stood as follows:\n\nJ. Wigness goal Const. Leslie\nW. R. Fish point St. Denis\nA. A. B. Spratt center Poveshull\nJ. Russell & J. Field defense\nN. McKenzie do Sergt. Talbert\nJ. Olford center Corp. Bailey\nJ. Russell & J. Field defense\nJ. Knowles do Aike\nW. V. Maclean house Capt. Laraway\nG. Knowles do Davis\n\nThe first game was rather one-sided. The town team handled the ball on the Police side of the field, and were quite unsighted, during which some excellent defense and home play was manifested. Knowles scored an splendid pass through the Police goal, scoring the first goal for the Prince Albert team.\n\nTime - 3 minutes.\n\nThe second game was of longer duration, both teams laying themselves out for a good afternoon's work, and though not interesting as a game of lacrosse, was nevertheless well contested. The Prince Albert defense played a magnificent game, and the Police were good for their plucky performances, especially Fish, Spratt and Wigness; but despite their efforts they were unable to secure the game for the Police team.\n\nTime - 15 minutes.\n\nThe third game was more interesting, the Prince Albert boys displayed by the most skill, Russell and Olford working wonders. The Police, however, after two matches had hardly been played, one resulting in a hollow victory for the town club and the other in a close game, may be said to have given up, but no number of defeats and no number of matches will persuade call foul on the part of absolute honesty used during this game by none of the police on backs, language or which in no way impaired the good order and moral tone of the community, and which justify calling forth a general expression of sympathy toward the Police team.\n\nThis game Spratt got his thumb broken, caused by two blows with a increase from the Police. After this time, Knowles again secured the rabbet and the second game for the Prince Albert club.\n\nTime - 25 minutes.\n\nThe fourth game was the one in which perhaps the best skill was shown, and the Police and Police again upheld the reputation of the Police, while Knowles, Russell and Maclean did some service for the Prince Albert side.\n\nThe Police finally won. But it put an end by Knowles, scoring goals for the Prince Albert.\n\nTime - 25 minutes.\n\nThe fifth game was the one that took gigantic efforts to avoid what seemed an inevitable defeat. The home play of the Police was excellent, and they did so much for the Prince Albert defense, who were considerably weakened by loss of Spratt. By a combination of their efforts, the Police did good work for a second game. Time - 10 minutes.\n\nThere was still 12 minutes to spare of the fifth game, but the Police were too late to be called before either side changed sides; therefore there gave the game its name.\n\nJames Sinclair acted as umpire for the latter, and Sergt. Parton for the Police.\n\nThe Police Lacrosse Club were afterward visited by Mr. Robertson, Mayor Macintosh presiding. Numerous toasts were proposed and responded to, and several songs were given. After a meal was eaten, the party adjourned to the gathering dispersed about ten o'clock, on the singing of God Save the Queen.\n\nGENERAL NEWS.\n\nLondon, August 1. The Canadian cricket team finished their visit at the cricket grounds near the town of Sussex. The score of Canada for the first innings was 78, and the second 15x. Sussex, first innings 296; second, 23 for one wicket.\n\nParis, August 2. The seconds of Mr. Ferry's expedition returned last night and decided that a duel between the two examiners was necessary. The meeting will be arranged as soon as possible.\n\nNew York, August 4. A cablegram has been received from Erin Paulin, February 10th. He was then alive and well.\n\nThe Governor of New York is exploring expedition. He had apparently heard nothing of Stanley's plan for finding him.\n\nRome, August 3. The Pope has decided that the Vatican shall take an active part in political affairs and the other Roman Catholic nations. A commission to canvass the clergy of the country with a view of building up a strong Catholic party in Italy and forcing the Government to concessions.\n\nHavana, August 3. There are now 100 Canadian vessels on the merchant ships looking after American fishermen, and 100 vessels and very powerful boats and the American coast guard, but with the presence of so many enemies on the look out, the opportunities for the Canadian fishermen are limited.\n\nCapt. Laraway states that for weeks at a time he has not been able to get a vessel to go out and fish, and he follows every move of the Americans.\n\nOtto, August 2. There was an important Cabinet meeting at the Palace. It was decided to send a special mission of American fishing crafts. The proceedings are not known. It is said that the mission will be sent to urge Canada to make certain concessions, at the least only of enabling Great Britain to maintain her friendly relations with the United States.\n\nSHIP TUMBLER.\n\nA very respectable-looking citizen called at a house on Fourth avenue yesterday afternoon and asked very politely if he might see the owner or any of the inmates. When admitted to start off with the inquiry:\n\n\"You have been up North for a few days?\"\n\n\"Yes, sir.\"\n\n\"Your husband was with you?\"\n\n\"Yes, sir.\"\n\n\"One of the chief amusements was fishing?\"\n\n\"Yes, sir.\"\n\n\"He had good luck, didn't he?\"\n\n\"Yes, sir.\"\n\n\"Catch one pleated weighing—let me see—weighing how much?\"\n\n\"I don't know.\"\n\n\"Leave this house at once! I see through your pernicious mask of villainy.\"\n\n\"I have never had any such idea.\"\n\n\"I have heard that he caught an eighteen pounder, you can't get me to believe the story by a single ounce!\"\n\nGo, before I lash you.\"\n\n\"And he goes—Detain Free Press.\"\n\nThe Sherlockian Detective.\n\nUp to the present moment no satisfactory reply appears to have been received regarding the question of the authenticity of the protests with reference to the seizure of sealing Canadian vessels by the United States authorities, and that the seizures took place a year ago. Several vessels were within the sea, but hundreds of miles from land, possessed of sufficient fuel for a long trip.\n\nA First-class Livery, Feed and Sale Stable\n\nOpposition is the Life of Trade\n\nJ. R. McPhail's\n\nMachine Oils,\n\nAmerican Coal Oil\n\nLow Prices. Good Value. Prompt Attention\n\nAT\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nAND\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings,\n\nTrowsering and Overcoating\n\nWORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887081901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 4573, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3059, 2], [3059, 11633, 3], [11633, 19267, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]