[{"id": "1f0a9e85e36ed2be9e537effef9e6815863df4f5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 26, 1867.\n\nBANKINGHOUSE OF\nMa-janthor & Knowles,\nPrince Albert, N.W.T.\n\nCheap Groceries\nCanned Goods\nAlso Cigars.\n\nR. T. GOODFELLOW,\nCorner River and McKay streets.\n\nROB'T BUCKLEY,\nAuctioneer,\nAccountant,\nGeneral Agent\n\nFOR THE\nBest Assorted Stock\nOF\nCONFECTIONERY\nGO TO\nH. M'DOUGALL'S\nBAKERY.\nGoods delivered to all parts of the town free of charge.\n\nTHOS. ORAM,\nProprietor.\n\nTHOS. ORAM\nCANNOT BE BEAT\nThe Cheapest, the Best, and the Largest Stock of\nBOOTS AND SHOES,\nEver offered in Prince Albert.\nWe purchase all kinds of used boots and shoes, and will give the best prices for them.\nDon't go anywhere else; we'll give you the very best prices.\n\nSHANNON & McLEOD\nMrs. Jas. A. Fraser\n\nMILITARY FANCY GOODS.\nFlowers and Fancy Goods,\nwhich was selected by Prince Albert.\n\nGILBERT E. CARTER\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nBLACKSMITHING FOR SALE,\n\nISAIAH McCOLL,\nGeneral Blacksmiths,\nCHURCH STREET\n\nWM. TAIT,\nAt The Black, River Street.\n\nTELEGRAPHIC\nDominion Land Surveyor.\n\nFRANCE ALBERT\nA. C. PATTERSON,\nForwarding Agents.\n\nTO AGENTS\nFor the sale of\nBlack River Needle\nFrom Street East, Territorial Road, near the North Western Hotel.\n\nTHE OLD RELIABLE\nA LARGE SUPPLY OF THE GOOD OLD\nWEIGHT CLOCKS,\nNICKEL CLOCKS, WALNUT REGIM,\nAND SWISS WATCHES.\n\nPost Office Jewellery Store\nRepairing done neatly and warranted.\n\nR. B. WAY\nQUEEN'S HOTEL.\nLeading Hotel in Saskatchewan.\nBoard by the day or week.\n\nROYAL MAIL STAGE\nWeekly\nBetween Prince Albert and Prince Albert.\n\nJ. D. HANAFIN,\nReal Estate Agent and Assessor.\n\nFURNITURE\nCHEAPER THAN EVER.\nFor the new thing, dark wood, polished, polished wood, polished wood, polished wood.\n\nWILLIAM KNOX,\nCarpenter, Etc.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nBLACKSMITHING FOR SALE,\n\nISAIAH McCOLL,\nGeneral Blacksmiths,\nCHURCH STREET\n\nWM. TAIT,\nAt The Black, River Street.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Visitors.\n\nAbundant crops:\nMagnificent harvesting weather!\nFly Poveshuud Clark's Drug Store.\nThe new school is ready for the road.\nBlue berries are very plentiful this season.\nMrs. Macarthur, wife of Mayo Macarthur, recovering from her illness.\nMr. Angus Thomson left town Wed evening for a visit to his son Mr. John.\nMr. John Stewart of Stewart Bros., left for the east Wednesday last to purchase goods for his firm.\n\nMr. J. O'Grady has sold his homestead over the corner of Third and Church streets to Judge Maclean.\n\nMr. Alexander Maclean of McGregor on Monday at the death of his brother Alexander Maclean of Winnipeg.\n\nMr. T. J. Agnew has purchased two acres, a half acres on the hill from Mr. Thomas Murray, paying $500 per acre.\n\nBy the end of the week the majority of the harvesters will have their harvests cut, and a large number of them will have commenced cutting wheat.\n\nMr. Charles Inglis, Fairford, Bridgeton, of Cumberland, left Monday for Winnipeg to attend the annual general meeting of the H. B. Co. there.\n\nIt is glad to hear that Mr. John A. Maclean has secured the best contract at Prince Albert this season. This will enable the farmers to dispose of their surplus stock.\n\nMr. J. G. Campbell, Mr. J. M. Campbell, Mr. W. Murray by mail stage last Wednesday on a business trip. Mr. Stewart going off as far as New York.\n\nMr. J. L. Johnson has purchased half a lot Maclean street from Maclean Brothers for $400 as a speculation. Mr. Foster has purchased a lot for $300 as a speculation.\n\nAyres & Co., Carter Mills, Hayley's Falls, Lord's Falls National Park, Holmby's Falls, Carter's Falls, Holmby's Creek, Indian Head Falls, and Lydia Fink's Falls.\n\nWork will be resumed in the Franklin High School on Thursday the first day of October at nine o'clock a.m., in the absence of the Board members who are expected to be present on the first day.\n\nThe Executive of the Louis Agassiz Society has instructed A. H. Clark, treasurer, to collect the amounts due on the society's list of members for special prizes before next April 1st, so as to enable them to make their annual report to the association.\n\nMr. David Adams, who is a member of the board, has purchased a new horse from the house of Mr. H. C. Waite.\n\nMr. Ernest Foster, of Holmby's Falls, Fink's Falls, the best quality, and the satisfaction that it gives is evident. We may state as well as a great satisfaction for the band.\n\nLast Friday evening the P. A. C. Band was out rendering the town.\n\nThe band played \"God Save the Queen\" and several other selections, which was won by Mr. Tom Bird, came to hand last week.\n\nIt is very satisfactory when one finds a good, well-balanced orchestra, but not bad, but not weakly, entirely engaged, with a heavier than usual attendance. In regard to the musical art, Mr. Bird, highly, and deservedly complimented Mr. Bird for his greatest efforts during the season, to which end he had applied in a method and fitting manner.\n\nLast Clark's Olympic Cream for burning, soothing, and cleansing the skin.\nThe Buffalo Times is \"far out\" and lots of it. It says: \"Recent events in connection with fisheries on the Atlantic coast of Canada are likely to indicate that our 'Kanuck' neighbors are more than anxious to coax a blister on the Dominion's nose. The Canadian Government has well-known leaders of the most patriotic character have been issued by the American owners of fishing vessels to observe in every way the provisions of the fisheries laws, and yet, on the slightest pretext, have been grounds that appear to the remotest manner even a technical violation, American vessels are pounced upon and subjected to embarrassing and costly delays, and to other important matters. How would it do instead of 'blotting' the Canadian nose, for the Americans to stop stealing our fish? As the Buffalo Courier says, in its letter to the local correspondent, the \"If American fishing vessels would not permit in going into Canadian waters to fish, there would be much less difficulty in reaching a satisfactory settlement of fishery disputes.\"\n\nDuring the Home Rule debate last year there were frequent matters of a coming demand for Home Rule for India. At the General Election meeting, one Indian gentleman offered himself for election with the avowed purpose of inaugurating a Home Rule movement for India, and pressing the subject at the Government, which was expected to grant that boon to Ireland. But that Government did not return to power, and we have heard little of the matter since, the tactics of the Home Rule party for India having proved a much heavier one than was anticipated by its confident adversaries. Remembering this agitation, it is somewhat astonishing to find that, little reason as there is for expecting it from Kent, Ireland, this reason is a maximum in comparison with the infinitesimal right to a similar concession possessed by India. Some degree of capacity or fitness for self-government is surely demanded before this privilege may safely be granted; but however it be in Ireland, in India there is visible next to none. It appears that the total number of graduates in Indian Universities during the twenty years preceding 1883 did amount to 5,000. There are others besides these, but it is impossible to reckon the educated natives of all classes at more than 25,000 in all. The native population is approximately 250 million. Of the 250,000 educated natives, a very carefully selected minority are fit for the Civil Service, which brings us to the result that out of 250,000,000 crying natives there is only a fraction of any size fit to take part in the business of Government, whether as civil servants, magistrates, or legislators. Evidently an Indian party in the House, to succeed the Irish aristocracy when they go to Dublin, would be premature at present.\n\nBISHOP PINKHAM.\n\nThe Right Reverend Mr. Cyprian Pinkham, who in accordance with the wishes of His Grace, the Archbishop of Canterbury, was consecrated as Bishop of St. John's, Newfoundland, was born in St. John's, Newfoundland, in 1844. He was educated there after having had charge for a time of public school in one of the suburbs of London. He was ordained deacon in Canterbury, in 1865. During 1866 he was appointed as private tutor in the house of Sir Robert Peel. After a period of the ordinary life during 1868-1870, he was ordained as priest in the church of St. Mary Magdalene, but in this his wish was overborne by what appeared to him to be a call. After his ordination he became a member of the S.P.G., board of examiners, the secretary of the society. Mr. Ballock, officer of the society, wrote to Mr. Pinkham and thought not at first disposed to accept after earnest consultation with Canon Hackett, who had been engaged to terminate his services as organist, and a month later sailed for Canada. On his arrival in Canada Mr. Pinkham was appointed to the parish of St. John's, Newfoundland, and was elected Bishop of St. John's, Newfoundland, and was consecrated as Bishop of St. John's, Newfoundland, in 1883. In 1884 he was sent to England to study the administration of the Church, and his practical suggestions are largely due to the efficiency of the present administration of the diocese. Among the matters which may be mentioned the collegiate department in our public schools, which are superior to the high school system, but form, as it were, a link between the public school and the university examinations, a close connection between the Board of Education and the University council. In 1881 he was elected Secretary of the Council, and in 1883 Archdeacon of St. John's. He has been a member of the Provincial Council since its formation in 1874. He is also a member of the council of St. John's college and has always taken the greatest interest in its welfare. Indeed, he has been instrumental in promoting whether in organizing the diocese or planning the course of our church in general. He has been too busy to forget his services in furthering the cause of education in this country, so that the Society's work is being felt all over the district. Look at the success of the new school, which makes each one trying to get the best possible school to compete for the magnificence of the buildings and the excellence of the management. The annual membership fee of the Society is only one dollar, which enables each member to make as many entries as he chooses. Every settler interested in the advancement and welfare of this district should become a member by mailing the enclosed card. The Society financially, besides enabling the exonerated to receive a larger government grant of land. The Society are greatly in need of suitable buildings and land, and if the members will fill up it will enable them to build next year.\n\nNew York, Aug. 15.—The Herald publishes a sensational story from Ottawa to the effect that a man from Montreal, who was killed off the St. Lawrence shore of New Brunswick, says a British cruiser fired upon an American fishing schooner three days ago and sank her with all hands all on board. The stranger says that the cruiser at once put to sea, but that the American vessel was sunk by American vessel's gun by the board when she was shot from the cruiser and that the fishermen were drowned instantly. He states that there were 15 sailors drowned.\n\nMontreal, Aug. 6.—Hon. Col. Dilworth, who accompanied the Windsor team, says the team won over £400 in prizes, and proved themselves to be equal to the best British shots.\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, August 9.\n\nSergt. W. C. Asprey has received his promotion as Staff sergeant.\n\nThe inspection of the Indian Department buildings was being proceeded with.\n\nMr. Tom Wilson, of Beaver Creek, 40 miles from Saskatoon, was in town last week. He says the crops in that district have been destroyed by Rocky Mountain locusts.\n\nNearly all the reports received to date from various parts of the Territories refer to the harvest. Most observers say that the present harvest will prove a bountiful one.\n\nSergt. Farmer, for some time band master here, left on Thursday with ten men to join 1st Division at Prince Albert. Imp. Brigade. Will be with the party a portion of the way.\n\nFrom the Journal, August 11.\n\nSergt. McPherson returned on Monday from the border. He says the Indians are friendly. He followed them into Dakota, being only half an hour behind them in crossing the river. The Indians, however, authorities refused to give him any assistance in securing the murderers. The matter, however, will not be let go, and the proper steps will be taken to obtain the offenders and efforts to secure the culprits removed.\n\nMr. and Mrs. Robert Leonard, left for Victoria, Mon., Aug. 12. Mr. Leonard has been leader and instructor of the Regina Brass Band for several years and has brought it to its present state of proficiency. The band boys assembled at the station on Tuesday night to give their departing leader a farewell dinner.\n\nBATTLEFORD.\n\nFrom the Herald, August 6.\n\nOn Tuesday afternoon a hail storm came down in great volume and buried the northern face of the Eagle Hills. It struck Geo. H. Harpier's fields with full force, causing considerable damage. Had there been two-thirds less crops damaged and Peter Dakton a few acres of grain the edge would have been saved. It seems that the order now of potatoes in P. H. Harpier's field was cut while the rest escaped. The hail was very heavy, coming off leaving the branches as bare as in winter, and some good hay grounds are completely ruined. Many of the hail stones were as large as a man's fist.\n\nSome weeks ago a colony of grasshoppers attacked and ate the plains between the Bird's Nest and the Long Lake Current trail, and for the distance of about a day's travel consumed off every blade of grass. They are now stronger than their growth; they ate down everything within reach, and so starved to death. Today they lie thick upon the ground and nowhere to appear upon a smooth ground of grass, such as will make excellent feed for animals used in freighting. That same pasture is just doing harm another year.\n\nEDMONTON.\n\nFrom the Bulletin, July 30.\n\nThe hail storm of Sunday (17th inst.) took ten acres of barley and damaged seven acres of oats. The wind tore the Cameron of the Sturgeon, and breaks several windows in C. Pardee's house and damages the corn crib.\n\nJ. Lammert was exposed to have his new steamboat running today. He was engaged in carrying a crane tug bought up to Saskatoon. Aug. 25.\n\nAn accident fell on the Sway canoe at Horn Point, Saskatoon. Lord, who was out to look for a cow, was returning this past, half a mile from the Indians' houses. Lord was killed instantly by a stone, and three miles from the H. B. post. The Indians had been watching the river, and being to board daylight the steamer came up near by the Indians, so the Indians, to prevent the steamer from entering, the appearance of a small vessel came. While still a considerable distance away, Lord was shot like the appearance of a cannon and killed instantly. The report was heard by Mr. Taylor, who was watching the Indians, who were watching the steamer. The news spread of murder, and was caused by the Indians' presence in the high, however, and the Indians were seen by Mr. Taylor, who immediately started for the scene of the affair where the steamer was exploded. This appearance was also heard by Mr. Taylor, who immediately started for the scene of the affair where the steamer was exploded. This appearance was also heard by Mr. Taylor, who immediately started for the scene of the affair where the steamer was exploded. This appearance was also heard by Mr. Taylor, who immediately started for the scene of the affair where the steamer was exploded. This appearance was also heard by Mr. Taylor, who immediately started for the scene of the affair where the steamer was exploded.\n\nCALGARY.\n\nFrom the Herald, August 12.\n\nA number of prominent citizens called upon Mr. Wilson last night and startled Rev. Father Lacombe by presenting him with a gold watch. The prominent citizens included Mr. Ross, and among those present were: Mayor King, Major Walker, Mr. Rowe, James Ross, Mr. Alexander, Mr. Smith. Father Lacombe made a brief speech, thanking his friends for their kindness and expressing his sorrow at the death of Rev. Father Andrés. He spoke a few words. He said the reason Father Lacombe came from Calgary was because he had heard that Father Andrés along the Saskatchewan were still discontented and not disposed towards the government. He went with Andrés and restrained them during the rebellion; therefore, he thought it necessary to send messengers. Father Lacombe admitted the Indians were Indian character and who were not mixed in the relations, and who were not connected with those interests. After a cordial handshaking all round the surprise party returned to town.\n\nGENERAL NEWS.\n\nParis Aug. 10. The Boulangar-Ferry affair has ceased to be a live topic in social, political, and official circles but interesting. The evidences have been laid out among the members of the league, who believe Ferry was afraid to meet Boulangar, and who think Boulangar forfeited the respect of all patriotic Frenchmen. It is contended that such men are more to be believed than the agents of terrorism. If the case can possibly be inserted and the question is commonly put forth that France were to be treated with proper respect by Germany until Boulangar's return, the war offensive a minute of her own choosing. The action of Mr. Katkov has greatly increased the animosity against Boulangar. His power, and the enemies of the commander of the thirteenth corps enlisted in the cause of the republic. Boulangar had tendered his sympathy before offering his own in order to secure another point of attack. In view of the popular popularity of the masses, the Patriarch league is a powerful organization, and Boulangar's return will be hailed. It will ever call upon his sympathizers to follow him across the German border remains to be seen.\n\nVienna Aug. 12. The Political Correspondence publishes a dispatch from St. Petersburg stating that in addition to the question of Russia and England have agreed, in the event of the death of the Amir, the partition of Afghanistan.\n\nNiagara Falls, Ont., Aug. 14.—The largest crowd of people that has gathered at the Falls since the opening day of the free park was seen yesterday. The Algonquin Camp crosses the river on the ferry boat, and the crowd which is now in these waters, and King's children as an interlude, have been charged. It is said that the light machine would easily resist the turbulence of the waters when the falls, and King's boat was provided with engines before Corps reached.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nPRINCE ALBERT\n\nBREWERY!\n\nPure and Sparkling!\n\nAMBER--(Hop)--ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROND\nRUSSELL & DAVIS,\nWHOLESALE & RETAIL\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\nBROWN'S BRICK STORE.\n\n\"BELI.\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull table and telegraphic reports of current European, Canadian and United States News.\n\nSpecial news supplied by resident correspondents throughout the Dominion, British Dominions and British Columbia.\n\nComplete reports of Parliamentary proceedings.\n\nTHE MORNING CALL alone records the latest dispatches of the United Press, and supplies the latest news service unequalled wealth of information.\n\nSubscription rates: One year $1; six months $5; three months $3. Similarly in Canada, payable annually by mail. No address on application.\n\nSubscribe now Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS,\nPresident and Editor-in-Chief\nANNUAL MEETING\nof the Saskatchewan Rifle Association.\n\nThe third annual meeting of the association took place on Tuesday and Friday of last week. The weather was everything that could be desired. There was a cool breeze, a cloudless blue sky, and a lovely sunshine. Friday was also a bright day. The Thursday morning was rather cool and wet, but gradually changed for the better as the day came from the north.\n\nThere was a larger number of competitors than on former occasions. Owing to some delay on the part of the Range Committee the firing did not commence until 10 o'clock, when all entries were sent in for the match.\n\nThe match was the first match of the day, and the range was set at 200, 300, and 600 yards, seven shots at each range. Mr. Andrew Goodfellow made the highest score, followed by Mr. D. Williamson and Mr. J. McKay. The following were the 20 successful competitors:\n\n| Name          | Score |\n|---------------|-------|\n| Mr. Goodfellow | 84    |\n| Mr. Bishop    | 79    |\n| Mr. McKay     | 75    |\n| Mr. Bishop    | 73    |\n| Mr. Kennedy   | 72    |\n| Mr. Kennedy   | 71    |\n| Mr. Bishop    | 70    |\n| Mr. Kennedy   | 69    |\n| Mr. Bishop    | 68    |\n| Mr. Bishop    | 67    |\n| Mr. Bishop    | 66    |\n| Mr. Bishop    | 65    |\n| Mr. Bishop    | 64    |\n| Mr. Bishop    | 63    |\n| Mr. Bishop    | 62    |\n| Mr. Bishop    | 61    |\n| Mr. Bishop    | 60    |\n| Mr. Bishop    | 59    |\n| Mr. Bishop    | 58    |\n| Mr. Bishop    | 57    |\n\nThe team match was composed of ten men of the civilian portion of the Association and ten from the N.W.M. Police. The range was set at 200, 300, and 600 yards, seven shots at each range. Each team had 400 points added by the Association making a total of 800 points.\n\n| Name          | Score |\n|---------------|-------|\n| Mr. Bishop    | 84    |\n| Mr. Bishop    | 79    |\n| Mr. McKay     | 75    |\n| Mr. Bishop    | 73    |\n| Mr. Kennedy   | 72    |\n| Mr. Kennedy   | 71    |\n| Mr. Bishop    | 70    |\n| Mr. Kennedy   | 69    |\n| Mr. Bishop    | 68    |\n| Mr. Bishop    | 67    |\n| Mr. Bishop    | 66    |\n| Mr. Bishop    | 65    |\n| Mr. Bishop    | 64    |\n| Mr. Bishop    | 63    |\n| Mr. Bishop    | 62    |\n| Mr. Bishop    | 61    |\n| Mr. Bishop    | 60    |\n| Mr. Bishop    | 59    |\n| Mr. Bishop    | 58    |\n| Mr. Bishop    | 57    |\n\nThe Association match began about 3 p.m. Thursday afternoon. The range was set at 200, 300, and 600 yards, seven shots at each range. Mr. Bishop made the highest score, and won the President's gold medal and $10. The following were the winners of the 20 prizes awarded:\n\n| Name          | Score |\n|---------------|-------|\n| Mr. Bishop    | $8    |\n| Mr. Bishop    | $7    |\n| Mr. Bishop    | $6    |\n| Mr. Bishop    | $5    |\n| Mr. Bishop    | $4    |\n| Mr. Bishop    | $3    |\n| Mr. Bishop    | $2    |\n| Mr. Bishop    | $1    |\n| Mr. Bishop    | $0    |\n\nThe meeting was held at the Royal Baking Powder Factory.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887082601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5752, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4978, 1], [4978, 11456, 2], [11456, 20342, 3], [20342, 23261, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]