[{"id": "c4528fdebcda3692ca1c7d6e432cfdb74452b332", "text": "THE PRINCE ALBERT TIMES\nSASKATCHEWAN REVIEW, PUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\nTERM $—REGULAR FREE!\nLetters to be inserted in this paper! Business Inquiries 10c per line.\nNo Advertising inscribed for less than $5,\nAdvertisements under instructions will be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nHON. DAVID LAIRD\nHon. David Laird has at last arrived in Prince Albert. Cast off by his friends in the North-West P.E.I., who thought, and with good reason, too, that Mr. Laird was a most ridiculous fellow, who had no sympathy with the people of Saskatchewan,\nHe is, however, astonished at the propensity which some have given the City stone after he was here last, that he will not, now that he has returned from the Governor has been a prominent man in the Northwest Territories for five years, but I was put in a good position not my own when Mr. Laird came out. Mr. Laird is a hard worker, but he is still lazy and fond of doing part of the work himself, so that he cannot do very much.\n\nMr. Laird has shown himself to be a capable leader, but he must have the support of the people around him. If he does not get their support, he will find himself in a difficult position.\n\nThe Liberals have found out what to do now; they will cast off their old followers, and attract new ones. The Conservative leaders have also been casting off their old followers, and attracting new ones.\n\nMr. Laird's nomination is an insult to the intelligence of the Liberals of Saskatchewan. We must assume that they have not within their party resident here one who has the power of the electors of Cochrane, as Mr. MacDonald does; and if we have to contend with his influence, then we must abandon all hope of success.\n\nMr. MacDonald has so many followers, and he has such a large following behind him, that it is impossible for any other man to succeed against him.\n\nMr. MacDonald is a man of great experience, and he has always been able to turn his hand to any job. He has been a member of Parliament for many years, and he has always been able to win the votes of the electors.\n\nMr. MacDonald has always been able to win the votes of the electors, because he has always been able to present a case that is both fair and reasonable.\n\nMr. MacDonald has always been able to present a case that is both fair and reasonable, because he has always been able to present a case that is both fair and reasonable.\n\nMr. MacDonald has always been able to present a case that is both fair and reasonable, because he has always been able to present a case that is both fair and reasonable.\n\nMr. MacDonald has always been able to present a case that is both fair and reasonable, because he has always been able to present a case that is both fair and reasonable.\n\nMr. MacDonald has always been able to present a case that is both fair and reasonable, because he has always been able to present a case that is both fair and reasonable.\n\nMr. MacDonald has always been able to present a case that is both fair and reasonable, because he has always been able to present a case that is both fair and reasonable.\nADDRESS\nTo the Electors of Saskatchewan\n\nGentlemen:\n\nAt the request of a number of friends in the District of Saskatchewan, I beg to offer myself as a candidate for your suffrages at the coming election as a member for the Federal Parliament.\n\nShould I be returned as your representative I shall use every endeavor to secure the local interests of the District, and call upon the Government for the necessary facilities for the construction of a railway from Prince Albert, Battleford and Saskatoon.\n\nThe building of a bridge across the South Saskatchewan River;\n\nThe granting of assistance to the railway to Hudson's Bay;\n\nThe more liberal issue of scrip to all children of Halfbreed heads of families born in the Territories between 1870 and 1885;\n\nThe consideration of the permit system by putting the liquor question to the popular vote;\n\nThe speedy payment on a liberal scale of the claims against the Government for losses;\n\nThe granting of seed grain free, on account of the recent circular starvation in which the settlers of this district were placed;\n\nThe amendment of the Land Acts in such manner as to secure convenient settlement;\n\nThe granting of positions under Government;\n\nThe purchasing of supplies for public purposes within the district in which they are consumed;\n\nThe passage of a Legislative Assembly for the Territories in which Saskatchewan shall have full and proper representation.\n\nAs the men whose interests are closely identified with the future of Saskatchewan, I appeal to every elector in the district for support during the contest.\n\nI am, gentlemen,\n\nYour obedient servant,\n\nD. H. Macdonald\n\nAux Elecuteurs du District de Saskatchewan.\n\nMessieurs:\n\nA la demande d'un nombre d'hommes du District de Saskatchewan, j'ai bien l'honneur de m'offrir à vous comme candidat; sollicitant vos suffrages dans l'élection à venir pour le Parlement Federal.\n\nDans le cas où je deviendrais votre représentant, je ferai tout mon effort pour faire entendre les voix du District et de presser le Gouvernement sur la nécessité des communications par voie de chemin de fer entre Prince Albert, Battleford et Saskatoon.\n\nLa construction d'un pont sur la Rivière Saskatchewan Sud;\n\nLa construction du chemin de fer de la Baie d'Hudson;\n\nLa construction plus liberale de terrains destinés aux familles Metis nées dans les Territoires depuis 1870 jusqu'en 1885;\n\nUne nouvelle considération du permis de vendre, limité seulement à la question de l'alcool à la voix du peuple;\n\nUn paiement prompt et liberal de toutes justes reclamations, pour percer;\n\nD'accorder gratis les grains de semences à tous les agriculteurs de ce district, vu les circonstances particulières dans lesquelles se trouvent les cultivateurs;\n\nD'examiner l'Acte des Terrains afin de permettre la concentration des établissements;\n\nDe nommer des personnes du lieu pour remplir les positions du Gouvernement;\n\nD'acheter les approvisionnements des terres aux travaux publics du district même ou elles sont consommées;\n\nDe former une Chambre Legislative dans les Territoires à laquelle Saskatchewan sera fortement représentée.\n\nComme étant un homme du lieu, dont les rapports entre les entretiens\n**ELECTION NOTES**\n\nOn this day, from Troy Mr. Laird held a meeting at Butte. About forty Halfbreeds were present, as also Messrs. Sergeant, Mr. Davis, and Mr. Macdonald of the Liberal Association. Prime Minister Laird went out to meet him. There were also present at this meeting Messrs. Craig, Grant, T. Baker, Beaucage, and others of the Liberal Conservative Association. Prime Minister Laird spoke at some length, touching upon several important matters. He charged Sir John Macdonald with paying ten million dollars for a re-election. He also said that Sir John Macdonald was now known to be absolutely false. He met the argument that he was not residing in Prince Albert by saying that he would possibly visit Saskatchewan once a year, and ascertain the needs of the people whom he represented. He also said that he would do his best to make peace, or explain why he was doing so. He also said that he would do whatever he could to help the French-Canadian people.\n\nMr. Laird then delivered a Reilite address in French, and T. O. Davis spoke. Mr. Davis spoke briefly about the situation in Quebec.\n\nSpeeches were made by reply from Messrs. Craig, Grant, and Beaucage.\n\nA prominent lawyer has been engaged as counsel for Mr. Laird, and a former principal of Halfbreed schools, and a former member of Parliament, Mr. Macdonald, has been engaged to defend him. Mr. Laird has been charged with being a half-breed, and therefore not entitled to be elected as a representative.\n\nThe meeting ended with a toast to Mr. Laird's success.\n\n---\n\n**NOTICE**\n\nThe business of the undersigned is being closed up.\n\nAll parties doing said firm will please settle at once at the old stand.\n\nBalance of stock at hand under cost for cash.\n\n---\n\n**MISS MACK & CO**\n\nFirst Door East Telegraph Office.\n\n**RUSSELL & DAVIS**\n\nWholesale & Retail\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and Game in Season.\n\n---\n\n**J. L. JOHNSON & CO**\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of:\n\nBEDROOM AND PARLOR SUITS,\n\nSideboards, Cupboards, Bureaus, Washstands, Sofas, Easy Chairs, Bedsteads, Mattresses, Cots, Cradles, And all kinds of Chairs, Etc., which I am selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSaleroom, First Door West of Bank.\n\n---\n\n**W. B. GOODFELLOW**", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887021101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4612, "total-output-tokens": 2073, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3156, 1], [3156, 6330, 2], [6330, 8726, 3]], "primary_language": ["en", "en", "en"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]