[{"id": "2715af84f266fa518e990ecd34f7ecd76183e1cb", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, SEPTEMBER 19, 1884.\n\nThe W.M.P.\n\nThe views of those responsible for the movements of the N.W.M. Police seem to have been rather unsettled in so far as the location of a detachment in our settlement is concerned. Some half dozen years ago there was considerable excitement at all, and the arrival of the first detachment was in answer to representations made by the settlers to Lieut.-Governor Laird, as to the likelihood of an outbreak between the natives and the Indians located in the neighborhood. The moral influence of the presence of the red coats on the conduct of the Indians has been of the happiest which fact combined with the usual white man's desire for having some executive force to carry out such legal proceedings as had resulted from the great increase of our settlement, drew forth a largely signed petition to the Government when its withdrawal was threatened some two years ago. The absolute impossibility of carrying on a settlement so extensive as this has now become without police protection is evident and the idea of the detachment could be withdrawn before incorporation had supplied a body of municipal constables; but there is much surprise that so large an addition to the force should have been made, suddenly determined into a permanent establishment for the purpose of incorporation. The explanation of the matter is easily seen and evidently the move is that of Riel's pecuniary interests. Neighbours' house. That observation is watching the movements of that gentleman is necessary is evidently the opinion of the Government, and that opinion is doubtless founded on sufficient good authority, as a detachment of police would be needed some time past keeping an eye upon the situation at Duck Lake. That there is anything in M. Riel's ability as a leader to cause alarm is not believed by the public, but have the opportunity of judging of them, here too is the less obvious that if mischievously inclined he may do an immense amount of harm to the peaceable settlers in the Territories. His intentions towards the Indians are not of an aggressive nature that no one could be surprised to hear of his volunteering for missionary work; however a good many are sufficiently sceptical concerning his promises, and they believe he has been merely trying to feign the public pulse, and would, if he did find the symptoms favorable, proceed to raise a row. The ultimate fate of any movement suggested by him is too patent to all but fanatics to require discussion, but the great danger which has to be guarded against is the result of the communications he has been holding with the black sheep of the native community. One has heard of them in a minute, and their part would be supported by the half breeds and the whites, they are not so perfectly contented as to refuse the opportunity, and if once stirred up they would most certainly in their disappointment at finding the promised support with which their vengeance upon ourselves is to be wreaked. Anxiety over very serious consequences of any attempt however futile will be the new wave of confidence in the country amongst outside capitalists, another attack of which we cannot anticipate. We are glad that the situation has been kept so quiet, and would impress upon all alike that duty as well as interest will induce every settler to do all in his power to let M. Riel and his adherents understand that any disturbance will be met with active opposition in view of sympathy.\n\nROWDYISM.\n\nWe regret to have to notice that another epidemic of rowdyism appears to have broken out in our town and have little doubt that the outbreak may be traced to the usual cause. Fortunately, however, the particular locality where the mischief is at hand, and should it not at once disappear that remedy we have every reason to believe will very promptly be applied. It seems hard to understand why anyone should be disposed to indulge more apparently without any feeling of shame, to indulge in conduct such as the worst of them would blush to have had to their door in the community where they live. The decently conducted only avail to make men conduct themselves with propriety so fast as to escape the public disgrace attaching to misconduct is a very miserable sort of thing, and yet our town has been treated by a number of men whose conduct is controlled by what he feels is due to his own self respect, that the one who is only held in check by a cowardly fear of contempt or ridicule, has been encouraged to act in a manner which is calculated to bring dishonor to himself and our town. We are to blame for the latter class still continuing to disgrace themselves and our otherwise most respectable community generally, but we can only say that we have been obliged to act individually or not our actions being unpublished the particulars of several cases tried at the barracks were well intentioned. With a due regard however to the interests of spectators and the people of the town we feel the time has been reached when patience ceases to be a virtue, and we give due notice to all who may be concerned that it is our intention to bring forward for labor, full detail of each and every case of blasphemy as may be sent to us for such purpose.\n\nFREE THOUGHT.\n\nPedagogic Charles Watts, the English free thought evangelist, secular Review editor, and gourmet, is to take up his residence permanently in Canada, as the \"inducements offered by the Government are such that their effect will be decided to his advantage. A good riddance to Britain and we congratulate them for this must be heartily sick of the ceaseless repetitions of that windy pelagian. We have heard of the young man who had heard of several accusations in Scotland and England, and for rank rate we never heard his calumny. His old harangues will pass in Canada as for a little while, when they fall on the ears of the old, old story of how he went down on his knees to pray, which must have been a difficult job for him owing to his grossness, and how the Lord was moved and answered him, will be held aside in the old declamatory style, after which the speech will be washed down with the never forgotten goblet of whisky. But Charlie Watts will stay as long as the inducements are forthcoming and old rye is procurable.\n\n\"The Woman's Physician.\"\n\nA common sense medical work for women. Fully illustrated, and written in a style which makes it easy for women to read, and which will appeal to any woman who has made these diseases a study. A plain and delicate guide to the treatment of these ailments, which every woman should read. It is recommended by many eminent lady physicians as a very useful book. Sent postpaid for $1.00.\n\nAddress the Rochester Pharmaceutical Co., 32, 33 & 34 Osborne Block, Rochester, N.Y.\n\nNOTICE TO CONTRACTORS.\n\nSPAILED TENDERS addressed to the undersigned, will be received until Tuesday, the 30th day of September next, for the erection of a Court House, Regina, and the erection of the Town Hall, North West Mounted Police Station, and the Immigration Shed, Redvers, North West Mounted Police Station, until Tuesday, the 30th day of September next, respectfully, for the erection of the above named buildings.\n\nTenders must be made on the printed forms, and each tender must be accompanied by a deposit of ten per cent of the estimated value of the tender, which will be forfeited if the tender is not accepted, unless a contract which called upon to do so, or if the tender is rejected, and the tenderer will be entitled to have the deposit returned.\n\nTenders must be bound to accept the lowest or any tender.\n\nF. H. ENNIS,\nSecretary,\nDepartment of Public Works, Ottawa, Aug. 26th, 1884.\n\nNOTICE TO CONTRACTORS.\n\nSPAILED TENDERS addressed to the undersigned, will be received until Tuesday, the 30th day of September next, for the erection of the Town Hall, Winnipeg, Manitoba, will be received until Tuesday, the 30th day of September next, respectfully, for the erection of the above named buildings.\n\nTenders must be made on the printed forms, and each tender must be accompanied by a deposit of ten per cent of the estimated value of the tender, which will be forfeited if the tender is not accepted, unless a contract which called upon to do so, or if the tender is rejected, and the tenderer will be entitled to have the deposit returned.\n\nTenders must be bound to accept the lowest or any tender.\n\nF. H. ENNIS,\nSecretary,\nDepartment of Public Works, Ottawa, Aug. 26th, 1884.\n\nDrill Hall,\n\nAT WINNIPEG, MANITOBA.\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and YOUTHS Clothing.\n\nAND ALL SORTS OF BUILDING MATERIAL, for sale at lowest prices. We are now selling two Bankrupt Stocks for CASH.\n\nDAVIS AND CO.,\nWholesale Lumber Dealers\nHead Office—620 Main Street.\nYard—Poveshell Street, on C.P.R. Siding.\n\nEAST END BAKERY I\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\nAll kinds of \"Best Paste\" Made.\n\nHUGH M'DOUGALL,\nEast End Bakery.\n\nFURNITURE\n\nJust arrived, in addition to former stock, we have received some Fancy Parlor and Bedroom Sets. Give us a call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofos, Chairs of nearly all Descriptions. Cradles & Cribs for the Babies, Rocking-Chairs for the Ladies, Mattresses Single & Double to suit Customers.\n\nC. & G. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER.\n\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN,\nPriest Albert.\n\nCHESTER THOMPSON,\nGeneral Blacksmith.\n\nRepairing Farm Machinery a Specialty.\n\nCONSUMPTION\n\nPositively Cured.\n\nAll affections of the stomach that are subject to be cured should try Dr. Robson's Powders. They are the only Powders that will cure all affections of the stomach and all diseases of the throat and lungs. They are also the best in the world for coughs and colds. If they are not efficacious, we will refund the money. We do not want your money unless you are convinced of their curative powers. If your life is worth saving, try them. We will refund your money if they do not cure you.\n\nAddress:\n\nASH & ROBBINS,\n500 Palermo St., Brandon.\n\nPita, Kellogg, or Pallina Biscuits.\n\nPERFECTLY DRIED, EXACTLY THE SAME AS WHEN YOU BOUGHT THEM.\n\nThese Powders are the only Powders that will cure all affections of the stomach and all diseases of the throat and lungs. They are also the best in the world for coughs and colds. If they are not efficacious, we will refund the money. We do not want your money unless you are convinced of their curative powers. If your life is worth saving, try them. We will refund your money if they do not cure you.\n\nAddress:\n\nASH & ROBBINS,\n500 Palermo St., Brandon.\nCORRESPONDENCE.\n\nFrom Moose Jaw to Medicine Hat.\n\nMaple Creek is like North Current very nearly at its growth, still it is a decided improvement on the last. The steady population is from 75 to 100. It is now connected by telegraph line with Halfway, and the settlers continually camping about the place, there is never less than 200 of a floating population. The town is situated on Maple Creek, about two miles south, there are large Mounted Police barracks, and these with the telegraph office, the post-office, the general store belonging to Mr. C. Power & Brother, and Dixon Ross, a news depot, and a lumber yard, also a hotel. Siskiwit has been located about three miles north of the depot for shipping the Montana cattle as mentioned in my notice of Moose Jaw. In the vicinity are several large farm houses and ranches, a relief from the seemingly sterile desert previously passed through. The banks of Maple Creek are lined with trees and this is the first appearance of wood anywhere near the railway line, we left the barren desolation of this country. Leaving Maple Creek we pass through a marshy bottom land with here and there an alluvial pond, with tall grass growing along the banks and south. At Forces there is another of the C. P. R. experimental farms here, the ground is very good, and the crops in truth a superabundance. It seems to me that the farms west of Maple Creek are very well situated, the land being coming to the north of the track. At Irvine dredged lumber is shipped, which is brought down from the six mile Cypress Hills. To the east of the locality is an alkaline spring. From Irvine to Medicine Hat we pass through the same bottom lands, which are covered growing wheat, and the hills on both sides, are very high, and very much resembling the Saskatchewan River valley. Elder Creek winds through the valley; it is very pretty, being freely fringed with brush, and the water is very clear, said to say in Manitoba, the grain is all cut and stacked, and a few crop of vegetables are being raised. From here lies the long pass through the valley of the Seven Persons Creek until Medicine Hat is reached.\n\nMedicine Hat is situated in a country called the Valley City, is beautifully situated in the broad and level valley formed by the confluence of the South Fork and the North Fork of the Saskatchewan River, with the South Saskatchewan. The surface of the prairie is very much higher than the town, and so elevated that all roads by the river are impossible. The Creek and River the town ought to escape the full fury of any wandering flood, past. The town is situated about nine miles between the Medicine Hat of to-day, then it was almost health centre, now it is a well built town of wood, many of the buildings being not only substantial but attractive. Mr. J. F. Ross, M. P., has arranged a commodious station, a round house, shops, etc., and take to considerable ground. The town is now doing a very nice business amongst about 300 popu- ply, and they support seven stores, two bankers, two lawyers, two doctors, a council and several saloons, as well as three hotels, the Brunswick, the Ameri- can, and the Lumberman. The latter stable contains principal stores are Tweed & Ewart, general merchants, who have taken the contract for the N. W. M. P. Line, Medicine Hat is connected with Fort Macleod by a branch line, who has also a branch line at Battle- ford, Mr. Ross, hardware, who does a flourishing trade, and is doing a branch house at Laggar. Mr. Hawke's dairy supplies the town with milk and milk products, the cheese being respect- tively by Mr. Colter and Mr. Leon- ard. The owner of the livery stable is an experienced horseman, Mr. Gordon. The principal hotel is the Brunswick, which is run in a style hard- ly seen west of Winnipeg. The town is in the midst of the prairie, the town is rather numerous and employ a large force of men. The N. W. M. P. house has been placed under the charge of Mr. Butler, proprietor, who has been very active and has done much business with the west. The mines of the Sas- katchewan Coal Co. are situated about nine miles on the river west of the town, employs about thirty-five men. This company has lately made arrangements to open up the coal. Winter is coming soon at a much lower rate than has been done before, namely at $7.50 per ton, and the rates will be reduced on the south bank of the river about seven miles to the west of the town.\n\nBy Moore, McMechan & Tupper.\n\nOn and after Feb. 16th, 1884, trains will be running at a much lower rate than has been done before, namely at $7.50 per ton, and the rates will be reduced on the south bank of the river about seven miles to the west of the town.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply;\n\nSPINK & MAVETY, - PROPS\nRIVER ST., PRINCE ALBERT, SASK.\n\nPUMPS !! PHOTOGRAPHS !\n\nChas. E. Page.\n\nNEW STUDIO\n\nEAST END.\n\nNOTICE.\n\nI hereby intimated that all my accounts are now closed, and all parties indebted to me are requested to make payment immediately, if not paid will be added to my list.\n\nWM. GORDON\nApril 18th, 1884.\nTHE NEW MILLS.\n\nWe visited the new mills this week and found all hands busy engaged, bent on having them in working order before the close of the present season. The mill is a substantial four story building, 35 by 60 feet, set on a solid stone foundation, and constructed in accordance with specifications prepared by Capt. Smith, who has purchased the property, and which speaks highly of that gentleman's practical knowledge of such buildings. Capt. Smith, who has had extensive experience in the art of making this mill one of the best in the country, and on examination we found our expectations fully realized, as the mill is thoroughly practical in every respect. It is a fine specimen of the best work now being done, and will be a credit to the town. The machinery is driven by a large engine, and Mr. McCullough, the miller, has employed all the latest improvements and patterns of those machines makers who are most proficient in their line of business. The smoke room is a brick structure on a stone foundation, 40 by 20 feet, the walls about 18 inches thick, rising to a height of 60 feet. Great precautions have been taken against fire, and the fire from the boiler runs to the end and returns through the numerous small fans located at intervals along the wall, thus carrying the heat away from the receiver, which it has to travel through some distance before finally being discharged into the air. The water used in the embankment must be cooled, if not wholly extinguished, thus reducing the danger from fire. The water pipe is connected with the engine which is accessible throughout the building, and there is plenty of water on hand as well as to fill the tanks on the roof, which stand on a platform formed on the top of the building. The whole is painted with a fine fire proof paint of a uniform color. The walls of the exterior are whitewashed, the windows are of glass, and the doors are also fire proof, which gives the structure a pleasant appearance. A well supplies the mill with water, and a filter, the water from the roof is also utilized, being caught in gutters at the corners of the building and conducted to a tank, so the soft water being very beneficial as a cleanser. Capt. Smith, who owns the mill, says he expects to have it completed in about six weeks, when he hopes to have it running. The people of the town are anxious to see how those workmen of Prince Albert who have had lately under his charge are the most careful, diligent and skilful both of men and women, and they are sure we shall have great pleasure in noting it.\n\nWe next called at Mr. Thos. McKay's new grist mill, where preparations for the entire operation for the erection of the frame work next week. The works are conducted by Mr. McKay and Mr. Peter Attwood, who has superintended the erection of no less than four mills in different places in the district. Here the mill is erected in brick, being fitted ready for their respective positions. From the plans kindly shown us by Mr. Attwood, we understand that when erected it will be 50 x 40 feet, having four stories high. There will be two rooms on each floor, with the latest and best improvements erected this fall: also a set of engines from the old mill. Speed is intended to be carried to the utmost, and the work will be done next spring. The capacity of the mill when in full working order will be 300 bushels per day. The foundation will be of nine inch brick on a stone foundation, 40 by 20 feet. The smoke stack is to be built of brick, and the chimney next the engine house is to be veneered with brick as a protection against fire. In short, the mill is to be fitted with an engine capable of throwing a jet of water of 10 inch 250 feet high. The proprietors have promised to give the surrounding proprietors his willingness to allow them the use of the former pump at once, and the mill will be run 100 days in case. The machinery is by the same makers as that of the preceding mill. Mr. Attwood says he is having everything completed by Christmas.\n\nSince writing the above, there is a report, which it is to be hoped will prove incorrect, to the effect that the mill machinery may be finished by Christmas.\n\nORDINATION.\n\nOn Sunday morning last at ordination services in St. Mary's Church, when Mr. A. A. H. Wright was admitted to the orders of Deacon. The first part of the service was read by the Rev. Canon Field, up to the consecration of the Bishop. The second part and remaining portion of the service were read by the Rev. E. Matheson. The Bishop then laid his hands upon the deacon, 1st, 2nd, in the course of which he very strongly impressed upon both ministers the importance of studying the Holy Scriptures carefully, prayerfully and regularly, urging the people not to be satisfied with hearing and attending a sermon, and receiving the truth with a passive mind, so as to neglect to read all the books of their own Bibles and searching the Scriptures daily, like the Bereans, so that they might be able to test and really benefit by it; thence proclaimed from the pulpit by the ministers of God's Word, that the church should be strengthened and encouraged in the ordinary kinds and cannot be sold in competition with the new methods of mining, such as the use of phosphate powders. Sold only in cases.\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Benanza smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS AT J. L. JOHNSON & CO.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Smaths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884091901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5277, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10868, 2], [10868, 16528, 3], [16528, 22662, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]