[{"id": "fdedac32862584a15c5977a7044633aa6fa82e64", "text": "THE PRINCE ALBERT TIMES\n\nJ. D. MAEVETY\n\nPRINCE ALBERT N.W.T.\n\nTERM—25 per annum in advance.\n\nAdvertisements inserted for less than $1.\n\nAdvertisements without instructions will be returned unless addressed to the Proprietor.\n\nJ. D. MAEVETY, Proprietor.\n\nTHIS PAPER IS NOW PRINTED AT THE NEW YORK TIMES PRESS.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n\nThe Mission Chapel.\n\n10:30 a.m.—Rev. Canon Piatt, B.D.\n\nSt. Andrew's.\n\n1 p.m.—Rev. Mr. Wright, assistant.\n\nSt. Andrew's.\n\n11:30 a.m.—Rev. Mr. McWilliams.\n\nMethodist.\n\nRed Deer Hill and Island Lake every alternate Sunday.\n\nMennonite.\n\nSt. Paul's (Presbyterian).\n\n11 a.m.—Rev. Mr. McWilliams.\n\nMethodist.\n\nRed Deer Hill and Island Lake every alternate Sunday.\n\nFriday, Sept. 10, 1886.\n\nTRADE WITH AUSTRALIA\n\nThe completion of the Canadian Pacific Railway, and the fact that with the placing of a line of steamers on the Pacific to run between Victoria and Sydney, we have a much shorter and cheaper route than our neighbors to the south, brings up the question of the possibility of Canada securing a portion of the trade which has been lost by the United States with Australia.\n\nSome time ago the Dominion Government, with a view to encouraging trade between Australia and Canada, appointed Alex. Wood, of Winnipeg, Dominion Agent for Australia. This gentleman, in furtherance of the object of the Dominion Government, issued a trade letter to the merchants and manufacturers of Canada, in which he stated: (1) the extent and value of trade with Australia; (2) the portion of the same done by Great Britain, the United States and Canada; (3) the articles of our produce and manufactures in which we may expect to be successful; and (4) the establishment of a Canadian agency in Australia, for the purpose of facilitating our trade and commerce with that country. He also visited the Maritime Provinces and worked westward, calling at all the trade centers, placed the matter before the merchants and manufacturers, asking their co-operation. When he had completed his rounds he will proceed to Canada and offer special and similar services in the different cities, in the former to keep all information about Canada it may be possible to supply, and in the latter to keep samples of such Canadian produce, as may be adapted to the country's great lists, the same in Canada, with such information as to freight and insurance as may be necessary to give the purchaser delivered prices. Samples will be the property of the consignees subject only to the charges for freight and insurance which may have been paid by the Government. Consignments for sale will not be accepted by Mr. Wood, but he will be happy to give such advice as may be considered as to responsible and satisfactory firms to whom consignments may be made.\n\nBut what is the amount of trade done by the United States and Great Britain with Australia, and whether we are warranted in endeavoring to open trade relations with the latter? In the fiscal year of 1884-5 the United States exported to Australia the value of $19,531,188, and imported from the value of $2,825,283. Great Britain exported to Australia to the value of $24,316,500 sterling or $37,156 pounds. In British goods, wool, sheep and lambs costed for $10,346,546, and wheat for $4,250,000 sterling.\n\nWhile Canada, in the year 1884-5, exported to Australia the value of $1,000,000 worth of goods, all of which Canada is able to supply. Besides she will be able to supply considerable of the staple at present carried on with Australia by Great Britain.\n\nThis was when the impression prevailed that Australia was a country with which Canada could hope to establish trade relations, but with the completion of the C. P. R., things have changed, and we are placed in a position to become a very formidable rival to the United States in the trade of one of our sister colonies in the Southern Seas. It only requires the exercise of the same energy which has characterized Canadians of late years to secure the market of the ten millions now yearly withdrawn from Australia by the U.S., and leave them out last year's portion.\n\nSTRANGE.\n\nMajor General Strange, in a letter to Le Prestre, Montreal, calls attention to the injustice done the 65th Battalion (Montreal's Own St. George's) and the Alberta Rifles, as stated in the report of the Minister of Militia. He also refers to the fact that the rank and title of Major General commandant of militia by His Excellency was also suppressed as part of an official report. Some one in authority is to blame for this, and it is to be hoped, in justice to the Major General himself, that the burden of this iniquity will be placed where it should be. Through the troops under Major General Strange's command did less fighting than their comrades in arms under Middleton; they did a good deal of hard marching, and were not wanting in courage when fighting was to be done, and it is not to the credit of those in authority that after doing their duty they should be treated differently from others. There is a nugget in here for some sound.\n\nAll communications between Korea and Bulgaria has been stifled. The provincial governments have been strengthened, and Prince Alexander again assumed the reins of government. The provincial government has been offered for the Canadian Pacific, and the rate of interest is said to be an increase of $100,000 over the same period last year.\n\nMontreal Star is used for $10,000 damages by Mathias C. Smith for accusing him of cruel treatment of his wife. The Star has been sued for $10,000 by Mr. Cardigan, proprietor of the Commercial Grain and Stock Exchange.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of each issue will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and Special Departments of Peculiar Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor every week.\n\nTHE MANITOBA SUN,\n\n12 Market St., F., Winnipeg, Man.\n\nJ. SINCLAIR & CO.\n\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be supervised by Mr. Robinson.\n\nGLASS GLASS GLASS\n\nPrices the Lowest in town.\n\nT.J. AGNEW.\n\nACROSTIC!\n\n1878.\n\nToys\n\nNovels\n\nCrayons\n\nAlbums\n\nMaps\n\nPens\n\nEnvelopes\n\nLetterbooks\n\nLess 10 per cent cash.\n\nTHE WEEKLY SUN!\nTOWN COUNCIL.\n\nThe Council met on Monday evening. Present—Acting Mayor, Beaton, Couns. Bremner, Goddard and Brown.\n\nThe minutes of the last meeting were read and adopted.\n\nACCOUNTS.\n\nAccounts were received from J. O. Adamson for dog tags, $10—ordered to be paid; from Mr. W. M. Bell, $60, and mileage, $8.77—ordered to be paid; from Mrs. Bell, $10, for attendance; from H. Hammond, $40—was ordered to be paid; Acting Mayor Beaton, delegate's expenses to Ottawa, $488.15—passed.\n\nPETITION.\n\nA petition was received from R. C. Wigmore, Wm. Talbot, T. E. Baker, and others, asking that the building now in use as a High School on King Street be removed. Referred to the Committee on Works and Health.\n\nThe time for purchasing dog tags was extended until 20th inst.\n\nThe Council adjourned to meet on the 20th inst., at 7:30 p.m.\n\nTERRITORIAL NEWS.\n\nBATTLEFORD.\n\nFrom the Globe.\n\nA mounted police escort now accompanies the mail to Swift Current.\n\nA house is being built near the Indian farm located on Stony River.\n\nThe barracks grounds are to be extended south and west so as to embrace square acres of land located on each side.\n\nMasons, millers and fishermen build-\n\ning stores in South Battleford.\n\nA Masonic Lodge, similar to Battleford Lodge, has been instituted here, and meets under the most favourable auspices. Following the officers: W. M. Dr. W. White (V. P.), W. J. Hugh J. Montgomery; J. W., Rev. J. Ralph; Sec. J. G. Ralph (temporarily); Treasurer, J. G. Ralph.\n\nThe police are going to have a well sewn within their stockade. It will be eight feet in diameter.\n\nAbout forty police and a number of citizens are ill of malarial fever, among them being Dr. Miller and Hospital Sergeant Macdonald. The hospitals are under charge of Dr. Macdonald.\n\nThe store of crops is improving heavy on the farms, and the police are intensively inquiring where the balance of their crops will be paid.\n\nNews from the field says they were having splendid harvest weather and twenty solid binders were at work. We imagine it is possible in a few days to have a number of objections to the decisions of Land Board. Telegraph communications to tidally Lake had commenced.\n\nFORT MCLEOD.\n\nFrom the Gazette.\n\nA young man on his way to Battleford.\n\nA friend dinner was given by the spectators quarters by the officers of the force to a number of friends, and the young man was present.\n\nMajor General Strange has refused to present a portion of his command with his relations, until he is assured that the mounted police will be similarly treated.\n\nGlobe has been sentenced to the most emphatic recommendation for being drunk and disorderly.\n\nCALGARY.\n\nFrom the Herald.\n\nWhile the police were passing the \"scow\" down the Athabasca River, a great noise attracted Inspector Moody's attention, and he ordered the Indians to save town. A boat ran at Moodys with a loud noise, and it away and broke into pieces his boat which was empty. The boat then ran at him and in an instant Moody sent him through the air.\n\nA gentleman from Edmonton tells us that police are wasting gold from the public till to the tune of $7.\n\nW. M. Miller, T. Beaton, and T. Dutton have been arrested on suspicion of last week's robbery in Leduc County, lately in Cal-\n\nH. J. Fritchell has been appointed guardian by the Lt. Governor.\n\nMr. Campbell has been appointed chief constable of the North West Mounted Police.\n\nSome of the boys took a fisherman's line and tried to catch people who were engaged in illegal transportation.\n\nThis is a good thing that they are working so hard, better luck next time, and get a new horse.\n\n\"SHE NODDIT TO ME.\"\n\nThe following poem, which recently appeared in the Bon Accord, a weekly journal published in Aberdeen, at-\n\ntracted considerable attention. The Majesty wrote expressing her desire to be furnished with the name of the author—\n\nI'm but an old body\n\nIn a two-room'd hutt house,\n\nAnd my wife's a widow,\n\nMy son and my grumpy neighbour\n\nAre as happy as a bee,\n\nBut I'm not so lucky as they.\n\nSince she noddit to me:\n\nI'm just the same past win'—\n\nCan plant two times twain,\n\nAs the Queen lunch'd o' her kindly grace,\n\nAnd when she noddit to me:\n\nMy son sleeps in Egypt—\n\nIt's amiss to fruit—\n\nAnd my wife's a widow,\n\nI'm just like air to greet—\n\nShe may feel for my sorrow—\n\nShe may feel for my pain—\n\nBut maybe she hasn't o'\n\nWhen she noddit to me!\n\nNOTICE.\n\nST. LAURENT FERRY.\n\nGOOD STEEL CABLE.\n\nThe Scow Crosses in Three Minutes.\n\nGood Road. This is the best Crossing on the South Branch. This the Royal Engineer's Road. The road is level, and the hills and the creeks are bridged.\n\nThe public are cordially invited to cross at St. Laurent Crossing and try this road.\n\nCUSTOMS SALE.\n\nA BAND OF HORSES\n\nRecently seized for evasion of customs will be sold by public auction at the Police Barracks, Prince Albert.\n\nSATURDAY, SEPTEMBER 18,\n\nAT 2 P.M.\n\nThe Band consists of\n\n1 Stallion—bay yearling,\n\n1 Gelding,\n\n6 Mares and Colts,\n\n6 Mares,\n\n2 Yearlings\n\nTERMS—CASH.\n\nA. BOWEN FERRY,\n\nSuperintendent,\n\nCommanding North West Mounted Police,\n\nPrince Albert.\n\nWHAT IS INCONSISTENCY?\n\nWhat is consistency, or when can a man be said to be inconsistent? This is a question raised by a statesman who has not changed his opinions, and whose many men supported to-day what they opposed yesterday. These are public men bring who have scarcely uttered two opposite opinions on a subject, and who have never varied their first opinions were. But we are not talking of those men. Their day is gone. We are talking of progressive individuals. Inconsistency of opinion does not mean inconsistency, since it may be the result of imperfect knowledge.\n\nOur forefathers, before the days of candles, is no reason why we should believe that they believed the earth to be flat. We believe that the earth is round when our own observation prove it to be round. There was a time, and not very long ago, when the Jews were despised as the right of citizenship in England through fear and prejudice, but that time has passed, and the Jewish question is now one of the most important questions of modern times. We live to learn. The past cannot be changed, but we can change by it. We must guard against the evil. This is the wisest men make of it. Yes, men change, old prejudices perish, false theories are exploded, and men are free to think and act without restraint, they have for the liberties of their neighbours the closest of human ties drawn together and there are none, of course, who cling to old theories—who do so speak, light them up with new ideas, and make them burn with new light. Twenty years ago Sir John Macdonald held views different from those he holds today. Sir John Macdonald has turned a complete right about during his public career as a very important question, and who he hold to be his friend. Undoubtedly, Sir John Macdonald has been the gaining. The man who aims at the accomplishment of great for the good of mankind, must be prepared for clearing himself open to the charge of inconsistency from danger which is reason enough for the greatest Christian—Christian—from the persecutor to the persecuted—he was, no doubt, charged with inconsistency, but his own conscience told him he was doing right. His when is a man innocent, he will tell you. When he gets into trouble, he will tell you, the point is that he is innocent, and when he returns to follow his conscience, he will be innocent.\n\nWe shall see that the public men of Canada and other countries, for fear of leaving himself open to the charge of inconsistency, will not allow his own conscience, swallow his own convictions, and live his own principles.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Agency, 10 Spruce St., New York.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowelings,\n\nDress Goods,\n\nSilks,\n\nLinen, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings of any size or firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nMOORE & MACDOWALL\nCUMBERLAND.\n\nSILVER WEDDING.\n\nThe 25th anniversary being the 25th anniversary of the marriage of Chief Factor and Mrs. Belanger, the officers and clerks of the District of Cumberland took advantage of the occasion to make a visit to the home of the couple, thus paying tribute to the happy occasion, and expressing the esteem in which they held them. The visit was accompanied by a party of ladies.\n\nAnxious.\n\nPov. Sir and Madam,\n\nThe occasion of your Silver Wedding gives us, the officers and clerks in the District, a rare opportunity of testifying our personal esteem and cordial regard for your welfare, and it is with undiminished pleasure that we now address you, and wish you many more such epochs in your marital life.\n\nPermit us to assure you that our own wishes are for your continued prosperity, and that we hope you may be in store for better things than any you have yet enjoyed.\n\nPray do not forget us when visiting the shrine of your dear addresses, nor by the intrinsic value of the accompanying plate, as both these standards would be most fittingly placed there.\n\nWe have every confidence that you will accept our small offering in the name of a united and substantial body of friends, who are very anxious to express our heartfelt wishes for your welfare and happiness.\n\nAnd we are, Dear Sir and Madam,\n\nYours very sincerely\n\nPierre Duchesnault, John McNally,\nGeorge McVean, Joseph Houston,\nJohn McDonald, Geo. Duchesnault,\nAugus McLellan.\n\nREPLY.\n\nHonorable Mr. Gorrie,\n\nCumberland,\n\nAugust 26th, 1886.\n\nGentlemen,\n\nIn reply to your address and acknowledgements, I desire to express my very grateful thanks for the kind and substantial manner in which you have addressed me on this, the 25th anniversary of our wedding day. I am not only surprised and pleased at your expressions of kindness, but am so full of enthusiasm at this kind and unusual mark of esteem and grateful affection that I find myself quite overcome. I desire to assure you that Mrs. Belanger and myself are grateful for the occasion. Although our union has been a happy and substantial one, and the company which we serve, my individual shortcomings may be felt to some extent, but the greatest regret that I feel is from the expenses of the case only, not from the heart. Unfortunately, Mrs. Belanger and myself have been obliged to contribute our share to the expenses of the marriage, and although we have been able to save a little money, it is not sufficient to cover all our expenses. We are grateful for your kindness and consideration, and shall ever remember your kindness and consideration.\n\nBelanger.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nDupont's Celebrated Ducking Powder.\n\nLoaded Shells always on hand.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nDry Goods, Clothing, Groceries, Provisions\n\nEvery Department fully stocked—Special Bargains in Press Goods, Embroideries, Prints, Shootings and Plain Cottons, Staple and Fancy Groceries, Fresh Hams, Spiced Roll Bacon, Maple Sugar and Maple Syrup.\n\nThe Largest Stock of Clothing in town.\n\nBETTS & Gwynne.\n\nFURNITURE.\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all the Latest Designs! which I am selling at reasonable rates to make room for a large stock coming up by boat. Call and inspect my stock and get prices.\n\nSaleroom, First Door West of Bank.\n\nW. B. GOODFELLOW.\n\nWM. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886091001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 4524, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6578, 2], [6578, 15162, 3], [15162, 18641, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]