[{"id": "e30f7d50eb17fceb20d197961c4cccec9e7ad5c3", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 9, 1887.\n\n$2 5C A YEAR.\n\nBANKINGHOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest allowed on Deposits.\nSome drafts issued available at all points in the Province.\nCollections undertaken and promptly answered by\nBANKERS—Merchant Bank of Canada.\n\nWILLIAM V. MACLUSK\nAdvocate, Notary, etc.\nMoney to loan at low rates, advantage of the\nrural district, interest rate of advance.\n\nSTEPHEN BROWNE\nSolicitor of the Supreme Court of Justice\nin Manitoba.\nAdvocate, Notary Public, etc.\nLegal Aid Office.\nPRINCE ALBERT\n\nH. W. NEWLANDS\nAdvocate, Notary Public.\nPRINCE ALBERT\n\nROBERT THOMSON\nSign and Ornamental Painter.\nDecorative Painting a Specialty.\nROYAL MAIL STAGE I\nBetween Qu'Appelle Station and Prince Albert.\nWeekly.\nJ. D. HANAFIN\nReal Estate Agent and Assessor.\nTown License Inspector.\nIssuer of Marriage Licenses.\n\nFURNITURE!\nCheaper than ever.\nFor the same thirty days will sell at\npercent less the\nGILBERT E. CARTER\nWILLIAM KNOX,\nCARPENTER, ETC.\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nBLACKSMITHING\nIsaiah McColl has opened a shop on the west side of Church Street, opposite the church, where he will be pleased to make all kinds of blacksmithing work.\n\nMRS. JAS. A. FRASER\nGeneral Mantle Making\nMRS. J. A. FRASER'S, W. R. FISH.\n\nJ. LESTOCK REID\nDominion Land Surveyor.\nPRINCE ALBERT\nA. C. PATTERSON,\nForwarding Agent.\nAll goods intended to be shipped immedi-\nately on arrival will be charged at the\nrate of $1 per hundred pounds.\nA. C. PATTERSON\nTrey.\n\nCITY CONFECTIONERY\nCheap Groceries\nCanned Goods\nAlso Cigars.\nR. T. GOODFELLOW,\nCorner River and McKay Streets.\n\nROBT BUCKLEY,\nAuctioneer,\nAccountant,\nand\nGeneral Agent\nPRINCE ALBERT\n\nTHE OLD RELIABLE\nA LARGE SUPPLY OF THE GOOD OLD\nEIGHT CLOCKS,\nBy\nNICKLE CLOCK, WAITHAM, ELGIN\nAND SWISS WATCHES.\nPost Office Jewellery Store\nRepairing done neatly and warranted.\nR. B. WAY\nQUEEN'S HOTEL.\nLeading Hotel in Saskatchewan.\nBoard by the day or week.\nThe bar is stocked with the finest brands of Canadian Beer and Fine American Spirits.\nEvery attention paid to the travelling public.\n\nTHOS. ORAM\nCannot Be Beat\nThe Cheapest, the Best and the Largest Stock of\nBOOTS AND SHOES,\nEver offered in Prince Albert.\nWe guarantee every pair sold as being\ncheap boots and shoes.\nIf it doesn't go anywhere the bill you try us.\nNo returns.\nNo shoddy goods.\nWe strictly insist\non getting the golden share—no matter\nwhat you may have heard so idle.\nSHANNON & MCLEOD\nMRS. JAS. A. FRASER\nGENERAL MERCHANT\nMRS. J. A. FRASER'S, W. R. FISH.\n\nHERE\nWe are Again\nON DECK!\n\nWe wish to notify the\nPublic that our store is filled\nfrom top to bottom, and\nto make room we have de-\ncided to make one\nCLEARING SALE\n\nThis is no dodge. We know\nthat the Fire, Smoke and Water\ndodge is a thing of the past.\nThe Royal Theatre scheme is out\nof date. The burglar's\ndodge is a obsolete scheme. We\nare not going into business,\nbut going into it. Legitimate\nmethods must win in these days\nof civilized advancement.\n\nSEE OUR\nDress Goods\nCottons,\nBoots and Shoes,\nGroceries,\nCoffeees,\nTeas\nETC., ETC.\n\nWE ARE\nIncreasing Stock\nIncreasing Sales\nIncreasing Confidence\n\nMake No Mistake.\nCome and See for Yourself.\n\nDo not take any stock in pretty talk of other dealers, but come to\nthe one reliable, straight up and up\nsquare-dealing, one-price, low price,\nwith acute, hard working, never to\nbe forgotten.\n\nGENERAL MERCHANT\nMRS. J. A. FRASER'S, W. R. FISH.\n\nTELEGRAPIIC.\nCHIT-CHAT LOCALS.\n\n(By Special Telegraph)\n\nWINNIPEG, Sept. 9.\nRed River Valley Railroad bonds\nhave been issued. The company is\nsaid to be in New York now to ob-\nject. The legal aspect of the question\nremains unchanged, arguments are being\nhandled by Mr. J. M. McPhail, who\npromotes George McLeish, Minister\nof Justice Thompson and Hon. Alex\nMcKenzie have gone east, but Minister\nMcKenzie landed West and said the city\nLady Macdonald is at Bath.\n\nSir John A. Macdonald, it is thought, will\nnot attend the Canadian representa-\ntive on the new Fairbairn Bill.\n\nHandicrafts of Fort Macleod had a major-\nity of 130 over Comptroller of Lethbridge,\nin the race for the position of Boyle's vacant\nseat in the North West Council.\n\nThe C. P. R. has reduced freight rates\non grain from Manitoba and the North\nWest, which will cost six cents per hundred\npounds.\n\nThe Hudson's Bay Company's con-\nfirmed closure last night was a pleasant\nindication that the company was satisfied\nwith the Mounted Police and has not\nbeen reorganized. The Indians will not\nbe disturbed.\n\nThe Royal Theatre, London, was de-\nstroyed by fire during a performance. A\npair of candles and 130 lives were lost.\n\nDr. Smith, of the Mounted Police,\ncommitted suicide yesterday by shooting himself with a Silver rifle.\nHe was found dead in his tent\nthis afternoon and the evidence was\nshown that he had gone to his room to\ndress for dinner, telling his companions\nhe would be back shortly. He took up\nsome soup, on the return going to his\nroom, as soon as he heard him firing a\ngun, he loaded a Silver rifle, fired a\nshot at the trigger and to his feet, pro-\nceeded to the tent and fell to the\nground, unable to move. In the bed\nbeing discharged the whole top of his\nhead was blown off and scattered over\nthe floor. The rest of his body was\nseverely injured. He was buried at\n3:30 on Thursday afternoon.\n\nTOWN COUNCIL\n\nThe regular monthly meeting of the Town Council was held on Monday\nevening, September 8th, with Messrs. Bain, Bradshaw and Agnew,\nChairman Bain in the chair.\n\nThe minutes of the previous meeting were read and adopted.\n\nCOMMUNICATIONS\n\nA communication was received from Mr. O. E. Hughes, M. N. W. C., regard-\ning the condition of the road between Mile\nposts 76 and 77 in this town, and offers $200\nfor that purpose. Accepted.\n\nACCOUNTS\n\nAccounts were received from J. D.\nMacveety for printing, $18; and from\nChas. Woodman for $26—Referred to\nFinance Committee.\n\nREVENUE\n\nThe reports of the Treasurer and the\nLicense Inspector were received for the\nmonth of August.\n\nHEALTH\n\nCom. Bain, chairman of the Board of\nHealth, reported that the water supply\nwas good and satisfactory. Also, Mr. A.\nMcKenna's report, $50; Wm. Brown, $10;\nMr. Williams, $50; and collectors, $5 each.\nMr. Williams' report was accepted.\n\nMr. Peter Robertson was appointed a\npoliceman.\n\nThe Council then adjourned.\n\nThe contract for setting a drain from\nthe western part of the town to the\neastern boundary and drainage to the river\nhas been awarded to Mr. Williamson for\n$100. The contract will be let when the\ntrees have been cut down and the\ncollectors will be $100.00.\n\nLook out for music on the Hill after a\nwhile.\n\nThe east end school house is being\nplastered.\n\nNew goods arriving every week at the\nMontreal Office.\n\nThe Supreme Court will sit here on\nthe 4th of October.\n\nMr. H. S. Goldhawk has gone north\nto trade for the winter.\n\nMr. J. R. McPhail left last week for\nWinnipeg on a business trip.\n\nMr. J. Taylor has been appointed\na post keeper for the town.\n\nA good supply of the most popular\nmedicines just arrived by T. E. Snook.\n\nLadies who admire nice goods, should\ntake a look through Betta & Gayne's\nnew display.\n\nRiver street is being improved in the\neast end in front of the H. R. Co. and\nMr. Bradshaw's.\n\nJudge McCutcheon is expected back about\nthe middle of next week. He will be accompanied\nby Mrs. McCutcheon.\n\nSheriff Hughes has his office for the\nnext few weeks in the building occupied by Mr.\nH. W. Newlands.\n\nMr. W. R. Gurn has commenced the\nerection of a new office on the corner of\nMain and Second streets.\n\nMessrs. A. Goodfellow, F. Turner,\nR. Taylor and J. Taylor were out duck\nhunting on Wednesday last.\n\nThe picture of Mr. Argus Thompson's\nfather will be filled by his son, Mr. Thomas Thompson.\n\nMr. H. W. Metzger, of Winnipeg, was\nin town a few days this week. He\nwas a passenger by last mail stage.\n\nWe understand that the full Court\nwill be sitting at Regina during the\nsession of the North West Council.\n\nCatholic Chaplain and Catholic Medical\nOfficer, Dr. J. J. Jackson, is Shaving and\nTaking care of Mr. T. J. Jackson.\n\nMr. H. T. McPhillips is preparing a\nDirectory for Saskatchewan. We wish\nhim success in this very valuable enter-\nprise.\n\nThe fire appliances for the town\nare almost completed, and will be\nhauled away in a few days to the town\nauthorities.\n\nMiss Metzger is in charge of the\nSt. James' Church school, at present\nowing to the absence of Miss Alice\nMetzger.\n\nThe failure of the potato crop and other\nvegetables presented a somewhat\nunsatisfactory appearance the following day.\n\nSeveral new houses are being erected.\n\nJ. M. McPhail expects the fitting up\nand carrying on a flour mill in the build-\ning lately erected by Mr. Thos. McKay.\n\nThe fence around the yard at large within\nthe town limits is being repaired. The\nroad inspector goes to sleep.\n\nThere is a main trap between the Post\nOffice and Brewster & McKay's law office.\n\nThe sidewalks are being repaired and\nthe sidewalks kept in proper repair.\n\nThe road inspector goes to sleep.\n\nThe church is in good order and the\nmembers of the church, and we can have\na good while after the other striking the\nAugust, in conformity with the rule\nof the church.\n\nMr. O. E. Hughes, M. N. W. C. has\noffered $50 to the Town Council towards\nthe improvement of the road between Mile\nposts 76 and 77. The Council\nhas accepted the offer, and will proceed\nwith the work.\n\nHave you seen Betta & Gayne's ad\nof Minnie Shadings? They settle\nprices. The days of old fashioned\nwindow shades are passed.\n\nYou can now get stylish curtains without any\nincrease in price.\nOUR PROGRESS\n\nProgress not only in the North-West is founded on the vast and legitimate base as Prince Albert, nor has its progress been advanced by any fictitious means. Surrounded by a vast agricultural country, the North-West's vast mineral and timber resources is still practically undeveloped. Furthermore, it is sufficiently distant from Winnipeg as to not interfere with the vast grain trade that of embryo Chicago. Its population consists largely of Canada's best sons who, attracted by its many natural advantages and not by the grasping and pampered, interested parties, perpetuated for in advance of civilization into this distant region and never had any reason to regret their choice. The development of the North-West, carried on by our steady and brave pioneers, has led to the establishment of many industrial enterprises, of which probably the most commendable is the Prince Albert Oil Company now placed under the presidency of one of our most prominent business men.\n\nWe have only one mile at present and the satisfaction in the public mind, that with our own hands we destroyed by fire in 1884, the leaving an agricultural community of 3,000 people in a most deplorable condition shows the necessity of the perpetuation of investment of private capital, apart from the indirect benefit which will be derived by every person in the settlement, we have no intention to give up pursuing this scheme, to go back to our farming community and we trust it will meet with their most hearty support, especially as we are informed that many insurance companies can now be obtained advantageously to investors against the fire hazard. A glance at the prospectus prepared by qualified experts should attract the attention of every one of our own but even of outside vigilance.\n\nThe future commercial greatness of this point cannot be disputed. We are in the very heart of Canada's vast domain. Without rekening on our magnificent stretch of water courses,\" we have every reason to hope for almost immediate railway facilities. Besides that main artery from ocean to ocean—the Great Pacific railway, we are also the opposite points at present of the great new projected transcontinental line in which the Grand Trunk, Northern Pacific, the Great Northern, Canadian Pacific, etc., are interested, and Prince Albert may become a capital of magnitude and importance on the line of this great transportation scheme. The realization of these long deferred hopes, and the crown complications will be a just and fitting compensation for the chattering our pioneers have undergone during past years, and at least a continuous and well-deserved prosperity.\n\nWe understand Mr. J. Knowles, banker, is the secretary of the proposed Prince Albert Milling Co., to whom application for shares should be made, and from whom the prospectus can be obtained.\n\nDR. MILLER.\n\nAt the report of the sudden death of Dr. Miller of Prince Albert, W.S., which occurred at Rathtford on Thursday last, as will be seen by our telegraphic news, has caused a most painful feeling here, where the doctor was well known and appreciated. Probably the most intelligent, modest, effective few were more respected than the doctor. He joined the Police in 1874, has been in the service ever since and there is hardly a place in the Northwest where he has not been stationed in the course of his long career. Perfectly unostentatious, in fact rather retiring, though never seldom attracted, but when his services demanded it, and then he rose equal to any emergency. In Prince Albert he will be remembered as one of the bravest, not only of the forces of the Duck Lake fight. Perfectly cool and impassive, he not only stayed in the firing line, but attended to the wounded as they fell, and did it before the enemy then, the circumstance would permit. He escaped without a wound, although a spent bullet was found in his instrument case. In the absence of circumstances, he was always ready to employ his military professional abilities, rarely taking a fee. In many a scattered settlement, many a distant police post, many a lonely station, his name was heard and his advice sought. But Indian before the north will cause undesigned regret, for few men were better known and none will be more missed in the Northwest than Robert Miller.\n\nFOR THE Best Assorted Stock of CONFECTIONERY\n\nGO TO H. M'DOUGALL'S BAKERY.\n\nH. M'DOUGALL PUBLIC NOTICE.\n\nBy the Trustees of the School District No. 12 of Prince Albert, Public School, No. 5, East End School, Fort Saskatchewan, Alta.\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Journal, August 25.\n\nAn almost unanimous signed petition of the members of the parish will be presented to the new council at their first meeting, Monday next, by Mr. George H. Hart, Warden of Qu'Appelle, and town Inspector. The petition was circulated by the members of the parish, Mr. Hart, Mr. Dan Highland, who had charge of organizing the addition to the Wind River Indian Reservation, and Mr. Walker in the work on Tuesday afternoon, something had been mailed to the state capital, and Mr. Walker had his back injured, and he fell backwards down the stair case. He was rendered unconscious for fifteen minutes, and when he came to, he found himself paralyzed from the spinal column, which paralyzed his arms for some time, and his head was also badly injured. He has now fully recovered, and may be able to go before he is himself again. A telegram was sent to a brother and an aunt in Broadway, and Mr. Walker went to bed Saturday night and was remaining with him.\n\nA slight frost on Wednesday morning did some damage to the crops, but another light fall of snow the weather has been cool during the week, making harvesting pleasant work. Two men have been killed near the town, very heavy rain fell in some districts, particularly to the north and east, on Saturday.\n\nA young son of Mr. H. H. Gillespie was killed by a falling tree on the other day by being thrown off an ox.\n\nBATTLEFORD.\n\nFrom the Herald September 3.\n\nLost fronts on the night of the 26th and early morning, loads of potatoes and other tender vices.\n\nThe late grain is ripening fast, and has suffered much any damage by the frost except a small portion of the Eagle Hill.\n\nMr. H. Macdonald, M. P., arrived from Prince Albert on Friday evening, on his way to British Columbia. He will stay with Mr. Ham. Mr. Macdonald left on Monday.\n\nSamuel of very good health, said to have been taken ill a week ago, but felt much better last night. A short distance up the Saskatchewan, were brought to town and are doing well. Hope the finder is not mistaken as to the quality; the quality speaks for itself.\n\nA dispatch from Edmonton says that the steamer Minnow will be repaired and ready for her maiden voyage next week. She has made a great towards extinguishing the debt on St. George's church, which was raised by a very small sum to be raised by the congregation, and will be free of the building from debt. This accomplishment, the festival will conclude the church's Sunday School, Oct. 14th.\n\nAdvice have been received that the steamer Minnow has been purchased by Hamilton, who will make a second trip in the fall of this year, and will leave Medicine Hat on the 29th for her new home on the Saskatchewan. The Minnow is sixty feet long, and as she only draw fifteen inches deep, she can run at any stage of water, can carry any load of goods.\n\nEDMONTON.\n\nFrom the Bulletin, August 13.\n\nW. Anderson, Indian agent, is improving in health.\n\nNew police barracks are to be erected at the lake Indian reserve near Pitt.\n\nThe new telegraph line between Victoria and Battleford commenced working yesterday.\n\nJames Dugal, pilot of the North-west, left Edmonton yesterday with horse on the back of his last trip.\n\nThe police mess room, removed from Edmonton, arrived at Fort Saskatchewan two weeks ago by rail and are now partly re-occupied.\n\nAngus McKay, of the H. B. Co., Pitt, has returned from his trip, which he has been on since the trip to Battleford, 80 miles, and returns in two days.\n\nA prospector has abandoned his claim as a failure, and left the river near Battleford. He has purchased the steamer Minnow from the Galt Co., and is taking the steamer on his way to Lethbridge, to bring her up.\n\nA party of three men and two women, engaged in the supply of the H. B. Co., on the North-western route, from Fort Benton, Montana, arrived from that region by way of Peace river and the Athabasca landing on Saturday last. They left for Manibouk, their former home, on the Northwest on Monday.\n\nHis Lordship Bishop Lefebvre arrived from Calgary on Friday evening accompanied by Rev. Pere Leclerc. He was received by the congregation at Saint Joachim's church, the chief singer of the Te Deum. He remained at St. Joachim's on Wednesday morning, when he left for St. Albert, where he proceeded which came to Edmonton to meet him. He will leave on a tour of inspection of the parishes under his diocese about August 24th. Rev. Pere Lefebvre did not accompany the party from Calgary.\n\nQU'APPELLE.\n\nFrom the Progress, August 24.\n\nLeclerc has once more gone to gather golden grain.\n\nThe volume of freight on the C. P. R. is constantly increasing.\n\nThe horse training going on near the station is making quite a considerable amusement to \"the boys.\"\n\nA Toronto man has obtained the contract for the construction of the first part of the Wood Mountain and Qu'Appelle Railway and will begin work immediately.\n\nA dispatch from Lewiston, Montana, says that Moise Racette and James Gadlie, two of the half breed murderers of McLeod, are in jail awaiting the arrival of Canadian officers.\n\nThe Bishop informs us that he has had another disappointment in regard to the opening of the St. John's school. Since the insertion of the advertisement stating that the school would be opened in October, he has heard from England that the man whose complaint has been taken ill, and is not allowed by his doctor to take any work for a year.\n\nCALGARY.\n\nFrom the Tribune Aug. 26.\n\nThe liquor license has been imposed upon the extent of $500 Monday, in connection with the seized liquor.\n\nDuring the week the real estate market has been fairly active, a considerable quantity of real property having changed hands.\n\nThe Hon. Thomas, who passed through from Banff Sunday morning, without stopping off at Calgary.\n\nThe Prince of Sam and retinue passed through on the C. P. R. on Sunday afternoon, and were received by themselves, but did stop to put off a day at Calgary, but so much thought desired dinner in the evening, they did not.\n\nThe Mounted Police seized 20 gallons of liquor at the station on Saturday and the town. The inmates of the houses of \"bad report\" were up before the Mayor on Monday, and taxed $100 costs. Four were arrested in the houses were fined $100 each.\n\nSaturday morning four members of the Salvation Army two men and two women, visited the town, and were received accompanying themselves with a concertina and a tambourine. On arriving at the Royal Hotel, they sang several songs and danced and harmonized each in turn and dressed a few words to the crowd, and the crowd started up the street, and they marched in a body half an hour after making the crowd to accompany them. They held their services yesterday, and had large congregations each time. They report three concerts for yesterday's services.\n\nMEDICINE HAT.\n\nFrom the Times, Aug. 27.\n\nWe are ready for the Mormon settlers. And we have been ready for some time. The steamer Minnow will be repair in Edmonton and will be taken down the river to Edmonton.\n\nThe Blood Indians will soon raid this section of the territory. They do it every fall.\n\nA large delegation turned out to meet the Hon. Thomas. While on his return east the Hon. Thomas will visit Medicine Hat.\n\nThe Hon. Thomas, minister of the Interior, will recommend the building of a foot bridge across the Saskatchewan river at that point.\n\nThe United States government has appointed Mr. Joseph Robert Missionary Dean, who was arrested on the Island of Principe. The ground of request that the arrest violates the Spanish under the provisions of Protestant missions in the Caroline Islands.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY.\n\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\"Lath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nPUBLIC NOTICE.\n\nBy the Trustees of Collenton School District No. 9 of the North West Territories.\n\nWhereas it is deemed expedient by the Provincial Government of the North West Territories that the same should be divided into two separate school districts, and whereas it is necessary to the issue of decrees relative to the division of the same, it is hereby ordered and declared that the trustees of the said school district be and are hereby constituted and appointed, for the following purposes, namely: For the purpose of dividing the said school district into two separate school districts, and for the purpose of the transfer of land to the trustees. Thereupon, the trustees of said school district, by virtue of said District No. 9, shall be entitled to receive the proceeds of said District No. 9, as provided by law.\n\nThe trustees of said school district shall meet on the 1st day of October, 1887, and continue open until four o'clock p.m. of the same day. Any person who is qualified to vote thereon will be taken for granted to be present at such meeting. Any person who is not present at such meeting shall be deemed to have waived his right to vote.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\nAt T N Campbell's New Store\nA LARGE STOCK OF\nWatches, Clocks and Jewellery\nKEPT CONSTANTLY ON HAND.\nREPAIRING PROMPTLY ATTENDED TO.\n\"BELL\" ORGANS\nUnapproached for Tone and Quality.\nCATALOGUES FREE.\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co.,\nNewspaper Advertising Bureau,\nOne Park Row, New York\nSend 10c for 100pp. Pamphlet.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of current events in Canadian and United States News.\nSpecial news reports compiled by reporters stationed in Winnipeg, Brandon, Portage la Prairie, Thompson, and other points throughout the province.\nComplete report of Parliamentary proceedings at Ottawa and Winnipeg.\n\nTHE MORNING CALL always offers the most complete and impartial Press Association in Winnipeg, and has the largest circulation of any newspaper in the province.\n\nSubscription Rates: One year, $1.00; six months, $0.50; three months, $0.25; one month, $0.10; strictly in advance. Sample copies mailed on receipt of 10c. Application Subscribed now Address:\nThe Call Printing Co., Winnipeg.\nACTON BURROWS\nPresident and Editor-in-Chief.\nSASKATOON.\n\nHarvesting is well under way. There are now more samples of grain from the district.\n\nMr. Thomas Copeland, agent of the T. C., returned from Bathfield on the lastest. He had an interview with the Indian, Thos. White while there, which we believe, resulted favorably for the colony.\n\nA Native Indian has been engaged here to thirty-five dollars labor for three months by Mr. McCallum, Instructor McCallum. He will serve his time in Prince Albert.\n\nThe loss of the steamer \"Cassia\" (Belgian) was discovered here last month, and found a short distance down the river recently, and has been interred.\n\nMr. J. J. Grant, schoolmaster in Regina, has left here in the teacher's car for the schoolhouse here, who is on his way from Ontario.\n\nThe Moses, Lambert, of Regina, will winter their stock near the Moose Woods. They say at present putting up hay, preserving Caches, etc., for that purpose.\n\nRUSSIAN WHEAT\n\nOttawa, April 25th. — Prof. Sanders, director of the central experimental farm, appeared before the committee on agriculture and colonization last week, and stated that the object of this year's experiments at the farm was to ascertain whether a wheat suitable for the climate could be grown in Manitoba and the Northwest, to be sent to Europe in June, and to be tested there.\n\nA large quantity of Russian wheat was received here today following communication in regard to its coming to hand from Mr. Anderson, of Mowbray, Manitoba, under date 16th inst.\n\nA sample of the wheat was sent to Ottawa on April 1st, and was tested on the 28th of April. It was up on the 7th of May, on the 13th of May, and again on the 21st of May and checked on the 28th of May.\n\nOn the 24th of June it was shipped to Europe, and on the 29th of June it was landed at Liverpool. It was put in a press of grain containing 84 square yards, and on three days was packed in sacks each containing 100 pounds, and was stored in the yard. The straw was about three feet high, and was well saturated with water. I may mention that the wheat was grown on sandy loam.\n\nRed Fife, grown here on the same soil and was not barrowed, was also tested at the same time. This infer that the Russian wheat is the very wheat required in this country, as the latter is only now just being introduced by its use.\n\nMr. H. H. Hays of Brandon, expects that the Russian wheat supplied to him will be fairly tested, and in his opinion it is superior to any other variety of Red Fife. He wants a large quantity for seeding next year, and says he is willing to pay a premium.\n\nAN INCREDIBLE RARE.\n\nFrom the foregoing testimony it will appear that the Russian wheat has been eminently successful. Summer fruits have been the bane of the North-west farmers for years past, but this has demonstrated that this Russian wheat can stand all that the two governments referred to say about the climate, and that the soil of Manitoba and the Territories will be mouldable, and the expenditure in the establishing of the experimental farm well warranted.\n\nTHE BEST AT THE CENTRAL FARM.\n\nProfessor Sanders has received samples of Mr. Johnson's wheat. The wheat is nice and bright, thoroughly hard and remarkably so plump in the original, but without straw.\n\nAll the seed at the Central farm has been most hardy, and here the Rus- sian wheat, imported from England, stands Red Fife very alongside of it. As it has not been tested through the summer, the yield cannot be included, but it is thought it will be very high. The Russian grain experiment upon come from the Central farm is now at a latitude of 69° north of Ottawa.\n\nThere is no need to doubt that Mr. Betts has secured at the great trade sale in Montreal last July the finest stock of Mr. Johnson's wheat ever offered in Prince Albert.\n\nMr. E. J. Cass has purchased and brought here a beautiful double sow pig, bought at the same sale, and has brought into the country. Mr. H. Nelson is also bringing in a fine class sow. Mr. H. Nelson has a fine lot of swine and expects to get some. We shoule well have a hogging this fall.\n\nLOCAL NEWS.\n\nBetts & Gwynne are showing some things quite new in Navy Line Gardiner Street.\n\nWe hear that Mr. Poveshell, former citizen of Regina, has been getting up strong petitions against the enforcement of the game ordinance in the city. We do not want any abolitionists amongst us. We have no local sports to say in the matter.\n\nIt is with deep regret that we have to announce the death of Mr. James Campbell, of the east end, and which will take place on Wednesday last. She leaves behind her a wife and children to mourn her loss. Mr. Campbell has the sympathy of the entire community in his bereavement.\n\nWe see in the Regina news, in another column, that the band boys and citizens of Regina care to have a good band. We think they should have their old bandmaster H. Walker. They offer him a position, but in addition to that, it is only right that the band master should get a situation that affords him time to look after this music.\n\nThe Queen's Jubilee Council of Con- ciliation has been postponed until the 14th of September. This will enable our member Mr. Hughes to attend the meeting as soon as possible after having obtained permission.\n\nMr. Hughes absence at the meeting will be felt by his constituents, as he has been of im- portance since before the Council met. We feel sure that when Mr. Hughes does attend he will be interested in the Territories in general and the special attention will be given to the district which he has been elected to represent.\n\nThose who have seen claim Betts & Gwynne's complete range in silk Photos, A. Dickson, Provincial Copper, etc., etc.\n\nGENERAL NEWS.\n\nA duel was fought with swords in Paris between Lafayette, a writer for the radical paper Le Figaro, and a certain Mr. Baudet, a member of the Chamber of Deputies. Both men were badly wounded. The affair was the result of a private quarrel.\n\nThe opening of the Exhibition of China has been postponed for two weeks owing to the illness of the youthful monarch of the empire, the late Empress Eugenie.\n\nIt has been decided to place the Queen's jubilee presents on exhibition in London.\n\nTwo of the Belgian fishermen who were charged upon the grounds of the gendarmerie and wounded have since died. A number of others have been arrested using English boats and when ordered to abandon them refused to do so. The fishermen were arrested at the scene of the woundings four of them.\n\nDeputy Laro, of Paris, has summoned Mr. de Casanova before the gendarmerie. Mr. Laro has been characterized as a man of bad character and was charged by Mr. Casanova in connection with the Boilinger case.\n\nAnother attempt was made to assassinate the car. A bullet missed as the Imperial guardsman while they were escorting the car on the journey from St. Petersburg to Kronstadt and took refuge at the Empress's residence. The first shot went wide of the mark, but the second perforated the carcoat. The assailant was promptly seized and disarmed.\n\nThe success by the Russians of the English fishing vessels has led to an increase of the English force in the North sea. Nine vessels of war, including five cruisers, have been employed in protecting the English craft.\n\nA battle was fought between Colonel's boat and Sheriff Kendall's men near the mouth of Royston, and while the reports are conflicting as to the actual result, it is said that the Indians were killed on both sides. There were about 200 whites poorly equipped, led by Mr. Kendall, and Mr. Colburn carried a warrant for Colonel's arrest, and Mr. Kendall had instructions to bring him to the city.\n\nThe party carried 3 days rations, which were used up in reaching Royston. They had several bloody encounters, and sent for reinforcements, but it is feared that if they did not arrive in time the dreaded slaughter may have ensued, as the men were without food and horses.\n\nR. C. Wigmore & Co.'s.\n\nESTABLISHED: 1879.\n\nBUY YOUR\n\nCook Stoves,\n\nHousefurnishings,\n\nHardware and Tinware\n\nFROM\n\nJ. R. McPhail's.\n\nMachine Oils,\n\nAmerican Coal Oil\n\nLow Prices. Good Value. Prompt Attention\n\nAT\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\n\nTrowsering and Overcoating\n\nWORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887090901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 8109, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 9615, 1], [9615, 14153, 2], [14153, 25108, 3], [25108, 33558, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]