[{"id": "d5bfee686a29f614ab5aeda56fe41e62b63c0296", "text": "NOTICE.\n\nFarmers Restaurant.\n\nMeats at all Hours.\nGood Beer and Cigars always on hand.\nGood Boarding Stable in connection.\n\nWM. GORDON.\nR. J. O'LEARY\nPROPRIETOR\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nNotice.\n\nAll parties indebted to me by note, or otherwise, are hereby notified that all debts unpaid after May 1st, 1894, will be placed in suit without fear or favor.\n\nN.B.-On and after this date my terms will be strictly cash, or equivalent.\n\nT.O. DAVIS.\n\nNEW GOODS!\n\nAT MEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, SOAPS, FANCY GOODS, including in part Atkinson's, Golzate's, Lubin's and Landbouy's Perfumery, Pear's and Golzate's Fancy Soaps Hair Brushes, including Scott's Electric and Infants', Celluloid, Horn and Rubber Combs, Gossell's Teeth Brushes, Tooth Picks, Breast Pumps, Feeding Bottles, Eno's Fruit Salts, etc., etc.\n\nT.E. JACKSON.\nAT THE OLD STAND.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING AND SUMMER MILLINERY.\n\nMISS MACK & CO.,\nCAMPBELL'S BLK.\n\nHATS AND CAPS\n\nSPRING GOODS\n\nSHANNON & McLEOD\nO.E. HUGHES & CO.\n\nFirst Carts - First Arrival from Troy.\n\nA FINE ASSORTMENT OF\n\nHATS\n\nAND\n\nCAPS\n\nSPRING GOODS\n\nCHURCH MEETINGS.\n\nST. ANDREW'S PARISH.\n\nThe annual Easter meeting of the parish of St. Andrew's was held in the church on Monday, April 16th. The meeting was opened with prayer and a few remarks by the incumbent. He then read a list of parishioners who had provided the previous year. Mr. J. Taylor was elected secretary. Mr. Chater was elected treasurer. Mr. Chater was elected parish clerk. The following were elected members of the vestry: Mr. Robertson, John Taylor, Ian Sutherland, Henry Hamilton and Mr. F. Reid. Mr. Robertson was elected chairman with a salary of $50 per year. Mr. Joseph Taylor was elected assistant. A vote of thanks was tendered by the congregation. Mr. Robertson was elected to the church council. A hearty vote of thanks was given to the chairman who presided over the meeting when it was closed by singing the doxology and pronouncing the benediction.\n\nAN EXTRAORDINARY MEETING.\n\nThe annual Easter meeting of the congregation of St. Catharine's church was held in the church on Monday evening, April 16th. The meeting was opened with prayer and a address by the incumbent, Rev. E.K. Matheson. A vote of thanks was tendered by the congregation. Mr. Robertson was elected chairman with a salary of $50 per year. Mr. Joseph Taylor was elected assistant. A vote of thanks was tendered by the congregation. Mr. Robertson was elected to the church council. A hearty vote of thanks was given to the chairman who presided over the meeting when it was closed by singing the doxology and pronouncing the benediction.\n\nAN EXTRAORDINARY MEETING.\n\nThe annual Easter meeting of the congregation of St. Catharine's church was held in the church on Monday evening, April 16th. The meeting was opened with prayer and a address by the incumbent, Rev. E.K. Matheson. A vote of thanks was tendered by the congregation. Mr. Robertson was elected chairman with a salary of $50 per year. Mr. Joseph Taylor was elected assistant. A vote of thanks was tendered by the congregation. Mr. Robertson was elected to the church council. A hearty vote of thanks was given to the chairman who presided over the meeting when it was closed by singing the doxology and pronouncing the benediction.\nJURYMEN.\n\nWith the limited space at our command we must leave many subjects unnoticed which might be touched upon with advantage, but although a little late in the day we think it well to revert, not so much to the stage of late Ciceronian riots, as to a subject directly suggesting thereby. We ought to try, by jury, and the duties of jurors. We have no desire to dwell upon the miserable details of this wretched business, but a considerable amount of sympathy is necessarily given to men whose intentions was in the first instance to present a most flagrant miscarriage of justice—more the less did the watered proceedings of the courts endeavor to serve, to show how dangerous it is to attempt one evil by another. What more particularly appeals to us is the way in which this travesty of justice came to result in such terrible consequences. It would be very difficult to imagine anything more marked than the contrast existing between the theoretical advantages of the system of jury in certain cases, if a grave nature and the disastrous practical results which so often ensue, an every community of intelligent citizens who are tried by the verdict of the legal machine will do well to consider why this should be the case. It is obvious that in a few lines we can only glance at the subject, but we may say that roughly speaking, a miscarriage of justice in cases decided by a jury results from one of three causes, viz., fear, favor or ignorance, viz., fear, invisible on the part of the jurors, favor, invisible to the uninitiated mind is disconcerted questions ends in leaving the jurors to be almost entirely guided by the verdict of the judge. If this is undesirable and we express no opinion on the point, jurial is evidently superfluous. The ignorance which results at the hearing of a hearing in attention and evidence with a gawk to evidence produced simply proves that the jury chosen on the occasion are unworthy of a status above that of the negroes before emancipation. We may say that fear may not induce that courage is of two sorts, physical and moral. With respect to verdicts of juries, although it is impossible actually to sympathize with the misfortunes happened lately in Ireland, were afraid of being marked and followed up by assassins, if they expressed their honest convictions yet the physical courage of the individual must be considered before they are to be universally condemned by people who are not in their position. Fear them in check, if once gained past and favor are so intimately connected as to make it difficult to consider them absolutely a party, but whereas allowances may be made for the circumstances already referred to, none whatever can be allowed for moral cowardice in this connection. That any member of a primitive race should be able to influence, should, after having been sworn to return a verdict to the best of his ability on the evidence before him allow himself to be influenced by the fear of doing having a second thought of the community, deserves enough to sympathize with criminals—what is vulgarly termed down on him—seems monstrous. Undoubtedly they do arise cases in which self-respect and sense of duty to that miserable method called popular favor should be hesitate to take what his conscience points out clearly as his duty. However, we do not see that fact obtained as a result of actual bribery is an impossibility on this side of the line, but what we are disposed to fear is, that in many cases jurors forget that they are own personal liberty to put aside verdict on one side rendering a verdict and that the juror who is guided by anything but his unprejudiced opinion of the nature and value of the evidence submitted to him, has only utterly united in forfeiting the rights and privileges of a free man but only from the nature of the case making his conscience the sole arbitrator, escapes equating the offence of betraying by a residence in the province.\n\nTHE INDIANS.\n\nIt speaks well for the settlers in the Territories that with all their own means to occupy them they can spare a large portion of their time for the troubles of the Indians. There is a very generally diffused opinion amongst those who ought to be tolerably well acquainted with the condition of the Indians in the Territories, that matters of these very serious. No doubt Indian agents fancy they will recommend themselves to the Government by the conduct of great economy in their management, and that by such economy, we mean the avoidance of any unnecessary waste, the price is very valuable, but if on the other hand, the economic methods allow the land to be used for the benefit of the red man, by disease resulting from all such complaints as supreme upon semi-starvation, surely it would be more economical, more merciful, and not one whit less productive to supply them with infected cattle from the smallpox wards of the hospitals. That the Government policy with regard to making Indians self-supporting is a sound one, there can be no doubt, and to do doubt will be quite able to take care of themselves when those who are now children have grown up trained to the necessary habits, and knowledge for agriculture, but to expect that a different generation doing so, is about as reasonable as to expect the leopard to change its spots, or the Ethiopian his skin. If the white man has by his presence driven away the game which provided the Indians with support, he is mostly bound, if whatever cost, to provide a substitute, and even to take the lesser ground of expense, it is infinitely cheaper in the long run to do the Indians good than to see them starve.\n\nNEW LAND REGULATIONS.\n\nWe are authorized by the Commissioner of Dominions lands to make the following announcement for the information of the public interested:\n\n1st. Persons who squatted in the Miles Belt before it was thrown open for settlement and who being unable to obtain entry, have since abandoned their lands, shall be deemed of squatters and such entries and of squatted land within the Miles Belt are prohibited.\n\n2nd. Persons who purchased lands within the Miles Belt, and who now desire to have those sales cancelled, and to be permitted to purchase again, may apply to the Commissioner of Dominions lands, as purchased, are allowed to do, to the extent of 250 acres in all, the payment to be made by those who have been granted an amount of their pre-emption.\n\n(Readers of the above clauses being advised to refer to the conditions of the Order in Council granting the privilege of home occupation within the Mile Belt.)\n\n3rd. Persons who have cancelled their entries during the year when entry for lands of this class was withheld, will be permitted to place on the same basis as persons holding homestead or homestead and pre-emption, entry for lands of the same class, and the entry fees, in consequence of the purchases will be credited on account of their pre-emption.\n\nThe Women's Physician.\n\nA complete medical work for women. Fully answers all questions which modesty prevents raising a male physician. Gives advice and medical treatment for all diseases with patience and kindness. A patient told in delicate language which every woman, young or old, should read. It is recommended by physicians and ladies as a work of great value. Handwritten and illustrated. Sent postpaid for $1.00, by the Reformer Press Company, No. 27, 303 St. Clair Avenue, Cleveland, Ohio.\n\nSEEDS!\n\nAgricultural, Garden and Flower Seeds, Clover, Timothy and all varieties of Grass Seed, Wheat, Barley, Oats, Rye, Beans, Peas, Potatoes, turnips, cabbage free on application.\n\nR. R. KEITH & CO., Seedsmen, Main St., Winnipeg.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done to order, next to H. B. C. Grist Mill.\n\nHandsome New Presbyterian Church.\n\nFURNITURE\n\nJust arrived. In addition to our former large stock we now offer:\n\nFancy Parlor and Bedroom Sets, Give us call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofos, Chairs of nearly all descriptions.\n\nCradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nG. & C. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nPRINCE ALBERT, SASK.\n\nJ. G. O. DAVIS & CO.,\n\nPRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETY\n\nPRINCE ALBERT, N.W.T.\n\nTERMS—$10 per month in advance single receipt, 10 cents postage.\n\nIn the interests of the paper, Businessmen, ladies, please.\n\nAll letters to be addressed to the Proprietor.\n\nFRIDAY, APRIL 25, 1884.\nITEMS OF INTEREST.\n\nTHE VERY LATEST NEWS.\n\nCANADIAN.\n\nQuebec, April 11.—Mr. Cartier's railway subsidy resolutions were adopted in committees of the whole last night without amendment.\n\nHamilton, April 11.—A man named Johnson was killed on the Main Street today.\n\nLondon, April 11.—The price of beef has been raised two cents per pound.\n\nSt. Thomas, April 11.—A fight occurred at the market between a gang of Irishmen who were employed on the Irish laborers on the Canadian Southern railroad, caused by the Irish refusing to work.\n\nMontreal, April 11.—The government, with the assistance of citizens succeeded in stopping the riot after several shots had been fired.\n\nMontreal, April 11.—Mrs. Wright attempted suicide by shooting herself in the head with a pistol. The bullet passed through her head and exited from her right temple.\n\nMontreal, April 11.—Mr. R. H. Smith was found dead in his house near the city hall. His death was caused by an overdose of laudanum.\n\nMontreal, April 11.—Louis Freitas, a Frenchman, while jumping from the car window in motion, fell and was instantly killed.\n\nBurlington, April 11.—The Prentiss-Sydenham-Toronto and Kingston line has been completed. The line will connect the town of Prentiss with the town of Kingston.\n\nAmerican.\n\nSt. Vincent, April 11.—A fire at St. Petersburn last night totally destroyed the buildings of Walsh, Baker and Snyder, the largest lumber yard in the town.\n\nThe fire is reported to be caused by a spark from a stove.\n\nWashington, April 11.—Information has been received that a dispatch sent by the United States authorities at Key West of a Cuban named Mayleto, who arrived at the United States yesterday morning, has been intercepted by the government of Canada to the Spanish Consul at Key West, saying that Mayleto was coming to the United States.\n\nThe State Department has received a report from the minister that Mr. Langdon had demanded of the Haytian Government $40,000 indemnity for American losses in the September riot, or else the minister would not guarantee that the money will be paid.\n\nThe latest communication from Langdon to the minister says that he has received no reply from the minister.\n\nNew York, April 11.—The business failures for the past week are reported as follows:\n\nFred. H. Carey & Co., 157, Canada; compared with 212 in the previous week.\n\nA great contest is expected to take place tomorrow between the English footballer, Billy Edwards, the light weight champion, to take place in Madison Square, May 12th.\n\nThe members of the Salvation Army are ordered to-day on charge of a total of $800 of the funds of the organization.\n\nFred. H. Carey & Co., 157, Canada; compared with 212 in the previous week.\n\nA great contest is expected to take place tomorrow between the English footballer, Billy Edwards, the light weight champion, to take place in Madison Square, May 12th.\n\nThe members of the Salvation Army are ordered to-day on charge of a total of $800 of the funds of the organization.\n\nEMERSON\n\nFrom the Emersonian, April 10.\n\nFarmers are jubilant over the prospect of a prosperous season.\n\nThe crops are now being planted from the banks of the river, and the water is 4 feet above sea level, and rising at the rate of two feet per day.\n\nCamp, Greenbank, has paid his rent and will pay the Along lot taxes on the Red river the coming summer. The sum paid for the land and taxes was $600.\n\nMARKLEY & COY.\n\nUNITED STATES Life Insurance Co'y,\n\nthe City of New York.\n\nESTABLISHED 1869.\n\nAssets $1,315,814\n\nOffice, Bird Block, 433 Main St.\n\nG. H. MAGUIRE, Provincial Manager.\n\nThis Company issues policies regulated by the laws of the State, and is subject to all regulations thereunder.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance COMPANY\n\nESTABLISHED 1869.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds nearly $6,000,000 Annual Income over $1,000,000.\n\nA general agent of the Company will visit this town a few weeks hence and will make known the advantages which may be derived from insuring in this old and reliable Company.\n\nA. SPROAT, Agent.\n\nPrince Albert District, N.W.T.\nCHURCH CONCERT.\n\nIn reporting the concert held at Treston Hall on the evening of Thursday of last week, in aid of the M. I. Church, we may refer to the remarks of Mr. Wright, our parishioner of the Church of England, in his position with regard to criticism of public performances. The performance of anyone who benefits pecuniarily by it, is not fair for subject for criticism, as are the goods which we pay for a price in a store. Why, ladies and gentlemen go to considerable amount of trouble to get up a programme, and it is often the case that they do so from a benevolent desire to help some charitable or worthy object, we feel that it would be the worst possible taste to air our critical acumen in their behalf. Under such circumstances where we cannot conscientiously praise we can be silent.\n\nThose who went to the concert with the intention of helping the Church funds and at the same time enjoying some music, which was performed by amateurs, were in no way disappointed, and the result is all the more creditable as the performers laboured under some serious disadvantages. In the first place, the building, although the best that can be obtained, is, for concert purposes, from the close proximity of the building to the platform and other peculiarities to defective in acoustic properties is decidedly unsuitable, and extremely difficult and to successfully perform with effect, more particularly in choral or part singing. In the next place the accompanying instruments, although of good quality below concert pitch, and had the programme could not well under the circumstances, be embraced by the introduction of comic songs, such as are usually performed not only by their intrinsic merit, but by the force of contrast, tended to give point to the more classical selections. We can only notice the programme in its details very briefly. The anthem \"Ye Shepherds tell me\" was rendered and had evidently been well practised, while at least equal to anything of the same kind we have heard in Prince Albert, we cannot refrain from remarking that all our choral-singing has been improved by a very much greater preponderance of soprano voices to lead, a slightly increased force on the second tenor parts with mix totally improved distribution of the voices, however, this may be the fault of circumstances and we can only do our best with what material we can obtain. Mrs. Brown, Miss Hunt, and Mr. Davis have certainly their reputation by their performance of that beautiful pastoral, \"Ye Shepherds tell me,\" part of which they repeated in response to an enthusiastic ovation. Handel's \"Angels ever bright and fairest,\" originally arranged as a solo and quartette, was rendered in a way which gave great pleasure to the audience. Those who know how thoroughly calibrated the voices are squared to do justice to the solo were glad to find that that had been omitted to Mrs. Shaw. Mrs. Shaw is a vocalist of the audience when she gave them \"Tryo's Lovely Doll.\" That lady to a naturally true, and powerful voice, gave the merit of an easily delivered distinct enunciation, which enables us to sympathise with the composer of the music of her art. Often is Mrs. Brown had to appear, she gave naturally mannered the vocables, recall to a very pretty tune, \"The Last Rose of Summer,\" which was added by Miss Sproul with her usual accomplishment added by Anna Ladd, \"To The Last Rose of Summer,\" was a most satisfactory encore. Mr. Parker, who has a powerful voice, and sang with confidence, did justice to the popular song \"Hearts of Oak.\" Mr. T. O. Davis, whose quaint songs are always so heartily appreciated and harmonically connected, based that he can hold his own in any other order of songs by his performance \"Sitting by the Style.\" In answer to a request from the audience, he gave us \"The House That Jack Built.\" Mr. Peterson deserves credit for the way in which he played his instrument. He made the programme a success by accompanying the following songs: \"Tryo's Lovely Doll,\" \"The Last Rose of Summer,\" and \"Hearts of Oak.\" Messrs. Hunt and Johnson, the masters of the tri and duet, afforded considerable delight by their performance of the organ, and in addition to this Mr. Wright's concert making the one he has given in Prince Albert, we came to an understanding with it. We should gladly have heard more from Miss Shaw's charming harp. Mr. Wright, St. Louis, who has a fine command, handled his lips before beginning his solo, but we do not know what he can do without them. The programme was well arranged, and played every pretty waltz, really well. The worst element of music was the accompaniment of the violins which would have been a severe test of the powers of a master violinist. The violins were played with great skill and attention. From the words with which one of the audience expressed his approval during the evening we concluded that Mr. Wright had been to the Sioux reserve.\n\nCHIT-CHAT LOCALS.\n\nGathered by humour Reporters.\n\nPudding gets plentiful.\n\nVery little water was thrown during this afternoon.\n\nMr. H. E. Reed will leave for Troy tomorrow for business.\n\nDr. Dunlop and his brother left for Troy yesterday morning to bring up supplies for the hospital.\n\nThe P. A. Lacrosse Club has set a challenge to the Edmonton club to play a match at this place.\n\nA new school will be opened at the Bridge on the 1st of May. Mr. T. S. Smith has been appointed master.\n\nA few days ago a prairie fire destroyed a large portion of Mr. S. Smith's farm, a short distance from the Creek.\n\nThree interested in the formation of a cricket club were requested to attend a meeting at the schoolroom at 7.30 p.m. at Treston House.\n\nIt is a good thing that a new school will be opened at the Bridge. It will put paid to the prairie fires which have been common for some time past.\n\nA house belonging to Mr. J. W. Ashby, was badly burned by a prairie fire a few days ago. As the animal is suffering severely it should be closed.\n\nMrs. Brown, Miss Hunt, and Mr. Davis accompanied Mr. H. E. Reed on his visit to Troy. They are going on as we set out their respective occupations, and will be greatly missed by the musical world.\n\nBy the last mail we received a letter from Sergt. John Braden, who was in the service for some time. He has been transferred to Fort Macleod, and expects to arrive there shortly.\n\nThe house and outbuildings of Mr. A. Main, on township line, range 48, was totally destroyed by prairie fire on Wednesday night. Mr. Main has lost his entire family of five.\n\nV. H. Henderson had the misfortune to lose his horse and cart valued at $500.\n\nIn reference to the paragraph in yesterday's paper regarding the H. B. Cole and mill, the Hon. E. Clarke says that Mr. Smith is now on his way back to Prince Albert. He has been absent from the town for several days. The contract has not been broken, and Mr. Smith will be paid for the work he has done. The carpenter working was not done at wages. Capt. Smith will be paid for his services.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT\n\nPlowing Mills and Sash and Door Factory\n\nCOL. NEILST AND MACKEY\n\nFall and Winter Goods,\n\nAnd is prepared to supply his numerous customers with\n\nSuits to please the fancy of all.\n\nUNDERGLOTHING\n\nA Large Assortment of\n\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nMusical Instruments,\n\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 200,000 acres in the Great Fertile Belt, and now offer for sale 10,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gueschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884042501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5638, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3313, 1], [3313, 11946, 2], [11946, 16022, 3], [16022, 24156, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]