[{"id": "0a25b859e59522fb6b827025690154346220a7f7", "text": "THE PRINCE ALBERT TIMES\n\nWEDNESDAY, APRIL 18, 1883.\n\nTHE AMENDED ACT\n\nAlthough not yet in possession of the full text of the Dominion Lands Act an amended and consolidated Act was enabled to pass through both Houses of Parliament that will doubtless prove interesting and valuable information to our readers and as such we shall give it prominence at present; however, we will content ourselves with merely pointing out the new sections of the Act which have been adopted, and are as follows:\n\nThe Government has now appointed officers to take charge of the Dominion Lands, who shall have power to purchase land from the Crown, or from any person who may be entitled thereto, and to convey such land to the Dominion Lands office. The officers connected with the administration of the Dominion Lands Act in the Province of North West and such duties as may be assigned them by the Governor General.\n\nThe Act provides that the Minister of the Interior may arrange to sell them on such terms as he may think fit, and that the exemption may at the same time as his lease is granted, be made subject to the provisions of the Act, and that the Minister may make such regulations as may be necessary for the purpose.\n\nIt is stated that the Marquis of Lorne, upon his return from Canada, will be placed in charge of the Department.\n\nLetters patent have been granted to the Saskatchewan, Gold Mining and Railway Company.\n\nThe last issue of the Canada Gazette contains an application for letters patent for the Appellee Land and Colonization Company.\n\nIn the House of Commons a private bill has been introduced to incorporate the Wood Mountain and Prince Albert Railway.\n\nIt is reported to Ottawa that Mr. Foster, late Chief Secretary for Ireland, is to be the Marquis of Lorne's successor as Governor-General of Canada.\n\nAll the Magazines have included in their columns the news of the selection of Regina as the capital of Assiniboin, and nearly everybody knows that the Marquis of Lorne made such selection. If some strange coincidence the site selected was in close proximity to the town of Regina, and it was a point put up by the Lieutenant-Governor of the North West Territories, and that he has made the selection.\n\nIt is known that Mr. Foster, late Chief Secretary for Ireland, is to be the Marquis of Lorne's successor as Governor-General of Canada.\n\nA good many temporary police are employed in the town, but they do not stop drunkenness, and that people who oppose prohibition, here as elsewhere, are looked upon with suspicion by the police.\n\nAccording to a report from the Department of Agriculture, the total consumption of flour for the first two months of this year was £1,000, and for the corresponding two months of last year, £7,677.\n\nA great many temporary police are employed in the town, but they do not stop drunkenness, and that people who oppose prohibition, here as elsewhere, are looked upon with suspicion by the police.\n\nA full line of Bleached and Grey Cottons, Capes, Blanket Shavings, Lemon Table Cloth, Russia Crab Towelling.\n\nHandkerchiefs\n\nA Choice Assortment of Ladies' and Gent's Silk and Linen Handkerchiefs.\n\nTurkey Red Handkerchiefs.\n\nQuilts\n\nWhite and Colored Quilts in all sizes.\n\nBlankets\n\nWe offer special value in Hudson Bay White Blankets - 2½, 3½, 4½ and 5½.\n\nSmallwares\n\nLinen and Cotton Spoons, Silk Twist, Silk Spools, Buttons, Needles, Pins, etc., etc., etc.\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nFRESH BUTTER\n\nAT Ashdown's\n\nWHOLESALE CLOTHING.\n\nJames O'Brien & Co.,\n\nPrincess Street, Winnipeg.\n\nBUFFALO HALL\n\nOUR STOCK CONSISTS IN PART OF\n\nTEN CASES OF STAPLE & FANCY DRY GOODS\n\nWhich we are now offering at special prices.\n\nFlannels\n\nPlain Grey, Twilled Grey, Navy Blue Twilled, Scarlet Sarsnet, Navy Blue Sarsnet, Corduroy Checkered, Grey Canton\n\nDress Goods\n\nBlack and Colored Cashmeres, Colored Lusters, All Wool French Belges, Rich Brocades, Black Gros Grain Silk, Black and Colored Satins in all shades, Black and Colored Velveteens.\n\nPrints\n\nA full and complete assortment in this line, including Ashton's Celebrated Prints.\n\nYarns\n\nScotch yarns, Canada and Homespun, 1s. 6d.\n\nCottons\n\nHandkerchiefs\n\nQuilts\n\nBlankets\n\nSmallwares\n\nLinens and Cotton Spoons, Silk Twist, Silk Spools, Buttons, Needles, Pins, etc., etc., etc.\n\nFRESH BUTTER\n\nAT Ashdown's\n\nWHOLESALE CLOTHING.\n\nJames O'Brien & Co.,\n\nPrincess Street, Winnipeg.\nITEMS OF INTEREST.\n\nThe Imperial Government has refused to accept the offer of the Prince of Wales to visit Canada. The Prince of Wales has been engaged in a tour of inspection of military and naval installations throughout the Empire. His Royal Highness will be accompanied by the Duke of Connaught and the Earl of Athlone. The Prince of Wales will be visiting Canada from May 1st to May 31st.\n\nA MEETING\n\nGeneral Athletic Club\n\nTHE TIMES OFFICE\n\nThursday, the 19th of April,\n\nAT EIGHT P.M.\n\nBoots and Shoes.\n\nShannon & McLeod,\n\nBoot and Shoe Makers.\n\nFirst floor east of Campbell's Block.\n\nAsh & Robbins,\n\nConsumption.\n\nTRY HUGH MCDougall's BREAD!\n\nHugh Mcdougall\n\nEast End Bakery.\n\nJ. O. Davis & Co.,\n\nPrince Albert, N.W.T.\n\nMEDICAL HALL,\n\nT. E. JACKSON,\n\nChemist and Druggist.\n\nTHOMAS O. DAVIS.\n\nMEDICAL HALL,\n\nT. E. JACKSON,\n\nChemist and Druggist.\n\nHAS ON HAND A LARGE SUPPLY OF\n\nBlue Stone, Castor Oil, Linseed Meal,\n\nEpsom Salts, Sulphur, Horse Medicines,\n\nDrugs, Chemicals, Spices,\n\nDruggist's sundries, Perfumery, Toilet Articles, Sponges,\n\nPatent Medicines,\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nMusical Instruments,\n\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and land for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynn, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. PRYCE, Land Commissioner.\n\nBOOTS.\n\nROYAL\n\nBAKING POWDER.\n\n2,500 PAIRS\n\nBoots and Shoes.\n\nWhich we are prepared to sell at prices that defy competition.\n\nMen's Slip Brogans $1.50\n\nMen's Grass Stogas $3 to $4.50\n\nMen's French Calf Top Boots $5 to $8\n\nBoys' and Youths' Boots & Shoes\n\nWomen's Button Boots $3\n\nLaced Boots $1.50\n\nMisses' and Children's Boots & Shoes\n\nBrocaded Kid Slippers\n\nFrench Calf Slippers\n\nRoyal Corded Slippers\n\nTapestry Slippers\n\nCome One, Come All, and Examine Our Stock.\n\nNo Trouble to Show Goods.\n\nJUST ARRIVED\n\nTweed, Grey Cottons, White Cottons, Twilled Sheetings.\n\nPrints, White and Brown Duck, Damask Bordered Tabling, Damask Plain Tabling, Fleached Tabling, Half Bleached Tabling.\n\nDress Goods in Great Varieties, Silks, Satins, and Velveteens.\n\nJ. O. Davis & Co.,\n\nPRINCE ALBERT, N.W.T.\n\nRiding Boots, Sea Boots, all and every kind, at prices to suit the times.\n\nCall in and See.\n\nLadies' and Children's Boots and Shoes\n\nA SPECIALTY.\n\nLadies' Trimmed Hats,\n\nAt Cost Prices, as I wish to clear out the Stock.\n\nTHOMAS O. DAVIS.\n\nMEDICAL HALL,\n\nT. E. JACKSON,\n\nChemist and Druggist.\n\nHAS ON HAND A LARGE SUPPLY OF\n\nBlue Stone, Castor Oil, Linseed Meal,\n\nEpsom Salts, Sulphur, Horse Medicines,\n\nDrugs, Chemicals, Spices,\n\nDruggist's sundries, Perfumery, Toilet Articles, Sponges,\n\nPatent Medicines,\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nMusical Instruments,\n\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and land for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynn, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. PRYCE, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883041801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2314, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4377, 2], [4377, 4377, 3], [4377, 8437, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]