[{"id": "3bf42ab95f9ac79cc87ca0f1a194a60ce0cf9618", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JUNE 1, 1883.\n\nBANKING HOUSE OF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nFRUIT\nFRUIT\nFRUIT\n\nCARD OF THANKS.\nOn behalf of the P. J. C. Band, I have to thank Mr. T. F. Brown, Esq., for his kindness in presenting me with a white quilt on behalf of the members of the band on the occasion of my birthday.\n\nTHOMAS MCKAY.\n\nCOURT OF REVISION\nNOTICE is hereby given that the Court of Revision of the Town of Prince Albert will be held in the Council Chamber on Monday, the 4th June, Next.\n\nBy Order,\nJ. F. A. SYKES.\n27 April, 1883.\n\nMISS AULD\nHaving visited the homes of Prince Albert and vicinity during the past few weeks, I am pleased to announce that the store lately occupied by Mrs. J. A. Fraser, has been purchased by Miss Auld, who will continue the business under the same name.\n\nH. W. NEWLANDS.\n\nVICTORIA\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's Store.\n\nPassengers & Shippers.\n\nThe Steamer NORTHWEST will leave Prince Albert on Friday next, and will run during the season of navigation between Prince Albert and Edmonton.\n\nFor further particulars apply on board or to\nJ. LESTOCK REID\nDominion Land Surveyor.\n\nPRINCE ALBERT SASK.\nA. C. PATTERSON,\nForwarding Agent.\n\nROBERT THOMSON,\nSign and Ornamental Painter.\n\nNEILSON & McBEATH\nPUBLIC NOTICE.\n\nNotice is hereby given that the sale of the late Mr. Robert Thomson, located at the corner of Main Street and King Street, will take place on Tuesday next, May 29th, 1883.\n\nROB'T BUCKLEY,\nAccountant, Estate and General Agent.\n\nTHOS. ORAM WM. SHANNON & CO.\n\nCHIT-CHAT LOCALS.\n\nA book lot of fine drugs and chemicals has just arrived at Jackson's.\n\nMr. H. Wallers arrived back from Prince Albert last week.\n\nMr. J. F. Kennedy, an old resident of this town, returned on Monday.\n\nInspector Morley, N.W.M.P., and Mr. R. E. Lawrence, of Battleford, are now here.\n\nThe steamer on the North river right will take place by public auction on Tuesday, the 19th inst.\n\nMr. H. Mitchell, of Duck Lake, is recovering slowly from his recent illness.\n\nMiss Auld has opened out her millinery and dressmaking establishment.\n\nThe work of grading and clearing the road and cutting down the hill is progressing favorably.\n\nHon. R. Gwynne got back from Windy Bay on Monday last. He saw his wife and children there on his way to visit his friends.\n\nA Town Hall will be held in the Town Hall on Monday next, the 4th June, at which time the ratepayers will be called upon to assess the rate which will be allowed the privilege to appeal.\n\nThe Saskatchewan Directory is for sale at the office stores here. The price has been raised to $1.50 and parties wishing copies should secure them at once.\n\nWe would like to know why our council is so opposed to fitting up a seat and place for a prime minister. May be it is because they fear that some may be afraid of being elected. It is possible to be a more efficient council.\n\nThe president of the Saskatchewan Rifle Association has been appointed, Lieut. Col. D. H. Macdonald, P.M., to be the president for this year. This cup is a magnificent piece of workmanship and is worth every penny given. It is a tribute that all those who meet him far away do not forget us.\n\nMr. J. F. Hutchison, an old timer who was away for some time, came in on the stage this week. He had just returned from the Pacific coast where he visited Prince Albert's former residents, some of whom are doing well, while others expressed a wish that they could have returned and get back here. Everyone returned again.\n\nA Ladies' Aid Society was organized recently by the ladies connected with the Presbyterian Church. The officers connected with the society are: president, two vice-presidents, secretary, treasurer, and corresponding secretary. The society has at present, forty-five members. The ladies are busy engaged in various charitable works and will hold at the time of the Lorne Agricultural Fair.\n\nFor the last few days a very destructive fire has been raging in the woods near the river. This is the worst fire that has been in the neighborhood for many years. The fire guard captain says that the fire guards have neglected their duty when they allowed such wasteful destruction without taking proper measures to put it out. It is said that the fire was caused by a spark from a train, but the authorities have answered for their carelessness in allowing such a thing to happen.\n\nThe steamer NORTHWEST will leave Prince Albert on Friday next, and will run during the season of navigation between Prince Albert and Edmonton.\n\nFor further particulars apply on board or to\nJ. LESTOCK REID\nDominion Land Surveyor.\n\nPRINCE ALBERT SASK.\nA. C. PATTERSON,\nForwarding Agent.\n\nROBERT THOMSON,\nSign and Ornamental Painter.\n\nNEILSON & McBEATH\nPUBLIC NOTICE.\n\nNotice is hereby given that the sale of the late Mr. Robert Thomson, located at the corner of Main Street and King Street, will take place on Tuesday next, May 29th, 1883.\n\nROB'T BUCKLEY,\nAccountant, Estate and General Agent.\n\nTHOS. ORAM WM. SHANNON & CO.\n\nCHIT-CHAT LOCALS.\n\nA book lot of fine drugs and chemicals has just arrived at Jackson's.\n\nMr. H. Wallers arrived back from Prince Albert last week.\n\nMr. J. F. Kennedy, an old resident of this town, returned on Monday.\n\nInspector Morley, N.W.M.P., and Mr. R. E. Lawrence, of Battleford, are now here.\n\nThe steamer on the North river right will take place by public auction on Tuesday, the 19th inst.\n\nMr. H. Mitchell, of Duck Lake, is recovering slowly from his recent illness.\n\nMiss Auld has opened out her millinery and dressmaking establishment.\n\nThe work of grading and clearing the road and cutting down the hill is progressing favorably.\n\nHon. R. Gwynne got back from Windy Bay on Monday last. He saw his wife and children there on his way to visit his friends.\n\nA Town Hall will be held in the Town Hall on Monday next, the 4th June, at which time the ratepayers will be called upon to assess the rate which will be allowed the privilege to appeal.\n\nThe Saskatchewan Directory is for sale at the office stores here. The price has been raised to $1.50 and parties wishing copies should secure them at once.\n\nWe would like to know why our council is so opposed to fitting up a seat and place for a prime minister. May be it is because they fear that some may be afraid of being elected. It is possible to be a more efficient council.\n\nThe president of the Saskatchewan Rifle Association has been appointed, Lieut. Col. D. H. Macdonald, P.M., to be the president for this year. This cup is a magnificent piece of workmanship and is worth every penny given. It is a tribute that all those who meet him far away do not forget us.\n\nMr. J. F. Hutchison, an old timer who was away for some time, came in on the stage this week. He had just returned from the Pacific coast where he visited Prince Albert's former residents, some of whom are doing well, while others expressed a wish that they could have returned and get back here. Everyone returned again.\n\nA Ladies' Aid Society was organized recently by the ladies connected with the Presbyterian Church. The officers connected with the society are: president, two vice-presidents, secretary, treasurer, and corresponding secretary. The society has at present, forty-five members. The ladies are busy engaged in various charitable works and will hold at the time of the Lorne Agricultural Fair.\n\nFor the last few days a very destructive fire has been raging in the woods near the river. This is the worst fire that has been in the neighborhood for many years. The fire guard captain says that the fire guards have neglected their duty when they allowed such wasteful destruction without taking proper measures to put it out. It is said that the fire was caused by a spark from a train, but the authorities have answered for their carelessness in allowing such a thing to happen.\n\nThe steamer NORTHWEST will leave Prince Albert on Friday next, and will run during the season of navigation between Prince Albert and Edmonton.\n\nFor further particulars apply on board or to\nJ. LESTOCK REID\nDominion Land Surveyor.\n\nPRINCE ALBERT SASK.\nA. C. PATTERSON,\nForwarding Agent.\n\nROBERT THOMSON,\nSign and Ornamental Painter.\n\nNEILSON & McBEATH\nPUBLIC NOTICE.\n\nNotice is hereby given that the sale of the late Mr. Robert Thomson, located at the corner of Main Street and King Street, will take place on Tuesday next, May 29th, 1883.\n\nROB'T BUCKLEY,\nAccountant, Estate and General Agent.\n\nTHOS. ORAM WM. SHANNON & CO.\nFRIDAY, JUNE 1, 1893\n\nHORSE SHOE STORE\n\nTHAT OLD, RELIABLE KILLER OF PALM,\n\nCampbell's Cathartic Compound\n\nThat Old, Reliable Killer of Palm.\n\nTHOS. O. DAVIS\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books.\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK.\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, New York, N.Y.\n\nFRIDAY, JUNE 1, 1893\n\nRUSSIAN WHEATS\n\nSeveral varieties of these wheats are being grown in this District this year, and as we have advocated giving them a fair trial, we publish the following facts. Mr. J. C. W. Field, Johnson's Lincolnsay Farm, Manitoba, writes us as follows:\n\n\"We are growing Russian Six weeks wheats for their early ripening qualities and no one can say that we are not giving every opportunity to have the fact most fully demonstrated. The Winnipeg Board of Grain Examiners, condemned these varieties on the ground that they were soft wheats. They have been called as No. 1 hard, in Russia, Italy, and France, imported nearly all hard wheats for market purposes. A large firm of corn merchants in St. Petersburg has also reported very highly of the same wheats. We quote the following extracts from the Mark Lane Express, London, Eng.:\n\n\"Our fresh harvest in the last five years has been sent to South Africa, which came mostly in small parcels by steamer. This wheat is of high quality, and is preferred by the millers, and the expert trade from the Cape Colony.\"\n\nProfessor W. Streif, of Hohenzollern, Germany, has been making some tests on various wheats, and has found a way to determine their relative protein content. He says that the flour the gluten contents were highest in the Russian wheats, ranging between 20 and 21.5 per cent.\n\nWe are pleased to learn that the Russian Six weeks and Kalakusa wheats sown in this District are growing well. We will be glad to receive crop reports from farmers and others every week.\n\nIn the debate in the House of Commons on the Northwest Assembly Act, Mr. Watson, Marquette, Manitoba, reminded the Northwest members what their constituents had warned him was very properly said on by Mr. Perley. Mr. Watson undertook to show that the member for North Dakota had given his seat to the Senator before he had been elected by the Crown Prosecutor here to French half-breed claims, and made some silly statements about the good grace, hospitality, and other fine characteristics, but it was evident that he had been misled by his own belief in the spirit of the speech by Mr. Macdonald.\n\nMr. Watson then proceeded to explain why he had been elected to the seat, and the reasons and all the advantages of the latter in question were alluded to. The charges of a corrupt election, however, were answered by the words, \"But Watson and his friends succeeded in making themselves thoroughly unpopular by their attempt to secure a point against the Government who showed himself to that degree, so as to be able to hold his own on the floor of the House with the best of the Northwest members. We are convinced that this Mr. Macdonald will also speak strongly against the present liquor laws in force in the Territories, which he characterizes as arbitrary and unconstitutional. It is a matter of common knowledge that when the people who have hitherto voted for him are not represented in Parliament. He advocated leaving the matter to the people of the Northwest. This is what we have always advocated for a long time, and there is every reason to believe that in another year the people will be called upon to decide whether they will have liquor or prohibition. We have already heard that the Local Assembly Act, but have not yet received the Bill, and are anxious to see it passed into law at an early date.\n\nThe Town Council held a regular meeting last night. Mr. Watson, Mayor Bains presiding. The council present were McPhail, Stewart, Knowles, Davis and Knowles.\n\nThe Finance Committee recommended the expenditure of $250 for the purchase of the new Town Hall. The committee present were McPhail, Stewart, Knowles, Agnew and McPhail.\n\nA motion was made for the Board of Works to take up the sidewalks building as a backup plan was declared for the vote being a tie.\n\nBy Laws.\n\nSeveral by-laws received their first reading and ordered to be signed, sealed and returned to the Town Clerk.\n\nMr. T. N. Campbell was appointed Street Surveyor, with the magnificent salary of $100 per month.\n\nCain Davis gave notice that he would purchase by law the purchase of the property on Church and right of way on Church street.\n\nBefore the council adjourned Mr. McPhail moved that the Town Council should have the power to purchase land for the purpose of widening the streets. Mr. Knowles said they had let him believe they would purchase a number of copies of the Saskatchewan Herald, but when the order was complete, it was now buried, he said, and that the Town would have to pay at least five cents per copy.\n\nIt was unanimously resolved that the Town Council may order the distribution of newspapers.\n\nThe Council then adjourned.\n\nThe Saskatchewan Rifle Association are making arrangements to have their new range in good repair for the meeting which takes place along the middle of the range in the Territories. The cup presented by D. H. Macdonald, Esq., M.P., will also be shot for in a separate match.\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness, design and quality. The Variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nAsh to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 16 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nMOORE & MACDOWALL.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888060101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3708, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8514, 1], [8514, 14341, 2], [14341, 15195, 3], [15195, 15195, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]