[{"id": "eabe57facd17bd752d5ec6d7f14785313e7e98a8", "text": "THE PRINCE ALBERT TIMES\nAND\nSAASKTCHewan REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, APRIL 23, 1886\n\nThis paper may be found at the following places:\n\nROWELL & CO., NEWSAGENTS, PRINCE ALBERT.\nH. H. ROWELL, NEWSPAPER ADVERTISER, PRINCE ALBERT.\nMRS. ROWELL, NEWSPAPER ADVERTISER, PRINCE ALBERT.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n11 a.m. - His Lordship, Bishop.\n12 noon - Mr. Maclean.\nThe Holy Trinity Chapel\n11 a.m. - Archdeacon McCaig.\n1 p.m. - Sunday School.\n7 p.m. - Sermon by the Bishop.\nSt. Catharine's Church\n10 a.m. - Rev. Canon Piatt, B.D.\nSt. Paul's Church\n1 p.m. - Rev. Canon Piatt, B.D.\nSt. Andrew's Church\n10 a.m. - Rev. E. Matheson.\nSt. John's Church\n1 p.m. - Rev. E. Matheson.\nSt. James' Church\n9 a.m. - Very Rev. Dr. Maclean, B.D.\nSt. Anne's Church\n10 a.m. - Rev. Mr. Andrews.\nSt. Paul's Church (Presbyterian)\n10 a.m. and 1 p.m. - Rev. Mr. Williams.\n\nFRIDAY, APRIL 23, 1886\n\nA couple of Winnipeg men have said to be trying to secure the Government's consent to their taking Poundmaker and a number of his followers to England for exhibition purposes. It is to be hoped the request will be refused. The people of England have no right to any erroneous ideas of what will happen without seeking to confirm them in their ignorance.\n\nLarge as the debt of Canada is, it is not as large as the debt of the Australian colonies, which cannot carry lines of railway such as there are here. Dominion railways can be built at the same extent that we can. The public debt of the Australian colonies is $600,000,000, and the population is smaller than that of the Dominion. The average debt per head is $500, and the average taxation per head is $140. The average debt per head in Canada is $70, and the average taxation per head is $6.\n\nThe very uncertain character of the new parliament of Great Britain comes to the surface every now and again. On the very first three weeks of Mr. Gladstone's government was placed in a minority, except for the vote for the London parks, and once about condemning the practice of making peace or war without the consent of Parliament. The week following, the ministers had a narrow escape over the claim made on the part of the volunteers for an increase of the capitulation grant. Mr. Gladstone is likely to find himself in a similar position highly important questions before long if what has happened is any criterion of what is to come.\n\nAmericans can be very cantankerous. The New York Herald asserts that the attitude of the Canadian Government towards American fishermen is attracting attention because of its extreme unreasonable nature and the irritating manner in which the Canadians are attempting to set up a system of non-intercourse, purely vexatious to our people and injurious to their own. For right indignation is felt by many of us. Canadians are simply trying to enforce the provisions of the Washington treaty of 1818. If the provisions of that treaty are vexatious to Americans, I have only to say to it, for me. The treaty of 1818 is revoked during the lapse of the treaty of 1871, and it is not for Americans to complain.\n\nWhile all will admit the courage of Mr. Gladstone in bringing forward his bill to provide home rule for Ireland, the fact remains that it does not satisfy. It will satisfy neither Liberal nor Conservative voters, nor the Parliamentarians. It does not go far enough for some, and it goes too far for others. It is yet too soon to criticize the bill, as its details are not yet known. But the statement by Mr. Chamberlain recently, that he would sooner vote for separation pure and simple than for the bill, is startling. The real trouble in doing away with Irish nationality will fall on the English and Scotch, who will not be acceptable to a majority of the Irish, and what will please the Irish will never be accepted by the Scotch and English.\n\nThe Imperial Government is alive to the great importance of the Canadian Pacific Railway, and is taking steps to utilize the line. Lord Hardinge has put the claims of the railway company and of Canada for some substantial recognition at the hands of the Imperial authorities before. Hon. Mr. Lordly, and a cautious and official reply was given. What the Imperial Government may do is uncertain and unknown, but it is known that a sum of money was promised to the railway, and that the development of a new route from Vancouver Island to Japan, China or India. The present quickest service from London to Hong Kong is permitted by law to be 34 to 37 days, according to season, to Shanghai in 39 to 42 days, and to Yokohama in 43 to 46 days. By the Canadian route the time to Hong Kong will be 29½ to 31½ days, to Shanghai 32½ to 33½ days, and to Yokohama 34 to 35½ days. It takes less time than that of the Imperial authorities are alive to the importance of the road. It is always advisable to take two things at a time, and at present there is only one thing and it is liable to break at any time. In the event of the war the Suez canal could be blockaded and England be seriously hampered in her efforts to reach India. Mr. F. R. is another step to the harbouring of the kingdom of Sir John A. Macdonald in hurrying the road to completion is becoming more and more apparent every day.\n\nA recent issue of the Canadian Gazette states that Dr. Barnardo has accepted, under the terms of the Emigration Act, a settlement of half a land in the district of Prince Albert, on which to start an institution in connection with his establishment in London, for the training of boys for employment in life on the prairies. Already Dr. Barnardo has received 12,154 boys and girls, all of whom are doing well in situations which have been found for them, chiefly with farmers in Ontario. Another settlement of 2,000, turning upwards of 200, has just arrived, bringing up the total to almost 2,000. The scheme of having a Northwest Home appears to be an admirable one. With our farmers the season for harvesting operations is short and labour is scarce. Good honest boys would be a valuable assistance, and in addition to any temporary advantage that would be derived from the presence of boys employed on the land, they are expected in time to take up land for themselves and thus transform the waste of Lion- dale into respectable and well-to-do settlers.\n\nThe Canadian Gazette, London, Eng., says:-Mr. Beggs' paper on \"Canada and its Natural Highways,\" which was read before the club last Tuesday evening and from which we give some lengthy extracts on another page, was noteworthy for the amount of information contained therein. The Dominion was viewed within the narrow limits imposed by the occasion. It was listened to with interest by a numerous audience, to whom some idea of the scenic attractions of the Dominion, as well as the advantages for the use of the leading cities, was given by means of the excellent views which were shown after the reading of the paper. A vote of thanks to Mr. Beggs was proposed by Dr. Ed. Smith, who was also familiar personal knowledge of the Dominion to endorse many of Mr. Beggs' statements, and who emphasised the importance of emigration as a means of dealing with the ever-increasing population of the Old Country. Mr. Chadwick, who also spoke, referred specially to the importance of the Hudson's Bay route for the promotion of trade.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n3RD ST., PRINCE ALBERT, SASK\n\nNOTICE.\n\nAll parties indebted to the Hudson's Bay Company are requested to call and settle their accounts before the 1st day of May 1883. After that date all accounts unpaid will be placed in the hands of our Solicitors for collection.\n\nGEO. S. DAVISON.\nTERRITORIAL NEWS\n\nEDMONTON.\n\nWinter linger in the lap of spring. Meeting of the agricultural society almost over. Rumored that Judge Ruelan will hold court here on April 19th. Mr. Prout, from Fort Saskatchewan, was present at the meeting.\n\nMonday was quite stormy and about two inches of snow fell. The weather was cold.\n\nJas. Prout, of Beaver Lake, was in town last week. He said good and plentiful rain falling in that region since Feb. 10th.\n\nIndians in the Victoria agency are now making their appearance. There have been few if any complaints in the Edmonton agency this winter.\n\nFORT MCLEOD.\n\nFrom the Gazette.\n\nAn extensive pioneer fire was raging on Willow Creek on Sunday. Mr. Craig has purchased a new match and stock of flour, corn, and milk for his dairy field all himself. He is doing a rushing business.\n\nThe weather during the past ten days or so has been simply magnificent. Bright, clear days with scarcely a breath of wind, and nights while there may be a cool blast, there is no cold relief against the clear sky. No wonder one becomes inclined to go outside.\n\nThe main trip along the roadbed is in full working order, and is a great convenience. We have every reason to be satisfied with our accommodations, receiving the hands of the post-office department. The weekly mail was always an immense favor, requiring considerable time to sort it. Even now each mail is a big one.\n\nLETHRIDGE.\n\nFrom the News.\n\nThe ferryboat is running on the river here.\n\nThe mines were opened again on Tuesday last.\n\nCol. Macleod passed through here on Monday on his way to hold court in Medicine Hat.\n\nMr. J. H. Carnahan returned from Winnipeg on Saturday last. He reports the weather very cool this spring.\n\nThe prairie is putting on a growthy thing, and a shower of rain now would make things look very pretty.\n\nThe ranchers in this vicinity have started the spring work and consequently ploughing and haying are in great demand.\n\nCol. Irvine was presented with several addresses at Macleod on the occasion of his retirement from the force. One from the citizens was signed by over 100 persons.\n\nQUEAPPEDGE.\n\nFrom the Progress.\n\nDuck shooting. Beautiful weather.\n\nMr. Fenwick has returned from Ontario. He brought with him a car load of horses.\n\nSeveral carloads of horses and cattle have been shipped via the P. R. R., some for here, and others for points west.\n\nThe farmers in this vicinity are rigorously pushing seeding operations, and if the present fine weather continues the wheat will nearly all come up before the end of another week.\n\nMore horses are wanted in town. There is not enough accommodation for the farmers' horses at present.\n\nWill some one or more put their heads together and start a brick yard, and build some nice brick houses?\n\nWe will keep on writing to our correspondents that it takes a whole week to get a reply. So why should we wait until next week? We send them the more convenient it is for us.\n\nThere remains into a run a risk of being left over till the next week.\n\nREGINA.\n\nFrom the Leader.\n\nThe new gold mill commenced work today.\n\nThe P. R. R. is now opened up for freight to Donald, a station where the first crossing of the Columbia River, B. C.\n\nThe Government contract for supply-\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowellings,\n\nDress Goods,\n\nSilks,\n\nLinens, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., \"Over 13 feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nRADICALISM.\n\nThere are Radicals and Radicals. There are men who, with no wish to tear down what they cannot rebuild, are anxious that the present system shall be left alone. But Radicalism there is a problem of new realities, new temperaments and unyielding principles. If the Radical way, drive the state coach into a ditch or over a precipice, and call prosperity. Such men fail to understand what is essential in Radicalism; that there is a time to sit down as well as a time to rush headlong onwards. If enemies with schemes for the future should succeed in their aims, being equipped with the idea that the chief end of thought and action must be public attention. Such men have no real patriotism. If they could speak, they would say, \"Let us be content.\" They are lazy, fussy, self-centered, and irresponsible. They rashly will try nothing above the point where, chilled by the breath of death, and not ashamed to shake their heads and turn their backs at statesmen who have done so much for the advancement of political freedom and for the prevalence of the principles of justice than any are capable of doing.\n\nThese kind of Radicals are constantly declaring their belief in that famous political warfare which is called \"class war.\" It is a part of the natural growth of modern ultra Radicalism, as it is now an all over the world, which has been the bane of the working man and should give a wide berth. When one of these men enters upon the scene, he is sure to become his protege. He takes him under his guiding care, secretly chatters about his rights and his wrongs, and then votes for him. No man can mention one realistic legislative reform did the work organism. The Radical who has eaten the fish of the sea is bankrupt, but no man can hold or tame the Ultra Radical Working man should beware of him.\n\nPROGRESS OF SCIENCE.\n\nPhysical science may be said to have enjoyed the recognition and encouragement of political society for about half a century. About fifty years ago Sir Isaac Newton died, and with him the Royal Institution. Society rushed to hear them. The bookbinder's apprentice who wished to be a scientist was encouraged to give an impulse to a movement which has never flagged since. Before that time men of science were treated with absolute contempt even the late Lord Kelvin had no sympathy for the studies his son employed his brain upon. With the influence of the country's recent growth year by year and extend more widely than ever imagined. Even the ladies discuss it and the later developments are prophesied. But there is a serious fundamental question concerning scientific ambition; and it is the influence it is exerting on literature. Nothing is more striking than the influence of George Eliot's style, but its attractions are diminished by the introduction of physical science. Only a technical dictionary of metaphors taken from the laboratory, and of analogies drawn from the dustbin of science.\n\nNo longer is the world without the blinding medium it was at the commencement of the present century. The true bookbinder is now large and ignorant. It tells the world in parliamentary language that it must accept certain conditions, or be doomed to encompass themselves in the somber mind, or else perish of its own folly. As soon as the parasite has disappeared, its enemies begin to realize the loss of the dining room. His autograph is asked for by beauty and fame because the idol of the Masses. How does he get his living? No wonder the study possesses an inordinate species of concert on the part of the stranger who visits it. The face of the earth a more obvious specimen of household beauty than the young man who owns it.\n\nThere is little of the weakness and the apologetic tone about him which Fara day displays in his digressive and groggy possession a building in which alien to one's idea of what an orthodox man ought to be. Society and the world have been thrown into confusion. An air of suspense is one of them.\n\nKINDLY INTEREST.\n\nA few evenings ago a banquet was tendered the delegates in Ottawa of the Northwestern Council, Moses, Perley, Ross and Wilson, at Regina. During the course of their remarks, one of the delegates referred to the country the delegates when in Ottawa from the different ministers they had seen in connection with the object of their mission. Mr. Ross spoke of the kindness shown to every suggestion made by the delegates and said all were disposed to make the best of the situation. The delegates of the Northwest, especially ones the case with him. Then White House of the Intercolonial Railway the three delegates came away from Ottawa fully convinced that the honorable gentlemen in a warm friendly manner. Mr. Ross said that he was most concerned to know that three members of the Northwest Council, after hearing the delegates, were convinced that he is a true friend of this portion of the Dominion.\n\nMr. Ross spoke in favor of Macdonald, dealt with the charges of the provincial government that the delegates had been paid for services rendered and that every reasonable demand made would be granted. A court of appeal was to be established in the Territories, the law, on any question relating to the same, the government would dispose of their interest in the mines in order to make the settlement of the land. The future of the Northwest would in future be managed by the Council. But, Mr. Ross added, the government would continue to send delegates that everything would be done to push ahead the Hudson's Bay Company's interests. Mr. Ross said the Dominion government was opposing the building of the road and that the expedition was to investigate the situation for the purpose of getting a charter. A very good judge in fact. It has also been said, and the statement has been made with truth and sincerity, that the government cared little about the C.P.R. rate or the interests of the far west. Mr. Ross said that the Dominion government, however, that the government will use its influence to induce the C.P.R. to lower its rates. Mr. Ross said that he was shocked with the delegates for hours at a time, putting off for the purpose of making important business. He intimated again visiting the Northwest himself still better acquainted with its requirements. Whether he may be able to do so remains to be seen. It is difficult recently, whether on a public platform or through the columns of a newspaper, to convey accurately the meaning of certain words. Mistakes may have been made in the past by the Dominion government in the matter of settling the country, but they have been those of the best intention.\n\nA CURIOUS DREAM.\n\nThe Vision of the Night Which Made Professor Agassiz.\n\nHe had been for two weeks trying to decipher the somewhat obscure impresses of a fossil fish on the stone slab. He had worked hard and long. Wearied and perplexed, he put his work aside last night and tried to dismiss it from his mind. He had been unable to find anything to amuse him while asleep he had covered his bed with all the missing features perfectly fitted together. He had tried to hold and make fast the image of the fossil. Nevertheless, he went early to the Jacuzzi de Plaisance, hoping that our singular friend, the impression itself, would something which would put him on the track of the vision. In vain did he seek for the fish which had disappeared. The next night he saw the fish again, but with more satisfactory results. What he expected might be repeated, on the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep. Accordingly, toward morning the fish appeared in his dreams, continued all night, but in such a way that he had no longer any doubt as to its identity. He had looked at it in particular detail, studied each of those characters on the sheet of paper at the bedside. In the morning he was surer than ever that he had seen the fish in his memory, before. Hoping that the same experience might be repeated, on the same occasion. He had tried to pipe beside his bed before going to sleep.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886042301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5347, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7870, 2], [7870, 11891, 3], [11891, 23360, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]