[{"id": "9d4971802cad10c9fd77de049123fa68a70f4988", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETY\nAT PRINCE ALBERT N.W.T.\nFRIDAY, JUNE 17, 1887.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's and St. Mary's Churches (1 p.m.) Services in both Churches and Sunday School at 12 o'clock. The Rev. Canon Pickett in charge, Rev. A. H. Wright.\n\nSt. Paul's—3 p.m., Rev. Canon Pickett.\n\nSt. John's—9:30 a.m., Mr. Macdonald.\n\nSt. James'—3 p.m.—Ven. Archdeacon Macdonald.\n\nSt. Peter's—10:30 a.m., and 3 p.m.\n\nSt. Paul's—Presbyterian—11 a.m. and 5 p.m.\n\nMethodist Church—Red Deer Hill and Island Lakes every alternate Friday morning; Rev. Mr. Smith.\n\nThursday evening at 7:30, Mission and Band.\n\nRev. Mr. Willis, Red Deer Hill.\n\nTHIS PAPER may be found at the following places:\n\nMr. J. W. Brown, 10 Princess Street, where advices are given and orders taken.\n\nNEW YORK.\n\nFRIDAY, JUNE 17, 1887.\n\nRECENT CRIME AND THE PUBLIC SECURITY.\n\nOur readers cannot fail to have been shocked by the number and atrocity of the murders perpetrated in the Territories quite recently, and it is gratifying to see that the police has been working hard, a want of success in tracing up and speedily capturing the perpetrators of these deeds of blood. In such a large and thinly populated country as ours there is little wonder if evil-doers should now and then succeed in escaping the hands of justice for a time, but we cannot and do not deny that the police authorities (who are fully alive to the absolute necessity of putting forth their utmost exertions) will be quickly successful in capturing every suspect who offers the guilty to swift and condign punishment.\n\nIt always happens that when any great crime, such as murder, occurs in a neighborhood, a natural horror at the thought of the fate of the victim causes a kind of reverie to pass through the people, and a sort of restless anxiety takes hold of possession of them till the perpetra tors are kept to the full, safe custody and amenable to the outraged feelings of the country. But when it happens that delays in tracing out and capturing the criminals take place, as they often do, the same restless anxiety becomes intensified, and not unfrequently the disappointment finds vent in grumbling at some one or other—generally at the police—as though our course are always on hand and chief in all matters occurring.\n\nWe forget to see in the correspondence of more than one of our contemporaries that the North West Mounted Police are coming in for some criticism at present for inactivity and so forth, in their failure to succeed in making captures in connection with the murders we have referred to. It is absurd, however, to utter wholesale complaints against the Force because in some isolated instances individuals of them have failed to do what the public certainly longs for, but what may be very difficult or almost impossible of execution for all that. We never sympathise with these wholesale charges against the Force, for we do not think them at all well founded. If the police could only able to realise the difficulties the Police have often to contend with in following up a clue or trail, they would be more lenient in their criticism for they would somehow find the fault was not so much in the incapacity of the Police as in their own impatience and want of knowledge.\n\nAs we have said, we hope and trust the authorities will speedily have all these criminals in custody. In fact this is doubly called for, not only to satisfy the ends of justice, but also to prevent the growing of crimes which have already been committed and growing, especially in the outlying settlements. Confidence requires to be restored and maintained, and something especially requires to be done for the security of the lives of the public and the mails over the long and almost unprotected route from here to the railway. Whether this may be best accomplished by a strengthening of the police patrols and stations or otherwise is for those in power to decide, but whatever arrangements are to be made should be thoroughly efficient and should be organized at once.\n\nCOMMUNICATIONS\n\nIt must be distinctly understood that we do not undertake responsibility for the publication of communications, but will do our best in full, not necessarily for publication.\n\n\"SEED GRAIN\"\n\nTo the Editor of the Times,\n\nSir,—In a letter on the above subject in the columns of the 16th inst., in which Mr. McTaggart of the Dominion Land Co. Ltd., spoke, I would like to be considered by the police committee to treat his remarks as a challenge to anyone who might be interested in the question of the seed grain committee of the Local Agricultural Society.\n\nThis is a joke. It does not belong to the ordinary either, for there is here a sort of prejudice in the question, and a tendency in approaching the characteristic of the worthy author. This letter brings Mr. McTaggart before the public as a man of small size and of small pipe. It may happen to strike some of them, as he would have felt it did me, that he was a man of small size and heavy build, but there is really no accounting for taste and his appearance has at least an air of effect of novelty.\n\nThere is indeed nothing to say that Mr. McTaggart is not entitled to the seed grain committee's expenses, but he should forgive his intentions in that line of sympathy with Mr. McTaggart, should not again make use of the heavy pipe. It is possible and stale from age, and Mr. McTaggart is not likely to be tempted by the temptation to make a spectacle when he sees it in print and thinks how easily one might resort in a similar case. He should not be encouraged one lot of oats to be bought from a settler. Now what are the facts? Mr. McTaggart says that the local government should buy any seed grain of suitable quality that might be offered for sale, but he does not say why he adverted to that effect. There was no expectation that a large quantity would be bought, but there was a possibility there in asking so much to be sent from outside. In point of fact only three samples were submitted to the committee. They passed as two of the oat samples and as these were not bought, Mr. McTaggart's local town who held the bulk and withdrew his sample before it was reported on, was not asked to purchase a well known farmer, and was quite good in quality but a little deficient in colour. Mr. McTaggart does not mention this therefore in recommending it, directed attention to that fact, and that what Mr. McTaggart had to say on the subject was not a sample. But whether the recommendation was feasible or feasible there was surely nothing ridiculous in the matter, certainly nothing to justify absurd and mean jokes.\n\nH.M. (signature)\n\nI am writing this in ignorance of the details upon which the committee acted but I learn from this, that supposing he had written a recommendation as he thought it would not have been communicated even sooner if it had been, in that case, up to the mark in regard to the quality, he would have passed the whole without exception had it been written in that way. It was the half of the committee that few samples were sent in. All they had to do was to select the best sample to report as a recommendation. Mr. McTaggart himself had before them. He smears the committee \"of the utmost contempt\" of absolutity honestly, but says, but is honest for him in his anxiety to elucidate what he believes is a point against the committee to properly represent the quantity as \"about fifty bushels,\" whereas in reality it was a good deal less than that figure. This may be a small matter, but he should have been particularly careful to make sure of things which are misleading while he meant, in almost his next paragraph, to charge the committee with making a statement in the same spirit. The statement namely that more farmers had been refused on the barley, while they were actually undertaking a quality still retained on hand in store.\n\nThis is more serious than the honesty of the committee in the matter already handled. I do not know why she in saying the paragraph he quotes is \"not altogether fair,\" she does not say that any of the oats and barley were left over, but all events he \"exchanges the seed amongst the farmers,\" and that he is one single farmer who was refused oats or barley for seed purposes, and who had been refused for the last five years for the purpose of sowing. This challenge may likely enough be taken up by other parties, but it is not likely that Mr. McTaggart will. Whether he refused any grain to Mr. John C. McNevin (241) Whether on the 1st July, 1886, he might then have the grain he had previously asked for and been refused? (25) Whether he refused any grain to Mr. McTaggart himself. The seed grain committee are prepared to justify all actions they take, and they say that they have ever made and they believe, more over than this, if they think proper, to give the farmers the opportunity in which seed grain matters were concerned this last winter, without of necessity, having to go back to the committee for just or deduction of duty to either Mr. McTaggart or any seed grower individually. Mr. McTaggart is asked to state and for ought the committee know to the contrary he may have had rightly tied up seed grain, but he has left no record of action. The committee have no means of knowing about this—but since he has stated it, and he has stated it, he will not object to have this reply.\n\nYours truly,\n\nWM. CRAGG.\n\nAromatic Mentholated Quinine Cordial at Clark's Drug Store.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAT T. N Campbell's New Store.\n\nA LARGE STOCK OF Watches,\nClocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\nNEW GOODS\nAT\nCHAS. MAIR'S W ST END STORE,\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Ropes, Window Holland in Slate and Yellow, Black Mats, Fine Linen, Fine Creations, Fine Creations, Ladies' Felt and Embroidered Felts, Ladies' Fancy Frillings, Breezy Veiling, Ladies' Silk Ties, Tinsel, etc., etc.,\nALL AT LOW PRICES.\nAlso a large stock of Readymade Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Tinned Goods of all kinds.\nInspection is solicited.\n\nCALEDONIA BREWERY\nNew Ferry.\nEAST END.\n\nI wish to inform the public that I have built and am running a new Ferry boat at Caledonia, and that I shall put it into service immediately. It will be a great convenience to the people living near the ferry.\n\nTOUSSAINT LOUSIER.\n\nTHE Dartmouth Ropework Co.\nMANHATTAN, NOVA SCOTIA.\nThe proprietors of the above concern are Messrs. Toussaint Lousier and Sons, who have been engaged in the manufacture of rope and twine for many years, and are now engaged in the manufacture of rope and twine for the Dartmouth Ropework Co., Wellington St., West, Toronto.\n\nLIVERY & FEED TABLE\nCHARGES MODERATE.\n\nCHAS. WOODMAN\nPROPRIETOR.\n\nCHAS. WOODMAN\nTERRITORIAL NEWS\n\nEDMONTON.\n\nFrom the Bulletin, May 21.\nLumbermen have raised half for battle-\nfield Friday morning.\n\nThe amount subscribed was for supplies, a\nlarge portion of which went to North\nWest government accounts this season is\nsure.\n\nLumbermen have raised from their\nmillers Wednesday night with three rolls\nof lumber, one for Edmonton and two for\nBattlefield.\n\nA. A. Taylor returned from a six\nweeks' trip on Wednesday. He\nbrought back a large quantity of sandstone\nsuitable for building purposes.\n\nA. A. Taylor returned from a six\nweeks' trip on Wednesday. He\nbrought back a large quantity of sandstone\nsuitable for building purposes.\n\nLumbermen have raised from their\nmillers Wednesday night with three rolls\nof lumber, one for Edmonton and two for\nBattlefield.\n\nMEDICINE HAT.\n\nFrom the Times, June 2.\nThe Saskatchewan river has been very\nhigh this spring and the town has had to\nmake many repairs.\n\nThe new bridge over the river is now\nfinished and will be opened next week.\n\nLETHBRIDGE.\n\nFrom the News, June 1.\nThe river is now bank full and still rising.\n\nIt is understood that the mines will be\nclosed down for a short time soon to make\nsome repairs.\n\nThe police force was called out on Thursday\nafternoon to assist in removing the\ndamaged property.\n\nQuite a few stagecoaches are to be seen\naround the town lately, principally new\narrivals from the west.\n\nTown lots took a rise in price here on\nThursday last; the crops doubling the\nprice of last year's crops.\n\nThe raise we have been able to assure\nourselves, but it is doubtful due to the pro-\nposed new tax on mining charter for an\nextension of the road.\n\nThe new brick machine for Mr.\nDodd's brick yard was brought into\ntown last week by Mr. Mckee.\n\nMr. A. J. Scott, who has charge,\nis hard at work getting the yard in\nworking order, and expects to be able to\nturn out a superior product, yet, any, may be\nthis district.\n\nQU'APPELLE.\n\nFrom the Progress, June 2.\nAll the business places were closed\nduring the funeral of the late Judge\nMcLeod.\n\nGreat praise is being bestowed by\none remaining citizen upon those who\nare pursuing the murderers and house thieves\nwho stole the horses of Mr. Smith,\nhaving treated them so far unsuccessfully\nbeing, but sixteen hours behind them last\nevening.\n\nSarah McPheerson and Co. had\nbeen arrested from Prince Albert on Tuesday\nnight with warrants to apprehend the murderers\nof Mr. Smith, and they had obtained\ntwo Indians that were taken along at Crooked Lakes.\n\nThe murderer of Mr. Smith is said to be at\nFort Macleod.\n\nA. J. Scott, of St. Nicholas Church,\nLiverpool, England, organizing Secretary\nfor the Church of England in Canada,\nChristian Knowledge, is in town this\nweek.\n\nHe came out from England to\ntake part of his missionary\nwork among the Indians, settled in Medicine Hat.\n\nMr. Scott is the organizer of the com-\nmunity of the Anglican church with\na congregation of about thirty members.\n\nHe is very much pleased\nwith Qu'Appelle and the country round\nabout here.\n\nREGINA.\n\nFrom the Gazette, June 2.\nA Centenary celebration service, held\nat the Centenary Memorial Church,\nRegina, will be held on Sunday, June 28th.\n\nThe Bishop of Winnipeg, will preside.\n\nPORT MACLEOD.\n\nFrom the Gazette, May 31.\nSome of the men on the Milk river\ndetachment deserted last week, taking\ntheir horses with them.\n\nA small boat in the Belly River, crowded\nwith Indians, including Red Crow, upset\nwhile crossing on Saturday. None of\nthem were injured.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory\nto advertise your business in.\n\nSubscribe for The Times and get the latest news and\nhappenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY.\nPublisher and Proprietor.\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for\nsale a Half Million Feet of Dry Lumber, consist-\ning of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n“ “ Over 16 feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheap\nly as any firm in Town\n\nBuilders paying Cash or giving good security for\nLARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL.\n\nAn adjourned meeting of the Town Council took place in the Council Chamber on Wednesday last.\n\nPresent — Councillors Agnew, Bain, Bradenhorst and Stewart.\n\nMayor Macarthur in the chair.\n\nThe minutes of the last meeting were read and adopted.\n\nCOMMUNICATIONS.\n\nCommunications were received from D. H. Macdonald, M.F., in reply to a telegram from the Mayor in reference to disallowance; ordered to be filed. From C. McE. asking to be allowed to make alterations in certain registered buildings through his property. Referred to Board of Works.\n\nACCOUNTS.\n\nAn account from Mr. Cadman for dog tax was referred to Finance Committee.\n\nREPORTS.\n\nThe clerk submitted his report as at end of the financial year ending May 31st. Report adopted.\n\nOn motion, the Council resolved into committee of the whole to consider by law the possible location of future pavilions, restaurants and places of public resort. Councillor Agnew in the chair.\n\nAfter the by-law has been considered clauses relating to the common road and the chairman reported. The by-law was then read a second time and ordered to be signed, sealed and delivered.\n\nThe by-law comes into force on the 1st of July next.\n\nThe bill to regulate the licensing of livery stables, feed and exchanges stables, water carriers, draymen and omelet was read a first and second time.\n\nThe Council then adjourned.\n\nCOURT OF REVISION.\n\nThe final sitting of the Court of Revision for the town was held on Wednesday last, when the following appeals against the assessment were disposed of:\n\nJohn J. Taggart — Assessment too high and in proportion to similar lots in the vicinity. No appearance for appealing, the appeal was dismissed.\n\nJ. R. Smith — Assessment too high. Appeal dismissed.\n\nW. R. Ginn — Not owner of lots assessed to him. Appeal sustained.\n\nL. G. Smith — Lots assessed as vacant as assessed for income. Appeal dismissed.\n\nL. Clark — Appealed to have value of building assessed off the roll, as there was no building on the lot. Appeal dismissed.\n\nA. A. Davis — Assessment too high. Appeal dismissed.\n\nLe Clark — For Bradford Transport Co. — Appeal against assessment too high and in proportion to similar lots in the vicinity. No appearance for appealing, the appeal was dismissed.\n\nOwen R. Hughes — Appeal to have his name removed from assessment roll, instead Hughes as occupant. Sustained.\n\nOwen R. Hughes — Assessment too high. Sustained.\n\nThomas McKay — Assessment too high. Appeal dismissed.\n\nThomas McKay — Assessment too high. Appeal dismissed.\n\nJames Taylor — Assessment too high. Dismissed.\n\nThomas Taylor — Assessment too high, but appeal for reduction he did not attend. New assessment. Dismissed.\n\nW. R. Evans — Appeal to have roll No. 72 removed. The building and two acres of land comprising the third quarter acres were ordered to be placed on the roll at $100 per acre.\n\nJ. A. Stott — For Frederick Milne — Assessment too high. Appeal dismissed.\n\nW. J. Carter — Assessment too high. Appeal dismissed.\n\nWe are pleased to hear that Col. Spence, Returning Officer in the late election, has received information that the dispatch for replacing the lost ballot box will be sent out immediately, so that he will be in position to settle all accounts by the 1st of July.\n\nOne of the many tokens of trouble among the Indians, who reserves under the instructions, J. M. Ross, Indian Agent at this post, took a strong interest in the case, and found the Indians perfectly quiet, and the grounds entirely abandoned.\n\nCOMPARATIVE WORTH OF BAKING POWDERS.\n\nROYAL (Absolutely Pure).\n\nGRANT'S (Absolutely Pure).\n\nBURFORD'S, when fresh.\n\nHANFORD'S, when fresh.\n\nREDEMP'S.\n\nCHARM (Alum Powder).\n\nAMAZON (Alum Powder).\n\nCLEVELAND (Alum Powder).\n\nPIONEER (not Fractioned).\n\nCLAR.\n\nDR. PRICE'S\n\nSNOW FLAKE (not Alum).\n\nLEWIS'.\n\nPEARL (Andrews & Co.).\n\nHECKER'S\n\nGILLET'S\n\nANDREW'S & Co. \"Royal Baking Powder.\"\n\nBULK (Powder sold loose).\n\nBURFORD'S, when not fresh.\n\nREPORTS OF GOVERNMENT CHEMISTS.\n\nAs to Purity and Wholesomeness of the Royal Baking Powder.\n\n\"I have examined a package of Royal Baking Powder, purchased by myself in the market. I find it entirely free from any other substance than the purest flour and the purest alum. It is absolutely pure.\"\n\nDr. Price, Ph.D.\n\n\"I have examined a package of Royal Baking Powder, purchased by myself in the market. I find it entirely free from any other substance than the purest flour and the purest alum. It is absolutely pure.\"\n\nDr. Lewis, Ph.D.\n\n\"I have examined a package of Royal Baking Powder. The materials of which it is composed are purest flour and purest alum. It is absolutely pure.\"\n\nDr. Gillett, Ph.D.\n\n\"The Royal Baking Powder tested by chemical analysis and experiments made by Prof. Scholler, shows that it contains no other substance than purest flour and purest alum. The result of such calculation, the result being as indicated. This practical test for purity by chemical analysis shows that Royal Baking Powder is absolutely pure.\"\n\nNo other article of common food has ever approached such high standard and unimpeachable purity as the Royal Baking Powder. It is absolutely pure, and will be found by all who use it to be the best and most economical of its kind.\n\nNote — The above diagram illustrates the comparative worth of various Baking Powders, as shown by Chemical Analysis and experiments made by Prof. Scholler. The Royal Baking Powder stands alone, and is the only one that can be said to be absolutely pure. All other powders, no matter how high their strength, are to be avoided as dangerous.\n\nREAD THESE PRICES!\n\nBarbed Fencing Wire, $10.50 per 100 lbs.,\nTar Paper, 6 \" \"\nShot, - 10c lb.\nMilk Pans, - $2 per doz\nMilk Pails, - 50c each\nStrainer Pails, - $1\n\nA large stock of Groceries and Hardware\n\nJUST NOW ARRIVING.\n\nJ. R. McPhail.\n\n1879.\n\nBuffalo Hall!\n\nNEW GOODS ARE BEING OPENED EACH WEEK.\n\nAlways on hand Fresh Lines in\n\nDry Goods, Clothing and Groceries\n\nPrices will be found right and nothing but reliable goods shown.\n\nBUFFALO HALL FOR\n\nDress Goods, Corsets, Hoseyery, etc., Ready-made Clothing\n\nBETTS & GWYNNE.\n\nDress Goods, all shades\nIrish Diaper Linen,\nIndia Linen, Muslins,\nNuns' Veiling,\nSilk Gloves, Cottons,\nGinghams, Prints,\nWincies, Ladies Jerseys\nBoys' Jersey Suits,\nReady-made Clothing,\n\nFROM FOUR YEARS UP—AT\n\nR. C. Wigmore & Co's.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887061701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5233, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10923, 2], [10923, 15264, 3], [15264, 21567, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]