[{"id": "006e0771389d167141bd0f5b30fefffa96097955", "text": "THE PRINCE ALBERT TIMES\nWEDNESDAY, FEBRUARY 28, 1863\n\nJUMPING OF CLAIMS\nFrom time to time we have been compelled from those whose claims have been jumped, and in the great majority of cases these complaints are not without good reason. For the longest settler, the man who has held on to his claim in speculations, there is probably no such thing as being put to the actual settler who has fulfilled all the conditions—least in spirit if not to the letter—it is indeed, a great hardship. He should have an opportunity to show that he can be afforded him against the greed of the professional claim jumper, who, if not always a speculator himself, is often the paid agent of speculators.\n\nAgainst the claim, the professional claim jumper does not care ought to have every measure of protection, and affidavits filed for the purposes of cancellation should be very cautiously received and suspicion aroused. It is indeed a dismal affair hoping that a settler's services for some months during the year are really not necessary on his claim, and in consequence he may seek other employment, to find, perhaps, in his absence another claim jumper has stepped in, filed the necessary affidavit and taken possession, and this, too, after the bona fide settler has expended his all in breaking up the land and making improvements. There is also the case that he has no means left where-with to contest the claim that has been so unfairly and unjustly set up.\n\nIn such a case he has not only been robbed of the use of his land but the profits of the fruits of his labors and what he looked hopefully toward as his future home as well. There should be some better means devised, and the only thing that can protect the settler against the most professional claim jumper. No inducement or inducements can become time or other he may meet with reverses and know of those who are treated so unfairly under similar circumstances. The Brandon Star speaks of a protective society being formed in the interests of the settler, and says of it that \"it will protect honest settlers against dishonest men, and it will extinguish bogus settlers to the advantage of the honest man.\"\n\nLAND PATENTS.\nIt is understood that the Dominion Government has in contemplation a measure for the shortening of the process for obtaining land patents in the North West. This is just what was needed. The Government hasn't treated us so well in the matter of land patents. What ever kind of process it has been hitherto could not by any means be considered anything but a lengthy one. In fact the first patents that have been issued for the North report has special reference to the West came to hands only by the last mail, and then only some few dozens in number. The small number is not satisfactory so far as it goes, has not been obtained only after endless applications. The public will be glad an abundant supply of land is now at hand, and the Government is willing to go to the necessity of as to render it a possible thing doing, and thus the new measure as a result has promised a measure for shortening the process. We trust, sincerely, that the Government will do something more than contemplate the measure; that it will put it into operation as early as day is a consummation devoutly to be wished. And if the Government is in a mood for contemplating measures it might turn its attention to the consideration of one for shortening the process of shoveling our mail matter. We doubt, when the present system is continued, there will be any attempt made to lay before the Government our wants and necessities the matter of a weekly mail will not be the least item in the bill of general Government expenses. We believe the Government has not treated us as well in the matter of land matters, in fact our fair and just demands have been treated in a most cavalier fashion. We would strongly urge upon the Government to now carry out its good resolutions and put an end to this unsatisfactory state of things and under which we in the North West have been so long laboring. The Government may not be able to immediately bring to congress and advancement of the country by the dilatory policy it has been pursuing. We will continue to urge that justice be done as until the Government can in decency no longer delay granting us our wishes.\n\nEDITORIAL NOTES.\nThe Western News has given us the information that Lord Carnarvon will be appointed Governor General of Canada and will succeed Lord Lorne.\n\nReturns received of the number of immigrants who settled in Canada during 1862 show that during the year ended 31st September, 1862, 478 persons arrived in Canada, of whom 25,735 went to the United States and 95,650 remained in the Dominion.\n\nIt is said that the Canada Pacific Railway directors have disposed of a large part of their new stock of iron road to a syndicate of New York, L. N. D., Paris and Amsterdam capitalists, in equal proportions, at a price of $10 per ton of bar value. This gives about $8,000,000 worth of material for carrying the railway from Calgary over the Rockies into British Columbia.\n\nThe Canadian Pacific Railway Company has just completed the purchase in England of fifty thousand tons of steel rails, to be used on the section of the road between Calgary and Kamloops. This section, which will include the Rocky Mountain passes, is upwards of six hundred miles in length, and must be completed in two years from the first of May next. The company has been engaged Messrs. Lindsay, Sheppard & Co., who already have a large amount of work under contract for the same company.\n\nThe best Beer and Cigars\nOf the finest brands always on hand.\nWholesale and Retail.\n\nJAMES SCOTT,\nGABLE HOUSE,\nPRINCE ALBERT,\nN.W.T.\n\nFoot, Shoes, Mocassins\nUnderclothing, Shirts,\nDry Goods, etc. etc.,\n\nTHOMAS O. DAVIS,\nCARD G. D. NORTHGAVES,\nWATCHMAKER AND JEWELLER,\n\nA LARGE STOCK OF\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND\nWatches, Clocks, Jewellery, Stationery.\n\nR. B. WAY,\nPotatoes.\n\nPotatoes.\n\nTAYLOR AND BARBER\nCall on Scotty, the Tailor, for Your Clothes.\nFitted Guaranteed.\nCutting a Specialty.\nHair Cutting and Shaving.\n\nJAMES SCOTT,\nGABLE HOUSE,\nN.W.T.\nTRY HUGH MCDougall's BREAD!\n\nJ. R. McPhail\nHardware,\nBox and Parlor\nStoves\nPaints & Oils,\nRope,\nGlass.\nBroad and Chopping Axes.\nCross Cut Saws.\nPowder, Shot & Caps.\nGranite Iron Ware.\n\nHugh M'Dougall\nEast End Bakery.\n\nTO THE LADIES\n\nMillinery and Ladies Furnishings\n\nSTOBART, EDEN & CO.,\nGeneral Merchants\nAND\nIndian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nRIDGE STORE.\n\nJohn E. Sinclair\n\nDry Goods,\nGroceries,\nETC., ETC.\n\nImportant to Farmers.\n\nThe undersigned have purchased the Engine and Threshing Machine,\nlately owned by Mr. McPhail.\n\nApply to\nD. L. SHANNON or W. JOHNSON\n\nN.B. Messrs. Shannon & Johnson will make another first-class engine and thresher to run next season in connection with the newly purchased land.\n\nCHESTER THOMPSON, PRINCE ALBERT, N.W.T.\n\nALARGESTOCK MEDICAL HALL,\nCONSISTING OF\nDrugs, Chemicals,\nDye Stuffis, Spices,\nDruggists' Sundries,\nPerfumery, Sponges,\nToilet Soaps, etc., etc.,\nAND ARE NOW OPENED OUT.\nALSO ON HAND A GOOD SUPPLY OF\nPatent Medicines,\nINCLUDING\nFellow's Syrup,\nSt. Jacob's Oil,\nElectric Oil,\nPain Destroyer,\nBlack Oil,\nBurdock Blood Bitters,\nVegetable Discovery,\nCod Liver Oil Emulsion,\nMedical Discovery,\nAugust Flower,\nEtc., Etc.\n\nJobbers supplied on reasonable terms.\nSpecial discounts on large orders.\nPhysicians prescriptions and family recipes carefully prepared.\n\nTERMS--CASH.\n\nT. E. JACKSON,\nIn our New Premises, next door east of Farmers' Home and north of Old Presbyterian Church.\n\nHUDSON'S BAY CO.'Y.\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Prairie Belt, and now offer for sale 500,000 acres already surveyed by the Government of Canada.\n\nALSO\nTOWN LOTS\nFOR SALE\nIn Winnipeg, West Lynn, East Portage, Portage la Prairie and Bochum, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. PRYDOES, Land Commissioner\n\nBLACKSMITHING\nFarmers' Restaurant.\nHorseshoeing.\nCarriage Repairing &\nSleigh Ironing.\n\nChester Thompson, PRINCE ALBERT, N.W.T.\n\nR. J. O'LEARY.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883022801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 2103, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6160, 2], [6160, 8292, 3], [8292, 8292, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]