[{"id": "154369f3dae188c1786761513cbcc3b03e14a4d2", "text": "THE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW\n\nPUBLISHED BY\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nFRIDAY, SEPTEMBER 24, 1886.\n\nTHE GLOBE ON MR. DEWEY'S\n\nThe Globe of August 20th says—\n\n\"Mr. Dewey has been visited by his proposals by nearly everybody with whom he spoke, who, said he, would, if elected, be able to settle the question by means of his contracting friends.\"\n\nAnd when the temperature is about 75°, and the wind is blowing from the southeast, the odds are that Mr. Dewey will repeat his broadcast charges. We do not know how much of this money will find its way into this district, but certainly it will be very popular, so the water is being approached and the stream is badly needed by many.\n\nOUR ANNUAL EXHIBITION\n\nWe are very happy to announce that our annual exhibition will take place at our usual time next Fall (November 3rd), and we are sure it will be a success.\n\nThe Exhibition Committee have already begun their preparations and they have displayed in securing the necessary funds to offer suitable prizes. What they have done emerges now, however, and we are sure that their efforts will be rewarded. The Exhibition Committee has been working hard to secure funds and we are very pleased to say that they have been very successful.\n\nWAR CLAMS\n\nFrom our despatches it will be seen that the clamor for the balance of the war claims has been answered by the first Commission appointed by the Government. We do not know how much of this money will find its way into this district, but certainly it will be very popular, so the water is being approached and the stream is badly needed by many.\n\nTHE SASKATCHEWAN\n\nThe Battlefield Herald says today—\n\n\"An interception of the irrigation canal by the breaking through of the new channel of the Saskatchewan at the Cut Bank should be prevented by vigorous prosecution of the proposed improvements on both sides.\"\n\nA correspondent of the paper says—\n\n\"It is said that the river could be easily kept in its channel by driving piles in the river bed, thus raising the level of the water and forming an embankment that would contain the water and keep it within proper limits. Also, the banks would need to be raised so that the river would not be able to encroach upon the lands of the neighboring farmers.\"\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\n\nPAYABLE STRICTLY IN ADVANCE.\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and Special Departments of Local Interest to the Home Circle No effort will be wanting to make our Weekly a welcome visitor every where.\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\n\nPAYABLE STRICTLY IN ADVANCE.\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and Special Departments of Local Interest to the Home Circle No effort will be wanting to make our Weekly a welcome visitor every where.\n\nTHE MANITOBASUN,\n\n19 Market St., E.,\nWinnipeg, Man.\n\nN. B.—The Tailoring Department will be superintended by Mr. Robson.\n\nM. W. STEWART,\n\nAttorney for Philadelphians.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN. B.—The Tailoring Department will be superintended by Mr. Robson.\nA Masonic Poem.\n\nThe Level and the Square.\n\nWe meet upon the Level and we meet upon\nthe Square.\n\nThe words of prayers meaning those\nwords Masons are.\n\nWe meet upon the Level and we meet upon\nthe Square.\n\nWe meet upon the Level though every man\nis brought.\n\nThe Master's word is law, the Master's word\nis law.\n\nWe walk upright in Virtue's way and lead\nno other hand.\n\nAnd when we meet we are as one, as one,\nwe enter the conquered door.\n\nWe stand upon the Pinnacle as our Master's\ngreat command.\n\nWe walk upright in Virtue's way and lead\nno other hand.\n\nAnd when we meet we are as one, as one,\nwe enter the conquered door.\n\nWe meet upon the Square for the world\nis round.\n\nWe mingle with the multitude, but keep\nour secret work.\n\nFor though our meetings in mystery are\ngreat,\n\nAnd though we meet the Lord to raise the\nhappy scene.\n\nThere's a word where all are equal, we\nmust not talk fast.\n\nWe shall meet upon the Level there when\nthe time is come.\n\nWe shall stand before the Tribunal, and our\nMaster will be there.\n\nThen we shall have three lives to prove\nwith God's answering Square.\n\nWe'll meet upon the Level there, but never\nmore.\n\nThere's a common height and gloriousness\nfor the Master.\n\nThere's an everlasting welcome for the best\nbelieving there.\n\nWhat a joy to meet the Lord and been tried\nupon the Square.\n\nLet us meet upon the Level then, with\nbrotherly love and cheer.\n\nSo you're kicking about your village paper being so dry, are you? We'd\nrather see it blame for less.\n\nCan you think of anything more important happening\nthis week that was not in the paper? No,\nyou don't know as you can, but then it\nis my paper, and I'm going to tell you\nsoons. That is the editor's business, he\ngets paid for it. Ha! ha! ha! That's\none good one, isn't it? You can't say\nthat about your paper, can you? Can't\nget over it, can you? Good joke on the\neditor. Guess he'll be careful next\ntime he goes out with you in future. But say, friend,\ndon't you ever stop to think that the village\npaper is only a weekly affair, and that\nyou will let it be? You buy a new\nhouse and put up a house, and see how quickly\nthe paper will go down the drain, and\nif you knew how to fix things up, you\nwould be good at it. Buy a lot on Third\nstreet and put up a three story brick\nblock with glass fronts on the ground floor,\noffice, residence, on the second and third\nfloors. If you could do that, the village\npaper will tell the world what a ter-\nrific man you are, and how far\nseeing you are to put your money\nwhere your mouth is. Being a big\nterror, but prove a grand ornament to the\ntown, and set the Legislature or Con-\ngress, and see if they don't come and\ntell the people all it knows about you.\nHas your great grandmother used to\nsell milk? Has your great grandmother\never been a rag-picker, and how many of your rel-\natives have been hanged or sent to Congress?\nIf so, you may plant your paper in the\njunkyard and forget it. But say, friend,\nare you seeking honors, and that\nthe people will vote to elect you to sit\nin the house of Assembly? Buy a\nplay 100, and see if the paper don't call\nyou a public spirited philanthropist, who\nwill help the poor and needy? You\nwill do his fellowmen most good. Yes,\nthe village is just what you make it, and\nif you don't make it, why help it least.\n\n—Dundas N.Y. Herald.\n\nThe Hudson Bay Railroad schedule is\nstill somewhat in doubt. High Sather\nlastly stated telegram was that he was\nshipping rails on Saturday and that work\nwould begin on Monday, he making the\nfollowing day.\n\nTERRITORIAL NEWS.\n\nThe Lethbridge News says:\n\nA rumor is current in town that a\nparty of six Indians who left the reserve\non Tuesday last, have gone on a\nhunting expedition, left in search\nof game. With whom they had a\nparty of Crows with whom they had a\nfriendly intercourse. The Indians\nwere superior hunters of the Crows and\ncame upon and returned to camp. An\nIndian party of seventy-five which left\nhere some days ago, has not been heard\nfrom, and it is feared they have\nbeen annihilated. We understand\nCrows have been seen near the reserve,\nwhich will be the latter part of this\nweek, a party of 200 still leaving\nbehind. We give this information\nas a man just in from the Blood camp\nand says it is worth, as we are\nunable at the present writing to find out\nanything more reliable.\n\nThe Calgary Tribune says:\n\nMr. Robert Thomson, Mr. Moses, S. A.\nSmith and R. L. Baker were engaged\nputting up hay in one of the township\nfields of this place this morning. A lynx\ncrossing the road in front of them was\nworking. Seeing his rile Mr. Smith\nstarted to pursue. Seeing him advance\nthe lynx started to run, stopping in\nthe grass as if to hiding. He drew\nnearer to the animal it crouched lower\nto the ground, raising his head and\npaws and only its tawny tail was vis-\nible above the grass. When about 15\nfeet away the lynx raised his rile and\nran about 30 feet away. Mr. Smith\nsaid, \"I'll bet you a V you dare not take\na step from your shoulder and walk up\nto the animal.\" Mr. Smith then stepped\nback, and lowering the rile he stepped\nup to the animal. With within a few\nfeet of the animal Mr. Smith fired a\nlightning bound, setting its jaws firmly\nby into his shoulder, and endeavoring\nto pull it off. Mr. Smith dropped his rile\nhe seized it by the neck with\nboth hands and succeeded in holding\nits head down, raising it at a considerable\ndistance from its body. The animal\nstruggled violently, but Mr. Smith\nmaintained his hold until the animal\nwas killed.\n\nNotice.\n\nA SALE OF CAST HORSES\n\nBelonging to the N.W.M.P., will take place at Qu'Appelle Station, ON Friday, the 15th of October Next.\n\nBy Order,\n\nW. BURTON DEANE\nSuperintendent and Adjutant.\nSept. 8th, 1886.\n\n\"BEETLE\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nCalomimian and Paperhang-\ning on short notice.\nDecorative Painting a Specialty.\n\nNOTICE.\n\nMATRIMONIAL AGENCY.\n\nEstablished to supply suitable husbands and wives to respectable young women who are willing to com-\nbine their interests and make a home together.\n\nApplications will be received from the agricultural districts of England, Ireland, Scotland, and Canada, as well as the Conti-\nnent of Europe.\n\nApplicants should state their particular requirements and preferences, also giving Postal Order for Two Shillings to cover preliminary expenses.\n\nJENSEN & CO.\nStation Road, Flintridge, London, England.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.\n\nNewspaper Advertising Bureau,\nSecond Ave. for 100 yrs. Pamphlet.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES FOR\n\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelling,\nDress Goods,\nSilks,\nLinen, etc.,\nGO TO\n\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consist-\ning of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 15 feet extra\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap\nas any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTELEGRAFIC.\n\nTHE VERY LATEST NEWS BY WIRE.\n\n(By Special Telegraph.)\n\nWinnipeg, Sept. 29.—A dispatch from Wood Mountain this morning says a party of half breeds just arrived from Fort Belcourt has been killed in a fight between Gros Ventres and Piegans Indians, immediately south of the line. It appears that a number of extra police had been going on guard there some time. Parties from each tribe met in the neighborhood of the line on Saturday, when a fight of two hours duration ensued. Six Piegans were killed, the victims being cut down from three places. It is feared further trouble will be the result.\n\nJames Morrison, of Ogema, consulted a doctor who said a gunshot wound.\n\nHouse meet at Winnipeg took place this week. A large number of outside house have been opened.\n\nP. R. Pringle, of this city, has been offered the Conservative nomination for the local house.\n\nAn order by council approved on Sat. under No. 1 Canada Order, amending previous resolution extending the close season for whitefish in Massey Lake and the North West River, from October 1st to November 16th in each year; both days inclusive; for pickerel from April 1st to May 31st; for trout from September 1st to October 1st to January 1st; and for sturgeon from May 1st to June 1st.\n\nMayor Piggott in going to England to attend the Imperial Exhibition the Regina and Long Lake Railroad.\n\nIt was announced at the department of the North West that the four forts now being built down from the North West as a sample to be forwarded to the country, Col. Macdonald having again stated they are best adapted for military purposes in Hudson Bay.\n\nThe Globe's Ottawa correspondent says it seems to be arranged that Judge Brooks, ex-M.P.P. for Stanhope, will be appointed Lieutenant Governor of the North West in place of Lord Dufferin, who will probably be appointed Governor of British Columbia.\n\nThe fight between John L. Sullivan and Herold of Philadelphia, was stopped by the police on the second round on Saturday. Sullivan won by a unanimous decision.\n\nThe fight between John L. Sullivan and Herold of Philadelphia, was stopped by the police on the third round on Saturday. Sullivan won by a unanimous decision.\n\nSerious rioting occurred in Belfast yesterday. The police firing on the mobs, wounding several persons killing three.\n\nThe new Lord Lieutenant arrived in Dublin on Saturday. He was received with cheers and groans.\n\nThe Lord Mayor of London sent a letter to the Lord Mayor of London, suggesting an exhibition of the Queen's garden at the Crystal Palace. The proposal was made at the London and Indian Exhibition on the basis of the present exhibition, with the promotion of emigration and the expansion of commerce.\n\nHanlon said for England on Saturday.\n\nIn the race on Saturday Beach immediately got a straight lead, pulling thirty-six seconds to the minute to Thunberg's thirty-five and a quarter. Beach was then killed by the third of a length. Beach spotted at the half mile tree, met by half a length. Beach won by three lengths ahead of Thunberg. Beach was three lengths behind the leading horse.\n\nThunberg's time was 5:56 and Gardner's time 9:02.\n\nAt Bathie Gardens began to decrease his appearance. Beach appeared to be only half a length behind. By the time Thunberg Croft was reached Thunberg was held a short distance behind. Thunberg was still slightly in lead. Beach then stopped racing and Thunberg gained back a lead of two lengths.\n\nAt Harrow Bridge Beach appeared to be going for the front, won by four lengths. Beach's time was eighteen minutes and twenty seconds. Beach was fearfully hard race throughout. The weather was clear and cold.\n\nWinnipeg, Sept. 29.—On Thursday, the 18th of November, has been appointed Thanksgiving Day.\n\nWith few exceptions the claims of various parties concerned in the recent rebellion and others entitled to land grants have been adjusted. The delay in settling the claims of the latter is owing to the difficulty in getting records names of those entitled to bounty.\n\nThe Agricultural Society has completed buying electricity at a cost of several hundred dollars for war losses incurred by the members of the society. The first half to be used will be located at the Royal Agricultural Hall.\n\nThe Ontario Provincial Exhibition opened in Toronto yesterday.\n\nThe Liberal government has been re-elected. The \"Black Watch\" regiment was sworn.\n\nThe Imperial Parliament will be presided over by Mr. Disraeli, who has been elected Speaker.\n\nA cabbler was arrested from London for selling newspapers.\n\nA statement was made by the Board of Trade, saying that the government was unable to pay its bills.\n\nIn this emergency the local government was applied to be realized. The government was unable to pay its debts.\n\nDelegates from the Irish Land and Presbyterian Unions will make a visit to Winnipeg.\n\nTOWN COUNCIL.\n\nThe Council met on Monday evening, consisting of Messrs. Kelly, Reid, Carter, Richardson, Goddard and Brown.\n\nThe minutes of the last meeting were read and adopted.\n\nCorrespondence—Minutes of the last meeting were received from Mr. C. M. Brown.\n\nBooks, Stationery, Fancy Goods, Toys, Musical Instruments, WALL PAPER & Borders\n\nThe Latest Books and Papers ALWAYS ON HAND.\n\nPOST OFFICE BOOKSTORE.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAT T. N. Campbell's New Store,\n\nALARGE STOCK OF:\n\nWATCHES, CLOCKS AND JEWELLERY\n\nKEEP CONSTANTLY ON HAND\n\nRepairs Promptly Attended To\n\nTO THE LADIES.\n\nNEW GOODS\n\nMISS MACK & CO\n\nFirst Door East Telegraph Office.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nBuffalo Hall!\n\nMaking Room for Fall Stock.\n\nDry Goods and Clothing Sold at Heavy Discounts.\n\nGroceries Reduced.\n\nNo Reserve.\n\nBEETTS & Gwynne\n\nAT\n\nLowest Prices,\n\nBuilding Hardware, Locks, Hinges, Glass, Putty, Paints and Oil, POWDER, SHOT AND LOADED SHELLS.\n\nN. B.—A large Supply best American Coaloil\n\nAT\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\n\nSideboards, Cupboards, Bureaus,\n\nWashstands, Sofas, Easy Chairs,\n\nBedsteads, Mattresses, Cots, Cradles,\n\nAnd all kinds of Chairs, Etc., which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSaloon Room, First Door West of Bank.\n\nW. B. GOODFELLOW.\n\nBUY YOUR HARDWARE\n\nAND GENERAL SUPPLIES\n\nFROM\n\nJ. R. McPhail,\n\nHEADQUARTERS FOR\n\nCooking Stoves,\n\nBox and Parlor Stoves\n\nAMMUNITION AND SPORTING GOODS!\n\nLow Prices and Good Value.\n\nJ. R. McPhail.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886092401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 4420, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3655, 2], [3655, 11049, 3], [11049, 17582, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]