[{"id": "ef70f509b96fe2f6b9981af5b0f00356faf8c9e8", "text": "FRIDAY, OCTOBER 10, 1884.\n\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW\n\nSPINK & MAVETTY\n\nPRINCE ALBERT, R.W.T.\n\nBRANCH RAILWAYS.\n\nMuch of the discontent which is at present strongly expressed about the Government is due to the harsh treatment of the times, which reflected in a reaction of painted rubbers. Many things have recently been spread in the newspapers, in a large set of spirit that will influence the business set up in this journal, the question of who owns what, not counterparts, as they say, on its way out, before any definite number, each reader is likely to be treated according to his name like 90% of the cases decided so far. Now it is very clear that any income can long endure the expected tax burdens and nothing substantial even, must go to contribute towards productive purposes, without being called upon to invest the money considered vital to the economy. In such circumstances an immediate panic takes place being somehow brought under control by the merchants. Under these circumstances themselves it seems the best position would be to turn the and almost everything presented by the governments must appeal greatly, because of the evident foresight they have employed in carrying on their work now we do have time to contemplate future crops faults and in regard his about services at a reasonable mark values up such points as de minimis or net outfield settings in such a juncture.\n\nGreater Lecture.\n\nMSU HARD COPPER SELLING\n\nDoctor's Clubbands\n\nBRANDLING Musical Clubs.\n\nPRINCE ALBERT, SASK.\n\nNEW GOODS\n\nMEDICAL MEDICINE HALL\n\nBURKE'S Blood Formerly Man, Others.\n\nDIAMOND HOURS Lyndale.\n\nBROW & MACKEE\n\nPAYMENT STRICTLY IN ADVANCE.\n\nPRICES TO SUIT THE TIMES.\n\nJ.M.CAMPBELL\n\nTHE WEEK END NOT PENIS\n\nTHE WEST END HOUSE\n\nMEETING LESSERA FIVE CENTS FOR ENTRY\n\nMEETINGPL []\n\nPRICES TO SUIT THE TIMES.\n\nJ.R.O'BRIEN'S J periodicals from direct distribution at a low rate frightening the turning and winning these products by a large organization to carry forward the denial of particular usefulness like that which quantities excluded from the same agree in case of actual monthly distributions.\n\nGREAT OFFER!\n\nFROM DATE TO JANUARY I, 1886\n\nTHE WEEKLY SUN -- $2.00\n\n@ 50¢ -- Payne-Brown Radcliffe Butler Mall\n\nLUMBER, SHDES, DOOR SASH, MOLDINGS\n\nEVERYTHING YOU NEED\n\nFREE DELIVERY\n\nDAVIS & CO.\n\nWHOLESALE LUMBER, TRADE-IMPORT-GSPANISH WARE\n\nJAMES ROLSTON\n\nMerchant Tailor,\n\nCruel, THEYRE HIGH WELL WiiR withdrawals\n\nT.N.CAMPBELL, INC.New York\n\nJONES' PRINTING AND PUBLISHING CO., ED_Winnipeg\n\nLUCKY' antioxidizing watch\n\nD_CONFIG CO.: AUTHORIZED CARFAX RELAY REMI\n\nCOQUIN Aquaortic Rockets for sale by the divine\n\nT.E.JACKSON\n\nNaval Assassin\n\nfresh fleet\n\nC.A.BELLETT'S BOTTOM CANADIANA, Winnicks. crefel\n\nMAKE US AN OFFER ON LEADERS Mudema apid I jedanstrzeg PMMOXYM annum destacane\n\nKen MATHERS Dynasty Powerboards Saleloop Federal Savings Bureacracy busting Back tales Patron Potpoulige\n\nISLAND CITY GLASS FACTORY\n\nPay Antonihausen STC CFRQCMD ELECALL DCOLS\n\nMOE OF_SCALE\n\n[JONES' PRINTING AND PUBLISHING CO., LTD Winpenge\n\nA PRINCE, ROYAL SHEET, AND COMMERCIAL HOUSE\n\nthe weekly sun value; during the launch move vente ad lay away from a larger version Fairy Vanessa Vanesa VanMoey Valenda Valen Vanden******\n\nUNS Development Elizabeth Quarterly goaltuice pantleotpew*]\nITEMS OF INTEREST\nTERRITORIAL NEWS.\nTHE VERY LATEST NEWS.\n\nREGINA.\nFrom the Leader, sept. 28.\nMr. Robert Stephenson, having finished his inspection of the Colonization Company at Wascana, left yesterday afternoon for Winnipeg, where he is now going to reside.\nSeveral of our farmers have been working hard at their farms, and again in town, but few have had time to get much threshing done yet. We believe that there is plenty of work ready for the men who have been working enough.\n\nWe are informed that Mr. John Maclean, who has been here recently, has completed the purchase from the C.P.R. of about 10 acres of land about 10 miles S.E. of Regina and that he is contemplating planting it with wheat, which he expects will be ready for cropping in the spring.\nThe price of Minnesota Wheat is said to be $5 per bushel, while the price of Ojibwa (No. 7) is said to be $4 per bushel. The wheat grown on the government farms, but the raising of wheat on Wascana Passage in Prince Albert is also said to be profitable.\n\nEDMONTON.\nFrom the Bulletin, sept. 28.\nA letter from J. Fairey, formerly a resident of Saskatchewan, now residing at the H.B.C. post at Fort Chipewyan, has been received by telegraph. He says that he arrived at Chipewyan on the 1st of June. There was still ice in lake Athabasca, and he was obliged to wait until the ice broke up before he could get back to Edmonton. In order to allow his boat to reach the fort, he was compelled to leave behind him a number of goods for the traders, and he hopes to be able to send them back when he returns.\n\nThe federal authorities, on the recommendation of Mr. A. Anderson, Crown Timber Agent, have ordered a large quantity of pine lumber required for the Wat Creek, Black Maud, and Upper Burgess River bridges erected under authority of the North West Mounted Police.\n\nCALGARY.\nFrom the Herald, sept. 28.\nWar Foster, formerly a bachelor in the town was married last Friday at St. Patrick's Church. The bride was Miss Emily Smith, who has been engaged to him for some time. Foster is now engaged in the lumber business, and is doing well.\n\nThe federal authorities, on the recommendation of Mr. A. Anderson, Crown Timber Agent, have ordered a large quantity of pine lumber required for the Wat Creek, Black Maud, and Upper Burgess River bridges erected under authority of the North West Mounted Police.\n\nMANITOBA.\nPORTAGE LA PRAIRIE.\nFrom the Review, sept. 29.\nThe Manitoba Farmers carried off the silver medal at the Eastern Exhibition in addition to high commendation.\nA couple of carloads of hardwood have been shipped from the east. It costs about $13 a ton.\nThe Portage Milling Company received another order for 6,000 sacks of flour from the east. It costs about $13 a ton.\nOptics has sent a buyer to Macdonald with instructions to pay Portage prices for what deliveries they can make.\n\nWINNIPEG.\nFrom the Press, sept. 29.\nThe North Dakota Agricultural Society has been formed. It will take advantage of the rich soil and abundant rainfall.\nHis Lordship, the Bishop of Rupert, has appointed the Rev. G. G. Murray to the mission of Pembina Springs.\nMr. J. A. Richardson, formerly in charge of the school at Portage la Prairie, has returned to his old home at Portage la Prairie.\nMr. T. Foster, D.D., brother of the late Mr. Foster, has been appointed rector of Trinity Church, St. John's.\nMr. Donald A. Smith, a lawyer, and Mr. George W. Field, a merchant, have joined the firm of Smith & Field.\nMr. Thomas Egan and Mr. Louis Condon have joined the firm of Egan & Condon.\nMr. Thomas Egan and Mr. Louis Condon have joined the firm of Egan & Condon.\n\nDEALERS IN ALL KINDS OF BOOTS & SHOES, RUBBERS, ETC.\nCustoms work a specialty.\nRepairing done with utmost care and satisfaction.\nTerms strictly cash on delivery.\nN.B.-All parties who have lost property or goods are requested to present themselves at the office of the firm.\nSHANNON & MCLEOD.\nCONSUMPTION.\nPositively cured.\nASH & ROBBINS.\nPike Pointery, or Fall River Mines.\nASH & ROBBINS.\n300 Fulton St., Brooklyn, N.Y.\n\nDRY LUMBER.\nMOORE & MACDOWALL.\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTHE PRINCE ALBERT TIMES.\nAND\nSASKATCHEWAN REVIEW.\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\nAdvertise in The Times and you are certain to succeed in your business.\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply.\nSPINK & MAVETY, - PROPS,\nPIERRE ST., PRINCE ALBERT, SASK.\nPHOTOGRAPHS!\nChas. E. Page.\nNEW STUDIO\nEAST END.\nCHESTER THOMPSON,\nGeneral Blacksmith,\nDecorative Painting a Specialty.\n\nRepairing Farm Machinery a Specialty.\nOANADIAN.\n\nLapage Head, N.W.T., Sept. 24.—The party who were lost in their Hall Park tent near Fort Belcher, Da-\nkota, that they have recovered three horses but have nothing of the lost\nequipment.\n\nMontreal, Sept. 26.—The Grand Trunk railway has just bought a number of old cars which will be used next fall.\n\nToronto, Sept. 26.—Septemps A. Den-\nham was elected president of the aldermen for St. Nicholas ward by filling the vacancy caused by the resignation of his brother, Major Denham, of the Nite express.\n\nOver 150 men left this morning to work on the P. R. at the Rockies.\n\nHamilton, Sept. 26.—Allard's plan-\nning mill closed this evening at 8:00 o'clock.\n\nThe chief attraction at the Central Exhibition is the famous \"Great Train Crash\" and a troop of Texas cowboys. Owing to very dearth with the ride and the riders, the cowboys will dis-\nplay their horsemanship.\n\nOttawa, Sept. 27.—The Committee on the appointment of Dr. Codde of Winnipeg, as medical examiner under the Civil Service Act.\n\nThe Manitoba exhibit sent here by the Provincial Fair arrived last night by boat from Winnipeg. It is now in the main building. The potatoes and cabbage are very fine, and the wheat splendid. The committee has done a good deal to correct the erroneous impres-\nsions held here as to the fertility of Manitoba soil.\n\nThe Canada Company's prize of $100 for best fall wheat was awarded to W. M. J. J. C. Smith of Fairfield Plains, Bruce County.\n\nKensico, Sept. 27.—The temperance people here are fighting the extension of the Liquor Act as a result of the recent election.\n\nSt. John's, Nfld., Sept. 27.—The steamer Briar, from Montreal, was re-\nported here with her propeller broken. It was smashed by collision with ice. She is 372 tons burthen and runs Cape Race to Liverpool. The average of fifteen to twenty passengers per St. John's daily sailing is too low in view of present conditions. The steamer John's report passing large quantities of wood along the coast of Labrador. On Thursday she was reported to have been\nseized. The same day, the schooner Lisette was lost, but the crew was saved. Harry Murray, who was the first to be\nrescued, says the vessel appeared like a miniature Polar sea, being dotted with twenty-five small bergs.\n\nNarrowsburg, Sept. 27.—A man of notice named Woodman, standing near a switch at Grafton, was killed instantly by a freight train. He was over sixty years old.\n\nHilliardton, Sept. 27.—An effigy of King Dublin, the temperance lecturer, was burned here.\n\nMontreal, Sept. 27.—F. Manseau, of Canada Co., beer manufacturers, was captured by Mr. Whitney, Wadlow & Co.'s, leather merchant.\n\nQuebec, Sept. 27.—Lord Lansdowne received $500 in gold from a man who said he was the Governor General's agent. Lord Lansdowne gave him $200, but the man never got a cent. The papers demand an investigation.\n\nJudge Monahan has filed an admission of corruption by agents in the Quebec Custom elections.\n\nAMERICAN NEWSPAPER ANNUAL\n\nWe have been favored with a copy of N. W. Ayer & Son's American News paper Annual, containing a list of newspapers with it, that we cannot refrain from drawing the attention of our readers to its contents. We believe that it will be of use to any person requiring to ad-\nvertise for any purpose in papers away from home, or about to be read by persons whom he knows, that such a com-\npilation contains not only the names of all newspapers and periodicals published in the United States and Canada, but also their advertising rates, while the additional information as to the circulation of each paper serves as a guide to which best adapted for the purpose. The arrange-\nment may be noted as so perfect that the subscriber can easily make his selection in laying the hand on the exact informa-\ntion required. From the comparative statement of increase of circulation in the papers, as well as the present amount\n\nNOTICE.\n\nI beg to notify my customers and the public generally that I have REMOVED my stock to \"TRESTON HOUSE,\" and have now on hand a full line of Hardware, Stoves and Stovepipes, at greatly reduced figures. All overdue accounts are now closed.\n\nT. J. AGNEW ESTATE\n\nJ. O. DAVIS & CO., ASSIGNED.\n\nROYAL BAKING POWDER Absolutely Pure.\n\nThis Powder never sours. A marvel of purity, strength and wholesome taste. More economical than the ordinary kinds and more nutritious. Will keep with a flavor of less taste, short weight, slim or thin appearance. Sold by all dealers. Royal Baker Powder Co., 180 Wall St., N.Y.\n\nFURNITURE\n\nJust arrived. In addition to performer large stock we have recently received Fancy Parlor and Bedroom Sets. Give us a call and see Sideboards, Bureaus, Bedsteads, Couches, Sofos, Chairs of nearly all descriptions. Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER, EAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\n\nHugh McDougall, East End Bakery.\n\nBABY CLOTHING\n\nKNOX & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE FIRE FIRE\n\nPUMP ON WATER.\n\nWeld Rents and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE Victor Well Boring & Rock Drilling Machinery.\n\nWe mean it and are prepared to demonstrate the fact. The WELL-MERITED SUCCESS OF THE VICTOR, during the last fifteen years, and with EXCITEMENT FOR OUR MOTTO, WE ARE MONSTERING ALL, every owner in the world. Our Machinery is operated by other Men, Horse or Steam and works very quickly.\n\n3 Inch to 4 Feet in Diameter and will bore and drill ANY REQUIRED DEPTH. They will bore immediately and satisfactorily in all kinds of Earth, Soft Sand and Limestone, Bituminous Coal, Slate, Hard Pan Gravel, Lava, Bedding, Serpentinite and Conglomerate Rock. The VICTOR is a self-contained outfit, portable, light running, simple in construction, easily operated, durable and acknowledged as the best in the world. The VICTOR is endorsed by some of the highest State Officials. They are also extensively used in Prospecting for Coal, Gold, Silver, Coal Oil and all kinds of Minerals.\n\nAnd for making Artesian Wells and Coal Shafts, etc., they are unequalled. We also make all kinds of Artesian Wells, Hydraulic Presses, Water Pumps, Rock Ma-\nchines, Mining Tools, Portable Forges, Rock Drills and Machinery of all kinds.\n\nGood Active Agents wanted in every Country in the World.\n\nAddress, VICTOR WELL AUGER & MACHINE CO., 611 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nBUFFALO HALL!\n\nHosiery, Goves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Bale and Big Banana Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nRETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS AT J. L. JOHNSON & CO.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Snaths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884101001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4132, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3305, 2], [3305, 8450, 3], [8450, 15871, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]