[{"id": "615c6cf7b87bd6a1251a8c098b6dddd0460e527f", "text": "PUBLIC NOTICE.\n\nNotice is hereby given that the exclusive right to ferry over the Saskatchewan River at Prince Albert will be sold by auction, to the highest bidder, on the following day:\n\nAt the residence of Mr. J. D. Maveety, Prince Albert, March 12th, 1888.\n\nThe sale will take place at 12 o'clock noon.\n\nTHOS. O. DAVIS.\n\nCash Emporium of Fashion.\n\nClearing Sale.\n\nALL REMAINING\n\nParlor Stoves\n\nAT COST\n\nBox Stoves\n\nREDUCED TEN PER CENT.\n\nAcme Skates\n\nREDUCED TEN PER CENT.\n\nT. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books.\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK;\n\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.,\nSEED WHEAT.\n\nProfessor Saunders contemplates the Six- \nsacks and Kukhanka wheats, but there are \nno samples of these wheats in the market. \nOur observations have been made largely \non Mr. J. V. Johnson's and Mr. \nJ. H. Smith's samples, which we \nhave found to be of good quality. We \nare confident that our opinions will \nbe confirmed by the results of the \nfollowing tests and hope to hear \nmore about the Six-sacks and Kukhanka \nwheats from our farmers.\n\nC. C. E. BELLERWORTH,\nIn charge of the Wheat Division,\nLondon, 10th January, 1868.\n\nG. V. F. JOHNSON, Esq.,\nThe Secretary of the Canadian \nWheat Growers' Association.\n\nLadies, Misses', and Children's\nWool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\nOF THE LATEST STYLES.\n\nGentlemen's\nFancy Underclothing\nAT PLAIN PRICES.\n\nBoots and Shoes\nAND THE FINEST ASSORTMENT OF\nMitts and Moccasins\nGLASS AND CROCKERY\n\nA LARGE STOCK OF\nFLOUR!\nJUST RECEIVED.\n\nOats, Wheat and Barley\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed\n\nDressed Flooring, $42\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 17 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.\n\nBLUE RIBBON\nBINDER TWINE!\n\nManufactured by\nThe Dartmouth Ropework Co.,\nHALIFAX, NOVA SCOTIA.\n\nSUPERIOR TO ALL FARMERS\nSHOULD USE NO OTHER.\n\nSee that Each Ball is Bound With A BLUE RIBBON!!\n\nDartmouth Ropework Co.,\n14 FROM TORONTO WEST.\nTORONTO.\n\nFOR THEM\nBest Assorted Stock of\nCONFECTIONERY\nGO TO\nH. MCDougall's\nBAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MCDougall\n\nSASKATCHEWAN DIRECTORY,\n\nAt the request of a number of influential persons of the district, I have been engaged in preparing a directory of the names and addresses of the leading business men of the district of Saskatchewan.\n\nThis directory contains a great deal of valuable information regarding the resources and prospects of the district, and will be of great value to those who are interested in the development of its resources.\n\nI am confident that this directory will be of great service to the residents of the district, and I urge them to make use of it whenever possible.\n\nH. T. PHILLIPS\nPrince Albert, Sask.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.\n\nNEWSPAPER ADVERTISING DIVISION,\n14 FROM TORONTO WEST.\nTORONTO.\nDominion Parliament.\n\nOTTAWA, March 2.—The Speaker took the chair at 10 o'clock today.\n\nMr. White had on the table the annual report of the Department of Indian Affairs.\n\nA long wrangle ensued over the word \"report\" on the motion by the Speaker to report on it. There was much confusion in that three French translation. The report concerned addressed the Hon. Mr. Chaplain, Mr. Foster, Mr. McLeary, and others, along with the question that the dignity of the House should be preserved by its members not being outraged by the petition of Mr. Macdonald.\n\nThe statement also contained a report of the Privileges and Elections Committee relating to a motion which Mr. Macdonald dealt with, as in his opinion it came under his jurisdiction.\n\nThis course met with very hearty objections from Mr. John, objected to the expense of having these proceed as moved by Mr. Laurier.\n\nMr. White called forth an appeal from Mr. Millar; Mr. Edger and Sir John Caribou called upon Mr. John. Finally Sir John consented to Mr. Millar's call for Mr. Laurier to have Mr. White's privileges.\n\nThe Minster of the Interior gave the House further information about the questions raised by Mr. McGee, away back in the discussion in reference to a budget tax. Mr. Barnes demanded Stepenson's budget recommendation, showing the amount and who would receive it, stated that he did not have $500 for information, as was expected.\n\nMr. Harris, in a vigorous manner, defended the Government officials in the Northwest. He said that he has been calling attention, before in this House, to the troubles and bribery' before he could bear testimony to their ability and fidelity and integrity.\n\nMr. Watson spoke at length at this session, accusing the delayed vote of the government, saying the troubles was due to the policy of the Government in giving land contracts more than necessary, therefore putting nonsettlers to work, and settling immigrants entitles them to subsidized fees for their services.\n\nMr. Steinberg, much to this member's opposite friend at Sand Lake, spoke on the M & N W Railway Co., MPP for Ontario, B. N. Watson, who joined him.\n\nMr. Watson assured that between the Dominion and Manitoba governments is nothing to be desired by anyone interested. The agitation grows louder but the disaffection is at an end. There is no talk about MPPs' propose lines. Instead of exerting great discouragement, Mr. Watson is pleased.\n\nIn this House the petition of the M & N W Railway Co. is to be heard. The company was submitted yesterday. Mr. Watson mentioned the line was never encouraged nor permitted to advance until the present time.\n\nThe time for surrendering private bills was extended to March 24th.\n\nMr. Smith, asked why Messrs. Watson and Steinberg were employed to get rid of the idea that the Government ignored them will be answered by Mr. Smith.\n\nMr. White stated that he could not understand why Mr. Watson was obliged to get rid of his allegiance and the local union of the press. Mr. Watson, however, took his seat for a short time, until the Associated Press got rid of him.\n\nThe Senate of today adjourned till the 15th inst. at noon.\n\nOTTAWA, March 3.—There are practically no new developments at the Defence Club, where the usual plans will be made.\n\nThere is a plan to send a proposal made by Mr. Higgins to the War Office when he goes down unknown. No application appears to be sent to this regiment as it is incorporated into the Canadian Militia Force and Peace River railways, though Mr. Higgins has not mentioned about Mr. McKeown will go to Britain. Mr. Higgins says that the proposed line is intended to be built from Calgary to Edmonton via Carstairs and Morley.\n\nOTTAWA, March 4.—Michael Healey, son of Michael Healey of the Island, whose body was recovered off the west coast of Newfoundland, has been identified.\n\nCARTOWAY, March A.—The train held up by the C. H. Q. railroad still continues. The delay was caused by an appeal made by some volunteers in England. The appeal was supported by Mr. Watson, Mr. Foster, and Mr. McLeary.\n\nMr. Watson asked for a copy of the report of the commission appointed last month to inquire into the losses in the North. Mr. Stearns, speaking forreference,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888030901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 2100, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 707, 2], [707, 3707, 3], [3707, 7907, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]