[{"id": "726d782ccba35cf52f90b8ae7b603f8da225ffaa", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\nTERMS.—Half per annum in advance.\nSingle copies, 10 cents.\nNo issue will go to press in this paper. Regular issue is Tuesday.\nTransient advertisements—half per line for first insertion, and so per line for all subsequent insertions.\nNo contracts made under three months.\nNo advertisement inserted for less than $1.\nAdvertisements containing instructions to be inserted must be paid.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETTY, Proprietor\n\nSUNDAY CHURCH SERVICES\nMr. Albert's Church—Sunday, 11 a.m., and 7 p.m.; Sunday School—12 noon; Mr. McKeay, charge; Assistant—G. McKay.\nMr. Macdonald's Church—Sunday, 11 a.m.; Rev. Canon Smith, charge; Assistant—Rev. Mr. Anderson.\nSt. Andrew's—11:30 a.m.—Rev. Dr. McKeay, charge; Assistant—Rev. Mr. Wright.\nSt. John's—1 p.m.—Rev. Dr. McKay, charge; Assistant—Rev. Mr. Wright.\nSt. Paul's—6:30 p.m.—Rev. Canon Smith, charge; Assistant—Rev. Mr. Anderson.\nSt. Paul's—3 p.m.—Rev. Canon Smith, charge; Assistant—Rev. Mr. Anderson.\n\nTHIS PAPER MAY BE FOUND AT THE FOLLOWING LOCATIONS:\nMr. Albert's Church—Rev. Mr. Horner, 10 Spruce Street, where advices to our subscribers may also be made for it in NEW YORK.\n\nFRIDAY, NOV. 8, 1888.\n\nMANITOBA RAILWAYS.\nAfter a hard fight Manitoba succeeded in ridding herself of the C.P.R. monopoly and secured the entrance of the Northern Pacific railway. Their troubles with the former road are not yet over, however, and come to an end. The Northern Pacific road is building branches to Portage la Prairie and Brandon and find it necessary, in order to reach those points, to run the C.P.R. line, permitting to do so. The line obtained from the Ottawa Government, but the Government did not see fit to grant the required permission, and referred the matter to the Supreme Court. Canada has an opinion as to the claims put forward by the Northern Pacific. The Government of Manitoba, in the meantime, undertook to force a crossing, but were met by a stronger force on the part of the C.P.R., which knocked very much the idea that it would be serious trouble if not blotted out of the dispute, but the N.P. and Manitoba Government backed down. As the point involved is a purely political one which must decide by the Courts, there is no reason why there should be any talk of raising armed force. The C.P.R. have rights which must be respected and if they are right in the matter referred to, the Northern Pacific will have to submit. If on the other hand they are wrong, the Courts will hesitate to say so and give the Northern Pacific the right of way across the lines of the other company.\n\nNo presidential election in recent years has admittedly been shrouded in so much uncertainty as that to be determined on Tuesday next. Ordinarily the great mass of the states can be determined with accuracy long before the ballots are counted, the only question being as to the figures of the plurality and the battle ground has been narrowed down to about four states, such as New York, Indiana, New Jersey and Connecticut. But while all these remain doubtful, this year the list of uncertain states has been enlarged by the addition of Michigan, Minnesota and Illinois, the Democratic professors more than a hope of carrying these hitherto Republican strongholds. The tariff issue is practically the only subject of debate this year, and, with the close influence of the cotton on the masses can hardly fail to lay basis of a more intelligent understanding. Up to this time the campaign has been somewhat tame, perhaps due in part to the continued success of Congress. The outlook is still that can be said is that it is full of uncertainty with the result hanging upon New York.\n\nThe advocates of commercial union and annexation met with another crushing defeat in the result of the recent by-election in Shefford, N.S. This constituency returned a great majority of candidates since Confederation until at the by-election held there in December last, when Gen. Laurie, Conservative, was elected by a majority of eight. At the election on the same alumnus, Gen. Laurie stood again unopposed by an increased majority, and, that notwithstanding the fact, the whole grit force was arrayed against him. The Wiman fight does not appear to be popular in Canada. A contemporary truly says that the election was a grand victory for Canadianism.\n\nActors Barlow, editor of the Winnipeg Call, and W. F. Laxton, editor of the Free Press, have been committed to stand their trial for libel. The charges against them were preferred by J. Martin, and T. Greenway, Attorneys-General and Solicitors-General of the Province of Manitoba. The suits will be tried at the assizes this month. We, of course, have no opinions as to the truth or falsity of the charges made against Messrs. Martin and Call and Free Press, we only state that the editors of both papers had reasonable grounds for believing in their utterances. We hope to see both journals pull through all right.\n\nWe understand that there are two or three criminal cases to come before the court at Battleford next week, but there is no matter of a criminal nature awaiting trial here. We have not had a criminal trial in Prince Albert since July, 1887; state of things which speaks well for the general morality of the settlement.\n\nMr. R. Ouellet has been appointed postmaster of all the northern trading posts of Messrs. Stobart & Co. We are pleased to congratulate Mr. Ouellet in his new position.\n\nWe have noticed in several of the Territorial papers an advertising column, for tenders for the carrying of the mail from Prince Albert to Fort Qu'Appelle, while there is no advertisement in the Prince Albert Times, the only paper within hundreds of miles of the settlement, which the mail passes. Kinistino is only forty miles from Prince Albert.\n\nVICTORIA\nLivery and Boarding Stables.\nBetween Johnson's and Campbell's Store.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of the travelling public to our stables, which are now in excellent condition.\n\nWell and river water almost at the door.\nWe have also added some fresh horses to our stable, and are prepared to give the public complete feeding as good a horse as can be found west of Winnipeg, at reasonable prices.\n\nBoarders taken at reasonable prices.\nOur stables are new, and not liable to breakage.\n\nNEILSON & McBEATH\n\nREMOVED REMOVED\n\nR. C. WIGMORE & CO.\nHave removed to their new premises,\n\nSECOND DOOR EAST OF OLD STAND\nWhere they will be pleased to meet their numerous new and old customers.\nClearing Sale still going on.\n\nR. C. WIGMORE & CO.\n1879.\n\nBuffalo Hall!\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\nNow in stock will be sold\nFOR TWO WEEKS ONLY\nAT COST FOR CASH.\nThe Public are invited to examine the Bargains.\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne\nT. N. Campbell\nSchool Books and Stationery,\nPublic and High School Text Books.\nSchool Requisites of every description.\nStephen's Blue Black Ink,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed Suitings,\nTrowsersing and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES.\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nPRIZE LIST\n\nThe annual exhibition of the Cariboo River District Agricultural Society was held at Kinbasket on the 27th of September. The display of animals and vegetables was most excellent, and the prizes awarded were very generous.\n\nThe following is a list of the PRIZES:\n\n1st Prize — John Anderson, Smithfield.\n2nd Prize — George Goodfellow, Entree City.\n3rd Prize — Thomas Robertson, New Westminster.\n\nThe following are the names of the winners:\n\n1st Prize — John Anderson, Smithfield.\n2nd Prize — George Goodfellow, Entree City.\n3rd Prize — Thomas Robertson, New Westminster.\n\nA Dead Drop!\n\nON PRICES\n\nAT J. M. CAMPBELL'S\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS Far surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nJ. M. CAMPBELL\n\nLUMBER\n\nMOORE & MACDOWALL (LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN, Sec.-Treas.\n\nAGENTS:\n\nP. G. GRAY, Edmonton, Alta.\n\nJ. FRASER TIMS, Fort Saskatchewan Alt.\n\nMahaffey & Clinkskill, Battleford, Sask.\nTOWN COUNCIL.\n\nThe Monday evening last Council, Mr. McPhail, Knowles, Davis and Agnew assembled at the Board House to decide what course to take.\n\nHis Worship stated that he was present, and Mr. McPhail was elected to occupy the chair magistrate seat.\n\nThere was quite a long assembly of citizens who presented them with letters in the sidewalk question.\n\nCOMMISSIONERS.\n\nThe clerk read a communication from H. W. Wilson, Esq., requesting a day license, which was granted.\n\nThe treasurer presented a budget which showed the town to be in good financial condition.\n\nThe council met for half an hour in order that the Fire Water and Light Company might present their report, which after a bit discussion the council resolved and the committee recommended the following commission: That the Inspector's report be printed and distributed to the public for his award therein; and at the same time that Mr. Moffatt shall be written report on same and that the Fire Water and Light Company be furnished a copy of the Inspector's report so that Moffatt may give his opinion thereon.\n\nThat Moffatt's account be $28.81, as follows: 100 feet plank, $27.81; lighting $1. And will recommend that the balance of the amount of the above account be paid to the said James Moffatt.\n\nThat Mr. Macmillan's report be accepted. Connaught and McPhail agreed that the tank be taken over and that the contractor be paid. Owing to the very unsatisfactory condition of the tank, Connaught moved and Davis seconded that the report of the Fire Water and Light Company be approved and paid until the next regular meeting. Yeas, Connaught, Davis and Stewart; nays, Connaught and Knowles.\n\nConnaught moved and Stewart seconded that the following be referred to the Board of Works: That the sum of $50 be paid to Mr. Moffatt for the work he has done on McKay Street where Mr. Connaught's residence is situated and that the Board of Works be instructed to carry out the planking and collect the balance of the sum for the cost thereof be taken from the surplus remaining to the Board of Works for another purpose. Carried.\n\nAn action by Connaught and seconded by Connaught. That an extra planking be laid from Mr. Leonard Jackson's to complete the work as a temporary work, was passed on the following division: Yeas, Agnew, Davis and Stewart; nays, Knowles and Connaught.\n\nConnaught moved and Davis seconded that the Fire Water and Light Company be paid $300 for the work they have done on the main bank by Moffatt, to report to them on the work in dispute as to whether the work was ordered by the Inspector or not, and that the committee report on the Inspector's report at the next regular meeting. Agreed to. Carried.\n\nConnaught moved and Davis seconded that the Board of Works be requested to pay Mr. Moffatt $50 each between River street and Front street, $50 from the surplus remaining from the main drain. Carried.\n\nThe Council then adjourned.\n\nCONSIDERED AS A FRAUD.\n\nThe Temperance Colonization Company has been condemned as a fraudulent concern by one of our most eminent jurists. The case was tried before Judge McPhail, in the case of the Temperance Colonization Company vs. Pinfield, holding that the company had induced subscribers to take up land by reason of misrepresentation when they said that they had obtained several millions of acres of land in the hands of the Canadian government, when as a matter of fact they had none. He held that the conduct of the company was such as to constitute fraud and deceit, and that the company had been made to distinctly understand, by the late Minister of Interior, that they would not have the privileges asked for. The judge ordered that the contract be set aside and that the defendant be ordered to refund the money he had paid with costs. This is a test case, and it is now in order for our newspapers to make known the facts and recover justice paid the company on the representations condemned in this judgment.\n\nPRINCE ALBERT PUBLIC SCHOOL.\n\nThe following promotions were made at the end of the term ending October 31:\n\nAll promotions are subject to regular attendance and being able to do the work.\n\nJUNIOR DEPARTMENT.\n\nStandard I — Miss Thompson, Bella Stewart, Bella McBeath, Willie Duffield, John Hart.\n\nStandard II — Miss Carley, Marian Agnew, Oram, Mary Goodfellow, Alice McGaggan, Fred. McLeod, Charley.\n\nSENIOR DEPARTMENT.\n\nStandard V to VI — Alfred Oram, Ed. Johnston, Henry Bower, Bertie Jardine, William McLeod, Bobby McTaggart.\n\nStandard VI to VII — Martha Thompson, Arthur Way, John McLeod, Eddie.\n\nThe annual school meeting will be held on Tuesday next, 6th inst., in the school house at 11 a.m. to receive the various reports and elect a trustee.\n\nTHE GOVERNMENT COMMISSION.\n\nThe following promotion was recently passed by the council of the municipality of Prince Albert.\n\nThat this council recommends the immediate construction and operation of the sale road; and further recommends that the Government of Canada withdraw its offer made by its predecessors in office, deprecating the sale road.\n\nThat the proposal of which led to their election, and that a copy of this resolution be forwarded to the Hon. Thomas G. Stirling, Provincial Secretary, and H. E. P. Prud'homme, Provincial Secretary, and to the Coll. and Free Press.\n\nGO TO AGNEW'S FOR Stoves Stoves Stoves Heating Drums Stovepipe Coal Oil T.J.AGNEW FOR THE Best Assorted Stock of CONFECTIONERY\n\nButchers\n\nBeef, Pork, Mutton, Sausage, Bacon, Ham and GAME IN SEASON.\n\nRUSSELL & DAVIS RIVER STREET.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER—HOP—ALE\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRARD\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Rowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York, Send 10¢ for 100-pp. Pamphlet.\n\nTHE WEEKLY CALL CANADIAN'S LARGEST PAPER.\n\nREDUCED TO $1 A YEAR!\n\nIn order to keep the circulation of THE WEEKLY CALL in place with the rush of events, and to make it even more than ever before, we have reduced the subscription price to the lowest rate ever offered.\n\nReduced from $2 to $1 a Year!\n\nNotwithstanding this great reduction, the high standards of THE WEEKLY CALL are maintained in every particular.\n\nWe offer paper persons as low and competent as can be found anywhere in the world. We are the best, and the best. Everything that can be said about the weekly call is true. It is the best paper in Canada.\n\nWe have a large stock of watches, clocks and jewellery.\n\nKEEP CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nTHE GREATEST DOLLAR'S WORTH OFFERED.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888110201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 3743, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7568, 2], [7568, 8703, 3], [8703, 15362, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]