[{"id": "0fa4493268bc899bbaf979c00fc04dfbcf0b2b7a", "text": "THE PRINCE ALBERT TIMES\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, AUGUST 22, 1884.\n\nTHE GREELY EXPEDITION\n\nThe first, main, and essential characteristic of civilization properly so-called is the increased value given by its methods and its results to the discovery made. The result of this observation of the nature of long seen prevailing customs of settling local disputes or feuds (e.g., those existing between the Highlanders and Lowlanders) has been that they do not appear to the latter as the only possible solution of the question. We cannot imagine that we can persuade the cause may be referred to that great mystery—the introduction of evil into the world for the same purpose, whereupon we should see, at the end of all the labors of human life, should provide such a highly increased tendency to destruction, some of the more convenient means being the implements of murder, which would constitute the part of evident genius in land and water. These reflections are not immediately suggested by a perusal of the humeral account of Mr. Greely's expedition, but the fact of its existence, and its apparent commercial benefit to humanity, must not only by deeply displayed, but also universally condemned by the world as a whole. There could be no doubt, however, that such a publication for such an expedition as has been sent by our government to explore the navigability of Hudson Bay and Strait, even were their aims not approached, produces loss of valuable time which is not the case, because upon the result of that depend the interests of the future, an enormous proportion of the human race, and it is desirable that every precaution be taken to save this great country from ever life to such a cause, but speaking under correction we do not believe that practical results will be found to justify the terrible sacrifices made in the attempt to discover the secrets of the Arctic region. We freely admit ignorance of science despatches the bulk of the general public from forming any exact judgment upon the relative importance of the subject in question; but if the advantages are such as will affect any appreciable proportion of humanity, then they can be explained, directed, or studied to advantage, sufficient clearly to understand into what manner they are obtained. We can all admire and sympathize with the spirit which prompted these efforts, until they had been already proved to the hopelessness of attainment, but until the results are shown to comprise something far beyond material for a few scientific essays on meteorological or similar subjects, we must heartily turn to the consideration of any experiment, which not only gain such vast sums of money, but worse still result in the horrible sufferings only ended by death of so many brave men as have perished in them. Had Lieutenant Greely brought home his men in safety, we can well believe the Americans could pass with patriotic feelings over the loss of some sixty geographic miles nearer the north pole than has been done by any other nation, but when they consider the sickness, details of what prisoners and deaths of their friends and fellow-countrymen involved in all the toils, difficulties, and hardships, full of determined courage to do or die, and then remember how few of themselves will take the trouble to read the reports, to consider the scientific results, the nation large will feel that the game has not been worth the candle, and sometime will have to chance before the past is sufficiently forgotten to encourage further waste of life in the same direction.\n\nABOUT THE TIMES.\n\nWritten for \"The Times.\"\n\nWhat was once written in Prince Albert newspaper is still there. The article itself is a tale of adventure, filled with suspense and excitement. It describes a journey through the wilderness, where the reader is taken on a thrilling ride through the untamed lands. The author captures the essence of the times, painting a vivid picture of the challenges faced by those who ventured into the unknown. This article is a testament to the spirit of exploration and discovery that permeated society during this era.\n\nTHE GABLE HOUSE.\n\nWatches, Clocks and Jewellery.\n\nR. H. BRATHOBER,\n\nMANUFACTURER OF ANDOBBALIAN Harness, Saddles, Bridles, Collars, Curry Combs, Brushes, Whips Etc.\n\nRepairing and Job Work promptly and neatly executed.\n\nNEW GOODS.\n\nMEDICAL HALL.\n\nDrug Store.\n\nFANCY GOODS.\n\nAtkinson's, Holbrook's, Lambin's and Lambourg's Perfumery.\n\nScott's Electric and Infants' Celluloid Hair Brush.\n\nRubber Comb.\n\nTooth Picks.\n\nBreast Pump, Feeding Bottle.\n\nGrae's Fruit Baths, etc.\n\nT. E. JACKSON,\n\nAT THE OLD STAND.\n\nWatches, Clocks, Jewellery, Stannery.\n\nR. B. WAY,\n\nPost Master, Prince Albert, N.W.T.\n\nTHE WEST END HOUSE.\n\nMeats at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY,\n\nEAST END BAKERY.\n\nBREAD unsurpassed by any ware of Winnipeg.\n\nNine loaves for $1.\n\nHugh McDougall, East End Bakery.\n\nPUBLIC NOTICE.\n\nAll persons are hereby required to take notice that the entire of lands on the west side of the town without authority from the Ministry of Public Works, are held by the agent of Dominion Land Surveyor for the United Kingdom of Great Britain and Ireland, who have been engaged in surveying the same, and who, in consequence thereof, have been instructed by the Minister of the Interior to proceed thereto.\n\nAny person who shall make, or cause to be made, any survey, subdivision or division of any part of the said land without authority from the Minister of Public Works, and who shall, after such survey, subdivision or division, make application therefor to the Dominion Land Surveyor, shall be deemed guilty of an offence punishable by fine or imprisonment, and in the event of conviction thereof, the offender shall be liable to pay a fine of $200.\n\nD. J. WAGNER,\n\nManager, Timber Agent.\n\nFURNITURE.\n\nJust arrived.\n\nFancy Parlor Bedroom Sets.\n\nSideboards, Burceaus, Bedsteads, Couches, Sofas.\n\nChairs of nearly all descriptions.\n\nCarpeted Chairs for the Ladies.\n\nMatresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\n\nKNOW & DABER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER.\n\nWells sunk and Pumps made and repaired.\n\nOrders from J. J. Johnson & Co. will be promptly attended to.\n\nNATHANIEL ACORN.\nNORTH WEST COUNCIL.\n\nMissouri, July 21, 1884.\nThe Council met at 2 p.m. His Honor Leslie Murray presiding.\n\nThe Hon. read a letter from the Secretary of Justice in reference to an amendment made by Mr. Scovell under Sec. B. of a Bill, stating that the matter would be considered at the next meeting of the Council.\n\nThe Solicitor General presented a report on \"Ordinance respecting Masters and Servants,\" with one exception, to-wit: an Amendment to Sec. 2 be amended and his objection raised in favor of Masters.\n\nMr. Rubel said he was sorry to hear from Mr. Oliver's opinion, and asked for opinions adverse to be received in favor of Masters unless he could get the required two members.\n\nReport agreed to.\n\nRESOLUTIONS INTRODUCED\n\nJudge Hindson—An Ordinance to increase compensation for Masters and servants.\n\nJudge McLuhan—An Ordinance for the Land Commissioner—No. 10 of 1872 for Judge McLuhan—The Municipal Licensing.\n\nMr. Macdowall moved the following resolution:\n\nThat the Council regret the ex- tenuations attributed to Mr. Burgess in a interview with a Gentleman, June 30th, 1879.\n\n2. In the absence of the Governor this Council desires to extend his Excellency the right of iviting on his case by Halberds of these Territories for matters in the nature of land grants.\n\n3. That the interests of the claimants submitted to the Executive Committee to be dealt with.\n\nIn moving this resolution, Mr. Olivers said he was aware Mr. Oliver intended introducing a similar resolution in the Legislative Assembly, but he had been instructed by Prince Albert; therefore, he had no right to introduce it.\n\nMr. Holmes objected, but the proposal was carried by a large majority.\n\nMr. Oliver moved that the Ordinance be referred to the Executive Committee for consideration.\n\nMr. Holmes objected but the proposal was carried for consideration.\n\nMr. Holmes objected but the proposal was carried.\n\nMAINTENANCE OF THE NORTH WEST TERRITORIES.\n\nMay 19th, 1862.\n\nThat we believe it is the duty of the Executive Council of the North West Territories to take care of the safety of the Laboratories.\n\nThat the right of self-governance should not be taken away by any change in the Constitution.\n\nThat the action of the Executive Committee shall not be considered as evidence against the Executive Council.\n\nThat the Executive Committee shall not be considered as a substitute for the Legislative Assembly.\n\nThat the Executive Committee has no authority to make rules.\n\nMOTION TO RECONSIDER\n\nMr. Villeneuve moved a Motion to reconsider the Order.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMISS MACK & CO, JAMES SINCLAIR\n\nDecorative Painting & Specialty.\nNORTH WEST COUNCIL.\n\n(Continued from Third Page)\n\nMr. White moved a resolution: \"That it be referred to the Executive Committee to consider the propriety of making such grants towards establishing law courts in each of the several Judicial Districts.\"\n\nMr. Tarrill moved the following resolution: \"That the present recommendation of the Executive Committee be approved, and that Council recommend that additions be added to private offices for the Clerks of the North West Com- mittee, Commissioner and Library. He then moved unanimously.\n\nCal. Richardson introduced \"Ordinance respecting the Administration of Justice.\" Resolution considered.\n\nCouncil resolved itself into committee to consider \"Ordinance relating to duties of Justices of the Peace.\" Ordinance reported.\n\nMr. Godden introduced \"Ordinance respecting stolen horses.\"\n\nThe following Ordinances were consid- ered generally in committee and agreed to:\n\nAn Ordinance exempting certain pro- perty from sale and seizure, etc.\n\nAn Ordinance prohibiting the destruc- tion of works.\n\nCouncil adjourned until p.m.\n\nAFTER NOON.\n\nCouncil resolved itself into committee to consider \"The Police Ordinance.\" Committee rose and reported progress.\n\nMr. Jackson moved \"That the several members of the Council be requested to appoint Committees to examine the provisions of \"The Ordinance for the Pro- tection of Game.\" Resolution con- sidered.\n\nWednesday, July 29.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nThe minutes having been read and approved.\n\nA motion was made\n\nMr. Jackson rose to a question of privi- lege. He referred to an article in the \"Prairie Post\" of July 16th, where it was stated that a resolution favorable to the establishment of branch lines was passed by the Council. He said he had stated that there was no such resolu- tion, as no such resolution had been passed, though he was aware the same had been mentioned in connection with branch lines.\n\nThe Civil Service Committee reported that the ordinance relating to holding land by Trustees for Religious bodies is approved. Report adopted.\n\nMr. Jackson moved the following reso- lution:\n\n\"That the Council do resolve itself into Committee of the Whole to consider and report upon the provisions of \"The Ordinance for the Protection of Game.\" Resolution con- sidered.\n\nThe House accordingly resolved itself into committee.\n\nIN COMMITTEE.\n\nMr. Jackson moved \"That $500 be appropriated to the MacLeod District; That $1,000 be appropriated to the Edmonton District; That $1,000 be appropriated to the Calgary District; That $1,000 be appropriated to the Athabasca District; That $500 be appropriated to the Battleford District; That $1,000 be appropriated to the Regina District; That $1,000 be appropriated to the Moose Jaw District; That $1,000 be appropriated to the Qu'Appelle District.\"\n\nResolution considered.\n\nCouncil resolved, Committee reported.\n\nCouncil again went into committee, considered the ordinance to amend No. 1 of 1879, and \"Ordinance respecting Me- chanics Licenses.\"\n\nCouncil resolved, Ordinance reported.\n\nThe Hon. Governor: \"An Ordinance to amend No. 1 of 1883, respecting in- fection diseases among animals.\"\n\nTuesday, July 31.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nThe minutes having been read.\n\nMr. Godden moved \"that it be the opinion of this Council that the interests of the country known as the ranching country, being large and extensive, and situated close together, constitute a natural basis for the organization of stockmen into stock men, should be thrown open for homestead and preemption in all cases where the same has not been claimed under the laws of the Dominion, and that all actual settlers upon land included within the limits of the district, who have been engaged in the terms of the laws, be confirmed in their holdings, both as to homestead and pre- emption.\"\n\nResolution considered.\n\nCouncil went into committee on the school ordinance.\n\nCouncil resolved, Committee reported.\n\nCouncil again went into committee on \"Ordinance respecting infectious diseases among animals.\"\n\nCouncil resolved, Committee reported.\n\nCouncil again went into committee on \"Civil Justice Ordinance.\"\n\nCouncil resolved, Committee reported.\n\nThe House voted:\n\nA domestic journal for American women, will be sent for one year free to every lady who will send us five cents for postage. We will also send a copy of our magazine, containing 100 pages, for 50 cents (no stamps needed). Best paper for either young or old housekeepers. We also send a copy of our magazine, containing 100 pages, for 50 cents (no stamps needed). Best paper for either young or old housekeepers.\n\nRegular price 10¢ per year. Address at once The Home Journal, Rochester, N.Y.\n\nNotice is hereby given that all accounts owing to the Saskatchewan Club must be paid to the undersigned on or before Saturday the 23rd Instant.\n\nAll outstanding accounts, due and owing to the Club must be sent in with the month's rent from date, and accounts to be duly verified by the party concerned.\n\nA. SPROAT,\n\nP.S. No account will be entertained by me unless sent in manner, and at the time indicated.\n\nPrince Albert, 11th August, 1884.\n\nSHANNON & McLEOD\n\nDEALERS IN ALL KINDS OF Boots & Shoes, Rubbers, Etc.\n\nCustom work a specialty.\n\nRepairing done with neatness and de- tail.\n\nTerms strictly cash from date.\n\nN.B.—All parties who have not paid their accounts, will please do so at once and save further trouble and expense.\n\nSHANNON & McLEOD.\n\nFRESH ARRIVALS FROM THE EAST AT\n\nJ. M. Campbell's.\n\nA LARGE CONSIGNMENT OF Dry Goods AND Groceries AND Coal Oil.\n\nJust arrived by the last overland train. The public are cordially invited to call and examine the goods on display, as they are the Cheapest and Best in Town.\n\nJ. M. Campbell.\n\nTHOS. POWERS,\n\nEUMPS !! Made and always on hand at greatly reduced prices.\n\nWagons, Buggies, and Wagons re- paired with neatness and dispatch.\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Brick and Lime always on hand.\n\nPrince Albert.\n\nEmmanuel College.\n\n$25 TO $50 PER DAY\n\nVictor Well Boring & Rock Drilling Machinery\n\nCan easily be made using the OLD RELIABLE.\n\nVictor Well Boring & Rock Drilling Machinery\n\nWe can make any size required to demonstrate the fact. The WELL EXCAVATOR, which has received such attention during the past fifteen years, is now being used extensively throughout the world. We are MONARCH OF ALL in every country in which it is used. It is the only machine that can be used for any purpose. It is simple to operate and easily handled. It is the best and most practical Machine extant. They are employed by some of the largest mining companies in the world.\n\nProspecting for Coal, Gold, Silver, Coal Oil and all kinds of Minerals.\n\nFor sinking Artesian Wells and Coal Shafts, &c., they are superior to any other form of apparatus. They are furnished complete, including Borehole, Wind Mill, Hydraulic Rams, Horse Power, Back Ho, Mine Shaft, etc.\n\nGood Agents wanted in every country in the World.\n\nAddress: VICTOR WELL AUGER & MACHINE CO., 511 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nBuffalo Hall\n\nHosiery, Gloves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flakes Chewing, Myrtle Navy, Golden Rule and Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS AT\n\nJ. L. JOHNSON & Co.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Snaths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & Co.\n\nT. N. Campbell.\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal, New York, and United States promptly attended to.\n\nPrince Albert - N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884082201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 4083, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6365, 2], [6365, 9481, 3], [9481, 17423, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]