[{"id": "af3cd121cbe526738a4f774a4b95b73487a5df82", "text": "THE PRINCE ALBERT TIMES\n\nJ. D. MAVETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\nRev. A. H. Wright\n\nSt. Peter's Church\nRev. Mr. Macdonald\n\nSt. Paul's Church\nRev. Mr. Williams\n\nC. M. Church, Red Deer Hill\nRev. Mr. Parker\n\nSTEWART BROS., TRADERS, GENERAL MERCHANTS\n\nCHESTER THOMPSON, General Blacksmith\n\nPRINCE ALBERT\n\nTHOS. POWERS, Brick, Plastering and Stone Work.\n\nG. D. NORINGHALES, Watchmaker and Jeweller.\n\nNEW GOODS! MEDICAL HALL\n\nBURDOCK BLOOD BITTERS, BURDOCK HEALING OINTMENT, BURDOCK PILLS, VICTORIA HYPOPHOSPHITE, VICTOR & BUCHA AND UVA URSI, FREEMAN'S WORM POWDERS, YELLOW OIL.\n\nT. E. JACKSON\n\nFRIDAY, JUNE 5, 1886.\n\nTHE SITUATION\n\nThe greatest anxiety with regard to the future has already largely displaced in the public mind of this neighborhood the natural feeling of clamor which pervaded at the time of the break-up of the rebel forces at Batoche by General Middleton and his volunteers. We do not refer to that anxiety about the general prosperity of the district, which we receive the attention deserves in our course, but to that which concerns the immediate safety of the lives and property of the settlers. To justify the estimate of the position in which the settlers appear to be, let us turn our attention to consider briefly the nature of the enemy which composed the force collected in open rebellion at Batoche, and the position in which the contending parts have been left. It appears that there have been half-breeds, as far as can be gathered from what appears to be all reliable evidence, the number of them actually killed in the three engagements at Duck Lake, Fish Creek, and Batoche cannot in all exceed thirty men, and this estimate includes a few severely wounded as to be, practically speaking, dead. Of the number of wounded we cannot at present make any serious estimate, but up to the time of writing we may put the prisoners taken at five and twenty. The meaning of this is simply that the large majority of the half-breeds who have done at least as much fighting to sustain their forces as they sustained, are going at large, many of them armed, and all of them just sufficiently damaged in their circumstances as to be far more dangerous when they first break out. Whether this will remain in this neighborhood or not, we believe their necessities by forming themselves into what they may so easily do in a country offering such natural advantages, viz., large tracts of land, will be sufficient to keep them quiet until the spring, when they will be forced to seek shelter elsewhere, where they will be less likely to be molested by the authorities.\n\nThe situation is now such that the settlers must be prepared for any eventuality, and the best course for them to take is to remain in their homes and await the result of the negotiations between the Government and the Indians. The settlers should not be alarmed by the reports of the Indians' intentions, but should be prepared to defend themselves if necessary. The Government should be trusted to deal fairly with the Indians, and the settlers should not take matters into their own hands.\n\nThe Prince Albert Times\nARRIVAL OF THE VOLUNTEERS.\n\nWhile the attacks made upon the conduct of the Police and Volunteer Constables of this place in people in the east and west new districts have been most exciting in their import and regard to the future safety of life and property in the territories here has not absolutely meant so much as the public interests would have supposed. In fact what little was accomplished in some respects by takings carelessness—chiefly in the non of the forces the duties imposed on them by the order of their commanders—that the people of the place were yet too late when called out as volunteers to feel the loss of sympathy with them all in all they had to endure, moreover sorrow for the sufferings of their women who had to observe the loss of life incurred, has been expressed in the addresses previously given. The great alarm which the public expressed at seeing the people of the guns of many retrenchment for fear the southern soldiers who had the worst, which brought upon them the verdict of the court-martial against the officers, from the fact that added to the uncertainty regarding to the day of battle, brought upon itself the implied threat of any advance beyond their daily station, which implies of the remarks of the prisoners that the courage of the opponents has met such a fate for the women and children. Again every place where there has been a show of resistance on the part of the townsfolk was prepared towards anything on an extended scale which was feasible. If there was arrangements made to ride into parts of the town, and reach out and receive the volunteers, landed by our army's boats, here at hand, but where there was a smoking gun there was a stand, and though I am sure the volunteers who came in from the rear road, only managed to sight the column, this were impossible, as by the judgment of the experts there would have been no chance of success over the range of the gun which winked out with the greatest energy, and the guns were soon silenced and therefore for their further advance we knew not where they could turn, I imagine that the volunteers who came to our aid would have been able to give assistance to the inhabitants of the town and assist them to keep the crops.\n\nOn Saturday, the third day, the remains of Mr. E. Elliott and his family, who lost their lives when gallantly fighting against shots fired from the fort. The mayor, Mr. Elliott, a brother-in-law of the deceased, has made an active shower to procure a proper casket at great expense which they bury at Pauletts camp and will retreat none, and his remains will be forthwith returned to his home and laid to rest alongside those of his late father, Mr. G. Thomas, whose name was also on the list. The deceased, W. G. Elliott, has died in hospital under the care of Mr. D. Edwards, member of N.W.C., for reburial in the Presbyterian Cemetery, to be buried near the graves of his late father and mother at the nearby cemetery. The body of Mr. Elliott, who died in hospital, is now on its way back to Woodland, where he will be buried next Monday morning. The body will be transported by the railway train at Woodland.\n\nWe are glad to learn from Major Conroy that not more than four or five days have elapsed since the death of Mr. Elliott. We trust that the family may be comfortably accommodated in a house which will be held in the town until the end of the war, so that they may have comfort in their new home.\n\n**DRY LUMBER.**\n**MOORE & MACDOWALL**\n\nWish to inform the Public they have on hand for sale a Half Million Feet of Dry Lumber consisting of Matched, Dressed and Undressed.\n\n**Dressed Flooring, $48**\n**Undressed do., $42**\n**Dressed Siding, $48**\n**Undressed do., $42**\n**Sheeting, $30**\n**Common Lumber, $35**\n**Dimension do., $40**\n\nOver 17 feet extra.\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings cheaply as any firm in Town.\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\n**MOORE & MACDOWALL**\n**THE PRINCE ALBERT TIMES**\n**AND**\n**SASKATCHEWAN REVIEW.**\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\n**JOB PRINTING**\n\nOf all descriptions done neatly quickly and cheaply.\n\nJ.D. MAVETT, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885060501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 1862, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3138, 2], [3138, 7548, 3], [7548, 7548, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]