[{"id": "df6875ab4701f157d1e299721ffa1ae2d0524cb1", "text": "The Morning Call says: \"It is gratifying to note that action has been taken by the Ottawa authorities towards reducing the Tariffs' fees in the Northwest Territories.\n\nAn Order in Council was just passed reducing the rate and it will come into effect on January 1st. Mr. Dewdney has, in so promptly acting on the suggestions made by the citizens, given evidence of the deep interest he takes in the affairs of the Territories.\"\n\nThe necessity for a revision of the tariff referred to has been very much felt for a long time and we are glad that it has now been attended to; the fees are too high generally throughout, and reduction will be hailed with satisfaction by all interested. Mr. Dewdney appears to be fully alive to matters affecting the North-West, and generally gives such attention as come under his charge. We would like to see him prompt and active. We would like to see Mr. Dewdney take up the matter of the expenses of the late Assembly election; this election was held in June last, six months ago, but not until recently Office bearers of Prince Albert and Kinistino districts have not been paid and the different officers employed under them have had to wait and suffer in consequence. Such treatment is unkind, and has a strong tendency to alienate the sympathy of the people from the Government; we trust that Mr. Dewdney will give this matter his best attention and see that the expenses are paid forthwith.\n\nA provision has been inserted in the School Ordinance at the present session of the Assembly, making attendance at the public schools compulsory during a certain portion of each year. We believe that such a provision will meet with the hearty approval of those on whom the burden of supporting schools falls. Under the law, as it stood, in many schools there was only a small proportion of the children whose school age attended school, while the rest were growing up in ignorance, and this was owing to the negligence or ignorance of the parents. If parents will not send their children to school, they cannot be compelled to. This amendment of the law meets with our entire approval.\n\nThe information given to the electors of this district, at the meeting held on Tuesday, by Mr. Macdonald, while not having the force of an official statement, was nevertheless of a most encouraging and reassuring nature. Mr. Macdonald's speech was very interesting and clear on the subject of railway communication, and he gave the public a perfect idea of the steps taken by him in the past, and also as to the arrangements which have been completed up to date. After hearing Mr. Macdonald, we have no doubt but that the Regina and Long Lake road will be pushed forward vigorously in the spring and that it will be within easy distance of Prince Albert by the end of next summer.\n\nNothing is evident, and that is that it will not be owing to any neglect of our member if we do not get railway communication with the outside world at the earliest possible date. Mr. Macdonald has always placed our interests at Ottawa, and was in every way deserving of the vote of thanks which was so unanimously tendered to him at the meeting. We would urge the congregation urge upon the committee appointed to consider the matter the necessity of at once proceeding with their work, so as to have it completed and the result in Mr. Macdonald's hands before the session of the Dominion Parliament begins.\n\nGO TO AGNEW'S FOR Stoves Stoves Heating Drums Stovepipe Coal Oil T.J. AGNEW W.STOBART & CO\n\nIndian Traders AND General Merchants Prince Albert and Duck Lake SASK. FOR THE Best Assorted Stock of CONFECTIONERY GO TO H. M'DOUGALL'S BAKERY.\n\nCampbell's Cathartic Compound (Blaud.)\n\nImported Tweed Uitings, Trowsering Overcoating WORSTEDS,\n\nIn English and American Lines.\n\nCanadian Tweeds\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSummer Suitings in All Grades\n\nRobertson & Robertson.\nNORTHWEST ASSEMBLY.\n\nExped., Nov. 25.—After the routine business had been disposed of, Mr. Macdonald, minister of agriculture, reported in refer-\nence to the question of the disposal of the land grant from Canada. The report stated that the land grant had been approved by the government, and that the land was now available for settlement. The minister also announced that the Dominion government would be willing to consider the possibility of selling the land at a reduced price to encourage settlement.\n\nCOMMUNICATIONS.\n\nThe DISLOYAL MAIL.\n\nTo the Editor of The Times:\n\nSir,—The Times of the 23rd of November has the following paragraph in a column of London news relating to the question of the loyalty of the Assembly:\n\n\"A special Commissioner Moore will, without doubt, be called to the seat of government to investigate the actions of Sir Charles Warren, but his appearance there will be delayed by the fact that he is engaged in a private matter.\"\n\nThis statement is incorrect. Sir Charles Warren has been appointed as the new Commissioner of the Assembly, and he will be arriving in Ottawa shortly.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS For surpassing any previous season, both for richness of design and quality. The variety of new goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock No trouble to show Goods.\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL (LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN, Sec.-Treas.\n\nAGENTS:\n\nP.G. GRAY, Edmonton, Alta.\n\nJ. FRASER TIMS, Fort Saskatchewan Alta.\n\nMahaffey & Clinkskill, Battleford, Sask.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Mr. P. Rowell & Co., Advertising Agents.\n\nA DIURETIC.\n\nGentle and powerful diuretic, used by physicians for many years. It is a safe and effective remedy for kidney troubles and other conditions requiring increased elimination of waste products.\n\nA LAXATIVE.\n\nA gentle laxative, used by physicians for many years. It is a safe and effective remedy for constipation and other conditions requiring increased elimination of waste products.\n\nWELLS, RICHARDSON & CO., Proprietors Montreal, P.Q.\n\nONE MORE Great Clearing Sale.\n\nNot to be missed! A grand Clearing Sale.\n\nW.R. FISH'S CENTRAL STORE.\n\nSOOTHING, CLEANSING, HEALING.\n\nCATARRH, Cold in Head, Hay Fever.\n\nEASY TO USE.\n\nFlavoring Extracts\n\nBAKING POWDER\n\nRUPTURE\n\nRUPERT\n\nCHAS. CLUTHER'S \"NEW\" COMPOUND\n\nFor the Nervous The Debilitated The Aged.\n\nNERVE TONIC\n\nGreat W. Burrows, St. Thomas, Ont., says: \"I have used this tonic for several years and find it very beneficial.\"\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Mr. P. Rowell & Co., Advertising Agents.\n\nA DIURETIC.\n\nGentle and powerful diuretic, used by physicians for many years. It is a safe and effective remedy for kidney troubles and other conditions requiring increased elimination of waste products.\n\nA LAXATIVE.\n\nA gentle laxative, used by physicians for many years. It is a safe and effective remedy for constipation and other conditions requiring increased elimination of waste products.\n\nWELLS, RICHARDSON & CO., Proprietors Montreal, P.Q.\n\nONE MORE Great Clearing Sale.\n\nNot to be missed! A grand Clearing Sale.\n\nW.R. FISH'S CENTRAL STORE.\n\nSOOTHING, CLEANSING, HEALING.\n\nCATARRH, Cold in Head, Hay Fever.\n\nEASY TO USE.\n\nFlavoring Extracts\n\nBAKING POWDER\n\nRUPTURE\n\nRUPERT\n\nCHAS. CLUTHER'S \"NEW\" COMPOUND\n\nFor the Nervous The Debilitated The Aged.\n\nNERVE TONIC\n\nGreat W. Burrows, St. Thomas, Ont., says: \"I have used this tonic for several years and find it very beneficial.\"\nMASS MEETING.\n\nOn Tuesday last a public meeting was held at Prince Albert for the purpose of taking some action with regard to railway matters; Mayor Bain was appointed chairman and S. Beever, secretary.\n\nThe chairman briefly explained the object of the meeting and put the question which had been handed to him and the president of the Lorne Agricultural Society to call a special meeting to consider the same question, and the object of the meeting was to impress upon the Government the necessity of immediate connection by railway with Prince Albert.\n\nMr. Macdonald, M.P., being called up on a vote—a very important vote—tore across every action which had been taken by himself and the delegates at Ottawa last year in endeavoring to secure the connection of the line from Long Lake road to Prince Albert. He said that they had intervened every month, and that they were still equally alive to the necessity of this plan for a road, the only difficulty being in the way of raising sufficient money as there seemed to be no prospect of giving money grants to branch lines. He then read a letter from Mr. Munro of Rainy River, Sir John A. Macdonald, and Mr. Nanton, of the financial firm of Onder Haemond & Nanton, showing that the finances of the company were not completed, and that everything was now in readiness to begin the construction of this line. Mr. Allan said that the work would be prosecuted vigorously in the spring. Mr. Macdonald spoke very hopefully of the Government having the railway line in hand before the fall.\n\nJohnson then moved the following resolution, which was seconded by Thos. McKay and carried unanimously:\n\n\"That whereas the building of the Canadian Pacific Railway has opened outside markets from Prince Albert and on market the prices given locally for produce will not cover the cost of production.\"\n\n\"And whereas this was also the case with the Dominion Atlantic Railway, which went to Ottawa last year by the Town Council, and the Board of Trade and the Lorne Agricultural society;\n\n\"Resolved that this meeting desire to again urge the Government into a state of decision into which this settle-\n\nment has been placed, and most urgently urge them to give the encouragement necessary to the Canadian Pacific Railway to build to Prince Albert by 1889, and that copies of this resolution be handed to the minister for Saskatchewan.\"\n\nCol. Spratt addressed the meeting and moved:\n\n\"That this meeting beg to tender its thanks to Mr. Macdonald for his services in the past and that they have confidence in him and that he future do his utmost to guard and advance the interests of the people in regard to the railway line between James MacArthur and carried unanimously.\n\nMr. Macdonald, in a well-chosen remarks remarks, thanked the members for their attention and pledged himself to do all in his power to advance the interests of Prince Albert by having railway connection. He said that he would greatly aid him if proper statistics were compiled, so that he could show the advantages of connecting Prince Albert by railway.\n\nMoved by the Rev. J. Agnew and seconded by Mr. J. Agnew and carried.\n\n\"That this meeting appoint a committee to collect statistics throughout the District of Prince Albert and report the same to the Government our representatives in Ottawa, and the importance of securing early railway communication.\n\nThe committee appointed to collect the proper statistics were—Hon. L. Clarke, Messrs. McKay, Rev. P. Prichard, W. Miller, Dr. Capstick, Rev. A. H. Wright, and H. Mitchell, M.L.A.\n\nA vote of thanks was tendered the chairman and secretary and the meeting adjourned.\n\nTake your tea with the Ladie Aid Society Thursday evening next at Jack and Co.'s drug store.\n\nTo announce that the Christmas Lodge A.F. & A.M. was held in the Masonic Hall on Thursday evening last when the following officers were elected: Worshipful En- gaging Master, Dr. Bain; W. M., Rev. J. F. A. Scott; S.W., Ben. W. J. Carter; J.W. Sec., G. S. Davis; Tres., Mr. R. W. Wilson; S. D., Mr. J. E. Taylor. The address sheet will be installed on the anniversary of the festival of St. John.\n\nThe German Church—A very interesting talk (German) will be given by Mr. K. H. von Bock, Nov. 26th at 8 p.m. Address Dr. Kuhlman, 307 Main Street, Rossclair.\n\nHORSE SHOE STORE.\n\nStatistics state that there are now more horses than men in the world, and if the feminine increase keeps up at its present rate, a man will be a rare animal in a few years. In keeping with these facts and the desire to have the best horseflesh, and better still, the near approach of Xmas, I have decided to sell my stock of\n\nBOYS' OVERCOATS AT COST.\n\nGive us a call and convince yourselves that we have\n\nThe Only First-class Stock in All Lines\n\nin the Saskatchewan, so please remember that if you fail to find your requirements elsewhere, come to the Horse Shoe.\n\nTHOS. O. DAVIS.\n\nTHE GLOBE CHRIST NUMB.\n\nA GREAT HOLIDAY PAPER\n\nNEW TYPE, NEW PAPER, FINE HANDSOME LITHOGRAPHIC PRINTING, THE BEST CHRISTMAS PAPER EVER ISSUED IN CANADA.\n\nTHE LITERARY MATTERS in the Canadian Globe will be entirely original and will include stories from the ablest pens in Canada. The subject treated will be wholly Canadian.\n\nFINE HANDSOME LITHOGRAPHED PLATES accompany the paper, the principal one being a scene from Vancouver Park, B.C., from a painting by Mr. R. O'Brien, the celebrated Canadian artist.\n\nWHEN YOU BUY THE GLOBE, you will in every way first-class and no expense will be spared in having it surpass anything of the kind hitherto published in Canada.\n\nAS THE DEMAND will be very great, we would advise immediate purchases to leave them at our newsstands, and send direct to this office, our house, where they will be promptly delivered, as the supply is strictly limited, and we cannot undertake to print a second edition.\n\nThe price has been placed at ONLY 25 CENTS PER COPY.\n\nIt is therefore recommended that you purchase the first week in December in order to allow plenty of time for mailing copies long distances as we reach destination before Christmas.\n\nTHE GLOBE PRINTING OFFICE, Toronto.\n\nTHE WEEKLY GLOBE, the best family newspaper in Canada, and THE RURAL CANADIAN, the best agricultural paper in Ontario both come from the press of 1888 daily, $4.00.\n\nTHE WEEKLY EMPIRE\n\nCanada's Leading Paper.\n\nTHREE MONTHS FREE\n\nTHE EMPIRE, since its establishment, has met with such marked success, and among its subscribers is the leading business firms of Canada, that we are enabled to offer three months' free subscription to any subscriber who will take out a fifteen months' subscription during the coming season.\n\nFIFTEEN MONTHS FOR $1.\n\nNow is the time to subscribe.\n\nAddress THE EMPIRE, Toronto.\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888121401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5858, "total-output-tokens": 3367, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3913, 2], [3913, 7623, 3], [7623, 14371, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]