[{"id": "79d12731bda8f01811bc8c5b51e38f7cca857b32", "text": "FRIDAY, OCTOBER 22, 1886.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N.W.T.\nPRICES—Single copies 10 cents each.\nNo issue will be published in the paper. Notices local &c., in order. Notices intended for publication should be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nTHIS PAPER may be had at the offices of Mr. ROBERTSON & Co., Newspapers, Prince Albert, N.W.T.; Mr. HUTCHISON, Proprietor.\nNEW YORK.\n\nSUNDAY CHURCH SERVICES\n\nSt. Albans' and St. Paul's Churches.\n\n11 o'clock—Service in both churches, and 7 p.m.—Sunday School 3 p.m.—Catechism in charge of Mr. B. A. Wilson and Mr. C. Cunningham, Theological Students of Dominion College.\n\nOur Lord's Supper will be preached, and a service, when home, at St. Paul's in the morning, and at St. Albans in the evening.\n\nSt. Catharine's.\n\n11:30 a.m.—Rev. Canon Flett, R.D.\n\nSt. Paul's.\n\n1 p.m.—Rev. Canon Flett, R.D.\n\nSt. John's.\n\n10:30 a.m.—Mr. Macdonald.\n\nSt. James'.\n\n3 p.m.—Rev. Mr. Macdonald.\n\nSt. Anne's, R. Catholic.\n\n10:30 a.m. and 3 p.m.—Rev. Peter Dominick.\n\nSt. Peter's.\n\n11 a.m. and 5 p.m.—Rev. Mr. McWilliam.\n\nMethodist Church.\n\nRev. Mr. McReynolds will preach at regular services at 11 a.m., 3 p.m. and 7 p.m. every Sunday excepting Wednesdays and Thursdays evenings at 8 p.m. Rev. Mr. Willis in charge.\n\nFRIDAY, OCT. 22, 1886.\n\nTHE H. R. RAILWAY.\n\nThose people of Manitoba and those who have been engaged in the building of ordinary narrow-gauge roads to navigate the Hudson's Straits and Bay, the actual completion of the construction of the Great Northern railway cannot fail to be encouraging in the extreme. It is the realization of their dreams and aspirations. But while it is an augury of better times for Manitoba, and Winnipeg as its capital, it is also the best times for the North-West, and the great Saskatchewan country, the fairest portion of the Canadian North-west, in particular.\n\nNot many years ago the people of the east and south imagined the Great Lake to be the only route suitable for civilized people. Time, and a very short time, has proved that a civilized man can travel by rail through this country, and the explosion of the idea that Hudson's Straits and Bay could be used as a navigable waterway has brought the North-West not only out of the pale of civilization, but will, with the completion of the H. R. Railway, show that the North-West, instead of being far removed from civilization as represented in the east, are closer to the markets of the world than any eastern and southern communities.\n\nFrom forty to sixty miles are expected to be completed this fall, and the most of the line will be heard at the Grand Rapids, if not far beyond. Just what it will mean to the commerce of this country, and the expansion of the idea that Hudson's Straits and Bay could be used as a navigable waterway has brought the North-West not only out of the pale of civilization, but will, with the completion of the H. R. Railway, show that the North-West, instead of being far removed from civilization as represented in the east, are closer to the markets of the world than any eastern and southern communities.\n\nThe QUEBEC ELECTIONS.\n\nIf the late handsome Chief of the Metis, Mr. David Lepine, is to be trusted, the election of Mr. Mercier, Liberal Edgeworth, is in a position to look towards, downwards, especially if diagonally on the line which he has marked out for himself. If the Quebec election has been marred, there are some people who are not satisfied with the result. They say that what they would do if the North-West were an independent State of Canada, we must admit that the growth of our legislative bodies have been marred by the same defect.\n\nBesides, we have been granted a representation in the House of Commons after the manner of the old Roman Senate, whose progress has been marred, there are some people who are not satisfied with the result. They say that what they would do if the North-West were an independent State of Canada, we must admit that the growth of our legislative bodies have been marred by the same defect.\n\nABOUT AN EVEN THING.\n\nIf the late handsome Chief of the Metis, Mr. David Lepine, is to be trusted, the election of Mr. Mercier, Liberal Edgeworth, is in a position to look towards, downwards, especially if diagonally on the line which he has marked out for himself. If the Quebec election has been marred, there are some people who are not satisfied with the result. They say that what they would do if the North-West were an independent State of Canada, we must admit that the growth of our legislative bodies have been marred by the same defect.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nCENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nSTOVES.\n\nThe Largest and Cheapest A. M. of\n\nCook Stoves from $25 to $50\nBox Stoves \" 7 to 40\nParlor Stoves \" 17 to 25\nCamp Stoves \" 3 to 6\n\n1,000 Gallons American Coal Oil.\n\nT.J. AGNEW.\nWM. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nNOTICE.\n\nSCHOOL HOUSE.\n\nSATURDAY, OCT. 31st, 1886.\n\nThe vote will be open from 10 a.m. until 6 p.m.\n\nThe qualification of voters is expressed in the following words:\n\n\"I do solemnly swear that I am a bona fide elector of the Riding of Prince Albert, District No. 3 of the North-West Territories, and that I have paid the sum of Six Thousand Two Hundred Dollars to the Receiver General of Canada, in equal annual instalments from date of receipt thereof, and that I have paid the sum of Five Thousand Dollars for the purpose of purchasing land in the North-West Territories for the purpose of farming, and that I have paid the sum of Four Hundred dollars for the purpose of purchasing land in the North-West Territories for the purpose of farming, and that I have paid the sum of Two Hundred dollars for the purpose of purchasing land in the North-West Territories for the purpose of farming.\"\n\nA vote on the above will be taken at the\n\nSCHOOL HOUSE.\n\nFresh Pork\n\nTo be delivered in the quantities, and at the Indian Agencies, as follows viz:\n\n3,000 lbs. at 10c., Peace Hills.\n2,000 lbs. at 10c., Mountain Station.\n2,000 lbs. at 10c., Crooked Lakes.\n2,000 lbs. at 10c., Elbow.\n1,000 lbs. at 10c., Peace Hills.\n1,000 lbs. at 10c., Elbow.\n1,000 lbs. at 10c., Peace Hills.\n\nTenders will be received at this office up to noon on DAY OF OCTOBER next.\n\nJ. SINCLAIR & CO.\n\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nCENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nALT N Complimentary New Shop\nA LARGE STOCK OF\nWatches, Clocks and\nJewellery\nKEPT CONSTANTLY ON HAND\nREPAIRING PROMPTLY ATTENDED TO\nHE GOT THE BOOGEY.\n\nSome time ago a man who gave his name as Smith—a name most of us have heard before—bore a halberd at Troy station in the olden days. On arriving at the ferry he demanded to be taken across the river, where the ferryman stood waiting for him. The ferryman refused, saying that he was not going to take any man across the river who did not pay for the privilege. Smith then took out a gun and threatened to shoot the ferryman if he did not take him across. The ferryman then called for help, and a crowd gathered around them. Smith then disappeared into the crowd, and was never seen again.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR White Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowellings,\n\nDress Goods,\n\nSilks,\n\nLinen, etc.\n\nGO TO J. M. CAMPBELL'S,\n\nGROCER AND DRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 19 feet extra\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Rowell & Co., Newspaper Advertising Bureau, Prince Albert, Sask. Send 10c for 100-pg. Pamphlet.\n\nMOORE & MACDOWALL\nTERRITORIAL NEWS.\n\nThe Edmonton Bulletin, Sept. 29th, says:\n\nMr. Lloyd W. G. Hinton, W. J. H. and W. B. Wilson arrived from Pitts-\n\nfield Wednesday. The H.B. post has been re-established; there are now three post\n\nmasters serving: Rev. Mr. Quimby, church of England missionary, is leaving for his old country and has sold his\n\nhouse at Lac La Croix to Mr. Murray, in-\n\ntending to go into business. A large quantity of provisions for the new telegraph line to Battleford\n\nhave been sent by Mr. Murray. Indian department buildings have been erected at Onion lake and a\n\nRoman Catholic mission established. Frog Lake has been abandoned.\n\nHolbrook, the post-office on the Bow river trail at the head of the Battle-\n\nRiver, has been closed by Mr. J. A. Jay, post master.\n\nJ. Walter, south side, had a yield of\n\n900 pounds of grain.\n\nThe fruit trees introduced here last fall\n\nand spring by A. E. Blake have not de-\n\nveloped done well, having grown from two to four feet high.\n\nA. W. R. Macleay, agent for the\n\nConfederation Life Association, arrived on\n\nMonday's stage.\n\nEdward Cunningham, brother of S.\n\nCunningham, M. N. W. C., Mr. Albert,\n\nwas recently admitted into the order of\n\nOblates at London, England. The Rev.\n\nGeorge Mulock, brother of Rev. Peter La-\n\ncombe, Rev. Peter Cunningham was elec-\n\nted by the priesthood of the Ottawa\n\nCollege.\n\nMisses Pibon and Moody returned\n\nfrom their trip to take Attawapiskat\n\nSaturday last. They brought back a\n\nquantity of furs, several of which\n\nhave been purchased rich in silver and\n\nothers in gold. They also brought\n\nspecimens of fish.\n\nThe Battleford Herald, Sept. 28th, says—\n\nThe fever continues its ravages, several\n\nnew cases having been in the course of\n\nthe week added to the list of victims of\n\nthe horrible Inspectors Wilson is a victim.\n\nThe worst section was that of Co-\n\nlumbia, where the fever has been\n\naffected since his illness. The earlier\n\nsufferers are slowly improving.\n\nCapt. J. A. Simpson and Capt. Rich-\n\nmond, who have been attacked, have already\n\nbeen attacked by the fever.\n\nThe Medicine Hat Times of Oct. 5th, says—\n\nCapt. Collins, the policeman who died\n\nlast Friday morning while attend-\n\ning the funeral being a military one, and\n\nthe band taking part.\n\nA man named James Patton was arrested\n\nin town last night, charged with steal-\n\ning a horse from McBride. He was\n\nbrought before the court, and Judge\n\nNash, who was requested to sign the\n\npaper before Col. McLeod at the next\n\ncourt.\n\nThe Medicine Hat Times of Oct. 5th, says—\n\nAbout twenty men are at work entag-\n\nling the stock yards at this point for the\n\nadjoining cattle market.\n\nThe Methodists are erecting a preaching\n\npole on the lots occupied by the church.\n\nThe sheep shipped from here last week\n\nby Messrs. Holmes and Hillebrand were\n\nsold in Winnipeg for six in the live-\n\nstock market.\n\nMajor George Strange and soldiers\n\nwere sent away in the ambulance bed\n\nand heavy after all the sections tried\n\nhe has led.\n\nThe Calgary Herald, Oct. 5th, says—\n\nOn Monday morning a fire broke out\n\nin the old buildings of the Blackfoot\n\nAgency, which completely demolished\n\nthe building and destroyed the contents\n\nof the same and burnt at least in the\n\nbuildings and left them for a few minutes\n\nto speak to one of the other employ-\n\nees, who thought he was going to\n\nsmoke issued from them. He immedi-\n\nately gave the alarm, but the fire had\n\nalready spread through the premises,\n\nas a huge flame immediately\n\nburst forth. He rushed into the building\n\nfor a second time. He had a very\n\nnarrow escape, just getting outside when\n\nhe got back to the spot, but he was\n\nbadly burned about the body and\n\nhands. On Monday night he was brought\n\nto Calgary by Dr. Graham dressed\n\nhis burns. An Indian was seen run-\n\nning out of the burning at the same time\n\nand it is thought he dropped a match\n\nin the bushes.\n\nFrom the Red River Press we learn\n\nthat the Sioux Indians have begun the\n\nMarie River raids upon the settlers of Ten O'Clock\n\nSprings, taking a great deal from Emma\n\nBeverly, Mrs. Murray and Mrs. Murray. Up-\n\ntil this raid was five nights ago. A\n\nshort time afterwards they attempted to steal\n\nthe horses of Davis & Kennedy in broad\n\ndaylight, but being discovered only got\n\naway with two. It seems that the\n\nsmallest amount of some weeks ago,\n\na detachment of cavalry was camped on\n\nthe Marie River, and on hearing of their\n\nproximity did nothing they wished. Mr.\n\nPrice says this sort of thing is getting\n\nmore frequent and more serious. A large\n\nquantity of stores have been lost, and in fact\n\nthere is nothing the Indians do not do\n\nexcept take the life of settlers.\n\nThe wheat harvest is now coming completion.\n\nThe season has been particularly fa-\n\nvorable done in the mountain and\n\nplains sections, which have given\n\nextraordinary prices. The wheat has\n\nbeen of the best grade, with good\n\nquality.\n\nAnother grain of $20 has been donated\n\nfor the finest baby under one year, if\n\nborn in marriage license ought to be\n\ngiven.\n\nJohn Clarke, of Crookston, had seven\n\nmales and females selected from his corn-\n\nfield, and a prize of $100 for their recovery.\n\nTHE FIRST SOD.\n\nCOMMENCEMENT OF WORK ON THE H. B.\n\nRAILWAY AT RESERVATION\n\nOctober, 1869.\n\n(From the Mountains.)\n\nActual work on the Hudson's Bay Rail-\n\nway has been commenced, and from\n\nthis day forward the construction of\n\nwork promised to become of the\n\ngreatest conceivable advantage to Man-\n\nitoba and Western Canada.\n\nThe first sod\n\nwas turned on the section just north of\n\nFrank Park, but without any particular\n\ndemonstration. Hon. Mr. Neppin and\n\nthe prominent provincial citizens were\n\npresent. An\n\nINTERESTING PROCESSION\n\npassed down Main street early Saturday\n\nmorning, consisting of a number of military\n\nguards, wagons, road sweepers, etc.\n\ndrawn by 22 teams of mules and eight\n\noxen. The train was drawn back by\n\npolicemen, implements, and tools, includ-\n\ning axeholds, and accompanying them\n\nwas a large gang of men. The entire\n\ntrain proceeded into the woods near\n\nMain, and went out at the starting point\n\nof the Hudson's Bay Railway, prepara-\n\ntions for the laying of the first sod on\n\nMonday morning. The appearance of\n\nsuch a large force dispelled the doubts\n\nwhich existed regarding the practicability\n\nand feasibility of the H. B. scheme, and many\n\nsmiling countenances were noticed and\n\nexpressed satisfaction at the large number of citizens who wit-\n\nnessed the march past. As the proce-\n\nssion reached the store of Mr. J. H. Hay,\n\nthe chief engineer, Mr. Hay stepped\n\nforward with a number of prominent\n\nmembers of the front town with a small heraldic flag, and it was at once attached to the\n\nfront of the procession.\n\nMr. Hugh Sutherland went west this\n\nmorning to interview the municipal authori-\n\nties of the town of Fort Saskatchewan.\n\nUpon the arrival at the east terminus\n\nthis morning was C. F. Henderson, who\n\nin addition to his duties as railway\n\nengineer and superintendent of con-\n\nstruction on the Hudson's Bay Railway.\n\nIt is understood that petitions will be\n\nsent to the Hon. Mr. Neppin and others\n\nto place a bill granting a\n\nbonus to the town before the people to be\n\nauthorized. As expected, the town stated,\n\nbut with the growing feeling in favor of\n\noffering every assistance and encourage-\n\nment to the road, a handsome amount\n\nwill be voted to be raised.\n\nLadies (to a young woman):\n\nHave you ever appeared as witness in\n\na suit before?\n\nYoung Woman (blushing): \"Yes, yes,\n\nsir, of course.\"\n\nLadies: \"Please state to the jury\n\nwhat it still was.\"\n\nYoung woman (with more confidence):\n\n\"It was a man's wedding, attended by\n\nmyself and informed myself with a lovely\n\nblue dress and a parasol.\"\n\nJudge (jumping violently): \"Order in\n\nthe court.\" - Kansas City Journal.\n\nNEW GOODS\n\nAT\n\nMISS MACK & C.\n\nFirst Door East Telegraph Office.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nBuffalo Hall!\n\nMaking Room for Fall Stock.\n\nDry Goods and Clothing Sold at Heavy Discounts.\n\nGroceries Reduced.\n\nNo Reserve.\n\nBETTS & Gwynne.\n\nAt\n\nLowest Prices,\n\nBuilding Hardware,\n\nLocks, Hinges, Glass,\n\nPutty, Paints and Oil,\n\nPOWDER, SHOT AND LOADED SHELLS.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furn-\n\niture, consisting of\n\nBEDROOM AND PARLOR SUITS,\n\nSideboards, Cupboards, Bureaus,\n\nWashstands, Sofas, Easy Chairs,\n\nBedsteads, Mattresses, Coils, Cradles,\n\nAnd all kinds of Chairs, Etc., which I am\n\nSelling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSaleroom, First Door West of Bank.\n\nW. B. GOODFELLOW.\n\nSTOVES!\n\nCook Stoves, No. 8, $27\n\nCook Stoves, No. 9, 30\n\nBox and Parlor Heaters\n\nAT ALL PRICES.\n\nPiping and Drums and other Tinneryware of every descrip-\n\ntion made to order and war-\n\nranted first-class.\n\nJ. R. McPhail.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886102201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4524, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6754, 2], [6754, 8368, 3], [8368, 17155, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]