[{"id": "c06ac788bad70b1d7cb5e447783b02a5cd6e9810", "text": "Notice to Creditors.\n\nIn the Goods of William Denison, deceased\n\nNotice is hereby given that all creditors and others owing money to the above named, William Denison, late of Prince Albert Settlemente in the Provincial District of Saskatchewan in the North West Territories who died at Prince Albert, on the twenty fourth day of November, A.D. 1884, at Prince Albert Settlement abroad, intestate by will proved at Court of Quarter Sessions held December 7th, 1884, appointed administrator for his estate Vastniegk. Merchants Bank of Canada, Macarthur & Knowles Solicitors, bureaucrats, Logo, etc.\n\nSpecial By-Publicity To The Times Clark's Express Office Jan. 2nd 1885.\n\nAt an early hour this morning Caussen, home of P. F. Alex. L.A. & Josie Talkin', on the Sixth Branch about two miles from here, was startled by fire. The house, containing a large number of tools, Casaum and Mr.苞, took several sweeps of his wet lobes; they lost everything but six wall clocks, estimated at $15 to $30. This clock hit quickly from a defective stove pipe. Mr. Lankamoto was an Englishman who has been living on Mansfield for the past year or so. During 5 periods cut off from the Templeton Consolidated Company and was going into extensive farming operations.\n\nTwo members present and late Mrs. Jones for Moses Jay on the Sabbath morning he was at the bell tower half way to their destination on the 17th, and nothing has been heard from them since; the members are greatly alarmed.\n\nA private telegram from Melbourne arrived this morning states Ms. We Scott and party arrived at their destinations on Monday January 8th. The member was discovered in the vault.\n\nIt is being held that the Royal Canadian Artillery and Air Force Band will make engagements and a visit wedge Winnipeg.\n\nSmoke the Creme de la Creme cigar in newspapers.\n\nMASONIC.\n\nLast Saturday being the Assembly of the Royal Arch Masonic degree consecrated by two Master Masons which have erected that they would build up by the work of the day, hall closed open and Public.\n\nPUBLIC NOTICE.\n\nJohn Kiernan arrived Winnipeg next week. He accompanied by Mrs. Kiernan, who cast upon an extended visit again to Canada where she is now stationed.\n\nMr. H. J.\" Montgomery charge of the Claygate Chapter during Wagontraining. Mr. Montgomery has been invited, with the Canadian Band to take part in campaning.\n\nSergeant Kiernan attached;. It is expected to be absent again next week.\n\nThe Syrup of Virginia and patches produced by Mr. J. E. Keon, the bulk of whose specimens consist of recent colds and coughs. The syrup of Virginia will be promoting useful productions in a rattler without regard to the size.\n\nMr. J. C. Bennett, from Virginia, was appointed enroute to Detroit the fills all the orders that week. He will take orders for tickets to New York.\n\nMr. H. J. Montgomery charge of Claygate Chapter during Wagontraining. Mr. Montgomery has been invited to visit Canada where he is now stationed.\n\nSergeant Kiernan arrived on stage for dinner and tea. Engineer solutions will be accepted for those who desire to make transactions with him.\n\nThe Flatlands of Prince Albert, N.W.T., comprising Great Channel Creek and Sandy Lake, are offered to sale by public lot.\n\nApplications received before June 1st.\nNEW YEAR\n\nThe end of another year brings THE PRINCE ALBERT TIMES the pleasure of offering to readers its best wishes for their happiness and prosperity, not only as individuals but as a community during the coming year, which we are sure will be a happy one.\n\nThis is one of the natural marks in the course of mundane existence by which people use as a point of comparison in estimating the amount of suffering or prosperity they may have experienced in a given period; at all events, various relations to what exists out-side themselves. With regard to the relative position of individuals with respect to what concerns themselves, there can be little doubt that in estimating the aggregate of our common community, we have no concern in our public capacity, nor may briefly refer to some local matters. The chief excitement of the district has been the visit of M. Reil, but that has died a natural death. On the whole, as we have already said, things might have been much worse, and we must put up with a stout heart and wait for the turn of the tide, remembering that there has been an advance in lots of places besides ours. The ground on which we may stand is the future, and the future with reasonable confidence will witness a long occupancy of attention.\n\nTHURSDAY, JANUARY 2, 1885.\n\nDOMINION REPRESENTATION\n\nWe can do very little in this our first issue for the new year to no better subject than Dominion representation. We are convinced that the bringing of it within proper limits to the people of the Territories, we have over and over again stated to be in our opinion the grievance of grievances—upon the redress of which will follow the gain of every other object, serious or important, we sell alone. We may remind the people of the east, as represented by the Government, that we are in the habit of exercising extreme caution with regard to the expression of public opinion, abstaining from harassing them by any vexatious-ventilation of what may be regarded as sentimental grievances or the encouragement of demoralizing views, which may be viewed as premature, while we have used our influence very distinctly to discourage all attempts made to disturb the feelings of the people by pressuring against having their own wishes ends in view. In consideration of this, we can with confidence require the Government to give unqualified credence to the statement made when we tell them that their most warm supporters, as well as all the best men of other political shades in this district are perfectly in accord with their brethren in other parts of the Territories in the determination that the matters which arise, to enforce this claim at any cost. It is an open secret that circumstances, perhaps in the nature of things unavoidable, have combined to render it impossible for us in the Territories of a subdivision to express discontent, which should it find a vent, will have terribly serious consequences, perhaps more markedly so in this district than in any other. That this slumbering fire has not hitherto burst out into a conflagration is simply due to the fact that the countenance of such men as are most respected by the people has been so persistent in maintaining the status quo, that no attempt has been made to bring matters to a head. The attitude of those calculated to influence the masses has not in any way resulted from apathy regarding the restless striving evils, but from a sympathy with the necessity existing under the circumstances of keeping pace with the requirements of such an enormous and rapid increase of settlement over such vast areas. When therefor, that men who have shown exceptional spirit and energy, so means encouraging circumstances unite with those hitherto held back with difficulty, in a plan scheme more comprehensive than any Government thus far has been able to lay before the nation, the result will be nothing less than a great victory of constitutional right, we do not hesitate to say that a Government rising with the slightest humanity and justice would be unable to resist the wishes of the people, and would be willing to meet their views, and assuredly in any case dare not refuse to do so. The feeling that with the abundance of such men as we possess, and the resources which ought to be gathered by peace, at least at a distance, from us as to know little or nothing of our circumstances and requirements, has been for long particularly galling. To prove at length, that the demand for such as much entitled to a state of representation as exists in other parts of the Dominion would involve a nauseating reiterated of facts and principles preferably patient to the average intelligence of a schoolboy. We ask for nothing more than a clear and distinct statement of showing cause on those who may wish to withhold it, and unless we have been doing the Government more than justice in believing their professions regarding the desirability of legislative action for our benefit, they will gladly adopt the simplest and most satisfactory plan of allowing the people of the east to speak for themselves through their representatives on the floor of the Dominion House of Parliament. Should, as is asserted, the intervention of imperial legislation be required, let what is necessary be done for us at once; for alleged delay from that quarter will not be excepted here in excuse. It is self-evident that no adverse influence can be brought to bear upon the Imperial government from the present territorial government; nor is there any possible motive of their own to induce them to unjust and vexatious-thwarting of the just and lawfully expressed demands of so large and progressive a population as already occupies these Territories. Such action would certainly savour of treachery and of a great deal worse on the part of a Government which, fortunately brought Great Britain into the service of civilization on account of a disastrous defeat, due in extending the franchise to a petition of the population of a country not one foot of which is governed by any form of self-governing constitutional representation. We are convinced that the Government will be compelled to yield special pressure to induce them to perform a simple act of justice and common honesty. We do not mean by this to inflame the bombast, but calmly and deliberately state that as a people we are, should the time come to the worst, ready to sacrifice all we possess, even to our lives, as our forefathers did, in defense of our constitutional rights and liberties.\n\nWith regard to accident to life and property we have been singularly exempt, while the extreme healthiness of our district has given marked prominence to the few removals by death, which we all so much regret. Amongst others, we may mention that during the past year we may recall the passing of Lieut. Gov. Dewdney, Mr. White, comptroller, and Col. Irvine commissioner, both of the N.W.M. Police and the late Captains of Caribou's Company, amongst whom we fondly remember Mr. Maclean. There has of course, owing to what we have alluded to, been a good deal of law business, but yet the assignment of our house alone, while we have occasioned similarly to several of our friends. A serious battle, the chief excitement of the district has been the visit of M. Reil, but that has died a natural death. On the whole, as we have already said, things might have been much worse, and we must put up with a stout heart and wait for the turn of the tide, remembering that there has been an advance in lots of places besides ours. The ground on which we may stand is the future, and the future with reasonable confidence will witness a long occupancy of attention.\n\nPRICES TO SUIT THE TIMES.\n\nJ. M. CAMPBELL.\n\nNEW GOODS!\n\nMEDICAL HALL\n\nBurdock Blood Bitters,\n\nBurdock Healing Ointment,\n\nBurdock Pills,\n\nVictoria Hydropathic,\n\nVictor a Bucha and Ursi Ursi\n\nPrimaire Worm Powders\n\nP. E. JACKSON.\n\nAT THE OLD STAND.\nHIGH SCHOOL\n\nWe would call special attention to the adjournment meeting to be held in the Presbyterian Church, Main Street, next at 8 o'clock, in reference to the establishment of a High School in the town. We believe there was a good attendance at the previous meeting was not very encouraging. We would again point out that there are several advantages of getting such an opportunity, as may not occur again, although some hands by reason of sickness or otherwise. A very slight movement has already been made for a start toward which in time will become a most valuable and beneficial institution. We therefore respectfully urge us for payment of teacher's salaries, not for a second building. It will be strange if we do not hear of a second rate raising enough to meet the other slight expenses connected with the school, and therefore the loss of one of our best institutions in the higher branches of education without wasting them out of the place. It was intimated at the previous meeting that the Rev. Mr. Smith, with his usual generosity to everything which is a benefit to the place, was willing to contribute $250.00 and in starting the school.\n\nCURLANA.\n\nChristmas Day the last match of the season was played on the Saskatchewan Curling Club grounds. The game between the President and Vice-President, and was heartily enjoyed by all the players, as well as by the spectators who attended in large numbers. The following is the result:\n\nPresident:\nA. G. H. Smith, 1st end.\nJ. H. Johnson, 2nd end.\nGraham Nelson, 3rd end.\nH. H. Smith, 4th end.\nW. W. Macdonald, 5th end.\nJ. H. Kennedy, 6th end.\nG. T. Brown, 7th end.\nTotal in favor of President 12.\n\nVice-President:\nJ. L. Johnson, 1st end.\nT. M. Macdonald, 2nd end.\nR. Macdonald, 3rd end.\nW. W. Macdonald, 4th end.\nJ. F. Kennedy, 5th end.\nJ. H. Kennedy, 6th end.\nG. T. Brown, 7th end.\nTotal in favor of Vice-President 12.\n\nLast night the ladies between the married and single members of the club came off and resulted, contrary to the expectations of many, in favor of the married team. Our young ladies will have to look to their laurels, as this is the second year to succession the bachelor ladies have carried off the medal. The score was:\n\nMarried:\nJ. L. Johnson, 1st end.\nT. M. Macdonald, 2nd end.\nR. Macdonald, 3rd end.\nW. W. Macdonald, 4th end.\nJ. F. Kennedy, 5th end.\nJ. H. Kennedy, 6th end.\nG. T. Brown, 7th end.\nTotal in favor of Married 12.\n\nSingle:\nJ. L. Johnson, 1st end.\nT. M. Macdonald, 2nd end.\nR. Macdonald, 3rd end.\nW. W. Macdonald, 4th end.\nJ. F. Kennedy, 5th end.\nJ. H. Kennedy, 6th end.\nG. T. Brown, 7th end.\nTotal in favor of Single 12.\n\nJAMES SINGLAR\n\nMerchant Tailor,\nAND DEALER IN\nGENTS' FURNISHINGS.\n\nNEW MILLINERY\n\nFANCY GOODS.\n\nWOOL GOODS.\n\nLADIES' CLOAKS.\n\nFUR MUFFS.\n\nAND\n\nCAPS.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Product never causes. A marvelously pure strength and wholesome flavor. Every cake baked with Royal Baking Powder is sure to succeed in competition with the most famous of house brands. Write for sample and price list.\n\nROYAL BAKING POWDER Co., 19 Wall St., N.Y.\n\nCHALLENGE\n\nMr. Thompson, of the Ridge, will send his horse \"SLEEPY BEN,\" against any horse in Prince Albert City, for $50, or upwards, which can be arranged by applying to J. F. KENNEDY.\n\nGreat Clearing Sale for Cash.\n\nAt Cost for Fifteen Days.\n\nSHANNON & McLEOD'S\n\nBOOT AND SHOE STORE.\n\nWe have the largest stock of Boots and Shoes in town, consisting of all kinds of Men's Fall and Winter Shirts, Moccasins, Oil Tan Luggage, German Felt Socks, Women's, Misses and Children's Red Riding and Slippers, Ladies' Fine Button Boots and Slippers, Ladies' Fine Lined Skating Boots.\n\nKEPT CONSTANTLY ON HAND\n\nProminently Attended to by Chester Thompson,\n\nGeneral Blacksmith,\n\nRepairing Farm Machinery a Specialty.\n\nJUST ARRIVED\n\nBy latest carts from Troy, a complete assortment of Dry-Goods, Groceries, Crockery, Gents' and Ladies Furnishings, Moccasins, Overshoes, Gloves, Mitts, Fur Caps, and Fur Coats.\n\nAlso a very handsome selection of Xmas and New Year Cards.\n\nO. E. HUGHES & CO.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter,\n\nKNOX & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFURNITURE\n\nJust arrived a new stock of Rockers, Table Chairs, Etc.\n\nCHEAPER THAN EVER.\n\nC. & G. E. CARTER.\n\nDE A. STACKHOUSE,\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nBUFFALO HALL!\n\nCertain business men have just KETCHED UP—\n\n$2.50.\n\nKeep your eye on the prices attached to the balance of our Dry Goods, Fur Caps, Mitts and Mocassins.\n\nWe have the largest range of these goods in town, and they must be sold.\n\nFresh Goods, Butter, Cheese, Lard, Beef, Pork, White Fish\n\nBUY\n\nAmerican Coal Oil.\n\nFORECONOMY AND LIGHT\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE Victor Well Boring & Rock Drilling Machinery.\n\nWe would like all to be prepared to demonstrate the fact. The WELL REPUTED SUCCESS, which has covered our efforts during the past fifteen years, and with EXCLUSIVE use of our MOTTO, we are MONARCH OF ALL in every country in the world. They range in size from 3 Inch to 4 Feet in Diameter and will bore and drill ANY REQUIRED DEPTH. They will bore successfully through solid rock, granite, limestone, shale, coal, etc., and will work in any soil. They are light and simple to operate, easily operated, designed for economy, and as the best and most practical Machine ever made. They are endorsed by some of the best engineers in the world.\n\nProspecting for Coal, Gold, Silver, Coal Oil and all kinds of Minerals.\n\nAnd for boring Artesian Wells and Coal Shafts, &c., are unsurpassed. We also furnish Engines, Boilers, Wind Pumps, Hydraulic Pumps, Fans, Rock Machines, and all kinds of Machinery for Water, Drainage, Dredging, and Machinery of all kinds.\n\nGood Agents wanted in every County in the World.\n\nAddress.\n\nVICTOR WELL AUGER & MACHINE CO.,\n\n511 Pine Street,\n\nST. LOUIS, MISSOURI, U.S.A.\nENTERTAINMENT.\n\nA most successful entertainment was given in the Presbyterian Church on Wednesday evening to the children of the Sabbath School. We do not mention her name, but she appeared in a dress beautifully decorated than on this occasion, it was adorned with fastenings of every kind, the effect being very striking. The children admired with illuminated texts and motions and bright with flags and torches. The interior of the church and the Xmas tree covered all over with an immense collection of bright and valuable gifts, which were hung up with small lamps and Christmas lights. Very great credit is due to all concerned in giving us the entertainment. After an opening prayer and prayer by Spratt was called to the chair, which he occupied with his usual gracefulness and dignity. The children's names were admirably rendered by the choir and also by the children. Then from a reverent silence came the happy strains of the organ. Spratt turned to the children by her fellow worshippers for her faithful and valuable services in connection with the church. We believe the festival was to take the form of a valuable gold necklace; the children were feeling so oppressed. We could not help but see that some of the young bachelors in the congregation were forgetting in the excitement of the gifts, and some amusement was exacted when they gallantly came forward to receive tokens of attention. The children were very charming lady friends; one happy scene was furnished with a handsome puppy who was now given away, we fear too dissimilary to valuable persons. One owner can exhibit his horseback exercise, another can exhibit his horseback exercise, and a third speed his horse in the race. In doing so, he must use a baby bottle to reach the finish line home with affecting solicitude and care, either singly or together, and appropriate gifts were exchanged. The children pleased except one, the jolliest of our bachelors was particularly complimented by Santa Claus, who kindly handed him a gift, and was only confused by the reflection that he had not at any time \"got his own back.\"\n\nMr. T. Swanson arrived back home from the east, where he had been for a short visit, on the evening of New Year's Day.\n\nA party of boys on a ring, with A. R. Brown's name on a club attacked, was hung up by the neck and shaken like water outside of the same. They will come to order by leaving them at the police station.\n\nBIBLE COMPETITION.\n\nThe publication of two newspapers which started the movement in a \"Report,\" consisting of degrees of the leader, number of copies sold, has brought a special commendation. The competition is now open to the following Bible question before the 1st Jan., 1884:\n\nWho will be TEN DOLLARS in gold (not to be divided) to the first person to give five correct answers, one dollar each, and the first person sending the last correct answer, one dollar each, in all eleven rewards.\n\nEach person must send each correct answer on a separate sheet, and will receive by return and a copy of \"the Joshua as a Reporter,\" a handsome book containing the best Canadian and United States press have spoken favorably. Name this paper.\n\nQuarrel. Mr. Miller, a member of the church that John was in, complained to the minister of years Satan was bound, listing by the name of gates in the New Testament, and added that he had seen a silver taken by Adam from Jericho, and other stories of false prophecies, alluded to Moses' case, and asked the reader of Moses' son, and subtract his life from his days.\n\nThe correct answer and names of successful competitors will be published in New Brunswick Examiner, Fredericton, N.B.; Advocate, Fredericton, N.B.; Freeman, Pitts, Manager, N.B. Reporter, Fredericton, N.B. P.O. Box 209.\n\nCARD\n\nStrayed on my premises\n\nTHREE STEER CALVES,\n\nOne mingled red and black, one red, and one white. Please pay proper property, pay expenses and take them away.\n\nALEX. STANFORD,\n\nRed Deer Hill.\n\nTHE LATEST\n\n\"Only a Fancy Museum.\"\n\nOnly a rack of good floors,\nLaws at the Horse Shoe Store.\nThe sack at home is empty.\nMy wife she pays for more!\n\nThe kids they are all agogging,\nFor a sweater, heavier fur.\nOur farmers cannot grow.\n\nStill in that sack of ours,\nWe have a fine old cow:\nStamped on a Dome, a bull.\nThe wheat it is in store;\nAnd under it are half a acre,\nDown at the Horse Shoe Store.\n\nPlum Creek flour, choice groceries, fish,\nFresh butter, beef, pork, etc., always on hand.\n\nT. O. DAVIS\n\nNotice to Creditors.\n\nNotice is hereby given that all creditors and others having claims against the estate of John Fisk, late of Prince Albert, deceased, are respectfully informed that the personal effects, valued at the amount of August last, are now exposed to public sale, at the place of business of Messrs. McLean & Elliott, Solicitors for said Estate. Dated this 23rd day Dec., 1883.\n\nENDURABLE HOME MANUFACTURES.\n\nWASHING MACHINE!\n\nMODE TO ORDER.\n\nPrice $10. Give Credit at a Trial.\n\nWells Sink and Pumps Made.\n\nOrders sent to J. L. Johnson & Co.\n\nNATHANIEL ACORN\n\nPrince Albert.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter\n\nCalaminium and Paperhanging on short notice.\n\nDecorative Painting a Specialty\n\nPUBLIC NOTICE.\n\nAll parties are hereby notified that the undersigned have been appointed by the Board of Education for the erection of the Saskatchewan High School, within the following limits, that is to say, from the southwest corner of the Principal Street, to the southeast corner of the same street, for a vote of the local school district, and that the said school will be erected on the land described above, and will be completed by the first day of January, 1884.\n\nSaskatchewan High School and the Elementary School will commence on Jan. 15th, 1884.\n\nDRY LUMBER.\n\nMOORE & MAGDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $45\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 1 foot extra.\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MAGDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n4TH ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885010201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5745, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3253, 1], [3253, 11183, 2], [11183, 17435, 3], [17435, 24155, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]