[{"id": "9e6f966935b8912c43d4eb6c570954c3eb8e5af0", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SATURDAY, JUNE 20, 1884.\n\nBANKING HOUSE\nNacarthur & Knowles,\nPrince Albert, N.W.T.\n\nLUMBER, SHINGLES,\nDOORS, SASH, MOULDINGS,\nBUILDING MATERIAL,\nALL KINDS OF\nBUILDING STOCKS FOR CASH.\n\nCOURTHOUSE\nPRINCE ALBERT, N.W.T.\n\nCHIT-CHAT LOCALS\nGathered by our Reporters.\n\nThe P.R. had nearly 65,000 acres of land bought up in the last few days in the anniversary of the Queen's Ascension.\n\nTeachers are asked for supplies to the school at Fairview.\n\nConstable Wilton has rejoined the police for a term of three years.\n\nMr. A.M. Burgess, Deputy Minister for Public Works, is present at the Territorial Council.\n\nWe are very glad to place our advertisements in the Saskatoon Review, a new paper started at Saskatoon, Dakota.\n\nMr. Peter Atkinson left for the east yesterday to arrange for the new machinery for his new grist mill.\n\nGladstone's bill has been called a \"joke\" in England. The Conservative papers are terrible in their just vituperation.\n\nMr. J.J. Campbell left this week for Troy with Mr. Wm. Draper, and expects to remain there for three weeks on a trip for his health.\n\nThe reopening of the Methodist church at Prince Albert will take place next Sunday afternoon at 2 o'clock, and all are invited.\n\nAs will be noticed in advertisement, the time for submitting tenders for the erection of the new schoolhouse has been extended to the 1st July.\n\nOmitting the elders, the staff of labor employed in the Provincial School during the past year in Manitoba and the North West was ninety-two.\n\nCapt. Hogg, as advertised, offers $200 reward for information leading to the arrest of any person who shall lead to the conviction of the party or parties who stole his horses.\n\nThe great fire which has recently passed through the greater portion of the town, and the number of fires which have broken out since the erection, which is to be erected immediately.\n\nThe P.R. constable has arrested the Hon. L.M. and Mrs. Clarke, also Dr. and Mrs. Porter, last night for trespassing on private property. They were kindly received and hospitably entertained at both places.\n\nThe last two days August and last, both worthy proprietors, through negligence of a most palpable kind, set on fire a load of hay, starting the house badly. But the proprietors were well paid for their just reward.\n\nMr. Macdonald, M.M.W.C., has been elected president of the Agricultural Society for the best house built here at the Show this year. We hope that he will make good use of his position, and contributing for special prizes, for subjects they take an interest in.\n\nThe new Town Hall, seat of the City Council, has been built this week. It is a two-story frame building, and is being built on a lot presented with the proceeds of the sale of the old Town Hall, being a part of their income towards the establishment of this paper, for which we are grateful proprietors tender their most sincere thanks.\n\nMr. G. Nelson, secretary of the Caledonian games committee, wishes to state that the committee has decided to hold a prize on hand, which he will, on behalf of the committee, turn over to the most successful competitor at the Prince Albert. The secretary also says that he will be happy to receive the balance of the prize from the paper.\n\nThe first prizewinner of the show was held last Monday in a grove on the farm of Mr. J.C. Mackenzie. The weather was fine, and the crops looked very promising.\n\nThree mountain sheep from the Rockies started down yesterday last week.\n\nLast Wednesday a number of men and boys came from the east to explore the straight trail from Troy to here via Caribou and Kirby.\n\nAsh & Robbins\n300 Falls St. Brooklyn, N.Y.\n\nNEW GOODS IN\nMEDICAL HALL\nJAMES HOEY\nPRINCE ALBERT\n\nT. E. JACKSON\nAT THE OLD STAND\n\nNEW SPRING GOODS\nJ. M. CAMPBELL'S\nPRINCE ALBERT\n\nDENTIST\nPRINCE ALBERT, N.W.T.\n\nWM. R. BELL\nPRINCE ALBERT\n\nPRINCE ALBERT TIMES\nPRINCE ALBERT, SATURDAY, JUNE 20, 1884.\n\n$2.60 A YEAR.\n\nPRINCE ALBERT TIMES\nPRINCE ALBERT, SATURDAY, JUNE 20, 1884.\n\n$2.60 A YEAR.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\nPUBLISHED BY\nSPINK & MAVEETY\nJ. D. BARTHOLOMEW\nPRINCE ALBERT, N. W. T.\nTEN CENTS PER YEAR IN ADVANCE\nADVERTISING ACCEPTED.\nIn case any part will be inserted in this paper, Remittance, Post Paid.\nAll letters to be addressed to the Proprietor.\nOUR NORTHERN WATERS.\nMr. Charles N. Bell has written a most interesting book, at this time, on our northern waters, being a report most ably drawn up, regarding the Hudson's Bay and Straits, for the Winnipeg Club of which Mr. Bell published it for them. The subject is handled in a concise and clear manner, enumerating the resources in minerals, fisheries, timber, furs, game and other products. Also copious notes on the navigation, together with historical events and meteorological and climatic data. Mr. Bell says—\"It does not seem to be generally known that the provisions bodies of the British regular troops have been brought from England in sailing vessels through Hudson's Straits and Bay, landed at York Factory, and proceeded by land to Fort Garry. In 1846, 353 persons arrived at York Factory on the 7th of August, and proceeded on to Fort Garry, which they reached in thirty days time, without any casualties. Thousands have traveled by this route in perfect safety, and it speaks volumes in favor of the safe navigation of our northern waters.\"\nThe country is stated to produce wheat, red and pitch pine, black and white spruce, balsam, larch, white cedar and white birch. Which could be easily shipped by sea-going vessels as the northern waters converge to meet the head of James Bay.\nIn 1875 large deposits of rich ironstone was found on the Mattagami River, also at various times and places inexhaustible supplies of manganiferous iron ore, lead, copper, gold, silver, molybdenum and copper were also noted on the east main coast. Lignite, gypsum and petroleum bearing limestone was met with. Good building stone, clay and lime stones are on both sides of the Bay and many other minerals too numerous to mention here.\nBesides the whale, cod and salmon fisheries, the waters of Hudson Bay, and the river Mattagami, contain abundant stores of oil-fisheries and edible fish. Dr. Bell reports finding the pike, perch, herring, whitefish, trout, sea trout, sculpin and eel, bear, moose, trout in their proper waters. White porpoise abound, and the walrus and narwhal are killed in considerable numbers.\nIn conclusion Mr. Bell says—\"We have here a very fine Dominion, an immense inland sea, which never freezes over, and is open for navigation for at least five or six months, if not during the whole year. This great body of salt water has everything that is a large number of stems, many of which are navigable by large river steamers for long distances inland; they are well stocked with the finest edible fish, plenty of game, plenty of fish, and plenty of timber, much of which is valuable for export. The islands of the Bay and many localities on the mainland are rich in mineral deposits, ready for immediate exploitation. Feathers are so plentiful, that at a single nest 50 eggs are killed in the autumn, as the year's supply. Vegetables are raised at all the forts in the southern part, and at some of those in the north. Horses, cattle, etc., are kept, and an abundance of food is available.\"\nAt present these harbors are frequently visited by ships, and for years sailing vessels of all descriptions from the pinnacle of twenty tons to the seventy-five gun man-of-war have been seen in these waters passing through the straits and across the Bay. Should we not, as Canadians, anxious for the full development of the great natural resources of our country, take what nature offers to us freely, and make use of her bountiful gifts?\nA NEW INDUSTRY.\nA new industry bids fair to start up in Montreal connected with the export meat trade. A number of capitalists have studied the manner in which beef specially prepared for the English market is sent from England. A few days ago twenty bullocks were slaughtered at the Dominion abattoir, and their carcasses prepared by the new process, and shipped to the old country. If this method should prove a success, it is the intention to form a company in Montreal, whence large shipments of both beef and mutton prepared fresh by the new process, will take place. Not only is Great Britain, but distant stations on the C. P. R., that Company having promised large orders for the supply of meat employed in the line of the railway, in the line of the way places, where fresh meat, and especially beef, is now difficult to procure. The process is kept a profound secret at present.\nAs a result, presumably, of agitation against perpetual imprisonments, the British Government have arranged with the Duke of Marlborough to commute for $10,000 annually to the Duke of Marlborough a pension of $4,000, which was originally granted to the victor of Waterloo, which has been paid annually to the Duke of Marlborough for 174 years. At the same time a pension of a like amount, which was granted to William Penn for services rendered, has been commuted by a payment of £67,000 to the present representatives of the family.\n\nJAMES SINCLAIR\nMerchant Tailor,\nand Dealer in\nGENTS' FURNISHINGS.\nWATCHES,\nCLOCKS,\nJEWELLERY,\nSTATIONARY.\n\nR. B. WAY,\nCHESTER THOMPSON,\nGeneral Blacksmith,\nNext to the Hudson's Bay Store.\nRepairing Farm Machinery a speciality.\n\nFIRE! FIRE! FIRE!\nPUMP ON WATER.\nWells sunk and Pumps made and repaired.\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\nNATHANIEL ACORN\nPrince Albert, Sask.\n\nPUBLIC NOTICE:\nAll persons are hereby required to be at the office of the Receiver of the public lands within twenty-four hours from the publication of the last notice to the effect that the Receiver of the Public Lands is prohibited by law, and all timber so cut must be sold at public auction, and to be dealt with as the Minister of the Interior may direct.\nSuch settler on a homestead quarter section who has not made an application to the Local Agent of Dominion Lands for a patent, exceeding twenty acres in extent, as of November 1st, 1883, will be liable to be removed from his land.\nAny person other than a homestead settler purchasing land is to be made to pay the taxes thereon to the Minister of the Interior, who will deal with such matters as he may see fit.\nPersons who have already sold their unimproved quarter sections of land to the Crown Timber Agent or his agent, and who have not advertised the sale of the land, will be liable to be removed from their land.\nD. J. WAGGONER,\nCrown Timber Agent.\n\nFURNITURE\nJust arrived, in addition to our former stock, we have recently received:\nFancy Parlor and Bedroom Sets.\nGive up a chair and get one Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all Descriptions.\nCradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\nG. & G. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nTHOS. POWERS,\nCONTRACTS\nBrick, Plastering and Stone Work.\nBrick and Lime always on hand.\nAsh & Robbins,\nHardware Co., Newmarket, N.Y.\nCOMMUNICATIONS.\n\nIt does not fall within our province to make any statement regarding the contents of the Presbyterian Record.\n\nTo the Editor of The Times.\n\nSir,—In your last issue I notice part of an article which appeared in the Presbyterian Record maintaining an attitude upon church matters of that denominational body in North West Canada. I am sure that every one in the same situation, thinks that if the authorities of that body instead of allowing the members of that body to be bullied by their reporters, were to turn their attention and endeavor to maintain the best possible relations existing between the Home and Foreign Mission Committees, and obtain the proper recognition of the claims of those who have valid titles to the lands sold by them, it would be much more satisfactory to the general public and more in accordance with their sense of justice.\n\nYours obediently,\n\nP. B. DOUGLAS.\nOttawa, June 3, 1884.\n\nTERRITORIAL NEWS.\n\nLOT OWNER.\n\nTo the Editor of The Times.\n\nSir,—Regarding unwilling to engage in newspaper discussion, I must ask for patience to make a few remarks on an article which appeared in your paper in the last issue of your paper.\n\nI wish to state very distinctly that the Presbyterian Church at Prince Albert are not to be held responsible for a thoughtless expression, which happened to be published about Edmonton, and by so doing, has caused the most serious damage to a journal published in Montreal. The writer of that letter received nothing but condemnation from all quarters, and was living here. The Presbyterians of Prince Albert have no feelings but those of regret over such a mistake, and have been connected with the College, and still deeply regret if in any way expressing themselves, they have injured or impaired the good name of your paper.\n\nIt is very absurd for any one to express, that in any locality, whether in the Western Territories, should be equal to those of older foundation, richly endowed, and fully equipped for the work required by the supporters of that body. Continental colleges may compare favorably even with those of the Eastern provinces; but that fact, however, is certainly borne high testimony to the energy and spirit of those who brought it into existence, and who are still engaged in, within its walls, the work of higher education.\n\nIn reference to the school which the Presbyterians are now undertaking to establish in the town, I may say that I am not aware that any other school in the town could be called \"school,\" or superior to any other institution of the same kind. We expect, if successful, in a very short time, to begin the modern teaching as far as work as possible with the pupils who may come to us, and we shall feel very proud of our success. I quite evidently see that no true Presbyterian amongst us will ever fail to give expression to the views which he holds, and I am glad by the reporter, \"thinking God that we or our institutions are better than our neighbors.\"\n\nWhen the Presbyterians here afford assistance to the members of M.M.C., and do not try to force their own opinions and demands from their (local) Assembly in order to establish in the town a school which will be attended by students from throughout the district, I do not think they need be afraid that any of their fellow citizens will oppose the continuance of these efforts, as they are found in such a style in the local newspapers.\n\nP.M. MacWILLIAM.\nPrince Albert, June 10, 1884.\n\nThe statement appeared in the Presbyterian Record, and was directed against the Presbyterian Church, therefore those who are responsible for circulating it are fools and liars. It has been officially denounced by us, it would appear, and is most uncharitable. Our paragraph refers only to the Presbyterian Record, and pertains to the contents thereof, and we are assured in a number of the clubs. The above explanatory letter shows how unnecessary it was to publish the first, and we are sure that no alliance being made to our fellow citizens, or contempt was shown toward any member of the North West press, as when we will help a friendly eye.—Ed.\n\nTIMBER DUES.\n\nThe following answer to a letter sent by the Hon. Lawrence Clarke, of North West Canada, regarding the granting of free passage to his wood, has been held up as an indication:\n\nTo the Hon. Lawrence Clarke, Prince Albert, Sask.\n\nSir,—Your letter to the Minister of Interior, dated June 6th, respecting the desirability of granting to actual settlers free permits to cut wood in the Dominion, was kindly answered by me, and the reply was duly received in this Department, but I find that by some oversight, the reply was not delivered to you. The Crown Timber Agent at Prince Albert has, nevertheless, been instructed to report on the subject for the information of the Minister.\n\nI have the honor to be, Sir,\n\nYour obedient servant,\n\nP. B. DOUGLAS.\nOttawa, June 3, 1884.\n\nPORTAGE LA PRAIRIE.\n\nFrom the Harbour, June 6.\n\nThe date for holding the blue ribbon contest for this place has been fixed for the 29th inst.\n\nMerchant report that business was much better than usual, and that it was the best season in years for lumber.\n\nThe M. & N. W. Ry. Co. have started their staff of section men, engineers and clerks, pending the reopening of one division.\n\nThe assessment of the town for this year will be about $5,000. The value of the assessed property is $10,000. The population this year is 2,500.\n\nAn important meeting of the directors of the M. & N. W. Ry. Co. shortly after the opening of the season, has definitely ordered that an additional one hundred miles will be built this year near here.\n\nGreat harvest is being done to garden plants by a dark colored grub in this locality.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nPowder, Shot, Shells, and Gun Caps.\n\nGarden Tools, Glass, Cut Nails and General Shelf Hardware.\n\nAt\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL.\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nBoots and Shoes — G. D. Northgraves.\n\nWatchmaker and Jeweller.\n\nCustom Work — William Cross.\n\nRepairing — Shannon & McLeod.\n\nBuffalo Hall!\n\nParties concerned will please take notice that overdue accounts on our books have been closed, and will now be placed in the hands of our solicitors for collection.\n\nFrom this date we propose devoting our attention to prompt-paying and cash customers, and will be prepared to offer them reliable goods at prices in keeping with the times.\n\nA FULL STOCK OF\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nPUMPS\n\nAnd always on hand at greatly reduced prices.\n\nSHANNON & MCLEOD.\n\nReporting Promptly attended to.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884062001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4303, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4034, 1], [4034, 11194, 2], [11194, 11194, 3], [11194, 17956, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]