[{"id": "3bc33e950f2edae7962fc3d57e711764aed5d320", "text": "DOMINION OF CANADA.\n\nGOVERNMENT HOUSE, OTTAWA.\nMeadow, the 5th day of September, 1894.\n\nPAPERS.\n\nHIS EXCELLENCY THE GOVERNOR\nGENERAL IN COUNCIL,\n\nWHEREAS the disease of swine pests,\nparticularly the swine pest carried east\nin the Western State of Illinois well as\nin Texas, is now established in several\nStates, and there is reason to believe\nthat the same will shortly be spread to the\nWestern States and Territories;\n\nBe it therefore enacted by the Senate and\nHouse of Commons of Canada, that it\nbe alleged by section 52 Victoria, chapter 23, to\nthe Act providing for meat inspection, that the\ndiseases attached to the swine pest, and other\npests of warm victims may be considered\nas amongst the category of diseases affecting\nanimals subject to control by the North West\nTerminatives\n\nHis Excellency, by and with the ad-\nvice of the Senate and House of\nCanada, has been pleased to order and it is\nhereby ordered by these presents-\n\n1. No swine or swine eggs from any\nsettlements in Canada without proper\ncertification, accompanied by a receipt\nfrom an identified veterininarian or\nagriculturist, shall be allowed entry into\nany province or territory nor be permitted\nto enter any premises in any province or\nterritory. All such swine or swine eggs\nexcepted to anytime by law, regulations,\nor orders of the federal government, or\nof any province or territory, must be\nadjourned in accordance with the regu-\nlations of the federal government or\nof any province or territory.\n\n2. No pork or pork product except-\ning only such as is ordered by law, regu-\nlations, or orders of the federal govern-\nment, or of any province or territory,\nmust be imported or used within any\nprovince or territory unless it is accompa-\nnied by a certificate of inspection issued by\na recognized veterinarian.\n\n3. All广告 contain-\n\n🐝\n\nBANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nPrince Albert's Bankers,\nChartered Bankers.\n\nTHOS POWERS, is prepared to take\nCONTRACTS for\nBrick, Plastering and Stone Work.\nAll orders promptly attended to.\nCall immediately.\n\nJ. H. Thomson,\n& Ornamental Painter\nRobert Thomson,\nDecorator. Painting Emphasis\n\nBURRICK BLEED BITTERS.\nWORDHEAL GLEEM TIGHT.\nBURRICK PILLS,\nFIOERICA HYPOPHOSPHATE.\nVICTOR'S ACICOH AND 出片 WORM POWDER,\nBLACK OIL.\n\nMEDICINE HALL.\nBurriker, Bled Bitters.\nBURDROP HEALING QIINTEN.\nBURRICK Pills.\nVictoria Hypophosphite.\nVictor's Acicoh and Uva Ursi Worm Powder.\nBLACK OIL.\n\nT. W. JACKSON,\n\nAt the Old Stand.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETTY\n\nPRINCE ALBERT, N.W.T.\n\nTERMS—50¢ per copy in advance\nIn case will be inserted in this paper for 10¢ per month.\n\nAdvertisements without instructions will not be accepted.\n\nAll letters to be addressed to the Proprietors.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 o'clock—The Rev. Mr. Bishop, the Bishop of St. Paul.\n12 noon—His Lordship, the Bishop of St. Andrew.\n1 p.m.—His Lordship, the Bishop of St. James.\n12 noon—The Rev. Principal Field.\n12 noon—The Rev. Mr. Parker.\n1 p.m.—The Rev. Mr. W. Wright.\n12 noon—The Rev. Mr. J. Prichard.\n12 noon—The Rev. Mr. Sinclair.\n12 noon—The Rev. Mr. Hill.\n12 noon—The Rev. Mr. Parker.\n12 noon—The Rev. Mr. Parker.\n12 noon—The Rev. Mr. Parker.\n12 noon—The Rev. Mr. Parker.\n\nFRIDAY, NOVEMBER 28, 1884.\n\nSECTARIANISM.\n\nExperience is daily furnishing fresh though unnecessary proofs of the fatality of expecting that men in general will govern their conduct by any standard, intellectual, moral or christian, when it opposes the furthest interests of themselves or their own grasping greedy ends or for the due inflation of their all absorbing self importance. It is none the less amazing to find men who are as pure and uncorrupted by the evil creatures in matters spiritual or political in the last quarter of the nine-teenth century, deliberately for their own selfish ends, setting to fan into a flame the very feelings, although sometimes smothered, of the spirit of sectarian feeling. It would be a doubt a chimerical and utopian hope, that men would enter upon this great undertaking in the North West Territories—taking as its point of a fresh departure, those accumulated results of the experience of the world's history, sufficiently to act upon the ethical standard of aiming at the practical end to the greatest number, or the greatest degree of christianity to love our neighbours as ourselves, but we cannot understand the nature of those men, who professing superiority, are introducing the elements of religious discord into the fabrics of our history. Of the several instances of this most pernicious conduct at present painfully conspicuous, we now concern our selves with the recent attempt made by Riell—whether an unassisted emanation of his own peculiar intelligence, or the reflected intelligent consciousness of some other individuality we know not—on behalf of the French Catholics, for a grant of at least $1,000 for the establishment of an institution to be conducted by the nuns in each half-breed settlement. In getting them the same treatment as their brethren received in Manitoba, they would readily co-operate, but we unhesitatingly condemn the strong sectarian character disclosed in this. That the sectarian flavor has been deliberately imparted is obvious from the fact that the demand is in addition to one for schools, hospitals and such like institutions (whatever that may mean). The idea entertained by many that this is part of a good deal thrown in to keep the half-breeds in line, leaving ample margin for reduction on the whole demands, seems to be precluded by the fact of its being deemed worthy of a separate clause containing nothing else. As far as the proposal is an absurdity, and has either been prompted by those who, while anxious to keep in the background, yet hope to reap the profit of it, or else has been suggested by the business of Riell's own mind, as a likely means of eliciting sympathy with the movement among the Roman Catholic supporters of the Government in the east, whatever the intention behind the over the idea originated, it has very considerably succeeded in killing out the sympathy of the general public, and is just another instance of how greed and cunning will over reach every thing, and will even go so far from merely from an abstract sense of justice or love of fair play, would willingly have aided the half-breeds in the Territories to equal justice with the other Manitobans, are now the only ones who can be trusted with this one. It is naturally asked why any special grant should be made by the state to a denomination which so far as we know, has never been in the Territories materially a weak one. Surely the whole tendency of the age is against anything of this character. Is the recent dis-establishment of the church in Ireland, or the attempted dis-establishment coming late of a state church in France, or if the French prefer an example from their own mother country, the attitude of the state to the church in Germany, an indication that these things are here to remain? Are the half-breeds of other denominations to be left out in the cold? Should them movement of the ritualists fail fast over running a neigh-bouring province, spread over our own and religious differences following in the wake of these English Church priests—why should they not receive support? Apart from its sectarian aspect, we are determined that the French are not good for the territories, knowledge of the probable require-ments of the country for long enough would lead us to suggest that when enough of bishops to teach in schools and doctors in hospitals have been provided, and enough funds have been devoted to the importation of wives, who will remember the divine in-junction \"Be fruitful and multiply,\" then all the rest will be addressed to the sufferers of the flood as they stepped forth from the ark.\n\nTHE FLOGGING OUTRAGE.\n\nFrom the commotion which recently occurred in Winnipeg over the disgraceful and disgusting outrage of rape committed on a prisoner for doing nothing but undress the opportunity being furnished by the carelessness of his guards—and for which they would have been liable to suitable re-acts, and parsimonious judged necessary under the circumstances—there is a good deal of comfort to be derived. It must be a matter of common sense to those who take pride in the Saxon blood in their veins to think that whenever the opportunity occurs, our countrymen can be depended upon to make use of every legal means to express their abhorrence of any outrage or attempt at interference with the liberty or right of the subjects, even should some of them, as in the case in point, be the fault of the individual held in lawful abeyance. It should furthermore be a matter for sincere rejoicing to find the press doing their duty to the public in fully ventilating a matter which ought to be known throughout the world have handled up so utterly discreditably to their city could their consciences have approved such a course. One more ground of pride might perhaps be found in the conduct of the people justly angered as they were did not lower the dignity of their expression of opinion, by one single lawless act. In the presence of so much that was justly deserving as a matter for contemplation it is incumbent to find something of an entirely opposite character, we mean the calling out by the authorities of a military force upon the occasion. It may be that the absence of the abnormal state of the provocation may have induced the expectation of really violent proceedings on the part of the people but even under such an aspect, different views may be taken. The shedding of the blood of justly and rightly incensed people, in defence of the instigators, could be justified. The law we take it is the will of the people put into force for better or for worse, as a whole, and there are occasions where rare ones, upon which the people are justified in temporarily superseding the ordinary machinery and taking it into their own hands, the spirit of the occasion and the authorities may be very thankful that the people had too much self respect, in addition to the coolness with which they faced a force of constitutional rights to accept what certainly looked very like a challenge. Perhaps those responsible for the ap-pearance of a military force addressed to the sufferer of the outrage are not good for the territories.\n\nPUBLIC NOTICE.\n\nAll parties are hereby notified that the undersigned, Mr. R. J. Molloy, Solicitor, has been engaged for the erection of a school building at the School District.\n\nR. J. MOLLOY.\n\nClark's Crossing, Oct. 29, 1884.\n\nO. E. HUGHES & CO.\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and Youths Clothing.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING ON HAND.\n\nPRINCE ALBERT Planting Mills and Saw and Door Factory.\n\nHORSE AND MACLAY STS.\n\nThe comité assemblez recueillir les suffrages des électeurs le vingt-huit de décembre, 1884.\n\nVingt-huit de décembre, 1884.\n\nPour autant à cette petite ville, un lieutenant-général de la police municipale est une loi. Les officiers de police municipale sont des officiers de police municipaux et ils ont le pouvoir de faire exécution de toutes les lois qui sont établies par le conseil municipal. Si un officier de police municipale est arrêté pour une infraction à une loi, il peut être poursuivi par le procureur général du district. Si un officier de police municipale est arrêté pour une infraction à une loi, il peut être poursuivi par le procureur général du district.\n\nChas. E. Page.\n\nNEW STUDIO\n\nEAST END.\n\nPETER SMITH,\n\nBaker and Confectioner.\n\nAll kinds of Iced Cakes Made to Order.\n\nThe Best Bread West of Winnipeg.\n\nTERMS STRICTLY CASE.\n\nThe Dominion Organ and Piano Co.\n\nDEALERS IN ALL KINDS OF Boots & Shoes, Rubbers, Etc.\n\nSHANNON & McLEOD.\n\nStrayed cat to my premises about the middle of June.\n\nTwo spring calves, Red, one heifer and one bull. Owner lost them. Property, pay expenses and take them away.\n\nWILLIAM HODGSON.\n\nWater Mill.\n\nW. R. GUNN, M.A.\n\nBarister, Solicitor, Public Commissioner.\n\nLands bought and sold. Money invested.\n\nAgents for W. F. Watson & Co., Ltd.\n\nPRINCE ALBERT.\n\nSHANNON & McLEOD.\n\nDEALERS IN ALL KINDS OF Boots & Shoes, Rubbers, Etc.\n\nSHANNON & McLEOD.\n\nPublic wanted to see the same colouring which came on the harness of the subscriber two days ago on six other strange horses.\n\nIf horseman seen within thirty days from the date heard, the animal will be sold to pay expenses.\n\nR. J. MOLLOY.\n\nClark's Crossing, Oct. 29, 1884.\n\nO. E. HUGHES & CO.\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and Youths Clothing.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING ON HAND.\n\nPRINCE ALBERT Planting Mills and Saw and Door Factory.\n\nHORSE AND MACLAY STS.\n\nThe comité assemblez recueillir les suffrages des électeurs le vingt-huit de décembre, 1884.\n\nVingt-huit de décembre, 1884.\n\nPour autant à cette petite ville, un lieutenant-général de la police municipale est une loi. Les officiers de police municipale sont des officiers de police municipaux et ils ont le pouvoir de faire exécution de toutes les lois qui sont établies par le conseil municipal. Si un officier de police municipale est arrêté pour une infraction à une loi, il peut être poursuivi par le procureur général du district. Si un officier de police municipale est arrêté pour une infraction à une loi, il peut être poursuivi par le procureur général du district.\n\nChas. E. Page.\n\nNEW STUDIO\n\nEAST END.\n\nPETER SMITH,\n\nBaker and Confectioner.\n\nAll kinds of Iced Cakes Made to Order.\n\nThe Best Bread West of Winnipeg.\n\nTERMS STRICTLY CASE.\n\nThe Dominion Organ and Piano Co.\nMOOSE JAW\n\nFrom our own correspondent.\n\nCorp. Officer has been transferred to P. Division and is now stationed at Regina.\n\nThe weather here is very cold and unpleasant; the ground is covered with snow.\n\nThe creek in solidity frozen over and its glassy smoothness is attracting numbers of skaters who are enjoying themselves, displaying their prowess on its surface.\n\nThe severity of the weather and the utter barrenness of the country, which has been so richly endowed by nature's bountiful gifts, has driven an abandoned party into the \"valley of the Moose Jaw Creek.\" Fourteen chickens, two cows, a number of sheep and cattle and a few dogs have been ventured to meet there on a lonely stretch of this centre of civilization.\n\nMr. W. Hering Cooper, a few days ago killed near Caron a magnificent specimen of the wind swan.\n\nWhile skating on the frozen creek a little girl was swept away, disappearing amidst almost every train arriving from the east.\n\nMr. Purves joined here from the west with 300 steers bound for Winnipeg. The cattle were purchased from Mr. Craig of the Otago district.\n\nTwo or three prospectors round Buffalo Lake at present; numbers having been shot.\n\nLast week about 1,000 head of cattle passed westward on the trail from Moose Creek by the C. P. R. to Chicago.\n\nOn Thanksgiving Day the Methodist and Presbyterian churches had a joint service in the church hall.\n\nMr. Roy, D.L.S., and party arrived here on the 5th inst. They have been served by the Government agent at Bathurst. Their cattle have been stored here and their horses sent to be wintered in the vicinity of the Moose Jaw River.\n\nOn the 6th inst. a post office was opened at Caron, sixteen miles west of Moose Jaw.\n\nOn the 8th inst. acting Sergt. Major Gordon from Regina passed west for Calgary and Fort Macleod on special duty.\n\nOn the 4th inst. hospital Sergt. Wilson passed through here on Fort Macleod where he is to be stationed.\n\nCol. Irving, accompanied by Inspector Samuels arrived here on the 11th inst., via Caron. His journey from Bathurst to Swift Current was not accomplished without considerable trouble. The river was rising deep round the island and the ferry boat was delayed. Col. Irving decided to make the journey on skates. Next day after leaving all signs of life were visible, but the river was still rising and the ferry boat was delayed. This was an impossibility; however, a body of freighters were met with, the journey was continued and the journey was completed. Until half the distance was done, when a police wagon was found, which had been delayed by the last detachment of the militia. This was promptly requisitioned and everything went well until the South Saskatchewan was reached, where their disappointment was great. The ferry dropped up high and dry on the opposite bank, and the ferry men went to work to get it off. The ferry was then done by means of a small canoe; the horses swimming across, and the wagons and goods being taken across by hand to the other side after repeated trips. This was their last difficulty, the remainder of the journey being done without any delay.\n\nA new grain mill is in course of construction. It is erected by Mr. A. E. Ogden and will be a great convenience to the stock. This ought to be a great boon to the farmers in this vicinity.\n\nMr. Roy is about to start a skating road on the frozen creek.\n\nOn Tuesday evening, the 11th inst., Mr. and Mrs. Sealey gave an oyster supper to the frequenters of the skating hall. An excellent time was enjoyed, the supper finishing with an old fashioned tally pull.\n\nMEDICINE HAT.\n\nFrom our own correspondent.\n\nMr. Sutherland shipped 300 head of cattle to Winnipeg. Mr. McLeod has also come from the Mole Lake Ranches and Mr. Medicine Hat is the nearest point of shipment for a large number of cattle.\n\nThe famous Moose Jaw Mine is working in full blast now, over 80 hands are employed, more being taken on every day.\n\nA special train with Mr. Egan and Party passed through here on Monday, the inglenook at the end of the track.\n\nOn Thanksgiving Day the weather was almost tropical warm the thermometer standing at 70 degrees in the shade at noon.\n\nMr. W. Smith, M. P. P. for Brandon, has been here for several weeks arranging for the winter supplies of the Saskatchewan Mines.\n\nMr. J. M. Guthrie, has removed his residence from Main to Ingram Street.\n\nThe proprietors of the American Hotel gave a ball on the evening of the 15th inst., to celebrate the opening of the hotel. It was highly attended, and all were pleased.\n\nInspector McMillan, who is under orders from Regina, arrived here on the evening of the 15th inst., from Regina.\n\nInspector Murray, N.W.M.P. Calgary, arrived here for Regina where he had to be stationed.\n\nThe Citizens gave a ball on the evening of the 15th inst., in the N.W.M. P. Barracks. Over 150 people were present, dancing, eating, drinking and enjoying themselves. The ballroom was filled with the most elegant of society, and the most charming of the officers, gave the scene a peculiar charm to the onlooker.\n\nThe weather continues to be very fine, and the atmosphere is warm enough to make tea very delightful in summer clothes a pleasant pastime.\n\nSwelling Fits—Symptoms and Cure.\n\nThe symptoms are moderate, like peritonitis, intense itching, increased by scratching, very difficult to cure, particularly in children. The best treatment is keeping cool and on the rectum; the private parts are sometimes affected. If the patient does not improve, the following may follow. SWAYNE'S OINTMENT is a very safe cure. Also Tincture of Ipecac, Bitters, Heat, Epsom Salts, Barberry Root, Bitters, all locally, croton Oil, Bitters, Bitters, Bitters. SWAYNE & SON, Prince Albert.\n\nJ. W. Campbell\n\nHas just received a complete and well selected assortment of Shirts, Shawls, Shetlands, Blankets, Ready Made Clothing, and Underclothing.\n\nA full line of GROCERIES.\n\nPRATT'S ASTRAL OIL, which, for comfort, safety and brilliancy, excels anything in the market.\n\nPRICES TO SUIT THE TIMES.\n\nJ. M. Campbell\n\nFURNITURE\n\nJust arrived a new stock of Rockers, Tables, Chairs, Etc.\n\nCHEAPER THAN EVER.\n\nC. & G. E. Carter\n\nEAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\n\nAll kinds of Bread and Pastry Made.\n\nHugh McDougall\n\nEast End Bakery.\n\nPRINCE ALBERT, SASK.\n\nPUBLIC NOTICE.\n\nCOAL OIL.\n\nBUY\n\nAmerican Coal Oil.\n\nFOR ECONOMY AND LIGHT\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. Johnson & Co.\n\nBuffalo Hall!\n\nIt is rumored that certain merchants are angry with Buffaloes Hall for refusing to enter into a combination for raising the price of Groceries.\n\nBUFFALO HALL IS STOCKED WITH\n\nFresh Fruits, Teas, Sugars and Tobaccos\n\nALL SELLING AT HEAVY DISCOUNTS.\n\n$7.50 SUITS\n\nTake to Cracker Box.\n\nThe public can't understand why the Best American Head Light Coal Oil can be secured at Buffalo Hall for the same price as inferior articles sold elsewhere. The reason will be given in our regular advertisements next week.\n\nBITTS & Gwynne.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE\n\nVictor Well Boring & Rock Drilling Machinery.\n\nWe respectfully call your attention to the fact, THE WELL MERITED SUCCESS which has crowned the efforts of Mr. Victor, and the fact that EXCELLENT FOR OUR MOTTO, we are MONARCH OF ALL in every county in the world. We are the only company to offer Man, Horse or Steam and work at any depth. They range in size from\n\n3 Inch to 4 Feet in Diameter\n\nand will bore and drill ANY REQUIRED DEPTH. They will bore successfully and permanently in all kinds of Earth, soft Sand and Limestone, Bituminous Coal, Anthracite, Lignite, Oil Shale, Oil Sands, Granite, Sandstone and Carboniferous Rock, and guaranteed to make the very best of Wells in Quick Sand. They are the only machines that can be used in any kind of soil, and are considered as the best and most practical machines known. They are endorsed by some of the highest State Engineers.\n\nProspecting for Gold, Silver, Coal Oil and all kinds of Minerals.\n\nAnd for all purposes of Irrigation, Railroad Coal Mines, &c. they are unequalled. We also furnish Engines, Belters, Wind Mills, Hydraulic Rams, Horse Power, Brick Makers, Mine Tools, Portable Forges, Gas, Iron and Machinery of all kinds.\n\nProspectors wanted in every County in the World.\n\nAddress, VICTOR WELL AUGER & MACHINE CO.,\n\n511 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nState in what paper you see this.\nCOMMUNICATIONS.\n\nWe are held responsible for the views expressed by our correspondents.\n\nOUR GRIEVANCES.\n\nTo the Editor of The Times:\n\nSir—At your request I will publish grievances which have been brought to my notice, and as far as possible I shall deal with them in order that they may be remedied. All complaints are not equally important, but those which affect the welfare of the community are worthy of attention.\n\nI have received a complaint from a citizen who has been wronged by the actions of another citizen. This citizen has been deprived of his property without just cause, and he demands justice. He has been refused compensation for his losses, and he now seeks redress through the medium of the press.\n\nI urge all citizens to take advantage of this opportunity to bring their grievances to light. It is only through such action that we can hope to see improvements made in our community.\n\nD. CAMERON.\n\nPUBLIC NOTICE.\n\nWe hereby give notice that we are engaged in the construction of a new building at the corner of Main Street and Second Avenue. The building will be completed within the next six months.\n\nTHE PRINCE ALBERT TIMES\n\nThe Prince Albert Times is the best medium in the Territory to advertise your business. Advertise in The Times and you are certain to succeed in your business. Subscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVEETY, PROPS., RIVER ST., PRINCE ALBERT, SASK.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWells Sunk and Pumps Made and Repaired.\n\nThe Best HEATERS and CHIMNEYS of the finest quality are now being installed throughout the city.\n\nNATHANIEL ACORN, Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDONALD\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings at cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDONALD\n\nNEW MILLINERY\n\nFANCY GOODS,\n\nWOOL GOODS,\n\nLADIES CLOAKS,\n\nFUR MUFFS,\n\nCAPS,\n\nMISS MACKAY & CO,\n\nCAMPBELL'S BLOCK,\n\nTHE GABLE HOUSE,\n\nASH & ROBBINS,\n\nCONSUMPTION,\n\nPositively Guaranteed.\n\nJOHN WYMERSONE, PROP.\n\nASH & ROBBINS,\n\n319 Main Street, Saskatoon.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThe Powder never cakes. A matter of purity strength and wholesome flavor.\n\nThe Powder is guaranteed to be pure and cannot be sold in competition with the most famous of local brands.\n\nRoyal Baking Powder Co., 10 Wall St., New York.\n\nPills, Epsom, or Falling Stitches.\n\nPERFECTION CURVED SHOEMAKING.\n\nGentlemen's Curved Lasts for Shoes.\n\nOur last lasts are guaranteed to fit perfectly and will not require any alteration.\n\nAddress\n\nASH & ROBBINS,\n\n319 Main Street, Saskatoon.\n\nMISS MACKAY & CO,\n\nCAMPBELL'S BLOCK,\n\nTHE GABLE HOUSE,\n\nASH & ROBBINS,\n\nCONSUMPTION,\n\nPositively Guaranteed.\n\nJOHN WYMERSONE, PROP.\n\nASH & ROBBINS,\n\n319 Main Street, Saskatoon.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884112801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 6209, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2451, 1], [2451, 13626, 2], [13626, 22292, 3], [22292, 25490, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]