[{"id": "0eaae42debd0e33f5cdda6f9a7204c124ab0430e", "text": "THE PRINCE ALBERT TIMES\n\nRAILWAY CONSTRUCTION\n\nThe Winnipeg Sun says—\"There will probably be considerable railroad construction in the Canadian Northwest during the coming year, and it is likely in this respect to keep pace with our neighbors to the south of the line. In the opinion of the paper, there is no possibility that what will be attempted, but it is reasonable to count on a further extension of the Great Western and Northwestern lines, with considerable probability of substantial progress on the H. R. Railroad and the completion of the line from Winnipeg to the United States boundary. In fact, the expectations now being held out are reasonably hopeful, and there can be no doubt that 1879 will be the greatest year of railroad construction in the history of the Province. The government has been doing its best to make it so.\"\n\nIn the meantime, however, we cannot help but feel that there is still much to be done.\n\nCOMMUNICATIONS.\n\nT. J. A. NEWTON'S\n\nMUSICAL INSTRUMENTS\n\nAccordeons, Harmonicas, Violins, &c., &c.\n\nLATEST NOVELTIES IN TOYS,\n\nWHICH FOR THE NEXT WEEK I WILL SELL\n\nAT COST FOR CASH.\n\nA.C. PATTERSON,\n\nForwarding Agent.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 102-104 N. Dearborn St., Chicago, Ill.\n\nOver 6,000,000 Circulation\n\nFERRY'S SEEDS\n\nFRIDAY, MARCH 25, 1887.\n\nAMERICAN COAL OIL\n\nT. J. A. NEWTON'S\n\nT. N. CAMPBELL\n\nJUST RECEIVED A LARGE STOCK OF\n\nMUSICAL INSTRUMENTS\n\nAccordeons, Harmonicas, Violins, &c., &c.\n\nGames of all kinds. Progression Board with Tally Cards, Gold and Colored Stars complete. Chess, Checkers, Dominoes, and a large variety of Board Games.\n\nAlso a small stock of\n\nLATEST NOVELTIES IN TOYS,\n\nWHICH FOR THE NEXT WEEK I WILL SELL\n\nAT COST FOR CASH.\n\nA.C. PATTERSON,\n\nForwarding Agent.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 102-104 N. Dearborn St., Chicago, Ill.\n\nOver 6,000,000 Circulation\n\nFERRY'S SEEDS\nTOWN COUNCIL\n\nThe Council met in the Council Chamber on Monday evening last.\n\nPresent—Mayor Macartney, and Councillors Stewart, and Beaton.\n\nMinutes of the last meeting were read and approved.\n\nA communication was received from Messrs. Gordon, Goodman, McPhail and Conroy concerning fire apparatus, which was ordered from Wm. Dixon, $115.00 from W. J. Carter, $125.00 from John MacTaggart, $6.00.\n\nCouncillor Stewart moved a by-law for the establishment of a fire department.\n\nThe communication of Messrs. Gordon and others was laid over till the next meeting, and Mr. Gordon stated that Wm. Dixon and W. J. Carter were ordered to be paid.\n\nBy law there was ordered a first department, and a second time, and second time, when the Council resolved itself into a Committee of the Whole to consider the by-laws.\n\nMr. Gordon stated that the by-laws had been considered by him, and the committee room and the chair-room repaired.\n\nBy law there was ordered a third time, and passed, and on motion of Councillor Stewart and Beaton, was ordered to be paid.\n\nThe Mayor was instructed to call a public meeting for the formation of a volunteer fire brigade.\n\nA motion was passed that all persons who shall be requested to keep their premises in good repair, or have the same in good repair, or have the same improved, and that the Clerk notify each one.\n\nThe Council then adjourned.\n\nBAKING POWDERS.\n\nINTERESTING TESTS MADE BY THE GOVERNMENT CHEMIST.\n\nDr. Edward G. Love, the Analytical Chemist for the Government, has lately completed some interesting experiments as to the comparative value of baking powders.\n\nDr. Love's tests are made to determine the strength of the various powders, and as their capacity lies in their leavening power, tests were directed toward estimating the available carbonic acid powder. Dr. Love's report gives the following:\n\n| Strength | Name of the Powder |\n|----------|-------------------|\n| Highest  | \"Baker's\"         |\n|          | \"Hodson's New No. 3\" |\n|          | \"Hodson's No. 4\"   |\n|          | \"Hodson's No. 5\"   |\n|          | \"Hodson's No. 6\"   |\n|          | \"Hodson's No. 7\"   |\n|          | \"Hodson's No. 8\"   |\n|          | \"Hodson's No. 9\"   |\n|          | \"Hodson's No. 10\"  |\n|          | \"Hodson's No. 11\"  |\n|          | \"Hodson's No. 12\"  |\n|          | \"Hodson's No. 13\"  |\n|          | \"Hodson's No. 14\"  |\n|          | \"Hodson's No. 15\"  |\n|          | \"Hodson's No. 16\"  |\n|          | \"Hodson's No. 17\"  |\n|          | \"Hodson's No. 18\"  |\n|          | \"Hodson's No. 19\"  |\n|          | \"Hodson's No. 20\"  |\n|          | \"Hodson's No. 21\"  |\n|          | \"Hodson's No. 22\"  |\n|          | \"Hodson's No. 23\"  |\n|          | \"Hodson's No. 24\"  |\n|          | \"Hodson's No. 25\"  |\n|          | \"Hodson's No. 26\"  |\n|          | \"Hodson's No. 27\"  |\n|          | \"Hodson's No. 28\"  |\n|          | \"Hodson's No. 29\"  |\n|          | \"Hodson's No. 30\"  |\n|          | \"Hodson's No. 31\"  |\n|          | \"Hodson's No. 32\"  |\n|          | \"Hodson's No. 33\"  |\n|          | \"Hodson's No. 34\"  |\n|          | \"Hodson's No. 35\"  |\n|          | \"Hodson's No. 36\"  |\n|          | \"Hodson's No. 37\"  |\n|          | \"Hodson's No. 38\"  |\n|          | \"Hodson's No. 39\"  |\n|          | \"Hodson's No. 40\"  |\n|          | \"Hodson's No. 41\"  |\n|          | \"Hodson's No. 42\"  |\n|          | \"Hodson's No. 43\"  |\n|          | \"Hodson's No. 44\"  |\n|          | \"Hodson's No. 45\"  |\n|          | \"Hodson's No. 46\"  |\n|          | \"Hodson's No. 47\"  |\n|          | \"Hodson's No. 48\"  |\n|          | \"Hodson's No. 49\"  |\n|          | \"Hodson's No. 50\"  |\n|          | \"Hodson's No. 51\"  |\n|          | \"Hodson's No. 52\"  |\n|          | \"Hodson's No. 53\"  |\n|          | \"Hodson's No. 54\"  |\n|          | \"Hodson's No. 55\"  |\n|          | \"Hodson's No. 56\"  |\n|          | \"Hodson's No. 57\"  |\n|          | \"Hodson's No. 58\"  |\n|          | \"Hodson's No. 59\"  |\n|          | \"Hodson's No. 60\"  |\n|          | \"Hodson's No. 61\"  |\n|          | \"Hodson's No. 62\"  |\n|          | \"Hodson's No. 63\"  |\n|          | \"Hodson's No. 64\"  |\n|          | \"Hodson's No. 65\"  |\n|          | \"Hodson's No. 66\"  |\n|          | \"Hodson's No. 67\"  |\n|          | \"Hodson's No. 68\"  |\n|          | \"Hodson's No. 69\"  |\n|          | \"Hodson's No. 70\"  |\n|          | \"Hodson's No. 71\"  |\n|          | \"Hodson's No. 72\"  |\n|          | \"Hodson's No. 73\"  |\n|          | \"Hodson's No. 74\"  |\n|          | \"Hodson's No. 75\"  |\n|          | \"Hodson's No. 76\"  |\n|          | \"Hodson's No. 77\"  |\n|          | \"Hodson's No. 78\"  |\n|          | \"Hodson's No. 79\"  |\n|          | \"Hodson's No. 80\"  |\n|          | \"Hodson's No. 81\"  |\n|          | \"Hodson's No. 82\"  |\n|          | \"Hodson's No. 83\"  |\n|          | \"Hodson's No. 84\"  |\n|          | \"Hodson's No. 85\"  |\n|          | \"Hodson's No. 86\"  |\n|          | \"Hodson's No. 87\"  |\n|          | \"Hodson's No. 88\"  |\n|          | \"Hodson's No. 89\"  |\n|          | \"Hodson's No. 90\"  |\n|          | \"Hodson's No. 91\"  |\n|          | \"Hodson's No. 92\"  |\n|          | \"Hodson's No. 93\"  |\n|          | \"Hodson's No. 94\"  |\n|          | \"Hodson's No. 95\"  |\n|          | \"Hodson's No. 96\"  |\n|          | \"Hodson's No. 97\"  |\n|          | \"Hodson's No. 98\"  |\n|          | \"Hodson's No. 99\"  |\n|          | \"Hodson's No. 100\" |\n\nIn his report the Government Chemist says:\n\n\"I regard all alum powders as very wholesome. Phosphate and Tartaric Acid powders liberate their gas too rapidly, and produce a very irritating chemical change after digestion.\"\n\nDr. H. A. Mott, the former Government Chemist, after a careful and elaborate examination of the powders, says:\n\n\"The Government reports to the Government in favor of the Hodson brand.\"\n\nMr. Macartney, late chief chemist at the Royal Military College, says:\n\n\"The chemical tests to which I have submitted the Hodson brand, prove it perfectly healthy, safe for tea, even under different substances.\"\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nSCHOOL MEETING.\n\nA public meeting took place in the schoolhouse on last Saturday evening, to select a site for the proposed new schoolhouse. Among those who appeared were, among them being Mr. John Stewart, Chairman of the Board; Mr. J. M. Macdonald, Mr. F. Betts, Eee. Mr. Campbell, Com. Agnew, W. R. Gurney, Thos. Baker, D. J. Wagstaffe, and others. Mr. Stewart opened the meeting, and proceeded to explain its object. He said that only two tenders had been received—one from Mr. Macdonald, and another from Mr. Hamond, that of the former being the original tender with an additional lot, and that the latter was offered by Mr. Macdonald at a lower price than his own. Mr. Macdonald stated that he had been informed that only two tenders had been put in. Mr. Baker, seconded by Mr. F. Baker, that Mr. Macdonald's tender be accepted. Mr. Macdonald stated that the tender would have been put in, but for the fact that he had been unable to decide as to which of the tenders should be accepted, and put Mr. Macdonald's tender in. Mr. Johnson, who arrived late, asked if any change had been made in the tender. Mr. G. E. Carter said he had gone round with the petition, as he considered the lots offered by Mr. Macdonald and Mr. Hamond to be suitable. Mr. Macdonald said that he thought all the tenders should be accepted, and that they should be accepted as they stood. Mr. Macdonald thought that the site of the schoolhouse was known, and that the tender should be accepted. Mr. Know explained that the proposed schoolhouse was 20 x 30. It was then moved that Mr. Macdonald's tender be accepted, which was lost, and the original motion carried.\n\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nFrom the Bulletin, Feb. 21st.\n\nW. West has received notice that he will be allowed to operate his ferry for the day from August 5th, 1885, on account of the work required by him on the Lake right. Also notice for $200 as a gratuity covering the period from the date the work was received to the date the ferry was closed. The officer took the evidence of his case.\n\nStage arrived on Monday afternoon on the route between Edmonton and Fort Macleod. Mr. Shaw will remain here to practice his profession.\n\nMr. Macdonald has been refused the patents for several of the lots purchased before survey from the Fraser estate in town, being now out in Ottawa and will be located at once.\n\nThe following letter, dated Vermillion, Peace River, December 18th, appears in the paper:\n\n\"Mes. E. L. Lawrence and W. T. Macdonald bought through their Waterhouse agent, Mr. Macdonald, the land described above, without any doubt, arriving here on August 19th, 1886. Henry Lawrence, who came with Mr. Macdonald, commenced seeding barley on May 12th, the heavy snow storm of the first few days of May having delayed the work. The barley commenced heading out on June 24th and was ready for cutting in the last week of July. The crop is now nearly completed so it is impossible to give the returns, but his brother, Mr. Isaac Lawrence, of the same company, has estimated the yield at about 40 bushels to the acre. He also planted two acres of oats, which are now heading out and ranked 20 inches. The young cattle are still ranging out. Only the working cattle are on the farm. We have had only one night down to 20 below zero, and often only a few degrees above zero. The weather is now falling at present. The measles and whooping cough, which have proved so fatal to the children, have disappeared from the community here, but so far there have only been two deaths, both babies of a few months ago. Most of those who have been down with it are recovering.\"\n\nBATTLEFORD.\n\nFrom the Herald of Feb. 20th.\n\nThe Department of Public Works is advertising for tenders for the supply of four thousand telegraph poles, to be delivered at Battleford, Saskatchewan, for use on the Government line between that station and Humboldt.\n\nThe Hon. Mr. Justice, who visited the Indian reserve south of Carlton, returned to town on Sunday morning. In the course of his visit he heard of many cases of measles amongst the young and in some bands considerable sickness amongst the adult Indians. At the time of his visit, however, he found comparatively few cases of a serious character.\n\nThe delivery of iron poles and timbers along the line of the telegraph here have been and will provide a nice job for the men employed.\n\nThe ship \"Duke of York\" from Mr. Cook by the police were delivered within a week.\n\nThe Most Complete Annihilation of Prices Since Noah Left the Ark\n\nAT FISH'S.\n\nDoubt that the cattle are fine, Do you see the old bull? Do truth to be a liar, But here's doubtful fish, the Merchant.\n\nFriends! Patrons! Citizens! Set it! Grasp it! Hold it!\n\nBARGAINS\n\nFor One Month we will sell at a Big Reduction to make room for Spring Stock.\n\nJUST ARRIVED.\n\nFurs, Sugars, Soaps, Butter, Etc.\n\nW. R. FISH,\n\nRIVER STREET\n\nBargains\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and\n\nGAME IN SEASON.\n\nAMBER--Hop --ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERFOND\n\nBUFFALO HALL!\n\nGRAND STOCK-TAKING SALE NOW GOING ON.\n\nDry Goods, Clothing And Groceries ALL REDUCED IN PRICE.\n\nBETTS & Gwynne STOVES!\n\nA Further Reduction of 20 per cent. will be given on all BOX AND PARLOR STOVES Remaining on hand.\n\nCamp Stoves and Piping AT BOTTOM FIGURES.\n\nI have a first-class workman, and will execute all orders for Tinsmith's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\n\nA FULL STOCK.\n\nGO TO J. R. McPHAIL.\n\nTHE WEST END STORE\n\nJUST ARRIVED.\n\nNEW GOODS AT CHAS. MAIR'S WEST END STORE,\n\nNora's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Rugs, Window Holland in Slate and Yellow, Door Mats, Crumb Cloths, Silk Corded Cloakings, Empress Shawls, Ladies' Felt Hats, Ladies' Garret, Felt Occumbers, Embroidered Petticoats, Ladies' Fancy Frillings, Beige Veiling, Ladies' Silk Ties, Tassels, etc., etc.\n\nALL AT LOW PRICES.\n\nRussell & Davis, Prince Albert\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBREWERY.\n\nPure and Sparkling\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRussell & Davis, Brown's Brick Store.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887032501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5490, "total-output-tokens": 4549, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2107, 2], [2107, 8549, 3], [8549, 14662, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]