[{"id": "0629d4c928cd43d5a531077429c732654c904f83", "text": "CHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nTelegraph communication is all O.K. here once more.\n\nMr. J. W. Hard has returned back to the house on the hill.\n\nMr. R. M. Martin is expected back from Wisconsin next week.\n\nThe Rev. Caleb Parker arrived back from Saskatchewan Wednesday.\n\nA. G. Goodall and family recently arrived from Hamilton, Ont., on Friday last.\n\nSome of the police stationed here have started the potato patch on the French estate.\n\nConstable McMurrin will leave the Police Force in June on the arrival of Capt. Anderson, his father having bought into another company.\n\nWe received this week a copy of the Post Muday Co., a column of news and opinion, which can be seen at the office of Mr. W. W. MacLuse.\n\nMets, R. L. F. Anderson and T. Taylor are building a stock yard back of the West End Telegraph offices for Moses, O. H. Frinnson & Co. It will be used for trading purposes.\n\nMrs. Whittal and son arrived back on Saturday last, on a visit to their son, Mr. Tom Smith, in Prince Albert; they have been in charge of the steamer laid up here during the winter.\n\nDodgers are out asking for tenders for hauling steamer supplies. Esmond and Collins of Regina and specialists, are now at the office of Mr. W. W. Macluse.\n\nM. R. Hard was paid a visit yesterday by his son Frank, who visited here last summer and exchanged business matters.\n\nMr. Thomas Swinton of England, has been in charge of the steamer laid up here during the winter.\n\nMrs. Thompson brought her son, Mr. E. H., here a week ago, and he is staying with Mr. Anderson.\n\nNEW GOODS.\n\nMEDICAL HALL\n\nSURGERY, SURGEONS,\n\nDRUGS, PRINTED INK\n\nFANCY GOODS.\n\nAttniss's Cosmetics, Addic's Liniment, Coal Tar, Buist's Purfumerry.\n\nBate's Galenic Balsam.\n\nCATHERINE MILLINERY\n\nFANCY GOODS.\n\nMISS MACK & CO,\n\nCAMPBELL'S, C. S. K.\n\nFirst Case by Express\n\nThe farmers are complaining of want of rain.\n\nOur lacrosse teams are practicing every day in anticipation of action with our summer class.\n\nThree births in town last week.\n\nPopulation increasing.\n\nUniforms.\n\nAnnie Park returned back from Battelfoeld last Sunday.\n\nLook out for the Calculus games on the Queen's Birthday.\n\nDon't forget the P. A. C. Band drama the evening of Monday, the 28th of May.\n\nMr. J. Campbell, who has been abroad for a few weeks in the past two weeks, is rapidly recovering.\n\nThe Rev. Dr. Smith, M.A., of the University of Oxford was in Lahore last week and was engaged in an effort to raise funds for the Orphan asylum of Galapagos on his mission there.\n\nThe other day a young lady passed our office she was impressed in reading a certain line from the Bible. We consider it very satisfactory.\n\nThe New French Half Breed law is now being put into operation.\n\nThe leaders of the various governments and corporations that held meetings this week did not promote the government with regard to Half Breed relief, and also that they could not meet the people in order to view Louis Kind of Montana.\n\nTerrible accidents happen, Why do we see that those who are opposed to the Bill, it is probable that if anything does happen it will be at Battleford on Dominion day.\n\nThere is plenty of red and natural rubber and there is plenty of incident going to distinguish the governments and corporations, but it seems that they have permitted the government with regard to Half Breed relief, and also that they could not meet the people in order to view Louis Kind of Montana.\n\nThe Government of the Canadian Government has succeeded in compelling the Enactment of the Edwina Roberts Act.\n\nThis week a new Act has been passed by the legislative council.\n\nThere is plenty of red and natural rubber and there is plenty of incident going to distinguish the governments and corporations, but it seems that they have permitted the government with regard to Half Breed relief, and also that they could not meet the people in order to view Louis Kind of Montana.\n\nThere is plenty of red and natural rubber and there is plenty of incident going to distinguish the governments and corporations, but it seems that they have permitted the government with regard to Half Breed relief, and also that they could not meet the people in order to view Louis Kind of Montana.\n\nTERMS:\n\nNew Business Office\n\nSpring and Summer Millinery\n\nMiss Mack & Co.\n\nCAMPBELL'S, C.S.K.\n\nPINEVILLE, May 15.—Great preparations are being made for the celebration next month. The citizens are making grand plans to celebrate this event.\n\nThe Toronto and Ottawa Railway was opened last Monday, and trains are running regularly and making good time.\n\nCanadians.\n\nHeavy snow travel by land, air transport, steamships, or railroads has been most successful.\n\nIt takes more than a thousand pounds of pressure to break down wood, and tens of thousands of pounds to break down metal.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nTIGHT BINDING\n\nPROVINCIAL RIGHTS\n\nThe people of Manitoba and the North West Territories have for long past been struggling by every legitimate means to secure their rights. They have been treated with great injustice, and they have been denied the opportunity to express their views in a manner which would be acceptable to the government. The government has been unwilling to listen to their complaints, and they have been forced to take matters into their own hands. They have been willing to use any means necessary to secure their rights, and they have been willing to risk everything to achieve their goals.\n\nNEWFOUNDLAND\n\nThe results of this attempt to establish a colony in Newfoundland have been disastrous. The colony was established in 1621, but it was not until 1783 that it became officially recognized as a separate entity. However, even then, the colony faced many challenges. The colony was located in a remote area, and it was difficult to maintain contact with the outside world. The colony also faced many economic difficulties, and it was unable to sustain itself financially.\n\nNOTICE\n\nCANADA\n\nIn the goods North West Territory, Mr. McKAY, storekeeper, wishes to inform his customers that he has received a large shipment of goods from England. These goods include a variety of items such as clothing, shoes, and household supplies. Mr. McKay also has a large selection of fresh produce available for purchase.\n\nPUBLIC NOTICE\n\nAll persons are hereby notified to take notice that the following notice is hereby given: The sale of liquor by the Minister of Justice or the Board of Control is prohibited by law, and all persons who sell or consume liquor in violation of this law shall be liable to prosecution.\n\nFURNITURE\n\nFancy Parlor and Bedroom Sets, Chairs, Tables, and Sideboards, Bureaus, Bedsteads, Couches, Sofas, and other furniture.\n\nG. & C. E. CARTER, KNOK & BARKER, CARPENTERS, ETC.\n\nOFFICE AND WORKSHOP\n\nNear Presbyterian Church.\n\nW. J. CARTER, Builder and Carpenter.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done to order, next to H. B. C. Hotel.\n\nResidence—Near Presbyterian Church.\nSPORTS.\n\nW. R. GUNN, M.A.,\nArtist, Sculptor, Convenor,\nLocal agent for W. J. Franks & Co., Real\nEstate, Blacksmiths, Mission.\nC. W. T.\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWells sunk and Pumps Made and Repaired.\n\nOrders let at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN,\nPrince Albert.\n\nNOTICE.\n\nI would respectfully inform the public of Prince Albert and vicinity that I have leased Michael Scher's Blacksmith Shop where I will be happy to see all who will favor me with their custom.\n\nGood Work and Fair Prices.\n\nISAIAS MCCALL,\nGeneral Blacksmith.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Bowling Stable in connection.\n\nR. J. O'LEARY\nProprietor.\n\nBATTLEFIELD ITEMS.\n\nBATTLEFIELD, May 16th, 1884.\n\nFor the second time, Col. Hackett has been here this week.\n\nMajor Conner is to be in command of the detachment. He left Regina on the 15th last week for the purpose of recruiting. Col. Hackett returns to Regina shortly and when he arrives he will proceed to the place for which he has been transferred.\n\nDr. Miller has been transferred to this post and is expected daily.\n\nQUEEN'S BIRTHDAY.\n\nA list of events to be held under the auspices of the St. Andrews Society of Prince Albert on the 24th of May.\n\nJAMES SINCLAIR\nMerchant Tailor,\nand Dealer in\nGENTS' FURNISHINGS.\n\nNOTICE.\n\nAll parties indebted to me by note, or otherwise are hereby notified that all debts unpaid after May 1st, 1884, will be placed in suit without fear or favor.\n\nN.B. - On and after this date my terms will be strictly cash, or equivalent.\n\nT. O. DAVIS.\n\nFirst Carts - First Arrival from Troy.\n\nHATS AND CAPS\n\nSPRING GOODS! WM. R. BELL.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 43\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railways.\n\nPassengers on the Royal Route have all the luxuries of Modern Railways. Travelers enjoying Cars, luxurious Sleeping Car accommodations, and the best of Coaching for Passengers who desire it. The Royal Route offers the best rates for any Passengers between Minnesota Point and Omaha, also exchanging cars at Chicago, and connecting with through Sleepers to Kansas City.\n\nIt is the most economical, economical, dollar, after all, but to know the facts.\n\nROYAL ROUTE.\n\nJ. H. HIGHLAND, Genl. Traffic Manager.\nT. W. TEASDALE, Genl. Passenger Agent.\nSt. Paul, Minn.\n\nC. E. HUGHES & CO., PHOTOGRAHPS!\n\nChas. E. Page.\nNEW STUDIO.\n\nEAST END.\nPrince Albert Bakery.\n2 LB LOAF, 12c.\n9 LOAVES, 15c.\nCakes and Pastries always on hand and made to order.\n\nR. B. WAY,\nPost Office, Prince Albert, N.W.T.\nTERRITORIAL NEWS\n\nCALGARY\nFrom the News, April 28.\nA trial trip between this point and Edmonton will be made. Probably a fortnightly mail will be established.\n\nPrairie fires have been very destructive. One near here last week was large.\n\nCass McTavish has a force of men busy at work on the experimental farms.\n\nThe harvest here is nearly done. The wheat, oats, barley and peas. The grain saved last fall is exhibiting signs of life.\n\nM. A. C. Sparrow just arrived from Belly River with 200 head of choice beef steers, selected from the different ranges of that district.\n\nA prominent Jew, familiarly known as \"Cracker Box Bill,\" was arrested at Summit for smuggling in goods from the United States. After an interview with Major Dunning, he passed into his cheque for $250 and costs.\n\nPRINCE ALBERT, April 29.\nThe bridge over the Moose has been completed, and the barges have been pulling in the wood, using as a wharf. This is utilizing the bridge in earnest.\n\nA welcome rain descended on Thursday, which was greatly needed.\n\nThe beautiful rain descended on Friday, and kept us all night, and didn't even go home after the morning. All classes in the afternoon took it in short time.\n\nA half breed came in today probably from the mountains with his feet badly swollen.\n\nConsiderable activity observable on the streets today.\n\nMr. J. K. Smith has the first herd of registered thoroughbreds raised in Calgary.\n\nThere was a theft at the store's hide day or two ago, but no assault type. The thief was C. O. Smith who has yet been discovered of the theft.\n\nMINNE-JAW\nFrom the News, May 7.\nA swan was recently shot by an Indian near Minne-Jaw. It was between noon and 1 o'clock, but the bird was killed.\n\nNavigation on the Moose Jaw has reopened, and those of our citizens who desire to travel by water will find it of any kind will do so, but we are in making the most of the opportunity for travel.\n\nDr. J. Knott, D.L.S., and party leave here in a few days on an exploratory survey for the Dominion Government at the mouth of the Moose River Bay. His party began at the Forks of the Saskatchewan and came down to Lake Winnipeg, thence down the Nelson River to the Hudson Bay, up the side to Churchill, from which point he follows up the Churchill River, which is well equipped with charts, maps, photographs and magnetic instruments.\n\nMANITOBA.\n\nSIDNEYALL.\nFrom the News, May 3.\nLight snow shown on Tuesday. Prairie fires have been raging west of here.\n\nThe Regina Daily Sun has passed away, and will be called for publication weekly.\n\nLarge numbers of agricultural implements now being shipped from here to farmers in this vicinity.\n\nA petition is circulating in a County Court at present. There is every probability that we will have a new road.\n\nBAT PORRIDGE.\nFrom the Frontier, April 26.\nMr. Robert Shaw, Crown Timber Inspector for the Winnipeg district, has returned from the field. He has reported information that a portion of the crown land in the area has been during the past year used for the raising of livestock.\n\nHe has sent a large quantity of wood in different parts of the town.\n\nFur Trade.\nA proposal has been presented to Mr. J. K. Heydon, Dominion Licence Inspector, signed by the majority of the C.P.R. members, requesting that the company be asked to sell liquor between Rat Portage and Edmonton.\n\nMr. Wm. McCarty returned from Winnipeg last Thursday. While there he disposed of a number of his own Coney Island stock, several Western goods, and then will erect new buildings during the coming season.\n\nNOTICE.\n24TH OF MAY,\nHenry E. Hurd.\n\nBUFFALO HALL!\nClose Buyers Still Patronize THIS OLD RELIABLE HOUSE.\nWe Need Money and are Willing to Sacrifice our Goods to get it.\nOver due accounts should be attended to at once to avoid costs.\n\nBETTS & Gwynne.\nHARDWARE!\nA FULL STOCK OF Powder, Shot, Shells, and Gun Caps.\nGarden Tools, Glass, Cut Nails and General Shelf Hardware.\nAT J. L. JOHNSON & CO'S.\nT. N. Campbell.\nBookseller and Stationer\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nG. D. ACHTCHAYES, Watchmaker and Jeweller.\nA T. N. Campbell's New Store.\nA LARGE STOCK OF Watches, Clocks and Jewellery.\nKEPT CONSTANTLY ON HAND.\nRepairing Promptly Attended.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884051601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 3595, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4776, 1], [4776, 7042, 2], [7042, 10159, 3], [10159, 14508, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]