[{"id": "bd251dfb2b56430e0fa6bc84dfbbed3786de0974", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVETY\n\nPRINCE ALBERT N.W.T.\n\nPRINCE ALBERT TIMES\n\nPassed by the Council of the North West Territories on the 15th Dec., 1886.\n\n1. The power should be given the North West Government to make settlement grants without limitation in any part of the Territories. All grants will be made at the rate of $1 per acre, and no settlement without the consent of the Government will be allowed except where the settler has been engaged in the work of clearing or building a house.\n\n2. That all lands surveyed by the Government, and afterwards vested in the North West Council, shall be deemed to have been granted, and may be occupied under the provisions of the Act of Parliament, passed in 1879.\n\n3. That the North West Government shall be authorized to make such grants as may be necessary to enable settlers to commence their farms.\n\n4. That the settlement of the Territories shall not be permitted until the land is actually occupied.\n\n5. That the North West Government shall be authorized to grant such grants as may be necessary to enable settlers to commence their farms.\n\n6. That the settlement of the Territories shall not be permitted until the land is actually occupied.\n\n7. That the settlement of the Territories shall not be permitted until the land is actually occupied.\n\nTHE INDIANS.\n\nThe protection of the Territories from an Indian outbreak, has at last engaged the serious attention of the Government. According to the latest intelligence, several hundred Indians have been gathered together on the North West under command of General Sir Frederick Middleton. This order has come none too soon, as it is evident that there is a great danger than to wait for an actual outbreak. The Blackfeet have been in a very restless state for some time back, and are liable to go on the warpath at any moment. The policy of the present Government, the Indians Department being held responsible for the state of affairs, and a feeling of confidence will not be restored until the Government places a strong force of the Department on the North West who understands the nature and habits of the Indian, and who will carry out some one settled and vigorous policy.\n\nSEED GRAIN.\n\nGreat discontent exists among many of our farmers on account of the amount of \"red tape\" necessary before they can obtain their seed grain. Many of them know to their cost, that a mortgage is a bad thing to get into, and yet, it being much easier to get the mortgage than to get rid of it, and especially when the getting rid of it depends on the frost keeping off until the crops are ripe, the experience of the last two years gives them no confidence in the continuance of any mortgage clause in the mortgage, providing for the failure of crops, and many will refuse to take the seed grain. Another cause for discontent is the harvest of seed grain for freighting the same. If they are not able to leave Prince Albert on the 20th of this month, they will have to run the chance of being stuck on the roads through want of snow. After taking all these things into consideration, many of the farmers have come to the conclusion that it will not pay them to take seed grain from the Government.\n\nRESOLUTIONS\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\n Builders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nNOTICE.\n\nROBERT THOMSON,\nSign & Ornamental Painter\nCalominium and Paperhanging on short notice.\nDecorative Painting a Specialty\n\nLINDON COLLEGE.\n\nNotice.\n\nRobert Thomson, Sign and Ornamental Painter\nCalominium and Paperhanging on short notice.\nDecorative Painting a Specialty\n\nThe Nor'West Farmer\n\nTo Yield a Greater Return to the Farmer\n\nIt is a fact, a great deal is brought into this subject of farming by the heavy expense incurred in the practice of it.\n\nThe Nor'West Farmer is devoted to the interests of the farmer. Its object is to bring about a change in the methods of farming by the use of the best methods of growing animals and crops. It is the aim of the Nor'West Farmer to bring about a better understanding between the farmer and the government.\n\nHelp Along the Good Work\n\nBy SUBSCRIBING AT ONCE.\n\nONLY $1 A YEAR.\n\nTo secure a subscription before the close of this year, send in your name and address, and we will forward you the Nor'West Farmer for the remainder of the year.\n\nThe Nor'West Former Printing and Publishing Co. (Ltd.)\n\nWinnipeg, Manitoba\n\nC. H. KEENELDIE, Sec-Treas.\n\nSubscription rates at the office of the PRINCE ALBERT TIMES.\nDID RIEL SURRENDER?\n\nIt will be remembered that in his speech at the Champoiseau Mass meeting on Sunday, Nov. 25th, Mr. Lauder enunciated the doctrine that Louis Riel and Revenu-party were out of the question. Mr. Middleton wrote us on the 16th inst., saying that the Hon. Mr. Lauder, addressing him, if he surrendered, to give his safe keeping until the Government could take care of him. On that occasion Mr. Lauder put this extraordinary con-\n\nSEED GRAIN.\n\nA. H. Clark, secretary of the seed grain committee of the Local Agricultural Society, received a special order from the Minister of Interior for that purpose, two bundles of the same kind and quality, as specified by the order, to be delivered to the said Mr. Clark at his residence, White Plain, near the last post. The order was made on the principal conditions contained therein.\n\nEach settler who advances an advance of seed grain is made, to deliver or offer for delivery to the Government, within six months after the date of the order, a certain quantity of grain, as specified by the Minister of the Interior for that purpose, two bundles of the same kind and quality, as specified by the order, to be delivered to the said Mr. Clark at his residence, White Plain, near the last post.\n\nThe wheat which is grown on the land is to be delivered to the said Mr. Clark at his residence, White Plain, near the last post.\n\nThe following are the copies of telegrams received since:\n\nOttawa, Feb. 13th, 1886.\n\nA. H. Clark,\n\nOffice of the Minister of Interior, Ottawa, Feb. 13th, 1886.\n\nA. H. Clark,\n\nOffice of the Minister of Interior, Ottawa, Feb. 13th, 1886.\n\nCURLIANA.\n\nA lively game was played last week, for the medal presented by H. Macdonald, Esq., to the Curling Club of Prince Albert. The game was played between the teams of the Old Country and Canada.\n\nOLD COUNTRY VS. CANADA.\n\nRink No. 1.\n\nW. Miller, W. H. Gann.\nJ. McFarlane, J. McFarlane.\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\n\nRink No. 2.\n\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\nJ. Macdonald, J. Macdonald.\n\nFor Dyspepsia, Loss of appetite, Indigestion, Lack of Energy, Bilkness and Constipation, use Clark's Glycerine Soap Tablets.\n\nOn Monday night the store of Mr. T. Agnew, hardware merchant, was enter ed and robbed of several boxes of goods and cheese and crackers taken away. The following day, the same box containing the goods was found in the yard of Mr. J. Macdonald. There is no clue as yet to the identity of the thieves. It must have been obviously equilibrated with the place. Mr. Frank Agnew, who transacts the business, says that the absence of his mother, who has been on a trip to the Old Country, makes the robbery more likely to have occurred during the time she was away.\n\nSASKATCHEWAN REVIEW.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nST. ANDREW'S CONCERT.\n\nThe Concert given by the St. Andrew's Society came off very successfully in the Public School House on Monday evening last. The building was crowded to its utmost limits, and there was a most excellent concert. Mr. Wm. Miller, President of the Society, occupied the chair. After a few introductory remarks, Mr. Miller invited the Rev. Mr. Macmillan to deliver an address. Mr. Macmillan then treated the audience to a very effective and very hearty speech, which had the effect of raising everybody in high good humor. Miss Thomson then sang \"The Lord of the Leith,\" which was received with great enthusiasm; but the pleasure experienced by the audience was far greater than was expected. Being asked to sing another song, \"Diana Grey,\" a very pretty song in a very pretty way. The next piece was the prettiest piece of music ever heard from Mr. Thomson. All who had heard him before felt themselves drawn to hear him again, being convinced they knew something funny was coming. Mr. Thomson then sang \"When You Remember Me.\" Mr. Jones is one of the best tenors in the country, and his voice is in the highest perfection. Mr. Macmillan then sang \"Under the Fawney,\" and then replied to an encore by singing \"The Bishop of Llandaff.\" Mr. Macmillan has a very sweet voice, and all present were greatly pleased. Mr. Thomson then sang \"Two Songs,\" Mr. J. L. Johnson, \"I am thy Sentinel,\" and \"The Way We Spill,\" which were well received, closing the concert with a grand finale.\n\nThe second part was opened by an address from His Lordship the Bishop of Saskatchewan. As a platform speaker His Lordship spoke perhaps without any effort, and his manner was highly impressive. He was particularly happy in his remarks. His remarks illustrating the social life of the church were most interesting. His remarks on Scotland's favorite poet Burns were fully appreciated by the audience. Mr. Macmillan then sang \"Greeted him so close, were but a feeble testimony of the pleasure he had given the audience. Mr. Macmillan then sang Mr. Macmillan and Mr. Cato, which was most on the programme, was executed in a manner which was highly impressive for the musical abilities of the performers. Miss Mackenzie, an old favorite, then sang \"Stranger Yet,\" a very pretty piece which she sang with such effect that she had great applause, to no end. She sang \"Stranger Yet,\" which was also highly appreciated. Her voice was heard and loudly applauded. Mr. Niven brought out \"I Hate School,\" in a style which would have been worth seeing on being encored real \"Jack Tannen,\" both pieces being received with great applause, and then came \"Don't Tell.\" The first piece he sang was \"Bridget Duff,\" and afterward \"The Elegant Field.\" Mr. Macmillan then sang \"I Hate School,\" and the audience did their best to induce him to respond to another encore but failed. Mr. Macmillan then sang \"Stranger Yet,\" which was encored real \"Jack Tannen,\" both pieces being received with great applause, and then came \"Don't Tell.\" The first piece he sang was \"Bridget Duff,\" and afterward \"The Elegant Field.\" Mr. Macmillan then sang \"I Hate School,\" and the audience did their best to induce him to respond to another encore but failed. Mr. Macmillan then sang \"Stranger Yet,\" which was encored real \"Jack Tannen,\" both pieces being received with great applause, and then came \"Don't Tell.\" The first piece he sang was \"Bridget Duff,\" and afterward \"The Elegant Field.\"\n\nTOWN COUNCIL.\n\nAn adjourned meeting was held in the Council Chamber Monday evening. Present—Councillors Brown, Beattie, Bart, Hamilton, and Goddard. Councillor Goddard in the chair.\n\nThe minutes of last meeting were read and adopted.\n\nMoved by Councillor Goddard, seconded by Councillor Beattie, that this Council adjourn until Tuesday, 28th inst., at 7 o'clock p.m., Bart, Hamilton, Beattie, Goddard, and Nyce—Beattie.\n\nParliamentary adjournment, the Council met in the Council Chamber on Tuesday evening.\n\nPresent—Councillors Brown, Bart, Hamilton, and Goddard.\n\nThe minutes of last meeting were read and adopted.\n\nCouncillor Goddard gave notice that at the next meeting of Council he would move a by-law to amend by-law No. 1.\n\nParliamentary adjournment.\n\nCOMMITTEE ON ASSESSMENT AND FINANCE.\n\nCommittee on Assessment and Finance nominated the appointment of Mr. Wm. Miller, Esq., as assessor and collector for the Municipality of the Town of Prince Albert, the salary to be fixed by the Council.\n\nMoved by Councillor Beattie, seconded by Councillor Goddard, that the report of the Committee on Finance Committee be adopted. Carried.\n\nMoved by Councillor Goddard, seconded by Councillor Beattie, that Mr. Smith be appointed as collector. Carried.\n\nMoved by Councillor Beattie, seconded by Councillor Goddard, that the Mayor be appointed as assessor. Carried.\n\nMoved by Councillor Goddard, seconded by Councillor Beattie, that the sum of one hundred dollars be paid as current expenses. Carried.\n\nCouncil then adjourned.\n\nPETITION.\n\nThe following petition had been presented by the members of St. Catherine's Church:\n\nTo His Lordship, the Bishop of Saskatchewan, Prince Albert, May it please your Lordship,\n\nWe, the undersigned office bearers, members of the adherents of St. Catherine's Church, respectfully request your Lordship to consider that your Lordship has it in contemplation to transfer the Rev. E. Matheson from his present position under your jurisdiction, and while we would not wish for a moment to do anything to interfere with such arrangements as you consider to be necessary for the good of the church at large, we at this juncture feel constrained to place before you our unanimous desire that Mr. Matheson be allowed to remain here, as he is doing a very valuable work among us, and we feel sure that he will continue to do so.\n\nMr. Matheson has been amongst us for more than six years, and has gathered around him a very large and attached congregation. His various and at times arduous duties have invariably been performed with fidelity and devotion, his conduct has been most exemplary and his personal influence in the church has been very great. He has always been a good teacher, and is most attached to his people, and not only conveys the message of religion, but also endeavors to remedy here and there some wrongs. Whether we regard the personal benefit of his removal from our midst with feelings of regret and sorrow, or whether we merely regard the question, we shall find it to be consistent with your sentiments to allow him to remain here.\n\nWe would also respectfully urge upon your Lordship's attention that in notwithstanding Mr. Matheson's youth, however great his ability may be, can be expected to discharge the duties of this charge, and that he has been here as your minister faithfully, and that no change is likely to be made unless it was committed in him by you.\n\nWe therefore ask your Lordship to take our respectful request into your consideration.\n\nSigned—\n\nWm. Holmberg, J. C. Goddard,\nJames Johnston, Henry McNaughton, Bart,\nAndrews, John Brown, Charles McNaughton, Bart, Hamilton,\nJoseph Poehn, Alex. Whitfield, Bartley,\nand also by all the heads of families in St. Catherine's parish.\n\nFresh Pork Sausage at Walters & Baker's.\n\nA large and elegant assortment of Lohm's perfumes, Colgate's perfumes, Landberg's perfumes, Schickel's perfumes, cologne, Hoyt's cologne, Clark's Drug Store.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF\n\nDomestic and Imported Cigars\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlor de Benitos, Creme de la Creme, Belle Cuba, (Henry Clayes and)\n\nALL CHOICE GOODS AND SEASONED.\n\n(Betts & Gwynne.)\n\nErmine Our Stock of Xmas Confectionery and Biscuits.\n\nBUY YOUR\n\nHardware,\n\nStoves,\n\nTinware,\n\nCoal Oil,\n\nGroceries,\n\nAT\n\nJ. L. JOHNSON & CO.'S.\n\nWM. STOBART & CO.,\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWINNIPEG FLOUR\n\nCHEAP FOR CASH.\n\nPrince Albert — Sask\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAt T. N. Campbell's New Store,\n\nLarge Stock of Watches,\n\nClocks and Jewellery,\n\nKept Constantly on Hand,\n\nRepairing Promptly Attended.\n\nT. E. JACKSON,\n\nNew Stand, in the building lately erected as a Post Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886021201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3981, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4886, 2], [4886, 7970, 3], [7970, 16137, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]