[{"id": "9b4271bf2fa3b2217e849c6f88a3634e7ac74e53", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPrince Albert, Sask., Friday, July 22, 1887.\n$2.50 A YEAR.\n\nBANKING HOUSE\nOF Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact General Banking Business.\nInterest allowed on Deposits.\nBranches located in all points in the Dominion.\nCollections undertaken and promptly returned.\nWilliam V. Macpherson.\nBanker, Bishop.\n\nSTEPHEN BREWSTER,\nAdvocate, Notary Public.\nLaw Office & Edmond,\nAdvocate, Notary Public, Etc.,\nPrince Albert.\n\nH. W. NEWLANDS,\nAdvocate, Notary Public.\nPrince Albert, Sask., N.W.T.\n\nSTEVE FLETCHER,\nEsquire of the Supreme Court of Justice in England,\nAdvocate, Notary Public, Etc.,\nLaw Office & Edmond,\nAdvocate, Notary Public, Etc.,\nPrince Albert.\n\nW. T. GOODFELLOW,\nCorner River and Mackay Streets,\nPrince Albert.\n\nROBERT BUCKLEY,\nAuctioneer,\nAccountant,\nGeneral Agent.\n\nTHE OLD RELIABLE,\nA LARGE SUPPLY OF THE GOOD OLD WEIGHT CLOCKS,\nSHOW CASES,\nNICKLES CLARK's PAPER, KAEMIN, KOLN &\nSWISS WATCHES,\nPost Office Jewellery Store,\nRepairing done new and warranted.\nR. B. WAY,\nGeneral Agent.\n\nQUEEN'S HOTEL,\nV. GRAH, Proprietor,\nLeading Hotel in Saskatchewan.\nHandy by the day or week.\nThe Bar is supplied with the finest brands of imported and domestic wines.\nSoft Drinks.\nEvery attention paid to the travelling public.\n\nTHOS. ORAM,\nThe Cheapest, the Best, and the Largest Stock of BOOTS AND SHOES,\nEver offered in Prince Albert.\nWe guarantee to have our competitors' prices beaten by five per cent when buying Boots and Shoes.\nCall and see us at once.\nWe can do it.\nDon't go anywhere else till you try us.\nOur goods are all sold under our own labels.\nOur sections are strictly clean.\nOur stores are clean and neat—Do unto others as you would have others do unto you.\n\nTHOUGHTFUL GIFT.\nMRS. JAS. A. FRASER,\nA valuable friend to many friends of the city.\nMrs. Fraser offers her services to any person in need of a few hours work.\nPhone—No. 99.\nStable-No. 3 River & West Street.\n\nNEILSON & McBEATH,\nGRAND UNION LIVERY STABLE,\nOpposition is the Life of Trade.\nFirst-class Livery, Food and Stable Stables.\nContact Mr. Neilson.\nWe would like to invite the public what she will give us, even as that clod of dust gives up its life.\nAnd as we do not want their votes, so let them be free to cast them where they will.\nWe keep the largest and best Livery and Stable Stables in Prince Albert, and will give satisfaction.\nAll our horses are sound and at our disposal for the use of the public at reasonable terms.\nWe have a rate of horse hire and stable hire which will give satisfaction to the most particular.\nAny horse purchased from us will be insured against loss or death.\nAll our coaches are well-laid horses, and of the best quality.\nWe take part in horse races of this year, and are proud of our horses being among the leaders in the contest.\nOnly the best horses in the stamina of their breed.\nHighest Grade Price Paid for CARRIAGE.\nNO. 4 SLIDERS FOR SALE,\nCRISP BOUGHT AND SOLD.\nWM. TAIT,\nWH. A. Donaldson & Pembredge,\nAt The Blank River Street.\n\nPUBLIC NOTICE.\nBy the Trustees of the School District of Prince Albert Protestant Public School No. 3, the North-West Territories:\nNotice is hereby given that the trustees of the said school district have decided to purchase a house of the above description, situated on the premises more generally known as the Michaud lot of land on the corner of 16th Avenue and Water Street, now occupied by Mr. Smith. The said premises will be used as a residence for the teacher appointed to teach in the said school district during the following season, and for the purpose of providing a school room. The said premises are valued at $500.00, and the trustees have determined to expend the same sum in the acquisition of the said houses. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house. They have also determined to expend an additional sum of $100.00 for the purpose of purchasing suitable furniture for the said house.\n\nTELEGRAFSIC.\n(By Special Telegraph.)\nWinnipeg, July 22.\nThe Canadian cricket team has been defeated in matches against the Gentlemen of Ireland and Gentlemen of Scotland.\nThe Kalgoorlie cup has been won this year at Wimbledon by the English team, Arthur Gillham and Captain Willoughby Brown, both members of the Western Australia Cricket Club.\nMr. H. H. Howard, minister in charge of Prince Albert Methodist mission, will hold service at Smithfield Church at 7 p.m. on July 23rd.\n\nOHIT-CHAT LOCALS.\nGathered by our Reporters.\nInsect powder at Clark's Drug Store.\nMr. Geist, San. Davisville, leaves for Ratton for some weeks.\nJudge McKeown and Sheriff Hughes arrived down from Battleford, where his honor had been holding Court last Monday.\nMr. H. H. Howard, minister in charge of Prince Albert Methodist mission, will hold service at Smithfield Church at 7 p.m., and at the Mission at 8 p.m.\nWe call attention to the administration's notice in another column in regard to the estate of Mr. Geo. Dunn. We are promised the book of laws belonging to him should be handed over to the administration at once.\n\nPENIC.\nOn Wednesday, the annual picnic in connection with the Catholic School was held in favourable weather and with great success. The traditional program included speeches by Father Craig and Mr. Inshier on behalf of the school trustees received the guests, of whom there were quite a number in attendance.\nMr. Inshier delivered an address on the importance of the Catholic faith.\nIn the morning the children were treated to a meal, riders around the town in wagons.\nWe did not happen to see the start, but the procession on the road behind us showed a band in the persons of a single fiddler—a good friend of old and young, who never more than once heard from the balconies and courtyards around him the strains of the school, having been on strike for that purpose, but finding their way to the children's aid in due time.\nBefore lunch, they sang several selections together while the school officials and the whole community began long ago to devote their attention to the excellent and abundant lunch provided by the Catholic Board of Education.\nMr. Peter Lewis, who marked success by making his獨木舟 work in his band and water under constant pressure, received the highest marks from the company.\nThe Indians were active and attentive as usual; the wheat was always in hand and the detachment held up to keep the pot boiling during their hour.\nThe usual games were then engaged in and the children were treated to their children.\nThe speeches were commandingly made by Rev. Mr. Campbell in a style calculated to make men think twice about making speeches again.\nWe express our thanks to Miss McLellan, which was heartily given.\nWe send our ardent wishes to Mrs. Marcus.\nThe bell that rang the closing of the school year was heard from here, so that the strains of the fiddles were heard from the open door of the nearest domicile, and there the manager of the band may have his ides of his old tune back to his confusion.\nHe had expected the concluding motor of Mr. Chan Metcalfe and other performers of the evening show.\nThere! It has been said that the voice of Mr. Chan Metcalfe would have been heard in the west wind, and in the future will prove to be sensations of Mr. Chan's own making.\nWe were placed at liberty last night when Mr. Grant, Miss R. O'Briyn and Lieut. Churchill returned in town this morning.\nThe said persons are engaged in surveying all the old stations for the purpose of making the entire records taken there not so very far back in the future.\n\nJust received a large consignment of Burdock Root; Ritters direct from producers in Germany, handled by Dr. Heinrich, Cooperating Agent.\nThe Arrangement is made by Mr. Elgar, Agent.\nThis destroys fleas, bugs upon the premises, and flies and lice, and will rid sills, bed bolts, etc., from these pests.\nIt is harmless to dogs and domestic animals.\n\nFor all your accountant, division and sales, visit Clark's Vegetarian Lunch Counter, Lunch and Anti-biotic Drink Launch.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.\nTERMS.—25¢ per annum in advance.\nSingle copies—10 cents each.\nIn no case will results be inserted in this paper. Business letters etc., perline.\nNo advertisement inserted for less than $1.\nAdvertisements containing instructions will be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY.\n\nSUNDAY CHURCH SERVICES\nSt. Alban’s and St. Mary’s Churches—10 a.m., Rev. Canon MacTaggart, in charge.\nTrinity Church—10:30 a.m., Rev. Canon MacTaggart, in charge.\nSt. Paul’s—1 p.m., Rev. Canon Fleet.\nSt. John’s—3 p.m., Rev. Mr. Massie.\nSt. James’—4 p.m., Rev. J. Taylor.\nSt. Anne’s—6 p.m., Rev. J. Taylor.\nSt. Paul’s Presbyterian—11 a.m.; and at 7 p.m., Rev. Mr. Wilson, pastor in charge.\nMethodist Church—Red Deer Hill and Island—10 a.m., Rev. Mr. Wilson, in charge.\nPresbyterian Church—11 a.m., Rev. Mr. Wilson, in charge.\nPrayer meeting Wednesday and Thursday evenings, 8 p.m., Rev. Mr. Wilson, in charge.\nRev. C. S. Willis, pastor in charge.\n\nTHIS PAPER MAY BE FOUND AT\nBOWELL & CO.’S NEWSPAPER\nAdvertising contracts may be made for insertion in this paper in NEW YORK.\n\nFRIDAY, JULY 22, 1887.\n\nAGRICULTURAL OUTLOOK\nThough we are not all farmers, we are all more or less interested in the staple industry of the country and we are therefore gratified to be able to report that agricultural prospects in the district of Lorne continue to be very favorable. There has now been a sufficiency of moisture, the crop is everywhere heavy and all that is required is a spell of dry weather to ripen it. In isolated cases the crop is indeed rather heavy and shows a tendency to lodge—but no actual damage from this cause can yet be reported and a continued absence of bright sunny weather will prevent any appreciable loss on this head.\n\nWe believe there are now few skeptics as to the necessity of early seeding and though that opinion ought to be confirmed by experience. Many farmers in the fear of another dry season put down comparatively small crops at first and some of them, after seeing every evidence of a most splendid, many of whom have already sown fields late in the season. Growth this spring having been so heavy in consequence of the prevalence of the rain, maturity is naturally slower of being reached and those who later sow fields are by no means so far advanced as they could wish to see them so near the end of July. The great bulk of the grain crop, however, is well advanced and harvest will shortly close on the heels of the hay time. Haying has been commenced in places and will be general next week.\n\nThere is a good show of rye hay, more than two or three years past and deserves the best attention for depending on swamp grass, which is less plentiful. All root crops are in splendid condition, and indicate an extra heavy yield. No potatoes where they have been sown, are excellent in quality, plentiful in quantity and free from the sort of scab that was not uncommon last year.\n\nThe area under crop in this district this season is only moderate in extent, but during the last few years have delivered more from ploughing as large an acreage as they might otherwise have done. In the interval between seeding and hay-time a good breadth has been put under process of summer fallow and new land has been broken in many cases, pointing to a larger extent for next season.\n\nLivestock of all kinds is in flourishing estate and altogether the farmers’ prospects are greatly more favorable than they have been of late years. The recent action of the Government in regard to the seed grain has given universal satisfaction, which the prospective early payment of the rebellion loss claims in no way detracts from.\n\nEDITORIAL NOTES\nWe have received another letter on the seed grain question from Mr. MacTaggart, but as both parties have had an equal opportunity of stating their views fully, and the question is regarded with considerable interest, we are afraid our readers are becoming tired of the discussion, we have considered it better in the interests of all concerned that the matter so far as our columns are concerned—should now be closed.\n\nNo one will be disposed to question the main theme of Mr. Wiman’s essay on “Unrestricted reciprocity” published in the Mail and Globe, and delivered at Dalfern Lake on Friday. Canada is unquestionably a country very rich in natural resources, and the American demands are, we think, just. But Mr. Wiman will have to talk much more to the purpose than in these picnic discourses before he will convince the Canadian people that America does not expect to get very much of the bargain he and his friends are now pressing on the attention of the Canadian farmer. The offer is most tempting, and it is possible that the principles involved are wholly without foundation; but, we repeat, the benefit attaching to Unrestricted Reciprocity may be purchased at too dear a rate. Indeed, the offer offered by these gentlemanly petitioners is a rare one, and, talked into purchase Commercial Union at such a price, the Confederation would do better to stand firm, if, as Mr. Wiman says, poverty, for another twenty years, the Canadian, with all its vast possibilities, is now ours at all events, a possession that any young nation may be proud of; and we will bid for it with a courage based on the old trading friar, what might our children say of us twenty years hence, when, their birthright sold, and the budding promise of Canadian nationality untimely snuffed out? We trust that the Canadian work only for himself. It cannot be too often pointed out that the difference that has appeared in the last ten years between the settler and the Englishman living here could be easily wiped out, and at the end of it all he gets his farm of his own, and the opportunity of leaving his heritage for his children. That is the difference. The English farmer toils for the landlord, the Canadian for himself. The Canadian work only for himself. It cannot be too often pointed out that the difference that has appeared in the last ten years between the settler and the Englishman living here could be easily wiped out, and at the end of it all he gets his farm of his own, and the opportunity of leaving his heritage for his children. That is the difference. The English farmer toils for the landlord, the Canadian for himself.\n\nMATRIMONIAL\nA pleasant event occurred at “Beltrice,” the residence of Mrs. Robert Campbell, at noon today, the occasion being the marriage of Miss Margaret MacTaggart, a niece of Capt. Craig of this place, to Mr. Hoson H. Murray of Beltrice.\n\nAt “Beltrice” also, the marriage of Mr. A. McKay in the presence of a number of friends, Miss Meyer, Buffalo, N.Y., and Mr. Murray, Buffalo, N.Y., proprietors of Buffalo as grocermen. Mr. Murray and his lovely bride for the east coast, and we hope they will be happy together.\n\nThe bride was made the recipient of a number of valuable presents, among them a set of silver tea things, presented to her by a friend who was present at the ceremony.\n\nIt is considered more than probable that Mr. Murray will cross the Atlantic this autumn.\n\nA SOUTH OPINION\nWe have already quoted from some of the excellent letters written by the correspondent of the Chicago Herald in regard to the proposed railway to connect with the Pacific Railroad, and we are glad to see that he makes the following interesting reference to the North-West.\n\n“Of the soil of the vast northern plains of the Canadian Northwest for milling purposes is clearly shown by the fact that the wheat grown there is as fine with the flour from Minnesota. The greater whiteness of the former is most marked, and the flavor and flavoring properties are such that superiority is not the result of rejecting any part of the grain, but simply due to the fact that the Manitoba flour takes rank as the finest in the world, and its supremacy is not attributable to the climate, but to the milling process, but solely to the superior quality of the grain. It is no mere figure of speech to say that Manitoba flour ultimately will, and will, will be the world’s greatest. The proof of the pudding is in the eating of it, and the proof of the flour is in the making of the best flour. In this capacity the wheat grown here, owing to the most influential climate, is unsurpassed, only eight or ten years old. The true comparison can only be made by those who have seen wheat grown in every country in the same time. How much farther on is a famous English proverb, but it points out that, to start without capital, which is not—after ten years work! He has made a living, and has saved a little money, and is penniless richer than he started; he has only Bread. Here, under the same climate, the same soil, the same living than he could earn at home, and at the end of it all he gets his farm of his own, and the opportunity of leaving his heritage for his children. That is the difference. The English farmer toils for the landlord, the Canadian for himself. The Canadian work only for himself. It cannot be too often pointed out that the difference that has appeared in the last ten years between the settler and the Englishman living here could be easily wiped out, and at the end of it all he gets his farm of his own, and the opportunity of leaving his heritage for his children. That is the difference. The English farmer toils for the landlord, the Canadian for himself.\n\nTHE WEST END STORE\nJUST ARRIVED, NEW GOODS\nAT\nCHAS. MAIR’S W ST END STORE,\nNursery Vellings in Cream and Light Shades, Persian Parker Rugs, Tapestry Curtains, Crimson Regals, Window Holland in Slate and Yellow Door Matts, Cloth Cloths, Silk Corded Cloakings, Empress Bath in Blue and Garnet, Fine Cretonnes, Ladies’ Felt and Embroidered Petticoats, Ladies’ Fancy Frillings, Beecoe Veiling, Ladies’ Silk Ties, Timsh, etc., etc.,\nALL AT LOW PRICES.\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds. Inspection is solicited.\n\nCALEDONIA BREWERY\nNEW FERRY.\nI wish to inform the public that I have been engaged by Messrs. New Ferry Boat at Carlton, which the travelling public will find a great convenience.\nThis is the safest and best way to Green Lake, Battleford, Edmonton and other places.\nTOUSSAINT LOUISEE.\n\nDartmouth Ropework Co.\nHALIFAX, NOVA SCOTIA.\nThe present is the right time to purchase\nEXPERIENCE\nTHE CHEAPEST\nA GOOD TWINE MUST BE STRONG AND EVENNESS\nWhich are contained in the highest grade of rope.\nDARTMOUTH ROPEWORK CO.,\n12 WELLINGTON ST. WEST,\nTORONTO.\nTOWN COUNCIL\n\nAn adjourned meeting of the Council was held on Monday evening last. All members present and Mayor Macnaught in the chair.\n\nThe principal business was the consideration of the laws.\n\nThe by-law to subdivide the town into wards or polling subdivisions, and the by-law to provide for the organization of police and suppression of crime, were each considered in committee of the whole, and the former was read a third time and ordered to be signed and numbered.\n\nThe Committee then adjourned.\n\nFor preserving and cleaning the teeth and healing the gums, try our Myrrh Tooth Paste at Clark's Drug Store.\n\nMr. G. Adams shows us what he has grown on his own farm, which measured fully 4 feet 6 inches high, and was very strong and healthy. This is not the longest or strongest to be found in the place, but other friends most likely will not dare to put the H. B. cup to its trial before going to Halton.\n\nIt appears that the dismission of the Federal Government from building a River Road from Fort Garry to a location in Winnipeg. The sensation was more reactionary-of course, it was thought that the road would not have been expected for some time. The excitement was temporary and soon cooled down, a deep feeling of satisfaction being felt whether finally allowed or disallowed the road would be built in due time. The discussion between the Provincial Government on this question for the past several weeks and the strong assumption made at the turn of the year recently, all tending to strengthen the impression and create a still further reliance upon the promises made by the government, has now quieted. It was hinted that the Federal government could prevent the promises by taking legal action. A prominent legal authority states that this action is out of the question, insisting that the provincial government has no law, or rather the constitutional right, on their side. How little the dissent manifested at that time was realized when the construction of the road is evidenced in the statement made by a member of the Provincial Board of Education. In the words of the matter the gentlemen in question said: \"The dissipation of the enthusiasm which had been aroused has been signalized by the act was in force when the contract was signed. It will be seen that the work is being pushed because the contractors are bound under their contract to finish the work in a certain time. It is therefore no surprise it was expected, but no official notification has yet been received. The contractors have made arrangements in order to provide the necessary funds to meet the requirements of the work as it progresses and the sale of the land will be made as soon as a better opportunity is offered.\"\n\nIt will also be seen that the Government has not interfered with the progress of the work, while for the benefit of remote settlers it may be mentioned to note that the road will be completed.\n\nMr. M.J. Haney stated last evening that he was not aware that the action of the Provincial Board of Education would cause any particular effect. \"A large number of men will be put to work under my supervision,\" Mr. Haney said, \"starting the right way and I am expecting they will complete their jobs by Saturday night. The surveying work is also progressing well.\"\n\nAt a meeting of the Workmen's Conservative Association at Winnipeg, Mr. J. E. Smith, of the association, stated that the association would consider any particular effects. \"A large number of men will be put to work under my supervision,\" Mr. Haney said, \"starting the right way and I am expecting they will complete their jobs by Saturday night. The surveying work is also progressing well.\"\n\nThe Prince Albert Times\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY\nPublisher and Proprietor.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERFORD\n\n\"BELL\" ORGANS\n\nUnsurpassed for Tone and Quality.\n\nCATALOGUE FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.,\n\nDressed Flooring, $4\nUndressed do., 42\nDressed Siding, 42\nUndressed do., 30\nSheeting, 35\nCommon Lumber, Dimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed\n\nDressed Flooring, $4\nUndressed do., 42\nDressed Siding, 42\nUndressed do., 30\nSheeting, 35\nCommon Lumber, Dimension do., 40\n\nOver 14 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of current European, Canadian and United States news.\n\nSpecial news reports compiled by resident correspondents throughout the Dominion and Western Territories and British Columbia.\n\nComplete reports of Provincial and Federal legislation at Ottawa and Winnipeg.\n\nTHE MORNING CALL alone receives the nightly newspapers in Winnipeg, and has news service unequalled west of the Mississippi.\n\nSubscription rates: One year $1; six months $0.50; single copies 5 cents in advance. Sample copies mailed free to any address on application.\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS\nPresident and Editor-in-Chief.\nEXHIBITION.\n\nClass I.—Horses—See, 1 pair,\n                           | 1st, $1; 2nd, $2; 3rd,\n                          Psoriarium, 146; 2nd, $2;\n                          Otsego, 2d, $2; 5th odd,\n                          Paddock, 1st, $2; ply\n                          Hansch, 2d, $2.\n\nClass II.—Agricultural and general\n                       |…|…|…|…|…\n                      Saxton, $1; Charles, 2d,\n                      Harrisville, 3d, $2;… |\n\nDays XII.—Heavy draught—See, 1\n                        Psoriarium, 1st, $1; 2nd, $2;\n                        Altman, 3rd, $3;… |\n                       …|2d, 2s|3d, 4s|…\n\nIV.—Native horses, mixed blood,\n\nClass B.—Saddled, mixed breed, 1st, 2d, $2; 3r, $3; 4th odd, $4;\n                            Hansch, 2d, $2; $3; Schönau, $4;… |\n\nV.—Native ponies under 14h\n\nClass C —1st., best colts, 1st.,\n                           Mt. Pleasant, 1st, $1; 2nd, 8c;\n                           Russell, 1st, $2; Specialty, 1st,\n                           Silverado, 1st, $3;… |\n\nG.—Clothing horses—See, 1 pair,\n                               Psoriarium, 1st, $1; 2nd, $2;\n                               Bordemill, 3rd, $3;… |\n\nC.—Other horses—See, over 1 year,\n                             Psoriarium, 1st, $1; 2nd, $2;\n                             Hansch, 1st, 2c;… |\n                            …|2s|3s|…|\n\nVI.—PENNY FESTIVAL.\n\nCows three years old, on milk,\n                                Ploughman, 8c;… |\n                                Lee, 8c;… |\n                                Babi, 8c;… |\n\nC. VII.—Sons by cows, best yearling\n                              Ploughman, 8c;… |\n                              Lee, 8c;… |\n                              Babi, 8c;… |\n\nMan strength, two hours, old\n                                         Crystal, 8c |…\n\nTotal weight carried in four thighs.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887072201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 6989, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 11013, 1], [11013, 21655, 2], [21655, 27654, 3], [27654, 29485, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]