[{"id": "2af9cc0e35f2b4b48d05dbccec56af351585f022", "text": "OBITUARY SERMON.\n\nThe following is a portion of the sermon delivered by the Rev. F. Macintosh, St. Andrew's Church, in the Cathedral Parish, at the funeral service of the late Mrs. Macintosh, wife of the Rev. Mr. Macintosh, of St. Andrew's Church, South Branch, on the 23rd of March, 1884.\n\nI have chosen this text as the subject of our discourse this morning, because it seems to me to be a very appropriate one for the occasion. We are gathered here today to pay our last respects to a dear friend and relative, who has passed away from us. We are reminded of the fact that death is the common lot of all mankind, and that we too shall one day pass away. But let us not be afraid of death, for it is nothing more than a transition from one state of being to another. We should therefore strive to live a life of holiness and virtue, so that when we do pass away, we may go to our eternal home in peace and tranquility.\n\nLet us also remember that death is not the end of all things. It is only a temporary separation from those we love. We should therefore cherish our loved ones while we have them with us, and seek to make their lives happy and peaceful. And when they do pass away, let us comfort ourselves with the thought that they are now in the presence of God, and that they will be reunited with us in the resurrection.\n\nLet us also pray for the departed soul, that they may rest in peace, and that their souls may be raised up to the presence of God. And let us also pray for ourselves, that we may be prepared to meet our Maker, and that we may be found worthy to enter into His kingdom.\n\nIn conclusion, let us remember that death is a natural part of the human experience, and that we should therefore seek to live a life of holiness and virtue, so that we may be prepared to meet our Maker, and that we may be found worthy to enter into His kingdom.\n\nBUFFALO HALL!\n\nClose Buyers Still Patronize\n\nOLD RELIABLE HOUSE.\n\nWe Need Money and are Willing to Sacrifice our Goods to get it.\n\nOver due accounts should be attended to at once to avoid costs.\n\nBETTS & GWINNE.\n\nHARDWARE!\n\nA FULL STOCK OF Powder, Shot, Caps and Shells.\n\nField Hoes, Spades, Garden Rakes, Shovels, Forks, Rope, Etc., at J. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and the United States promptly attended to.\n\nPRINCE ALBERT - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage in Prairie and Sechelt, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIGGERS, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884040401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 878, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 3048, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]