[{"id": "b55683313b639f5430cfdaf7e7be1b0aae9ed900", "text": "TOWN NEWS.\n\nSubscribe for the Times once every $2.50 per year.\n\nA match game will be played on the curling rink next Saturday evening at the Prince Albert Curling Club, Prince Albert, N.W.T.\n\nGeorge Miller took 6th place in the curling competition held in Prince Albert last week. He has been elected captain of the club for the current season.\n\nWholesale Clothing.\n\nJames O'Brien & Co.,\n\nPrincess Street, Winnipeg.\n\nT J AGNEW\n\nhas just received:\n\n5,000 feet Glass—14½x28, 16x30\n\nAxes and Handles,\n\nWhite Lead,\n\nCook Stoves,\n\nPowder and Caps,\n\nCutter Runners and Skoffs,\n\nLamp Chimneys,\n\nBuilding Paper,\n\nPacking Paper,\n\nUnion Curtains,\n\nTemporary Wools to arrive next month.\n\nWhole Sale & Retail,\n\nPrince Albert, N.W.T.\n\nWAREHOUSING,\n\nAT,\n\nFORT QU'APPELLE.\n\nThe undersigned having made arrangements with the lumber lords of Fort Qu'Appelle, have selected this point for the storage and sale of goods to be landed at Prince Albert and surrounding districts.\n\nIRON FOR SALE.\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT, N.W.T.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGrundy Bros. & Co.\n\nFort Qu'Appelle.\n\nGENERAL DEALERS.\n\nMAHAFETY'S GENERAL STORES.\n\nPrince Albert, N.W.T.\n\nCash Paid for Grain.\n\n**Wheat has dropped down to $1 per bushel.**\n\nMr. James Macdonald left for Qu'Appelle yesterday morning by railroad, but the weather was very bad. The wheat production is reported to be excellent, and Mr. Macdonald expects to make a good profit from his records.\n\n**Indian Supplies.**\n\nThere appears to be a slight modification in the supply of Indian goods this fall. Many Indians have been advertised for early in the fall, about the end of September, in each district. The hunting season for the Indians is now over and it was rumored that they would be purchasing Indian supplies from the Indian Agency, which the vendors could purchase from the Indians directly.\n\n**Blacksmithing**\n\nHorseshoeing,\n\nCarriage Repairing,\n\nSleigh Ironing.\n\nJobbing of all kinds done on the shortest notice.\n\n**R. J. O'LÉARY.**\n\nProprietor.\nTHE PRINCE ALBERT TIMES\n\nWEDNESDAY, JANUARY 31, 1883\n\nEDITORIAL NOTES\n\nThe Dominion Parliament assembled on the 8th of February, for the dispatch of business.\n\nWe wish to inform the public that we have severed our connection with Mr. Fitz-Clarkson. The public are kindly requested to send all communications and other business direct to the office.\n\nThe Dominion Government has granted one million acres of land alongside of the Prince Albert Settlers' Road, from the Red River to the Land and Colonization Company of Canada, organized by the Rev. A. J. Bray, of Montreal. The Company has a capital of $50,000.\n\nApplications for Letters Patent have been made by the Manitoba and North-West Coal Mining Company, the North-West Lumbering Company, and the Alberta Lumbering Company. The latter Company has not yet been organized by Col. Dennis, late Deputy Minister of the Interior, for the purpose of acquiring by purchase, lease, license, or otherwise, any or part of mineral and coal lands in the District of Alberta, in the North-West Territories, or elsewhere in the Dominion of Canada, and to work and develop the resources of the same.\n\nAmongst the new railway projects is one to incorporate a company to be called the \"Northern James Bay Railway Company,\" to construct a railway from a point on the \"Quebec and Lake St. John Rail-way\" to a point on or near the coast of James Bay, and another proposed line is an extension of the same destination, the promoters of which are desirous of securing grants from both the Ontario and Dominion Governments. We think it almost a pity that the Prince Albert settlement has been allowed to drop.\n\nThe appointment of the Bishop of Troo as Archbishop of Canterbury has been received with general satisfaction by all parties in the Church. Ritualists approve because their personal sympathies are with the High Church. Their opponents approve because his views of his administrative duties as Primate make him being practically a Broad Churchman. Gladstone deserves some applause for his magnanimity in appointing a Tory, but Mr. Gladstone cares far more for ecclesiastical than political orthodoxy. The latest information makes Dr. Hume acceptable, beyond which very certain doubt.\n\nOur exchanges to last month contain the intelligence of the death of President Gambetta. The death of a statesman of such ability and experience is a loss to any country, and though the French Republic is not in its normal condition, the same country as formerly, the republic would probably have been all the better for a continuation of his services. There was, of course, the danger of his being a time eater, and his attempt to disturb peace and the danger of his becoming directly or indirectly the cause of another Franco-German war. Of the former there was little probability, of the latter there was at least a possibility.\n\nThe Bytander has been restructured, and in its first number considers itself a paper to the North-West. It takes, as its concealed delight in publishing the fact of the collapse of the large majority of the colonization companies that have been set about from time to time.\n\nThe Globe, in making the remark referred to in the Bytander, takes credit to itself for having been led into bringing up the subject.\n\nOur Toronto correspondents may have some further and better knowledge of the situation of the Canadian North-West Railroad, and the question of emigration to the neighboring Republic, and thwarting every scheme for the settlement of this glorious country, this goodly forest, and this beautiful land, and has communicated to us that the Globe has nothing particular to bring about.\n\nCANADIAN NORTH WEST\n\nThe Department of Agriculture at Ottawa has in self defense felt compelled to publish a pamphlet containing the facts and figures and statements laid forth by the North-Western Pacific Railway Company. The misrepresentations referred to are to be found in a booklet printed in New York, and issued by the North-Western Pacific Railway, and bearing the high sounding title of \"The Reliable Guide to the American North-West.\" The pamphlet is half printed and when a map showing the line of the North-Western Pacific Railway from Duluth at the head of Lake Superior westward to the ocean, and has been very widely circulated by the agents of the company.\n\nAmongst the new railway projects is one to incorporate a company to be called the \"Northern James Bay Railway Company,\" to construct a railway from a point on the \"Quebec and Lake St. John Rail-way\" to a point on or near the coast of James Bay, and another proposed line is an extension of the same destination, the promoters of which are desirous of securing grants from both the Ontario and Dominion Governments. We think it almost a pity that the Prince Albert settlement has been allowed to drop.\n\nThe appointment of the Bishop of Troo as Archbishop of Canterbury has been received with general satisfaction by all parties in the Church. Ritualists approve because their personal sympathies are with the High Church. Their opponents approve because his views of his administrative duties as Primate make him being practically a Broad Churchman. Gladstone deserves some applause for his magnanimity in appointing a Tory, but Mr. Gladstone cares far more for ecclesiastical than political orthodoxy. The latest information makes Dr. Hume acceptable, beyond which very certain doubt.\n\nOur exchanges to last month contain the intelligence of the death of President Gambetta. The death of a statesman of such ability and experience is a loss to any country, and though the French Republic is not in its normal condition, the same country as formerly, the republic would probably have been all the better for a continuation of his services. There was, of course, the danger of his being a time eater, and his attempt to disturb peace and the danger of his becoming directly or indirectly the cause of another Franco-German war. Of the former there was little probability, of the latter there was at least a possibility.\n\nThe Bytander has been restructured, and in its first number considers itself a paper to the North-West. It takes, as its concealed delight in publishing the fact of the collapse of the large majority of the well known facts as respects the sea.\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nThe Only First-class Newspaper in the Saskatchewan District.\n\nThe Best Newspaper in the N.W.T. to advertise in.\n\nGREAT SUCCESS!\n\nCirculation Increasing Daily\n\nNOW IS THE TIME TO ADVERTISE\n\nAdvertise.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationary, which unfortunately was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETY,\n\nPROPRIETORS\nALARGESTOCK ARRIVED A FEW DAYS AGO AT THE MEDICAL HALL, CONSISTING OF Drugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc., AND ARE NOW OPENED OUT, ALSO ON HAND A GOOD SUPPLY OF Patent Medicines, INCLUDING Fellow's Syrup, St. Jacob's Oil, Electric Oil, Pain Destroyer, Black Oil, Burdock Blood Bitters, Vegetable Discovery, Cod Liver Oil Emulsion, Medical Discovery, August Flower, Etc., Etc.\n\nTERMS--CASH.\n\nT. E. JACKSON,\nIn our New Premises, next door east of Farmers' Home and north of Old Presbyter Church.\n\nHORSE SHOE STORE.\n\nEvery one should follow this moral and save money by going to the Horse Shoe Store. Look at the reductions.\n\n$2 Moccasins $1 50\n$2 Mitts $1\n\n75 cent TEA 50 cents.\n\nT. THOMAS O. DAVIS.\n\nGRAND UNION Livery & Sale Stables,\n\nHugh McDougall's BREAD!\n\nHugh McDougall, Prop.\n\nReal Estate FOR SALE A NUMBER OF CHOICE BUILDING LOTS\n\nPRINCE ALBERT\n\nC. MAIR, P. O. DRAWER.\nTHE LICENSE QUESTION\n\nTo the Editor of The Times:\n\nSir,—In your column of A.W. last you state in substance that \"prohibition laws are not effective in liquor traffic by license.\" Is it possible that right and lawful legislation has no effect to restrain the malicious or present evil? We believe that the question will be kindly permitted to give a brief statement of the views of the undersigned as to the question simply on the statute book. The prominent aspect of administration power is the granting of licenses. This is the main object of the legislation. The permits are given to persons who purchase for the purpose of selling. The sale is made to the consumer on the spot. This is the only justification. Every temperance man and woman who are not, both by policy and practice, opposed to the consumption of intoxicating drinks, in the present state of things, will be found to be in favor of an order so generally prevalent as spring from the partial existence among the people of a strong party doubtless on the matter, that such an order, even in this town, would have been impossible. It is a fact, clearly seen that this restrictive legislation, even in its present imperfect form is more advantageous to the public welfare than the absence of any permanent restraints whatever; whatever temporary benefits can be obtained. The gain is all on the side of the administration, pure and simple. The principle may appear ridiculous. The adoption of such a measure by the two great nations and the United States have proven itself constitutional. What is the principle? Now, has a similar constitutional right been given to the administration to control the public welfare or dangerous to the public? Unlawful statutes, too common for our taste, are being enforced by the fact apparent, that the courts in enforcing liquor administration laws, are allowing liquor to be sold. Concerning for arguments sake the non-enforcement of the law, it was once thought that the sellers were merely the expression of common sentiment in this country, but now it is evident that they are bought into by legislative influence. It breaks through all existing influences, destroys the moral sentiment, infecting towns and purchasers. Like a wild beast which cannot be tamed, so the liquor trade cannot be restrained. They have the right in principle, however, through the power of the government to secure the protection of the law, the burdens of prosecution, taxes, and duties by the liquor trade. In this connection, we protest against those who would allow animals from near and distant, and the like, with the sale of poisonous drugs. It is sometimes seen in seeking to secure profits before the popular conscience is educated in the same manner as in the land race by the will of the people. It is impossible to condemn an amendment to the Constitution, if the law had been enforced, the relative drunkenness of the community has enormously increased. This is the important thing to know. That it is impossible to frame a prohibition legislation which the officials appointed to enforce it will not constitute a farce, is clear from evidence of one out of many thousand witnesses. Joshua Chamberlain, an ex-servant of Maine, New President of Bowling Green, says, \"The law is well executed in this State as other similar laws are.\" Temperance reformers do not want the law to be enforced, but to advance the laws, and make whatever use of public interference and desire to see the public drunk in grace, so that the laws shall be obeyed. We see no reason why the laws should be disobeyed. Under the influence of drinking debauch, human folly thinks that the fires of perdition gleam, and no work or strong minded man now the nearest shore of death. The laws shall be broken in all homes by the waves of temptation, as the dawn of the shades before the whirlwind, and in no home shall women tremble at the sound of the ringing footsteps of men whose souls have striven to win back from this fast track, and might have succeeded had not some vendors of intoxicants at a moment's call, and without warning, thrown broken beer bottles, and brought into the house scenes which repel thought as repulsive as the sight of a madman. We see no reason why the laws should be disobeyed.\n\nJ. O. DAVIS & CO., Wholesale slaughter of Winter Goods. Every article down to rock bottom prices for cash over the counter. Ready-made Clothing on second floor.\n\nPRINCE ALBERT AND SOUTH BRANCH, N. W. T.\n\nINDIAN DEPARTMENT TENDERS\n\nWoodbine Restaurant\n\nOVER THE HILLARD HALL\n\nRIVER STREET\n\nTOM DAVIS, PROPRIETOR\n\nLOST.\n\nA REGULAR MEETING OF\n\nChristina Lodge, A.F. & A.M.\n\nwill be held in the Masonic Hall, Prince Albert, on\n\nFriday, February 2nd, at 7 p.m.\n\nVoting will commence at 6 p.m.\n\nBrother J. W. Kennedy, Sec.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883013101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 7610, "total-output-tokens": 3335, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2013, 1], [2013, 8304, 2], [8304, 8814, 3], [8814, 9758, 4], [9758, 14549, 5]], "primary_language": ["en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]