[{"id": "4ca3daa03e2911abc5124bdf45ce6b613f45d5c2", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nEDITORS BY\nJ. D. MAVETY\nPRINCE ALBERT, N.W.T.\nFRIDAY, OCTOBER I, 1886.\nThis paper may be bound in volumes.\nNEW YORK.\nSUNDAY CHURCH SERVICES\nSt. Mark's Church and\nThe Moravian Chapel.\n11 a.m.—Rev. Mr. McCaffery, in charge, the Rev. Mr. Wilson assisted by Mr. Cunningham, Theological student.\nHis Lordship's Church will preach at a service at St. Mark's Church in the morning and at the Chapel in the evening.\nSt. Catherine's Church.\n11 a.m.—Rev. Mr. Wilson, B.D.\nSt. Paul's Church.\n1 p.m.—Rev. Mr. Smith, B.D., St. Andrew's.\n7 p.m.—Rev. Mr. Wilson.\nSt. James' Church.\n3 p.m.—Rev. Mr. McCaffery, B.D.\nSt. Anne's Church, Catholic.\n9:30 a.m.—Rev. Mr. Macdonald, Missionary.\nSt. Paul's Presbyterian Church.\n11 a.m. and 7 p.m.—Rev. Mr. McMillan, B.D.\nHOTEL DEER HILL AND ISLAND LAKE.\nWe have received from Mr. Wilson a list of rates for rooms, &c., at Deer Hill Hotel, Island Lake, etc., and have added them to our list of prices.\nFRIDAY, OCT. I, 1886.\nTHE PARTY PRESS.\nWhile we do not believe in the party press being so many party slaves, who must do the bidding of a political party, they do, however, serve the cause of party government; but we cannot but regret that newspaper claiming to reflect the principles of our institutions and to appeal to them upon themselves to resurrect dead issues, and create national and religious strife, should be permitted to become the chief influences of party government. We have to deal with living issues. We have to deal with living issues and days gone by things were not just as they should have been; that is none of our business. Because such a state of affairs may have existed, there was a lack of good sense on the part of our forefathers; it is better now than then; we have to have a great deal more of common sense; to have a stronger faith in the common brotherhood of mankind; to be better Christians and better citizens; hence, we should see to it that we do not forfeit our right to consider our actions and our country's actions in place in the world within which there were so many conflicting interests as in the British North American Union. Confederation was required to be a cause for all these differences. Under every man has his own idea of what is religious or otherwise. Old bonds were settled, and the future could only be anticipated by those who had confidence in God. Does it not seem now impossible to the extreme, even criminal, to resurrect old bonds, dig up old skeletons from the political graveyard? We must look toward a new life, as is being done to-day by leading journals of both political parties and by many of our religious leaders. There is no excuse to say that because one journal is guilty of such an offence, another is justified in doing the same thing. We know George Brown said many very hard things about Orangemen and Catholics, and because he said them, the Orangeman, lodge, and like facts, should not be allowed to interfere with living national interests. Sir John Macdonald, at the Conservative banquet in London, Oct. 16th, showed why the most convincing manner can be dangerous, by the insinuation of race and religious issues upon the political arena. After dwelling at length on the difficulties of the situation as he referred to the press of the country, he said the Conservative press was independent, while the Liberal press was subservient. He endorsed this fact because he did not feel bound to be responsible for the views expressed in any press. If the press of Canada or Great Britain would only know for whom they work, they would be in a far better condition. His lordship declared that the difficulties of real life, external to those affecting Parliament, are far more pressing than those of a purely religious character. Even though the last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held.\n\nEDITORIAL NOTES.\n\"Bonanza Mackerel\" recently passed over the Canadian Pacific, and says he was very surprised at what he heard. In conclusion he says, \"A large quantity of read has entered this town from Prince Albert, and there is a great future in store for this district. We are glad to hear that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held. His lordship declared that the Marquis de Montebello wrote his last letters or articles in the Marquis de Montebello's works were written by him, they came to different conclusions from those which he had previously held.\n\nSTOVES.\nBox Stoves.\nParlor Heaters.\nBox Heaters.\nVI Toria Drums.\nCamp Heaters.\n3 Story Drums.\nCoal Oil Stoves.\nCylinder Drums.\nPansy Drums Made to Order.\nStoves and Stovepipes put up and cleaned.\nGLASS GLASS GLASS\nPrices the Lowest in town.\nT.J. AGNEW.\nWM. STOBART & CO.\nGeneral Merchants\nIndian Traders.\nTHE WEEKLY SUN!\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\nPAYABLE STRICTLY IN ADVANCE.\nTHE WEEKLY EDITION WILL CONTAIN\nThe News of the Week,\nSelected Miscellany,\nAn Interesting Serial\nand Special Departments of Peculiar Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor every where.\nTHE MANITOBA SUN,\n12 Market St. E.,\nWinnipeg, Man.\nJ. SINCLAIR & CO.,\nC. D. NORTHGRAVES,\nMerchant Tailors.\nAt T. N. Campbell's New Star\nNEW GOODS!\nJUST ARRIVED.\nGENTS' FURNISHINGS\nKept Constantly on Hand\nRepairing Promptly Attended\nJust arrived...\nNOTICE.\n\nST. LAURENT FERRY.\n\nGOOD STEEL CABLE.\n\nThe Snow Coaches in Upper Missouri, Great Bend.\n\nNotice.\n\nA SALE OF CAST HORSES\n\nExchanging the N.W.M.F., will take place at Qu'Appelle Station, ON Friday, the 15th of October Next.\n\nBy Order,\n\nW. BURTON DEANE,\nSuperintendent and Adjutant.\n\n\"BELOW\"\n\nORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\n\nCalomminin and Paperhanging on short notice.\n\nDecorative Painting a Specialty.\n\nNOTICE.\n\nMATRIMONIAL AGENCY.\n\nEstablished to supply settlers in Canada with the addresses of respectable single ladies who desire to make marriages with bona fide Tradersmen, Farmers and others desirous of meeting with suitable partners.\n\nThey will be supplied from the agencies of Scotland and Wales, as well as the Counties of Europe.\n\nApplications should state their particular requirements and preferences, and also the amount of money they can afford immediately. Beyond these it may be necessary to make some allowance for the expenses of the marriage.\n\nJENSEN & CO.,\nStationers, Plotters, London, England.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 40 Spruce St., New York.\n\nSend order for 100-pp. Pamphlet.\n\nFOR\n\nGENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowelings,\n\nDress Goods,\n\nSilks,\n\nLinen, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\" \" Over 16 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nLorne Agricultural Society Dinner.\n\nThe 3rd Annual Exhibition of the Lorne Agricultural Society, consisting of which we will give a full report next week, and which we will conduct our series this week, was held at the dinner in the evening of fifty gentlemen members and friends of the society, who came down to the dinner in the Park Hotel. Previous to the supper the P.A.C. Band assisted at the dinner in transmitting their musical talent in the selection of music in their usual excellent manner.\n\nAfter the gentlemen had made a very exhausted test of the different courses provided by the host, and pronounced them first class, dinner was served.\n\nPresident Craig announced the intellectual part of the proceedings by proposing the usual loyal toast, which were received in the usual manner.\n\nThe next toast was the Lt.-Governor and Governor General, coupled with his name, the latter being the Governor in the latter terms to Lords Lorne, Dufferin, and Lansdowne, expressing it as his opinion that the present Governor Generals were all men, the latter possessing the brightest intellect of any man ever placed in such a position. It was considered an honor to have Governor General Macdonald a good man.\n\nThe Army and Navy was responded to by Capt. Henry, who considered the British troops the best in the world, except perhaps, the Canadian volunteers and the Royal Marines.\n\nThe Society Judges was responded to by Mr. Conners, of Carrot River, who said he thought the exhibition was only a farce. He was pleased to be present and nothing could be said for the Society, and that not the least credit was due the district.\n\nMr. Craig, vice-chairman, then proposed the North-West Council, coupled with the name of Mr. Hugh M.N.W.C., in doing so he referred in complimentary terms to Mr. Dewdney, and expressed his hope that the North-West Council would soon be succeeded by a Legislative Assembly.\n\nMr. Miller replied at length. Speaking of the School Board, he said the elected members had managed to have the money granted for school purposes by the Dominion government placed at the disposal of the members of the Council, and that was the reason schools had been opened in the district. He thought the elected members of the Council should have control of North-west schools, and should be representatives of the people. This was the first time he had returned thanks as an Agricultural chairman, and he hoped the North-West Council would be the last, but before another exhibition of the Society the Northwest would have a Legislative Assembly.\n\nMr. Craig next proposed Kindred Societies, coupled with the name of the Carrot River Agricultural Society. In doing so speaking of a visit he had paid to the Carrot River country some three years ago, he spoke of the very remarkable improvement he had seen.\n\nMr. Chas. Robertson, President of the Carrot River Agricultural Society, replied in behalf of that Society. He was afraid he would have to apologize, as he was not speaking for the Carrot River Agricultural Society. He thought the Kindred Societies the finest kind. What would Ontario be today without Agricultural Societies? They brought together their products together and was a means of improving stock. They thought they should have control of the Kindred Society was not in the same position as the Lorne Agricultural Society. It was carried on a grand scale, and striking along unaided. He was pleased to be present at the exhibition, and to notice the marked improvement. The time was not far distant when Prince Albert would have its Central station, and he hoped in that time, he hoped also to see the day when Prince Albert would be as large as Prince Albert was today.\n\nMr. Macdonald proposed the Masonic Institution, coupled with the names of Messrs. T. Agnew and J. Stewart. Mr. Stewart replied briefly, thanking Mr. Macdonald for his remarks, and in the way in which he had referred to the merchants. Referring to the agricultural interests, he said the merchants were sold without any consideration, and in view of the interests of the merchants to encourage agriculture.\n\nMr. Agnew then thanked these present for the way in which the toast was received. He thought the exhibition had been a success, and expressed his satisfaction that spectators should have been appointed to protect articles from being taken away, and hoped they would be appointed in future.\n\nThe Secretary made some explanation concerning the Society's losses, and explained his regret that Mr. H.B. cup had not been competed for, owing to the fact that the quantity of grapes purchased by Mr. McMillan was too few. Referring to Mr. McMillan, who was always a good friend of the Society, he said that gentleman had divided up into small prizes. He proposed the health of the donors of the prizes, and that was responded to by Messrs. Macdonald and Macleod, who returned thanks.\n\nMr. L. Macdonald, after expressing his pleasure at the successful exhibition and throwing off a few friendly hints to the directors, sang \"Frans of Orders.\"\n\nMr. J. Stewart then proposed the health of the successful exhibitors, coupled with the names of Mr. Craig, Conners, Miller, and McMillan. In doing so he mentioned the fact that on his recent trip to Winnipeg he visited the fair, where he saw a number of which he had heard so much, and that Mr. McMillan and Mr. Riddell, and a number of others present by those gentlemen had won a sample of what was exhibited. He had also shown it to Com. Murray Smith, who was well pleased with it, and he was glad to send it to Ottawa. He thought this fact solved the problem as to whether wheat could be grown in the district.\n\nMessrs. Thomson and Miller returned thanks.\n\nThe Town Council was proposed by Mr. McPhail and responded to by Mr. Conn Brown on behalf of the Council. Council presented a complimentary address, which was eloquently responded to by Mr. John Macdonald, who concluded by saying that he looked for Mr. Ogilvie for such a fine hotel as the Queen's, which were given.\n\nThe President next proposed the President of the Lorne Agricultural Society, that a few hitchcocks had occurred during the exhibition, and that some had acted improperly.\n\nThe Time-man, after having asked whether he was the culprit or not, and placing himself in retirement, took for the time being the place he was pleased with the exhibition. He had done all he could to make the exhibition a success, and hoped it would be full to give a full report of it.\n\nThe Ladies were represented by Mr. Conners, and Aborn Friends of Mr. Conners.\n\nThe health of the Secretary being drunk was responded to Mr. Clark at some length.\n\nAt this stage the proceedings were interrupted by an individual with an electric light, who gave a violent speech in his boast of the progress. He proceeded to say, but our reporter was asleep during the proceedings, and consequently was unable to thank the chairman and singing the National Anthem, the company broke up.\n\nThe latest despatches.\n\nWINNIPEG, Sept. 29th.\n\nNo further particulars yet respecting Hudson's Bay Railway negotiations. It is generally reported that nothing has been decided beyond the question of joint government. Sutherland is expected to arrive here Friday morning.\n\nCravens, who has been engaged in the Winnipeg, took place today. The ceremony was performed by the Lt. Gov. and Judge McCann.\n\nThe Provincial Fair was opened on Wednesday by the Lieutenant-Governor, who was also made by members of the government, the other day. About 3,000 entries were made, half as many more than last year.\n\nReturns of Manitoba crops have been made to Ottawa. They are said to indicate an increase.\n\nThe second batch of the Salvation army, has arrived at Ottawa.\n\nYesterday was the day on which the election was held. While it was said to have taken place, but it is uncertain.\n\nColonel Taylor, Winnipeg, met with an accident near Nepean, Dufferin county. He was thrown from the stage coach, and having his right leg fractured in two places above the knee. At last news came that he was recovering.\n\nHanlon has arrived in England, but hasn't refused to come back.\n\nMcCarthy has arrived in New York.\n\nSerious lack has been prevailing in Southern Manitoba.\n\n---\n\nBuffalo Hall!\n\nMaking Room for Fall Stock.\n\nDry Goods and Clothing Sold at Heavy Discounts.\n\nGroceries Reduced.\n\nNo Reserve.\n\nBETTS & GWYNNE.\n\nAT Lowest Prices,\n\nBuilding Hardware, Locks, Hinges, Glass, Putty, Paints and Oil,\n\nPOWDER, SHOT AND LOADED SHELLS.\n\nN. B.—A large Supply best American Coal oil\n\nAT\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\n\nSideboards, Cupboards, Bureaus,\n\nWashstands, Sofas, Easy Chairs,\n\nBedsteads, Mattresses, Co's, Cradles,\n\nAnd all kinds of Chairs, Etc., which I am Selling at 100 Per Cent Below Former Prices.\n\nPlease Call and Inspect my Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nW. B. GOODFELLOW.\n\nSTOVES!\n\nCook Stoves, No. 8, $27\n\nCook Stoves, No. 9, 30\n\nBox and Parlor Heaters\n\nAT ALL PRICES.\n\nPiping and Drums and other Tinnersware of every description made to order and warranted first-class.\n\nJ. R. McPHAIL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886100101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4382, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7125, 2], [7125, 9269, 3], [9269, 18455, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]