[{"id": "8298a0fb6fd8385ada7f1d39a5fd427c916531fc", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 28, 1885.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTrades and Bankings Banking Business.\nInterest allowed on Deposits.\nDrafts issued available at all points in the Province.\nCollections undertaken and promptly returned.\nBANKERS—Merchant Bank of Canada\n\nWILLIAM V. MACLUSKIE,\nNotary, Etc.\nOffice—McCallum's Building, between J. O. Davis & Co. and Bette & Goymer.\n\nSTEPHEN BREWSTER,\nSolicitor of the Supreme Court of Justice of the Province.\nNOTARY PUBLIC.\n(Late McLean & Elliot.)\nPRINCE ALBERT, SASK.\n\nFORRES & NEWLANDS,\nBarristers, Notaries Public.\nOffice—Over T. N. Campbell, Stationer.\nPRINCE ALBERT, SASK., N.W.T.\n\nF. F. FORRES,\nH. W. NEWLANDS.\n\nW. R. GUNN, SASK.,\nBarrister, Solicitor Public, Conveyancer.\nOffice—Over Mr. Newlands.\nPRINCE ALBERT, SASK.\n\nDE A. STACKHOUSE,\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nFURNITURE\nCHEAPER THAN EVER.\nGILBERT E. CARTER,\nA.W.R. MARKLEY,\nGen Agent and Auctioneer.\nAGENCY:\nConfederation Life Association, Toronto.\nSinger Manufacturing Co., of New York.\nIssue of Marriage and Billiard Table Licenses.\nOffice—In Mr. Brewer's Office.\nPRINCE ALBERT\nPlaning Mills and\nSash and Door Factory.\nCORN, HARVEST AND MACLAY'S\nSash, Doors, Frames, Halls, Mouldings and\nBuilders' Furnishings made on the shortest notice.\n\nA. GOODFELLOW,\nPrince Albert, N.W.T.\n\nEAST END BAKERY\nBREAD unsurpassed by any west of Winnipeg.\nKind of Cakes and Pastries made to order.\nHUGH M'DOUGALL,\nEast End Bakery.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nCalomining and Paperhanging on short notice.\nDecorative Painting a Specialty.\n\nGEORGE A. BENTLEY,\nBarber and Hair Dresser.\nMODERATE.\nShop—First Door east Shangon & McLeod's.\nJ. D. HANNAFIN,\nAuctioneer and Commission Agent.\nOFFICE—FIRST STREET\nCITY BILLIARDSALOON\nCorner Church and Nesbit Street.\nChoice Beer and Cigars always on hand.\n\nALEX. LANG,\nGENERAL BLACKSMITH,\nHas opened a shop in the east end, directly opposite the H. B. Co.'s new mill.\nHandy service—prompt attention—whitening done promptly and cheaply.\nAll kinds of Hardware—Blacksmith Repairs—and put in order.\n\nW. R. GUNN, SASK.,\nBarrister, Solicitor Public, Conveyancer.\nOffice—Over Mr. Newlands.\nPRINCE ALBERT, SASK.\n\nDE A. STACKHOUSE,\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nFURNITURE\nCHEAPER THAN EVER.\nGILBERT E. CARTER,\nA.W.R. MARKLEY,\nGen Agent and Auctioneer.\nAGENCY:\nConfederation Life Association, Toronto.\nSinger Manufacturing Co., of New York.\nIssue of Marriage and Billiard Table Licenses.\nOffice—In Mr. Brewer's Office.\nPRINCE ALBERT\nPlaning Mills and\nSash and Door Factory.\nCORN, HARVEST AND MACLAY'S\nSash, Doors, Frames, Halls, Mouldings and\nBuilders' Furnishings made on the shortest notice.\n\nA. GOODFELLOW,\nPrince Albert, N.W.T.\n\nEAST END BAKERY\nBREAD unsurpassed by any west of Winnipeg.\nKind of Cakes and Pastries made to order.\nHUGH M'DOUGALL,\nEast End Bakery.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nCalomining and Paperhanging on short notice.\nDecorative Painting a Specialty.\n\nSASKATCHEWAN\nRIFLE ASSOCIATION.\n\nThe first meeting of the Association will take place on its rifle ground, Prince Albert, on Tuesday, September 1st, when the following matches will take place:\n\nLadies Match—400 yards, seven shots, 20 prizes; value, $100. To be shot for by competitors chosen by the lady president.\n\nMen's Match—200 and 400 yards; 20 prizes; value, $100 open to all members.\n\nAssociation Match—200, 400 and 600 yards; 5 shots each range; 24 prizes; value, $100.\n\nTeam Match—200, 400 and 600 yards; one prize; $40.\n\nEntries must be submitted at 9 a.m.\n\nEntries for Ladies match close Monday evening.\n\nEntries for other matches close at 12 o'clock day of match.\n\nNo entries taken for a match after firing has commenced in it.\n\nS. BREWSTER,\nSec-Treas.\n\nCALEDONIA BREWERY\nEAST END.\n\nThe proprietors of the above concern are prepared to supply families or residents with beer, either in bottles kept, for cash.\n\nFirst Bottles, 85¢ per dozen.\nSecond Bottles, 75¢ per dozen.\nThird Bottles, 65¢ per dozen.\nFourth Bottles, 55¢ per dozen.\n\nAny sized casks delivered to all parts of the town.\n\nA Billiard Table and Saloon\nIn connection with the Brewery.\nThe Best Cigars always on hand.\n\nCHAS. WOODMAN,\nPROPRIETOR.\n\nNOTICE\n\nI beg to notify those persons interested who have purchased Lots on the Manson property, subject to building conditions that the time has been extended to the FIRST OF NOVEMBER NEXT, And after that date the building conditions will be strictly enforced.\n\nHUGH J. MONTGOMERY,\nAgent.\nBy order of the Foreign Mission Committee.\nPrince Albert, August 10, 1885.\n\nNotice to Creditors.\n\nThe creditors of William Stewart, late of Prince Albert, in the North West Territories, deceased, whose death occurred on the 1st day of August, A.D. 1884, and all others having claims against his estate, are hereby notified that the same will be paid out of the Prince Albert, merchant, on or before the 30th day of October next, by the undersigned, whose name and address are shown on the full particulars of the estate, and the names of the securities (if any) held by him, together with the amount due thereon, after the said 30th day of August, the amount due on the said estate being stated in the distribution amongst the parties entitled thereto, having regard only to claims of the creditors, and not to any other claim required. The undersigned will not be responsible for any person whose claim note shall have been received at the time herein mentioned.\n\nJOHN MONTGOMERY,\nAdministrator.\nBy W. H. Gann,\nhis solicitor.\nDated this 30th day of July 1885.\n\nNORTH-WEST NOTES.\n\nCALGARY.\n\nAfter Crowfoot,\nCALGARY, Aug. 12.—A party consisting of thirty-two non-coms. officers and men from the 14th Battalion Col. Macleod started yesterday for the Blackfoot camp. The party went down by the trail leaving the old waggon to go by days train. The object of the trip was to make some arrests. We believe that the Colonel means to go through with it.\n\nThe Calgary Herald says the general opinion in legal circles seems to be that if the case were tried in this case it would go far. As the case stands now, it will not go any farther. As the main points in the prisoner's case already been adjourned up to the Commissioner, it would seem probable that the jurisdiction of the Regina court will be confirmed, and that Mr. Justice will meet the fate he so well deserves.\n\nEDMONTON.\n\nEMERSON, Aug. 11.—Stage left on Friday morning with two passengers—James Wilson, who came from Calgary, who had been laid up for two weeks or two with an injured hand.\n\nCounty Court Costs.\n\nMr. Justice Wilson, while trying cases which regulates the scales of costs in cases tried before A.J. P. in this great and free country, said that the county court costs, which one dollar fine is inflicted amount to $10 to $15, it is time that people knew where the dividing line between legal proceedings and highway robbery is to be found.\n\nMr. Wilson, who visited the Island, Mr. Agnew, with his wife and family, intends visiting his home on the Island shortly before returning.\n\nThe steamboat North West came to yesterday evening. She left here a few days ago and on her way back landed at Edmonton. She had been there, on account of low water, she took the latter's freight and passengers, Mr. D. J. Smith, Mr. Wilson, Mr. Alex Campbell, Mr. Ross, and family, came back, and went up to Battleford.\n\nThe first printing of the Saskatchewan Leader was printed Saturday afternoon, when press amounts to about $40 in cash and value will be given away. It is said that the Leader will be printed every day thereafter, unless the Stoller will be allowed, which may be had from Mr. J. Wilson, who is the owner of the paper.\n\nThe steamer North West arrived down from Edmonton on Sunday evening. On Monday morning she was loaded with three days for repair. She will make one more trip to far north, carrying 1,700 tons of grain and 40 tons of freight. Mr. Ross, of the H. B. Co., and Mr. McPhail left by the North West for the east.\n\nThe annual meeting of the Anglican Curling Club will be held tomorrow evening last at Mr. Bradner's residence, to organize officers for the coming year, and transact other important business. Among others elected are Mr. Howie, H. Bishop, President; R. D. Maclean, Vice-President; R. D. Maclean, Sec. Treasurer. Step is to be taken towards purchasing a club-house. It was also decided that the medal won by the late Mr. D. McPhail, last winter, be presented to father together with a letter of thanks.\n\nThe following question was answered by Capt. Appleyard Tuesday night: John McRee, M.P.P.; Mr. Winningham; Captain Farley, of B Battery; Thomas Spence, Esq.; Crown Commissioner for the East, Mr. Murray; Inspector Deputy Sheriff Ross and Indian Farm Inspector McKay, who have been attending as witnesses in this case. In reply to the question, the party, we understand, had a very pleasant trip, although they came to grief about twenty miles from their destination, owing to the snapping of a wheel, notwithstanding the watchword—\"Be careful of what you wish.\"\n\nThe work of the commissioners has already commenced, which shows the energy of the commissioner. Mr. Murray, who arrived on Tuesday evening, says that the work will be well made, and we understand the field work will occupy each commissioner about six weeks. The report of the commission will be compiled and ready for presentation to the House of Commons early next spring at Ottawa.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nMr. Stewart, of Balclutha, has arrived here. Mr. Sinclair arrived in from Green Lake last Monday.\n\nMr. Campbell is expected to arrive on Monday at Mr. Campbell's.\n\nMasons, Markley and Don. Gann leave for the Forks of the Red river to procure supplies. Mr. Markley has received a full assortment of crockery and groceries.\n\nMasons, Fish, H. P., Foster, Markley and Don. Tant has been appointed census-taker for his district.\n\nMasons, Moore & Macdonald's saw mill has closed down for the season. They have about 600,000 feet of lumber on hand.\n\nA large number of the citizens of the province attended the dinner last night at Orms' Restaurant on Tuesday afternoon at 6 o'clock.\n\nMr. McKay leaves for Ottawa in a few days. He has been appointed commissioner to acquire and settle the claims of the settlers and damages incurred during the rebellion.\n\nMasons, T. J. Agnew and R. J. Pitt, who visited the Island, Mr. Agnew, with his wife and family, intends visiting his home on the Island shortly before returning.\n\nThe steamboat North West came to yesterday evening. She left here a few days ago and on her way back landed at Edmonton. She had been there, on account of low water, she took the latter's freight and passengers, Mr. D. J. Smith, Mr. Wilson, Mr. Alex Campbell, Mr. Ross, and family, came back, and went up to Battleford.\n\nThe first printing of the Saskatchewan Leader was printed Saturday afternoon, when press amounts to about $40 in cash and value will be given away. It is said that the Leader will be printed every day thereafter, unless the Stoller will be allowed, which may be had from Mr. J. Wilson, who is the owner of the paper.\n\nThe steamer North West arrived down from Edmonton on Sunday evening. On Monday morning she was loaded with three days for repair. She will make one more trip to far north, carrying 1,700 tons of grain and 40 tons of freight. Mr. Ross, of the H. B. Co., and Mr. McPhail left by the North West for the east.\n\nThe annual meeting of the Anglican Curling Club will be held tomorrow evening last at Mr. Bradner's residence, to organize officers for the coming year, and transact other important business. Among others elected are Mr. Howie, H. Bishop, President; R. D. Maclean, Vice-President; R. D. Maclean, Sec. Treasurer. Step is to be taken towards purchasing a club-house. It was also decided that the medal won by the late Mr. D. McPhail, last winter, be presented to father together with a letter of thanks.\n\nThe following question was answered by Capt. Appleyard Tuesday night: John McRee, M.P.P.; Mr. Winningham; Captain Farley, of B Battery; Thomas Spence, Esq.; Crown Commissioner for the East, Mr. Murray; Inspector Deputy Sheriff Ross and Indian Farm Inspector McKay, who have been attending as witnesses in this case. In reply to the question, the party, we understand, had a very pleasant trip, although they came to grief about twenty miles from their destination, owing to the snapping of a wheel, notwithstanding the watchword—\"Be careful of what you wish.\"\n\nThe work of the commissioners has already commenced, which shows the energy of the commissioner. Mr. Murray, who arrived on Tuesday evening, says that the work will be well made, and we understand the field work will occupy each commissioner about six weeks. The report of the commission will be compiled and ready for presentation to the House of Commons early next spring at Ottawa.\nFriday, August 28, 1885.\n\n**DRY LUMBER.**\n\n**MOORE & MACDOWALL**\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\n- **Dressed Flooring**, $48\n- **Undressed do.,** 42\n- **Dressed Siding,** 48\n- **Undressed do.,** 42\n- **Sheeting,** 30\n- **Common Lumber,** 35\n- **Dimension do.,** 40\n\n\"Over 7 feet extra.\"\n\n- **Lath,** 75 cts. per bundle.\n- **Shingles,** $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\n**THOS. POWERS, STEWART BROS., TRADERS, GENERAL MERCHANTS**\n\nHave just received a large stock of:\n\n- **Teas**\n- **Tobaccos**\n- **Coffee**\n- **Oatmeal**\n- **Sugars**\n- **Canned Goods**\n- **Cal. Pears**\n\nClearing out the balance.\n\n**Crockery AND Hardware, AT COST**\n\n**NOTICE**\n\nAll parties indebted to us must be set this before the 1st August next, owing to an intended change in the business.\n\n**STEWART BROS.**\n\n---\n\n**REPEATED SECTIONS.**\n\nIn our last issue we expressed our agreement with the Regina Leader in thanking the appointment of Mr. White as the first Surveyor of the Land Office, and the possibility that the discussion of the land policy of the Territories, and our intention of returning to the subject.\n\nThe objectionable feature of the present system consists in the vast number of sections of what amounts to half of the sections open for settlement, and a very slight consideration of the disadvantages entailed upon the settlers by this policy, which is manifestly a cruel illustration of it obvious.\n\nWe may note, too, although it is not our intention to go at length into this particular phase of the same evil present, but rather to glance at the effects of the whole system, that to a certain extent the permission granted to men to take up second homesteads has the same baneful influence as the reservation of the same sections referred to.\n\nIt is not easy to say that land reserve in the midst of settlement is increasing in value at the expense of those who are making improvements on every side of it; but the fact that against non-resident squatters in town lots where no municipality exists to distribute taxation shows that the public are sufficiently alive to that particular application of the same principle. The effect of reserve in the case of speculative speculation being conceded, it would seem impossible logically to justify it with regard to land held by the Government, and even taking the view of the case that the proprietors themselves are ultimately the Government and the increase in the value of the reserved land enhanced meantime at their own expense, there still exists a terrible want of economy in the arrangement of the reserve, to be seen from any possible side, and there will stand out with great distinctness the immense advantage to settlers in a new country derived from being insisted upon, and it seems almost impossible to compress the greatest number of reasonably large homesteads within the smallest possible area, and the only difficulty is to make a selection from the immense amount of what might be added in the future, so that the best sites shall fall to those to be considered as a single unit, nor can we do more than give at its bearing upon the position of the settlement of a country in its earliest stage, before anything in the shape of towns or gathering places becomes possible. It may be noticed that the practical benefits of close settlement appeared insufficient to the experience of the pioneers of Red River, and that they did not see the advantages to the future of having his land in the form of a square, or equally distributed about his buildings, and to take up comparatively unworkable land for himself.\n\nThere is another cause why due to the desire to concentrate in order to repel the attacks of savage foes—and as far as the partition off of land goes, is no longer either necessary or desirable. The settler, however, acquainted with the early stage of settlement can fail to appreciate the extent to which men can help each other by being close together. There is very little of the work to be undertaken by a man who proposes to convert a tract of waste land into a home which does not require the assistance of a neighbour, and in a country like our own where timber has to be cut and taken away during the winter, it is not the utmost consequence to him to find lodgings for himself and his animals within easy range of the scene of his operations. This system is more adapted to the present state of things, less laborious buildings have been put up, and we may instance as an example of the saving afforded by it, the fact that one intermediate building between two farms would save the provisions consumed, or for a time be dispensed with altogether.\n\nThe advantage of proximity in the case of settlers having wives and families, is evident, and the cost of food, and one of the hundreds and one which will immediately occur to the mind of one practically acquainted with the difficulties of pioneers. The far more important bearing of the question is that the advanced stage of a country's settlement will occupy our attention soon.\n\n**ECONOMY.**\n\nAt last the question as to whether this settlement should possess the machinery as well as the name of a Town has been decided by the vote taken on Saturday last, and a majority of the proprietors hold in view the necessity of such organization. That so many should have opposed the measure is a very significant fact, which ought to arrest the attention of those who have succeeded in carrying it. The majority of those who have recorded their opinions that prudence would dictate going without it for some time longer augurs well for the prospect of a strict exercise of economy. There is a tendency among the proprietors by writing in its favor have reiterated their conviction that the game is worth the candle, are none the less of opinion that it will only prove so in the event of a prudent expenditure of the funds necessary expenditure of public utility—so that the addition of the men of this opinion to the solid body of the minority must certainly insure an overwhelming majority of those determined to insist upon absolute economy. This matter of economy is one which can not be so strongly insisted upon, and it seems almost impossible to compress the greatest number of reasonably large homesteads within the smallest possible area, and the only difficulty is to make a selection from the immense amount of what might be added in the future, so that the best sites shall fall to those to be considered as a single unit, nor can we do more than give at its bearing upon the position of the settlement of a country in its earliest stage, before anything in the shape of towns or gathering places becomes possible. It may be noticed that the practical benefits of close settlement appeared insufficient to the experience of the pioneers of Red River, and that they did not see the advantages to the future of having his land in the form of a square, or equally distributed about his buildings, and to take up comparatively unworkable land for himself.\n\nThere is another cause why due to the desire to concentrate in order to repel the attacks of savage foes—and as far as the partition off of land goes, is no longer either necessary or desirable. The settler, however, acquainted with the early stage of settlement can fail to appreciate the extent to which men can help each other by being close together. There is very little of the work to be undertaken by a man who proposes to convert a tract of waste land into a home which does not require the assistance of a neighbour, and in a country like our own where timber has to be cut and taken away during the winter, it is not the utmost consequence to him to find lodgings for himself and his animals within easy range of the scene of his operations. This system is more adapted to the present state of things, less laborious buildings have been put up, and we may instance as an example of the saving afforded by it, the fact that one intermediate building between two farms would save the provisions consumed, or for a time be dispensed with altogether.\n\nThe advantage of proximity in the case of settlers having wives and families, is evident, and the cost of food, and one of the hundreds and one which will immediately occur to the mind of one practically acquainted with the difficulties of pioneers. The far more important bearing of the question is that the advanced stage of a country's settlement will occupy our attention soon.\n\n**JAMES SINCLAIR**\n\nMerchant Tailor,\n\nand Dealer in\n\nGENTS' FURNISHINGS.\n\n---\n\n**SHANNON & McLEOD**\n\n---\n\n**KNOX AND BARKER**\n\n---\n\n**C. D. NORTHGRAVES**\n\nWatchmaker and Jeweller,\n\n---\n\n**G. D. NORTHGRAVES**\n\n---\n\n**A LARGE STOCK OF**\n\nWatches, Clocks and Jewellery\n\n---\n\n**KEPT CONSTANTLY ON HAND.**\n\n---\n\n**STEWART BROS.**\nAGRICULTURAL SOCIETY.\n\nSecond Annual Prize Meeting.\n\nAs the Western Agricultural Society has insured a much larger attendance at their last meetings, we have decided to purchase a number of4 excellent animals and the amount of prizes promised, including parties having prizes in competition for the same age, will certainly be more likely seen. This fall, although it may not be seen in some cases, the precipitation will result in an increase of the harvest of the farmers, getting to their houses after having been finally received.\n\nThe following prizes are offered:\n\nClass I.—Bovines (horses, etc.)—1st. Pair, Sec. I, Sec. II, Sec. III, Sec. IV; 2nd pair, Sec. I, Sec. II, Sec. III, Sec. IV; 3rd pair, Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass II.—Dairy cattle—special prize given for first lactation cow, Sec. I. Prize given for milk delivered in June, Sec. I.\n\nClass III.—Patterson's prize—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass IV.—Agricultural and general purpose horses—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass V.—PoveshIELDS Horse—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VI.—Heavy draught—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VII.—Thoroughbred mares—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VIII.—Grade cattle—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass IX.—Fell and working cows—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass X.—Fell and working cows—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XI.—Half-bred steers—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XII.—Any other varieties—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XIII.—Exhibitors who provide prizes to keep them going—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XIV.—Home manufacture—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XV.—Agricultural production—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XVI.—Seed grain—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nGARDEN VEGETABLES\n\nClass XVII.—Carrots—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XVIII.—Potatoes—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XIX.—Concours—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XX.—Market vegetables—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XXI.—Lambs—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XXII.—Sheep—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XXIII.—Manufacturers of the Lamb District—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XXIV.—Manufacturers of the Sheep District—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nNotice.\n\nInvestiture of Honorary Members.\n\nThe Agricultural Society presents the following names of persons who are to be recognized as honorary members of the organization:\n\nMr. Justice McClellan—Sec. I.\n\nMr. Justice Macdonald—Sec. II.\n\nMr. Justice Craig—Sec. III.\n\nJudge Murray—Sec. IV.\n\nJudge Hannah—Sec. V.\n\nJudge Vail—Sec. VI.\n\nJudge Donaldson—Sec. VII.\n\nJudge Wilson—Sec. VIII.\n\nNotice.\n\nPrize List.\n\nThe following list of prizes has been approved by the Executive Committee of the Agricultural Society:\n\nClass I.—Bovines—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass II.—Dairy cattle—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass III.—Fell and working cows—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass IV.—Grade cattle—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass V.—Thoroughbred mares—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VI.—Heavy draught—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VII.—Exhibitors who provide prizes to keep them going—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass VIII.—Agricultural production—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass IX.—Home manufactured—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass X.—Concours—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XI.—Seed grain—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XII.—Market vegetables—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XIII.—Manufacturers of the Lamb District—Sec. I, Sec. II, Sec. III, Sec. IV.\n\nClass XIV.—Manufacturers of the Sheep District—Sec. I, Sec. II, Sec. III, Sec. IV.\nHARDWARE!\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine, Plastering Hair, steam refined, Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishing, Hats, etc., have been selected with great care, and while special attention has been given to the selection for our Grocery Department,\n\nAn Elegant Assortment of Cornets, French Groceries, other Mixed Candies,\n\nNuts and Raisins, together with Fresh Biscuits in Seals, Pralines, Toffee Fingers, Liqueur Groves and Iced Sultanas.\n\nMake a choice addition to your well-known line of\n\nGENERAL GROCERIES.\n\nFor a luxurious smoke we recommend Buffalo Hall.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. HUGHES & CO.,\n\nGeneral Merchants and Indian Traders.\n\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries here on hand is the most complete ever received, comprising\n\nMorton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also our own brand\n\nOgilvie's Flour,\n\nWhich we will sell cheap for sale.\n\nO. E. HUGHES & CO.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted or Framed.\n\nOrders for Books, newspapers, British, Canadian, Provincial and United States promptly attended to.\n\nPrince Albert - N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885082801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6949, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 12946, 1], [12946, 21963, 2], [21963, 25798, 3], [25798, 27357, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]