[{"id": "5b6f60dd885da19246a4556713c7a65f32c70ba4", "text": "Bankinghouse\n\nMackintosh & Knowles,\n\nPrince Albert, N.W.T.\n\nTransact greenback banking business.\n\nLetters exchanged at Edmonton.\n\nBank depositary.\n\nBranch telegraph office at all points in the Dominion.\n\nCollection undertaken without delay or expense.\n\nChairman and Bankers' Bank of Canada.\n\nWilliam T. MacLane\n\nAdvocate, Lawyer, etc.\n\nHonors to be extended first mortgage of land, rates as low as interest charges.\n\nPRINCE ALBERT, N.W.T.\n\nSTEPHEN DUMONTIER\n\nSelective officer of Supreme Court of Justice\n\nAt Kunkle's Office,\n\nAdvocates, Solicitors, etc.\n\nLaws, Leases & Deeds.\n\nPRINCE ALBERT\n\nH. W. NEWLANDS\n\nAdvocate, Lawyer Public.\n\nPriest Albert, S. A.\n\nA. R. L. HUFFNAGEL\n\nDominion Land Surveyor,\n\nPRINCE ALBERT N.W.T.\n\nJ. LESTOCK REID\n\nEMLER, Banquet, etc.\n\nTenders for Collaton School Building required by John Paterson\n\nAll tenders will be received until September 30th\n\nFor specifications apply to\n\nH. W. HALPIN\n\nSecretary\n\nCITY CONFECTIONERY\n\nCannery Goods\n\nCanned Goods\n\nAlso Cigars\n\nR. T. GOODFELLOW,\n\nCorner River and McArthur Street\n\nROB'T BUCKLEY,\n\nAuctioneer,\n\nAccountant,\n\nGeneral Agent,\nFOR THE BEST ASSORTED STOCK OF CONFECTIONERY\n\nGOTO H. MACDOUGALL'S\n\nBAKERY\n\nGeneral Agent,\n\nDELIVERY TO POST OFFICE JEWELLERY STORE\n\nH. MACDOUGALL\n\nBayly's Hotel,\n\nPRINCE ALBERT\n\nTHE OLD RELIABLE\n\nDeliveries free of charge.\n\nPRINCE ALBERT\n\nTHOS. ORAM,\n\nGeneral Merchant,\n\nSHANNON & MCLEOD\n\nMRS. JAS. A. FRASER, Millinery, Brother,\n\nPRINCE ALBERT\n\nH. T. MCGILLIVRAY\n\nGeneral Merchants,\n\nPRINCE ALBERT\n\nSHANNON & MCLEOD\n\nGeneral Merchants,\n\nPRINCE ALBERT\n\nADVERTISEMENTS WILL BE INSERTED AT THE PRINC PUBLISHER'S RATES.\n\nISIAH MCCOLL, General Blacksmith,\n\nCHURCH STREET\n\nOrders for copies of Directory may be directed to Mrs. T. N. Campbell,\n\nPRINCE ALBERT\n\nCHIT-CHAT LOCALS\n\nGathered by our Reporters\n\nH. S. ROMANS\n\nGas Co., Clark's Drug Store\n\nPoveshull Food for Infants for sale by T. E. Jackson\n\nDeputy Sheriff Hanson spent Wednesday in Carlton,\n\nProvisions are selling at $15 a barrel in some parts of Ontario.\n\nThe High Court of Justice will sit on Monday next.\n\nSeveral houses are empty and not enough to meet the demand.\n\nLarge quantities of goods will arrive this week.\n\nMr. Dick visited here today after visiting the Bobbitts.\n\nMessrs. Russell & Davis have purchased 700 pounds of beef from Mr. Thorpe.\n\nMr. A. W. R. Markley, who has been seriously ill during the past week, is improving reflectively.\n\nThe exhibition of the Prince Albert Agricultural Society will take place next Thursday night.\n\nMr. and Mrs. McKean and son arrived last Saturday. They are about the present guests of Dr. Hales.\n\nThe Horse Fair, exhibitions took place last Thursday evening at which will appear in our next issue.\n\nThe school house for school district No. 16 will be completed and ready for the opening of the fall term.\n\nMr. R. Smith has purchased a lot of river front from Mr. T. Goodfellow and has commenced building upon it.\n\nMessrs. Bums, Smithy of Mr. Jim Scott, main contractor, arrived in town by last mail stage. She will again attend the post office.\n\nMr. Rosson went to the North Branch to the trading post with trading goods and supplies.\n\nWhy not convert into a hall the building utilized for the exhibition? Winter is long and we could utilize this place while we consider what to do with it.\n\nMESSRS. WEST & JOHN WILSON, managers of the Souris Trading Post, did not care to gather any shrubs.\n\nC. E. Page, photographer, has left for the Forks of the river to photograph the C.M.R. Train, the first westbound train carrying lumber out of the river.\n\nOwing to the partial failure of the crops, some large amounts of potatoes and butter will be imported into Prince Albert from Manitoba.\n\nSheriff Hughes has subscribed his personal property for thirty-five dollars for the purpose of erecting a building for a school for Mr. Woodman.\n\nMr. and Mrs. Ross have returned to their homestead near Carleton River. They were accompanied by Mr. Woodman, who intends to take up land in that locality.\n\nMessrs. Brantwood and Thompson have purchased 25 feet on River Street; Messrs. Bums own 100 feet; where they intend to erect a building for a school for Mr. Woodman.\n\nAmong the settlers who went to Carleton last fall were Mr. and Mrs. J. Campbell, Mr. and Mrs. Geo. Campbell and Mr. and Mrs. J. D. MacNair.\n\nDover Lodge A.F.A.M. No. 4 has received an official visit from the G.D.C. Prince Albert Club.\n\nAs matters stand, Mr. Woodman is to be brought to trial for a foul attendance of most serious nature ever recorded.\n\nMr. S. Woodfin, piano repairer, purchased furniture from Mr. G. E. Carter, his entire stock of furniture.\n\nMr. Carter who intends returning to his homestead near Carleton after several weeks employed on River Street.\n\nJust received at Link's Drug Store, etc., have been delivered by Mr. Carter, Plate Metallic Products and Trichin Artefacts that very soon into the Saskatchewan District.\nThis is the season of the year when a person should guard carefully against prairie fires. The grass is particularly there is a much heavier body of grass than for several years past owing to the frequent rains during the past summer and snow, and the grass is now dry and abundant so that the utmost precaution should be taken by everyone not to allow fire to get started on our broad and grassy covered prairies.\n\nThe great body of dry grass, with such an aspect as had a few nights ago, and our crops would be lost in a moment. Fires may occur accidentally, carelessly or perhaps intentionally, but it is well that the farmers should keep guard against this perilous element by guarding their stacks of grain, hay and buildings properly protected. Don't put off this important duty till to-morrow but let the first thing you do be for the protection of your crops and buildings from danger of prairie fires.\n\nIn British politics the Irish question is still the engaging subject. It is to be feared the people are sick and tired of it. But what is to be done? The Irish Nationalists say that they are determined to have their own way and a majority of the representatives of the British Parliament say that they will not enter the National League or support the British Parliament until the Irish people cannot serve two masters. What seems to be on the cards is a coalition cabinet. The Irish Unionists may dissent, and it is certain Mr. Chamberlain will not enter a coalition cabinet, but the Marquis of Hertfording would surely do so, holding the great bulk of the following vote. The first thing that would be to rechristen the party and it would likely be called the Liberal Conservative party in order to soothe the consciences of those Unionists who can themselves be Liberals. What the Marquis of Hertfording said the other day as to the necessity of closing up the ranks and getting the machinery of organization into order shows that he sees the wisdom of a closer union of the two wings of the Unionist force.\n\nMr. Gladstone, pointing to the by-elections, is sanguine that the next election will see a Liberal and Parliamentary sweep; but Mr. Gladstone is always sanguine and the electors are decidedly. In the hearts of many Englishmen there is a feeling that Mr. Gladstone has gone too far, and his surrender to the Nationalists at this juncture may be it is to get their votes to turn out the Salisbury Government is looked upon with feelings of mortification.\n\nMr. Goldwin Smith's letter on Manitoba, in the Mail, is suggestive on one point. He says: \"Much of the land around the capital (Winnipeg) is still lying untilled. It is evident that prices at which prices have been obtained in the last few years, to the injury of not only Manitoba but of the settler himself, who is thus carried away both from his market and his center of distribution, besides losing the general advantages of settlement.\"\n\nIt is instructive to know how much the stagnation incident to this state of things has contributed to this present discontent in Manitoba; and that the Manitoba speculators holders of land as now, are in a semi-revolution, agitating for Manitoba's rights. No doubt, as Mr. Smith says, Winnipeg, having reached a certain stage, is sure to go further, as at the end of cities. She will grow and live in large measure of the C. P. R., which threatens her with ruin if she will not succumb to Disallowance. The Manitoba speculators are pushing a course that cannot be permitted by any civilized Government. The building of the Red River Railroad is an act of open defiance of the law; and while violating the terms of the agreement by the work by the Dominion authorities, if practicable—which is not—would be an act of arbitrary power that could not commend itself to Canada, still it is going to do in Condominium, such as this, to sanction the rampant triumph of Sectionalism over the Dominion authority. Let us have conciliation and compromise by all means that may be possible, but let us be bold precedent in pursuing further difficulties in other provinces to conciliate and compromise as the price of return to duty as Canadian citizens.\n\nOn Thursday next the Lorne Agricultural Society will hold their fourth annual exhibition, and from present appearances, if the weather proves favorable, a chance will be given people who wish to do in Condominium, such as this, to sanction the rampant triumph of Sectionalism over the Dominion authority. Let us have conciliation and compromise by all means that may be possible, but let us be bold precedent in pursuing further difficulties in other provinces to conciliate and compromise as the price of return to duty as Canadian citizens.\n\nThe exhibit of cattle and sheep will be large, and we have no doubt a good number of competitors will be carried on in this district to a very profitable way. Farmers here, no doubt, have to feed stock part of the winter, but then they lose very few, unlike western ranches, where the mortality rate varies from fifteen per cent. The sheep industry here is also assuming considerable proportions, and is found remunerative. The Society offer a liberal first list and valuable silver cup for the best set of ewes, and in the competition there is made, is to invite several sheep raisers to import fresh stock from some of the select Canadian flocks. In grain the competi-\nFRIDAY, SEPTEMBER 23, 1887.\n\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, Sept. 6.\n\nA new member has joined the Order of the Garter Band, which holds the N.W.M.P. band.\n\nOn the Leader's staff are a pumpkin over three feet in circumference and a bale of hay.\n\nQuite a building boom is promised the coming fall. In fact, it has already commenced. The farmers are doing well, and the encouraging prospects of the town generally.\n\nFour constables and a corporal were brought from Calgary last week, to serve a sentence of six months. They were charged with illegal gambling in a saloon. To keep the policemen at bay with an ax, threatening to break the window, they were charged with assault. The policemen claimed that they were not aware that firing on the Indians was within the law; however, after following the legislative orders four miles, they started with him to jail, they allowed him to go.\n\nCALLARY.\n\nFrom the Tribune, Sept. 8.\n\nFather Laflin arrived from Edmonton today to take charge of the Calgary Church. Building operations will commence at once.\n\nThe Bishop of Saskatchewan will be in Calgary for two Sundays, Oct. 19th and 26th. On the 26th he will address Mr. Morley at the Blackfoot reserve, as Dixon's orders.\n\nFather Crook, from the Island of Cretta, has been here for some days, engaged in missionary work in British Columbia, arrived here on Monday and was greeted by Minne, who spoke well of Father Crook's services at Kamloops, Donald and other places in the mountain.\n\nArchbishop Ambrose of St. Boniface, Archbishop Fabre of Montreal, and Bishop Derome of Montreal, visited from their respective diocese, private matters. They laid off here and spent a day at the Mission. Tonight they go to the Coast. Rev. Father Laroche came out from there.\n\nLETHBRIDGE.\n\nFrom the News, Sept. 7.\n\nHaying and harvesting is about completed around here. Owing to the late rain the harvest is very good.\n\nQuite a number of police from Macdonald, along with those called from here last week, left for the Blackfoot Country last night.\n\nMr. C. M. Turner and his horse started from the picker line near the Terrace on Sunday morning last. Circumstances prevented his reaching this, so the picker was being fed in the corral leading up to the river, where it had evidently been dropped.\n\nA strike took place among the black men on the railway here on Tuesday evening, and the train on Saturday morning was reported overdue. The matter was anxiously watched on Saturday and everything is now running smoothly.\n\nThe authorities did not deem it advisable to take Dufferin to the Blackfoot reserve on August 26th. It is evident that the government does not like the situation and does demand the same treatment from the Government. It is feared that the effect of letting Dufferin go will be disastrous, and that the Blackfoot will be all the better contented in the future. As long as they get what they want they are content, but if allowed to go free it will be impossible to quiet any more exciting matters. Crowfoot has just returned from a trip across the plains, and says the Bloods have been giving trouble. It is said that he went as an emissary of the government to try and bring the wanderers home. - Calgary Herald, Sept. 2.\n\nGENERAL NEWS.\n\nLondon, Sept. 5.—It is now certain that Ayesh Khan has succeeded in reaching Canada, and if this be true, there can doubt be well put away his hopes of ever seeing his native land or his followers.\n\nParis, Sept. 7.—Sarah Berchard has just returned from a pilgrimage to the shrine of the Virgin at Lourdes, and there is much speculation among the Papalists why the Queen should be a precursor to her retirement to a monastery.\n\nLondon, Sept. 7.—The August emigration to British North America was 4,835, showing a decrease of nearly half the month last year. During the year the increase was over 12,000.\n\nLewiston, Minn., Sept. 7.—There is a strange belief prevalent in the small village three miles north of here, over the nightly appearance of ghosts, which is looked for by the most wicked citizen of the parish who made light of the matter have been shadowed by supernatural visitants nearly half his reason after being followed by a mysterious figure for years. One day ago a man was murdered in the village, and every family who has occasion to pass through the village has committed his death with many deaths since. This is thought to be the cause.\n\nParis, Sept. 7.—The newspapers all agree that the difficulties between Germany and Austria are serious ones. They say that if France had been in such a condition for war in 1870 as we are now, Germany would have been forced to make peace.\n\nLondon, Sept. 7.—Two citizens were arrested at Tobishere while taking notes of the movements of troops on suspicion of being German spies. They proved, however, to be reporters.\n\nLondon, Sept. 7.—A new republican league is about to be started here with members in London and branches in all parts of the country. The Queen's jubilee notwithstanding, republicanism is still gaining ground, and what the republicans have lost in depth of years it has made good in expansion.\n\nLondon, Sept. 7.—Violent rain and hail storms have prevailed here, and in many sections, entirely destroying the standing crops.\n\nWashington, Sept. 7.—The report has been issued in New York, is exciting many for the enlistment in the German army creates more surprise in this country than anything else. It is said to be true that there was no real cause for the suspension of hostilities, but it is evident that the matter is likely to be subject to some official announcement.\n\nSan Francisco, Sept. 7.—An American lady proceeded to Europe for a pipe peace, which has been in the family of an American Jewish child for many generations, as a token of the German chancellor's success in preserving peace.\n\nNEW YORK, Sept. 8.—H. H. McLay, superintendent of the Alaskan gold mines, has returned from a tour of inspection, and says a new covered mountain seven thousand feet high on the Richardson range was discovered, a month ago, and has been found to be rich in gold ores.\n\nNew York, Sept. 8.—The Spanish Minister of the United States, has returned from a tour of inspection, and says a new covered mountain seven thousand feet high on the Richardson range was discovered, a month ago, and has been found to be rich in gold ores.\n\nQuebec, Sept. 11.—A singular incident attended the swearing of Sir Andrew Macdonald as chief justice of the province during the absence of Hon. Mr. Munro. It appeared that Charles Macdonald, clerk of the court, had been sworn in for the express purpose of administering to Sir Andrew the oath of office. He drew aside Sir Andrew when the latter entered the chamber, and said: \"Sir Andrew, you have been sworn in for the express purpose of administering to you the oath of office.\" Sir Andrew answered, \"I am not sworn in for any such purpose,\" and Sir Andrew said: \"I am not sworn in for any such purpose.\" Sir Andrew answered, \"I am not sworn in for any such purpose.\"\n\nHalifax, Sept. 2.—A great gale swept the fishing bank last night, and all the incoming vessels, except three, have foundered and are wrecked. Many lives have been lost. The schooner \"Cumberland\" was badly hurt. She was thrown overboard and was landed in the cabin. The Boston schooner \"Martha Woodbury\" had her stern broken. Several other vessels were badly damaged.\n\nPUBLIC NOTICE.\n\nBy the Trustee of Collenton School District No. 8 of the North West Territories.\n\nWhereas it is deemed expedient by the Trustees of Collenton School District No. 8 of the North West Territories, to levy a tax on the rate of five cents per acre on all lands included in the district, in order to pay for the erection of a schoolhouse, the Trustees do hereby give notice that the tax will be levied on all lands included in the district, at the rate of five cents per acre, and that the same will be collected by the Collector of Collenton School District No. 8, during the ensuing year, and shall be paid into the school fund.\n\nJOINT PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY.\n\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 14 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Nova Scotia Advertising Agency, 10 Broadway, New York. Send 10c for 100-pp. Pamphlet.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of all events occurring in the Dominion and United States News.\n\nSpecial news reports compiled by representatives in the Dominion and United States.\n\nComplete papers of Parliamentary proceedings at Ottawa and Winnipeg.\n\nTHE MORNING CALL claims the largest circulation in Winnipeg, and has the largest and most complete west of the great lakes.\n\nSubscription rates: One year $5.00, two years $9.00, three years $12.00.\n\nSend for specimen copy.\n\nThe Full-fleeting City, Winnipeg.\nLester Brownlee, President and Editor-in-Chief.\nLOCAL NEWS.\n\nMr. J. McLean left today for Fort Chipewyan.\nMr. A. A. Porter left on Tuesday last for British Columbia.\n\nThe Methodist church has been halo-\ncured and cleaned, and now presents a very cheerful appearance.\n\nRobertson & Robertson, merchants,\nhave received a large consignment of new goods in next week. Wait for them.\n\nWork on our new heating apparatus is progressing rapidly. The stoves have been put in, and the first coat of plaster put on.\n\nEldridge Infant Food, Nestle Infant Food, and other articles of the same kind, are now being sold at the usual prices.\n\nSubtle Food at Clark's Drug Store.\n\nThe steamer Northwest arrived at the wharf yesterday Friday last. From there she will remain for some time, where she will remain during the winter.\n\nWinter is coming on. Captain Douglass came from Prince Albert, where with his family he will remain during the winter.\n\nCommissioner Wrigley, on behalf of the company, has sent a message of sympathy and spoke of the deep respect in which his grave the archbishop had always been held by the officers of the company.\n\nHon. Lawrence Clarke also spoke of the late feeling which had always existed between the clergy and the Hudson's Bay officers, and he heartily reciprocated anything that Father Clow could say.\n\nThe incident was regarded as one of the most pleasing at the meeting of the council.\n\nFOR THE NORTH POLE.\n\nMr. W. H. Gilder, the Arctic explorer, who passed through Winnipeg last fall on his way to the North Pole, and again visited the city last spring after returning from his expedition, has just returned from another journey to the North Pole.\n\nIn an article supplied to the American press, he announces his intention of trying again to reach the Pole this year.\n\nLast year he took with him as far as Fort Churchill 1,000 pounds of baggage; this year he expects to take more, but he has no serious difficulties or reaches to point out.\n\nThere he will pass the summer in the North Pole's land, and he will make a party of himself to accompany him to Baffin's Bay. He will then sail along the coast of Baffin's Bay and the west shore of Ross's Welcome to Repulse Bay, and then sail along the north coast of Hudson's Bay. Thence through the Foxe Strait and by the mouth of the Melville Sound to Igloolik, an Esquimaux Settlement upon an island on the northern point of that peninsula, where he will make his base.\n\nCockburn Island will be used as Point Inlet where the old Colonel thinks the real pole will be found.\n\nHe will then start across the ice shelf of Baffin's Bay for Cape Sabine.\n\nHe anticipates that it will take him years to reach Cape Sabine, near the north end of Hudson's Bay. Thence through the Foxe Strait and by the mouth of the Melville Sound to Igloolik, an Esquimaux Settlement upon an island on the northern point of that peninsula, where he will make his base.\n\nLondon, Sept. 10.—Arrangements are now perfected for the removal of the remains of Napoleon III., and the Prince Imperial, to Chicago. A new mortuary crypt is being constructed in the cathedral for the purpose.\n\nNo confirmation has been received at the State department at Washington, of the dispatch of the German party of experts to purchase horses of that class.\n\nThere has been no time for Capt. Sharples of the Royal Navy to report additional seizures if they had been made from initial evidence.\n\nIt is evident that the question was not a question of the facts previously reported, especially as the names of the vessels are not given. It is possible that at the present time there are only four seamen of British origin. In the absence of the vessel of the intended expedition, the question of the facts cannot be attached to any inference derived from the answer that the Behring Sea would be included in the future negotiations.\n\nAdvice to Mothers.—Are you disturbed at night and broken of your rest by a child who refuses to go to sleep? If so, try cutting Teeth 1 second at once and giving the child a glass of warm milk and green tea and energy to the child's appetite.\n\nFor children teething in the mouth and throat, give them a glass of warm milk and green tea and energy to the child's appetite.\n\nFor children teething in the mouth and throat, give them a glass of warm milk and green tea and energy to the child's appetite.\n\nFirst-class Turnout\n\nAt Reasonable Prices.\n\nA reliable man in attendance day and night.\n\nTelephone—No. 999.\n\nStable—No. 8 River & Noebit Sts.\n\nNEILSON & M'BEATH\n\nESTABLISHED: 1879.\n\nUPRIGHT AND BOX Heating Stoves\n\nFrom the Plainest to the Most Elaborate Design.\n\nHeating Drums\n\nIn Great Variety.\n\nAmerican Coal Oil\n\nJ. R. McPHAIL.\n\nBuffalo Hall!\n\nAGAIN ON THE LEAD\n\nWe have now open and ready for inspection a large bulk of our FALL AND WINTER Dry Goods, Clothing and Men's Furnishings\n\nRecently purchased in the east.\n\nThe balance of our stock will arrive in a few days.\n\nWe claim to show the largest most complete assortment, and by long odds the best value in Men's Underclothing ever offered in Prince Albert. We have now on the road something choice in LADIES BLACK AND COL'D JERSEYS BETTS & Gwynne.\n\nCLEARING SALE!\n\nNuns' Veiling, Merino, Ginghams, Wincies, Boys' Jersey Suits,\n\nThe above will be sold at a close margin on cost.\n\nPillow Cotton and Twilled Sheeting.\n\nR. C. Wigmore & Co.'s.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA large stock of Imported Tweed Suitings, Trowsering and Overcoating Worsted,\n\nIn English and American Lines.\n\nCanadian Tweeds\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSummer Suitings\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887092301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 5973, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4910, 1], [4910, 10289, 2], [10289, 19827, 3], [19827, 25475, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]