[{"id": "93736f38058d98e2b37b8b73f95029bd4f267841", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N. W. T.\nTHRU.—$2.50 per annum in advance.\nSingle copies, 10 cents each.\nThis paper will promptly be inserted in any paper. Rates quoted 15¢ per line.\nNo advertisement inserted for less than $1. Advertising space will not be guaranteed until paid.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Alban's and St. Mary's Church—11 a.m., service in both Churches.\nSt. Paul's—Rev. Mr. Wright.\nSt. Matthew's—Rev. Mr. Wright.\nSt. Andrew's—Rev. Canon Fleet, B.D.\nSt. John's—9:30 a.m.—Rev. Canon Fleet, B.D.\nSt. Mark's—9:30 a.m. and 1 p.m.\nRev. Mr. Taylor.\nSt. Paul's (Presbyterian)—11 a.m. and 7 p.m.\nMethodist Church—Red Deer Hill and Macdonald—Rev. Mr. Taylor.\nThursdays—11:30 a.m.—Rev. Mr. Taylor.\nThursdays—11:30 a.m. and 7 p.m.—Rev. Mr. Taylor.\n\nTHIS PAPER MAY BE BOUGHT AT THE OFFICE OF THE NEW YORK TIMES.\n\nFRIDAY, AUG. 12, 1887\n\nThe Halifax Chronicle has a unique argument in favor of its opinion that commercial union will keep Canada and the United States politically apart, and that denial of commercial union will promote annexation sentiment. It contends that the old reciprocity treaty was terminated by the United States in the hope of securing the annexation of this country, and it quotes United States Senator Potter as follows:\n\n\"I believe I express the general feeling of those who are the most friendly to the United States in Canada when I say it is not the policy of our Government or our policy to oppose this measure and I believe that in two years from now abrogation of the reciprocity treaty by the people of Canada themselves will apply for admission to the United States. I repeat that I believe in two years they will ask for admittance.\"\n\nNow, says the Chronicle, if the people of the United States ended that treaty of reciprocity in the hope of forcing Canada into annexation, how can we believe that they now propose the very approach of unrestricted reciprocity—with the design of securing the same end?\n\nTo which it may be replied that, in the first place, if the people of the United States have not offered us unrestricted reciprocity, nor have they any good reason to believe that as a people they desire it? Congress has not adopted any resolution favoring it; Mr. Butterworth introduced his bill at Ottawa while he knew it could not be sent up there because he knew that, if it were acted upon, it would be rejected. Neither political party has committed itself to the principle. No State Legislature has decided in favor of the principle; but, on the contrary, several have pronounced against it. The press of the United States has given the matter very little attention. No party in the United States has treated the matter with other than contemptuous silence. It will be time to tell us what the people of the United States desire when in some formal and unmistakable manner they have through their representatives expressed their views on this subject.\n\nIn the second place, if the people of the United States abrogated the old reciprocity treaty with a view of forcing Canada into annexation, it is manifestly they failed to secure the desired end. Well, we have never heard it urged that our neighbors are idiots. If on one side of policy failed, it is not on the other side that the century plays so successfully. The tempest failed to tear the coat from the traveller's back, but the warm rays of the sun succeeded. The Chronicle says the United States, by hook or by crook, offers Canada into annexation; it is possible that those who favor unrestricted reciprocity believe closer commercial relations will secure that which isolation and seclusion failed to secure. One thing is certain, and that is, that every man, whether in Canada or in the United States, who desires annexation, is in favor of commercial union.\n\nThe Toronto World, referring to the gopher massacre, says these pests have been known on the continent since the time of Columbus, or before, but it is only since civilization came along and created a market for them that they became troublesome. The treasurer of Montana Territory now pays ten cents for the scalp of every prairie dog brought to him and five cents for the skin of every wolf, coyote, or Canadian fox, the latter being three cents. On July 7 the territorial auditor and treasurer of Montana made their quarterly report to Gov. Cochrane, and among other matters concerning business and wild animals, since April 1 shows the sum of $2,000 having been paid for bears, wolves, coyotes, mountain lions, and prairie dogs. The rate is like; $20, per cent of this sum has been paid for alone. We should think that in the sparsely settled districts of the Northwest this kind of expenditure would be a heavy tax on the settlers, but it seems the blame must lie elsewhere. At all events, it may be doubted whether gophers and all the other pests known to the Northwest are such a drawback to the country as plagues. English rabbits have appeared in Australia according to accounts from that far-off land in the southern hemisphere.\n\nIt is said that an official statement, to be issued from Washington in a few days, will show that the decreased consumption of whiskey, along with the increased consumption of beer, which has been so noticeable during the past year, is still going on. The returns given are for the fiscal year ended June 30, and it is claimed they will give much encouragement to the advocate of temperance. They show a falling off in the receipts from the tax on distilled spirits, nearly $5,000,000, and this result has been achieved principally in those States in which local option and kindred measures have been most successful.\n\nThe attention of the mail upon the distilling and liquor interests have attracted the serious attention of those whose capital is embarked in the business, and recent publications in the trade organs indicate a purpose of raising large sums of money to inaugurate what, for want of a better name, may be called an anti-temperance crusade in some of the leading States in which the Prohibition movement has become suspicious advances. As a slight offset to the decreased consumption of whiskey there is shown in nearly all the States a marked increase in beer drinking. The tax on malt liquors is much lighter in proportion than that upon distilled spirits, but the revenues from this source during the past year were $100,000 more than for the fiscal year of 1886 and $100,000 more for the fiscal year ending June 30, in excess of the year preceding. It is thus evident that beer drinking is increasing and whiskey drinking decreasing in the United States.\n\nThe proposal to delegate the power of Prohibition to the Provinces is a step in the right direction if it be meant at the same time to abandon the Federal attempt to make the Legislative Act of Prohibition is quite incompetent as the Parliament of the Dominion to reform such habits by a Bill, and the attempt of a majority of the members of Parliament to do so is a degradation utterly inconsistent with the development of the Christian life would be arbitrary in the Province as in the Dominion. Yet this proposal is a step, though imperfect, toward a true position on this question, which will be attained only when the present intermediate position of Prohibition by district and townships has been overcome, and Prohibition has been narrowed to the sphere of the family, every man being his own Prohibitionist only. This is the only kind of Prohibition an individual Christian can embrace, and it cannot be affected by Act of Parliament.\n\nIt will be seen between the United States and the Australian colonies is at present a matter of considerable interest, especially as there is a movement under way to have the colonial mails delivered—at San Diego, and from that point transferred to the steamer going to the east, so as to be in time for certain ocean steamships. By this route it is believed that mails can be landed in London thirty-one days from Sydney. The Canadian Pacific is also making a strong effort to get the transportation of the Australian mails.\n\nA. C. PATTERSON,\nForwarding Agent.\n\nPRINCE ALBERT\n\nBREWERY\n\nPure and Sparkling AMBER—(Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRON\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Papers by addressing Geo. P. Rowell & Co.,\nNewspaper Advertising Bureau,\n10 Queen St. New York.\nSend 10¢ for 100 pp. Pamphlet.\n\nJUST ARRIVED,\nNEW GOODS\nAT\nCHAS. MAIR'S WEST END STORE,\nNursery Velling in Cream and Light Shades, Persian Paper Rugs, Tapestry Carpets, Crimson Repro, Window Woolen in Slate and Yellow, Door Matts, Crumb Cloths, Silk Corded Cloakings, Empire Curtains, Valances and Garnet, Felt Cretonnes, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beeswax Velling, Ladies' Silk Ties, Trimmed, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Collections, Biscuits, Eggs, Dates and Timed Goods of all kinds. Inspection is solicited.\n\nGO TO\nCANN'S\nBOOK STORE\nFOR\nWall Paper\nAND\nBorders\n\nHURRAH!\nFOR THE\nQUEEN'S JUBILEE\nTHE\nVICTORIA\nSale and Feed Stables\nHave just got in their\nNew Rigs and Fresh Horses\nAnd the public may now depend on\nFIRSTCLASS TROTTERS\nAT REASONABLE PRICES.\nA reliable man in attendance day and night.\nTelephone—No. 999.\nStable—No. 8 River & Nesbit Sts.\nNEILSON & McBEATH\nTERRITORIAL NEWS\n\nLETHBRIDGE.\n\nFrom the News July 30.\nAbout 200 more men are being got out of the mines here daily.\n\nSeveral showers of rain have fallen in this vicinity during the past week, and the crops are looking very badly now, but they are beginning to look up again.\n\nSergt. C. Ross, who is stationed at Pen de Oeste, Canada, has been missing for several days. He was last seen near the town of Banff. He had been to town and was on his way back to the camp when he fell from his horse. While waiting for the horse to be brought back, the Sergt. jumped off a rock and landed on his head. His revolver, which he had stuck casually in the waistband of his trousers, caught on the edge of the rock and caused him to fall going through the rocky part of his leg. He returned to town and is now at the barracks under Dr. Macdonald's care.\n\nStaff Sergt. Fraser had his ankle twisted while returning from the lake. He was able to walk after a few minutes rest, but he will not be able to go for a couple of weeks.\n\nSergt. MacBarnes, of \"C\" troop, was also injured. He has been here for about two weeks. He has been on leave of absence for a month or so.\n\nCALGARY.\n\nFrom the Herald, July 30.\nHon. Mr. White and party left this morning for Banff. They are all more than delighted with Calgary and its surroundings.\n\nMr. Wiley is in the hands of the Police. He has been arrested by Henry Leach, of Donald. Wiley is accused of opening a postal package addressed to Leach and sending a salami to Leach's wife. Since the arrest every effort has been made to find Leach but without success.\n\nMr. Miquelon has received a telegram from Capt. Graham, inviting him to Winnipeg, asking him whether he could get employment there for some of his men. Mr. Miquelon answered that he might find places for ten or twelve servant girls, but not for any of the men.\n\nAny person requiring help of any kind should consult with Mr. Miquelon, who will do all he can to get them servants and other helpers.\n\nBANFF.\n\nThe National Park of our fair Dominion. Egal, how exceedingly fortunate are we inhabitants of this northern climate, as the National Park offers such a haven for the tourist. It is not only the mountain pleasure-seeker and lover of nature who finds a curiosity in visiting it; the sight on grand scenery and the lack of the suffering portion of our community can obtain relief from their sufferings in the coolness and freshness of the place. But the place ye members of the press! No assertion of your part can exceed the truth regarding this place. They are pronounced a blessing by all who have visited it. It is a place of rest and refreshment for the weary traveler. Let the world know it so that the poor can obtain relief.\n\nLet the grand scenery be known; that's been the poor's deal with the mountain. It is a place where one could find comfort and peace. Now that it has been found; and now let us make the most of it.\n\nWay up here, high upon the mountain slope and close by the Hot Springs, is a cluster of buildings, one above the other, among the trees. One must climb the other to get all the comfort that the springs offer. By means of water pipes, and kept in these hotels dwell numerous strangers from all parts of the country. Some on crutches, on sticks, old, lame, young, old and young. Many who have been told that they could not live, yet they do. Bright eyes, bright faces, and many are there also, but who battle the odds of life. The sight of the healing waters is a great comfort to the body and soul. It is a place where one can find comfort and peace. Now that it has been found; and now let us make the most of it.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY,\nPublisher and Proprietor.\n\nPRINCE ALBERT BREWERY I\n\nPure and Sparkling AMBER—(Hop)—ALE,\n\nDelivered to all Parts of the Town.\n\nMINTOSH & GERROND\n\nRUSSEL & DAVIS,\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\n\nBROWN'S BRICK STORE.\n\n\"BELI.\"\n\nORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nMOORE & MACDOWALL.\n\nDressed Flooring, $48\n\nUndressed do., $42\n\nDressed Siding, $48\n\nUndressed do., $42\n\nSheeting, $30\n\nCommon Lumber, $35\n\nDimension do., $40\n\n\"Lath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe have a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of all European Canadian and United States News.\n\nSpecial news reports compiled by reporters throughout Manitoba, the Northwest Territories and British Columbia.\n\nComplete reports of Parliamentary proceedings at Ottawa and Winnipeg.\n\nTHE MORNING CALL also covers the proceedings of the United Press Association in Winnipeg and broadcasts the latest news from the great lakes.\n\nSubscription: One year five six months $1; three months $1.50. Strictly in advance. Sample copies mailed free by mail on application.\n\nSubscribe now.\n\nAddress:\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS,\nPresident and Editor-in-Chief.\nAQUATIC\n\nThe Toronto Mail's account, from their special correspondent at Pallman, Ill., of the Haskin-Grandar boat race puts an end to the question of whether the Canadian or the American boat will win the race. It is as follows:\n\nChicago, July 26.—The Toronto boat claim to have been officially announced here. His name on the list of the contestants not being fairly carried back for him the title he won at the Toronto race October 18th, 1885, he has been opposing a fresh northeast wind springing up at dawn, which interfered frequently with his boat. He was finally forced somewhat. Haskin and Grandar were racing in the course both spanning over it very early. The first boat to appear in the best form. Grandar's backer, Mr. John, was not suffering from the same difficulties as the previous contest, and this was looked upon as a little significant, partly certainly, because Mr. John had been so emphatically forecast his success yesterday. The arrangements were not of the best, however, and Mr. John, as a result of it, was that the referee could call the race before six o'clock, if, in his opinion, the boat was not ready.\n\nThe race, however, was deferred nearly two hours by the referee in deference to the weather. When the water was too rough, the race was postponed until the next day. Thousands of people came to witness the contest. The weather was slightly better in the afternoon, but the race was still wet. Rumor was circulated that St. John's man was not feeling well, a liberal amount of beer was consumed.\n\nAt 3:30 o'clock, nightfall had again completely settled in, the referee, in steaming boats, was unable to see anything. The race was shortened and the race was again deferred. As stated, it was quite dark when the race was made. It appeared that the flag could scarcely be distinguished between the space intervening between the two tugboats and the starting point. Haskin was in his boat. He tipped the scale at 29 pounds and measured 31 feet 3 inches in length. The outrigger was spread 4 feet 6 inches. Grandar was in a Reddick shell, the race was started. The race was started at the start was 82 and Haskin's 31, a rate which was latter afterwards reduced to that of the race. The race was started at the start of half a length which he maintained for half a mile. Then the Toronto boat began to show signs of strain like a shot. This was all that was seen of the race until a shadowy form, which appeared to be the boat, came into view. The finish line. Haskin had made the first mile and a half in nine minutes, then the race was called off.\n\nGrandar pulled off the course, and when he came in he was to the north of Haskin's boat. He had made the race in 50 yards. At Grandar's boat in sight woefully beaten a short went up which strained him to make effect. Haskin had completely outdistanced him and won the race in 20 minutes 32 seconds, finishing some 100 yards later than on the other side of the river where no one could see him. When Haskin got out his shell was largely divided; the boat was empty, the wind went wild, and he was carried up to the house on the shoulders of enthusiasm.\n\nThe Mail contends that Grandar was not only equally beaten, but that Grandar's boat is at sea.\n\nGENERAL NEWS.\n\nToronto, July 26.—The Chicago correspondent says: The Canadian vessel was then matched by Derby by one minute and two runs. They made 150 and Derby 12 and 88. Gilbert and Ogden bowled away at Sandusky. Samuel Smith recovered from his illness and Ferri is improving. The North country papers suppose that the Canadian boatmen are professionals taking part in the matches. Haskin, on reaching the Island last night, was met by a crowd of friends expected to the harbour. In answer to calls for a speech, he said he was not satisfied with Grandar's boat which was smaller than his, and he regretted being connected with such a boat. He would say that the next contest should be held in Toronto bay, as he was tired of peddling the championship about the continent. He was now going to America and would endeavor to return with the world's championship.\n\nLondon, Eng., July 29.—Agriculturists throughout the country are expressing their gratitude for the decision of the Government to cease for the present the purchase of Canadian horses, and are urging the War Secretary to make special efforts to maintain the horse supply of the Canadian forces in the field of battle. The confident opinion, however, is that the situation is not yet in the most critical stage, and that of hostilities the government will be compelled to obtain an outside supply, while Canada is able to maintain its own field force.\n\nVancouver, B. C., July 29.—The steamer Port Augusta, Capt. Hogg, arrived from Victoria, B. C., July 28. Tacoma July 13, at 2 o'clock p.m. She experienced fine weather throughout the trip except for a squall near the coast, but the captain was only able to take two observations. She arrived off land the morning of July 13, and today she is at anchor for two days, waiting for the fog. She has sixteen passengers and crew, including Governor's five daughters; also 14 bags of mail. She has a cargo of $18,000 packages tea and general merchandise, 3,000 cabbages.\n\nTERRITORIAL NEWS.\n\nREGINA.\n\nFrom the Leader, July 26.\n\nThe day contracts for the Mounted Police here were tendered for at from $10 to $12 per ton.\n\nLieut. Governor Alexander Mac. Alister, who was present in Regina, was visiting relatives, returning from Basil.\n\nMr. E. B. Elliott saw a real live tree taken out last week near the Leader office. It stands there still, but it succeeded in making its escape.\n\nThe Indian Department buildings here are undergoing some much needed repairs. Today they were in charge of Mr. R. H. Gordon, Acting Clerk of the Council, is admirably fitted for the post. He has won golden opinions from all who have dealt with him.\n\nThe man furnished by the Wilber and was a rare treat for the citizens of Regina. He was a good hand at the hand, too, and we say \"different here.\" We are most thankful that the Indians are getting a fair deal. The band was like unto a North West breeze whistling through a silver on the top rail of the building.\n\nA Postmaster has been sent here from Saskatchewan to bring back the deserter Blackcloud.\n\nMr. J. M. Tucker, who has been on a trip through the Territories, says Prince Albert is prospering.\n\nQU'APPELLE.\n\nFrom the Progress, July 27.\n\nAny number of workmen will shortly find employment here on the Wm. Macdonald and Co. Railway.\n\nThere has been considerable rain here this week. Had it come three weeks ago it would have been worth more to winter crops.\n\nThe harvest has commenced. Frederick Symons, north west of here, has his first load of grain in and other fields are being cut this week.\n\nThe crops now at work on the Wm. Macdonald and Co. Railway have been located and staked fifty miles of the line and the work is still going on. The line is to run from the town of Prince Albert and crossing the river leaves the valley by the jumping creek.\n\nTom Ross, head of Prince Albert, was in town this week.\n\nBAILEYFORD.\n\nFrom the Leader, July 26.\n\nHugh Richardson has been appointed Deputy Clerk of the Court for this Division of the Saskatchewan District.\n\nMr. Waddell, Inspector of Indian Affairs, has completed his work here, left for the 2nd for Victoria.\n\nOn Wednesday H. R. Porter, former student of the Normal College, returned to town to remedy some defects in the working of Prince Albert's new mill.\n\nThe summit of the mountain here was seen near noon. Harper's place, Eagle Hill, a few days ago. The man who was seen did not count a close acquaintance.\n\nThe Rev. J. A. McKay having accepted the position of Principal of Emmanuel College, Prince Albert, has tendered his resignation as Indian Agent. In view of the recent division of the agency it is likely a permanent successor will be appointed just now.\n\nRev. Clark's Vegetable Sugar Coated, Liver and Antidiphilus pills, 25c. a box.\n\nCLEARING SALE!\n\nNuns' Veiling, Merino, Ginghams, Wincies, Boys' Jersey Suits,\n\nThe above will be sold at a close margin on cost.\n\nPillow Cotton and Twilled Sheetings.\n\nR. C. Wigmore & Co.'s\n\nESTABLISHED: 1879.\n\nBUY YOUR\n\nCook Stoves,\nHousefurnishings,\nHardware and Tinware\n\nFROM\n\nJ. R. McPhail's\n\nMachine Oils,\nAmerican Coal Oil\n\nLow Prices. Good Value. Prompt Attention\n\nAT\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\nIN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\n1879.\n\nBuffalo Hall!\n\nNEW GOODS\n\nARE BEING OPENED EACH WEEK.\n\nAlways on hand Fresh Lines in\n\nDry Goods,\nClothing and Groceries\n\nPrices will be found right and nothing but reliable goods shown.\n\nBUFFALO HALL FOR\nDress Goods, Corsets, Hosiery, etc., Ready-made Clothing\n\nBETTS & Gwynne.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887081201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9515, 2], [9515, 15091, 3], [15091, 24100, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]