[{"id": "2c74f73250f8ab9da128999c9a6a2a6d5bf61664", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETTY\nPRINCE ALBERT N.W.T.\nTUESDAY, OCTOBER 7, 1887.\n\nTO AGENTS\n'79.\n'87.\n\nNOTICE.\n\nCall and inspect our improved Heating Drums\n\nStoves and Stovepipes put up and cleaned on short notice\n\nPanel Doors and Sash,\n\nAT\nT. J. AGNEW'S.\nT. N. CAMPBELL.\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL SIZES—WRITING AND COPYING.\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\nNEW GOODS\nAT\nCHAS. MAIR'S WEST END STORE,\nSASKATCHEWAN.\n\nALL AT LOW PRICES.\n\nPRINCE ALBERT\n\nBREWERY!\n\nPure and Sparkling!\n\nAMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nMINTOSH & GERROD\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Howell & Co.,\nNewspaper Advertising Bureau,\n10 Battery St., New York.\nSpecial Rates for 100 copies.\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY.\n\nPublisher and Proprietor.\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nThe comptroller proposed \"The Mayors Corporation,\" and in compounding the vote with Mr. Macintosh, he placed him both as mayor and as a successful politician. Judge Macintosh, Mr. Macintosh was very proper and polite in doing so referred to some of the elders of the corporation. He also assured the members of the corporation that he would be attentive to the importance of the society. Mr. Stewart also made a few remarks in reply.\n\nMr. Adams proposed \"The Newcastle Exhibitors and Mr. Charles Robertson replied and referred to his own experience in the same line of business, next in Ontario, latterly in the North-West—his case being that he had been engaged in the same line there and anywhere else he had lived.\n\nThe comptroller proposed \"The Judges,\" and Mr. Conner, Capt. Hoey replied, and pointed out that they had been engaged in a decided success over all. In his own opinion, he thought that the judges, since very fine animals had been exhibited, and he wished to say his colleagues had done their work harmoniously, and he trusted they had been appreciated by the exhibitors. Others followed and endorsed the captain's remarks.\n\nIt had given him great pleasure to be present at such an occasion, and spoke of the excellence of the meat and vegetables. He also complimented Mr. Miller who had been successful in promoting the exhibition, and thought there was an indication of progress which was very encouraging.\n\nMr. Clark then kindly spoke proposed \"The Newcastle Exhibitors,\" and it was with the name of Mr. Wm. Miller, who had been the great interest behind taken in the affair, and who had been the historian of other. Mr. Miller kindly replied and expressed his thanks for the speeches.\n\nThe next stage of the proceedings was the announcement of the prizes. After the presentation, the chairman politely brought this successful meeting to a close. It was evident that many of those who had a long way to travel found the meeting very interesting. The principles, but there was no doubt that the exhibition had been present appeared to enjoy the meeting.\n\nThere took off his several way\n\nAnd now open and ready for inspection.\n\nBETTS & Gwynne.\n\nESTABLISHED: 1879.\n\nUPRIGHT AND BOX Heating Stoves\n\nFrom the Plainest to the Most Elaborate Design.\n\nHeating Drums\n\nIn Great Variety.\n\nAmerican Coal Oil\n\nJ. R. McPhail.\n\nCLEARING SALE!\n\nNuns' Veiling, Merino, Ginghams, Wincies, Boys' Jersey Suits,\n\nThe above will be sold at a close margin on cost.\n\nPillow Cotton and Twilled Sheeting.\n\nR. C. Wigmore & Co.'s.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating Worsted, Canadian Tweeds Summer Suitings in All Grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887100701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 1281, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 949, 2], [949, 1816, 3], [1816, 4591, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]