[{"id": "75134120ef793703e82e860e00878977018f8461", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSUNDAY SCHOOL REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N. W. T.\n\nThis Paper may be used in connection with the Sunday School.\n\nTHIS PAPER may be used in connection with the Sunday School.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n1 p.m., Rev. Mr. Smith.\nThe Mission Chapel.\n2 p.m., Rev. Mr. Wright.\n3 p.m., Rev. Mr. Wright.\nSt. Paul's.\n4 p.m., Rev. Mr. Smith.\nMcLinden's.\n6 p.m., Rev. Mr. Smith.\nSt. John's.\n8 p.m., Rev. Mr. Smith.\nSt. James'.\n9 p.m., Rev. Mr. Smith.\nSt. Anne's, R. Catholic.\n10 p.m., Rev. Mr. Smith.\nSt. Paul's (Presbyterian).\n11 p.m., Rev. Mr. Smith.\n\nFRIDAY, DEC. 4, 1885.\n\nTHE N. W. COUNCIL.\n\nThe speech with which his name the Lord Mayor, Mr. Smith, opened the present session of the North-West Council contains very little of interest to the people of this district, except the reference to the Municipal and School Ordinances. Both of these Ordinances are now in need of amendment, and the Council should endeavor to put them in a workable condition at once.\n\nIt is of the utmost importance to us to have good schools, and to have good schools we must have a good school law. If the Public School system was in its infancy there might be some excuse for the Ordinance which at present governs the schools of our Territorial District. But with the experience of the whole of America before them, there is no excuse for the Council not putting a good workable system upon the statute books. The general principles of which the Ordinance is based are excellent, but the minor details upon which the working of the system depends are very faulty. The fact that the Ordinance was not revised in town as well as in rural communities seems to have been lost sight of altogether, but it will have to be remembered in amending the Ordinance or it will still be unsatisfactory. The Council will in their regular business meet more frequently in their labors by the practical information which has been obtained from the school boards already organized.\n\nAlthough the Municipal Ordinance shows signs of being drawn by a more skilled draftsman or from a better model than the School Ordinance, there is a great deal of room for amendment in it also. Certain powers should be given to Town Councils, and others taken away, raising a question thus by direct action, which is always a heavy burden upon early settlers, and is especially apt to retard the growth of a new town. Large portions of the revenues of towns in the east are raised by fees for licenses, and duties laid for infringements of laws made and enforced by the Town Councils. It is the intention of the North-West Council to levy shop, auctioneer and other licenses in order to the raising of revenue for municipal purposes. The Town Council, the only legislative body which is likely to be elected, has made a request for some time to come for billiard tables and arcana. These are at present issued by the Lieutenant-Governor to raise revenue for territorial purposes, and the power to issue a list of licenses which are not likely to be in demand until there is a much greater population than at present is given to Town Councils. The Councils are far too weak to make laws on the Territories if the power to issue all these licenses, within their own limits was delegated to Town Councils in order to assist them in raising a revenue for municipal purposes. The satisfactory and efficient habitation for municipal elections would be another amendment that would improve this Ordinance.\n\nAlthough there are at present a majority of elected members in the Council, it can hardly be called a representative or responsible body, with eight appointed members, none of whom has two votes, and who are all dependent upon the Government at Ottawa for their bread; it must of necessity be the creature of the Minister of Justice. This system might work very well among the natives of India, but in free America it is not to be tolerated, and the \"servile\" of the Territories should each vote twice to be satisfied any longer with the shadow of responsible government.\n\nA circulating itinerant connection with the Presbyterian Church is doing good work amongst the Indians. We commend the scheme, and hope some of the surplus cash in town might be put to a similar use.\n\nThe Mansehows say—Mr. Page, president of the Regina and Long Lake Railway, is rapidly in proving his health. He states that tracklaying on the Regina and Long Lake Railway has now reached the Qu'Appelle Valley. It is now intended by the company to have a steamer on Long Lake in the spring, which will run from the Qu'Appelle valley about six miles north. This will greatly facilitate travel between the Canadian Pacific and Prince Albert and Battleford. It is also expected that the railway will be pushed on to the Saskatchewan next season.\n\nConsiderable talk has been indulged in during the past week about the uneasiness manifested amongst the Indians, and we believe not without foundation. This state of affairs is very detrimental to the trade and commerce of the North-West. It is now gladly to be regretted that B Battery has been removed from our midst. We think that steps should be taken immediately to secure its return. At present there has only a small force of Mounted Police, and a limited number of arms, and in case trouble should arise assistance could not be rendered in reasonable time, being so far from reasonable communications.\n\nThere is great excitement in Regina over a sentence which Judge Traverse passed upon Mr. J. Clark, one of the commissioners of that town. It appears that the N. W. M. Police have been in the habit of entering and searching the premises of any person suspected of having liquor in his possession without a permit, and when such a search is made and a man has finally decided whether the Police had this power, Mr. Clark refused to allow two policemen in plain clothes and without a search warrant to search his store. For this refusal he was tried and convicted of assault and sentenced to six months imprisonment. The Town Council passed a resolution, in which the sentence was referred to as \"unjust, severe and arbitrary,\" and a deputation was sent to Ottawa and interview the Minister of Justice for the purpose of having the imprisonment reduced. A large sum of money was raised by the expenses of the delegate to Ottawa. This is not the first occasion on which Judge Traverse has come into conflict with the people of Calgary and accused the settlers with which he has met with punishment. Shortly before that he had sentenced a prisoner to a long term of imprisonment for a minor offence, but he afterwards wrote to the Minister of Justice that he would reduce the sentence. It is, but since the actions of the people in the Clark case, he has telegraphed the Minister to leave the sentence as it is. We are sorry for the residents of the Calgary district that they have not felt justified in congratulating themselves that Judge Rouleau choose to remain in this district when the chance of either remaining here or taking the Calgary district was given him when the fourth appointment for the Territories was appointed.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 11 feet extra.\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHOS. POWERS,\n\nCONTRACTORS\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to.\n\nBrick and Lime always on hand.\n\nWILLIAM KNOX,\n\nCARPENTER, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nJUST OPENED.\n\nPOST OFFICE BOOKSTORE\n\nBooks and Stationery\n\nThe Finest and Most Complete Stock in the Territories.\n\nCrockery and Hardware, AT COST\n\nNOTICE!\n\nOn account of my recent loss by fire I must request all those indebted to me to call and settle their accounts immediately.\n\nI will be found for the present in A. L. Sitton's law office next door west of Stewart's store.\n\nE. J. CANN. STEWART BROS. F. E. JACKSON.\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION 14th.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Premiums and Grand Prize Scheme.\n\nOver $1,400 worth of Handsome Prizes to be given away\n\n100 Splendid Prizes.\n\nBalance of 1885 FREE. Only $2 to 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nAt no former period in the history of the Manitoba Free Press have the publishers made their annual announcement with so great a degree of confidence in the prosperity of the paper as at present. The Free Press has been the leading paper in the North-West for many years past, and its influence has been felt throughout the country. It is now the largest newspaper in Canada, and its circulation is increasing every day. The publishers are confident that the Free Press will continue to be the leading paper in the North-West for many years to come.\n\nAs a first inducement the balance of the current year from any time hereafter will be given free. As a second inducement the publishers have decided upon giving an additional month's subscription for each month of the balance of the year. As a third inducement the publishers have decided upon giving an additional month's subscription for each month of the balance of the year.\n\nThe publishers are confident that the Free Press will continue to be the leading paper in the North-West for many years to come.\n\nHOW TO SUBSCRIBE.\n\nEnclose Two Dollars in registered letter writing name and address very plainly and address to\n\nFREE PRESS, WINNIPEG, MAN.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\nNORTH WEST NOTES.\n\nEDMONTON.\n\nFrom the Gazette.\n\nNo sign of ice yet.\n\nSt. Albert has harvested the last part of seeding spring wheat in the fall this season. The same experiment was tried several years ago, and the crop showed a good appearance, but was eaten by hail.\n\nRev. John McDonnell and wife left for Victoria on Tuesday last.\n\nTelegraph. Fax was not working on Thursday afternoon after a long run.\n\nJarus & Stewart left on Fax for Victoria with several loads of Indian supplies.\n\nSt. Albert school has an attendance of forty pupils, and an average attendance of thirty-five.\n\nA detachment of Police leave Fort Saskatchewan today to attend the treaty payments at Victoria agreed upon.\n\nSome Indians who had been held in police arrived from Bear's hall on Friday. No further arrests were made.\n\nThe telegraph wires between Edmonton have been completed, and were wired to Ottawa by yesterday's mail.\n\nRev. Peter Lavelle, principal of the Indian Industrial School at High River, is taking south with him some children from Michel's, Roche's and Papasay's on a visit to Mr. and Mrs. Robert Blackett, for whose benefit the school was organized, refuse to attend and submit to discipline.\n\nM. Malo has a specimen of native flour from red file wheat, grown at Hartney's farm last fall, which he finds very superior in color and quality with the best Winnipeg flour. The return was 190 pounds of flour to two and three quarters bushels of grain.\n\nBATTLEFORD.\n\nFrom the Herald.\n\nBATTLEFORD, Nov. 28.—Wagons by the hundred are now coming in, all filled with goods, and they have been going down the river for weeks.\n\nA completely established post and agency building is among the industries established here this fall.\n\nAn agent resides for the officers and a smithy is being erected in course of erection for the purpose of blacksmithing.\n\nThe patients in the police hospital have been removed to the building carried and will shortly occupy by Constable Guthrie.\n\nMore building timber has been brought into town during the past month than in any similar period in the history of the town.\n\nThe Industrial School has been removed to its present location, the house lately occupied by Mr. Ross. Mr. Ross's house is to be made for Principal's residence, and the schoolroom is part of the school, when the house at present occupied will be converted into a school room and storehouse.\n\nFORT MELROD.\n\nFrom the Gazette.\n\nFort Melrod, Nov. 17.—It has been decided to build the Methodist churches at Melrose and Lethbridge, although money has been subscribed at both places, and teachers will soon be called there.\n\nWhile A. F. Gray was putting up new chimneys at the barracks on Tuesday morning, the iron hooks on the end of the ladder broke off, and fell to the ground a distance of about fifteen feet. He was rendered unconscious by the fall, and has been obliged to keep his bed for some days.\n\nOn Thursday night eleven persons took advantage of the darkness, a few miles below town, and ran off. At midnight the people on the range were called, the guns were loaded, and the sound of the horses' hoofs was heard. The men were let down, hid beside the fence, and the horses driven away. An opening was made in the fence, and the men were lifted over. They were only in the middle of the trail near the corner. This was evidently a very clumsy attempt at escape, as it appeared well known that the line was too wide.\n\nQUAPPILLI.\n\nFrom the Progress.\n\nQuappilli, Nov. 20.—H Battery is now in comfortable quarters.\n\nGENERAL NEWS.\n\nPORT MOODY, B.C.\n\nFrom the Gazette.\n\nPort Moody, B.C., Nov. 14.—There are now four boats of Indians brought back by Mr. Macdonald.\n\nThe mountain peaks north and east of here have received a fresh coat of snow.\n\nWest bound train No. 2 on Sunday last came into collision with a hand car loaded with logs, killing the engineer and fireman. The engine was wrecked, but Mr. Heggie and his men escaped uninjured.\n\nMr. J. K. Lytton, of the Lake Kootenay ranch, has returned from his trip, having dropped the boat at four pounds four ounces.\n\nMISS MACK & CO.\n\nJUST RECEIVED:\n\nA large assortment of Ladies' and Children's\n\nStraw, Felt, Velveteen and other Hats, Hosiery, Skirts, Feathers, Plumes, Ribbons, Satin, Velveteen, Pipers, Caps, Fur Caps, Bonnets, Corsets, Wraps, Gloves, Hose, Batting, Linings, etc.\n\nFirst Door East Telegraph Office.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\n\nShannon & McLeod.\n\nSTANWAY.\n\nFrom the News.\n\nStanway, Nov. 21.—The attendance at both schools is rapidly increasing.\n\nThe recent visit from Anglicans who visited the school, and the attention by the feet was so fine that excellent, as there are very few instances of its being used.\n\nThe day that week Mr. Vincent of Victoria went on a hunting expedition. He started out early in the morning, and the evening succeeded in buying 150 rabbits.\n\nThe building for Reid & Anderson's trading post is still under construction.\n\nAll hands are now busy engaged in the work of raising the building.\n\nThe main building will be thirty feet and the width from thirty feet.\n\nDuring the past week Castle & Robson have been engaged in the erection of permanent buildings in the shape of Indians and half-breeds who could be obtained by raising the cattle on the North West.\n\nMr. Foster, of Anglia, although in a state of ill health, paid a visit to the school, and was pleased to see the progress made as far as a sample as yet shown.\n\nDANIEL CAMERON.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nOur Stock for WINTER WEAR\n\nNow Complete.\n\nAn inspection of Goods and Prices will convince you that we mean Business.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine, Plastering Hair, steam refined, Powder, Shot, Caps, Shells, Etc., Etc.\n\nKeep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & Co.\n\nO. E. HUGHES & Co.\n\nGeneral Merchants and Indian Traders.\n\nWe have just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nMorton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar.\n\nWhich defy competition. Also our celebrated Ogilvie's Flour.\n\nO. E. HUGHES & Co.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert—N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885120401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3952, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8319, 2], [8319, 10116, 3], [10116, 16766, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]