[{"id": "2c7431f67e2f20711c6eb21c6b8ac74e388db684", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nBANKING HOUSE OF\nMACARTHUR & KNOWLES\nPrince Albert, N.W.T.\n\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nNOTICE.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nLOST.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nTELEGRAFIC.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nCHIT-CHAT LOCALS.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nPUBLIC NOTICE.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nVICTORIA Livery and Boarding Stables\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nPUBLIC NOTICE.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nROYAL MAIL STAGE I WEEKLY\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nCONFECTIONERY\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nWINTER CLOTHING\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nBUSINESS\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\n\nTHOS. ORAM\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 24, 1885.\n$2.50 A YEAR.\nTHE PRINCE ALBERT TIMES\n\nSUNDAY CHURCH SERVICES\n\nMANHOOD SUFFRAGE\n\nTHE DELEGATION\n\nMASS MEETING\n\nCASH—1888—STORE\n\nEmporium of Fashion.\n\nDry Goods,\nReadymade Clothing\nUnderclothing,\nHosiery,\nBoots and Shoes,\nCrockery.\n\nAND A COMPLETE STOCK OF\nGROCERIES!\n\nTHOS. O. DAVIS.\n\nClearing Sale.\n\nParlor Stoves\nAT COST\n\nBox Stoves\nREDUCED TEN PER CENT.\n\nAcme Skates\nREDUCED TEN PER CENT.\n\nT. J. AGNEW'S.\n\nSchool Books and Stationery,\nPublic and High School Text Books\nSchool Requisites of every description,\nStephens' Blue Black INK.\nALL SIZES WRITING AND COPYING.\n\nOffice Stationery, etc., etc.,\nJ. M. CAMPBELL\n\nFall and Winter Goods\n\nDress Goods\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMEN'S\n\nFancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF\n\nMitts and Moccasins\n\nIN THE TOWN.\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR!\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nInspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\"Over 1/4 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, New York City.\nOpening of Parliament\n\nOttawa, Feb. 23.\n\nLong before 10 o'clock to-day the hall began to fill up with people anxious to get a glimpse of the new Government. The doors opened the gallery was crowded and the floor of the Chamber was filled with members of the House, senators, judges and cabinet ministers.\n\nShortly after 10 o'clock His Excellency arrived and was greeted by a guard of honour from the Governor General's Body Guard, when the following detailed speech was delivered:\n\nGovernment of the Legislative Assembly.\n\nThe negotiations between His Majesty's Government and those of the United States and Great Britain have been known as the fisheries question but I am pleased to inform you, resulted in a treaty which will I venture to hope be considered by both nations honorable and satisfactory to both nations.\n\nExperience having shown that amend measures would not affect the provisions of the Act respecting elections, members of the House of Commons more effectually and more convenient in their operation, I have thought it desirable to make a measure for the amendment of that statute.\n\nLegislation for the Northwest Territories renders essential an improvement in the system of government and legislation there. The present situation of the Dominion, and a bill for that purpose, will be laid before you.\n\nA Bill will be submitted to you to make a complete adaptation of the modern laws of England applicable to Manitoba and the Northwest Territories in regard to matters of local administration. The Acts of the Parliament of Canada, but which have not yet been made the subject of Canadian legislation.\n\nThe extension and development of our railways have only rendered additional extraordinary safeguards for life and property, but they have also given occasion to questions in which the interests of rival companies are found to be in conflict. In order to prevent such adjustment a further legislation appears to be needed for these purposes. A measure will be submitted to you for the consolidation and improvement of the railway act.\n\nAmong other measures, bills will be presented to you relating to the judiciary. To the Civil Service Act, and to the audit of the Public Accounts.\n\nThe members have been returned to their chambers, the books containing the results of judgments of the courts in the recent elections and announced that a warrant will be issued for a second election in Russell. He announced the following vacancies—Dorchester, Charleswood, West Kildonan, Queen's N.R., Victoria and Carleton.\n\nWhen the new members were introduced, Sir John made the usual formal motions, and then read the second reading of the Bill for the administration of oath of office and the appointment of standing committees.\n\nThe House was then adjourned until Friday.\n\nSenator Hardisty arrived to-day.\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Town Council was held last Friday evening at Mr. J. D. Hammond's, the president's residence, and the clerk was directed to advertise for a collector.\n\nA by-law to provide for the organization and management of the fire brigade received three readings, and was ordered to be signed, sealed and numbered.\n\nThe draft petition or representation was presented, read and adopted.\n\nThere was also presented and read a draft petition for railway communication, but was deferred until a report was received.\n\nThe Council then adjourned.\n\nThe Council met again on Monday evening last, and adopted the draft petition brought in by the special committee to collect signatures.\n\nThe Council again met on Thursday evening, and the motion was passed approving the appointment of Mr. H. W. Macdonald as a delegate on behalf of the Town Council to go to Ottawa in connection with debate on the question raised by the Board of Trade and the Lorne Agricultural Society to present petitions relative to representation and railway communication.\n\nAgricultural Society.\n\nThe annual meeting of the Carrot River Agricultural Society was held last Friday afternoon at the schoolhouse. In the absence of the president, the chair was filled by the late Mr. J. M. Clark.\n\nThe minutes of the last meeting having been read and approved, the election proceeded with, which resulted as follows:\n\nPresident, Mr. John Sanderson.\n\nVice-president, Mr. C. S. Lowrie.\n\n2nd Vice-president, Mr. Wm. Rossiter.\n\nSecretary, Mr. James Tenney.\n\nTwo directors were appointed.\n\nThe Sec. Trust report to the meeting was very satisfactory, showing the society's balance sheet balance on hand of $156.47.\n\nA vote of thanks has been tendered the retiring officers, the meeting adjourned to meet again at the request of the president.\n\nGentlemen are requested to attend the annual general meeting of the Carrot River Agricultural Society to be held at the schoolhouse at 8 o'clock p.m. on Tuesday next.\n\nCapt. W. F. Meyers, of Kinistino, was in town this week.\n\nTELEGRAPHIC.\n\nQu'Appelle, Feb. 23.—Great excitement prevails here over a case of high treason. Mr. Thomas Smith, a native collector, from Indian Head, left here on Monday night with about $800, but was robbed by Indians before he was able to reach his destination. They stopped him, bound, gagged and blindfolded him, then took his money and dragged him off toward Indian Head to near the reserve where he was killed. He managed to crawl to his own house, where he died. A large party of men left for there this morning. Nothing definite is known as yet.\n\nLondon, Feb. 23.—A most interesting parade of Liberal and Parliamentary leaders was seen this season will end in London. The Government has sent the Lord Lieutenant of the province, the foreign policy of the Government and the Land Purchase Bill. The Lord Salisbury regime will be remembered as one to give the Liberals a victory in the Edinborough election.\n\nWhile Mr. Richard Hardisty has been busy in the Northwest, and it is said officially that the Lord Governor-Douglas will not be able to attend the meeting.\n\nAt the annual meeting of the Liberal Conservative Association on Friday night Josephine Butler was presented by 129 votes to 124 for Sarah. Nine weeks ago the same ballot was given to Mr. Mulock, one of the scorers, who could not have given the majority. Mr. Butler expressed that the nine ballots were done up together and had been thrown in by one man. Mr. Butler said that he had said, before the election, that he would do his best to defeat him, asked Mr. Butler to explain why he voted which was refused. A scene of wild disorder ensued, lasting till midnight when order was restored.\n\nPant Duffield, late Viceroy of India, has accepted appointment as ambassador to Italy.\n\nVarious and contradictory reports are current regarding the fisheries treaty. Nothing definite is known as yet.\n\nIf the fisheries treaty is rejected, an important question will arise. It is reported that he will be appointed to settle the disputed question regarding the boundary line between British Columbia and Alaska.\n\nIn the earlier part of the evening Sir Donald Smith's trophy, Mark II, turned its rock, of the Granitic club, won.\n\nMontreal, Feb. 23.—The secretary of the Board of Trade has written to the wheat board in Montreal, saying prices are too dear of Vancouver and Victoria, by Mr. McPhail, Secretary of Winnipeg Board of Trade.\n\nThe Reading, Pennsylvania, coal mine's strike was ended and the miners have returned to work.\n\nGladstone made a short speech in the House of Commons on Saturday night to assure the country that the government by old members to be one of the finest electoral efforts in the parliamentary career of the veteran statesman.\n\nMichael Davitt, the Irish Fenian enthusiast in the big crowd, \"the grand old man is good for fifty years yet,\" and Parnell replied, \"he will live to witness the triumph of justice.\"\n\nBuffalo Hall!\n\nTHE LAST SHOT OF THE SEASON!\n\nAnd we are going to make it an Effective One.\n\nOur Closing Sale for the past thirty days has been a grand success. Have and destruction is in stock and prices for the next month. We shall have a large stock of\n\nWINTER DRY GOODS AND CLOTHING\n\nTo clear out before our March stock taking.\n\nSweeping reductions will be made in every department. Everything in Staple and Fancy Dry Goods\n\nMarked down, regardless of cost or value.\n\nThis is a Great Money Saving Opportunity. Don't neglect it.\n\nBETTS & Gwynne\n\nFOR\n\nNEW GOODS\n\nAnd Close Prices go to\n\nJ. R. McPHAIL'S.\n\nThe balance of our Heating Stoves and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPHAIL.\n\nIMPORTANT NOTICE\n\nOwing to the long delay of our goods in transit, we have made a sweeping reduction in every department, consisting of:\n\nPlushes, Veveeteen, Dress Lawn, India Linen, Muslins,\n\nIrish Diaper Linen, Cashmeres, All-wool Dress Goods,\n\nFurniture Cretonne, Pillow Cotton,\n\nWhite and Grey Flannel, Boys' and Men's Top and Undershirts, Tapestry Carpets and Mitts,\n\nLadie's Winter Jerseys, Boys' Jersey Suits.\n\nLadies' and Gentlemen's Persian Lamb Caps.\n\nR. WIGMORE & CO'S.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888022401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3326, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1192, 1], [1192, 1779, 2], [1779, 3034, 3], [3034, 12500, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]