[{"id": "f3b540df33b234f9c537b577ae0de0ac8a2d1088", "text": "CHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nPRINCE ALBERT, N.W.T.\n\nMr. Wm. Brown intends to give up business in this town at the end of the month.\n\nBy an ordinance passed during the last session of the N.W.C., all partnerships have to be registered. In case of neglect, the partners will be held jointly liable.\n\nIf any of our business firms are affected they do well to make a note of this.\n\nMr. D. Macdonald was succeeded by Mr. A. Cornet Band on Wednesday evening last. They were hospitably entertained by Mr. Band and his family.\n\nOrders left at J. L. Johnson & Co's will be promptly attended to.\n\nNATHANIEL ACORN.\n\nFiring Albert.\n\nI would respectfully inform the public of Prince Albert and vicinity that I have leased Michel Schoen's Blacksmith Shop where I will be happy to see all who will favor me with their custom.\n\nGood Work at Fair Prices.\n\nISAIAS MCALL.\n\nGeneral Blacksmith.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY.\n\nNEW GOODS!\n\nMEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, SPICES, FANCY GOODS.\n\nAtkinson's Colgate's, Lubin's and Lambourne's Perfumery, Pear's and Colgate's Fancy Soaps Hair Brushes, including Kays Electric and Infants' Coloured Horn and Rubber Combs, Gonnell's Tooth Brushes, Tooth Picks, Breast Pumps, Feeding Bottles, Lau's Fruit Salts, etc., etc.\n\nTERMS VERY LOW.\n\nT. E. JACKSON.\n\nAT THE OLD STAND.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING AND SUMMER MILLINERY.\n\nAND FANCY GOODS.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK.\n\nHATS\n\nCAPS\n\nSPRING GOODS!\n\nDE & STACKHOUSE.\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nFIREFIRE FIRE!\n\nPUMP ON WATER.\n\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co's will be promptly attended to.\n\nNATHANIEL ACORN.\n\nFiring Albert.\n\nNOTICE.\n\nI would respectfully inform the public of Prince Albert and vicinity that I have leased Michel Schoen's Blacksmith Shop where I will be happy to see all who will favor me with their custom.\n\nGood Work at Fair Prices.\n\nISAIAS MCALL.\n\nGeneral Blacksmith.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY.\n\nNEW GOODS!\n\nMEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, SPICES, FANCY GOODS.\n\nAtkinson's Colgate's, Lubin's and Lambourne's Perfumery, Pear's and Colgate's Fancy Soaps Hair Brushes, including Kays Electric and Infants' Coloured Horn and Rubber Combs, Gonnell's Tooth Brushes, Tooth Picks, Breast Pumps, Feeding Bottles, Lau's Fruit Salts, etc., etc.\n\nTERMS VERY LOW.\n\nT. E. JACKSON.\n\nAT THE OLD STAND.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING AND SUMMER MILLINERY.\n\nAND FANCY GOODS.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK.\n\nHATS\n\nCAPS\n\nSPRING GOODS!\nTHE PRINCE ALBERT TIMES\nAND\nBASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nTHE NEW AND THE OLD LAND.\n\nIt is remarkable how the people of the old country are being interested at the present moment in the North West Territories, and the present urgent desire given to emigration by countries overflowing with a surplus population, like the British Isles and Germany, it is very desirable that the new land may be brought before the people in the manner in which it has hitherto been done. One can scarcely take up a standard old-country paper but we see some mention of the North West. What is the country like? How is it peopled? One can know as well as one can know its inhabitants, and some new feature is being developed under our own eyes every day, as to what can be done there, and how it can be otherwise. For instance, it has been almost daily, even in the small matter of seed planting, that some German has had success in some way or another; and because a man in a country so far away, not far from the smallest beginnings have great ending.\n\nWith reference to the friends who are working for us abroad, we must mention first and foremost His Excellency the Marquis of Lorne, our late Governor-General, whose voice has been so often heard in the cause of emigration and always in favor of the great North West. We must also mention a correspondent, whom we refer to the Bishop of Saskatchewan, whose word is and has been, so often used in promoting these advantages, and interested in these territories, also other gentlemen who have visited their homes or gone to take a look at the homes of their forefathers, have not been silent on the matter of the new land. As a new country open to emigration on a large scale, it is unequalled, but there is one thing that we must look out for, namely, our emigrant has some thought of the future, when he reaches the North West, and until he gets here he is subject to all the wiles of emigrant agents, some whose business is, of course, to get them settled in these distant places, and should they therefore, the duty of the people of this country, interested, as they are, with the opening of this new land, to see that the interests of the North West does eventually reach his destination, and is not delayed on his way by the specious arguments of these gentlemen.\n\nOFFICIAL JOBBERY.\n\nOnce upon a time, and not so very long ago, it was settled that Prince Albert should possess a Court House. Of course, the Minister looked forward with great local advantage to one of the most rising Towns in the North West Territories. Now, as the action taken by a few of our fellow townspeople testifies in sending a request to the Ministry of Public Works, we find that our Court House from being talked of, is becoming a reality. There is an old saying that \"actions cannot see behind the scenes,\" and so we need only remark that the statement regarding \"Winnipeg\" newspaper, for tenders to build a Court House at Prince Albert,\" the said advertisement emanating from the office of the Minister of Public Works. What has poor Prince Albert, or her unoffending citizens, to do with such a thing? A local work in taking care of their hands and handed over to the Winnipeg firm. The sample state of the case stands thus: some short time since $5,000 were appropriated by the Government for the purpose of building a court house for this town. The next thing we see is an advertisement from the Minister of Public Works in a Winnipeg paper, but not a word of it in our local paper. Why then, dear friends, people a chance. Why have we been left out in the cold, so to speak, in a matter that concerns Prince Albert citizens? It cannot be that we have no mechanics capable of undertaking the work. One look at the town alone disproves that idea when one contemplates the many and nicely finished buildings in this place of necessity. It is not for this reason why an advertisement in the local press to give our several firms of mechanics in Prince Albert a chance to compete with their neighbors, and so to make money spent in public calling on the Government, an opportunity of being spent here? Or is there the possibility of some official jobbery at work? We shall simply submit, that perhaps the Minister of Public Works (though we make no accusations) interested in having the work done at Winnipeg for some consideration of his own. A new town like this has a right to expect to help the Government can give it, and the erection of local public buildings ought to be located as near as possible, and it is a shame that this takes place on the contrary. It seems that some of our citizens should have telegraphed for delay, as they had to yesterday, through the sudden appearance of certain circumstances, of which, believe, they had no previous warning.\n\nHUDSON'S BAY RAILWAY.\n\nJust now the matter is being everywhere manifested in regard to the proposed railway to the Hudson's Bay. The action of the Dominion Parliament in voting large sums for erecting the railway, and also its necessity for the average length of the season of navigation in the Bay is pretty generally commented all through the Dominion, and its success looks as though to confirm the anticipated result. A leading New York paper says on this subject—The Canadian Government has agreed to give a large body of land for the construction of a railway, to connect the Churchill Hill on the Hudson's Bay. This is said to be a fine harbor. The Government is also going to employ a large number of men to winter over the Hudson's Bay Company's Bay, and ascertain how many months of the year they are open for navigation. The railroad and naval survey will go on together, and doubtless the discovery will be made at Fort Churchill. It is important to know whether the open season by this route averages five or six months. It is well known already that it lasts at least four months, during which ships from England will take away all the grain accumulated in the elevators for the previous eight months. There would be little difficulty in getting feeding so far north, and it would be as easy as in Chicago, deliverable to the holders of the warehouse receipts. If this way it could be sold from hand to hand, or advances could be obtained on it from British Banks. There would be no difficulty in find-\n\nEAST END BAKERY!\n\nBREAD UNDEPRESSED BY ANY WEST OF WINNIPEG.\n\nNINE Loaves for $1\n\nHugh McDougall,\nEast End Bakery.\n\nThe Grand Central Restaurant.\n\n(Old Woodbine Saloon)\n\nThis new Restaurant has been opened and is now ready for business.\n\nMEALS AT ALL HOURS.\n\nTHOMAS ORAM\n\nNOTICE.\n\nCANADA.\n\nIn the goods North West Territories, of GEORGE MCKAY, deceased.\n\nWe hereby give notice that the said GEORGE MCKAY, deceased, B. Rowden, one of the Stepney Ma- terials in and for said Territories, has applied for and received a grant of Letters of Abandonment of the said GEORGE MCKAY, deceased, of Prince Albert, in said Territories, for the purpose of settling at Prince Albert, and intends to take up the said land, leaving personal property to be administered.\n\nDated at Prince Albert, this 7th day of May, A.D. 1884.\n\nBy McLean & Elliot, their Solicitors.\n\nR. H. BRATNOBER.\n\nJ. O. DAVIS & CO., SASK.\n\nFURNITURE\n\nFancy Parlor and Bedroom Sets. Give us a call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions. Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nG. & C. E. CARTER, KNOX & BARKER, CARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done by order, next to H. D. F. Grist Mill.\n\nHandsome New Presbyterian Church.\nTERRITORIAL NEWS.\n\nCALGARY\n\nFrom the Herald, April 23.\n\nMajor Walker has removed his mill from the wood bank and setting. The cricket club have received their new uniforms.\n\nArrangements are being made for celebrating His Majesty's birthday; the usual entertainments having a good time shooting ducks and game, of which there are plenty.\n\nA hunt was started on Friday evening last. The contents were saved.\n\nThe necessity for a bridge across the river increases every day.\n\nA great many houses are being built.\n\nA nest has been made of the stone from the quarry on Mr. Bathurst's place, and promises to be a good one.\n\nMOOSE JAW\n\nFrom the Leader, April 24.\n\nDaily train and mail service is to be resumed on the C. P. R. May 14th, navigation permitting. There will be two trains each way from here to Edmonton.\n\nA number of settlers and their men have arrived in town, and are making arrangements to start for Edmonton and Battleford.\n\nMoose, C. W. Wells and O. K. Kidde party arrived this morning. They are about to start on an exploring expedition to Hudson's Bay via the Saskatchewan.\n\nThe M. J. cricket club is in full swing.\n\nA large number of Temperance workers have arrived in town. They left Monday for the Colony.\n\nA small steamer is to be placed on the South branch to convey passengers from Swan River to Battleford.\n\nREGINA\n\nFrom the Leader, April 24.\n\nIt is estimated that full 30,000 head of stock will be seen in this district next week.\n\nThe Regina Reserve Corps will be up by the end of the month.\n\nThe entertainment in aid of the public school was not a financial success.\n\nA number of settlers arrived at the last stage for Battleford.\n\nThe Ladies Aid Society of Knox Church has caused to be held a bazaar on Monday.\n\nFORT MACLEOD\n\nFrom the Leader, April 24.\n\nFour barges have been sent down the river.\n\nThe Fort MacLeod detachment have started work at Hinton and Hibernia.\n\nExchanges were brought back by Sergt. Major and Mrs. Patte.\n\nWe had deliveries of goods on three days last week.\n\nRev. Father LeClerc is doing a good work for the Society, preaching among Indians and encouraging them to bring good families over to the Canadian North West.\n\nBATTLEFORD\n\nFrom the Leader, April 24.\n\nIt is reported that Chief Shingwauk Chaplain has resigned.\n\nA gang of men under R. C. Macdonald went down the river last week to build bridges over the worst creeks.\n\nReservoir district will shortly be our road and subdivision.\n\nThe Indians at the Indian Industrial School will receive new clothing.\n\nA subscription list is being signed to secure funds for the erection of a school at Battleford.\n\nA bridge is being put over Eagle Creek where the trail crosses it.\n\nThe Battleford mail will come in by stage of Saskatoon weekly.\n\nEDMONTON\n\nFrom the Bulletin, April 29.\n\nA police post is to be established at Battle River crossing.\n\nA treaty is to be made with the Peace River Indians, according to the present custom.\n\nAn archeological society of the United States is securing the services of persons trained in the science of anthropology of the continent of America to make the explorations of birds and the chief points of early natural history. Mr. G. A. Wake will perform the duties in this matter.\n\nSILVER CITY\n\nThere was another excitement here last week owing to a rumor that the placer diggings had been discovered in Silver Creek, three miles from town. The citizens left in body to \"wash\" the creek. The rumor proved false, but the bed of the creek was found too hard to allow proper investigation.\n\nThe Hope mine is being developed rapidly, and is working night and day in shifts of eight hours.\n\nThe mine Queen of the Hills is also being worked night and day, and is said to be successful.\n\nA new find in quartz is reported, and already a number of claims have been staked out, but the absence of a good assayist in town is severely felt.\n\nHOLT CITY\n\nThe C. P. R. has promised for an extensive business at the front this season. The engineers have been in the mountain for several weeks, and the work is progressing well.\n\nThe work on the tunnel will not be commenced this year of itself, as Engineer Hogg has located a temporary line through the mountain.\n\nAn enormous glacier, said to be over 100 feet thick, can be seen on Tunnel Mountain, about 7,000 feet above its base.\n\nThe tote-road is already cut between thirty and forty miles from the summit, and the transportation of supplies will in a short time reach the Columbia River.\n\nBusiness is quite brisk. The hotels and restaurants are doing a rushing trade.\n\nPaymaster Lukes returned from a visit to Toronto and Kansas a few weeks ago, and has already paid out about $25,000.\n\nKITCHEN ECONOMY.\n\nInteresting Tests made by the Government Chemist.\n\nBy Edward G. Lowe, the Analytical Chemist of the Department of Agriculture, some interesting experiments as to the comparative value of baking powders. The Government Chemist tested various brands they are the most economical to use, and the results are given below. The tests were directed solely to assure the consumer of the best quality.\n\nPaymaster Lukes returned from a visit to Toronto and Kansas a few weeks ago, and has already paid out about $25,000.\n\nA general report of the Company with this town a few weeks hence, and will be glad to hear from any person who may be desirous of learning more about the reliable Company.\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory.\n\nOrders, NEMITZ and MACAY STS.\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nA. T. N. Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended\nAN OLD SETTLER'S VIEW OF\n\nAs It Was and as It Is.\n\nWritten for the Times by Lawrence.\n\nOf the times that some deplore,\nAt least I liked them, my whatever,\nBefore the time that's here.\n\nOh, dear! how much we've lost!\n\nThat faith and friendship, bound in band,\nA kindly tale to all was telling,\nFrom east to west, throughout the land,\nContending reigns in every dwelling.\n\nTill then our men in cowboy days,\nWould travel to the Canadian border,\nAnd there they'd meet their mates again,\nAnd dear he said had said, on Monday.\n\nOur women, too, both wife and maid,\nWere glory treasured in a moment,\nA gladly shared around the bend,\nWas all they ever did put upon.\n\nThe case was worse, my very true,\nBut this was what we wished we wanted,\nOur artificial wants were few,\nAnd we were happy and contented.\n\nBut now, alas, the times are changed,\nAt least I think so, whatever,\nAnd faithful sentiments ranged\nAs far as they have always strayed.\n\nOur women have thrown by the shawl,\nAnd got into a rising banner,\nWith many a costly fabric\nOf ribbon, silk, and lace upon it.\n\nOur men, dear, doing otherwise,\nIn broad daylight the Churchmen Sun\nAnd thus go home to criticize,\nAnd so they're on mind on Monday.\n\nOur good old faith's supplied by doubt,\nOur freedom's still by suspicion,\nAnd sound conduct in business,\nHas been replaced by talk and fiction.\n\nOf the times that some deplore,\nAt least I liked them, my whatever,\nBefore the transfer made so sure,\nOr politics had made us clever.\n\nESTHIA FEMALE BARBERS.\n\nThe present has more fashionable and the prettiest of a barber shop.\n\"I am seriously considering the feasibility of opening a shop, apart from the fact that I am engaged to some artists exclusively.\"\n\n\"You would engage the most attractive and up-to-date.\"\n\nNaturally, I would get eight or ten of the handsomest and most charming young ladies and train them myself. The success of the shop will keep my shop rocking with patrons.\"\n\n\"But don't you apprehend that great deal of time will be consumed in fitting them to the hair, the dress, the chair and the art?\"\n\n\"I have just read all the magazines which deal with the subject and have a perfect system. Every man will experience a barber, upon entering the room, will be greeted by a host of ladies and regulations of the establishment. They must be adhered to in letter, and not in spirit. I shall have the ladies hand the reporter a card, which read as follows:\n\n\"Customers are not to rise, and it is essential to remain in position with the lady artists.\n\n\"For convenience of the day are all the necessary requisites for the best shaving, including hot towels.\n\n\"The artists will be the same as usual and dominate all young men who come to the shop. The ladies will be treated with uniform courtesy.\n\n\"Those who are not gentlemen may give themselves up to the ladies who are elected by remaining away altogether.\n\n\"Ladies are peculiarly adapted to do shaving and hair dressing more gracefully, than men. This is a natural thing, and it is for this reason that the proprietors have selected these ladies for the purpose of shaving and hair dressing. They will be the most charming and will have an atmosphere of dignity and moral elevation to the barber shop which it has never before possessed.\"\n\n\"There you have it in a nutshell.\n\nThere are plenty of women who cannot find employment, but who want to make a living. I am convinced that there exists a demand for female barber shop where these women will be successful, and I have already set forth the best plan for bringing about such a result. I am engaged to Vassar College, and she has on account of her father's business enterprises is thrown upon the world to support herself. I am getting her instructions now in the use of the razor, and know that she will develop to a real artist.\"\n\n\"How soon will you open the shop?\"\n\n\"In about three months, if everything goes well. We shall need help, and of course it will take some time to get the proper equipment together, but who can readily acquire the art.\"\n\nHow to Take Candy.\n\nThis book gives full directions for making candy, both plain and fancy candy. The recipes for making ordinary and fancy candy are given, also other kinds of candies contained in this book. It is a valuable book for city confectioners. Any one can have this book sent postpaid for $1.00.\n\nREGISTER, PUBLICATIONS, 32, 33, & 35 Osborne Block, Rochester, N.Y.\n\nOutgoing passengers having baggage, etc., between here and the river, we are without our usual connection, and therefore advise you to go out along the line to investigate.\n\nROYAL POWDER.\n\nAbsolutely Pure.\n\nThis book gives full directions for making candy, both plain and fancy candy. The recipes for making ordinary and fancy candy are given, also other kinds of candies contained in this book. It is a valuable book for city confectioners. Any one can have this book sent postpaid for $1.00.\n\nREGISTER, PUBLICATIONS, 32, 33, & 35 Osborne Block, Rochester, N.Y.\n\nTHE WEEK.\n\nA new journal for women. Published and edited by Charles H. B. Smith, Esq., Editor-in-Chief. Price 5 cents per number. The week will appear at monthly intervals and will contain news of the latest developments in the world of women's rights, as well as articles on various topics of interest to women.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, Chicago & Northwestern Railways.\n\nPassengers over the Royal Route have all the benefits of Modern Railway Travel, including the finest sleeping cars, dining cars, sleeping cars, and elegant first and second class accommodations.\n\nSleeping Cars, with no charge of Carrier or Conductor, are available for passengers traveling on the Royal Route.\n\nROYAL ROUTE.\n\nJ. W. LEONARD, Traffic Manager.\n\nCHEST WILLY & Co.\n\nDecorative Painting a Specialty.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO.\n\nEAST END.\n\nPrince Albert Bakery.\n\n2LB LOAF 12c.\n6 LOAVES 18c.\n\nCakes and Pastries always on hand and made to order.\n\nWM. R. BELL.\n\nR. B. WAY,\n\nPost Office, Prince Albert, N.Y.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884050901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 5307, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2750, 1], [2750, 10562, 2], [10562, 16471, 3], [16471, 22462, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]