[{"id": "107d082afdda76f5c01d311c83b6157d30c5f564", "text": "NOTICE.\n\nA meeting of the directors of the Lorne Agricultural Society will be held at T. O'Leary's Restaurant on Thursday, the 16th inst., at 1 p.m. Large attendance is expected.\n\nCHAS. ADAMS, Sec'y-Treas.\nPrince Albert, Dec. 9th, 1884.\n\nPUBLIC NOTICE.\n\nAll parties are hereby notified that the Union Bank of Canada has opened its offices in Prince Albert, N.W.T.\n\nNotice is hereby given that all creditors and others having claims against the estate of William Drew, deceased, are respectfully requested to present their claims to Mr. J. Leask, Real Estate Agent, Prince Albert, N.W.T.\n\nTwo gentlemen in the employ of the Canadian Pacific Railway, Messrs. Macdonald and Maclean, have been engaged by the Board of Directors to make an examination of the land and water routes between Prince Albert and Edmonton, N.W.T.\n\nStrayed.\n\nStayed up, my pet parakeets, at the Ridge following the following hours:\n\nTwo Grey, 10 White, Blue, Black, and Green, 2 Spring Cote, 1 Blue and White. All strangers.\n\nIf found, please return them by paying property and paying expenses. If not claimed within one month, we shall be obliged to destroy them.\n\nDANIEL CAMERON,\nNov. 25th, 1884.\n\nA.W. MARKLEY,\nGeneral Agent and Auctioneer.\n\nPRINCE ALBERT, SASK.\n\nTHOS. POWERS,\n\nCONTRACTS FOR\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nBrick and Lime always on hand.\n\nNew Street.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter.\n\nDecorative Painting a Specialty.\n\nKNOX AND BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nSHANNON AND McLEOD,\n\nJUST ARRIVED\n\nBy latest cars from Troy, a complete assortment of\n\nDry-Goods, Groceries, Gents' and Ladies Furnishings, Moccasins, Overshoes, Gloves, Mitts, Fur Caps, and Fur Coats.\n\n7 weeks for Timber Limits in the North West Territories.\n\nO. E. HUGHES & CO.\n\nPOLICE NEWS.\n\nGeorge Harvey, who arrived with police officers to go back to his home town, was arrested by Sergeant Brown near the railway station. He was taken to the police station where he was booked for vagrancy.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETTY\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n11 a.m. - Holy Communion, followed by Sermon\n1 p.m. - The Rev. Principal Pastor\n\nThe Mission Chapel\n11 a.m. - Holy Communion\n7 p.m. - Service, followed by Sermon\n\nSt. Peter's Church\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nSt. Paul's Church\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nSt. Andrew's Church\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nSt. James' Church\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nGoschen Church\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nC.M. Church, Red Deer Hill\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nC.M. Methodist Church, Goschen\n11 a.m. - Holy Communion\n12 noon - Sermon\n\nFRIDAY, DECEMBER 12, 1884.\n\nTO THE PUBLIC.\n\nWe have to announce that Mr. T. A. Spink has withdrawn from his connection with this paper as a partner. Mr. Spink for many reasons regrets having to leave this enter-\nprise which he has been connected with for many years, and which has been so closely connected with him ever since its inception, as well as the interruption of the many friendships he has formed among the people here, and whose welfare and prosperity will always be a matter of great interest to him wherever he may be. His taking the present step is entirely due to the fact of his conviction—more accurately arrived at—that there can not be found in any manner or form, the best combination of the business of various kinds upon which the permanency of success of a journal depends to justify the presence of two partners in the enterprise. Under these circumstances he goes away without leaving in the field affording a more likely prospect, and this paper henceforth will be conducted by himself, while regretting his departure, God speed, which we know will be forthcoming. We trust that he will hope that even with the disadvantage of the loss of his services, the paper will be conducted in such a way as still to merit the patronage which considering the size of the place, and its importance, the paper has been sufficiently liberal. At any rate should it in any way suffer, it will not be from the want of all possible exertion on our part to prevent such being the case.\n\nLIBEL SUITS.\n\nWe observe that three suits are being brought against the publishers and proprietors of the Maclean's Magazine, for libel and slander, and that one of them is now out of an affair known as the \"Bash\" case, and is also doing good work in the cause of the press. We sympathise with our fellow journalists, and sincerely hope that they will turn their eyes once more toward the cause of the press, and prove that they are willing to do everything possible for the interests of the public. While we are fully satisfied that they are strongly opposed as possible to any name of the greatest, we are not anxious of those who pretend to imagine them so lost to self respect as to do so near or before the middle of June.\n\nTWO SPRING CALVES,\nRed, tan, black and roan, full. One of each color, pure, young, healthy, and vigorous.\n\nWILLIAM HODGSON,\nWheat Hill Mill.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\nNEW STUDIO\nEAST END.\nPETER SMITH,\nBaker and Confectioner.\n\nAll kinds of Iced Cakes Made to Order.\n\nTERMS STRICTLY CASH.\n\nOUR FAMILY KNITTING MACHINES.\n\nRecognized as the only machines that will knit rigid and plain work perfectly.\n\nA new knitting machine that will knit any pattern, and make any kind of work, and is made to order.\n\nOur machines make the only perfect samples.\n\nHOUSERY IN THE WORLD.\n\nCreelman Bros., Georgetown, Ont.\n\nThe Dominion Organ and Piano Co.\n\nHORSE SHOE STORE.\n\nStrayed.\n\nStepped out of my premises about the middle of June.\n\nTwo Spring Calves, Red, tan, black and roan, full. One of each color, pure, young, healthy, and vigorous.\n\nWilliam Hodgson, Wheat Hill Mill.\n\nPhotographs!\n\nChas. E. Page.\nNew Studio\nEast End.\nPeter Smith,\nBaker and Confectioner.\n\nAll kinds of Iced Cakes Made to Order.\n\nTerms Strictly Cash.\n\nOur Family Knitting Machines.\n\nRecognized as the only machines that will knit rigid and plain work perfectly.\n\nA new knitting machine that will knit any pattern, and make any kind of work, and is made to order.\n\nOur machines make the only perfect samples.\n\nHosiery in the World.\n\nCreelman Bros., Georgetown, Ont.\n\nThe Dominion Organ and Piano Co.\n\nHorse Shoe Store.\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the views or opinions expressed in these columns.\n\nINCORPORATION.\n\nTo the Editor of The Times,\n\nSir—As a meeting held at the Main Street School House last Monday was convened for the purpose of discussing incorporation, Mr. James Macauley assumed the chair, and took up such matters as he thought proper to discuss from his own views, however, I am sure there are a majority of the inhabitants who are interested in our town being incorporated. Mr. Macauley is very much interested in politics; but in his capacity as a merchant, I feel compelled to say that we should be more interested in the welfare of our town, and that the best way to promote its prosperity would be by means of improvements which would add to our trade and commerce. Mr. Macauley has been a merchant for many years, and is well known throughout the county for his integrity and honesty. We must hope that he will continue to be so when he takes up the position of aldermanic candidate. We are confident that his experience and practical knowledge will contribute greatly to the welfare of our town, and that his efforts will be directed towards the improvement of our town.\n\nPUBLIC NOTICE.\n\nAll parties are hereby notified that the undersigned committee have sanctioned the following resolutions:\n\nA. In favor of St. Ambrose Catholic Public School.\n\nB. To be known by the name of St. Joseph’s public school.\n\nC. To be erected within the following limits, that is to say:\n\nPart of the town limits, part of the new town limits, and the land between the limits and the premises now occupied by Mr. Smith, the owner thereof.\n\nD. To be erected upon the premises herein mentioned, and that it be completed according to the following plan:\n\n1. The building shall be constructed of brick, two stories high.\n2. The building shall be situated near the main street, facing the same.\n3. The building shall be equipped with all necessary fixtures, including a heating system.\n4. The building shall be completed within six months from the date of the resolution.\n\nE. To be kept open and maintained at all times for the use of the public.\n\nF. To be managed by a committee of five members, appointed by the trustees.\n\nG. To be opened for enrollment on January first, next.\n\nJ. L. JOHNSON & CO.,\n\nBuffalo Hall!\n\nCOAL OIL.\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. JOHNSON & Co.\n\n1879.\n\nForeconomy and Light.\n\nBuy American Coal Oil.\n\nBest American Head Light Oil for $1 per Imperial Gallon.\n\nAT BUFFALO HALL.\n\nThe amount of Hair Oils, Perfume, and Toilet Soaps sold at Buffalo Hall show where these goods can be bought at close prices.\n\nWe buy in large quantities. We buy only the best American Brands after they have passed a Government Inspection. We buy for Cash, save Discounts, and are pleased with a moderate profit.\n\nWarranted the Best in the Market.\n\nBETTS & GWINNE.\n\nT. N. CAMBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Canada, United States promptly attended to.\n\nPrince Albert — N.W.T.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE\n\nVictor Well Boring & Rock Drilling Machinery,\n\nIf one can make $100 in a week, then others can make several hundred. The Victor Well Boring & Rock Drilling Machinery is perfectly simple in construction, easy operated, durable and acknowledged by experts as the best on the market.\n\nThey range in size from 3 inches to 3 feet in diameter.\n\nThey are available for sale at a reasonable price to those who are interested.\n\nProspecting for Gold, Silver, Coal Oil and all kinds of Minerals.\n\nFor more information contact VICTOR WELL AUGER & MACHINE CO.,\n\nST. LOUIS, MISSOURI, U.S.A.\nINCORPORATION.\n\nA meeting was called on Friday evening; last week, for the purpose of taking the necessary steps to incorporate in a legally proposed part of this settlement in the town.\n\nMr. Stewart, J. F. Harte, Mr. Macartur, A. Clarke, P. Atkinson, and J. Macdonald having successively been called upon to take the chair, the position was occupied by Mr. Gunn, and Mr. Mr. Macartur was unanimously elected as secretary for the occasion.\n\nMr. Gunn briefly opened proceedings by saying that he had no further knowledge of the subject or interest in the meeting than what he gathered from the notices which called it—there was an understanding among those present that their attention to town incorporation or further discuss the more extended municipal question. He then called upon Mr. Macartur who moved the motion on behalf of the committee to adjourn the meeting.\n\nMr. Macartur thought the committee's work had ended with the accomplishment of the work entrusted to them—viz., the petition to the Honorable Governor, whom on a visit here during the summer, and learning from him the petition sent in—and the way to get the desired object attained—that all that now remained was to see whether everything was being done in accordance with the original intention of the former petition—i.e., that a town should be proceeded with.\n\nMr. Bettis expressed his opinion that Mr. Macartur had put the petition away, saying that there was nothing remaining about proceeding should be taken. A gentleman present invited Mr. Bettis to give his reasons why he thought it desirable to proceed. Mr. Bettis said a town, like a family, required a head to act for it and guide it—that the government of the town should be placed under the hands of leaders of great moral worth, land owners, and government officials.\n\nMr. Gunn finding no one inclined to turn the floor, called upon Mr. Macartur, Mr. Macartur rose to make a motion.\n\nThat gentleman felt surprised at being expected to express any views at that stage of the proceedings, but would take pleasure in a motion called by any member of the committee, fully expecting that common sense have prevailed, and that the day before the meeting, he might have believed in the benefits of incorporation at the proper time, and real question was raised as to what course of action had arisen or not, and hoped to hear something from those who shortly after the writing of the petition, were most in the case—which would enable those in doubt as to what may be anticipated for the future for the town, and what expenditure could be reasonably anticipated to form an opinion. What he had wished was a statement of opinions on what might be stated pro and con.\n\nMr. Macartur said there was no use in going over the old ground, that the subject had been exhausted and the result of opinions by the sending of the petition, that he had no objection and he blamed our manner as much as anyone for the stopping, the matter should have been discussed in a logical fact instead of still in question. In his opinion the benefits of incorporation at the proper time, and real question was raised as to what course of action the people should not be expected by residence on and improvement of town property, and the prosperity of the community, or speculative holding on late while the latter paid no taxes. He commented that if we had responsible government, it would be easy to send a man from Ontario to step in and say that if the people would not oppose the location of the town, they would be entitled to a certain spot, as a reward for their forbearance, he would see his own responsibilities, and the question was where the poor wanted to have it—which he said had been discussed and the question was now before the public. He then returned some of the benefits such as taking advantage of the market, the advantages of the town, threatened epidemics—the utility of machines for weighing loads of hay, etc., the reduction of insurance rates by providing against accidents from fire, etc.\n\nMr. Bettis then moved that a committee of five be appointed to take immediate steps to circulate a petition in favor of\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAt T. N. Campbell's New Store\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\n\nKEEP CONSTANTLY ON HAND\nRepairing Promptly Attended to\nCHESTER THOMPSON,\nGeneral Blacksmith.\n\nNEW MILLINERY:\nFANCY GOODS,\nWOOL GOODS,\nLADIES' CLOAKS,\nFURMUFFS\n\nC.A.S.P.S.\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nCONSUMPTION\nPositively Cured.\n\nASH & ROBBINS,\n261 Fulton St., Brooklyn, N.Y.\n\nThe Times is the best medium in the Territory to advertise your business in.\nAdvertise in The Times and you are certain to succeed in your business.\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nof all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, - PROPS,\nRIVER ST., PRINCE ALBERT, SASK.\n\nFRIDAY, DECEMBER 12, 1884.\n\nGREAT REDUCTION IN Boots & Shoes!\nNow is the Time to Secure Bargains!\n\nAs I need money I have determined to reduce the prices of the balance of my stock 25 PER CENT FOR CASH.\n\nI have a splendid sample in Gentlemen's Fine Kid Shoes and Skating Boots. Also Ladies' Skating and Kid Boots and Slippers.\n\nCall and see for yourself and get the best bargains ever offered in Prince Albert.\n\nJ. C. Mackenzie.\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDresseed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 75 feet extra.\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\nAdvertise in The Times and you are certain to succeed in your business.\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nof all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, - PROPS,\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884121201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4078, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2065, 1], [2065, 6413, 2], [6413, 10185, 3], [10185, 16533, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]