[{"id": "687692f21e4455837bd42309f67e21e4069c093e", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVETTY\nPRINCE ALBERT N.W.T.\nFRIDAY, AUGUST 3, 1888.\n\nSUNDAY CHURCH SERVICES\n\nSt. Albert's Church—Sunday, 12 o'clock.\nSt. Matthew's Church—Sunday, 10 o'clock.\nSt. John's Church—Sunday, 11 o'clock.\nSt. Paul's—3 p.m.—Rev. Canon Flett.\nSt. Peter's—3 p.m.—Rev. Dr. McRea.\nSt. Mark's—3 p.m.—Rev. T. J. Taylor.\nSt. Luke's—3 p.m.—Rev. Mr. Wright.\nSt. Andrew's—3 p.m.—Rev. Mr. Wright.\nMethodist Church—Red Door Hill and Island—Sunday, 10 o'clock.\nSt. Paul's—3 p.m.—Rev. Mr. Macdonald.\nThursday evening at 7:30, Mass and Rosary.\nSt. Peter's—3 p.m.—Rev. Mr. Wright.\nSt. Mark's—3 p.m.—Rev. Mr. Wright.\nSt. Luke's—3 p.m.—Rev. Mr. Wright.\nSt. Andrew's—3 p.m.—Rev. Mr. Wright.\n\nThis paper may be had at the office of HOWELL & Co., Newspapers Advertising Agency, 115 Fifth Avenue, New York.\n\nFRIDAY, AUG. 3, 1888.\n\nLEGISLATIVE ASSEMBLY.\n\nHis Honor the Lieut.-Governor will we presume at an early date, or as soon as possible after the election, be called together, select members who are to constitute his Advisory Board. This Board will be composed of four of the elected members of the Legislature, and are to advise His Excellency in matters relating to the financial affairs of the Territories, and will meet from time to time at the call of the Lieutenant-Governor. The constitution does not provide the method of selecting the members of this Board. But as there are four to be selected, I presume it was the intention to have a representative taken from each of the four districts of East and West Assiniboina, Alberta and Saskatchewan. It is but fair that each should be represented, and we will urge strongly the rights of this District to representation. The next question, then, will be which of Saskatchewan's five members to appoint? The position will be a very responsible one, and none but the best men should be called to sit at that Board. The man who represents this District on it should be one who will serve the best interests of the District, not favor one portion of it more than another, and who will be able to uphold the interests of Saskatchewan so that we will have a fair share of whatever money is to be spent. While we know that all the members from this District are good men, yet there are some who bring to their experience, training in business and their knowledge of financial matters better qualified than others. Mr. Christie has always been a good claim to be considered, and so has Mr. Mitchell of Batacho; they are both men of integrity and ability and are well qualified in other respects. But we think that Mr. Betts has a stronger claim to consideration than either of the others, not perhaps in point of ability, but for other reasons, and one is that he represents the foremost constituency in the District. Mr. Betts has every qualification necessary, and has also held positions of public trust himself, and acquitted himself well. We may refer to this matter again, and in the meantime we urge Mr. Betts' appointment as a member of the Advisory Board.\n\nRAILROAD MATTERS.\n\nAlthough work has not yet been commenced on the Regina and Long Lake Railroad, it must not be taken for granted that nothing will be done for it. We are able to see that preparations are being made as expeditiously as possible, and that everything may be in readiness at any date for prosecuting the work of construction. The only difficulty in the way (except Mr. Pugley's) is the refusal to sell the Regina and Long Lake charter to the C. P. R., or rather fixing a price of between the two companies. At present it is rumored that Mr. Van Horne, the Manager of the C. P. R., is visiting Saskatchewan, and such an effort should be made to induce him to come on to Prince Albert. We have no doubt that if the General Manager saw our settlements and magnificent crops and herds of cattle it would hasten the building of the railway.\n\nOur respected townsmen Capt. Moore, who has been absent nearly three years in Ireland, will arrive in Prince Albert in a few days. We do not know whether he comes to reside permanently or not, but sin- cerely trust that if this intention be so, that his name will ever more highly and universally esteemed by anyone than is Capt. Moore by the people of this district, and no single individual has done more than some talk of giving him a fitting reception of a public nature on his arrival, but whether or not that is done, we are sure that he will receive a cordial welcome from all.\n\nEVERY NIGHT I SCRATCHED\n\nUntil the skin was raw. Body covered with scabs like spots of matter. Curled by Cuticular Remedies.\n\nI am obliged to tell you of the marvellous change your CUTICULAR REMEDIES per- formed upon me. I have been suffering from a complaint which I noticed some red pimples coming out all over my body, and which increased in full some time later, when it began to look as though I had the itch. I used them with itch, I would scratch every part of my body, and the complaint seemed to be getting worse. Meanwhile, were scratching others in the country, but without aid. After using your remedies, I have been cured of this complaint. I have been told about your CUTICULAR REMEDIES, and purchased them at once. They have been most immediate remedy. I began to notice improvement immediately, and the complaint disappeared. I have never had any complaint since, except the complaint on my hands and feet. I can now use my hands and feet without fear of irritation. The CUTICULAR REMEDIES have been a great blessing to me. I would say that they are a wonderful spectacle to behold. Now I am able to use my hands and feet without fear of irritation.\n\nGEO. GORDON.\nSept. 21, 1888.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nImported Tweed Suitings, Trowsering and Overcoating Worsted, in English and American Lines, Canadian Tweeds in all grades. Satisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black Ink, ALL SIZES—WRITING AND COPYING Office Stationery, etc., etc.,\nFALL SHOW\nof the Carrot River Agricultural Society\nTo be Held September 25th—Price List, Etc.\n\nSTANZA\n\nClass I.—Sec. 1, best stallion 3 years old or over, $5. Sec. 2, entire colt 2 years old, $5. Sec. 3, entire colt 1 year old, $5.\n\nClass II.—Horses for agricultural and general purposes. Sec. 1, best breed mare and foal, $1. Sec. 2, best filly or gelding, 2 years old, $1. Sec. 3, best mule or pony, 3 years old, $1. Sec. 4, best horse in harness, $1.\n\nClass III.—Heavy draught. Section 1, best breed mare and foal, $1. Sec. 2, best filly or gelding in harness, $1; special by Mr. C.S. Lovric.\n\nClass IV.—Native horses. Sec. 1, best breed mare and foal, $1. Sec. 2, best team in harness, $1.\n\nClass V.—Sec. 1, best single driver, $1. Sec. 2, best mule, $1.\n\nClass VI.—Draft horses with certified pedigrees, O.H. Smith, Sec. 1, best bull, 3 years old or over, $2. Sec. 2, best bull, 2 years old, $1. Sec. 3, best bull, 1 year old, $1. Sec. 4, best heifer, 3 years old or over, $1. Sec. 5, best heifer, 2 years old or over, $1. Sec. 6, best heifer, 1 year old or under, $1.\n\nClass VII.—Grade. Sec. 1, best bull, 3 years old or over, $2. Sec. 2, best bull, 2 years old, $1. Sec. 3, best bull, 1 year old, $1. Sec. 4, best heifer, 3 years old or over, $1. Sec. 5, best heifer, 2 years old or over, $1. Sec. 6, best heifer, 1 year old or under, $1.\n\nClass VIII.—Sec. 1, best work of young cows, $1. Sec. 2, best cow over 6 months, $1. Sec. 3, best cow under 6 months, $1.\n\nClass IX.—Sec. 1, best bull, any age, $1. Sec. 2, best heifer, females to be composed of two years old or over, $1. Sec. 3, best heifer, one year old, $1.\n\nClass X.—Sec. 1, best pair of sheep, $1. Sec. 2, best ram, $1. Sec. 3, best ewe, $1.\n\nClass XI.—Sec. 1, best pair of swine, $1. Sec. 2, best sow, $1. Sec. 3, best boar, $1.\n\nClass XII.—Sec. 1, best pair of turkeys, $1. Sec. 2, best turkey, $1.\n\nClass XIII.—Sec. 1, bushel of best wheat, $1. Sec. 2, bushel of best oats, $1. Sec. 3, bushel of best barley, $1. Sec. 4, bushel of best rye, $1.\n\nClass XIV.—Sec. 1, bushel of best corn, $1. Sec. 2, best turnips, $1. Sec. 3, best carrots, $1.\n\nClass XV.—Best collection of garden vegetables, $1; Sec. 2; $2.\n\nClass XVI.—Sec. 1, butter in rolls, $1. Sec. 2, butter in sticks, $1. Sec. 3, cheese, $1. Sec. 4, cheese, $1.\n\nClass XVII.—Sec. 1, best pair of hens, $1. Sec. 2, best hen, $1. Sec. 3, best cockerel, $1.\n\nClass XVIII.—Sec. 1, best pair of ducks, $1. Sec. 2, best drake, $1. Sec. 3, best hen, $1.\n\nClass XIX.—Sec. 1, best pair of geese, $1. Sec. 2, best goose, $1.\n\nClass XX.—Sec. 1, best pair of rabbits, $1. Sec. 2, best rabbit, $1.\n\nRULES AND REGULATIONS.\n\n1. Entries may be made at any time before the day of exhibition by applying to the secretary at the Post Office, Kinley. Entrance fee $1 to all non-members of the Society.\n\n2. No entries other than live stock, must be delivered to them not later than 11 o'clock a.m.\n\n3. Live stock must be on the ground between 12 and 1 o'clock p.m.\n\n4. No exhibitor shall be removed from the grounds until after 4 o'clock p.m.\n\n5. No exhibitor or other coverings containing them will be admitted with manure or straw on them.\n\n6. Live stock must be the bona fide property of the exhibitor.\n\n7. No animal over 1600 pounds will be allowed to enter in the Agricultural and General Purpose class.\n\n8. The age of any animal shall be reckoned as the first day of January in the year of its birth.\n\n9. Brood mares must be exhibited with foal at foot.\n\n10. Cows 3 years old and over must be exhibited with calf at foot.\n\n11. Ewes 2 years old and over must have raised this season, except fat ewes.\n\n12. Sheep, goats, and all agriculture and horticultural exhibits must be the property of the exhibitors and exhibited in the Saskatchewan District during 1888.\n\n13. Domestic manufacturers and ladies who desire to exhibit the workmanship of the exhibitors manufactured in the Saskatchewan District.\n\n14. In the absence of competition in any class, any entry which is exhibited be of an inferior quality, the judges are instructed to award only such prizes as they may consider the exhibition deserving of, to whom they award their attention as to whether they will award any prize. The directors may award extra prizes to exhibits specially recommended by the judges.\n\n15. No person will be allowed to interfere with the judges while they are discharging their duties.\n\n16. Decisions of the judges to be final in all cases.\n\n17. Any infringement of the rules may be punished by withholding prize money.\n\nThe secretary will be on the grounds at 8 o'clock on the morning of the exhibition and will see that any mistakes that may occur until 11 clock, when the books will be closed.\n\nTHE NAGHTI INDIANS.\n\nTo the Editor of The Times.\n\nSir,—You will, undoubtedly, have received from other quarters, an account of the recent visit made by the Indians of Sandy Lake and Snake Plain a short time ago; the contest being between the Indians belonging to the above named places. It was thought at first sight to see so many well dressed Indians to gather together enjoying themselves, that we thought it would have been quite an innocent amusement. The result was quite the opposite, and facts to go by, that they were there to meet for such purposes. The evil I have reference to is betting. Both men and women boys and girls being in a wicked way. I heard that one man staked his iron bound coat on a horse, and lost it. I presume it was a prize won by a local man, overreaching or \"lanced\" property. Others staked the clothes they had on their backs, etc., etc. Now when we consider that these Indians have to support a large family, it does seem to me right that the Indians squander what private property they possess in such a way, leaving the fully dependent upon others for their daily bread unless they were given to understand, by those who convene the meeting, that betting will not be allowed.\n\nYours, etc.,\nONE WHO WAS PRESENT.\n\nThe present year is the tercentenary of the discovery of the paper in England. The pioneer paper maker, however, died at Dartford, in Kent, in 1558.\n\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT NEW SPRING GOODS Far surpassing any previous seasons, both for richness design and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ.M. CAMPBELL.\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP.G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nPRESENTATION AND ADDRESS.\n\nThe officers and other employes of the Saskatchewan Hudson's Bay Company's District, assembled at the residence of their chief, the Hon. L. Clarke, on the 26th of June last, the anniversary of his birthday, and presented him with the following address and a magnificent ogeeve. We also give the worthy chief the following approving reply:\n\nL. CLARKE, Esq., Chief Factor, Hudson's Bay Co., Prince Albert, Sask.\n\nDANISH.—We the officers, clerks and servants of the Hudson's Bay Company serving under you in Saskatchewan District, assembled on your birthday to tender our honest congratulations and hope you may enjoy many more. During the time we have served under your charge, we have been, as a rule, a happy number, and others a few years, we have all received at your hands many acts of considerate and generous kindness.\n\nWe now desire that you accept this accompanying ogeeve as an evidence of our regard and esteem.\n\nTrusting that you will long speed in your present most position and wishing yourself and Mrs. Clarke and family every prosperity.\n\nWe are, dear Sir,\n\nYours faithfully,\n\nJ. McAuley, J.C.T., Geo. S. Davison, J.C.T., Wm. McKay, J.C.T., Philip Turner, J.C.T., John B. Stewart, John E. Stewart, Fran. DuBois, George McKay, J.B. Parker, Ed. Hart, Albert G. Smith, A.A. Smith, Robert M. Parker, Pauline Parker, R. McIain, John Turner, D.L. Shannon, J.R. Mark, Peter Love, Henry Bear, Robert Ed. Gordon, A.M., Mr. McLachlan, Ed. De Freyne.\n\nADDRESS.\n\nTo the Officers and Servants of Hudson's Bay Company serving in Saskatchewan District.\n\nGENTLEMEN.—I take this opportunity to thank you for your congratulations on my fifty sixth birthday. The expression you have used in your address towards me, and the kind wishes you have extended towards each other during the coming season of work, is one that we shall ever remember. I am sure that the company is the highest compensation you could possibly pay me.\n\nThe splendid and valuable present accompanying your address, as an evidence of your regard and esteem, is in our eyes the best possible tribute to your fidelity. The ogeeve shall be hung in an honoured place in my family, and will be a memorial of the good feeling existing between myself, brother officers, clerks and servants.\n\nWith the greatest thanks of myself, Mrs. Clark and family,\n\nI am, dear friends,\n\nYours very faithfully,\n\nL. CLARKE.\n\nPRIZE OFFERED OF TORNADOES.\n\nThe American Meteorological Journal, desiring to direct the attention of its readers to tornadoes, in hopes that valuable records may be obtained, offers the following prizes:\n\nFor the best original essay on tornados, $50 will be given.\n\nFor the second best $30.\n\nAnd among those worthy of special mention, $50 will be divided.\n\nThe Essay must be either of the style Professor Harrington, Astronomical Observer, Ann Arbor, Mich., or A. Lawrence Rotch, Rine Hall Meteorological Observator, Princeton, N.J., U.S.A., before the first day of July, 1888. They must be signed by a nom de plume, and be dated. The essays must be written with the same nom de plume, and enclosing the real name and address of the author. The independent and capable judges will be invited to award the prizes; and the papers receiving them will be the property of the Journal offering the prize. A description of writing tornadoes can be obtained by application to Professor Harrington.\n\nThe Police turned out in force on Sunday morning last, for church parade, some of whom proceeded to the homes and others to the Presbyterian Church. The men presented a very fine appearance in their dress uniforms, and the young people from Trinity Bible school all end admirers of their very efficient officer, Mr. Perry. We must congratulate the parishioners for the splendid and neat, although appearance of the command.\n\nTHE H. B. RAILWAY.\n\nThe following which we clip from the Oct. 20th issue of the paper, will be of great interest to the citizens of our town and farmers throughout the district:\n\n\"Mesier, Onderdonk, Kirkgowd and other gentlemen interested in the proposed railway through the Hudson's Bay Railway, had a formal interview with the Government on Monday last. The result of the interview was that the executive was unable to go into the question at length. Another meeting, however, will be held shortly, when progress with the matter will probably be made. What the syndicate wants is a firm offer from the Government, and that when satisfactory financial arrangements have been made for the construction and equipment of the line and the facilities for the operation thereof, the desire of the legislature expressed in the Act of Nov. 1st, 1879, passed last session, shall be carried into effect.\"\n\nBy this act the Government agrees, on certain conditions, to guarantee the cost of the railway, and operate it for a period of twenty-five years. If the syndicate receives an assurance from the Government that the latter will stand behind the act, they are prepared to meet its stipulations, financially and otherwise; but they are not willing to receive any proposal that would fail to give them a reasonable return. A favorable answer has been given by the Government. At present the outlook is hopeful. Mr. Onderdonk says that the act will be carried into effect, and that the $5,600 per mile guarantee for an additional ten miles of the line from the mouth of the Assiniboine river will be given by the Government, and the company does not fear from the terms of the negotiations.\"\n\nUNEXPECTED MERIT.\n\nThe great success of the Royal Baking Powder is due to the extreme care exercised by the company in making it entirely pure, uniform in quality and of the highest preserving power. All the ingredients are selected with care and obtained by a twenty years' practical experience are contributed toward this end, so that the product is prepared to be dispensed with a perfect accuracy, precision and exactness. Every article used is absolutely pure. A minute analysis is made to test the strength of each ingredient, so that its exact value and effect in the mixture and its extinguishing qualities is definitely known. Nothing is trusted to chance, and no person is employed in the preparation except those who are skilled manufacturers of the powder, who is not an expert in his particular branch of the business. The Royal Baking Powder is of the highest degree of excellence, always pure, wholesome and nutritious. Every box is stamped like the others, and is guaranteed to produce the same and the highest degree of perfection and economy at any time.\n\nThe American Chemists after having examined all the principal brands of the market, in their reports stated that the Royal Baking Powder stood head of the list for strength, purity and wholesomeness, and thousands of tests have been made which further demonstrated the fact that its qualities were, in every respect, unrivalled.\n\nSILK RIBBONS.\n\nThose of our lady readers who would like to have a cheap and nice package of extra fine, assorted Ribbons (by half), will find them in the large assortment of fashionable shades, adapted for Roman strings, Neckwear, Scarfs, Trimming for hats, etc., can get astonishing big bargains, by writing to the wholesale Ribbon Manufacturing Co., by mail, giving their address. We give below a special offer, this house will give double the amount of any other firm in the country. P.O. address of ten newly married ladies when ordering and mention the name of this paper. Satisfaction is guaranteed, or money returned. Address, Locust Street, Jersey City, N.J.\n\nWALL PAPER AND BORDERS!\n\nA Large Stock at CANN'S BOOK STORE.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York. Send for Rates for Large Newspapers.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThe Royal Baking Powder is a guaranteed pure, wholesome and nutritious article, and is recommended by the leading chemists of the world in connection with the multitude of recipes for cakes, puddings, pies, etc., which are given by the company. It is made by the Royal Baking Powder Co., No. 10 Wall Street, New York.\n\nC. O. NORTHCRAVES,\n\nWatchmaker and Jeweller,\n\nAt T.J. Campbell's New Star\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling\n\nAMBER-Hop-ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRON'S WALL PAPER\n\nAND\n\nBORDERS!\n\nA Large Stock at CANN'S BOOK STORE.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York. Send for Rates for Large Newspapers.\n\nNEW GOODS NOW OPEN.\n\nBuffalo Hall!\n\nLadies' Jerseys and Jackets, Corsets, Bustles, Hosiery and Gloves, and a Full Line of GENERAL DRY GOODS.\n\nMen's and Boys' Hats!\n\nIn Felt and Straw. A Full Line of Men's and Boys' Clothing & Mens' Furnishings\n\nGROCERIES,\n\nAll New and Fresh in both Staple and Fancy Goods.\n\nBETTS & Gwynne\n\nR. C. W. & CO.\n\nA Large Assortment of Summer Dress Goods,\n\nThe Latest Shades of Muslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies\n\nHATS, CAPS AND STRAWS\n\nThese Goods will be sold at bottom prices, Inspection invited.\n\nR. C. Wigmore & Co.\n\nFOR THE BEST ASSORTED STOCK OF CONFECTIONERY\n\nGO TO\n\nH. McDougall's BAKERY.\n\nCENTRAL STORE.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall\n\nGO TO\n\nAgnew's\n\nFOR MACHINE OILS,\n\nSCYTHES AND SNAITHS\n\nHAY FORKS,\n\nWINDOW SASH,\n\nPANEL DOORS.\n\nDonaldson & Pembroke.\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888080301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 5829, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6212, 2], [6212, 12889, 3], [12889, 22570, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]