[{"id": "c04539db0b7c4bd5615348e090546e4e7cdbabea", "text": "PRINCE ALBERT TIMES\n\nSPINK & MAVETTY\n\nPRINCE ALBERT, N.W.T.\n\nTERMS—85¢ per month in advance, eight copies per year.\n\nIn no case will copy be inserted in the paper, Bradmash's Acts, etc., line.\n\nAll letters to be addressed to the Proprietor.\n\nNORTH WEST MATTERS\n\nThe agitation in regard to the North West grievances still continues, and the Farmers' Union and the Manitoba Rights' League have amalgamated, which is a move in the right direction. Union should be strengthened by reason why the movement should be confined solely to the farmers' grievances; while there are many others which affect the general settler as well. Meetings should be held in every section of the province and branch unions formed. This is right and there is no doubt that this combined action will have its effect upon the Dominion Government. We have repeatedly urged in these columns upon the settlers and settlers generally the importance of holding meetings in the outlying districts to discuss their wants and grievances and appoint delegates to attend conventions to be called in Prince Albert, where the whole question could be thoroughly discussed and a delegate or delegates appointed to proceed to Ottawa during the present session of the Dominion Parliament, to present the Federal Cabinet, and the members of both Houses, the necessity for some legislation being passed to relieve our people from the burdens of the disabilities they have so long labored under. We are pleased to learn that the suggestions we have been acting upon, and that the first of a series of meetings was held at the Hotel Albert, Co-op. Branch, last Thursday, at 6 p.m., and we understand that our member to the North West Territorial Assembly, Mr. Macdonald, was present, but we have not yet been favored with a report of the meeting of which he was the presiding officer.\n\nWe understand that the meeting will be held shortly in different districts in the District, and delegates appointed to attend a convention to be held here. One of the things sought for is to obtain from the Government the right for old settlers who have taken up lands previous to 1879 to purchase them at the then Government price. It is understood that the same privilege should be extended to those who have purchased from them. This is but fair and right and we have no doubt that if properly represented to the Government they will be able to secure the same. However, this is only one of many important matters which require remedying and which should be thoroughly discussed at the convention. There is no doubt that important legislation will be submitted to the Dominion Parliament during the present session affecting the North West, and that great changes are contemplated in the coming year or two.\n\nAmongst other things it is said that three new provinces are to be erected, Assiniboia, Alberta and Saskatchewan.\n\nWe copy from the Winnipeg weekly Sun of the 16th some remarks on this subject:\n\nAfter long agitation the time appears to have arrived when the Dominion government will concede to this Province the right of having a representative in the Federal Cabinet. Although every citizen of the Province felt the necessity of such representation, the question as to who would be the most fitting man for the position has been very much agitated. The claims of Hon. Mr. Royal have been strongly urged by many, but the majority seem to prevail with the conviction that he would make an excellent man and that his appointment would be most satisfactory. Who would be the next?\n\nA great many felt that Mr. Norquay would be the best to fill the position, as he is conversant with the affairs of the country. But the difficulty of carrying on the present Local Government, which has been undergoing considerable changes, together with the fact that Mr. Norquay has not presented himself, and it was felt that his appearance would be most desirable. The question of all political questions has been discussed and rehashed, and the point has been made that the members of the Government are not to be trusted, and without great trepidation, at the conclusion of running the risk and taking the responsibility, Mr. Norquay has been chosen. Although no official promise has been secured from Ottawa that Mr. Norquay will be sent, judging from the pulse of the Dominion Government, which has been undergoing considerable changes, and the fact that the members of the Local Government express the opinion that little difficulty will be experienced in placing Mr. Norquay in the Colonial Office, and with some other provincial business to transact, Mr. Norquay leaves for Ottawa.\n\nWhat portfolio will he get?\n\nThis question will naturally be asked, some suggested that he should be appointed to the Colonial Office, but his reputation, but the prosperity of our territory is from the conviction that he should not be satisfied with anything less than the Colonial Office. Mr. Norquay is now in a position new held by Hon. Mr. Macpherson.\n\nHas the job got a seat?\n\nUndoubtedly dissipation will break his solicitude in this. It is understood that the intention of the Dominion Government this session, is create, by Act of Parliament, three new provinces—North West Territory, besides Manitoba, viz., Alberta, Assiniboia and Saskatchewan. These prospective provinces have already been created territorial districts by the Government, and the question is whether the intention is to apply Hon. Mr. Royal, Lieutenant-Governor of the Province of Alberta, Mr. Macdonald, now Lieutenant-Governor of Assiniboia, to take the position. No name has been spoken of in connection with the Provincial Government. It is understood that Mr. Royal has expressed himself as unfavorable to his appointment as he is anxious to remain in his present position, and the second place is almost certain that Capt. Scott, M.P., will be appointed on early date. With two seats vacant here the sequel is easily guessed. Mr. Norquay will be the next choice, and the question settled. This matter will undoubtedly not be made until the close of the session.\n\nImportant amendments in the Dominion Lands Act are likely to be introduced, and changed in our judicial system. In view of the importance of these questions, and the great interest which is, in the North West, we urge our settlers to vote, and thus add to the force for people to send a delegate or delegates to Ottawa to look after their interests during this session of Parliament.\n\nThe question of sending them would be a topic of considerable importance which would result from such a mission. If no other good should be attained by the urging upon the Department the speedy issue of our patents (so long and vexatious) bonds, delays would be saved, and worth the cost. Everybody knows even in his own business the advantage of personal solicitation when anything important is required. Numerous petitions are thrust into pigeon holes before they reach Ministers cannot get rid of a personal delegate quite so easily, and sometimes they grant his request if it is only to be relieved of his importunity.\n\nLet a convention then be held at an early date in Prince Albert, delegates from all parts of the Province be assembled, and the situation and the propriety of sending delegates to Ottawa. No time should be lost as Parliament has already been a fortnight in session and the journey down is a long and tedious one.\n\nORIENTAL\n\nContinuing our article in the last issue regarding the Sudan difficulties, it will be seen that our surmises were not far wrong when we said that the recent disturbances in Egypt would eventually be more a war of commerce than a national conflict. The Marquis of Lansdowne, who had spread his specialities over the general property of the Dominion, has now turned his attention to matters of general interest. The following is the only reference made to the question of the increase of population in the North West, and the Territorial Act expedient, which, as our readers will see, is not an important matter.\n\n\"The rapid growth of the C. P. R. is needed to, and the final completion of the main line across the Ocean is promised by the spring of 1884, five years before the time allowed by the Act. Mr. Macdonald's address was moved by the Commons by Mr. McMaster, formerly M.P. for the constituency of North West Territory, and who had gained a local reputation for eloquence, but like many another proved unable to maintain his ground in the larger arena of the House of Commons, and was seconded by Mr. Bellamy, member for Leeds, who spoke in French. Hon. Mr. Macdonald, in reply, followed it up with a speech of two hours, in which he gave particular attention to the question of population in the North West. He condemned the manner in which the public lands had been mismanaged, and said that the Government had recommended the Hudson Bay Railroad, Sir John Macdonald replied and also dealt with the question of the extension to North West matters. He took upon himself the whole responsibility of the question, and resolved to say what was necessary to make the question of the construction of the railroad. He demanded any delay in the settlement of the question, and denounced the policy of the colonial companies. He said the Government had shown a decided eagerness to double the land grant that had been given to another road, except the C. P. R., and had refused to make any compensation, although it had sufficed vitality to go ahead. To prevent the people had to send their grain to Port Arthur, but in a couple of years this would be impossible, and they would have a choice of all rail through the northern territories or by water from Port Arthur. The question of the North West matters are likely to excite a great deal of attention this session and it is to be hoped that the members of Parliament will stand up for our rights and champion the cause of the North West Territories.\n\nINCORPORATION.\n\nBy the last mail the Lieut.-Governor sent out a circular questionnaire relating to the incorporation of the town of Prince Albert. After this has appeared for four weeks, the question is now being raised, erecting the area defined in the advertisement into the \"Town of Prince Albert,\" and calling for nominations and names for the days for the nomination and election of councillors. Whether this question will be answered by an alderman, as was done in the case of Regina, or for five councillors who will elect one mayor, is not known at present. The petition for incorporation was general and left that matter to be determined by the Lieutenant-Governor. If there is no Town of Prince Albert present, it does not seem to be except that the elections are to take place annually, and that the mayor would appear to be the preferable course. It now remains for our citizens to exert themselves in the matter and secure the desired result.\n\nBUSINESS IS VERY QUIET.\n\nDOMINION PARLIAMENT\n\nThe Dominion Parliament opened on the 17th inst., with more than usual attendance. The usual ceremonies were observed. A large number of people assembled to witness the pageant and the Senate Chamber was filled with both members and government officials arrayed in their Windsor uniforms. Sir John Macdonald spoke as ever, notwithstanding his three score years and ten. The speech from the throne, which was of the utmost kind, was remarkable for its generous tone and the absence of anything of a compromising nature. He referred to the Ministers. His Excellency, the Governor General, the Marquis of Lansdowne, congratulated the members on the general prosperity of the Dominion, and the importance of matters of general interest. The following is the only reference made to the question of the increase of population in the North West, and the Territorial Act expedient, which, as our readers will see, is not an important matter.\n\nThe Boom is off!\n\nJ. O. DAVIS & CO.\n\nDon't talk unless you have something to say.\n\nWe are determined to sell out at auction prices. Hard Lines. Better luck next time.\n\n\"What cannot be avoided. Too childish weakness to lament. How often in affairs of men we see dull hesitation end in woeful loss! If it can be made, decide at once, act with proceeds of thy sales hoy. Gold that is put to use makes gold better.\"\n\nYou know how we are situated. Please and say you wish to buy too much. This will be sure to establish a very agreeable feeling between us. You will thereby be master of the situation, and we will be sure to serve you in a satisfactory manner.\n\nBRANCH STORE\n\nNear the building occupied by the late firm of Astwood & Agnew, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO., Wholesale and Retail.\n\nPRINCE ALBERT, SASK.\nSILVER CITY.\n\nThis news, near the summit of the Rockies, at the present end of the C. P. R. track, seems destined to be the El Dorado of the North American continent; there will be an immense rush of emigration there as soon as the spring opens.\n\nThe great excitement now, however, is the mining fever, which has just sprung up in the vicinity of Silver City, which has been productive of a glorious result. There are quite a number of experts at work, and in the Queen of the Hills there is now some 100 claims staked out worth more than was said to have been discovered. Mr. McFee, superintendent for some American capitalists, reports that the region is being worked over by a mineral region for gold and silver he has never in his experience seen. Now that the C. P. R. has reached the district, the gold fever is expected next season that will attract thousands of people to the Rockies.\n\nThe news from Father Desmet, an old Jesuit missionary who visited this region from St. Louis, says it is about to be realized. The cattle raising, the timber trade, and the coal mining industries are all reported to be in a flourishing state.\n\nTHE SURVEYS.\n\nThe work done by the Dominion land survey parties during the past season has been larger than in any previous year. Mr. W. H. Macdonald, who has recently returned to Ottawa from Medicine Hat, where he was stationed all summer, gave some valuable information on the subject. Nearly 120 survey parties, 1,200 men, have been engaged in the work all summer, and they have covered a total distance of 1,600 miles, a greater area than was ever gone over before in one season in Canada or the United States. The surveying party, under Mr. Macdonald, was successively extended from Moose Jaw and the Touchwood Hills to Calgary, and thence to the third line due west to the sixth subdivision line. In addition to these, the principal base lines and meridians have been run throughout the greater portion of the whole district. All the country from the boundary line to the North Saskatchewan and from the Touchwood Hills to the Rocky Mountains is ready for subdivision, which can be done with little delay if the surveys are continued. It will probably be entered upon during the coming year. The townships which have been surveyed are now ready to be platted, the subdivision work will be completed, and the surveys the past season were prosecuted until the extension of the C. P. R., which the advance of the grass of former years by means of having to travel in ox-carts, etc., was avoided. But, regardless of the surveys that have been done, it is estimated that it will take three years more at the same rate to cover the whole of the district. This is a vast country, a fact of which few seem to have any adequate idea. From Winnipeg to Edmonton the distance is 1,300 miles; about 1,000 miles south of that is Fort Simpson, while another 1,000 miles north the Mackenzie river flows into the Arctic Ocean. The surveys were commenced earlier by the survey party, probably early in April, and an effort will be made to finish them this fall.\n\nThere is a great deal of surveying yet to be done in the Saskatchewan District. Mr. Caddy has a party of fifteen men across the winter in the neighborhood of Carrot River.\n\nC. P. R.'s Eastern Terminus.\n\nAn interesting news that a number of prominent citizens of Halifax have written a letter to the Mayor of Quebec, urging action to induce the Canadian Pacific Railway to extend its line back to Quebec from its summer points. It was declared to the Government to extend the line to Quebec, and demand the Canadian Pacific Railway, as a company receiving so much public money, etc., to do so. A committee was appointed to prepare a resolution embodying the views of the meeting.\n\nWe are pleased to learn that citizens of Halifax are pressing to have that part of the eastern terminus of the C. P. R., for which it has the greatest natural and geographical advantages.\n\nThe gallant steamer took a whip out of a cutter and rushed it in the woods near the brick hotel, east end of the right-of-way. We shall give him a whipping if he needs one badly.\n\nJUST ARRIVED\n\n100 HORSES\nCONSISTING OF\nWORK, SADDLE AND\nBROOD MARES.\n\nFreighting, express and passenger\nline from Gabriel's Crossing to Troy\nand back.\n\nPH. GARNOT,\nAgent, Gabriel's Crossing, South Branch.\n\nPUBLIC NOTICE\n\nIn future no work will be served by me except on payment of the proper fees in advance. I am obliged to charge for my services from the place where service is to be performed. This applies to all writing, executions, attestation, etc., and also to all other services. All expenses are liable for my fees and charges. I am obliged to charge for my services from the place where service is to be performed.\n\nH. KENNEDY,\nActing Agent, No. 2.\n\nPrince Albert, Dec. 30, 1883.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Cutter Runners Shafts and Tongues for sale.\n\nAnd a variety of other articles generally used in a first class Blacksmith Shop.\n\nCHESTER THOMPSON,\nPRINCE ALBERT.\n\nReal Estate\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS CENTRALLY LOCATED IN PRINCE ALBERT.\n\nPRINCE ALBERT\n\nC. MAIR,\n\nP. O. BOX 147,\n\nPRINCE ALBERT, N.W.T.\n\nMoffat & Caldwell, Bankers,\n\nPRINCE ALBERT, N.W.T.\n\nDENTIST\n\nPRINCE ALBERT, N.W.T.\n\nRead This\n\nONLY\n\n$3.50\n\nTo the Greatest Offer ever made to the Canadian Public.\n\nFOR $3.50\n\nwe will send to any address in Canada or the U.S.\n\nTHE WEEKLY GLOBE\n\nPRINTED NEATLY AND DISPATCHED.\n\nSPINK & MAVETTY,\n\nPROPRIETORS\n\nRIVER STREET,\n\nPRINCE ALBERT.\nTHE BAD BOY.\n\nHonorary title the Grocer gave What he thought was his most dissolute.\n\n\"Say, come here while I give you a piece of advice,\" said the grocer sternly to the boy in the grocer's store. \"You've been talking too much with an old soldier from the soldiers' home, who was up by the coal yard yesterday. He looked like he had seen hard times,\" the grocerman added. \"No sir, you can't have any plug tobacco, unless you save up your pennies and go down on the counter, and I had rather you wouldn't come here to trade anyway, because you're always getting into trouble, and my customers don't like to mix up with you.\" The old veteran warned him to behave himself, and the grocerman took the bad boy in the back end of the store, and said, \"You'll want to be careful along about now. Your name is in here high up, and he said he was ashamed of you. He said he was mad at you couldn't speak for a minute, and you walked out towards the house with soldiers alike you, holding his arm and saying put me in the army.\"\n\n\"You and pay a pretty penny to go back on soldiers and you? How long is it since you last heard from your comrades? Have you any news to submit? Let these old soldiers alone. They are a bad lot,\" and the grocerman acted as though he knew nothing about the boy from a terrible life. The boy was so mad he couldn't speak for a minute, and he walked out towards the house.\n\n\"Your name is in here high up, and he said he was ashamed of you. He said he was mad at you couldn't speak for a minute, and you walked out towards the house with soldiers alike you, holding his arm and saying put me in the army.\"\n\n\"The Lion Reaper,\" \"Honey Fanning Mills,\" \"Wood Harvesters and Rafted Cross Ploughs\n\nAll these goods are guaranteed to give satisfaction. Parties wishing to secure first-class implements on reasonable terms, will do well to consult and leave their orders.\n\nJACKSON & JACKSON\n\nFARMERS ATTENTION!\n\nA. Harris & Co., manufacturers of the best quality of plowshares, harrows, and other implements ever sent into the market.\n\nBrantford Reapers, Brantford Mowers and Bakes, Snowball & Spigot Wagons, Stubble and Cross Plows.\n\nA Large Stock of Repairs.\n\n20 Brantford Cord Binders,\n\nWhich are now used at the Forks of the River, and will be guaranteed to be in good order when delivered.\n\nA complete set is now in attendance, and will be delivered at reasonable prices.\n\nS. W. VANLUVEN.\n\nFits, Epilepsy, or Falling Sickness.\n\nPERMANENT CURE FOR ALL DISEASES.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT - N.W.T.\nWHISKEY KEGS' REPLY.\n\nI'm broken in him, my ribs lay around,\nAs useless, forgotten, encumbering the ground.\nMy days have gone past, I am but a ghost,\nOf what I once was, but I know that the past\nRemains behind me, though it has been done,\nAs life has been short, my day has been run.\n\nBut let us just say, then in self defense,\nHad death and man gone together, with plain com-\nmon sense,\nAnd \"Permita\" been given with little dis-\ncretion,\nThe liquor laws passed in the last sitting Session\nWould show that drunkenness did not begin\nWith \"Bailing the Kegs,\" so 'twas not all our\nfault.\n\nThis liquor law made moderation to all,\nAnd morals to \"kings,\" so often was it fall,\nAnd \"Bailing the Kegs\" in a third of the plot,\nThat when the liquor laws came into full force,\nIt had been too late, for they had been laid\nFor equally getting their turn in their due.\n\nSHAMROCK.\n\nPROGRESS OF THE O. P. R.\n\nThe Railway Age, in summarizing the progress of railway construction, has the following in reference to the Canadian Pacific Railway:\n\nOn July 15th, 1883, the main line was completed, the main line was carried westward from Winnipeg to the foothills, a distance of 165 miles, and in the following month, a distance of 418 miles was completed. In 1884, grading was recommenced at the end of the line, and on April 18th, Calgary being reached on August 15th. The greatest amount of work was accomplished in August, when 127 miles of track were laid, the best previous record having been 85.96 miles in August 1882. From Calgary the work was vigor-\nously pressed forward towards the Rocky Mountains, which was reached on November 27th, the track being then laid 122 miles from Calgary, and 1,122 miles west of Winnipeg.\n\nThe work for the past three years on the main line through the prairie foot up as follows:\n\nMiles:\n1881... 183.50\n1882... 418.78\n1883... 381.78\nTotal... 984.14\n\nIn addition to this, the main siding was laid. In the seven weeks ending September 17th, 1883, or in forty-two con-\nsecutive working days, 131.01 miles of track were laid, an average of 3.10 miles per day, excluding an average of 2.9 miles per day, exclusive of sidings, but large as was this average, it was ex-\nceeded by the whole of the following eight months, embracing forty-eight consecutive working days, 108.38 miles of main track were laid, or an average of 3.48 miles per day, exclusive of sidings.\n\nNEW REGULATIONS RELATING TO NATURALIZATION.\n\nThe following order-in-Council relat-\ning to aliens was published in the last Canada Royal Gazette, Jan. 25th, 1884:\n\nRegulations made under the authority of the Naturalization Act, Canada, 1881.\n\nThe certificate of naturalization of an alien's three years' residence or service must be had before taking the oaths or affirma-\ntions of residence and service, and the provisions of the same will be held of record as provided in the tenth section of the said Act is limited to five years, immedi-\nately preceding the taking of each oath or affirmations.\n\n2. In the North West Territories, and in the District of Keewatin, the cer-\ntificate mentioned in the twelfth section of the said Act shall be presented to one of the Superintendent Migration Officers of the West Territories who shall take such measures to satisfy himself that the facts stated in the certificate are true, as shall be necessary, and when satisfied that the facts stated in the certificate are true, he shall grant to the alien a certificate of naturaliza-\ntion, authenticated by him and signed.\n\nEach Superintendent shall keep a record of all certificates presented to him and filed with him; also a record of all certificates of naturalization granted by him, of which he will make a certified copy.\n\nAs the Naturalization Act in this part of the country chiefly interests persons who are natives of Great Britain and Irish subjects, it would be as well that it should be known that a copy of the certificate of naturalization may be obtained and sent with the application for a passport in all cases where applications are made by naturalized subjects. Ed.\n\nMr. O. H. Fyfe, of Moosejaw, leaves for home today, having disposed of his wealth of horses, cattle, etc.\n\nO. E. HUGHES & CO.,\nGeneral Merchants AND Indian Traders,\n\nJUST TO HAND\n\nFALL AND WINTER GOODS,\nLadies Gardian Jackets, Persian Lamb Hats, Etc.\n\nPRINCE LIBERT, N.W.T.\nBOOTS AND SHOES CHEAP.\n\nWe claim to have the best assorted stock in Prince Albert, and are selling at prices which defy competition.\n\nCUSTOM WORK\nWarranted and done at shortest notice.\n\nREPAIRING\nPromptly attended to.\n\nSHANNON & McLEOD\nNEW FALL AND WINTER MILLINERY,\nLADIES GOLMANS AND CLOAKS,\nFur Caps and Muffs,\nWool Goods.\n\nALSO\nLadies and Children General Furnishings,\n\nMISS MACK & CO,\nCAMPBELL'S BLOCK.\nBONANZA!\n\nStill on the War Path\nWITH A LARGE LINE OF GOODS\nAnd Slaughtering the Prices.\n\nRemember it is not old stock which we offer, but the very best. We have the King's Prize, but to have on hand now is something new. The North West Stock consists as follows:\n\nDry Goods and Novelties\nIncluding a large line of\n\nWM. R. BELL.\nNOTICE.\nTo Merchants and Others.\n\nPARTIES WHO REQUIRE\nAccounts written up, Books written up, Sold-\nnured, etc.\n\nWill do well to apply either personally or by letter at the Post Office or Train Office.\n\nA. R. BURNS.\n\nPHOTOGRAPHS\nChas. E. Page.\nNEW STUDIO.\n\nEAST END.\nG. D. NORTHGRAVES\nWatchmaker and Jeweller,\nA T. N. Campbell's New Store,\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\n\nKEPT CONSTANTLY ON HAND\nRepairing Promptly Attended to\nJAMES SINCLAIR,\nMerchant Tailor,\nHas just received his new stock of\nFall and Winter Goods,\nAnd is prepared to supply his numerous customers with\nSuits to please the fancy of all.\nAlso a large stock of\nUNDERCLOTHING\nA Large Assortment of\nFUR CAPS AND MITTS\nGive me a call.\n\nJAMES SINCLAIR\nEAST END BAKERY\nEight Loaves for $1\nCakes and Pastries always on\nhand made to order.\n\nHUGH M'DOUGALL,\nEast End Bakery,\nPrince Albert Bakery.\n\n2LB LOAF, 12C.\n9 LOAVES, 1S.\n\nCakes and Pastries always on\nhand made to order.\n\nROYAL ROUTE.\nJ. H. HIGGINS, Gen. Passenger Manager.\nT. W. TEASDALE, Gen. Passenger Agent.\nSt. P., M., & M. Railway.\n\nTime Table.\n\nSOUTHWESTERN.\nExpress leaves St. Vincent at 11.40a.m., arriving at St. Paul at 8.15a.m. following day, making connections with lines running in all directions.\n\nNORTHEASTERN.\nExpress leaves St. Vincent at 11.40a.m., arriving at St. Vincent at 1.45a.m. following day, making connections with Canadian Pacific.\n\nTrains leave St. Paul for Brockdenburg, Minn., at 7.45a.m., and 12.45p.m.; East from Brockdenburg at 7.45a.m. and 12.45p.m. Trains run between St. Paul and Minne-\napolos every hour. Sleeping cars to all night trains.\n\nCANADA PACIFIC RY. CO.\nWestern Division.\nTRAIL SERVICE.\nCHANGE OF TIME.\nOn and after June 10th, 1883, trains will move as follows:\nGoing West\n7:30 a.m. Ice Winnipeg arr. 8:30 p.m.\n12:30 p.m. Ice Portage arr. 1:30 p.m.\n3:30 p.m. Ice Red River arr. 4:30 p.m.\n6:30 p.m. Ice Winnipeg arr. 7:30 p.m.\n12:30 a.m. Ice Athabasca arr. 1:30 a.m.\nGoing East\n7:30 a.m. Ice Winnipeg arr. 8:30 p.m.\n12:30 p.m. Ice Portage arr. 1:30 p.m.\n3:30 p.m. Ice Red River arr. 4:30 p.m.\n6:30 p.m. Ice Winnipeg arr. 7:30 p.m.\n12:30 a.m. Ice Athabasca arr. 1:30 a.m.\n\nFURNITURE\nJust arrived, in addition to our former large stock we have received some\nFancy Parlor and Bedroom Sets.\nGive us a call and see our\nSideboards, Bureaus, Bedsteads, Couches, Sofas,\nChairs of nearly all Descrip-\ntions, Cradles & Cribs for the Babies\nRocking Chairs for the Ladies\nMattresses Single & Double\nto suit Customers.\n\nC. & G. E. CARTER,\nHO FOR THE WEST.\nGENERAL BLACKSMITHING\nAND\nHORSESHOEING\nDone on the Most Approved Principles\nand the following diseases remedied:\nContracted Feet, Hoof Bonded, Weak Heel,\nCracks, Interfering and other diseases in\nthe feet of horses.\n\nSleigh and Cutter Ironing.\nCarriage Repairing\nAnd Jobbing\nFROM PROMPTLY ATTENDED TO.\n\nWM. GORDON.\nPrince Albert\nPlaning Mills and\nSash and Door Factory\n(For Sash, Doors, Frames, Blinds, Moldings and all building materials made to order)\nGOODFELLOW BROS., PROP'S.\nPrince Albert, N.W.T.\n\nW. J. CARTER,\nBuilder and Contractor.\nAll Orders Promptly Attended to.\nPlans and estimates furnished when required.\nPlanning and Matching done to order, next to H. R. C. Mill.\nResidence—Near Presbyterian Church.\n\nFOR THE HOLIDAYS.\nWALTERS & BAKER\nAre offering their entire stock of Dry Goods,\nClothing, Men's and Youth's\nCrockerery,\nBoots and Shoes,\nConfectionery,\nGroceries,\nProvisions, etc.\n\nROCK BOTTOM STORE\nH. WALTERS, F. C. BAKER.\nBaker's, Prince Albert\nMEN AND THEIR ACTIONS\n\nHUDSON BAY ROUTE\n\nAdditional Extracts from Mr. Wilmot's Lecture Delivered at Montreal, Nov. 1879.\n\nBuffalo Hall!\n\nGreat Clearing Sale of FURS, MITTS AND MOCASSINS\n\nLadies' Astrachan Sacsques, Ladies' and Men's S.S. Seal Persian Lamb, Otter Beaver, Astrachan and Cloth Caps, Kid Mitts, Buck Mitts, and an immense stock of Ladies', Men's and Youth's Mocassins, all at cost for cash.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nJ. L. JOHNSON & CO.\n\nDEALERS IN General, Shelf and Heavy Hardware, Glass, Paints, Oils, Etc.\n\nMain St., Prince Albert.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'\n\nFARMING LANDS!\n\nFOR SALE IN Manitoba & North-west\n\nThe Hudson's Bay Company owns 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO TOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Osceola, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. PRYCE, Land Commissioner", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884020101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9132, "total-output-tokens": 7566, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 12745, 2], [12745, 18314, 3], [18314, 20924, 4], [20924, 29478, 5], [29478, 30856, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]