[{"id": "eb74fef25c0ced5ca7b8de004565ba139c7960e0", "text": "NOTICE.\n\nPrince Albert Protestant Public School District No. 3.\n\nThe Board invite tenders for the supply of Fresh Beef.\n\nFresh Beef.\n\nSealed tenders will be received at the office of the Board, Prince Albert, until Monday the 25th inst., for the supply of Fresh Beef.\n\nMRS. HAMMOND,\nFashionable Dress & Mantle Maker.\n\nFresh Beef.\n\nFresh Beef.\n\nTHE EUROPEAN HOUSE.\n\nREGULATIONS TO NOTICE.\n\nFor the benefit of the public, special care is taken in the preparation of every description of food served in this establishment.\n\nConditions as to killing, cutting up and delivery of above will be as shown in Schedule attached.\n\nTenders may be sent in for the delivery of any whole or any portion.\n\nR. C. WIGMORE & CO.\n\nGENERAL MERCHANTS.\n\nWE MEAN BUSINESS.\n\nClearing Sale!\n\nEverything goes at Prices never heard of before!\n\nR. C. WIGMORE & CO.\n\nBLACKSMITHING.\n\nM'CALL BROS.,\nGeneral Blacksmiths,\n\nCHURCH STREET\n\nSeason 1886.\n\nTo Shippers\n\nThe Lake Steamer leaves Selkirk to connect with the Saskatchewan River Steamer at Grand Rapids on the 2nd May 1886.\n\nAll Goods at Selkirk at this date will be shipped on the steamer, and will be delivered at destination promptly.\n\nThe Winnipeg and Western Transportation Co. Limited, under the direction of Mr. A. W. R. Markley, has prepared to make Special Rates for large shipments, and arrange for payments to meet all charges.\n\nThe best Passenger Accommodation in State Rooms, Table and Attendant for Families and Ladies.\n\nFor further information apply at the Hudson's Bay Company's Office, Prince Albert.\n\nSHANNON & McLEOD\n\nOffice—In Mr. Brearley's Office\nTO THE LADIES.\n\nNEW GOODS\n\nAT\n\nMISS MACK & CO\n\nFirst Door East Telegraph Office.\n\nCALEDONIA BREWERY\n\nEAST END.\n\nThe proprietors of the above concern is prepared to supply families returning with their goods from Europe, with all the necessaries required for their comfort.\n\nLIVERY & FE D STABLE\n\nCHAS. WOODMAN\n\nPROPRIETOR.\n\nROYAL MAIL STAGE\n\nWEEKLY.\n\nTHE PAC. BAND TRIP\n\nThe P. A. C. Band left for Battleford on Monday last, fifth inst., by steamer and arrived here last evening.\n\nThere were 14 members of the band, and they were joined by Mr. W. Caddy and his family, who had been engaged in the construction of the new school building at Battleford.\n\nThe band was well received by the citizens of Medicine Hat, and was entertained at a dinner given in their honor.\n\nThe band then proceeded to Fort Pitt, where they were met by a large crowd of people, who had come out to see them off.\n\nThe band then proceeded to Fort Pitt, where they were met by a large crowd of people, who had come out to see them off.\n\nTHE WEEKLY SUN!\n\nArrangements are being made for the publication of THE MANITOBA SUN for the publication of a Weekly Edition of a local paper of the Weekly Edition will contain The News of the Week, Selected Miscellany, An Interesting Serial, and other Departments of Popular Interest to the Home Circle.\n\n$1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial, and other Departments of Popular Interest to the Home Circle.\n\nTHE MANITOBA SUN.\n\n12 Market St. E.\n\nWinnipeg, Man.\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES\n\nFOR\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinen, etc.\n\nGO TO\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 16 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nROBERT THOMSON,\nSign & Ornamental Painter\nDecorative Painting a Specialty\n\nContinued on Fourth Page\nContinued from Third Page\n\nAwarded to Miss Marion Wilson. Prize for General Satisfaction and Application: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Alice Howie, Prize for General Satisfaction: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French and Latin, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Elizabeth Sprague, Prize for General Satisfaction and Application: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Mary McDonald, Prize for General Satisfaction: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Annie Markley, 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Nellie Drewry, Prize for General Satisfaction and Application: 1st Prize for Drawing, in the 3rd Class; 2nd Prize for Music, in the 3rd Class; 3rd Prize for French Studies, in the 3rd Class.\n\nMiss Louise Prichard, Prize for General Satisfaction and Application: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Ellie Goodhew, Prize for General Satisfaction and Application: 1st Prize for Writing, in the 3rd Class; 2nd Prize for Needlework, in the 3rd Class; 3rd Prize for French Studies, in the 3rd Class.\n\nMiss Martha M. Ray, Prize for General Satisfaction: 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Katie Molloy, 1st Prize for English Studies, in the 3rd Class; 2nd Prize for French Studies, in the 3rd Class; 3rd Prize for Music, in the 3rd Class.\n\nMiss Ada Duggan, 1st Prize for Music, in the 3rd Class.\n\nMiss Marion Wilson, having obtained the highest number of marks during the year, was given the 1st Silver Medal.\n\nThe prizes were awarded by Miss Alice Howie, whose marks are only 2 per cent below those of the winner of the 1st Medal.\n\nTELEGRAHIC.\n\n[By Special Telegraph.]\n\nOTTAWA, July 9.—James Fairley has received the following information by telegraph:\n\nThe temperance abstention union has invited Alderman Jones to conduct north West Ward.\n\nThe military association of Mimico police will have an excursion to Wiarton.\n\nNew York boat Tercentenary Larnach.\n\nChief of the Rigby of Nova Scotia a friend.\n\nOut of sixty-two London seats only eleven have been served by re-electionists.\n\nThe polls at midnight were closed.\n\nMr. James McCauley, chairman of the working men's independent of the Liberal and Unionists, made a speech at the meeting.\n\nIt is believed impossible that they will agree to doing so. Gladstone has replied that he cannot agree to any conditions when Lord Salisbury takes office, and they are certain that the Conservative party will not agree to any conditions unless the Liberals agree to do likewise.\n\nIt is reported in Government circles that Gladstone is ill-pleased, and he is expected to wage another battle in Parliament. The leaders of every party anticipate a serious contest.\n\nA large return for yesterday was returned by the district of St. John's, containing 49 new cases, 10 deaths; Sault Ste. Marie, 21 new cases, 21 deaths; Sudbury, 24 cases, 4 deaths; Temagami, 16 cases; Cochrane, 17 cases; Cheltenham, 11 cases; Newmarket, 12 cases; and several new cases in the province.\n\nThe North West Central contest has not yet been awarded.\n\nSir John A. Macdonald has been troubled by dissensions in his party.\n\nThe Government welcomed the ex-panthers of Scotland for supporting the Gladstonian measure. In his speech announcing the Conservative policy Sir Michael Hicks Beach said that the hon. member for Dundas had been the Irish National League, and opposed Irish obstructionists. Members elected at meetings of the Conservative clubs in Canada.\n\nSeveral and Secret Acts outrage of a gross character are reported from Ontario.\n\nCowan & Co. have been given the North West Central Charter.\n\nIt is stated an excellent authority that the hon. member has been assured of five years' peace in the territories. It is also stated that Hayter Reid, has been promised by the Premier Commissioner Mr. Miller of the Judicial Office will succeed him in his present position.\n\nA Battery will have its Appeals to morrow for Kingston.\n\nC. H. Graham an American super-annuated army officer who has been employed for the purpose, and now talks of going over the House-Snow Falls.\n\nWednesday, July 12. The second train from Toronto, already occupied destruction by firemen, through back fires, reached the city yesterday. The passengers were obliged to get off the train and the train thrown off the track because it could not be got under the way. Two cars were destroyed, and the rest were destroyed, considerable damage being also done.\n\nFred Brown fell from the estate of a house during the general panic, and received probably fatal injuries.\n\nSir John Macdonald left Ottawa for Winnipeg on Saturday night, and expects to arrive there Monday morning.\n\nArrangements are being made for his reception.\n\nChambers & Co. have awarded the North West Central contract.\n\nSir A. T. Galt and two others have been appointed a commission to inquire into the question of the feasibility of applying a national coin.\n\nA demonstration has been staged granting a general amnesty to all prisoners confined in, or committed under the North west rebellion last year, excluding those who have been convicted of high treason, the amnesty does not include the prisoners actually undergoing sentences, but those who have been sentenced to death or to imprisonment for a term of years.\n\nWinnipeg, July 14. John Craig went shortly to visit the North-West.\n\nThe Canadian Pacific has decided to send a special train to the scene of the recent trouble, to bring back the bodies of the victims.\n\nIt is believed that the trouble would have been prevented.\n\nThere was considerable excitement today, as a number of persons who claimed they were at the scene, and there was considerable confusion.\n\nThe Premier is expected to make a statement to-night regarding the matter.\n\nHe is greatly pleased with the result of the election, which was particularly interesting, and the appearance of the new government is likely to be very pleasing to the voters, and he might well expect the Corporation address. Tomorrow he will go to the west, and Friday next to the Pacific Coast, where he will spend some days.\n\nOn his return, he will visit Montreal, and spend a week at Winnipeg, and go east.\n\nThe dispatches of Palmer parallel the events with great success, six thousand men in line.\n\nThere has been some change taking place in the military authorities.\n\nIn Gladstone's address to parliament it is expected that the present will resign, Gladstone will have to rely upon his colleagues on Saturday. The Premier will attend without regret, but he will have to rely upon Palmer.\n\nThey will have the privilege of a full\n\nGeneral Merchants\n\nIndian Traders.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886071601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2836, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1592, 1], [1592, 3169, 2], [3169, 4029, 3], [4029, 11273, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]