[{"id": "d36dfb7be34e99fe30e06b4cbd0aab5d7c5953a9", "text": "THE PRINCE ALBERT TIMES\n\nSUNDAY CHURCH SERVICES\n\nSUNDAY SCHOOL SERVICES\n\nTHE REGINA LIONER\n\nREPRESENTATION\n\nThe Regina Lioner publishes the boundaries of the electoral division into which the Dominion Government has divided its last session, asked the Dominion Government to divide the Territories. The proposed subdivision gives Assiniboin thirteen, Alberta eight, and Saskatchewan only four members, making a total of twenty-five members to be elected to the Local Assembly. The Council also asked for responsible Government. Apparently no division has been made, unless they had decided that Saskatchewan should not be represented at all. We are glad to inform our readers that the member for Lorne stood up against the distribution of seats, and pressed the claims of this district to increased representation, but he stood alone in a Council of twenty and was voted down.\n\nThe people of the Canadian prairies want something more than earth, and the wonder is that they allowed us anything. We do not know what other basis the division was made, certainly not that of population. According to the census returns of 1885, which was the last taken, the total population of the Territories was 48,562, of which Assiniboin had 12,083, Alberta 14,533, and Saskatchewan 14,746, making 41,360 for the number of members to be elected, which would give 1,854 people to each, which would entitle Assiniboin to ten, Alberta nine, and this district six members, which would be a much fairer division. But Saskatchewan had at the time the census was taken a much larger population than that given above; there was no enumeration made of people living in northern and eastern portions of the district—and those numbers probably 3,000—which would entitle us to another representative. If the Government had followed the division suggested by the Council, Assiniboin will have a majority in the house, and will thus be able to set at defiance the wants and wishes of the people of the other two districts. No one district can have more representa-\n\nClearing Sale\n\nBox Stoves\n\nAcme Skates\n\nT. J. AGNEW'S\n\nClearing Sale\n\nHAVING ON HAND A LARGE STOCK OF\n\nFancy Goods and Toys\n\nWhich must be disposed of to make room on other lines. I have decided to offer the balance of\n\nThese Goods at Cost.\n\nCall early and take advantage of this offer, which will remain open for Thirty Days from this date.\n\nT. N. CAMPBELL'S\n\nThe Prince Albert Times\n\nAND—\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY\n\nPublisher and Proprietor.\n\nTHE GLOBE\n\nTHE OLDEST ESTABLISHED AND THE LEADING NEWSPAPER OF CANADA\n\nDAILY GLOBE, Morning Edition.\n\nWEEKLY GLOBE.\n\nSATURDAY DAILY GLOBE.\n\nThe different editions of The Globe can be procured from all News Dealers throughout Canada.\n\n--- THE GLOBE SPECIAL FAST TRAIN --- (Between Toronto and London, which has been running daily since April 1st, will be continued.) The special fast train arrives at London at 6 a.m., making connection with all the early trains from that point, securing to The Globe a thorough throughout Western Ontario hours in advance of Toronto papers.\n\n--- TO ADVERTISERS --- An advertising medium. The Globe is the oldest newspaper in Canada. Its circulation, which reaches hundreds of thousands daily, is far in advance of all other Canadian papers, and it is the leader in the field. The Globe is always first. The Globe is the leading newspaper of Canada, both in point of circulation and influence.\n\nTHE GLOBE PRINTING CO.\n\nTORONTO\nGENERAL NEWS\n\nLONDON, Jan. 6.—General Milne's plans in Cobourg's United Service Magazine are attracting attention. The Canadian militia is attending training at Fort Erie. Mr. Charles Dilke's criticism of the Fort Erie military training has been widely discussed.\n\nMr. Milne says he will send Canadian officers and gunners against any artillery in the world.\n\nThe Northumberland and Durham Battalion council will shortly hold a meeting to decide whether to continue to import Canadian stores. The company is not satisfied with the prices charged by the storekeepers.\n\nPovesh, Jan. 8.—Judge Paterson has been appointed to fill the vacancy caused by the Prince Edward County election. Rev. Ostrander and David Wellbanks for the position. They will be sworn in next week.\n\nMr. Paterson has been called away for a few days, but the latter three weeks. Thus, Collier, for taking a bible, was fined $5 and ordered to pay costs.\n\nTOMORROW DAY, Jan. 9.—The case of Mr. Irving Smith was up at the same court today, but was adjourned until Feb. 24th. In the meantime, Mr. Smith has been arrested under several false names. He will be tried on Feb. 24th.\n\nMr. Smith was arrested while trying to escape from the police. He was found dead in bed, having turned it on his back. He was about 50 and leaves a wife and children.\n\nWEDNESDAY, Jan. 9.—Owing to the continued absence of Major Backhouse from the town, the military parade was delayed until the afternoon. Mr. Green's flour and feed merchants, who had been arrested for selling liquor that had been purchased out of several dozens by a man at the Royal Oak hotel. Green and his partner were charged with selling liquor without a license. The charges were dismissed, and action may be taken against the proprietor of the hotel for selling liquor without a license.\n\nThe Rev. A. H. Wright, of Prince Albert, is a guest at the hotel.\n\nThe pocket book containing $2,000 was returned to Mr. Macdonald, who was on the C.P.R. platform by Mr. Donaldson, who had been arrested by the C.P.R. during the day. He was released by the police. Mr. Donaldson had been arrested for selling liquor without a license.\n\nThe E. R. A. H. Wright, of Prince Albert, is a guest at the hotel.\n\nThe pocket book containing $2,000 was returned to Mr. Macdonald, who was on the C.P.R. platform by Mr. Donaldson, who had been arrested by the C.P.R. during the day. He was released by the police. Mr. Donaldson had been arrested for selling liquor without a license.\n\nPUBLIC NOTICE\n\nNotice is hereby given that the exclusive right to sell newspapers on the streets of Prince Albert has been granted to Mr. Donaldson, who will be responsible for the sale of newspapers on the streets of Prince Albert.\n\nTerritorial News\n\nFrom the Herald, Dec. 31:\n\nPovesh, Jan. 6.—We have heard that Mr. Stewart, representing the Hudson's Bay Company, and Mr. Peterson, trading for Mr. Donaldson, have been engaged in a fair business. The fishing on the lake has not been as successful as in former years, but the hope is entertained that a good catch will be made.\n\nAt Jackfish Lake, on the other hand, the catch has been better than usual.\n\nAt the meeting of the Battalion Rifle Association held on the 3rd inst., Sergt. W. H. Cooper was added to the council, and the association completed its organization by electing Mr. H. H. Miller Secretary.\n\nMembers of the association elected their members of the council to form a committee.\n\nThe secretary was instructed to make arrangements for the annual rifle association with a view to securing Martini Henry rifles for the association.\n\nThe council then adjourned to meet again at the same place on the 15th January, at 8 p.m.\n\nF. T. BARNUM WRITES A STORY\n\nThe opening chapters of a splendid story for the young, by the famous showman, F. T. Barnum, appear this week in the columns of The New York Post. The story is entitled \"The Adventures of an American Boy,\" whom Mr. Barnum calls \"My Plucky Boy Tom.\"\n\nThe story describes how Tom, a boy of wild, fierce and rare animals to replace those destroyed by the disastrous fire at the circus. The story is thrillingly told by the hairbreadth escapes of this doughty American boy when capturing the animals. The story is now being read by many traveling men.\n\nNEW YORK FAMILY NOVELS Paper is for sale at all newsstands.\n\nJ. M. CAMPBELL\n\nIn our receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods Ever yet shown in Prince Albert.\n\nDress Goods\n\nOf the Latest Styles, with Trimmedings and Buttons to match.\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nAll Prices and Shades.\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Cloaks\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMEN'S\n\nFancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF Mitts and Moccasins\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR!\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nH. MACDOUGALL\n\nSASKATCHEWAN\n\nDIRECTORY\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\"Over 13 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nA BIG TRAIN OF FLOUR.\n\nMontreal, Jan. 5.—The Journal says the great flour train with its 180 cars, which will be the largest ever sent out, left for the east day over the \"Sun\" road, in two sections of twenty cars each. Each section is divided into the possession of one of the prominent local millers, the cars being numbered separately, each other in the destinations, but prove a signal aid to advancement to the city, the miller and the public.\n\nThe Philanthropy train, which leads the procession, goes to St. John's, N.B., where it will be used for an exhibition. The contents of the Philanthropy & Co. section are consigned to London, Eng., by Mr. J. H. Smith, the agent. The wheat, in sacks, is packed in sacks. The Wheat Milling Co., and the Warehouse, Crozier & Co., have been engaged. The train leaves by Sibley Firewood Co., and goes to Philadelphia. As each car was loaded, the wheat was weighed, and the contents named. The first section left the Soo yards at 10 o'clock until the closing of a crowd of people. The cars were loaded at intervals of half an hour.\n\nThe first flour mill in Minneapolis was erected in 1869, and was operated by the milling of the first, which proved so successful that they soon began to grow in the vicinity. The Great Western railway, the Chicago & North Western, and the Chicago & Milwaukee, account for all they manufacture.\n\nThere is something of a contract between the first \"Fourteens\" which left Minneapolis in 1869 and the magnificent train that pulled out from the same yard. In 1872, the Fort Garry was made the headquarters of Winnipeg new stand. The native power, consisting of horses and oxen, was used in the construction of the bridge, and the contractors were French half breeds. The average speed was 20 miles per day, and as the distance was 1,000 miles, the trip took nine days. The half breeds used to come down the river, and then back up the river, which was found to be more convenient than going back to the town. In 1873, a transformer was taken place which was used in the construction of the bridge, and the contractors were Aladdin and his wonderful lamp. That is what makes the departure of the first \"Fourteens\" in 1869 and the last one in 1889 so interesting.\n\nThe Brandon Times of the 5th inst. contains the following:\n\nMany of the citizens of Brandon who got nothing but the young man Mr. John McPherson, who was for years well known as the \"Baker,\" will be glad to learn that at the recent examination held in Brandon, he placed fourth, second, third, and fourth, which his class was examined. This is not the first time that Mr. McPherson has distinguished himself in the school affairs, as a few years ago he carried off the \"Baker's\" prize in the most difficult part of the practical work of making bread.\n\nWhen John McPherson carried off the highest honour at the Provincial competition in 1869, he was a pupil of the Portage la Prairie school, and was taken away by Mr. Smith, Principal of the Public school here. This was the second time that one of Mr. Smith's pupils had been awarded the \"Baker's\" head of all competitors for the \"Baker's\" prize. In 1869, Marion Setzer, one of his pupils, also won the prize. In 1870, he competed that year, outstripped all other competitors and received first prize. In 1880, he again won the prize, and this time he was awarded the honour of getting first, Christabel Setzer second, and Marion Setzer third, and stood fifth. The gold and silver medals of the Winnipeg schools stood only third and fourth. Some twenty or more pupils have been awarded prizes since 1869. This speaks well for the ability of Mr. Smith as an instructor, and the good work done by the children under him. Mr. McPherson is now telling in his higher education. We believe Mr. Smith will be the next to receive the honour of winning the first position in the Manitoba Provincial competition examination, which will take place prior to the Winnipeg Public schools.\n\nThe telegraph line at Goderich was successfully opened on Wednesday evening last, January 1st, and was attended by about twenty-five ladies and gentlemen. After the opening of the line, an announcement, the party adjourned to the house of Com. McPhail, where they partook of the refreshment provided, which was heartily enjoyed.\n\nTHE WOOD BUFFALO.\n\nThe Call says that Ottawa correspondents wired them on Thursday as follows:\n\nThe Government recently received post, telegraph, and telegraph reports from the North-West, and the following statement of the facts regarding the buffalo hunt will be adopted:\n\nM. M. Bell, who visited the district on Friday afternoon, said he had heard for a long time that wood buffalo existed in the Peace River district. He said that inquiries from the Hudson's Bay Co.'s factors had been made here, and a report made by Mr. Campbell, Mr. Macdonald that probably between two and three hundred still existed in that district, and that he believed there were still more. He said that reports had reported that that number existed, and very few of the animals were killed. The government has taken advantage of these factors to secure a good specimen, the hide skeleton and skull of which will be placed in the Manitoba Historical Society. These buffaloes exist in small detached bands. They were once numerous, and extended from the Peace River to the Rockies. About 1869 Alexander Henry, a partner in the Hudson's Bay Company, and now deceased, was told by Indians that there was buffalo in the Athabasca district, and that they inhabited the wooded districts north from that point to the McKenzie, and says that they were different from those found on the plains, and that they were distinct in some of their characteristics from the ordinary plains buffalo.\n\nWHAT PROF. MACDONALD SAYS.\n\nIn his work on Manitoba and the great plains, Prof. Macdonald says:\n\n\"It is doubtful whether the great herds passed constantly from the Peace River to the Peace River, but that at any rate is certain, their homes on those northern prairies, and their range was near the foot hills of the Rocky Mountains. It is also certain that the last buffalo were killed north of the Peace River in 1872, about 1874, and that they were killed between Athabasca and Peace rivers, north of Little Slave Lake. These are also called wood buffalo, and differ only in size from those of the plains.\"\n\nA MILITARY ORDER.\n\nInstructions have been received from the Militia department at Ottawa to hold a meeting of the officers and men of the war medals and clasps, and present them to their respective regiments for the campaign of 1885, and also in return to Ottawa forthwith the certificates of the medals distributed. In future volunteers who took part in the suppression of the rebellion will be entitled to the medal, and those who did not take part in the suppression of the medal, etc., will have to make application to the department at Ottawa. It is really unfortunate that many of the medals and clasps remain on the hands of the commanding officers. The Winnipeg field battery, however, has been very active and enthusiastic. Some of the men who went through that rebellion are in South America, others are in the United States, and others are scattered throughout Europe. The present dimension is not peculiar to the W.F.F., but is common to every regiment which took part in an active service.\n\nWe learn on reliable authority that an American immigrant, named Mr. Smith, was arrested at Moose Lake, by police. It seems that last summer he carried a young Indian woman and in company with her, went north to hunt and trap. Things went well until a short time ago when the young woman returned, saying she had been ill. She said she had been ill for two weeks. They gave her a quantity of styracine and she died. She was buried in her husband's food, completely for the purpose of deceiving the world, and would be murdered put in too large a quantity of the drug and he lasted for several days. He then gave the food to a dog, which died in all the agonies of poison by styracine.\n\nMr. T. S. Kennedy gives notice that applications will be made in the Legislative Assembly for an act authorizing Mr. Norquay to become a barrister, \"on certain terms and conditions.\" Mr. Norquay will study in Mr. Kennedy's office.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nPRINCE ALBERT BREWERY!\n\nPure and Sparkling!\n\nAMBER—Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROD\n\nXMAS CARDS\n\nIn Endless Variety at\n\nCANN'S BOOK STORE\n\nGRAND UNION LIVERY STABLE\n\nOpposition is the Life of Trade.\n\nA Practical Library, Post and Stable Business.\n\nWe would like to see the public who visit Prince Albert to give us a call, and see our extensive stock of books, and also to show a glimpse of our fine stable and livery and Ford Stable in town.\n\nWe have a large stock of horses and mares, as well as a large number of thoroughbred racehorses, and good reliable teams, accommodating one night and day at our stable.\n\nAll our horses and stable livery horses are in first-class condition, and are always ready for immediate use.\n\nWe do not advertise in newspapers to attract trade in numbers, but that constitute our business—business and all the best prices.\n\nDonaldson & Pembbridge\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888012001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 4452, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3693, 2], [3693, 9292, 3], [9292, 18549, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]