[{"id": "26016975b7538db3e1c796f34b47e97e96880e19", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, DECEMBER 31, 1886.\n\n$250 A YEAR.\n\nBANKING HOUSE OF\nMarthar & Knowles,\nPrince Albert, N.W.T.\nTransact General Banking Business.\nPost Office Box No. 17.\nBankers' Office.\nBranches at Regina, Saskatoon, Prince Albert, N.W.T., and Edmonton, Alta.\nBankers' Office.\nBranches at Regina, Saskatoon, Prince Albert, N.W.T., and Edmonton, Alta.\n\nTHE OLD RELIABLE.\nA LARGE SUPPLY OF THE GOOD OLD\nWEIGHT CLOCKS.\nOur line of\nKIRCH'S CLOCKS, WALTHAM ELGIN\nFine Inexpensive Specials.\nCall and see them at the\nPOST OFFICE JEWELLERY STORE.\nRepairing done neatly and warranted.\n\nR. B. WAY\nQUEEN'S HOTEL.\nLeading Hotel in Saskatchewan.\nT. O'HALLORAN'S store is informing the\nresidents of Prince Albert and the travel-\ning public that he has opened up his new\nstore in the basement where he will be\nglad to welcome all his old patrons and\nnew customers alike.\nFree table and attendance\ncard for all who attend.\nWell furnished rooms.\n\nTHOS. ORAM\nPRINCIPAL.\nPRINCE ALBERT\nFlaming Hills and\nSash and Door Factory.\nOur Sign and Makers.\nSash Doors, Frames, Blinds, Windows, and\nBuilding Fixtures made to order.\n\nA. GOODFELLOW\nBoots and Shoes.\nPrince Albert, N.W.T.\nSlippers, all sizes and kinds for\nLadies', Gentlemen's, and Children's.\nMoccasins, Overcoats, and Rubbers\nfor Ladies', Gentlemen's, and Children's.\nMitts, Gloves, Stockings, and Socks\nfor All Sizes and Kinds.\n\nSPECIALTY.\nGerman Rubbers and German Felt\nStockings, suitable for Travelers and\nLumbermen.\n\nCHEAP FOR CASH.\nSHANNON & McLEOD\nCall and See\nThe New Fall Stock of\nHATS & BONNETS.\nOffice: First Street.\nFurniture.\nFor the next thirty days I will sell at\n90 per cent less than cost.\n\nGILBERTE CARTER.\nWILLIAM KNOK,\nCARPENTER, ETC.\nOffice and Workshop.\nNear Presbyterian Church.\n\nBLACKSMITHING\nMcCALL BROS.,\nGeneral Blacksmiths.\nChurch Street.\n\nTHE MAYORALTY\n(By Special Telegraph.)\nYour vote and influence is respectfully\nextended for\nJOHN F. BETTS\nAs Mayor at the coming election.\nElection takes place on Monday,\nJanuary 3, 1887.\n\nCARD\nTo the Voters of the Town of\nPrince Albert.\nGentlemen:\nBeing unable at this season to make a\nspecial call upon each elector, I would ask\nall electors who can place sufficient confi-\ndence in me to use my influence and\nvotes in my behalf at the polls Monday\nnext.\nYours respectfully,\nT. J. AGNEW.\n\nSTRAYED!\nAbout six weeks ago, from St. Ann's\nConvent, was stolen a light red with\nsmall white spots on shoulder, lately\ncauled. The other dark brown streaked\nwith black, no handle, will be returned.\nAny person returning the same to the\nConvent will be rewarded.\n\nSTRAYED!\nStolen into the premises of Mr. Mac-\ndonald, at the Water Mill about the end\nof January, a tan and white spotted dog\nwith a red collar, will be returned on\npayment of expenses.\n\nA.C. PATTERSON,\nForwarding Agent.\n\nCITY CONFECTIONERY\nXMAS GOODS.\nLarge assortment of\nChristmas Toys, China Ware,\nDolls, Y's Sets, Shell Books.\n\nOYSTERS AND CIGARS\nR.T. GOODFELLOW.\n\nCALEDONIA BREWERY\nEAST END.\nThe proprietors of the above concern\nare prepared to supply families residing in\nthis part of town with beer, beer, beer.\nPrice 50 cents per quart, 10 cents per day,\nlarge at per gallon.\n\nWoollen and Dress Goods!\nA Billiard Table and Saloon\nIn connection with the above.\nThe best cigars always on hand.\n\nLIVERY & FE D'ESTABLE\nChas. Woodman.\n\nTHE TELEGRAPHIC CHIT-CHAT LOCALS.\nGathered by our Reporters.\n\nWEDNESDAY, Dec. 29.\nThe Ontario elections took place today\nand resulted in the return of the\nfollowing candidates: Mowat's majority\nbeing even greater than the last par-\nliament.\nMinisterialists—Algoma East, Lyon;\nAlgoma West, Conser; Caribou North,\nWhite; Beaver, Hargrave; Beaver South,\nO'Connor; Beaver Centre, Dock-\nbeverley; Beaver, Danby; Chamber-\nlain, Smith; Caribou North, Macdon-\nald; Caribou South, Pennefather; Essex\nNorth, Pennefather; Essex South, Ba-\ntton; Essex East, Murray; Grey County,\nBurton; Hastings East, Macdonald; East\nGlengarry, Haywood; Ross, Hardinge;\nBates; Kent East, Ferguson; Kent West,\nEast Grand River, Lambton West;\nMiddlesex West, Rose; Middlesex East,\nNorton; Norfolk East, Mosch; Norfolk\nWest, Newton; Oxford East, O'Brien;\nOxford West, McKay; Parry Sound,\nArmstrong; Peel, Chisholm; Peterboro-\nwest, Brown; Prince Edward, Smythe;\nRenfrew East, Murray; Renfrew South,\nMacdonald; Renfrew West, Bellfield;\nRenfrew North, Prince; Renfrew Centre,\nDenny; Simcoe, Mack; Waterloo\nNorth, Bayfield; Waterloo South, Bay-\nfield; Wellington East, Macdonald;\nWellington South, Gauthier; Wentworth\nEast, Murray; Wentworth West, Murray;\nYork East, Murray; York West, Murray;\nYork South, North, Wilkinson.\nOpposition—Abbotsford, Miller (not\nreturning); Almonte, Wilson; Antigonish,\nStewart; Durham East, Cona; Egerton\nWest, Ingram; Frontenac, Wightman;\nFrontenac East, Craig; Frontenac West,\nGravelle; Hastings East, Hartlage East;\nHastings North, Wood; Hastings West,\nWood; Huron East, Hamilton; Huron West,\nClancy; Kingston, Maclean; Lanark South,\nLanark, Macdonald; Lennoxville; Lan-\nark North, Macdonald; Lennoxville;\nMartinique, Martinique North, Smith;\nMartinique South, Martinique East,\nWilkinson; Middlesex East, Wilkinson;\nMiddlesex West, Wilkinson; Northumberland\nEast, Wyler; Northumberland West,\nWyler; Toronto East, Clarke; Toronto West,\nClarke; Victoria East, Ferri; Victoria West,\nFerri.\nMr. MacKay and D.H. Macdonald\nof Prince Albert, are in the city, and\nwill proceed home immediately.\nThe funeral of the late Governor Legge\nwill take place this afternoon at the Anglican\nChurch on Friday.\n\nWEDNESDAY, Dec. 30.\nThe religious delegates have arrived\nin Regina with a number of interesting id-\neas in their hands.\nAn important meeting of the British\nCabinet was held yesterday. Salisbury\nstated that the Cabinet had not yet\nreached a conclusion, and intimated that it\nwould still remain and would not give an\nanswer until the Cabinet had been\nconsulted.\nFinal returns—Ministerialists—East\nPetrolia, Richmond; Fairy Sound, Arm-\nstrong; Canterbury, Rockey; North\nBruce, Biggar; West Scott, Clancy;\nHastings North, Wood; Hastings West,\nWood; Huron East, Hamilton; Huron West,\nClancy; Kingston, Maclean; Lanark South,\nLanark, Macdonald; Lennoxville; Lan-\nark North, Macdonald; Lennoxville;\nMartinique, Martinique North, Smith;\nMartinique South, Martinique East,\nWilkinson; Martinique West, Wilkinson;\nMiddlesex East, Wilkinson; Middlesex West,\nWilkinson; Northumberland East, Wyler;\nNorthumberland West, Wyler; Toronto East,\nClarke; Toronto West, Clarke; Victoria East,\nFerri; Victoria West, Ferri.\n\nAn entertainment was given by the\nyoung ladies of Mrs. Carter at the close\nof the examination last night.\nAbout 400 people, ladies, gentlemen and\nboys attended the last term.\nInteresting little boys attracted the\neyes of many ladies and children who came\nin public schools are taught, as\nwell as French and other branches.\nA musical concert was given by the\nstudents for the benefit of Monday night.\nSaturday 1st the Vagrant Act 1890,\nwhich is in operation in the North-West\nTerritories, was discussed following the\nmeeting. Only two of the old Council were\nnominated as they did not wish for\nanother term.\nJ.F. Clark, Mr. Clark's Crossing, was\nelected for the Mayoralty, and Ald. Burrows, Dr.\nJames T. Agnew, A.B. Clark, J. L.\nJohnson, and Mr. Johnson, for Aldermen.\nThe election will be held next week.\n\nHappy New Year.\nJ.F. Clark, Mr. Clark's Crossing.\nIn town last week.\n\nThe grand opening of the Saskatchewan\nClub Christmas Eve.\n\nFive per cent discount on Xmas and\nNew Year's cards at Cain's bookstore.\nPocket and other shades for 188—\nbeautiful designs at reasonable prices.\nA concert will take place on the Sas-\nkatchewan Park next week from nine\nto eleven o'clock.\n\nService was held in St. Alban's Church\non Christmas Day, Rev. Mr. Wright of\nleading.\n\nThe declaration of the result of the\nMunicipal election will be made at\n12 o'clock on Tuesday.\n\nWagner's holiday sale of dry goods\nwill last ten days. Goods also\nmarked down.\n\nThe annual Rifle Association meeting\nwill take place on the 13th of January.\n\nThe T.A. Band played at the Anglican\nChurch on Wednesday, but the weather\nbeing very cold very few were present.\n\nThe roll of the Liberal Club was\nread at the meeting of the\noffice of the secretary, Mr. T. N. Campbell.\n\nMr. Burrows has a large stock of\nclothing, crackers, candles, sugar, beef\nmeat and pork on hand. No less dis-\nplays have been seen in years past.\n\nFuneral services were held at Mr. Joseph\nFuson's on the 29th of December, when\nit was announced that a number of our citizens\nwere laid to rest. A very enjoyable evening\nwas spent.\n\nThe first regiment of Government\nscouts was made by Mr. Lewis, of\nRegina, who has been engaged for\ntwo months in the business, and in\ncharge of which are 30 members of\nthe force.\n\nAbout 200 persons were on the roll of the\nschool conducted by the\nRev. Mothers of St. Ann's during the\npast year, and the average attendance\nwas 100.\n\nChristmas tree will be given, in the\nPresbyterian church, to anyone after-\nnoon who has children who are\nnot attending the singing practice for\nthe service.\n\nThe singing practice for the\nservice.\n\nAn entertainment was given by the\nyoung ladies of Mrs. Carter at the close\nof the examination last night.\nAbout 400 people, ladies, gentlemen and\nboys attended the last term.\nInteresting little boys attracted the\neyes of many ladies and children who came\nin public schools are taught, as\nwell as French and other branches.\nA musical concert was given by the\nstudents for the benefit of Monday night.\nSaturday 1st the Vagrant Act 1890,\nwhich is in operation in the North-West\nTerritories, was discussed following the\nmeeting. Only two of the old Council were\nnominated as they did not wish for\nanother term.\nJ.F. Clark, Mr. Clark's Crossing, was\nelected for the Mayoralty, and Ald. Burrows, Dr.\nJames T. Agnew, A.B. Clark, J. L.\nJohnson, and Mr. Johnson, for Aldermen.\nThe election will be held next week.\n\nAn entertainment was given by the\nyoung ladies of Mrs. Carter at the close\nof the examination last night.\nAbout 400 people, ladies, gentlemen and\nboys attended the last term.\nInteresting little boys attracted the\neyes of many ladies and children who came\nin public schools are taught, as\nwell as French and other branches.\nA musical concert was given by the\nstudents for the benefit of Monday night.\nSaturday 1st the Vagrant Act 1890,\nwhich is in operation in the North-West\nTerritories, was discussed following the\nmeeting. Only two of the old Council were\nnominated as they did not wish for\nanother term.\nJ.F. Clark, Mr. Clark's Crossing, was\nelected for the Mayoralty, and Ald. Burrows, Dr.\nJames T. Agnew, A.B. Clark, J. L.\nJohnson, and Mr. Johnson, for Aldermen.\nThe election will be held next week.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.,\nFRIDAY, DECEMBER 31, 1866.\n\nTHE OLD YEAR.\nThe old year goes away like a shadow, and there are many hopes will be realized with the east. It enters into the abyss of the dead, taking with it all our dreams and hopes for a considerable time. The world has come into its own, and we, as people, have peace with itself and Wigner. And yet, notwithstanding these prophecies, people's attention. Some great men, however, in all ages have been looked upon as fools who will live in history for all time to come. But with the years we come and with them there are new hopes and dreams. All we have to do is to believe what we see here, a blessing. Time turns its wheel without the notice and the pride of the people around us.\n\nMUNICIPAL ELECTIONS.\nIf we are not fortunate enough to secure a good Council for the ensuing year the people of Prince Albert will be to blame, as they have always been accustomed to select a sufficient good majority out of which to select five good men. We will see how the election will turn out in their favor, and that the municipal interests will be allowed to be in the hands of those who are in the know.\n\nTwo weeks ago the ballot, so that there was no possibility of it being altered by the electors. We called attention some weeks ago to the fact that by the amendment made to the Municipal Act (1864) has been left to Municipal Councils to decide whether or not they have paid their taxes shall affect them at Municipal elections, but we do not know whether they go in force immediately. At all events, it will be necessary to take action now, and those who have not paid their taxes ought to appeal in the matter of the ballot now coming up. There are, we understand, about 125 names on the voters' list, of which about 60 names are registered property. The poll will open at nine o'clock Monday next, in the Council Chamber, and close at 3 p.m.\n\nHALFBREEDS SLANDERED.\nHon. William Laurier, the leader of the French Liberals, and a man who boasted that he would have done had he been on the banks of the Saskatchewan when the rebellion broke out, made a speech yesterday afternoon before the Delegates of the various provinces, where he attacked the halfbreeds and the causes that led to it. After referring to the history of the halfbreeds, he said that they showed unwavering loyalty to British institutions since they became British subjects, he had been asked why he refused to show the same courage as if he had his rifle on his shoulder, and rolled from off his silvery tongue a ringing, contemptuous slander against the Métis.\n\n\"You may say that the wretched halfbreeds are not fit to be compared to the heroes of British history. If you say so, so do I.\"\n\nWe have reason to print some hard things about the halfbreeds, but it is known to be false, that the Roman Catholic party has been the most slander against them than belongs to Mr. Laurier. We do not know how far they would go to defend the halfbreeds would compare with the \"heroes of British history,\" but we know that, but for the Roman Catholic party, the halfbreeds like Laurier would have not have broken their record as a possible, Christian and patriotic people. They are doing just what ought to be done, and they are doing it.\n\nONTARIO ELECTIONS.\nThe interesting question involved in Mr. Mowat being sustained by an increased majority. To those who are convinced that Mr. Mowat is the Premier of Ontario, and the somewhat similar course pursued by the Mold of Prince Albert, may be justified. Since Mr. Mowat obtained power he has endeavored to strengthen his hands by every possible means. He has been very persistent in his efforts to get the Imperial government to recognize the Municipal Councils that would give him power over the liberties of the people. He has been persistent in his efforts to point out the Inspectorate, and by that means has been able to control over the Imperial elections. He has been doing everything and anything to make Oliver Mowat and his colleagues life rulers of this province. In view of the evidence of change of policy on the part of the Mold of Prince Albert, and the support of local opinion to a radical Federationist, we feel justified in predicting that the Liberal candidates into office will be very few indeed. But as it is impossible for Mr. Mowat to complete as possible, the Mold took to doing the Separate School system on Ontario. The Separate School system on Ontario is a device to drive the Roman Catholics and driving the Roman Catholics away from the schools, as it has been the case in the past.\n\nTo add to his prestige came the sudden change of policy on the part of the Mold. He became a supporter of local opinion to a radical Federationist, which will enable him to drive those who were opposed to prohibition and the licensed saloonists into the ranks of the anti-prohibitionists whom they loved the latter more, but because they loved prohibition less. But as it is impossible for Mr. Mowat to complete as possible, the Mold took to doing the Separate School system on Ontario. The Separate School system on Ontario is a device to drive the Roman Catholics away from the schools, as it has been the case in the past.\n\nCOMMUNICATIONS.\nHE RISES TO EXPLAIN.\nFor the Editor of the Times.\nSir,—Mr. J. F. Coley, of Clarke's Crossing, who passed through here a few days ago on his way to Prince Albert, spoke to me a half hour ago, and has been circulating falsehoods in relation to me that are more nearly than the pack of cards that he used to throw at me. These statements of Mr. Clarke are made with a view to injure me with the electors of the district in gratitude for his petty political services. I do justice to and find for the information of the public who do not know the motives that prompted the remarks, I state that Mr. Clarke has been here and at other places he has said that I can only take one vote in the election. I believe that it is not in my best interest to say anything less than a dozen votes, as it is easy for me to get Mr. Mowat's version. I submit a few extracts from the speeches made by Mr. Clarke at the meeting the evening before, the 20th inst., and also for your publication, if it does not trespass too greatly upon your limited and valuable space.\n\nYours respectfully,\n\nN. B. Stewart, Dec. 29, 1866.\n\nA meeting of the electors of this district was held in the schoolhouse this morning, for the purpose of considering the question of nominating a candidate to the House of Commons. After some discussion, Mr. Peter Stobart, President, as proposed by Mr. Peter Latham; Mr. Molloy was nominated by Mr. Tracey, seconded by Mr. Stewart, and Mr. Molloy, taken by ballot Mr. Molloy was declared by the chairman to be the choice of the meeting. Mr. Tracey then moved that this nomination be made unanimous, which was carried. The following gentlemen were nominated for the position: Messrs. Tracey, McMillan, Molloy, Latham, and Stewart.\n\n(Signed) J. N. Guthrie, Chairman.\n\nF. W. Kain, Sec.\n\nI did not attend that meeting to secure a nomination as stated publicly there, but to urge the electors to use their votes for one man when the time came, and in this I was generously aided by Mr. Tracey, and the movement of my nomination unanimous was most cheerfully received and enthusiastically carried.\n\nYours respectfully,\n\nB. J. Molloy.\n\nLt. Governor Dewdney has gone to Ottawa and other eastern points.\n\nTHE WEST END STORE\nLadies' Six-Button Kid Gloves in White, Cream and Delicate Shades, and Full Lengths do in Silk Thread, just received at\nCHAS. MAIR'S WEST END STORE,\nalso Fashionable Laces in Cream, White and Black.\nA select assortment of Christmas Cards, very artistic, and at prices which everybody can afford to pay.\n\n'79. '86.\n\nCLEARING SALE!\nALL REMAINING PARLOR STOVES AT COST.\nT.J. AGNEW.\nWM. STOBART & CO.\n\nGeneral Merchants\n\nIndian Traders.\n\nWM. STOBART & CO.\nG.D. NORTHGRAVES, J. SINCLAIR & CO.\n\nWatchmaker and Jeweller,\nAt T N Campbell's New Shop\n\nNEW GOODS!\nJUST ARRIVED.\n\nALASKA STOCK OF Watches, Clocks and Jewellery\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\nCOME THIS WAY!\n\nNo Deviation in the Path that Leads to the\n\nBUSIEST STORE IN THE COUNTRY\n\nOur Patronage is Daily increasing, and why Is there a reason for it, or does it merely happen that to-day our trade is much larger than yesterday, and to-morrow it will be larger than to-day? We know this is a community of sensible people, who not only have a reason, but a good one, for any acts they commit. When you see increasing numbers flocking to a particular store!\n\nYou can put it down as a fact that there is something there worth having. One or two may be deceived, but a crowd is never misled, and this growing trade of ours is positive proof that we have won the confidence of the public. We are the friend of every economical buyer of\n\nStaple and Fancy Dry Goods,\nDress Goods, Silks,\nMantles and Carpets,\nGent's Furnishings and\nReady Made Clothing.\n\nALSO FULL LINES OF\nGENERAL GROCERIES\n\nWhich will always be found unsurpassed in quality and price.\n\nFlour, Feed & Provisions\n\nALWAYS IN STORE\n\nOur Stock in this Department is simply immense, and is one of the best assorted in the North West. Just opened out, another large lot of\n\nChina Tea Sets and\nPainted Granite Ware\n\nDirect from the old country. All new Styles and Patterns, and Prices Low.\n\nGLASSWARE\n\nIn Endless Variety. An examination of our stock is respectfully solicited.\n\nFarmer's Produce taken in exchange\n\nHighest Prices Paid for Furs.\n\nWe value your patronage, and we want it. When you come into our store, our anxiety is to look to your best advantage; to please you, to save money for you, and to make you feel that it is to your profit to trade at\n\nJ. M. CAMPBELL'S\nGreat General Store of Prince Albert\n\nT. N. CAMPBELL.\n\nHOLIDAY FANCY GOODS!\n\nTHE LATEST NOVELTIES IN\nPlush, Brass, Bronze and Hand-Painted Goods\n\nNEVER BEFORE INTRODUCED INTO THE COUNTRY, COMPRISING:\n\nODOR BOTTLES,\nFANCY MIRRORS,\nPOLISHED IRON NOVELTIES,\nTAYLOR WASTE BASKETS,\nWALL PITCHERS,\nWHISK HOLDERS,\nGENT'S DRESSING CASES,\nWATCH RECEIVERS,\nPIPE RACKS,\nPHOTO ALBUMS,\nPHOTO FRAMES,\nAUTO ALBUMS,\nCARD CASES,\nHAND PAINTED BOOKLETS,\n\nHOLIDAY GIFT BOOKS,\nSTANDARD POETS IN CLOTH,\nSTANDARD NOVELLS Dickens, Victor Hugo, Wilkie Collins, Lever, Dunsany, E. P. Roe Works,\n\nBOYS' OWN ANNUAL,\nGIRLS' OWN ANNUAL,\nRUTLEDGE'S BOYS' ANNUAL,\nCHATTERBOX,\nCHILDREN'S FRIEND,\nLITTLE WIDE AWAKE,\nCHURCH SERVICES AND BIBLES.\n\nLATEST NOVELTIES IN\nXmas Cards and Souvenirs.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\" \" Over 10 feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security or LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nCHRISTMAS EVE AT ST. CATHERINE'S.\n\nA very enjoyable evening was held at St. Catherine's on Christmas Eve, the occasion being an entertainment provided by Miss McGregor for her pupils in the parish. The children were all present—some in body and behaved with great decorum—the very youngest being, like Tiny Tim, \"as poor as a gold.\" There was a large attendance of parents, who filled the church being quite filled, even after temporary seats had been placed from time to time. One Carol greeted us, and the utmost good humor prevailed throughout.\n\nAdded by numerous friends to the district and in Prince Albert, Miss McGregor had been successful in providing a Christmas tree loaded with gifts from abroad to be seen every day in the Northwest. Mr. Inskster acted as Father Christmas and, with his wife, Mrs. Inskster, soon stripped the tree of its load, and the delighted eyes of the youngsters as they opened their presents were a joy to study. The articles for distribution have been selected with care and judgment and are sure to give much satisfaction, receiving some notice at once useful and ornamental along with a Christmas card and a gift. The children were most enthusiastic about the gifts, and the parents, too, were pleased with the selection made.\n\nEAST END SCHOOL ANNUAL EXAMINATION.\n\nThe Christmas examination of the pupils attending the school was held in the schoolroom on Friday, December 21st. The examiners were Messrs. McLeod, Robert Robertson, and Mr. McKenzie. The teacher conducted the examination in a most satisfactory manner, and received great praise from all present for the marked improvement shown by the pupils. The answers to all subjects had been gone through by the principal, and were distributed by the teacher. Each child was given a certificate acknowledging the satisfactory manner in which he had answered the questions.\n\nHIGH SCHOOL EXAMINATION.\n\nThe Christmas examination of the Prince Albert High School took place on Friday, December 21st, in the presence of quite a number of parents of the pupils and others interested in the welfare of the school. The following classes were examined in Reading, Arithmetic, Algebra, Latin, French, English Grammar, Geography, Voice Music, and Drawing; the correctness of the answers given, in most instances, bearing witness to the thoroughness of the instruction received. After the conclusion of the examination by Bain, who occupied the chair, the students were dismissed on the understanding that those who had failed in any subject would be allowed to remain by the influence of the parents. After Christmas cards were distributed, the school was closed until January 1st. It was announced that the class would reopen on Monday, December 31st, 1886.\n\nST. LAURENT.\n\n(Special to The Prince.)\n\nMr. R. J. Molloy addressed a meeting of the electors here this afternoon. Representing the present town of St. Louis, Mr. Molloy spoke of the importance of the election to be held next month. After hearing Mr. Molloy, who strongly urged unity of action on the part of the electors, Mr. Molloy stated that he would resolve that the vote in this district should be united, and to this end would meet with the members of the district between the 15th and the 10th of January, to which Mr. Molloy has been invited. He was also invited to attend a mass meeting at Buffalo this evening.\n\nTHE BAKING POWDER.\n\nThe competitive examination for the silver medals was presided over by Mr. John Stewart and John Macdonald, one to be awarded to the competitor making the highest percentage and the other to the boy making the highest percentage, took place on Saturday, December 21st. The Inspector, Rev. Canon Pitt, examined each class in the various branches handled.\n\nThe following list of competitors was presented to the successful applicants at the opening of school. Agnes Thompson, of the Second Class, and Willie McLeod, of the Second Class, were the only competitors. Following is a list of those who made over 50 per cent., each class being represented by two pupils:\n\nSenior Div., 1st Part.—James McLeod, Willie McKenzie, Robert Robertson, and Mr. McKenzie.\n\nJunior Div., 2nd Part.—James McLeod, Alice Stewart, George Macintosh, Sarah Ann Sherr, Jessie Macintosh.\n\nJunior Div., 3rd Part.—Edward Gordon, William Carter and William Campbell, equal; Virginia McKay, Douglas Murray.\n\nSenior Class.—William MacBeth, Harry Robertson; Joseph Macdonald and Frank Robertson, equal; Arthur Jardine.\n\nThird Class.—Margaret Murray and Edith Gordon, equal; Arthur Way, John McLeod, Anne Cameron, Ada Murray, James Murray, and William Murray.\n\nFourth Class.—Agnes Thompson; Geo. Ballantine and Bella Dilworth, equal; Win. Murray, Anna McGaffer.\n\nA scratch curling match took place on Christmas afternoon between the teams, consisting of members of the Saskatoon curling club, Messrs. Sanderson and Nelson against Mr. Murray and Thomas Murray. Though the weather was exceedingly cold, the players seemed to enjoy themselves. Mr. Sanderson's team were victorious.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Bowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York. Send 10¢ for catalogue.\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nBUTCHERS.\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and\n\nGAME IN SEASON.\n\nBranch Store—Qu'Appelle Station, Prince Albert.\n\nBRUSSELL & DAVIS.\n\nBROWNS BRICK STORE.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\n\nSideboards, Cupboards, Bureaus,\n\nWashstands, Sofas, Easy Chairs,\n\nBedsteads, Mattresses, Co's, Cradles,\n\nAnd all kinds of Chairs, Etc., which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSaloon, First Door West of Bank.\n\nW. B. GOODFELLOW.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886123101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 7091, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 10754, 1], [10754, 19011, 2], [19011, 21969, 3], [21969, 27913, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]