[{"id": "1c5b35d8a68ed81e40717f6c13b449c407f3e610", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nVOL.7.-NO.9.\nPRINCE ALBERT, SASK., FRIDAY, FEBRUARY 1, 1889.\n$2.50 A YEAR.\n\nBANKING HOUSE\nOF Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest allowed on Deposits.\nNotes Discounted.\nDrafts Issued at all points in the Dominion.\nCommissions undertaken and promptly returned to.\nBANKERS—Merchant's Bank of Canada\n\nWILLIAM V. MACLURE,\nAdvocate, Notary Public.\nPrince Albert, Bank, N.W.T.\n\nBREWSTER & ROYALTY,\nAdvocates, Solicitors, Notaries Public,\netc., etc.\nPrince Albert, N.W.T.\n\nH. W. NEWLANDS,\nAdvocate, Notary Public.\nPrince Albert, Bank, N.W.T.\n\nW. H. GUNN, M.A.,\nAdvocate, Notary Public, Conveyancer.\nPrince Albert, N.W.T.\n\nC. R. STOVEL,\nDENTIST.\nOffice near the Hotel's Hall's Office.\nPrince Albert, Bank, N.W.T.\n\nJ. LESTOCK REID,\nDominion Land Surveyor.\nPRINCE ALBERT, N.W.T.\n\nA. C. PATTERSON,\nForwarding Agent.\nAll goods intended to be shipped immediately will be forwarded by express.\nPlease special attention and be forwarded as soon as possible.\nA. C. PATTERSON\n\nROBERT THOMSON,\nSign and Ornamental Painter.\nCalligraphy and Paperhangings on Short Notice.\nDecorative Painting a Specialty.\nROYAL MAIL STAGE CO.\nWeekly service to Regina division and Prince Albert.\nEvery Wednesday morning and Saturday afternoon.\nExpress Office at the Post Office.\nLEONARD & SCOTT.\n\nROBT. BUCKLEY,\nAuctioneer, Accountant, Estate and General Agent.\nHas on hand a number of Town Lots which will be sold on very easy terms.\nAlso some Improved Farms.\n\nQUEEN'S HOTEL\nT. ORAM, Proprietor.\nLeading Hotel of Saskatchewan.\nHandy by day or week.\nThe Bar is stocked with the finest brands of Otago, New Zealand and Blackwood beer, Burgundy, Old Dutch.\nEvery attention paid to the travelling public.\n\nTHE S.S.S. LAUNDRY.\nGIVEEN & STARFORTH\nPoveshell's Laundry.\nAddress: Prince Albert, N.W.T.\n\nTEACHER WANTED.\nRed River College School No. 17.\nApplicants to make application, certificates and testimonials.\nSalary open.\nApply to Mr. J. W. Agnew, of Prince Albert.\n\nSTRAYED.\nCame on to my premises about the 1st of last November.\nTwo Heifers\nOne was two years red mixed with grey; white belly.\nThe other rising three years, red with white spots; no horn to keen.\nOwner has same on proving property and paying expenses.\n\nWM. HUTCHISON\nMORTGAGE SALE OF\nValuable Town Property.\nUnder and by virtue of the power of sale granted me by the mortgagee, I hereby give notice that the said property will be sold at public auction on the 1st day of March, 1889, at 10 o'clock A.M.\nWM. SHANNON & CO.\nIn the Town of Prince Albert on\nSaturday, the 3rd of March, 1889.\n\nQUEEN'S HOTEL\nIn the Town of Prince Albert on\nSaturday, the 3rd of March, 1889.\n\nP. LAFOND\nMillinery\nNEW Winter Goods\nJust Received at\nMRS. A. S. STEWART'S\nDress & Mantle Making a Specialty\nAnother Nice Lot of\nWatches, Rings.\nSteer Buttons, etc.\nPost Office JEWELLERY STORE\nCall and examine and see how much your watch needs to correct standard time.\nR. B. WAY\nMarriage Licences Issued.\n\nNOTICE\nApplications will be made at the next meeting of the Board of Education for the position of Teacher in the School District No. 17, Prince Albert, N.W.T.\n\nS. M'LEOD & CO.\nNew Bakery\nL. R. ST. LOUIS\nConfectioner\nF. A. C. Band\nLeader of the Prince Albert Quartet\nTo be engaged for various Music for Dinner, Concerts, Banquets, Balls, etc.\nSpecial attention given to all parties of the town.\nApply personally to\nTHOS. ORAM, L.R. ST. LOUIS, H. MCCOLL\n\nCHIT-CHAT LOCALS.\nGathered by our Reporters.\n\nNew Goods arriving daily at Fish's.\nT. T. T. Try out our T. Walters & Sons.\nH. Mitchell, M.L.A., Duke Lake, is in town.\nMr. Butte, M.L.A., is taking a tour through the country visiting his constituents.\nMr. McCrum, who has been in town on a business trip, is now back, having returned to his home in Duke Lake.\nThe public school at this end of the town has been well attended all winter; last night there were 26 pupils present, and an average attendance of 24.\nSergio Montgomery and Billie Walker are in town a few days ago, the former from Saskatchewan, the latter from British Columbia.\nSergio Montgomery has been employed in the detachment of Saskatchewan detachment of the North West Mounted Police.\nThe Indians have been winter goods will be sold at cost.\nWe are doing a Grey Flannel at $2 per yard, Lamb Caps for $1, Lambskin Coats, $2, Tweed Suits for $10, Ladies' Hats $1.50, Ladies' Overcoats $1. All other winter goods will be cut in same proportion.\nWalters & Sons.\n\nS. W. Vaillancourt is around getting signatures to a petition addressed to the Minister of Interior asking for a post office at the mouth of the South Branch.\nThe petition is being numerously signed.\nMr. Vanier, who lives at the mouth of the South Branch, has been asked by the Indians to take charge of the post office.\nHe will put two runs of stamps.\nThe tellers are changing in every tenth banker for greater safety, too late for chopping.\n\nGlaucoma is very prevalent in this section, and many cases are brought here for treatment.\nThere has already been several horses lost, some of them burned or killed when the Indians had a big feed of glaucoma horse whiskey.\nIt is thought that something should be done to stop these people from using the damned cayuse, and also to prevent the spread of the disease.\n\nI would like to call the attention of the council to the fact that they should provide a better place in the council chambers for their representatives to account of the proceedings of the council meetings.\nTherefore our young men and women on the bench, who are the most likely to get into a scrape, to get nearer he had to content himself with the smallest hall, or else to wait until the council adjourned.\nIt is important to the interests of the clerk to make extracts from the minute book.\nPlease get a chair for the clerk.\nThe Hon. Mr. Justice McKeown held a session of the Supreme Court this morning.\nThe only case to be disposed of was the case of Mr. Smith vs. Mr. Smith (The Gentleman) charged with the larceny of four dollars from Russell & Davis.\nThe defendant was a man of about 40 years of age, with bad reputation.\nAfter the charge had been read, the prisoner pleaded guilty to the indictment.\nHe was committed to the N.W.T. Police barracks for three months at hard labor.\nJames McKay represented the prisoner for the prosecution.\nMr. John Miller and John Little Cow, a Sioux, acted as interpreters.\n\nWhy not send reinforcements rising from caterers who want Rain will come soon?\nA. H. Derry, Barnacktown, Ont.\nsays—I received a letter from Mr. Smith, who is now highly interested in the gold in the bend and catchment.\nIt will effect a cure very quickly.\n\nAre you interested in the right and honors of the Order of the Garter? If so, apply to the Secretary of the Order of the Garter, who is now highly interested in the gold in the bend and catchment.\nIt will effect a cure very quickly.\n\nTHE S.S.S. LAUNDRY.\nGIVEEN & STARFORTH\nPoveshell's Laundry.\nAddress: Prince Albert, N.W.T.\n\nTEACHER WANTED.\nRed River College School No. 17.\nApplicants to make application, certificates and testimonials.\nSalary open.\nApply to Mr. J. W. Agnew, of Prince Albert.\n\nSTRAYED.\nCame on to my premises about the 1st of last November.\nTwo Heifers\nOne was two years red mixed with grey; white belly.\nThe other rising three years, red with white spots; no horn to keen.\nOwner has same on proving property and paying expenses.\n\nWM. HUTCHISON\nMORTGAGE SALE OF\nValuable Town Property.\nUnder and by virtue of the power of sale granted me by the mortgagee, I hereby give notice that the said property will be sold at public auction on the 1st day of March, 1889, at 10 o'clock A.M.\nWM. SHANNON & CO.\nIn the Town of Prince Albert on\nSaturday, the 3rd of March, 1889.\n\nQUEEN'S HOTEL\nIn the Town of Prince Albert on\nSaturday, the 3rd of March, 1889.\n\nP. LAFOND\nMillinery\nNEW Winter Goods\nJust Received at\nMRS. A. S. STEWART'S\nDress & Mantle Making a Specialty\nAnother Nice Lot of\nWatches, Rings.\nSteer Buttons, etc.\nPost Office JEWELLERY STORE\nCall and examine and see how much your watch needs to correct standard time.\nR. B. WAY\nMarriage Licences Issued.\n\nNOTICE\nApplications will be made at the next meeting of the Board of Education for the position of Teacher in the School District No. 17, Prince Albert, N.W.T.\n\nS. M'LEOD & CO.\nNew Bakery\nL. R. ST. LOUIS\nConfectioner\nF. A. C. Band\nLeader of the Prince Albert Quartet\nTo be engaged for various Music for Dinner, Concerts, Banquets, Balls, etc.\nSpecial attention given to all parties of the town.\nApply personally to\nTHOS. ORAM, L.R. ST. LOUIS, H. MCCOLL\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETCY\nPRINCE ALBERT N. W. T.\nTERM — $200 per annum in advance.\nAll letters to be addressed to the Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Alban’s Church — Services, 11 a.m., and 7 p.m.; Sunday School, 6-8 p.m. at the Church.\nCanaan Church — Services, 9 a.m. — Ser., Canon R. C. Browne; Rev. H. M. MacKay.\nMcKay Church — Services, 10 a.m. — Ser., Dr. McKay.\nMethodist Church — Services, 10 a.m. — Ser., Dr. McKay.\nPresbyterian Church — Services, 10 a.m. — Ser., Dr. McKay.\nThis Paper may be had by subscription at:\nR. C. Wigmore & Co., Newspapers Advertising Agency, Prince Albert.\nContracts may be made for advertising in this Paper.\nNEW YORK\n\nFRIDAY, FEBRUARY 1, 1889\n\nSASKATCHEWAN INSTITUTE.\nAs will be seen by our report in another column, a historical and scientific society has just been organized in town under the name of the \"Saskatchewan Institute.\" The formation of such a society marks an important step toward progress. It has been organized under the most favorable auspices; it has a wide field to work in and must if properly conducted be of inestimable benefit to the country and to the advancement of science and learning. It is fortunate in having among its officers members of much ability, of education and of literary and scientific attainments. During the winter months short papers will be read on various literary and scientific subjects, and in the summer the work of the society will be more particularly directed to field work. We hail with pleasure the organization of the Saskatchewan Institute, and trust that everyone in the district will take a keen interest in it and contribute what they can to its success. Now that the initiative has been taken and the Institute formed no scruples or fears should deter any person from joining and taking a deep interest in the work.\n\nOn the subject of railway settlement there seems to be somewhat blighted hopes. A report has come to hand evidently on good authority, to the effect that the negotiations between the C.P.R. and Regina & Lake Road have fallen through and that no contract will be signed with the latter company until after the present election. If such be the case this district will be in a bad plight, we have pointed out time and again that a railway is an absolute necessity. That without one we cannot remain connected except to starve. We consider that we are not being fairly treated by the Government in this respect, and that if some immediate action is not taken we shall lose our railway communications in this direction. If the same serious settlement will cease to exist. If terms cannot be made with the Regina Road an offer should be made to the Manitoba & North Western and to that made to the R.C.L.R. Railway, which if it is not sufficient we consider that a cash subsidy should be given to any line that will come into Prince Albert and Bitter Creek at once.\n\nAnother matter requiring the attention of the Government is the necessity of a post office and other public buildings at this point. The building now being used for a post office, besides being very unsafe, does not give the convenience and accommodation required. All other Government offices here are in the same fix. The Government pay about $300 per annum for the buildings at present in use. They can borrow money at five per cent, and $300 would pay the interest on $15,000. Ten thousand dollars would erect a block which would be ample sufficient for all purposes for a number of years, and then about $300 would be saved to the community. With such a block, and proper heating and lighting arrangements would be made in fuel, the buildings now in use are so poorly built as to require an uncalculated expenditure for heating purposes. If we cannot get a railroad the authorities will still do us this especial act; it will make a saving in the end to the Dominion.\n\nAfter the lapse of seven months the expenses of the Legislative Assembly elections have been paid.\n\nThe official report just published shows a surplus of $3,000,000 in the Dominion treasury for the past financial year.\n\nTHE TORONTO WORLD\nIs absolutely the best daily Paper in Canada.\nThe Toronto World is the only Paper in Canada which is not only printed but also bound, delivered, and distributed throughout Canada.\nIt is printed twice daily, and sent to every part of the Dominion.\nIt is the only Paper which is sold in every part of the Dominion.\nIt is the only Paper which is delivered to every part of the Dominion.\nIt is the only Paper which is bound, delivered, and distributed throughout Canada.\n\nCampbell's Cathartic Compound\nTonic Elixir\nBaking Powder\nCardigan Jackets\nPea Jackets\nRemnants of Carpets\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Mocassins\nA Paying Investment.\nFrames Our Stock.\nR. C. WIGMORE & CO.\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nRobertson & Robertson,\nMerchant Tailors\nGENTS FURNISHINGS\nImported Tweed Uitings,\nTrowsering and Overcoating\nWORSTEDS,\nIn English and American Lining.\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion.\nSUMMER SUITINGS\nIn all grades\nRobertson & Robertson.\nTERRITORIAL NEWS\n\nFORT MACLEOD.\n\nFrom the Gazette, Jan. 12.\n\nA few of Mr. David French's friends giving him a banquet on Tuesday night. Lord Governor Royal will be present.\n\nWhile Mr. A.F. Grady was making a Monday night, he had a fall tall. He suffered considerable from the effects of it Monday night.\n\nThe Queen on, Readers, adjourned from a new stage at Calgary on Saturday last, and the trip has created no little interest and even excitement in the town. The new stage is the first driver of an old Calgary stage, the proprietor being Mr. John Macdonald. The trip was made last week, the stage was loaded by police, barrel and trunk containing liquor was found. The whole carft was seen and taken to the police station, where the man placed under arrest. The team and wagon were released and taken to Stand- man's store at the same time. The man was told that the driver, Readon, knew nothing of the contents of the barrel and trunk. Neither he nor the pro- prietor of the stage was charged. The stage was delivered to the police station, loaded on the stage. They were delivered at the stage office in Calgary, and handed over to the police. The stage was fined $100 and costs and the team and stage, which did not belong to him, confiscated. A police constable was sent to Standman's store to take the team and wagon. Acting under orders Standman refused to give up the team until the bill for fine and costs was paid. The police went to the barracks for fur- ther instructions, and Sup't Macdonald was ordered to send the team and wagon. Standman still refuses, the police taking forcible possession. The case has been appealed. Mr. Haultain for defendant.\n\nEDMONTON.\n\nFrom the Bulletin, Dec. 8.\n\nStill no snow, no zero weather, no thaw to be expected.\n\nJ.D. Wilson, of the H.R. Co., Victoria, has been appointed postmaster of Elkano at that point.\n\nApplication for a license was made yesterday by Joseph Gribbin on behalf of several half-breeds at St. Albert, who are said to be in a destitute condition. They are said to have been refused the Indian treaty in 1853-56, and who have never become entirely self-supporting.\n\nThe dog advertised as lost by W. Hirding, of Edmonton, was returned to him at Stony Plain on Saturday evening within six hours after the first appearance of the advertisement. The dog, described as a couple of months old, by Dr. Wilson has also been recovered. The moral is plain.\n\nQU'APPELLE.\n\nFrom the Vindicator, Jan. 17.\n\nA cold wave has struck this part of the North-Western the worst. The thermometer touched 25° below zero on Monday morning.\n\nMr. Thistle, the bootmaker, has arrived in town and is busy engaged in building a house for the use of the looking club next season.\n\nOn the 2nd inst., J. B. Lash, agent at Battleford's agency, appeared before the court charged with having been employed by the employees of the Indian Depar- tment, in his agency, and presented with a sufficient bond to serve and an address.\n\nThe warrant against Mr. Karras, as coun- sel for Ward No. 2, the city of Edmonton, has been posted on the ground that he does not own the land for which he has been assessed, but has never having performed his entry thereof.\n\nBATTLEFORD.\n\nFrom the Herald, Jan. 12.\n\nFor a wonder, there were no permits by the last express.\n\nWhooping cough is quite prevalent amongst the children in town.\n\nThe school board meeting continues tomorrow to Monday next for the purpose of arranging for the Protestant school district of Battleford.\n\nOn Monday's stage arrived Mrs. Morley and two children, from Indiana. On Wednesday she was married to James Grant, of this place.\n\nPosters are now announcing the holding of an \"Old Folks' Concert\" in the recrea- tion room of the M.W.M.P. at barracks on Thursday evening, February 1st. The proceeds are to be devoted to the funds of the Presbyterian Church. The pro- gramme is said to be an interesting one.\n\nCALGARY.\n\nFrom the Tribune, Jan. 16.\n\nG.C. King, who has just returned from Australia, says that he heard that the Cal Company were bringing in (G.C.) a color to work at the mines, is quite incensed. He says that the men brought in to do work which they could not do, and that the management of the company have no intention of work.\n\nA magnificent bible in two volumes, beautifully bound, with Derek Hamilton's name on the cover, was presented to the reverend father superior of the Franciscan Fathers of Edmonton, by Mr. J. F. Hamilton, of Edmonton. The book was presented by Mr. Hamilton, who will carry the book around for inspection.\n\nC. D. NORTHGRAVES.\n\nWatchmaker and Jeweller,\n\nAt 1 N. Campbell's new store.\n\nA LARGE OCE OF Watches,\n\nClocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nW. STOBART & CO.\n\nIndian Traders\n\nAND\n\nGeneral Merchants.\n\nPrince Albert and Duck Lake\n\nSASK.\n\nPaine's Celery Compound\n\nCURES Nervous Prostration, Nervous Weakness, Debility, Nervous Indigestion, and all affections of the Nervous System.\n\nWEAK HEAVES\n\nPaine's Celery Compound is a great Tonics for the Nervous System. Contains Celery, Carrot, and other vegetables, it speeds up the digestion and strengthens the system.\n\nRHEUMATISM\n\nPaine's Celery Compound restores the body to health, which means rheumatism, and removes the tend- ency to rheumatism. It is the best remedy for rheumatism.\n\nKIDNEY COMPLAINTS\n\nPaine's Celery Compound restores the kidney to health, which means kidney troubles, and removes the tendency to kidney troubles. It is the best remedy for kidney troubles.\n\nDYSPEPSIA\n\nPaine's Celery Compound strengthens the digestive organs, which is why it cures even the most obstinate cases of dyspepsia.\n\nCONSTIPATION\n\nPaine's Celery Compound is not a laxative, but a tonic for the digestive organs. It cures the constipation. It is the best remedy for constipation.\n\nRecommended by physicians and business men.\n\nPrice 50c. field or 90c. bottle.\n\nWELLS, RICHARDSON & CO., Prop'ts.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Sask., Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 10 Spruce St., New York City.\n\nG. H. CAMPBELL\n\nGENERAL\n\nRailroad & Steamship\n\nTICKET AGENT,\n\n771 MAIN STREET, WINNIPEG, MAN.\n\nAgents for all Lines, as under:\n\nAtlantic,\n\nDominion,\n\nNorth German,\n\nWhite Star,\n\nCanadian Pacific,\n\nCanadian National,\n\nFrench Line,\n\nAmerican Line,\n\nand every other line crossing the Atlantic or Pacific.\n\nPublication of \"Campbell's Handbook of Rates,\" containing rates of all lines, with Time Tables and railway data. Send for it.\n\nADVERTISING FOR NEWSPAPERS.\n\nAdvertize your goods throughout the world.\n\nPREPAID TICKETS.\n\nTo bring your family to Canada or the United States.\n\nHORSE AND CATTLE DRAFTS\n\non all points in Great Britain and the Conti-\n\nnent.\n\nSend for our circular for the rate by\n\nC. H. ROWELL,\n\n10 Spruce St. and G.P.O., Dept. Winnipeg.\n\nA Dead Drop!\n\nPRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of\n\nLUMBER!\n\nFOR SALE.\n\nALEX. LOUDOON,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held in the Council Chamber on Monday evening last. The members consisted of Messrs. Davis and Couns. Woodman, Donaldson, Goddard, Sanderson, Davis and Mair.\n\nThe Finance and Assessment, Board of Works, Health and Relief, and the Fire, Water and Light Departments made their reports; but not being in accordance with the procedure by law, were thrown out on the following motion being carried, after which the members returned to the mayor and the same of the councillors:\n\nMoved by Coun. Davis and seconded Coun. Sanderson, that reports of committees presented this evening be thrown out as the committees are not legal.\n\nThe mayor ruled this motion out of order for the reason that the committees are legally appointed.\n\nCoun. Davis moved that the report be received.\n\nThe mayor asked for the year and may, when all the councillors voted any; the mayor being absent.\n\nThe motion was then put and carried. All orders for it were from the mayor.\n\nThe following committees were then appointed:\n\nFinance and Assessment—Woodman, Davis, Mair.\n\nBoard of Works—Woodman, Goddard, Mair.\n\nHealth and Relief—Davis, Donaldson, Goddard.\n\nFire, Water and Light—Donaldson, Woodman, Sanderson.\n\nThe mayor reported the action he had taken in connection with gladiolus houses. He had visited the new building on King street, and the collection of money had been made. The report as presented was adopted.\n\nCoun. Donaldson gave notice that he would introduce a by-law to amend By-law No. 27.\n\nThe following committee were appointed:\n\nJohn Smith—Chairman, John Smith.\n\nThe council then adjourned to meet again on Monday evening next, 4th inst.\n\nTHE HISTORICAL SOCIETY.\n\nA meeting was held in the Nielson Academy on Saturday evening last to consider the advisability of forming a historical and scientific society. Mr. Jacquin presided and explained the object of the meeting. He said that earlier in the year a proposal had been made to form a society connected with St. Paul's Presbyterian Church, but they had decided against it because there was no one having a wider field. They had drafted a constitution to submit to this meeting and had decided that it was necessary to seek assistance to all who were likely to be interested in such an organization. He hoped the society would be formed and that it would be successful.\n\nShort speeches were also made by Capt. Perry, Rev. Canon F. Van, Archdeacon Macdonald, and others, all of whom were in sympathy with the object of the meeting. Mr. W. R. Gurney spoke at length, saying that while he was fully in accord with the object of the meeting and would be glad to do all in his power to make such an organization a success, he thought it would be a mistake to attempt to form a society without a wider field. He thought it would be better to form a society connected with the church, as such a society would be more widely known and would have a larger membership.\n\nThe meeting was adjourned until further notice.\n\nTHE ROYAL BAKING POWDER.\n\nAbsolutely Pure.\n\nFOR SALE OR RENT\n\nTHE LELAND HOUSE\n\nPRINCE ALBERT.\n\nOriginating in the olden times, Leland decided to give up the hotel business for the purpose of selling real estate. The house is now for sale or rent, furnished or unfurnished. The house is now doing well, and the owner is willing to sell at a reasonable price. The house is located in a quiet residential area, and is easily accessible by car.\n\nD. POLLOCK, Prop.\n\nCONFECTIONERY\n\nGO TO\n\nH. MDougall's\n\nBAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL\n\nWHOLESALE AND RETAIL\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham and\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nPRINCE ALBERT\n\nBREWERY\n\nPure and Sparkling\n\nAMBER—Hop—ALE\n\nDelivered to all Parts of the Town.\n\nGERROD BRO.\n\nNEILSON & McBEATH\n\nDo You Want CARPETS\n\nIF SO Give Us a Call AND SAVE MONEY\n\nCARPETS\n\nGroceries, Fresh Butter, Beef, Fresh Fish always on hand\n\nTHOS. O. DAVIS.\n\nDOMINION\n\nThe only high-class Illustrated Canadian Weekly, gives its readers the best of literature, accompanied by engravings of the highest order. The Press throughout the Dominion has declared it to be worthy of Canada and deserving universal support; but its best recommendation lies in its steadily increasing circulation.\n\nSUBSCRIPTION $6 A YEAR. TEN CENTS A NUMBER.\n\nSPECIAL ARRANGEMENTS made with Messrs. G. E. Desbarats & Son, Publishers, enable us to offer the DOMINION ILLUSTRATED with THE PRINCE ALBERT TIMES AT $5 A YEAR\n\nONE MORE\n\nGreat Clearing Sale.\n\nNext to Manseher & Knowles' The wisest and careful buyer has come to know that the best place to get the goods he wants is at the lowest prices. We have the best selection of goods at the lowest prices.\n\nW. R. FISH'S\n\nCENTRAL STORE.\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's Campbells' Barns\n\nHaving enlarged our stable and double their original size, we would respectfully call the attention of the travelling public to our stables.\n\nWall and river water almost at the door.\n\nWe have fresh milk and fresh hams to offer the honest man. We believe the public can depend on getting on good terms at reasonable prices.\n\nBoards taken at reasonable prices.\n\nN.B.—Our rigs are new, and not liable to breakage.\n\nT.J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889020101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 6762, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8595, 1], [8595, 13954, 2], [13954, 21493, 3], [21493, 26773, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]