[{"id": "66ff135d7610b495af64b90337ca76bf758fc882", "text": "PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, DECEMBER 5, 1884.\n\nBANKING HOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTransact General Bank Business.\nIntimate knowledge of all matters connected therewith.\nBranches at Prince Albert, Regina, and Saskatoon.\nBankers—Merchant Bank of Canada.\n\nJUST ARRIVED\nBy latest cars from Troy, a complete assortment of\nDry-Goods, Greetings, Crockery, Gents' and\nLadies Furnishings, Moccasins, Overshoes,\nGloves, Mitts, Fur Caps, and Fur Coats.\n\nSTRAYED.\nStrayed on my premises at the Ridge the following horse—\nA fine black and white mare, three years old, brown bell, blue eyes, yearling colt, \"Horseback Mare,\" and a saddle bag.\n\nThe owner can have them by proving property and paying expenses. If not claimed within one month will be sold to pay expenses.\n\nDANIEL CAMERON\nNov. 26th, 1884.\n\nPUBLIC NOTICE.\nAll parties are hereby notified that the undersigned committee have postponed the election of members of the Board of Trustees until further notice.\n\nST. ANDREW'S DAY\nOn Sunday evening, the members of St. Andrew's Society assembled in the school house, where they marched to St. Paul's church to engage in religious exercises. The service was conducted by the Rev. Mr. McCallum, chaplain to the Society. The church was filled with people, and the service was very impressive.\n\nThe day was spent in visiting the sick and the poor, and in doing charitable works. The day was also used for socializing and enjoying each other's company.\n\nST. ANDREW'S DAY\nOn Monday the hospitality of the St. Andrew's Society extended to us by inviting us to their annual dinner. It was a very pleasant and social evening, when everything went off without a hitch. The food was excellent, and the company was very friendly. We had a wonderful time, and we are grateful to the Society for their kindness.\n\nPRINCE ALBERT, SASK.\ndifficult to see why this should be so. The best man to return to any representative assembly is the one who has the necessary abilities to perform the required duties and to maintain a sense of responsibility in the field by a sincere and we may say, a noble ambition to work hard, and if necessary quite unselfishly, for the amelioration and improvement of the condition and welfare of his constituents, both socially and politically. The vulgar desire to exercise power, to increase the importance of one's personality, or to be in a position to better one's circumstances and be able to command more of life and influence the best men to come before the public. Can a man of the right stamp and with the true ring, reconcile it to his self respect to take any such place? Apparently before he could so enjoy the esteem and confidence of a body of electors when in his own mind he knows that any of these were begged and imposed upon him as a favor, or worse yet bought out with bribes, and against their favorable opinion of himself? What is the meaning of all our canvassing, but that the voters require to be begged to do what is for their own good, or insulted into a threat of bodily harm into agreeing to their own consciences. If a man is known to be an honest one, to have experience of what is best in the interest of the electors, to have a mind capable of solving practical problems, and to have what is in addition to these qualifications quite as necessary to any representative in a house of debate, the mental qualities will make him a natural leader, and the coolness to express such result of thought upon the spot, and at other times to defend his opinions with force and energy, as well as ability, to secure the assent of others, that the constituents should strain every effort for their own sakes, and may feel sure that he will not go around begging them to accept his services as a favor, or insulted into a threat of violence. The man who possesses these rare qualifications or who most nearly approaches to the standard will not fail to appreciate the honor done him by those of us who elect him by their own spontaneous action, but will have more mainly pride and self-respect than to thrust himself upon the people, and to let voters should regard the personal worth of the man who not only does this vote, but pro- duces it again in spite of a re- corded verdict against himself. Their experience teaches even ourselves, but our feet seem to require a repeated dose of the medicine.\n\nPROTECTION OF DEBTORS.\n\nIn an article published by us some time ago when it became generally known that the North West Princes in their supreme wisdom had determined to protect debtors for a period of six years after coming into the Territories from action on the part of their creditors to recover debts due them, clearly stated, among the objections to this course, which we urged at the time, and which still continue to hold, we mentioned the disastrous effect likely to be entailed upon the credit of merchants and traders requiring to bring goods into the Territories and expect the same as to how the system would work alongside the ordinance respecting secured personal property. Having now considered the question of the ordinance as a whole with reference thereto, we find that while the objectionable and demoralizing principle in it was feared, yet present to prevent the necessary inconvenience arising from the application of it to those who might require credit for the future benefit of themselves and fellow settlers, it is not made to apply to debtors in general and is therefore liable to be brought into the Territories, nor will the six years of exemption be co-temporaneous with the statute of limitations. This is, no doubt, very ingenious, but for all that it is a sort of \"emancipation.\" With regard to the other clauses which except certain things from seizure for debt we can express more sympathy, always bearing in mind that they only apply to those who stand after passing of the ordinance, when creditors exactly know their position and risk in giving credit. That this increase of exaction cannot be popular we believe, but there is no reason to change our already expressed opinion that giving a fair start to debtor and creditor alike, the tendency of legislation will be, instead of facilitating the recovery of debts, to encourage the often ill-advised and perilous offering of credit. Those who differ in this respect from our opinion on this subject are merely on the false fact that they believe that more than nine-tenths from seizure, and consequently their credit is destroyed. All we need say in answer to this, is that if true, men so circumstanced whatever may be the necessity for the moment, or better without which it may end by depriving them of what is necessary in order to follow their occupation in life, that present inconvenience is nothing compared to the peril that the loss of occupation represents. We urge that the first of legislation is objectionable as starving, of the present rental, we would submit that if a man requires what will have to be paid for with what is now exempted, it is far better to liberate him by selling such things as he owns and making his purchases, which is far better than having them ultimately sold and probably when he is not only in want of the best means of subsistence for himself, but has interests and court expenses added to the original debt. The farmer now is tolerably well se- cured, more especially with the ame- lioration of his position with regard to farm machinery, provided for, by the ordinance respecting Taxes, Hire Receipts, etc.\n\nHolding Prize—Conditions and cure.\n\nThe symptoms are restless, like spasms, intense itching, increased by scratching; very distressing, particularly in the evening; when there are worms crawling in and about the rectum the private parts are sometimes affected. If allowed to run its course, it may fallow. \"SWAYN'S OINT- MENT\" is a pleasant, safe cure. Also for Tics, Lice, Scabies, Moles, Etc., also for Ringworm, Fowl Pox, Hidalgos, all sores, crusty Skin Diseases. Box, by mail, 5c.; 3 for $1.25. Address, Dr. W. A. H. KIRK, 48 Main St., Peter, Pa. (See Druggists.)\n\nTenders for Timber Limits in the North West Territories.\n\nSIR: — I have the honor to be the undersigned, and request to state that the timber limits survey in the North West Territories, from the 69th meridian west, south of the 49th parallel north, were completed under instructions received from Honorable Mr. Justice Oliver Atwood, in the President's Office, Ottawa, Ontario. The surveying was conducted by Mr. J. D. Shannon, commissioning the parties appointed by the Government to make the survey, and the survey was completed in accordance with the instructions and regulations laid down by the Crown Timber Officers, Mr. John Murray and Mr. A. D. Burridge, Deputy Minister of the Interior, Department of the Interior, Ottawa, Oct. 16, 1884.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nSPINK & MAVETY.\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES.\n\nSt. Mary's,\n\n11 a.m.—His Lordship, the Bishop of St. Mary's.\n\nThe Mission Chapel.\n\n11 a.m.—Rev. Mr. Wright.\n\n12 noon.—Rev. Mr. Hitchen.\n\nSt. Andrew's,\n\n10:30 a.m. and 6 p.m.—Rev. Mr. Matheson.\n\nSt. Paul's,\n\n11 a.m. and 6 p.m.—Rev. Mr. Canon Pleas.\n\nSt. Andrew's,\n\n10:30 a.m.—Rev. Mr. J. Taylor.\n\nSt. John's,\n\n10:30 a.m., 12 noon, and 6 p.m.—Rev. Mr. Hilton.\n\nGrosvenor,\n\n1 p.m.—Rev. Mr. W. Wright.\n\nSt. John's,\n\n3 p.m.—Rev. Mr. Hill.\n\nGRAND RIVER MISSION,\n\n10:30 a.m.—Rev. Mr. Hitchen, Rev. Mr. Wright.\n\nSt. Paul's (Presbyterian),\n\n11 a.m. and 6 p.m.—Rev. Mr. McMillan.\n\nCatholic Church,\n\n10 a.m.—Rev. Mr. St. James.\n\nC. M. Church, Red Deer Hill,\n\n10 a.m.—Rev. Mr. Hitchen.\n\nC. Methodist Church, Grosvenor,\n\n1 p.m.—Rev. Mr. Hilton.\n\nC. Methodist Church, Mission,\n\n11 a.m.—Rev. Mr. Hilton.\n\nFRIDAY, DECEMBER 5, 1884.\n\nEXERCISING FRANCHISE.\n\nAs we understand that the ques- tion of the incorporation of our settlement is shortly to be decided by a vote of the people, and that the election of various school dis- tricts will follow immediately by the same process, and furthermore that at no distant date the electors will be called upon to exercise their right of franchise in the selection of a candidate for the office of Premier of the North West Council, the time seems fit for the consideration of the public a few remarks upon the subject of voting in general, and to recall some principle which is admittedly by all, too often forgotten when theory comes to be re- duced to practice. When we re- member that the right to decide what concerns our social and politi- cal future, and indeed what concerns the people is the essence of our con- stitutional government, of which we are all justly proud, that it is the one safeguard of our freedom and our rights, that by it we may enjoy the dearly bought liberty of liberty of conscience as well as of action, and lastly at what cost our ancestors, and did not hesitate in such a case, as to shed their blood, have handed down to us this grand inheritance, it seems but inconceivable that men are to be found who can make use of it for any but its rational purposes, and the best way to prevent it in the end by the miserable indulgence of venting petty spite or if possible the more despicable allurement of sordid gain. The one question which should be kept in mind by any honest man who intends to vote for or against a particular party or candidate is whether the one is for the best interests of the people or the other having those interests at heart, possesses personal merit and is fitted to carry his honest desires into effect. We have little hesitation in asserting that with regard to pol- itics the best men are by no means generally returned as their representa- tives by the people, and it is not\n\nNEW GOODS AT MEDICAL HALL.\n\nBurdock Blood Bitters.\n\nBurdock Healing Ointment.\n\nBurdock Pills.\n\nVictoria Hypophosphites.\n\nVictor's Bucba and Uva Ursi.\n\nFreeman's Worm Powders.\n\nYellow Oil.\n\nT. E. JACKSON.\n\nAT THE OLD STAND.\n\nGrand Display.\n\nCARDS.\n\nAT THE\n\nHORSE SHOE STORE.\n\nSHANNON & MCLEOD.\n\nDEALERS IN ALL KINDS OF\n\nBoots & Shoes,\n\nRubbers, Etc.\n\nCustoms work a specialty.\n\nRepairing done with patience and care.\n\nMr. — All parties who have not paid their accounts, will please do so at once and save further trouble and expense.\n\nSHANNON & MCLEOD.\n\nSTRAVED.\n\nStrayed up to my premises about the middle of June.\n\nTWO SPRING CALVES.\n\nRed, one heifer and one bull. Owner will please prove property, pay expenses and take them away.\n\nWILLIAM HODGSON.\n\nWater Mill.\n\nPRINCE ALBERT\n\nPlaning Mills and Saw and Door Factory\n\nBox. HUNTER and MARSH.\n\nSaw, Doors, Frames, Blinds, Mouldings and all other Furnishings made to the shortest notice.\n\nGOODFELLOW BROS. — PROP'T.\n\nPrince Albert, N.W.T.\n\nPHOTOGRAPHS.\n\nChas. E. Page.\n\nNEW STUDIO.\n\nEAST END.\n\nPETER SMITH,\n\nBaker and Confectioner.\n\nAll Kinds of Seed Cakes Made to Order.\n\nThe Best Bread West of Winnipeg.\n\nTERM STRICTLY CASH.\n\nOUR FAMILY KNITTING MACHINES.\n\nRecognized as being the only machines to be used by the best Knitters in Canada.\n\nTHE ONLY MACHINE THAT KNITS WITH TRUE FAMILY KNITTING.\n\nKNITTED TO PERFECTION.\n\nThe only machines make the only perfect seamless full-fashioned knitted garments.\n\nMISERY IN THE WORLD.\n\nWith the Pearl Rib-Stitch One-and-one-half-inch Stocking, Knit the coarsest Farmer's Yarn, Cotton, Silk, Linen, etc., and make a smooth, soft, comfortable stocking. All sizes made and sold by dealers throughout Canada.\n\nCREELMAN BROS.,\n\nGERESTOWN, ONT.\n\nThe Dominion Organ and Piano Co.\n\nSee the largest and most complete Battery in the World.\n\nHighest Rates ever Assured to any Motor in the World.\n\nFirst-class Service at all Times.\n\nMANUFACTURERS\n\nSQUARE AND UPRIGHT PIANO'S.\n\nSend for Illustrated Catalogue and Trade Circulars from the House.\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the views expressed in the following communications.\n\nTo the Editor of The Times\n\nSir,—I am authorized to state in reference to your article of last week, \"The French,\" that your remarks thereon are not those of Mr. Reid and the leaders of the French party because aware of the nature of the petition which Mr. Reid had signed and condemned and openly opposed it on the ground that if such signature were made it should not be by any individual but by the whole nation, or at least a representative of nationality or creed, for, disposed as they might be towards Mr. Reid himself, they would oppose him if he were to try to get his views accepted by a public gathering to oppose the petition in an address in which he explained to the intelligent portion of the community the opinions of those who were supporting the proposal in sympathy with that petitioning movement. It was supported by all the French here present with the effect that no further signatures were obtained and the petition was held in abeyance. The proposal has since been raised by three of the French who signed the petition that they did so on the assurance that Mr. Reid was opposed by Mr. Reid and his friends.\n\nT. E. JACKSON.\n\nMEDICINE HAT.\n\nFrom our own correspondent.\n\nWork on the Galt line of railroad has been suspended until winter sets in. Nov. 1st, the contractor, Mr. Grant having discharged his men. Great disappointment was expressed among the workmen as they were unable to stand when they were engaged that the work would be carried on throughout the winter.\n\nMr. Yale, jeweler, has removed his place of business from Main to Railroad street.\n\nThe late hall at the Barracks has caused much dissatisfaction among the townspeople, and more especially among the ladies. It appears that certain ladies were engaged in the construction so much so as to lead one to suppose that an amateur had been already formed; in a new building like this, such direction should be left to builders, it only gives rise to jealousy and half-heartedness.\n\nMr. Harry Barrowe, the popular landlord of the Brunswick, is present making expensive additions to his house. The present addition will be the completion of the dining room which when completed will measure 32 feet by 25 feet; a size which will be a great loss to the building and its hall rooms. This is much appreciated by the townsfolk, as it will fill a much felt want.\n\nMr. Peterman, owner of the Cypress Hill Lumber Company, has established a lumber yard at Maple Creek, which will fill a much felt want.\n\nA skating club has been instituted here, and assemblies will be held weekly during the season.\n\nThe first regular snow storm approached the town several weeks ago, and afternoons of the 18th and continued all next day; four inches of snow fell.\n\nThe C. P. R. have been progressing for some time past, for the purpose of constructing a line 150 miles away from this place. A bore has been driven at the north end of the railway line, and they have struck a vein of coal of considerable length and quality as the Galt mine, which leads experts to assert that this is a continuation of the Galt mine. A second vein will be promised with at once, and mining commenced. As this mine is alongside the line, good and cheap coal will be supplied.\n\nMOOKE JAW.\n\nFrom our own correspondent.\n\nMr. Wm. Kiddie, of the Qu'Appelle River Valley Farm, has commenced beef production. His stock arrived for him here on the 20th.\n\nThe removal of the English church has been completed. Instead of the old method of shifting buildings being used, the new method of removing them intact was adopted. The speed with which it was done and the great economy of labor and time, will be appreciated by those who look almost the entire male population to keep the church and rectory in position.\n\nMr. J. D. Brown, D. L.S., has returned from England. He has been working amongst the natives.\n\nActing Sergt. Major, Canada, Sept. 17th, 1884.\nELEGRAPHIC.\n\nGREAT REDUCTION\n\nIN\n\nBoots & Shoes!\n\nNow is the Time to Secure Bargains!\n\nAs I need money I have determined to reduce the prices of the balance of my stock 25 PER CENT FOR CASH.\n\nI have a splendid sample in Gentlemen's Fine Kid Shoes and Skating Boots. Also Ladies' Skating and Kid Boots and Slippers.\n\nCall and see for yourself and get the best bargains ever offered in Prince Albert.\n\nJ. C. Mackenzie.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nThe Prince Albert Times\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETY, - PROPS,\n\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884120501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 4628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1882, 1], [1882, 13761, 2], [13761, 17763, 3], [17763, 19144, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]