[{"id": "99c01e6c57e9496724026b2d64cfdb96a0cc4ebd", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED AT\nPRINCE ALBERT N.W.T.\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. ALBERT'S CHURCH—SUNDAY, JANUARY 18th, 1889.\nST. MATTHEW'S CHURCH—SUNDAY, JANUARY 18th, 1889.\nST. PAUL'S CHURCH—SUNDAY, JANUARY 18th, 1889.\n\nTAXES\n\nA judgment of the greatest importance to municipalities not only in Manitoba but in the Territories as well, has recently been given by Chief Justice Taylor of the Manitoba Court. The point in dispute in the case decided was the right of municipalities to charge a higher rate of taxation than six per cent on areas of tax-exempt property. The decision requires, to regulate interests. Chief Justice Taylor held that the Federal Parliament has the sole right to deal with the question of interest, and that any Provincial legislation allowing a higher rate than that fixed by the Dominion Parliament is ultra vires. We will publish the full text of the judgment next week.\n\nIt would appear then, that those parties who purchased land at a recent tax sale here, expecting that they would get twenty per cent in taxes on the value of the land, in reliance of the land will have to content themselves with six per cent if indeed, the Ordinance being so far, ultra vires, they will be able to collect all. We hope that a Council will be called at once to consider the matter. Council of 1888 got the power when they exercised the power by law adding an additional ten per cent to all taxes not paid before the first of December last. We have examined the Municipal Act, and find that there where, under the Act, that the Council may levy such a tax; gives the power to all or a rate on the basis, but not an addition. Even if the Ordinance conferred such authority, it seems, in view of the judgment above referred to, it would be ultra vires, and the imposition of such percentage would be illegal and might be successfully resisted by ratepayers. We believe that the judgment of the Hon. Chief Justice is sound and unassailable. Or course it is liable to be appealed against to a higher court, and may be reversed.\n\nWe understand that there is movement on foot to establish a school in the western portion of the town. We believe there are a sufficient number of children of school age to warrant such a step, and we hope that it may be successfully carried out. At the same time we would caution the ratepayers against extravagance. It will in the first place be necessary to build a school house. We do not think that it is wise to put up an expensive building at the outset; it should cost not more than $1,500. In addition to the school, the ratepayers' school will also have to be provided for, and should be kept within bounds. Our taxation is high enough now, and while times are dull, should not be increased.\n\nIn our report of the municipal elections we have seen in error stating that 153 electors voted, of whom only 120 voted for mayor. Mr. Knowles received seventy-three votes, and Mr. Agnew seventy-nine; therefore, six spoiled ballots, and that total vote polled was one hundred and eighty-two, so that only two electors who voted did not vote for mayor.\n\nIn connection with the number who voted, we asked why the ballots polled for Council seats in the different wards, forgetting that many voted in more than one ward, hence the mistake. We make this correction in justice to the candidates for the mayoralty.\n\nWe regret that owing to want of space we are unable to publish a letter handed in by \"Procession.\" And we regret that the subject of the letter cannot be treated of, because being too decidedly personal. We will assure \"Procession\" however, that our report of the demonstrations which took place, when the election was held, was inserted or written to offend our east end friends. We are aware that it was unnecessary and should have stated that Mr. Knowles' friends from all parts of town came out in force. We hope our correspondent will accept this explanation.\n\nLOCAL NEWS.\n\nMr. A. J. McNeil, clerk of the Indian Agency at Duck Lake, who has been acting clerk of the new Indian Council Office, was in town last week.\n\nOn Friday evening the Very Rev. Archdeacon McKay, incumbent of St. Allan's Church, held all the children of the parish school and a number of their parents in a very interesting meeting, when pleasant evening was spent in games and other amusements until about nine o'clock, when the children returned to their homes. The weather was fine and other games among the children, of whom there were about forty-five present, were most enjoyable. The parents were glad to hear that their money had been put to good use and that the children had enjoyed themselves.\n\nWe are in receipt of a hand copy of Ayer's Almanac for 1889, containing selections in ten different languages. Special prayers for the sick are included, some of them being very curious and interesting, especially the one in Turkish. Ayer's Almanac and Calendar for 1889 has not yet had time to arrive. All the people who have ordered have been very disappointed, and we are obliged to inform them that the supply of Ayer's Saratoga, Ayer's Cherry Pector and Ayer's Pills, are now sold out.\n\nThe accuracy of the astronomical calculations, as well as the other tabular data, contained in this valuable calendar, is attested by its wide circulation, and it is used in all parts of the world. We may add that the amount of Ayer's Almanac and Calendar is very large, and that it is of the best work of the kind. This is certainly a good book, both the almanac and calendar are very useful to anyone interested in the world at large. The familiar yellow covered pamphlet can now be had at any of the drug stores.\n\nBuy your Remnants at Buffalo Hall.\nBuy your Dress Goods and Ladies' Furnishings at Buffalo Hall.\nBuy your Cottons, Cambrics, Muslins, Laces and Fancy Woolen Goods at Buffalo Hall.\nBuy your Ready Made Clothing at Buffalo Hall.\nBuy your Underclothing at Buffalo Hall.\n\nAnd get the advantage of the Heavy Discounts they are now giving.\n\nBETTS & GWINNE\nR. C. WIGMORE & CO.\nMen's and Boys' Underclothing\nMen's Cardigan Jackets\nMen's Fea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\nR. C. WIGMORE & CO.\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text-Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed Uttings, Trowering and Overcoating WORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS IN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nNOTICE.\n\nApplications will be made to the Parliament of Canada, for the purpose of obtaining an Act enabling the Town of Edmonton to incorporate itself into a municipality, and also to incorporate the Town of Strathcona into a separate municipality, and to provide for the amalgamation of the two municipalities into one.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nCERROND BROS.\n\nORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nPaine's Celery Compound\n\nCURES Nervous Prostration, Nervous Weakness, Nervous Angina, Nervous Weakness, Stomach and Liver Complaints, and all affections of the Kidneys.\n\nWEAK NERVES\n\nPaine's Celery Compound is a Nerve Tonic which never fails. Containing Celery and other ingredients, it is a powerful stimulant, is speedily absorbed by the system, and is specially adapted for nervous disorders.\n\nRHEUMATISM\n\nThe Celery Compound possesses the power of driving out the lactic acid, which is the cause of rheumatic pains, and thus making organs to a healthy condition. The result is immediate and permanent.\n\nKIDNEY COMPLAINTS\n\nPaine's Celery Compound quickly removes all symptoms of kidney complaints. This curative power combined with its agreeable taste makes it well nigh a panacea for all kidney complaints.\n\nDYSPEPSIA\n\nPaine's Celery Compound strengthens the stomach, and quickens the action of the digestive organs, and is therefore of great value in cases of dyspepsia.\n\nCONSTIPATION\n\nPaine's Celery Compound is a laxative, giving easy and natural relief from constipation, and is equally serviceable in cases of diarrhoea.\n\nRecommended by professional men.\n\nPrice 10 cents per bottle.\n\nWELLS, ANDERSON & CO., Prop's.\n\nMontreal.\n\nONE MORE Great Clearing Sale.\n\nNext to Macbeth & Knowles' sale, this is the largest and most complete sale ever given, and we have now captured a prize which the good hearted soul spread his net over, and now they too are the happy possessors of the same. We have no more to offer, where will all this end? Echo, and oh, where will it end?\n\nNote our way of conducting an honest business. No price, in plain figures. Goods exchanged or money refunded. Goods as fair as what they are. Full weight given.\n\nW. R. FISH'S CENTRAL STORE.\n\nA Dead Drop!\n\nON PRICES AT J. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous success, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL (LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN, Sec.-Treas.\n\nAGENTS:\n\nP. G. GRAY, Edmonton, Alta.\n\nJ. FRASER TIMS, Fot Saskatchewan Alta.\n\nMahaffey & Clinkskill, Battleford, Sask.\nThe Irvine Banquet.\n\nOn Tuesday evening last the citizens of Prince Albert met at Queen's Hotel to dine in honour of Col. Irvine. The banquet was an expression of the high regard and esteem in which he is held here. Over fifty of our best citizens took part in the dinner and the number would have been far greater had there been more accommodations to be found in the hotel. It was found necessary to limit the number of tickets. Many of the ladies expressed a wish to be present, but for the same reason as above, it was impossible to accede to them and we were consequently deprived of the pleasure of their company. Of the dinner guests present Mr. A. E. Woodman, the chairman, spoke highly; Mr. O. Grant's well known reputation as a caterer in sufficient guarantee that it would be done so, as indeed it was. We say \"say now,\" because it was without exception the best ever served up in Prince Albert.\n\nThe chair was occupied by Capt. Thompson, McNay and the vice-chair by Mrs. Col. Irvine. Amongst the guests were Col. McLean, Mr. O. E. Hughes, and on his left Mr. H. Macintosh and the Hon. L. Clarke. Amongst the very distinguished members of the dinner party were J. F. Betta, M.L.A., W. R. Gunn, Sargent Parker, Corp. Kerr, T. N. Campbell, Capt. Corby, Capt. Murray, T. J. Agnew, R. Gurdie, L. D. Macveety, R. C. Wigmore, F. C. Baker, Wm. Taite, Hon. G. Ramsay, V. Watson, Capt. McNay, Capt. Thompson, Capt. Gissing, S. J. Donaldson, L. Johnson, John Sinclair, W. W. Maclean, E. J. Kerr, H. J. Smith, Mr. J. A. Maclean, Mr. W. H. Adam, B. R. Spratt, James Sinclair, Charles Woodman, W. Woodman, A. E. McNay, R. Gray, Capt. Banks, Jno. McNay, H. McDonald, Capt. Murray, Capt. Anderson, Const. Gordon, Const. Hooper, and others.\n\nAfter the chat was over the chairman proposed the following toast— \"The Queen.\" \"The Prince of Wales and the Royal Family.\" \"The Governor General and Lieutenant-Governor.\" These three rights royally received and duly honoured. Corp. J. Murray sang in excellent style. \"The Soldier's Home\" was then proposed by the chairman and the toast of the evening, \"Our Guest,\" in doing so he referred to Col. Irvine's recent visit to Prince Albert; this was Col. Irvine's first visit since 1885 and this reception was tendered him with the utmost approval of his actions during the rebellion, and since, and to show our appreciation of the kindness he had always taken in our welfare and his consideration for us all; he, the chairman, was pleased to see so many of those present who had served under him during the late Rebellion; he spoke of the many good qualities of Col. Irvine and the stand he had taken during the late Rebellion in behalf of the Prince Albert Volunteers in behalf of the Prince Albert Mounted Police, W. M. Police. His present mission was to treat with the northern Indians and the Government thought he would make a wiser selection. Before the toast was drunk the Hon. L. Clarke made a few remarks which were most interesting; he had been connected with the early career of Col. Irvine and passed a warm eulogy on him; he had known Col. Irvine for a long time, still as an officer in the Red River Expedition under Lord Wolseley, then in the Fenian raid of 1870 and afterwards as Commissioner of the Police Force; he knew of the services he had acquitted himself with honour; in the early days he had succeeded in establishing such a high degree of discipline for the police force that even a very small number of men could maintain the order and discipline of Prince Albert; he was entitled to our lasting gratitude. The toast was received with the utmost enthusiasm, and was drank amidst loud applause.\n\nThe gallant colonel, on rising to respond, was received with deafening cheering, and was called back several times until the noise subsided; he said that he was not a public speaker, and on the present occasion he was unable to find words to express his thanks for the honour that had been conferred upon him, but he would ask those present to accept his most sincere thanks for the manner in which they had treated him and his officers, and that his name would always be remembered by them.\n\nDo You Want CARPETS\n\nIf So Give Us a Call and Save Money\n\nGroceries, Fresh Butter, Beef, Fresh Fish always on hand\n\nTHOS. O. DAVIS\n\nFOR THE Best Assorted Stock of CONFECTIONERY\n\nGO TO H. M'Dougall's BAKERY.\n\nGame in Season\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham, and\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.\n\nT.J. AGNEW\n\nFor Stoves Heating Drums Stovepipe Coal Oil\n\nNEILSON & M'BETH", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889011801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 3595, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6903, 2], [6903, 9774, 3], [9774, 14316, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]