[{"id": "815bff6d1c2ddcc778d6534c92c0bab94d69ea05", "text": "Notices are hereby given that we require all outstanding debts in our favor to this District to be notified with us at our offices, as Prince Albert, or at his place the First Day of June next.\n\nEvidence will be received for collection at such times as may be agreed upon by the contractor.\n\nNotice is hereby given that all outstanding balances due us must be paid by the Slab of May, 1863.\n\nAccounting report in unpaid affairs after the above date will be placed at the disposal of our Solicitor for collection without further notice.\n\nThe first day of June last was very hot but there was no rain. \n\nBy reference to their advertisements in various newspapers, parties claiming having acreages in the district of Prince Albert, the sale of timber is being delayed in several instances. \n\nThe second day of June will be the auction day of the second sale. \n\nThe third day of June will be the auction day of the third sale. \n\nThe fourth day of June will be the auction day of the fourth sale. \n\nThe fifth day of June will be the auction day of the fifth sale. \n\nThe sixth day of June will be the auction day of the sixth sale.\nEMIGRATION.\n\nJudging from the Winnipeg papers this season's influx of immigration has been most extraordinary, and the North West Territories. Even the emigrants from Europe are beginning to arrive. It is certain that next year will be greater than that of any previous year. Mr. George Stephen, President of the C. P. R., has already made arrangements to arrange for the transport of 30,000 persons across the plains in the next few years. A large number will also receive homesteads under the new laws, and societies which assist emigrants from Ireland, Germany, and other countries have been formed. Many of these will be able to find employment on the railway or elsewhere; others will be able to purchase land and then establish homes for themselves and families. The Government is doing all it can to encourage settlement in the North West, and has even offered prizes to the first settlers who will locate there. The Government is also working hard to improve transportation facilities, and has already constructed many miles of railway. The future looks bright for those who wish to settle in the North West.\n\nPRINCE ALBERT\n\nPlanning Mills and Saw and Door Factory\n\nCORN, SOYBEAN AND MACAAT SEEDS\n\nSaw, Doors, Window Blinds, Moldings and all building materials.\n\nBODFELLOW BROS. & PROP.\n\nSTAPLE & FANCY DRY GOODS\n\nWAREHOUSING\n\nAT\n\nFORT QU'APPHELLE.\n\nAll the Latest Novelties.\n\nBOOTS & SHOES\n\nOur Stock in this line is very complete, and prices will be found very low.\n\nMens' Shoes from $125.\n\nLadies' Newport Tie Shoe $150.\n\nClothing,\n\nA choice assortment of Ready Made Clothing.\n\nMens' Fancy Shirts in great variety.\n\nHATS,\n\nFelt Hats in all styles.\n\nGrocer,\n\nWe show the largest stock of Groceries and Canned Goods ever imported.\n\nMISS MACK & CO.,\n\nCampbell's Block, Prince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nTO THE LADIES.\n\nNEW Spring & Summer Goods JUST RECEIVED BY EXPRESS.\n\nMISS MACK & CO.,\n\nCampbell's Block, Prince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nPlans and estimates furnished when required.\n\nResidence: Near Presbyterian Church.\n\nGRAND UNION\n\nLivery & Sale Stables,\n\nNobel Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nOffers for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nJames O'Brien & Co.,\n\n30 College Street, Montreal.\n\nWHOLESALE CLOTHING.\n\nJames O'Brien & Co.,\n\nPrince Albert, Winnipeg.\n\nJUST RECEIVED\n\nA large and complete stock of\n\nNew Spring Goods,\n\nWhich we are offering very cheap to make room for our Comberland freight, expected shortly.\n\nSTAPLE & FANCY DRY GOODS\n\nWAREHOUSING\n\nAT\n\nFORT QU'APPHELLE.\n\nAll the latest novelties.\n\nBOOTS & SHOES\n\nOur Stock in this line is very complete, and prices will be found very low.\n\nMens' Shoes from $125.\n\nLadies' Newport Tie Shoe $150.\n\nClothing,\n\nA choice assortment of Ready Made Clothing.\n\nMens' Fancy Shirts in great variety.\n\nHATS,\n\nFelt Hats in all styles.\n\nGrocer,\n\nWe show the largest stock of Groceries and Canned Goods ever imported.\n\nMISS MACK & CO.,\n\nCampbell's Block, Prince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nTO THE LADIES.\n\nNEW Spring & Summer Goods JUST RECEIVED BY EXPRESS.\n\nMISS MACK & CO.,\n\nCampbell's Block, Prince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nPlans and estimates furnished when required.\n\nResidence: Near Presbyterian Church.\n\nGRAND UNION\n\nLivery & Sale Stables,\n\nNobel Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nOffers for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nJames O'Brien & Co.,\n\n30 College Street, Montreal.\n\nWHOLESALE CLOTHING.\n\nJames O'Brien & Co.,\n\nPrince Albert, Winnipeg.\nITEMS OF INTEREST.\n\nToronto telegraphed that one mile is under surveillance and an arrest might be effected within a week.\n\nA block of stores situated on Calumet street near the corner of Main street, part of which were the Masonic and Catholic churches, was destroyed recently. The loss is estimated at $40,000.\n\nIt is understood that the question for the acquisition of the Grand Trunk and Canadian Pacific Railway is in contemplation, and that the line will be controlled by the Ontario and Quebec Railway.\n\nThe Sultan of Turkey has invited Baron Von Goltz, the German minister at Constantinople, to visit Turkey and assist in the reorganisation of the military administration. It is expected that this will permit the Baron to accept the invitation.\n\nJohn and Theo. Humphreys have been appointed agents for the Stewart-Carter, Canada, lumber company, who, when they struck over the head with a loaded gun, killed Mr. Humphreys. Evidence shows that the assault was the result of a complaint.\n\nThere arrived in town during the month of March 5,608 immigrants, and during April 3,908, making a total of 9,516, against 20,191 in 1882. There were 17,616 immigrants arriving in the first three months of this year, against 11,660 immigrants, against 34,914 in 1882.\n\nSpecialists have been engaged for the first time in Nova Scotia a battery on an extensive scale for the protection of the coast.\n\nOn the public lists or a paper has been issued for giving Public Notice that the Minister of Finance, relying upon some part of the report of the Board of Trade for the coming Exposition at Paris, has ordered the printing of a number of batteries for any purpose.\n\nIt is understood that the government intends to publish a circular publication at Winnipeg, early in May, some of the contents of which will relate to the North-West, such as the enumeration of the population, the extent of settlement, lying between the Canadian Pacific and the Canadian Northern lines, and along and adjoining the main line of the Canadian Pacific railway. Some of the contents of the circular will also be addressed to the Indians.\n\nThe fact that Canada will not need, for some years to come, more than a dollar of a loan, except to replace one or two cents, by 4 per cent., selecting a dollar of a loan, except to replace the strike the public mind with great force. There will be no demand for loans, each time with disastrous results. The Canadian market was a swing in the London markets. He was now convinced that the Canadian market would be able to maintain itself and develop itself without the aid of the Canadian Government.\n\nThe change I introduced in the House of Commons this Session has received the support of the majority of members, and against it was too strong. The Epoch Times has been very kind in publishing a statement which included with some details of the proceedings in the House, a probability degree of success of the measure.\n\nThe Grizzly Bear is a club, voted against the bill, and the majority of members have a chance of enlisting the Government in their cause. The measure, which, though technically private, had been introduced by the Government. The majority by which the first reading of the bill was carried was small but sufficient, and the measure, if passed, would provide over traditional procedures, and would give the Government a chance in a new field of legislation, and would be decidedly better from every point of view. If the measure had been introduced, there have been an end to much useless agitation, and to the meetings, speeches, and disturbing exhibitions. A measure of this nature is essential—and it is not all that is needed—but it is not enough to cause a feeling of resentment, which would have been felt by the people and the Legislatures, would have been too strong for the Government.\n\nEncouraging the work of the Town camp, G. & G. E. Carter have received a large engagement of roofing and other chairs, and have been frequently employed.\n\nMARKLEY & ORR,\n\nPRINCE ALBERT, N.W.T.\n\nReal Estate and General Agents,\nAuctioneers, etc., etc.\n\nValuations given on application. Correspondence solicited. Money lent. Best rates of interest.\n\nJ. SINCLAIR,\n\nMerchant Tailor,\n\nPRINCE ALBERT, N.W.T.\n\nGEORGE A. MILLER,\n\nPRODUCER,\n\nWinnipeg.\n\nNOTICE.\n\nTo Merchants and Others.\n\nPARTIES WHO REQUIRE\n\nAccounts collected or Business Books written up, balanced, etc.\n\nWill do well to apply either personally or by letter at the Post Office or Town Office.\n\nA. R. PURNS,\n\nJ. L. JOHNSON & CO.\n\nHave on hand a full stock\n\nContractors' Supplies,\n\nChopping Axes,\n\nHudson Bay Axes,\n\nCross Cut Saws,\n\nAxle Handles, etc.\n\nSTOBART,\n\nEDEN & CO.,\n\nGeneral Merchants\n\nAND\n\nIndian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nFARMERS' NOTICE.\n\nA HARRIS, SON & CO.\n\nHave delivered in the undersigned's establishment\n\nPloughs and Harrows\n\nTo fill all orders taken by me.\n\nPersons having ordered the same will please call at my establishment's warehouse, No. 1 J. Campbell's Yard, and get what they may order.\n\nS. W. VANLUVEN,\n\nPRINCE ALBERT\n\nReal Estate\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY LOCATED IN\n\nPRINCE ALBERT\n\nAnd suitable for business purposes at prices.\n\nFor further particulars apply to below named agent.\n\nC. MAIR,\n\nP. D. DRAWER,\n\nPRINCE ALBERT, N.W.T.\n\nTROI, C. P. R. WEST.\n\nNearest Point to Rail to Fort Qu Appelle and all points west.\n\nStorage and Re-Shipping Warehouse.\n\nThe undersigned having opened a warehouse for the storage of grain and supplies that he is prepared to receive from all parts of the country. For further particulars apply to below named agent.\n\nE. H. CASWELL\nMEDICAL HALL,\nT. E. JACKSON,\nCHEMIST AND DRUGGIST,\nHAS ON HAND A LARGE SUPPLY OF\nBlue Stone, Caster Oil, Linseed Meal,\nEpsom Salts, Sulphur, Horse Medicines.\nALSO\nDrugs, Chemicals, Pipe Stuffs, Spices,\nDruggist's Sundries, Perfumery, Toilet Articles, Sponges.\nPatent Medicines,\nTERMS--CASH.\nT. E. JACKSON,\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool, and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nOys., Etc., Etc.\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nHORSE SHOE STORE.\nCLOTHING\nCLOTHING\nGent's, Youth's and Boys' Clothing. All the Latest Styles.\n\nBOOTS\nBOTOS\nAt our old prices.\nThe Cheapest in Town!\nCOAL OIL!\nGrain\nAND\nFlour\nALWAYS ON HAND.\nCall and see us for Cheap Bargains\n\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 100,000 acres, already surveyed by the Government of Canada.\n\nALSO\nTOWN LOTS\nFOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gassan, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRYCE, Land Commissioner", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883052301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 2956, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1126, 1], [1126, 4833, 2], [4833, 10445, 3], [10445, 11765, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]