[{"id": "fbe075866143a056a46d5ef4d2b5bf816b48c4ab", "text": "Reduced (Cash) Reduced\n\nEverything You Want REDUCED!\n\nTHIS TIME NO PROFITS BUT QUICK RETURNS!\n\nI am instructed by Mr. Davis to slaughter the balance of the stock on hand at any price. It affords me great pleasure to comply with this request, as I am fond of Good Cheap Goods myself. We have done a splendid winter business, and we are in just the humor to give our friends some real bargains, before our Spring Stock arrives. Rich and poor, jolly and sedate, Reform and Tory, all stand on an equal basis at the Cash Emporium.\n\nCall early and see the Bargains for yourselves whether you buy or not. We will quote you special and extraordinary prices. Do not buy before inspecting our stock. A dollar saved is a dollar gained. We now sell at prices unheard of in the history of Price Amort or the North East. Make a note of it, and come in and see what we have. If you miss this golden opportunity, you will regret it for the balance of 1888. Others get Goods at Half price, why not you?\n\nGEO. C. McLEOD,\nFOR THOS. O. DAVIS.\n\nClearing Sale.\n\nALL REMAINING\n\nParlor Stoves AT COST\n\nBox Stoves REDUCED TEN PER CENT.\n\nAcme Skates REDUCED TEN PER CENT.\n\nT. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.,\nGENERAL NEWS.\n\nToronto, Feb. 19.—A sensation was caused in the Catholic churches to-day by the appearance of Bishop Lynch threatening to excommunicate those members of separate school trustees who fail to attend his next synod. His Grace uses the strongest language and accuses the continuances of the bishops of being responsible for the conduct of the clergy to break up the Catholic schools by excluding priests from school boards, which he declared, the last few years, had been the only Catholic schools left in the province. He condemns the furore made about the Queen's jubilee processions, and says they should be confined to school business and leave politics alone. The holiest patriot would most likely agree with him. Bishop Lynch is saying that he would not hesitate to use the powers conferred upon him to lop off the rotten branches of the tree.\n\nLondon, Feb. 15.—Shanghai advice states that 2,000 persons have been killed by an earthquake in Yuen Nan.\n\nThe present war in Asia forms the smallest corner of the immense empire, and is its tiny boundary on the west and south by Burma and on the east by Tonkin.\n\nA St. Petersburg special says Russia is seeking English sympathy, believing that England will side with her at any time by her own. Russia argues that if Germany triumphs she will seize Holland and make herself mistress of the advantages Lord Salisbury has so advantageously of England's coexistence position to maintain the balance of power. In regard to Austria and Alsace, the Czar and Lord Salisbury, he says, are principal factors in European politics for today.\n\nWilliam Ewart Gladstone came back from his speeches on his return to parliament. After improvement, customers to be the politest and most attentive of the day. It has been a record day for prosperity.\n\nThe Pall Mall Gazette says this evening—Mr. Orton has been in a single behind the premises for a particular number of the first rank. Nothing has been finer this season, and a few times finer this parliament. Mr. Orton has been speaking which the late prime minister addressed his judges (Balfour) and challenged him face to face, and in good the circumstances indulged in when his victim was under lock and key.\n\nWynyard, Feb. 20.—The first colonist train of the year arrived at Winnipeg, Manitoba on the 28th inst. A circular issued to C.P.R. agents states that there will be no difficulty in obtaining transportation accommodation to Manitoba, the Northwest and British Columbia, this spring. The company has arranged a regular series of colonies to travel during the summer abroad the expectations of immigrants will be readily realized. At present arrangements have been made for a train to leave Toronto every Tuesday during March and April. The dates, however, depend on the quantity of colonists freight offered.\n\nMontreal, Feb. 17.—Evidence before the select committee on the condition of affairs in connection with the school question is being heard. Children as young as eight years old forced to work 13 hours daily and more than 14 hours weekly for possible reasons which have often afterwards appeared on wages. The relations between master and servant are very bad. Judge Armstrong, chairman of the committee, says that a large proportion of the children attending the public and non-public schools who are engaged in the city and vicinity are employed in factories or shops. The committee has been unable to get any satisfactory information regarding the condition of the schools. The committee has been unable to get any satisfactory information regarding the condition of the schools.\n\nTerritorial News\n\nGleichen, Feb. 19.—Indian at the mouth of the Crowfoot River were killed a valuable cow belonging to Dr. H. H. Smith. The Indians met among the parties and asked for the cow, but refused to give it up. Patrols followed the Indians back to the reserve and to the river. Most of the Indians joined the party, except the camp and attacked the cow. The cow was brought to the patrol and killed. They were tried yesterday before Mr. Justice W. H. Brougher, J.P., who committed William Wilson, of the party jail to await his trial. A few young braves from the Blackfoot bands joined the patrol and arrested the Indians. The Indians were brought to the patrol and killed. They were tried yesterday before Mr. Justice W. H. Brougher, J.P., who committed William Wilson, of the party jail to await his trial.\n\nEDMONTON.\n\nFrom the Bulletin, Feb. 4.\n\nAn ox was missed from J. Norris' ranch on the Black Mud, south side, last fall. The animal has been advertised about the lot of the townsite where he filled an appearance at one of the stopping places on the trail this side of Peace Hill. He was a fine animal, and was found and has roamed his living during all the time he was away as there lay back stocks in the locality where he was last seen.\n\nThe animal was reported missing from Red Deer Lake on Thursday. The winter has been fine out there and the cattle rustle for themselves. Mr. Logan, in digging a well at the place where he filled an appearance at one of the stopping places on the trail this side of Peace Hill. He was a fine animal, and was found and has roamed his living during all the time he was away as there lay back stocks in the locality where he was last seen.\n\nLETHBRIDGE.\n\nFrom the News Feb. 16.\n\nThe case against Conductor Brick was heard in court this morning. Mr. Taylor, Mr. Duguid and several others were in attendance as witnesses. The magistrate took the case into consideration without going further into it, saying that the charge was ridiculous. The charges preferred were to be transferred. The name of the magistrate who called the whole case ridiculous was the same one who dismissed the case.\n\nA train of horses from Medicine Hat's stable was stolen. Mr. Taylor, the owner, called the police and handed over to the constable official at this point. The team had been stolen by two men who had been last Monday and on Tuesday evening taken by some parties and returned to the stable. The thieves stole a keg of whiskey from the team to a stage that was being held in the yard. The police came and searched the driver, wagon and team, the latter being afterwards handed over to Mr. Chamberlain by whom they are now kept awaiting instructions from the collector.\n\nPUBLIC NOTICE.\n\nNotice is hereby given that the said school district No. 10, Township of Northumberland, will be sold by auction, by the undersigned, at the schoolhouse, the following Tuesday, March 1st, at 12 o'clock noon.\n\nMcLeod's Crossing.\n\nAt the residence of Mr. McLeod, near the crossing of the Crowfoot River, the following Tuesday, March 1st, at 12 o'clock noon.\n\nStanley's Crossing.\n\nAt the residence of Mr. Stanley, near the crossing of the Crowfoot River, the following Tuesday, March 1st, at 12 o'clock noon.\n\nCarlton's Crossing.\n\nAt the residence of Mr. Carlton, near the crossing of the Crowfoot River, the following Tuesday, March 1st, at 12 o'clock noon.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowall & Co., Newspapers Advertising Agency, 101 South Fifth Street, Minneapolis.\nDominion Parliament.\n\nOttawa, Feb. 27.—The Speaker took his chair at 10 o'clock. After which Mr. Macdonald, Haldimand, rose to move the address in reply to the message from the Governor General to Lord Lansdowne, promising renewal, and expressed the regret the people of Canada would feel, when a second Lord Lansdowne was in warm place. The honour might be said by the Opposition Speaker that there was nothing not suggesting much legislation, but this was a matter of congratulation, showing that the country had been brought into such a good shape that no legislation was necessary. He spoke of the changes so many years ago, and referred to the similar to that in the older Provinces, and spoke of the prosperity of the country, and said that all it wants is increased immigration.\n\nMr. Jonas seconded the motion speaking twenty minutes in French.\n\nMr. Laurier replied. He admitted the movement and the spirit of the address, but expressed doubt as to the manner in which it was delivered by the Speaker, and wanted to know why the Department of Trade and Commerce—about which he had been speaking—had not been restored. He also attacked the government as a tyranny and threatened to appeal against the minister general. He would like to see amendments to the Executive Act, and said that the minister should not be left in the Provinces to make up for the deficiencies of the government. He marvelled at the tendency with which the government was bringing this country to be powerless. He maintained exactly the opposite, and said the country was stronger than ever before, and that it was more powerful than at present, that it was on the verge of ruin, and hundreds and thousands of our proper workmen and working honest men of United States and Canada lost was due to the actions of the government, who forced many of the C. P. R. men to go to the United States and Manitoba in the grip. With all its magnificent crops, Manitoba and our own was being shipped down by the Canadian太平洋铁路公司 and combined by a gang of thieves who had made their speech in order to voice the grievances of the subject mentioned, but intended selecting no amendments to the address.\n\nSir Richard Cartwright, the long-time friend of Mr. Laurier on his previous visit, joined in the regret expressed by the leader of the Opposition for the absence of Mr. Laurier, who was regarded as a partner of Lord Lansdowne. He commented on the insincerity of Mr. Laurier in not supporting the government of the Board of Trade and Commerce, and a Solicitor general. The reason a Trade and Commerce Department had not been established was that His Excellency had not yet considered it necessary to provide a minister for the department. He was perfectly satisfied with the existing arrangement, and felt that the administration had not followed in the footsteps of the past, and urged the blame rested upon the Opposition whose decryings had kept people out. Every day while the government was in session had been marked by the same unchanging position as to the terrible condition of the country, and the depressing effect the present policy had on the people. He persistently failed to see it and continued to support this party which so persistently tried to destroy the country. The people evidently preferred ruin at the hands of the party now in power to prosperity under the other.\n\nSir Richard Cartwright followed, and in extravagant language, spoke of the crimes and depredations which brought up the Winnipeg Train of Treason, and stated that tens of thousands of barrels of wheat were lying rotting in the streets of Winnipeg. This statement was promptly denied by Mr. Diefenbaker.\n\nPeter Mitchell spoke about ten minutes and the debate closed. The address was then adopted.\n\nMessrs. Macdonald and Smith gave directions to the members to the committee to send the Manitoba, Northwest and British Columbia members, The Hon. Mr. Turner, who had been elected Deputy Premier among the members.\n\nOttawa, Feb. 27.—Sir Charles Tupper has just appointed Mr. H. H. Hardisty as attorney-general for the province of Quebec. He was introduced by Sir John and the Hon. Mr. Thompson.\n\nDOMINION PARLIAMENT.\n\nOttawa, Feb. 28.—The Speaker took the chair at 10 o'clock today.\n\nSir John and Sir Charles Tupper.\n\nMr. Kay of Hamilton, presented a list of petitioners from his constituency on the question of the proposed exemption from taxes by abolishing and one for manhood suffrage.\n\nSir John presented a resolution from the committee to strike the Standing Committee.\n\nMr. Laurier raised a question of privilege regarding the dismissal of Mr. Kay and other translators of debates. He contended that the Speaker had erred in his action, and asked for the privileges of the House in dismissing these men. He asked the Speaker to refer the papers, etc., in case to the House.\n\nSir John said there was no doubt but that the Speaker would comply with the request.\n\nAfter other discussions the House adjourned at 10 o'clock.\n\nA Liberal caucus was held today at which Mr. Laurier's conduct yesterday was discussed. There is a decided feeling in the minority of the Liberals wishing some action in the Liberal ranks, some wishing Cartwright to take charge in Laurier's place, others thinking they should elect Laurier for a new post.\n\nThe Hon. Richard Hanna was duly discharged from the hospital today. Mr. Hanna, Mr. Smith, and two others.\n\nToronto, Feb. 28.—Robert Neill, who visited his grand-son, Robert Neill, in the General Hospital, died this morning. Mr. Neill, who was injured last evening, was taken this morning at 9 o'clock.\n\nThe Honourable of Leonard's Farm, Mr. J. B. C. & Q. Railway are still not available. Almost half the regular trains are missing.\n\nMr. Robertson, J.P., for West Hastings, has returned from touring at his residence in Fenelon.\n\nSir John and Sir Horace Longstaff have sent the report of last night's meeting of the Executive Council to the Committee on Privileges and Elections, in order that the matter may be heard by the committee.\n\nAfter several other petitions had been laid on the table, the House adjourned.\n\nOTTAWA, Feb. 29.—In the Commons Mr. Macdonald moved a point of order to the M. & N. W. railway to announce their charter.\n\nNOTICE\n\nTO THE PUBLIC\n\nWe beg to notify the people of Prince Albert and vicinity that we have decided to dispose of our entire Stock of\n\nReady Made Clothing,\nDry Goods, Groceries,\nGlassware and Crockery.\n\nAt prices which cannot fail to satisfy intending purchasers.\n\nAll parties indebted to us will please settle at once as our books are closed.\n\nR. C. Wigmore & Co's.\n\nBuffalo Hall!\n\nTHE LAST SHOT OF THE SEASON!\n\nAnd we are going to make it an Effective One.\n\nOur Closing Sale for the past thirty days has been a grand success.\n\nHave and discounts in stock and prices for the next month. We still have a large stock of\n\nWINTER DRY GOODS AND CLOTHING!\n\nTo clear out before our March stock taking.\n\nSweeping reductions will be made in every department. Everything in Staple and Fancy Dry Goods\n\nMarked down, regardless of cost or value.\n\nThis is a Great Money Saving Opportunity. Don't neglect it.\n\nBETTS & Gwynne.\n\nFOR\n\nNEW GOODS\n\nAnd Close Prices go to\n\nJ. R. McPhail's.\n\nThe balance of our Heating Stoves and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888030201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3840, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1376, 2], [1376, 8919, 3], [8919, 16660, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]