[{"id": "53b0039215ffc2b3a2f85c9e028cb95611373e71", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 8, 1886.\n\n$2.50 A YEAR.\n\nBANKING HOUSE OF Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest paid on Deposits.\nMoney Deposited.\nDrafts issued available at all points in the Dominion.\nCollections undertaken and promptly settled.\nSASKATCHEWAN Bank of Canada\n\nWILLIAM V. MACLACHLAN\nNotary Public, etc.\n\nSTEPHEN BREWSTER.\nSolicitor of the Supreme Court of Justice.\nAdvocate, Notary Public, etc.\nPRINCE ALBERT, N.W.T.\n\nFORBES & NEWLANDS.\nNotaries, Solicitors Public.\nPrince Albert, Bank, N.W.T.\nF. FORBES\nP. NEWLANDS\n\nARTHUR H. SUTTON, B.A.\nNotary, Attorney, Conveyancer.\nNotary Public.\n\nRIVER STREET - PRINCE ALBERT\n\nW. H. GUNN, M.A.\nAdvocate, Notary Public, Conveyancer, etc.\nPRINCE ALBERT\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nGEORGE A. BENTLEY,\nBarber and Hair Dresser.\nCHARGES - MODERATE.\nShop - First Door east in Sinclair's Block\n\nJ. D. HANNAFIN,\nCommission Agent and Collector.\nOFFICE - FIRST STREET\n\nFURNITURE\nCHAIRMAN TRIM WOOD.\nFor the next thirty days I will sell all at 45 cents each, less than cost.\n\nGILBERT E. CARTER.\n\nWILLIAM KNOX,\nCARPENTER, ETC.\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nA.W.R. MARKLEY,\nGen. Agent and Auctioneer.\nABSTINENCE.\nConfederation Life Association, Toronto.\nStager Manufacturing Co., New York.\nIssuer of Marriage and Billiard Table Licenses.\n\nOFFICE - WITH MR. BREWSTER.\n\nTHE OLD RELIABLE.\nA LARGE SUPPLY OF THE GOOD OLD WEIGHT CLOCKS.\nNICKLE CLOCKS, WALTHAM, ELGIN AND SWISS WATCHES.\nFor Sale and Repairable Specimens. Call and see them at the\nPOST OFFICE JEWELLERY STORE\nRepairing done neatly and warranted.\n\nR.B. WAY,\nCITY BILLIARD HALL.\n2 Carom and Pool Tables.\nChoice Cigars, Beer, cider and Wine supplied.\nWarranted Good accommodation for travellers. Well furnished rooms.\n\nTHOS. ORAM\nPROPRIETOR.\n\nBLACKSMITHING\nM'CALL BROS.,\nGeneral Blacksmiths,\nCHURCH STREET\n\nCALEDONIA BREWERY\nEAST END.\nThe proprietors of the above concern is prepared to supply beer, wine, porter, etc., either in bottles or kegs, for cash.\nFlat Bottles $1.50 per dozen.\nKegs $7.50 per dozen.\nBeer $1.50 per quart.\nIn any sized casks delivered to all parts of the town.\n\nA Billiard Hall and Saloon\nIn connection with the Rev. Mr. Scott.\nThe Best Cigars always on hand.\n\nLIVERY & F.E. D'STABLE\nCHARLES MCDONALD\n\nCHAS. WOODMAN\nPROPRIETOR\n\nAuction Sale\nFive Cast Horses and Three Colts,\nWill be sold by Public Auction at\nNorth West Mounted Police\nBarracks, P.O. & A.\nSATURDAY, 9TH OCT.,\nAT 2 P.M.\nA BOWEN FERRY\nOctober 16th, 1886.\n\nBOARDING HOUSE.\nFIRST-CLASS TABLE\nBoard at 5s per week, Single Meals 40 cents.\nGroceries, Dry Goods, and Ready-made Clothing.\nOpposite M'Dougall's Bakery.\n\nJAMES W. WHITE\n\nJACOB NEUMANN was recently called over the C.P.R. from Victoria to Prince Albert, and says, \"I take this opportunity of thanking the Government for the splendid accommodations which the road is built, its absolute safety and admirable management.\"\n\nAn Auction Sale of cast horses and colts will take place tomorrow at the Palliser Barracks.\n\nROYAL MAIL STAGE\nWEEKLY.\nBetween Prince Albert and Prince Albert Station.\nLeaves Prince Albert every Thursday morning.\nReturns Prince Albert every Tuesday morning.\nPassengers and Expresses Welcome.\nLUSSON & SCOTT.\n\nQUEEN'S HOTEL.\nLeading Hotel in Saskatchewan.\nR.B. WAY,\n\nTELEGRAPIIC.\nTHEVERY LATEST NEWS BYWIREF\n(By Special Telegraph.)\nWINNIPEG, Oct. 8.\nHugh Sutherland, President of the Hudson's Bay Company, accompanied by Mann and Holt, the contractors for work-in-progress at Fort Macleod, are now in Winnipeg on Monday last. Mr. Sutherland stated that with English capital and aid given by the Canadian Government, forty million dollars of the work will be completed this year, and that assurance has been given by English capitalists that if local funds fail to meet the requirements of this extent funds will be forthcoming to complete the entire line. With this object in view Mr. Sutherland will again visit England, and the building materials for sixty miles have already been shipped from Liverpool. The work is being fully arranged for. There is more or less excitement here as to the completion of the scheme, but in any event there has been a great deal of work done near the city, the first sections, and a large force of men employed. There has also been considerable excitement in the town, on the strength of it.\n\nA serious accident occurred on the Canadian Pacific near Gilbert, some fifty-five miles west of Prince Albert, on Monday morning last. A slide had occurred on the side of the lake and a plunge or fall took place. When the rescue party reached that point they found an pioneer Father killed and six others injured, and all the train destroyed by fire except the tender.\n\nThe Canadian Pacific has granted the Government the use of the telegraph lines to facilitate the movement of troops.\n\nCowfoot and Three Hills have been regularly attainted at Montreal and Quebec, and have quite fallen in love with the country. They have decided to join the Catholic church.\n\nThree blood chocks go through for the east to take part in a similar purpose, in conjunction with the Irish of this place.\n\nMr. Spencer, formerly collector of customs here, is dead.\n\nSir George Stephen has again sailed for Europe to attend the Canadian Pacific projects.\n\nThere are now signs of Indian unrest near the border, but no trouble amongst Canadian Indians is expected.\n\nGladstone has been presented with a petition from 500,000 Irish ladies in favor of Home Rule.\n\nLord Churchill proposes to prepare measures to settle the Irish land question. Quebec nominations will take place on Thursday.\n\nForest fires prevail in many parts of Manitoba about Morden, Birtle and Minnedosa. Many settlers lost all, and there is the case of a woman being buried.\n\nQueensell, an Indian scout, was held up at Maple Creek by Pagan Indians, who demanded a horse. A police detachment went out to arrest them.\n\nActing Mayor Hetta has left Regina for the country, and will return home by mail shortly.\n\nGarrett, the mail robber, has been sentenced to fourteen years imprisonment.\n\nWe understand that the Battledore sports want to make a trotting match. We are authorized by Mr. Thomas Monk to state that he has met Mr. Garwood and discussed the matter against the Garwood's crack horse, for two hundred dollars. The race will be run at Prince Albert, and will give the Battledore sports a chance to show their stuff, or else will take old Ben to Battle ford and take the same privilege.\n\nA great skating ball and supper took place at the Queen's Hotel last evening.\n\nAll the leading citizens of the town were present.\n\nThe new hotel at Prince Albert is progressing rapidly. The Prince Albert Brass Band and the dance band kept us up until after three o'clock.\n\nThe new schoolhouse is substantially completed, and the general appearance and internal arrangements of the hotel seemed to beggar comfort to all those who saw the splendor of the Queen's.\n\nCHIT-CHAT LOCALS.\nGathered by our Reporters.\n\nMr. McDonagh, baker, has moved into his new premises.\nWork has been commenced on the new schoolhouse street.\nGeneral Scott arrived home from Cumberland on Saturday last.\nChief Factor Fortescue, of Athabasca, is the guest of Hon. Lawrenceence.\nA barrel of flour will be placed in the store at the N.W.M. Co.'s barracks.\nThe Scotts have returned from Battleford, having sold his potatoes for $2 per barrel.\nOn die that a bowling alley will be fitted up in the town in a couple of weeks.\nMr. Ray and Mr. Woodworth of the Indian Department, will go north early next week.\nTenders are asked by the Indian Department, for the 30th day of October for delivery of 140,000 lbs. of fresh pork. New ad-\n\nMr. McKay will shortly open out a feed stable and stock stand on the Hard & Baker property.\nThe sale of east horses advertised to take place at Qu'Appelle station on the 10th.\nDr. Stockhouse has been badly employed this week putting up telephones in the district.\nMr. Wilson, M.N.W.C., was recently married, in Toronto, to Miss Emily C. Lee. We wish the new couple joy.\n\nNo argument as to the amalgamation of the two schools No. 10 was arrived at at the meeting on last Friday night.\n\nThe election of Trustees for School Section No. 10 will take place on Monday next, but Wednesday, as stated in our last issue.\n\nWork on the extension of the Mission Chapel is nearly completed. The building will probably be opened for divine service next Sunday.\n\nJ. M. Campbell has received another consignment of apples and pears. Also a splendid lot of apples ready made for preserving and general dry goods.\n\nO. E. Hughes, M.N.W.C., left per mail on last Tuesday morning for Regina, to attend the meeting of the Council.\n\nMr. McLeod arrived in from Col. Campbell's survey camp this week, where he has been engaged for several months. He left for camp after the arrival of the mail.\n\nChurches Mistassiniak and Attahkookop will be visited Monday on a visit to town, to attend the Grand celebration. Crowds and other ships will also be present.\n\nJ. McGaggart, Land Agent, and Miss McLean left per mail stage on Tuesday morning. They will visit Victoria, B.C., then Tavistock, and from there Miss McLean will send friends to Ontario.\n\nA vote will be taken on the proposition to build a schoolhouse at the new site of schoolhouse in School District No. 5, on Saturday, October 16th, 1886.\n\nWe trust the scheme will be carried.\n\nMr. A. McCauley, Land Agent, of the North West Mounted Police, who was here a short time ago, has arrived in Winnipeg. Being a cousin of Mr. Allan, a prominent citizen of Prince Albert.\n\nSimmons & McLeod have opened out their new store of shoes, boots, slippers, etc., and will be glad to supply orders for guests, ladies and children's wear. All sorts, sizes and prices cheap.\n\nAn Order in Council has been passed prohibiting the catching of white fish between the 5th day of October and the 1st day of December inclusive, except for the purpose of feeding salmon for them to eat.\n\nMr. Ray of the Indian Department, has returned from making treaty payments to the northern tribes, early this week. He brought with him a sample of wheat from Montana, ready for planting again in the spring. This year the Indians will have about 700 bushels.\nLorne Ag. Society.\n\nThird Annual Exhibition.\n\nThe Third Annual Exhibition of the Lorne Agricultural Society was opened on Thursday the 30th of September. The weather, though a little cold, was not adverse to the proceedings. A large number of people were in from the surrounding country and Carrot River district. The members present showed a great interest they took in the proceedings by visiting the exhibition building and examining the exhibits.\n\nThe exhibition was a great improvement on last year, nearly twice the number of entries having been received. The fair grounds opposite the vacant site immediately opposite the Town offices, and containing five acres, were laid out tastefully by Mr. Craig, and arranged along the Hard & Baker estate. The first flat of the building was set apart for grain, vegetables, and other fruits, and vegetables, and the second flat for dairy products, fancy work, etc. It is to be regretted that the number of entries was not as large as was expected, which was owing to the fact that the harvest had been very disappointing, and the further fact that the quantity of grain required to be exhibited to compete for the prizes was so large as to prove the samples on hand, of wheat especially, were good. The first prize for Red Fife Wheat was awarded to Capt. Craig, and the second to Capt. Craig, for White Russian; the first prize was awarded to H. Miller, for Red Ruby, the second prize for white oats, and Capt. Craig second, the latter also taking first prize for oats. Capt. Craig was also awarded a special prize for the production of grain consisting of 2 bushels of wheat, 200 lbs. of oats, and 50 lbs. of peas. To Mr. Miller, a special prize was also awarded to A. Stanfield for Rye.\n\nThe exhibit of\n\nFRIDAY, OCTOBER 18th, 1886.\n\nPublic Notice is hereby given that the school board of the North West Territorial District No. 2, the North West Territorial School Board, consisting of the secretary of the South District and the chairman of the North District, will meet at the public school building in Fort Macleod at nine o'clock Saturday morning, October 18th, 1886, for the purpose of electing five members of the school board.\n\nTenders will be received at this office up to Tuesday, October 22nd, 1886, for\n\nFresh Pork\n\nto be delivered in the quantities, and at the prices stated in the following list:\n\n- 3,000 lbs. at Birchen\n- 3,000 lbs. at Cochrane\n- 3,000 lbs. at Macleod\n- 3,000 lbs. at Brooks\n- 3,000 lbs. at Edmonton\n- 3,000 lbs. at Calgary\n- 3,000 lbs. at Lethbridge\n- 3,000 lbs. at Medicine Hat\n- 3,000 lbs. at Red Deer\n- 3,000 lbs. at Brooks\n\nTenders may be submitted by any person or firm, who shall be entitled to tender for any part not less than 200 lbs. of the said pork, and who shall have paid a deposit of ten cents per lb. for each lb. tendered.\n\nTenders must be made payable to the undersigned, and must be returned to the undersigned within twenty-four hours after receipt.\n\nThe undersigned will be responsible for the delivery of all goods purchased under this contract.\n\nJ. Sinclair & Co., Merchant Tailors.\n\nNEW GOODS JUST ARRIVED.\n\nGENT'S FURNISHINGS\n\nN.B.—The following Department will be superintended by Mr. Robinson.\n\nW.M. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nNOTICE, NOTICE.\n\nTender will be received at this office up to Monday, October 21st, 1886, for\n\nFresh Pork\n\nto be delivered in the quantities, and at the prices stated in the following list:\n\n- 3,000 lbs. at Birchen\n- 3,000 lbs. at Cochrane\n- 3,000 lbs. at Macleod\n- 3,000 lbs. at Brooks\n- 3,000 lbs. at Edmonton\n- 3,000 lbs. at Calgary\n- 3,000 lbs. at Medicine Hat\n- 3,000 lbs. at Red Deer\n- 3,000 lbs. at Brooks\n\nTenders must be made payable to the undersigned, and must be returned to the undersigned within twenty-four hours after receipt.\n\nThe undersigned will be responsible for the delivery of all goods purchased under this contract.\n\nJ. Sinclair & Co., Merchant Tailors.\n\nNEW GOODS JUST ARRIVED.\n\nGENT'S FURNISHINGS\n\nN.B.—The following Department will be superintended by Mr. Robinson.\n\nW.M. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nNOTICE, NOTICE.\n\nTender will be received at this office up to Monday, October 21st, 1886, for\n\nFresh Pork\n\nto be delivered in the quantities, and at the prices stated in the following list:\n\n- 3,000 lbs. at Birchen\n- 3,000 lbs. at Cochrane\n- 3,000 lbs. at Macleod\n- 3,000 lbs. at Brooks\n- 3,000 lbs. at Edmonton\n- 3,000 lbs. at Calgary\n- 3,000 lbs. at Medicine Hat\n- 3,000 lbs. at Red Deer\n- 3,000 lbs. at Brooks\n\nTenders must be made payable to the undersigned, and must be returned to the undersigned within twenty-four hours after receipt.\n\nThe undersigned will be responsible for the delivery of all goods purchased under this contract.\n\nJ. Sinclair & Co., Merchant Tailors.\n\nNEW GOODS JUST ARRIVED.\n\nGENT'S FURNISHINGS\n\nN.B.—The following Department will be superintended by Mr. Robinson.\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES\n\nFOR Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelings,\nDress Goods,\nSilks,\nLinens, etc.\n\nGO TO\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 10 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nBuffalo Hall!\n\nMaking Room for Fall Stock.\n\nDry Goods and Clothing Sold at Heavy Discounts.\n\nGroceries Reduced.\n\nNo Reserve.\n\nBETTS & Gwynne.\n\nAT Lowest Prices,\n\nBuilding Hardware, Locks, Hinges, Glass, Putty, Paints and Oil,\n\nPOWDER, SHOT AND LOADED SHELLS.\n\nN. B.—A large Supply best American Coaloil\n\nAT J. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\nSideboards, Cupboards, Bureaus,\nWashstands, Sofas, Easy Chairs,\nBedsteads, Mattresses, Cots, Cradles,\nAnd all kinds of Chairs, Etc., which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSaloonroom, First Door West of Bank.\n\nW. B. Goodfellow.\n\nSTOVES!\n\nCook Stoves, No. 8, $27\nCook Stoves, No. 9, 30\n\nBox and Parlor Heaters\n\nAT ALL PRICES.\n\nPiping and Drums and other Tinneryware of every description made to order and warranted first-class.\n\nJ. R. McPhail.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886100801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 4537, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 10312, 1], [10312, 15265, 2], [15265, 16035, 3], [16035, 17036, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]