[{"id": "e916a942e7894f1df3eabcdf79fc01c0bfa54db2", "text": "PRINCE ALBERT PARLIAMENT\n\nA meeting was held in the Council Chamber on Friday last for the purpose of approving or debating matters to be discussed in the forthcoming session, which was successfully carried out. It was decided to make it a less burdensome task for the members by raising questions. The Liberals being in the majority, took office. The following is a list of the members and their counties:\n\n- A. H. Gibson, South Oxford, Premier and Minister of Justice.\n- W. Newlands, Haliburton, Minister of Finance.\n- H. Clark, South Perth, Minister of Industry and Agriculture.\n- J. Stewart, Minister of Mines and Public Works.\n- G. Brown, North Oxford, Minister of Education.\n- W. J. Carter, East Peterborough, Minister of Internal Affairs.\n- T. M. Macdonald, Queens Co., P.E.I., Minister of Agriculture.\n- J. F. Kavanagh, Northumberland, Minister of Finance.\n- J. F. A. Macdonald, South Wellington, Minister of Industry and Agriculture.\n- Mr. J. W. Marshall, Clerk of the House.\n\nThe address from the Throne was then read by the Speaker.\n\nADDRESS\n\nGENTLEMEN OF THE HOUSE,\n\nI have the pleasure to inform you that the Government has been instructed to present the budget for the coming year. The budget will be presented at the next sitting of Parliament.\n\nThe Government has been instructed to present the budget for the coming year. The budget will be presented at the next sitting of Parliament.\n\nCOMPARATIVE WORTH OF BAKING POWDERS.\n\nREPORTS OF GOVERNMENT CHEMISTS\n\nAs to Purity and Wholesomeness of the Royal Baking Powder.\n\nBUFFALO HALL!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF Domestic and Imported Cigars\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlor de Benitos,\nCreme de la Creme,\nBelle Cuba,\nHenry Clays and\nWagners\n\nALL CHOICE GOODS AND SEASONED\n\nBUY YOUR Hardware,\nStoves,\nTinware,\nCoal Oil,\nGroceries,\nAT\nJ. L. JOHNSON & CO.'S.\n\nMISS MACK & CO\n\nJUST RECEIVED:\nA large assortment of Ladies' and Children's\nShoes, Felt, Velvet and Camel's Hair Hats,\nHand Made Shapes,\nFeather Covers, Buckles,\nJet Lace, Ribbons,\nSatins, Velvets,\nPatches, Caps,\nFor Caps and Muffs,\nCloaks and Dolmanes,\nCoats, Wraps,\nGlory Hosiery,\nButtons, Lining, etc.\n\nAt lowest prices possible. Come and see.\n\nFirst Door East Telegraph Office.\n\nJ. M. CAMPBELL\n\nHas just received a complete and well assorted stock of\n\nREADYMADE CLOTHING\nDry Goods\nCrockery,\nand\nGroceries!\nAlso a large quantity of\nWINNIPEG FLOUR\nCHEAP FOR CASH.\n\nJ. M. CAMPBELL\n\nCALEDONIA 3 REWEY EAST END.\n\nWAR DECLARED\n\nW. G. RAMSAY\n\nWould respectfully intimate to his friends and the public generally that he has purchased Thompson & McCauley's blacksmithing business, and has moved into River Street near J. L. Johnson's hardware store, where he has declared war against the present high prices charged for horseshoeing and general blacksmithing. A trial is respectfully solicited.\n\nPRINCE ALBERT\n\nPlaning Mills and Saw and Door Factory\n\nCO. ERIE & MACAY LTD.\n\nJ. L. Johnson, Francis Blundell, and Builder Furnishing Ltd.'s\n\nA. GOODFELLOW.\n\nPrince Albert, N. Y.\nThe annual meeting of the above Society was held at Oram's Restaurant on Wednesday last. Owing to the cold and stormy weather, the attendance was not so good as it would have been otherwise. Mr. W. Miller, sen., President, was in the chair.\n\nThe President delivered a very interesting address, reviewing the progress of the Society during the past year. He then called upon the Sec.-Treasurer to read his report, the same showing the finances of the Society in a very healthy state, carrying over a nice balance.\n\nThe adoption of the report was moved by Capt. Hoey, seconded by W. Miller, jr., and unanimously carried.\n\nThe next order of business was the election of officers.\n\nW. Miller, sen., was unanimously re-elected President.\n\nAnd Spence, 1st Vice-President.\n\nCapt. Hoey, and Vice-President.\n\nA. H. Clark, Sec.-Treasurer.\n\nThe following were elected Directors:\n\nJ. F. Beets, G. McIlwane, J. A. Macdonald, J. C. Mackenzie, J. Macarthur, J. F. Beets, J. Stewart, T. F. Miller, W. Miller, jr., D. Cameron, W. McIlwane, A. McIlwane, W. Patten, J. F. Beets, J. Stewart, W. Lytle, R. Adams, G.C. Spence, A. Sandfield, G. Glaster, J. Thomson, S. Van Luven, G. Fair, H. Loucks, D. M. Finlayson, J. M. Campbell, C. Robertson, C. Boucher, C. Adams, J. Halero, W. Cronrady and Dr. Paterson.\n\nAuditors—J. F. Beets and J. Stewart.\n\nAfter the election of officers, the following matters of importance passed:\n\nMoved by Capt. Hoey, seconded by Mr. Van Luven, that a special vote of thanks be tendered to Mr. Hughes, M.M.W.C., for his attention to the Society's interests both in the Council and otherwise, and that the same be engrossed on the minutes. Carried unanimously.\n\nMr. Hughes, in a suitable and happy reply, stated that he had met with some trouble in obtaining any back grant from the Board, as the last attempt, made during the Rebellion, had not drawn the amount appropriated to the District of Lorne, and which had in consequence reverted to the general fund. He urged the members to be on the watch for new members, as the grant next year would probably be pro rata. After explaining the action of the Council with regard to several matters interesting to the Society, he closed (applause) by wishing the Society every success and thanking the members for their cordial vote of thanks.\n\nA vote of thanks was unanimously tendered Mr. Macdonald, Mr. Pearson and Macdonald, the retiring Presidents, and was suitably replied to by those present. The Directors and members of friends who had donated so liberally to the funds of the Society for the consideration of which they had expended them during the past year.\n\nMoved by J. Stewart, seconded by J. Macdonald, that special thanks of the Society be accorded to A. H. Clark, secretary treasurer, for his valuable services during the past year, and that the same be engrossed with minutes.\n\nMr. Clark replied suitably, replying to the members and contributors for the pleasant manner in which he had been used in them during the past year.\n\nMoved by J. Stewart, seconded by W. Miller, jr., that the next grand council be held early in March.\n\nA meeting of the directors will be held early in March, to enable them to have the grand lists made out and distributed by May.\n\nFor meetings adjourned.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nThis paper will be inserted into the newspapers of Regina, Saskatoon, Edmonton, Calgary, and Vancouver.\n\nThis paper will be inserted into the newspapers of Regina, Saskatoon, Edmonton, Calgary, and Vancouver.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m. His Lordship the Bishop of Sask.\n1 p.m. Rev. Mr. Macmillan.\n\nThe Mission Chapel.\n11 a.m. Rev. Mr. Wright.\n12 noon. Rev. Mr. Clark.\n1 p.m. His Lordship the Bishop.\n\nSt. Catherines.\n11 a.m. Rev. Mr. Campbell, B.D.\n1 p.m. Rev. Mr. Smith.\n12 noon. Rev. Mr. Macmillan.\n\nSt. Andrew's.\n11 a.m. Rev. Mr. Macmillan.\n12 noon. Rev. Mr. Macmillan.\n\nSt. John's.\n11 a.m. Rev. Mr. Macmillan.\n12 noon. Rev. Mr. Macmillan.\n\nSt. James'.\n11 a.m. Rev. Mr. Macmillan.\n12 noon. Rev. Mr. Macmillan.\n\nST. ANNE'S, R.C. CATHOLIC.\n11 a.m. Rev. Mr. Macmillan.\n12 noon. Rev. Mr. Macmillan.\n\nST. PAUL'S (Presbyterian).\n11 a.m. Rev. Mr. Macmillan.\n12 noon. Rev. Mr. Macmillan.\n\nFRIDAY, JANUARY 22, 1886.\n\nSCHOOL TRUSTEES\n\nSome confusion appears to exist with regard to the election of School Trustees in the County, anticipating the difficulties which a new Ordinance on the 14th December, of which paragraph 2 reads, \"All School Trustees holding office at the passing of this Ordinance shall hold office until their successors are elected under any Ordinance now in force in the Territories.\" This was intended to carry on the existing Trustees until next October, when the election would take place under the Ordinance of 1885. In view of this, many school districts held their elections under the Ordinance of 1883, and can now get no magistrate to legalize their action according to that Ordinance. Some have only formally signed up their commissions, but in the absence of any authority to swear them in under the new regulations, could not act, and Mr. Hughes—who was sworn in at Regina—could not do so as his commission had not come to hand.\n\nIt is announced that a baronetcy has been conferred on Mr. George Stephen, president of the Canadian Pacific Railroad. The honor is well deserved. Mr. Stephen has from the first had firm and unflinching confidence in the future, and he has done so much to hasten its realization, and consequently in the future of the country through which it runs. Rewards of this kind are usually given for distinguished services to one's country, and certainly from this standpoint, Mr. Stephen is deserving of the honor conferred upon him.\n\nC. A. Paterson has been gazetted Brigade Major of the 5th District. He was in the North West during the rebellion.\n\nCONGREGATIONAL MEETING\n\nThe annual meeting of St. Paul's Presbyterian Church was held last Wednesday evening. Rev. Mr. Macmillan, LL.B., presided. Owing to the severity of the weather, the attendance was only fair. One notable feature, however, was the presence of the ladies. The minutes of the previous annual meeting were read and adopted. Mr. McTaggart was appointed Congregational Secretary in place of Mr. Napier. The treasurer's annual report was read and adopted, showing a good surplus carried forward. Messrs. A. H. Clark, F. C. Baker, J. Campbell, J. F. Knowles, R. Dick, and Mr. McTaggart were elected managers. It was decided to increase the number of elders. The question of allowing the Ladies' Aid Society to hold a Burnt Quarter service in the church was earnestly discussed, but owing to the hostile feeling of a few towards it, the committee declined to make the application. A vote of thanks was tendered by Mr. A. H. Clark and unanimously carried, to the organist and choir for the very kind and efficient manner in which they have attended to their duties during the past year. The meeting then adjourned.\n\nMaj. Bell's claim for transport has been valued at $1,000 without $100. This does not include his private claims, which are large.\n\nCURLIANA\n\nSeveral very interesting games of curling have been played recently, some of which follow are the scores:\n\nPRESIDENT V. VICE PRESIDENT.\n1. Mr. Smith, 10; Mr. Brown, 10.\n2. Mr. Johnson, 10; Mr. Taylor, 10.\n3. Mr. Campbell, 10; Mr. Knowles, 10.\n4. Mr. Macmillan, 10; Mr. Napier, 10.\n\nMajority for Vice President.\n\nSASKATCHEWAN VS. ASHLEY.\nPlayed on the Ashley Rink, the Ashley having the brown for last year.\n\n1. Mr. Smith, 10; Mr. Johnson, 10.\n2. Mr. Campbell, 10; Mr. Taylor, 10.\n3. Mr. Knowles, 10; Mr. Napier, 10.\n4. Mr. Macmillan, 10; Mr. Brown, 10.\n\nMajority for Ashley.\n\nThe return match was played this week on the Saskatchewan Rink, when the Saskatchewan were again victorious. The day was very fine and the ice exceedingly good, some splendid shots being made by players on both sides.\n\nMaj. Bell, 10; Mr. Smith, 10.\nMr. Johnson, 10; Mr. Campbell, 10.\nMr. Taylor, 10; Mr. Knowles, 10.\nMr. Napier, 10; Mr. Macmillan, 10.\n\nMajority for Saskatchewan.\n\nMr. T. E. Baker won the medal in the single-handed match.\n\nSHIRPS OF LAND\n\nUnder and by virtue of a writ of Possession issued by the Lieutenant Governor in Council, dated the 1st day of January, A.D. 1886, the seat of James Macintosh, Esq., late of the town of Prince Albert, and in our district, I have caused to be served upon the said James Macintosh, Esq., and his heirs, executors, administrators, and assigns, the following notice:\n\nNotice is hereby given that the said James Macintosh, Esq., late of the town of Prince Albert, and in our district, has been adjudged insolvent, and is now in the hands of the Receiver General, Prince Albert.\n\nJ. M. Macmillan, Esq.,\nReceiver General.\n\nW. B. MUNN,\nAttorney for Plaintiff.\n\nWANTED\n\nIMMEDIATELY, A SERVANT GIRL\n\nTo whom liberal wages will be paid.\n\nApply at\n\nThe Times Office.\n\nNOTICE\n\nIn addition to the Acts mentioned in the schedule to \"The North West Territorial Act, 1880,\" as being applicable to the North West Territories, the following Acts of Parliament of Canada have been extended by Proclamations to the said Territories, namely—\n\nOn the 29th August, 1882,—\n\n31 Vic. cap. 69, intituled, \"The Fisheries Act.\"\n\n30 Vic. cap. 65, intituled, \"An Act for the Regulation of Navigable Streams and Rivers.\"\n\nOn 26th April, 1883,—\n\n22 Vic. cap. 70, intituled, \"An Act respecting Vagrants.\"\n\n37 Vic. cap. 37, intituled, \"An Act for the Relief of Voluntary and Extra Judicial Outlaws.\"\n\n37 Vic. cap. 43, intituled, \"An Act to regulate the sale of liquor.\"\n\n44 Vic. cap. 21, intituled, \"An Act to provide for the better protection of persons with hard labor in the custody of certain telegraph companies.\"\n\nOn the 9th July, 1883,—\n\nThe 13th, 16th, 18th, 19th Sections of 32nd Vic. cap. 10, intituled, \"An Act to provide for the administration of Criminal Causes, and other matters relating to the Police Force.\"\n\nOn the 17th July, 1883,—\n\n45 Vic. cap. 20, intituled, \"An Act to provide for the better protection to be taken by Employers on Telegraph Lines under the control of the Government, and for the better protection of Telegraph Operators and keepers of Telegraph Lines against certain telegraph companies.\"\n\nBy Command of His Honour the Lieutenant Governor of the North West Territories,\n\nA. E. FORGETT,\nChief of Council.\n\nRegina, January 30th, 1886.\n\nPROCLAMATION\n\nVICTORIA, by the Grace of God, of the Kingdom of Great Britain and Ireland, QUEEN, Defender of the Faith, &c.\n\nE. D. KENNEY,\nLieutenant-Governor.\n\nTo all whom these presents shall come or whom the same may concern,\n\nGREETING:\n\nWhereas by Section 1 of Ordinance No. 16 of 1881, entitled \"Act to provide for the better protection of persons with hard labor,\" it is in effect declared that the Lieutenant Governor may designate any part of the said Ordinance by proclamation the portion thereof which shall constitute the boundaries where, and on, and from such time or times as the said Ordinance shall come into force and effect.\n\nAnd whereas application has been made to me to have the said Ordinance put into force in the portion of the North West Territories.\n\nNow know ye, that under and by virtue of the powers imposed upon and vested in me by the said Ordinance, I do hereby proclaim and declare that the said Ordinance, No. 16 of 1881, shall come into force and effect from the date hereof, as of the following portions of the North West Territories, namely—\n\nWest of the Second Principal Meridian:\nTownships numbered 45, 47, 48 and 49, in Ranges 23, 24, 25, 26, 27 and 28.\n\nWest of the Third Principal Meridian:\nTownships numbered 46, 47, 48 and 49, in Ranges 23, 24, 25, 26, 27 and 28.\n\nOf which all persons whom these presents may concern are hereby required to take the oath of allegiance and govern themselves accordingly.\n\nGiven under my hand and the Seal of the North West Territories, this twenty-third day of January, in the Year of our Lord one thousand eight hundred and eighty six.\n\nBy Command,\n\nA. E. FORGETT,\nChief of the Council.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 17 feet extra.\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWARD BROS.,\n\nTRADERS,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST.\n\nLAST NOTICE.\n\nAfter the 31st December all the old firm accounts will be handed over for collection.\n\nSTEWARD BROS.,\n\nA FAIR WARNING.\n\nAll Parties indebted to\n\nT. E JACKSON\n\nwho fail to settle before the Fifteenth of FEBRUARY will be sued at the next Court without any further notice.\n\nT. E. JACKSON,\nNew Stand, in the building lately occupied as a Post Office.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nA LARGE STOCK OF Watches, Clocks and Jewellery.\n\nKEEP CONSTANTLY ON HAND\n\nRepairing Promptly Attended", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886012201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 4532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3025, 2], [3025, 6275, 3], [6275, 16393, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]