[{"id": "7ed5efb2323b349a0c9a4fce527a0ecb4f92dc24", "text": "NORTHERN INDIANS.\n\nWe desire through our columns to call the attention of the Government to the condition of the Indians in the northern portion of this district. There are a large number of Indians in the northern part of this district who have other interests than those connected with the lands which they occupy. They have been treated with kindness and consideration by the Government, but they have not been able to secure the benefits promised them under the treaty. They should be treated with kindness and consideration, and their claims should be settled promptly. We urge upon the Government the claims of these Indians, and we hope that they will be treated with kindness and consideration.\n\nNORTH WEST SENATORS.\n\nThe appointment of Mr. R. Hardisty of Edmonton to the Senate is a good one, and there has been considerable discussion as to whether he will be able to represent the interests of the Indians in the Senate. We believe that he will be able to do so, and we urge upon the Government to give him every possible assistance in carrying out his duties.\n\nTHE VAGRANCY CASE.\n\nSir, Please allow me to say that I have been informed that a case of vagrancy has been brought before the Court of Queen's Bench. The defendant is charged with being a vagrant, and the charge is supported by evidence. We urge upon the Government to take steps to prevent such cases from occurring in the future.\n\nClearing Parlor Stoves\n\nBox Stoves\n\nFancy Goods\n\nThese Goods are now on Sale\n\nCall early and see our new display\n\nTHE TIMES\n\nSASKATCHEWAN REVIEW\n\n$2.50 PER YEAR\n\nTHE TIMES\n\nDAILY NEWS\n\nTHE GLASS COMPANY\n\nAND THE LEADING NEWSPAPER\n\nFRIDAY, JANUARY 13, 1888.\nJ. M. CAMPBELL\n\nIn now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods\n\nEver yet shown in Prince Albert.\n\nDress Goods\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nWincies, 10c to 40c.\nVelvets, Satins, Ribbons,\nAll Prices and Shades.\nLADIES', MISSES' AND CHILDREN'S\nWool Hoods and Clouds\nIN ENDLESS VARIETY.\nReady Made Clothing\nOF THE LATEST STYLES.\nGENTLEMEN'S\nFancy Underclothing\nAT PLAIN PRICES.\nBoots and Shoes\nAND THE FINEST ASSORTMENT OF\nMitts and Moccasins\nIN THE TOWN.\nGlass and Crockery\nA LARGE STOCK OF\nFLOUR!\nOats, Wheat and Barley\nJUST RECEIVED.\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nH. MACDOUGALL\n\nSASKATCHEWAN DIRECTORY\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matche, Dresse and Ureased.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 19 feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheap any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nThe great problems which must for many years engage the attention of the Northwest are problems of transporta-\ntion. It is essential that the Government should approve of the scheme to secure a new line between Winnipeg and the United States, because it holds that the con-\nstruction of such a line would be a great\nplighted faith, would divert trade to the\nUnited States, which would be kept in\nCanada, and injure the trade of Manitoba\nand the Territories for the benefit of\nWinnipeg, and would work injustice to\nwestern Canada. The country needs new railways in unprovided dis-\ntricts more urgently than it can com-\npensate for the loss of western Manitoba.\n\nThe Saskatchewan, especially its north branch, runs through the richest part of the Northwest. The soil for a thousand miles along its banks is as favorable as those of Manitoba, and the conditions are much more favorable to pioneer settlement. The Government has nothing to say in condemnation of the Canadian pioneers. They are as\neasy as any in existence, and will in a few\nyears have made progress in their com-\nmunities. But the pioneer—especially the pioneer with limited means—finds\nnear the mouth of the river a better field\non the open prairie. On the latter he\nhas no lumber for his house, no water\ntill he digs a well far from the river's\nsource. Along the river he finds good\nwater in abundance, logs for the walls of\nhis house, and so soon as a decent house\nis built, lumber is easily floated down\nthe river in snow.\n\nThe presence of timber does not diminish\nthe labor of clearing the land, for while\nthe soil of the river bank is fertile, the\nother is arid. It is a singular fact\nthat that bank of the river which faces\nthe sun is always more productive than\nthe northern exposure is wooded. The the-\nory is that on the bank having a river\nside exposure soil repetition occurs,\nand there is a greater rate of expansion and contraction, which tear\nthe roots from the trees and destroy them.\nOn the bank facing south, or another\nexposure the snow lies longer, protecting\nthe young trees and summer fairly sets\nin on that side, thus promoting vegeta-\ntion. At all events, whatever the theory\nmay be, the facts for the settler near a river\nhave been proven by experience. While\nthe prairie settler must spend considerable money for material with\nwhich to build his house, he is doing\nwell. The settlers in Manitoba have\nsettled along the banks of rivers, and\nthose who emigrated to the prairies across\nthe river, and never regretted till they reached the Saskatchewan.\n\nThe importance of opening easy and\ncheap communication with the West\nof the Saskatchewan is manifest, and it is\ncertain that this communication should\nbe by rail. The Saskatchewan is naviga-\nble, and will be found to be extremely\nuseful to the settlers. Lake Winnipeg\nis also navigable; but the route between\nWinnipeg and Prince Albert is very\ndifficult and so difficult that a railway is an\nabsolute necessity. At the mouth of\nthe lake there is a river so wide that\nthere are six feet of water at low tide,\nand above the mouth of the Saskatchewan\nis a rapid wholly impassable by steam\nboats, so that the steamer would have to\nunload and send their passengers and\nfreight over a distance three or four\nmiles to the nearest point where river\nboats. Even if a canal was built around this rapid, little benefit would\nbe derived from it because the light-\ndraught boats which navigate the\nlow river dare not venture out upon the\nlake. Further, boats leaving Winnipeg\nserve as habitations for the Indians, they\nreach the neighborhood of Prince Albert,\nwhile a railway will pass through a rich\ncountry, and will be able to be com-\npleted and will then supply traffic to\nthe road. The Marquis and Northwestern\nrailways are now building a line westward\nin the direction of Prince Albert, but\napparently the company finds it difficult\nto raise funds to prosecute the work.\nThis scheme will probably be completed\nby Federal aid might properly and benefi-\ncially be extended, so that the line might\nbe extended to Prince Albert at the\nearliest possible date.\n\nPrince Albert is the natural gateway\nto the rich lands further west of the\nNorth Saskatchewan. But little habi-\ntated country lies between it and Lake\nWinnipeg; but west of it the land is\ngood, in the very base of the Rocky\nMountains. Routes ascend the river to\nEdmonton, a distance of 600 miles above\nPrince Albert, and these can supply set-\ntlements at such times as the popula-\ntion shall be strong enough to construct\na railway.\n\nIn course of time a railway must\nbe constructed from Prince Albert will become\nnecessary. Such a line will pass near\nthe mouth of Lake Winnipeg, touch the\nMarquis line, and continue thence in a straight line to Quebec.\nBut this project must wait until\nthe Marquis line is completed. The\nSaskatchewan valley at Prince Albert are ur-\ngently needed, and to the solution of\nthis problem the people of only the\nwest of the old Canadian provinces\nwould give their best thought.—Hamilton\nSpectator.\n\nLOCAL NEWS.\n\nT. O. Davis is not going out of busi-\nness, but expects to do legitimate trade.\nOn Wednesday evening Mr. A. Cole,\nMr. J. H. Smith, and Miss McNaughtan,\ndaughter of Mr. Wm. McNaughtan of the Lower\nTown, attended the wedding of Miss\nMcNaughtan's father by the Rev. Mr. Campbell.\nA number of the young people from the\nLower Town attended the ceremony.\nThe bride came to the church in a carriage\nand was conducted to the church by her\nfather. After the ceremony she was\nreceived by the Rev. Mr. Campbell.\n\nAnother wedding of Prince Albert's\nyoung people have been joined together\nin the happy bonds of matrimony. On\nSaturday afternoon Mr. and Mrs. Neilson\nled the altar Miss Kitty Ballantyne\nwhom the groomsman had tied to the\nRev. Mr. Campbell, after which they\nwere united in marriage by the officiating\nMr. Neilson whom they were\nmarried by the P. A. C. band. We wish\nevery couple long life, happiness and\nprosperity.\n\nWhy pay 50 cts. and 75 cts. for tea,\nwhen you can get 3 pounds for 10 cts. T. O. Davis.\n\nOn Thursday evening had a Christmas\nentertainment was given to the\nchildren of St. Allan parish by their\nkind pastor and friends. The children\nwere treated to a variety of songs and\nwere a partake of the hospitality of\ntheir hostess in another room. The\nyouths present thoroughly enjoyed the treat.\nEvery one was most delighted with\ntheir presents and the evening entertain-\nment.\n\nIf you want to begin the New Year\nright, buy your goods at T. O. Davis.\n\nP. T. BARNUM'S NEW STORY.\n\nThe opening chapters of a splendid\nadventure for the young, by the famous show-\nman, P. T. Barnum, appears this week\nin the columns of The New York Family\nPaper. It tells of the adventures of an American boy, whom\nMr. Barnum calls \"My Plucky Boy Tom,\" who had to face the dangers of the\nwild, and save animals to replace\nthose destroyed by the disastrous fire at\nBarnum's Park last month. The reader is\nthrilled by the heroics of this\ndauntless American boy when cap-\ntures the fiercest and wildest animals\never to appear in the New York\nFamily Paper. This story is for\nsale at all news-stands.\n\nCURLIANA.\n\nThe second match of the team was\nplayed on Tuesday afternoon—Married\nto Single members of the Club—for\nPresident, J. L. Robertson. Good play\nwas made by both sides, but at the\nend of the game the benefits had\n\"opped up\" for a party of four\nbeer.\n\nGood butter at 25 cts. per pound at\nT. O. Davis.\n\nFOR NEW GOODS\n\nAnd Close Prices go to\n\nJ. R. McPHAIL'S.\n\nThe balance of our Heating Stoves and Drums will be sold at\ncost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes,\nClothing or Groceries, call on\n\nJ. R. McPHAIL.\n\nBuffalo Hall!\n\nGETTING READY FOR THE HOLIDAYS\n\nOur last week's advertisement had the desired effect. Many new customers\ncalled, and orders were made from our long range of goods. We will\nshow choice selections in\n\nLadies' Staple and Fancy Lines, which must be sold\n\nThis week we will devote attention towards reducing our\n\nCOMFORTER, BLANKET & BLANKET GOODS\n\nAnd Our Mammoth Stock of Men's Wear in\n\nFull Suits, Odd Pants, Overcoats, Underclothing,\n\nFur and Cloth Caps, Mitts and Moccasins.\n\nOur Grocery Department will now be given in any of the above goods. Our Grocery\n\nChoice New Season Grogans, Byron and Blend Teas,\n\nRio Java and Mocha Coffee pure and fresh ground daily\n\nAnd a full line of all other Staple Groceries and Candy Goods. Never\nbefore in the history of our store have goods been offered in such quantities and at\nsuch reduced prices. We urge our patrons to come and see us and\nput their money only where they can get variety and value.\n\nBETTS & GWYNNE\n\nIMPORTANT NOTICE.\n\nOwing to the long delay of our goods in transit, we have made a sweeping\nreduction in every department consisting of:\n\nPlaques, Velveteens, Dress Lawn, India Linen, Muslin,\nIrish Diaper Linen, Cashmere, All-wool Dress Goods.\nFurniture Cretonne, Pillow Cotton,\nWhite and Grey Flannel, Boys' and Men's Top and\nUndershirts, Tapestry Carpets and Mats,\nLadies' Winter Jerseys, Boys' Jersey Suits,\nLadies' and Gentlemen's Persian Lamb Caps.\n\nR. C. WIGMORE & CO'S.\n\nRobertson\n\n& Robertson\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\nTrowering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINENS.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888011301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5628, "total-output-tokens": 3216, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1663, 2], [1663, 2929, 3], [2929, 12462, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]