[{"id": "589ca9caa23475a8fd55b4fd444af019069055cf", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 3, 1884.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nOF Macarthur & Knowles,\nPrince Albert, N.W.T.\n\nNOTICE\n\nPrince Albert, August 30th, 1884.\n\nIn pursuance of an agreement previously entered into on the 1st day of July, 1884, between W. R. Bell and the undersigned, the undersigned has been engaged to construct the said building at Prince Albert, which has been completed as per contract by the firm of Smith & Co., and the undersigned will be paid by me, but am in no way responsible for any damage or loss occurring during the construction of said premises, and all workmen employed shall be paid by me, but am in no way responsible for any damage or loss occurring during the construction of said premises, and all workmen employed shall be paid by me.\n\nW. R. BELL.\n\nSASKATCHEWAN CURLING CLUB.\n\nTake notice that the Annual Meeting of the Saskatcheewan Curling Club will be held at the residence of Mr. J. B. Elliot, on Wednesday next, the 7th inst., at 7 o'clock p.m., for the purpose of electing officers, considering annual financial statement, and the transaction of other very important business. Every member is expected to present himself at the meeting.\n\nA. SPROAT.\n\nSHEEP LOST!\n\nSEVEN SHEEP.\n\nPrince Albert, Sept. 17th, 1884.\n\nSparks from the Horse Shoe.\n\nSent a card from another place, saying I am your brother. For the same reason I am yours. All into the name is yours. Ah! my friend's very true. You are my brother, rich and poor alike. I say, brother, you must come back. But come from the land of snows. For here forevermore resemblest me. In the far distance, I see you. Cloaked by far-fetched mystery. Beneath that cloak things may transpire. That cloak may hide a thousand lies. Were they, to view with naked eyes. Transcendentalists pass smoothly by. A world of pale phlegm, should stand to battle keen and keen. From the pale phlegm, pale phlegm flies.\n\nNot you by laws, must have the name. While I more sure will have the name. From the pale phlegm, pale phlegm flies. A bitward of nature.\n\nJust received new spring goods. Everything with the latest fashions. Anything and everything at reasonable prices.\n\nMILLINERY, AND FANCY GOODS.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nPRINCE ALBERT\n\nPlaning Mills &c.\nSash and Door Factory.\n\nTHOS. POWERS,\n\nCONTRACTS FOR Brick, Plastering and Stone Work.\n\nBrick and Lime always on hand.\n\nCHESTER THOMPSON,\nGeneral Blacksmith.\n\nRepairing Farm Machinery &c.\n\nJEWELLERY.\n\nRepairing Precious Articles.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nThe Freemason Lodge met on Wednes-\n\nday evening.\n\nMr. F. Baker arrived from Winnipeg on Tuesday.\n\nMessrs. Markley and Bratton have been here for some time.\n\nMr. E. Carter and ladies are ex-\n\npected to arrive tomorrow.\n\nMr. and Mrs. McLeod have returned from Edmonton and shipped.\n\nMr. and Mrs. Fritz, accompanied by their children, Miss Fritz, arrived on Tues-\n\nday.\n\nSeven sheep were lost last week between Beaver's and Prince Albert.\n\nA meeting of the Saskatchewan Curl-\n\ning Club will be held on the 7th inst.,\n\nwe are advised.\n\nWater is the cheapest and the best drink for the human body.\n\nA. McLean.\n\nMiss McLean arrived from Carlton on Saturday, and is the guest of Mrs. Swanson.\n\nMrs. A. Miller and family, and Mrs. John McLean are now visiting her on their way home.\n\nThe weather this week has been very irregular, cool, cold and rainy.\n\nIt will rain again today, and the wind will blow.\n\nThere will be a change of wind and rain, and the weather will be cool.\n\nThe annual meeting of the Argyle Curling Club was held Thursday evening, Mr. Miller in the chair. The following officers were elected: Capt. Smith, President; Mr. J. H. Smith, Vice-President; Mr. W. R. Mackay, Secretary-Treasurer; Mr. D. D. Nockolds and holy were elected directors and trustees, and the Hon. L. Clark was elected an honorary member.\n\nPOLICE NEWS.\n\nStaff Sergeant MacKay and party arrived at Carlton on Sunday with the Indians recently arrested.\n\nThe Indians were arrested from Batoche on Friday night last, and left Carlton on Sunday morning.\n\nCommissioner MacKenzie and Detachment arrived at Carlton with supplies on Monday and left next morning.\n\nSergeant Brooks and Constable Armour from Carlton with Indian prisoners.\n\nStaff Sergeant MacKay and party left this morning for Fort A la Corne, to make annual arrest of Indians.\n\nMr. MacKay left on Thursday for John Smith's reserve, South Branch, to make annual payments, accompanied by an Indian.\n\nCapt. Howe with worthy thoughtfulness has placed his men all under orders.\n\nMr. MacKay visited the residence of the quartermaster's store being turned into barracks room. The man although not a prisoner, was ordered under con-\n\ntrol, and so Howe demanded credit for the manner he looks after the control of the men.\n\nAn arrest was held within the Barracks on Wednesday last, the Hon. L. Clark, J.P.; Mr. the Bench, J. J. Maclean, Mr. MacKenzie, and Mr. MacKay in charge of having stolen arms and sold the same to Mr. Walter Carter. Mr. Carter appeared before the Hon. L. Clark on the night of September last.\n\nA 600 reward is offered by Mr. T. J. Armstrong for information as will lead to the conviction of such party or parties who stole the horse and sold the colt. (Proceedings at the residence of the Hon. L. Clark on the night of September last.)\nOUR GRIEVANCES.\n\nWe have reason to believe that the fact of our having found it necessary in the course of duty to disturb the interests of the people to discom- fortment what strongly supports of pro- fessional agitation, has been perver- sed into an intention on our part to abandon the effort to try and ob- tain redress of grievances. We think that under these circumstances it may be well once more to explain our position. At the outset we say that agitation may be divided into two classes, legal and illegal, the legitimate. The just intention of le- gitimate agitation seems to be ob- tain redress or any grievance of a public nature, which all the attend- ant causes, not being worked, would seem unsatisfactory, more speedily considered than it receives and in this we would include the granting of all rights and privileges thought essential by the public. Any constitutional agitation with such ends in view has our most hearty sympathy and may depend on our support, nor when we review our course do we wish to say such, we can understand any honest man refusing to believe in this assumption. We cannot not recall a single in- stance in which we have refused to ventilate a grievance, held to be the subject of right of the citizen, so far from this, at no time age felt it necessary to commence our articles upon such subjects with some sort of apology for hammering with such persistency in the same nails. As far back as it pleased to be the only journalists in this place, we feel that it behoves us in the discharge of our public trust to act with the greatest caution. We think the reader is looking for a con- tinuous discontinued writing up the subject of grievances may easily be seen by all who will take the trouble to think for themselves. Having drawn attention to such matters as we thought ought under our notice we gave what we considered the best advice to the public, viz., to embody their wants in the form of a petition, couched in the best respectable language and signs without excep- tion by every one interested. We further ventured to advise them in order to secure attention to a petition, that the nature the petition should divide them in sending to Ottawa to present it one or two delegates, to be men ready enough and sufficiently versed in our re- quirements to hold their own in conversations with the officials there. Whether as a consequence of our advice or not we understand that a petition of this kind is being gen- erally signed, but until we are favored with a sight of its contents we are not disposed to express any opinion about it, nor do we see that there is any use in harping in the meanwhile upon such subjects as we presume will be continued in it. Should this subject of agitation be legitimate, we will gladly put our best in its support, but we would be sorry to pledge ourselves to encour- age the harassment of any govern- ment, whether Conservative or Lib- eral, at the dictation of such men as those who country are to be guided purely from personal and selfish mo- tives trying to make tools of the people in the hope that by upsetting whatever may be the existing order of things they may turn out to their private advantage. We re- member that the development and management of our vast territories is a herculean task, so much so that the problem has not yet been solved with regard to the partially sub- Provincial of Manitoba. We further remember that great things have been done, that Cabinet Ministers and especially visiting the Territories in disguise, in the actual wisdom of the People, that the Government cannot help the interference of natural causes with the consummation of the over sanguine hopes of individuals, and also that the ordinary scope of temporary popularity to meaningless threatens, which ex- cite the amusement of the initiated and the fears only of capitalists who would develop the country, we are instructed by the men who have after war and crime and all those who have misled them, by all means let us know of all substantial grievances and we will work with all energy and zeal in the most eva- gilant way, but to protest against we will have nothing to say, specially after the result of the Far- mer's Union.\n\nThe Sun.\n\nA popular domestic journal for Ameri- can homes, will be sent for one year, (26 numbers) for $1.00, post paid. The names and address of 10 married ladies and 50 cents (no stamps taken). Best prices. No sample copies sent for examination. This offer is made only to secure names to whom to send a sample copy, and will expire only by May next, and will be sold at regular price $1.00 per year. Address\n\nThe Sun House, Rochester, N.Y.\n\nLUMBER, SHINGLES, BOARDS, SASH, MOULDS, ETC., AND ALL SORTS OF BUILDING MATERIAL, for sale at lowest prices. We are now selling two\n\nDAVIS AND CO.\n\nWholesale Lumber Dealers.\n\nHead Office - 620 Main Street, Yard, Prince Albert, Sask.\n\nMOSSEY & COMPANY, MANUFACTURERS OF STOCK and Hard Knock Blocks, Dressed, No. 1, No. 2, and Second Choice. Also, Shingles, Roofing Tin, Slate, Lamps, Hardware, etc. Special prices to subscribers.\n\nFourth Judicial District Court.\n\nDIVISION NO. 2.\n\nNineteenth Judicial District Court, Division No. 2, will be held at Prince Albert on Monday, November 3rd, 1884.\n\nJ. H. McCaffrey, Clerk of the Court.\n\nPrince Albert, Nov. 1st, 1884.\n\nGREAT OFFER!\n\nTHE WEEKLY SUN FROM DATE TO JANUARY 1, 1886\n\n$1.50 - $1.50\n\nWeekly Sun and Toronto Weekly Globe or Mail\n\n$2.00 FOR SAME PERIOD - $2.00\n\nPAYABLE STRICTLY IN ADVANCE.\n\nDuring the coming year it is the intention to introduce into the Weekly Edition of the SUN a number of NEW FEATURES!\n\nThe Best and the Cheapest of the Weeklies\n\nSAVE MONEY BY SUBSCRIBING AT ONCE.\n\nADDRESSES: Sun Printing and Publishing Co., Ltd., Winnipeg.\n\nMANITOBA WEEKLY FREE PRESS\n\nCAMPAIGN\n\nFREE FOR BALANCE OF 1884.\n\nOVER THREE MONTHS GRATIS.\n\nONLY $2 TILL 1886.\n\nTHE END OF THE MANITOBA WEEKLY FREE PRESS ON THE THIRTEENTH DAY OF EVERY MONTH.\n\nThis offer yet makes no conditions whatever.\n\nThe subscriber agrees to pay the full amount from time to time for the number delivered, giving to the owner the right to deduct from the amount nothing.\n\nThere is another offer which is immediately accepted by a number of subscribers and which is offered at the same rate, viz., that of the Weekly Free Press from December, 1884, to March, 1885, inclusive, and will be sent to all subscribers who will agree to pay the sum of $2.00 for each number delivered to them during the period of six months, which will begin immediately following the publication of the last number of the Weekly Free Press for December, 1884.\n\nThe Weekly Free Press is the oldest newspaper published in North-West Canada, and is now in its twenty-first year of publication, and has always been conducted in a spirit of impartiality towards all parties; and its circulation is second to none in the Canadian West.\n\nThe Weekly Free Press is the oldest newspaper published in North-West Canada, and is now in its twenty-first year of publication, and has always been conducted in a spirit of impartiality towards all parties; and its circulation is second to none in the Canadian West.\n\nThe Weekly Free Press is the oldest newspaper published in North-West Canada, and is now in its twenty-first year of publication, and has always been conducted in a spirit of impartiality towards all parties; and its circulation is second to none in the Canadian West.\n\nHOW TO SUBSCRIBE.\n\nThe Weekly Free Press is a newspaper published in Winnipeg, Manitoba, and is the oldest newspaper published in the Canadian West.\n\nP.S. Don't forget that the paper that should be sent to the subscriber is the weekly paper that should be sent to the subscriber at the end of each week.\n\nPRINCE ALBERT, SASK.\nCORRESPONDENCE\n\nFrom Medicine Hat to Mount Laggan.\n\nLeaving Medicine Hat for the West, the train passes over the beautiful and substantial river bridge, crossing the River Saskatchewan, and afterwards enters the long steep gradient on the north bank of the river until the level prairie lands are reached. Onward to Crowfoot, the long prairie stretches away, and at other times greatly rolling prairie, while here and there an occasional small lake or pond breaks up the monotony of the aspect. Here let me state that what struck me most was, that while between Medicine Hat and Medicine Hat, the prairie grass presented a dark and shrivelled appearance, the land from Medicine Hat to Crowfoot was covered with fresh green grass, highly suggestive of the power of the country for stock raising. In fact I expect that in a few years Alberta will be the greatest sheep and stock raising countries in the world. At Crowfoot there is a beautiful church (fringed with trees) overlooking the valley below the prairie level. Here to the south of the line a settler has made his home, and has erected a house of the simplest kind, but handsome, and the white fence behind gives a very pretty effect. It is proposed to make a stage road to Crowfoot, and there is a circumstantial of the above mentioned pioneer. A church is a very good place to meet at, and I believe they have a good station and could easily still a station house and a few acres of land, which would be worth a great deal. The C.P.R. experimental farm here has been a great success, in fact being the best. For what reason I do not know, but the crops of four feet to ten feet six inches with a heavy head; while ours are not anything higher; turnips, cabbage, tomatoes, etc., are superior crops, although the last crop has improved more than a little. I am told that the climate of the country near Calgary is very healthy. Near to Southam there is a very large store with many goods displayed. From Eastend onwards, on our journey this far, we passed several groups of Blackfoot Indians, who were very friendly about Calgary and also about a number of other attractive matters of interest to me in one of the back issues of your valuable paper. But there is no doubt that there is a great difference between Calgary of today, and the Calgary of a year or two ago. A lumber yard is now being built, and the river has expanded and grown in the shade of the old frontier looking sections of big logs, which are now being distributed throughout Calgary. The new town has a bright, airy appearance, with comfort and prosperity strongly marked upon every face. The main street is all dotted with herds of cattle and horses. It would take a very small effort on the part of the authorities here to suppose he had hitherto been transported into some of the wildest parts of the country. We came from Calgary to Mount Laggan, a distance of 117 miles, was then the pleasantest and most interesting part of our long trip. The scenery along the river below the windings of the broad, rapid running Red River, crossing it many a time before Laggan, was very beautiful indeed, with vast verdure and was policed reflecting to eyes, dallying by graceful curves, and the river itself was a sight of timber and change of scene. Change of scene is met by now and again, a succession of views, having the river being clear and smooth, and flowing by the banks on the most beautiful of the river, we got our first glimpse the Rocky Mountains, which were seen in the distance, their ruggedly marked forms outlined against the sky, clad with snow, and shining in the sunlight. The river flows among interlaced at once, their white gleaming back being made more intense by the contrast with the grandeur of the mountains beyond. The way as passed a small farm, but the crops of barley and corn, both excellent, and the wheat was grain, but all second crop making has been successfully carried out, so as to earn by the farmers a good living. The train runs all through the valley. From Calgary to Kamassak the train passes through the valley, the hills of the Rockies rising on each side, some of them clad to their summits with trees. At this point the celebrated Rocky Mountains, but were disappointed in not seeing any of the cattle herds, however, we saw a herd of large cattle on horses ranging in the range. At Kamassak the train was brought to a stop in order to allow the passengers an opportunity of seeing the Falls of the Kamassak River. They were very impressive, the falls pouring down in great volume and velocity, the large rocky shelves, and then slowly down through a gap in the living rock, to be levelled out in the river below. A party belonging to the party tried hard to take photographs of the Falls, but he failed, owing to the fact that the camera instrument steady, the motion of the water through the gap being a feature of the scene. On the following day, Sunday, the Rev. Thomas Lang of Inverness, Scotland, conducted services in the Palace, who preached a very moving discourse, which was heard for the place and occasion. At Kamassak the mountainous scenery is very striking, and the view whatever of the border of the valley we are so shortly to enter. Midway between Kamassak and the town of Calgary, the train passes through high peaks and enters the real valley of the Bow. On everybody is the same impression of the grandeur and beauty of the scene, and looking at them one can hardly comprehend their immense size. The thick forest of pine and spruce, for a space of several miles, and then the river, which flows down them to stop, seem like a miniature river, which indeed it is almost impossible to imagine the size of the original. When the locomotive, which is always a welcome sight, appears on the opposite side again, an enormous peak rises up, and in the far distance, at Dartil, the summit horizontally closed by the mountain, after ascending, in several places, succeeding continues all the same, and the whole scene is one of grandeur and beauty, overlooking the Mountain range, which is a picture of purest delight. As I did not have the chance I cannot give an account of the scenes, etc., but from the train, the scenery is very beautiful, and the town of Calgary, in the name of the Miners House, Castle Park Hotel, and Queens Hotel, situated in the midst of the town, is very attractive. We arrived at Calgary, the largest town in the west, and the most populous, and the most attractive. We arrived at Calgary, the largest town in the west, and the most populous, and the most attractive. We arrived at Calgary, the largest town in the west, and the most populous, and the most attractive.\n\nCanada Pacific R'y Co.\nWestern Division.\nTRAIN SERVICE.\nCHANGE OF TIME.\nOn and after Feb. 16th, 1884, trains will move as follows:\n\nGoing West\n12:30 p.m. Winnipeg\n1:30 p.m. Portage la Prairie\n2:30 p.m. Brandon\n3:30 p.m. Dauphin\n4:30 p.m. Winnipeg\n5:30 p.m. Portage la Prairie\n6:30 p.m. Brandon\n7:30 p.m. Dauphin\n8:30 p.m. Winnipeg\n9:30 p.m. Portage la Prairie\n10:30 p.m. Brandon\n11:30 p.m. Dauphin\n\nGoing East\n7:30 a.m. Winnipeg\n8:30 a.m. Portage la Prairie\n9:30 a.m. Brandon\n10:30 a.m. Dauphin\n11:30 a.m. Winnipeg\n12:30 p.m. Portage la Prairie\n1:30 p.m. Brandon\n2:30 p.m. Dauphin\n3:30 p.m. Winnipeg\n4:30 p.m. Portage la Prairie\n5:30 p.m. Brandon\n6:30 p.m. Dauphin\n7:30 p.m. Winnipeg\n8:30 p.m. Portage la Prairie\n9:30 p.m. Brandon\n10:30 p.m. Dauphin\n11:30 p.m. Winnipeg\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n$2 50 PER ANNUM.\nThe Times is the best medium in the Territory to advertise your business in.\nAdvertise in The Times and you are certain to succeed in your business.\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply.\nSPINK & MAVEETY, - PROPS\nRIVER ST., PRINCE ALBERT, SASK.\nPUMPS !! PHOTOGRAPHS !\nChas. E. Page.\nNEW STUDIO\nEAST END.\nNOTICE.\nI hereby certify that all my accounts are now closed, and that all monies advanced to me are requested to settle the same immediately, if not paid, will be added to my next statement.\nN.B.-On and after this date I will keep no book accounts. Terms strictly cash.\n\nWM. GORDON\nApril 16th, 1884.\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the correctness or propriety of any correspondence to be received by the Editor.\n\nNOTICE.\n\nI beg to notify my customers and the public generally that I have REMOVED my stock to \"TRUSTON HOUSE,\" and have now on hand a full line of Hardware, Stoves and Stovepipes, at greatly reduced figures. All overdue accounts are now closed.\n\nT. J. AGNEW.\nESTATE\nJ. O. DAVIS & CO.,\nASSIGNED.\n\nACCOUNTS\n\nAll accounts not paid by October 1st will be placed in lawyer's hands for suit. There will be no exception.\n\nFOR SALE\n\nA well-built, used MARE AND COLT,\nP. THOMAS,\nAgent for Trustee.\n\nO. E. HUGHES\n& CO.\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and Youths Clothing.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING ON HAND.\n\nASH & ROBBINS,\n360 Fulton St., Brooklyn, N.Y.\n\nKNOX & BARKER,\nCARPENTERS ETC.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\nPUMP ON WATER.\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\nPrince Albert.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE Victor Well Boring & Rock Drilling Machinery, and will bore and drill ANY REQUIRED DEPTH. They will bore successfully and satisfactorily in all kinds of Earth, Soft Sandstone, Limestone, Bituminous Stone Coal, Slate, Hard Pan Gravel, Lava, Boulder, Serpentine and Conglomerate Rock. The Machinery is simple in construction, easy to operate, quiet in use, light running, simple in construction, easily operated, durable and acknowledged as the best in the world. They are also extensively used in Prospecting for Coal, Gold, Silver, Coal Oil and all kinds of Minerals, and for making Artesian Wells and Coal Shafts, &c.; they are unequaled. We also make and sell all kinds of Iron and Steel Works, Tools, Plows, Harrows, Ploughs, Mowing Tools, Portable Forges, Rock Drills and Machinery of all kinds.\n\nGood Agents wanted in every part of the World.\n\nAddress VICTOR WELL AUGER & MACHINE CO., 511 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nBuffalo Hall!\n\nHosiery, Gowns and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Mistletoe Navy, Golden Rule and Big Banana Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & GWINNE.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS AT J. L. JOHNSON & CO.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scyts', Snaiths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED A LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nREADING ROOM.\n\nIt seems probable that the agricultural society will have the use of the building for the reading room next year as the reading room of the Young Men's Literary Association, and it now becomes a matter of immediate importance to see what will become of the property of the society now present in the building. What is everybody's business is of course none's business, but if there are no trustees of the society surely some members of the community may be here, ought to meet and consider how they should be able to take care of the erection of the building in the meanwhile and the revival of the society this coming winter. It will certainly be a great loss to the city if the society which worked so well and was so handsomely provided with literature and other things is allowed to die away, from lack of interest on the part of the public. There certainly is an opportunity at good healthy improving forms of recreation on hand, as to justify its existence.\n\nNew in Mike Candy.\n\nThis book gives full directions for making all kinds of plain and fancy candy. The recipes for making caramel, chocolate drops, French mixed nuts and all other kinds of candy contained in this book are given in such a manner as to make it easy for anyone to make them. Any one can have the number at home at less than one third of the price of the book. Price 50 cents (no stamps taken). Address, Bucumaker Publishing Co., 32, 33, A Mifflin Block, Rochester, N.Y.\n\nROYAL BAKING POWDER Absolutely Pure.\n\nThis Powder never causes a matter of party, strength and whiteness. Many persons have found that Royal Baking Powder cannot be had in connection with the use made of it, and therefore they prefer phosphate powders. Sold only in cases.\n\nRoyal Baking Powder Co., 180 Wall St., New York City.\n\nM. M. COMMUNICATOR CHURCH.\n\nServices Evening 7 p.m. at the Mission.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884100301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 6433, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5369, 1], [5369, 13131, 2], [13131, 21547, 3], [21547, 26325, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]