[{"id": "b20bdbc93fe4622ac65d0d6accba4f540c6c4fe1", "text": "THE PRINCE ALBERT TIMES\n\nRUMORS OF WAR\n\nIt looks very much as if England were going to have another war again with the Zulus. Coronation has come home, has been anything but warm. His kingdom is to be divided up and a very large portion of it given to John Dunn, between whom and Cetewayo there never has been much peace. This will make an occasion for bad feelings, and it is impossible to tell what complications it may lead. The British residents will have all they can do in the endeavor to keep the peace. And to this end the Transvaal Boers are far from satisfied with their relations to Great Britain and the surrounding tribes, and ask that the Transvaal Convention may be revised. Lord Kimberley's reply to the deputation was not very well received by the Boers. He spoke well for the success of the appeals made to the British Government, nor does it seem much in the mood to make concessions to the Boers. A rupture with England may be the usher of all that cannot be obtained by negotiation may be attempted by force. Such is the nature of the Boers. Their success in the recent troubles in Zululand may lead them to think that they are making in their own hands, and may encourage them to put Great Britain in defiance. That another war in that country may be averted is sincerely to be hoped, but should such an outbreak unhappily take place, the prestige gained by the former disturbance will assist materially in quelling it, and that, too, in a much more summary manner.\n\nEXIT THE SUNFLOWER.\n\nOscar Lewis is said to have taken forever of the sunflower of the western continent some $2,000 better off than when he arrived. Not at all a bad sum for one short season's work, and goes to show that the apostle of the sunflower was not in common patronage of a fool as he looked. He came to America with an avowed object—that of educating the people up to a high idea of the beautiful. The beautiful in him meant the avoidance of wearing of long hair, loose breeches and silk stockings, and an adoration of the sunflower. The people were to be educated up to all these from purely and philanthropic motives solely. But Oscar turned out not to be poet play after all, but with the ordinary mortal's barking after the filthy dross. Now, why did Oscar take up the sunflower as his idea of beauty, and not the turnip or the cabbage? Why did he say the business take up the onion? The onion has been a long abused vegetable, although a healthy, succulent and nutritious one, and in some infectious diseases has often proved a great help. The onion has few equals. Had Oscar only had gumption enough he would have adopted that vegetable, whose name in polite society is scarcely ever heard except along the highway and thereby revolutionary publication, added considerably to his triumph and given to the onion that place to which it has been long and fairly entitled. But, joking apart, what has Mr. Wilde taught American people? Simply this, that they are about as sagacious a nation as any that can be found. They may contemplate the sunflower in secret, but Oscar openly gets away with the dollars. That's the trouble with that place where Oscar educated himself—the more practical. Dressed in medieval costume our fair American cousins have been sitting at the feet of this modern Cassablan seeking to draw inspiration, and attain to the highest perfection by the contemplation of sunflowers, old teapots and cracked china. Now that their aesthetic deportment they are gradually losing, and realizing that the sunflowers, their china and old teapots are not as badly cracked as were the heads of their owners for the time being. The aesthetic craze, the popular craze as it was called, was about over, and we are nearly sure that the last of it has been seen in America. It was a paying business for Oscar, though, while it lasted, and now he has returned to his manufactory ($3,000), Vail's. What's that? What will the next craze be? Who can tell? It all goes to show how gullible people are, and that any long-haired fellow who has cheek enough, dreams of eccentricities, and talks in a mildly histrionic style of a way is sure of gathering a certain number of equally idiotic followers in his train, and not until after their leader has disappeared through the fact that they have been passing through a period of emotional insanity, or, in other words, have been making most egregious asses of themselves.\n\nEDITORIAL NOTES.\n\nThere appears to be some mystery in connection with the Canadian North West Land Company, and not little anxiety amongst some of the shareholders. We propose to call a meeting of the shareholders of the Company to investigate its position, its relations with the Canada Pacific, and the reason of the Duke of Manchester's retirement.\n\nCOMMUNICATIONS.\n\nOur columns will be open in correspondence upon the subject of political matters in general, and those pertaining to the province, and others from individuals interested in the affairs of the province. We are interested in hearing from any person who can give us any information that may tend to elucidate the situation. All communications must be made in writing, and will be treated in confidence, which of course will be the case. We shall be pleased to reply to any request for further information.\n\nJUSTICE IN MANITOBA.\n\nTo the Editor of The Times,\n\nSir,—I have read with much interest your article in the Christmas number of the Winnipeg Free Press, entitled \"Justice in Manitoba,\" the action and administration compared to the legal system in France. In all 2,369 writs were issued. Out of the number of writs issued out of the three divisions of the High Court of Justice—The Chancellor Division, Queen's Bench and Common Pleas Divisions—some 1,184 names were served. The remaining 1,185 were served by the writs issued at Ogilvie Hall. Further, and owing to the resolution passed this week, the operation of the writs will be extended into the Precincts of Ontario. Hence Ontario is behind by 1,176 suits, and thus the Ontario judges have not performed their duty. That is, they have not done their work done by them and that done by the judges appointed. I would hope that the Governor General, Sir Wilfrid Laurier, in the full hearing, and he must then be better able to see another method of the present system, and that the writs issued at Ogilvie Hall and a deputy registrar of the Chancery Division of the High Court of Justice in each County, Ontario, be issued in sufficient numbers, and that number issued by those officials should be added to the 1,176 writs issued at Ogilvie Hall.\n\nWhat is now needed, would be no new idea, but I have no doubt the total number of writs issued in Ontario would be increased under the Ogilvie Hall system, and will not say anything to the prejudice of the courts in Ontario and Manitoba, but will simply draw the Hon. Mr. Riggs' attention to the fact that there are still many places that Ogilvie Hall are not written up, that is Ontario, and that the writs issued at Ogilvie Hall (1,780) are in 90 cases out of approximately 100 issued by the courts in Ontario, and the writs issued at Toronto, and reported to a great extent the business done merely by Toronto solicitors, and not by the profession residing outside of Toronto.\n\nI am yours, As.\n\nLEX.\n\nPrince Albert N.W.T., Jan. 31.\n\nOwing to the demand for Hop Beer brewed by Mr. Chas. Woodman, Messrs. Miller & Reid have opened a saloon at Prince Albert, located on the site of same and for the convenience of settlers in that locality.\n\nIt is reported that the Indians of the Sioux Branch Reserve, having severed their connection with the Government, and operating the reserve on their own hook, Mr. Leslie, the farm instructor, has been dismissed, as the services are no longer required.\n\nBirds, Mammals, and Reptiles, 50 cents.\n\nNOTICE.\n\nTo Merchants and Others.\n\nPARTIES WHO REQUIRE Accounts collected, Business Books written up, balanced, etc.\n\nWill do well to apply either personally, or by letter at the Post Office or Town Office.\n\nA. R. BURNS.\n\nTROY, C. P. R. WEST.\n\nNearest Point by Rail to Fort Qu'Appelle and all points North.\n\nStorage and Wrapping of Produce.\n\nThe undersigned having opened a ware-\n\nhouse at Troy, to inform merchants and shippers that they will store and ship goods promptly and efficiently. A special rate of freight charged.\n\nS. H. CASWELL.\n\nJ. M. CAMPBELL.\n\nNew Goods Arriving Daily.\n\nA FIRST-CLASS STOCK OF NEW HOUSEHOLD AND TRADE GOODS.\n\nSplendid lines in Black and Carved Scotch and Canadian Tweeds at prices that will astonish you.\n\nRemember the place—One door west of the Royal Hotel.\n\n300 Sacks of Good XXXII Flour.\n\nJ. M. Campbell.\n\nTRY\n\nHUGH M'Dougall's BREAD!\n\nBest in Prince Albert.\n\n10c. PER LB. LOAF.\n\nOrder and Prompt Shipment to Order.\n\nHUGH M'Dougall\n\nEast End Bakery.\n\nGRAND UNION\n\nLivery Sale Stables,\n\n4 Nelson Street, Prince Albert.\n\nHorses and Cutters always on hand.\n\nOrders for double teams promptly attended to.\n\nCharges moderate.\n\nThe only first-class Livery in the Town.\n\nA bus will meet the arrival of all regular passengers to any part of the town.\n\nS. J. DONALDSON, Prop.\n\n$7 REWARD\n\nLost last fall—a well-bred, year-old mare, pure-bred, two white socks. Strayed near Prince Albert.\n\nHugh M'Dougall\n\nEast End Bakery.\nTHE NORTH WEST.\n\nMr. Peter Irvin, whose letters on the North West have attracted so much attention, is now on a visit to New York. The Herdwick of that city, however, referred to in his last letter, was not the sheep of the Duke of Manchester's land company in terms unfavorable to the Canadians North West. Mr. Irvin wrote to the paper to defend the reputation of the country, or at least of that portion of which he has a favorable opinion.\n\n\"I've seen more than once the 'untenanted North West,' says Mr. Irvin. \"I am aware that the best lands are occupied within the first fifteen miles of the Red River, which runs in a north-westerly direction, from my way from Winnipeg to Edmonton, where it branches northerly over the great Peace River territory. I have visited about as far as Fort Calgary. Outside these limits the lands are generally good, with a few exceptions, are decidedly of second rate quality, being too light to produce heavy crops of grain, while to the east they are too heavy for the soil nor the climate can be deemed satisfactory.\"\n\nMr. Irvin argues that the natural result would have been through the middle of the fertile belt, from Winnipeg to Edmonton, and that the line selected by Mr. Fleming, but the Syndicate have located the line south of the fertile belt, to save the cost of further construction, and territory farther north being broken by numerous deep rivers.\n\n\"The Company,\" says Mr. Irvin, \"determined to keep their line north, lest west from Winnipeg to Fort Calgary, through a country so barren as far as I could see, the most richer lands of the fertile belt, anything at all like a moderate price. Through not the second rate range required, however, the cost of the railway will be comparatively light, while the company have also had the luck to get rid of the disadvantage of the inferior quality of land grant by disposing of this name to the Duke of Manchester and obtaining highly advantageous taxation real merits of the lands of Halifax Morning Chronicle.\"\n\n(Mr. Irvin is a Scottish gentleman who came to Canada some years ago in the interests of the agricultural population of the Old Country, and having acquired a great interest in connection with the development of the North West for emigration purposes, his opinions are entitled to respect, and will have greater weight with the public than those of any anonymous scribbler, who seeks to destroy the great North West.)\n\nA FOUR-LUGGED WITNESS.\n\nOtto V. Brandesky, a trained Newfoundland dog, named \"Lassie,\" stationed on the stage road near Lumsden Hall for many weeks, was hunting traps, and with the dog's assistance, went through a houseful of thieves. Last evening the dog appeared. Recently Newfoundland dog, up and claimed him on First avenue and killed a bandit. They then hanged each other. Captain Smith came out and claimed the dog, but Brandesky mounted it was Lassie, and the three went to the police station. Captain Smith said Brandesky refused to make his owner ship of the dog apparent, and Justice North told him to stand. Brandesky drew a gun, and called upon Lassie to stand and whispered to the dog. The dog sat up and allowed him to put the collar on. Then Brandesky fired, but the dog sprang up and killed him. Brandesky, hanging his umbrella as a gun, brought it into the saloon and shot himself. The dog crashed as if mad for game. He held out the umbrella and the dog jumped over it. He ordered the dog to stand, but the dog refused, and became rigid. Brandesky pretended to weep and Lee sprang up and embraced him. Brandesky tried to force Lee rear on his hind legs and before Brandesky approached the bar as he walked the footlights and became Lee also shot. The witness said the Court: \"There is no necessity of further evidence of ownership,\" and Justice Smith laughed. \"That's a good thing,\" the dog to Brandesky? N. S. paper.\n\nTO THE PUBLIC.\n\nWe have made arrangements to have papers at T. Agnew's hardware store, the Post Office, T. N. Campbell's news store and Markley & Co.'s dry goods store. Those living near any of the above mentioned places will find their papers there. Also this office.\n\nSubscribe for the Times, only $2.50 a year.\n\nHODGSON, SUMMER & CO., Wholesale Importers of Dry Goods, Swallmairs, Fancy Goods, Jewellery, Druggists' Sundries, etc., etc. Beads a specialty. WHOLESALE ONLY BETWEEN McDermott and Bannatyne Streets, WINNIPEG. RAILROAD, HO! JUST ARRIVED, AN IMMENSE, ENORMOUS & UNPARALLELED SUPPLY OF Groceries AND Provisions AT ASHDOWN'S. TRANSMITTED FROM ALL KINDS OF Canned Meats, Assorted Teas, Java Coffee, Sugar, Oatmeal, Tobaccos, etc. AT LOWEST PRICES. THE GABLE HOUSE. THE BEST BEER AND CIGARS OF THE FINEST BRANDS ALWAYS ON HAND. WHOLESALE AND RETAIL. JOHN WYNEKIRCH, PROP. WATCHES, CLOCKS, JEWELLERY, AND STANGLERY. MISS MACK & CO., CAMPBELL'S BLOCK, PRINCE ALBERT. J. R. McPHAIL, PROPRIETORS OF Hardware, Paints & Oils, Chains, Rope, Glass. AXES AXES AXES FROM $1 TO $8. RED BRICK STORE BEDSTEADS, CUPBOARDS, LOUNGES, TABLES. G. CARTER & SON, PRINCE ALBERT. G. CARTER & SON, PRINCE ALBERT. GROCERIES WILL BE CLEARED OUT AND SOLD OFF. SPINK & MAVERTY, PROPRIETORS.\nALARGESTOCK ARRIVED A FEW DAYS AGO AT THE MEDICAL HALL, CONSISTING OF Drugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc., AND ARE NOW OPENED OUT. ALSO ON HAND A GOOD SUPPLY OF Patent Medicines, INCLUDING Fellow's Syrup, St. Jacob's Oil, Eclectic Oil, Pain Destroyer, Black Oil, Burdock Blood Bitters, Vegetable Discovery, Cod Liver Oil Emulsion, Medical Discovery, August Flower, Etc., Etc.\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nIn our New Premises, next door east of Farmers Home and north of Old Presbyterian Church\n\n1879. 1883.\n\nBETTS & Gwynne's Grand Annual Clearing Sale still going on at the BUFFALO HALL IF YOU NEED Ready-made Clothing, Boots and Shoes, or General Dry Goods And Groceries, THERE As their stock-taking takes place March 1st, they have made out further reductions in winter goods. Every one should read their banner advertisement. To hand this week—White Saxony Flannel, Imitation For Caps, and a fresh supply of canned Goods.\n\nBLACKSMITHING | Farmers' Restaurant.\n\nHorseshoeing, Carriage Repairing & Sleigh Ironing.\n\nJoking all kinds done on the shortest notice.\n\nCHESSTER THOMPSON, N.Y.\n\nMeals at all Hours. Good Beer and Cigars always on hand. Good Boarding Stable in connection.\n\nR J O'LEARY", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883020701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 3869, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9278, 2], [9278, 14420, 3], [14420, 14420, 4], [14420, 14420, 5], [14420, 15683, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]