[{"id": "5595db328449fb89736199e72d76ecfc70cea260", "text": "A SLIM BANQUET.\n\nMR. SPOEPENKOYE FORGETS THAT IT IS WASH DAY.\n\n\"Say, my dear,\" whispered Mr. Spoepenkoye, eagerly, as he entered the dining-room and approaching his wife with a broad grin on his visage, \"say, my dear, Specklewhite has sent word that he will dine with us.\"\n\n\"Gentleman's dinner!\" exclaimed Mrs. Spoepenkoye, dropping her work and looking at her husband as though she had seen a ghost. \"What did that man come to-day for? Don't he know it's wash day?\"\n\n\"He came for dinner,\" resumed Mr. Spoepenkoye, turning pale from ear to ear. \"What d'ye suppose he came for, he came for dinner! What's wash day got to do with it? Think of it, he's coming in a tub and bring over clothes line with a muddy wooden pin astride the saddle—what a gentleman! He'll come for grand and you want to hustle around and get it pretty lively for him. I'll begin to serve up things myself before long.\"\n\n\"But, my dear,\" protested Mrs. Spoepenkoye, \"there's nothing in the house.\"\n\n\"There's no clothes in the house,\" added Mr. Spoepenkoye, who had utterly forsworn the use of the tub when he visited his friend Mr. Specklewhite. \"There's no clothes in the house—to get him out of the scrape some how, and at the same time not let him know it. Put on the clothes, put the clothes on a plate and set them before him. You can explain in his absence that you were forced to keep like a dog in hot weather. I'll hold his hands, so long as he has the clothes to eat.\"\n\n\"You don't imagine he would want to eat the clothes, do you?\" asked Mrs. Spoepenkoye, innocently.\n\n\"Just try him,\" yelled Mr. Spoepenkoye, dashing out of the room in a fit of being taken literally. \"Just try him and ring in some of the natural grace you always partake of.\" Mr. Spoepenkoye, however, was not one of those men who permit Mr. Spoepenkoye to hold the legs or trousers of a woman under his skirts, and while Mrs. Spoepenkoye had never heard of Specklewhite, have a little of this pretense of speech! Mr. Spoepenkoye waited, holding his breath, then, first, a pillow case and a piece of the pillow sham. Dear Mr. Spoepenkoye, pray let me help you out of this scrape. You are in need of a pair of Stafford cuffs! I know what you need, and though they are not as good as—\"\n\n\"Come now, you're going too far,\" continued Mr. Spoepenkoye, raising a very sarcastic remark with a shrug and present himself before his wife all set to go to town to have dinner at Specklewhite's at seven o'clock.\n\n\"Well, how old was he when he died?\"\n\n\"Beat forty.\"\n\n\"Had he enjoyed good health?\"\n\n\"Oh, yes, sah, de bestestest man yer ever see.\"\n\n\"Did he have a lingering disease?\"\n\n\"What sorta 'scuse?\"\n\n\"Was he sick very long?\"\n\n\"Oh, no, sah. He dropped off mighty sudden.\"\n\n\"Heart disease?\"\n\n\"No sah.\"\n\n\"Did the doctor attend him?\"\n\n\"No, sah.\"\n\n\"Well, what did they say was the matter?\"\n\n\"Do think he much o' witches.\" One o' them cumped up an' put his year ago, said he didn't, said he'd be well done comin' fer dinner. But he dropped off quick, cut him down an' put him in a box. I think that he had heart failure, bess. Tho', I thought he had somethin' trouble with his neck.\"\n\n\"Well, look here, I don't believe that you ever heard of Specklewhite.\"\n\n\"I have, sah, but I don't know, since yer gay partner in yer family history second day, sah.—Advocator Traveler.\"\n\nTEACHER WANTED.\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nFOUNDED.\n\nTwo Native Ponies\n\nFound in the Rich Hill, October 12th.\n\nTWO NATIVE PONIES\n\nFOR SALE.\n\nLIVER & FE DSTABLE\n\nCHAS. WOODMAN\n\nCHAS. WOODMAN\n\nA.W.R. MARKLEY,\n\nGen. Agent and Auctioneer.\n\nOFFICE—With Mr. BRADWELL\n\nROBERT THOMSON,\n\nSign & Ticket Printer\n\nMOORE & MACDOWALL\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\nNorth West Council.\n\nOctober 18th\n\nThe Lieutenant Governor took the chair at 12 o'clock.\n\nMr. Crawford took his seat as member for Qu'Appelle on the motion of his colleague Mr. Wilson.\n\nMajor Logan's petition was read by the clerk. It prayed for an extension of time whereby he might be enabled to pay into the treasury another additional year. In other words that the Order-in-Council permitting the imposition of fines on defaulters, which had been issued on the 15th of September last, be extended. Major Logan, the manager of the Great Land and Cattle Company of Western Canada, moved the motion of Mr. Second, seconded by Mr. Capley, the following resolution: \"That the Council do pass an ordinance to the effect that the fine imposed on Major Logan be extended.\"\n\nMr. Capley moved the second reading of the bill authorizing the sale of land in the town of Calgary. After some explanations by Judge Richardson, the bill was read a second time, and Mr. Capley moved that it be placed on the table of members.\n\nJudge Richardson rose and moved that the House adjourn until Monday morning. He explained the nature of the important work before the committees of the House, and the necessity for the shortest delay of those matters which were most pressing. Judge Richardson suspended the motion of adjournment.\n\nHis Honor said he had correspondence relating to the disposal of stray and stolen horses.\n\nMr. Capley moved that any person taking horses should be liable to a fine of $10 under Ordinance 6 of 1881.\n\nThe correspondence was referred to the Civil Justice Committee.\n\nMr. Capley moved the second reading of the ordinance respecting municipal management of the town of Calgary. He made an able explanation of the provisions of the ordinance, after which the second reading was passed.\n\nMr. Ross asked the House who would pay the commission appointed by his late son to sell land at the claimed value of $10 per acre.\n\nJudge Richardson replied that in all probability none of the Judges would be appointed. His salary was fixed by the government, and the House could not alter these claims as the work would be done free of charge.\n\nMr. Ross said that's all right.\n\nJudge Richardson said he may be paid out of the tax on premises in Calgary (laughter).\n\nMr. Capley moved the bill be engrossed.\n\nMr. Second seconded the motion. (Chair said.)\n\nMr. Capley moved that Mr. Crawford and Lord Byng be appointed for committee on miscellaneous subjects.\n\nMr. Second seconded the motion. (Chair said.)\n\nJudge Richardson moved that Mr. O. E. Hughe be placed on the committee regarding the provision of necessary accommodation for the Supreme Court. (Harrid.)\n\nThe House adjourned till 12 o'clock on Wednesday.\n\nWednesday, Oct. 20th\n\nHis Honor took the chair at 12 o'clock. A correspondence relating to the sale of land in the town of Calgary was received and read on the table.\n\nMr. Second had on the table a petition from the Mayor and Council of the town of Regina. It asked the council to pass an ordinance authorizing by law the town council of Regina granting a bonus for the execution of a great mill, as well as the imposition of fines as to the validity of the by-law the delinquent could not be sold. The petition was referred to the civil justice committee.\n\nJudge McLeod, chairman of the committee appointed to consider the petition of the American ranchmen, reported that the committee had decided to take no action on the same.\n\nMr. Second moved that His Honor the Lieutenant Governor be requested to lay on the table a report of the proceedings of the meetings of the several clerks of the Supreme Court, the highest court of justice since the first return of the Constitution Act, 1867, section 24, section 12 of the Civil Justice Ordinance of 1884. Granted.\n\nThe third reading of the Calgary bill will take place tomorrow.\n\nCol. McLeod moved the adjournment of the Council till 14 o'clock Thursday. Adjourned.\n\nFriday, Oct. 22nd\n\nDuring the reading of the minutes Dr. Wilson, member for Edmonton, took his seat for the first time this session. He was elected by acclamation.\n\nMr. Crawford presented a petition from D. H. McMillan & Co., of South Qu'Appelle, asking the council for special legislation to enable them to take advantage of the new legislation granting them a bonus of $10,000 for the erection of a flour mill. Referred to the committee.\n\nDr. Wilson presented a petition from settlers Victoria, Alberta, asking for a bonus of $10,000 for erecting a flour mill. Referred to the finance committee.\n\nMr. Second presented a petition from Dawson, Boyle & Co., druggists, of Red Deer, asking for a bonus of $10,000 per gallon on alcohol, and the right of ten gallons allowed to be imported at each point of entry. Referred to the committee with their business as druggists, and praying that some change be made in the regulations so as to benefit the business of the petitioners. Referred to the executive council.\n\nMr. Capley withdrew his anti-licensing bill.\n\nMr. Crawford moved for a committee consisting of Col. Macleod, Messrs. Capley, Wilson, Percy, Wilson, and himself, and the mover, to go into the question of preventing a recurrence of the gopher plague. He said that this just been a disastrous affair in the district of early in Assiniboin, and they must try to stop it. He believed that the destruction of the gopher would prevent the recurrence of the gopher, was the cause of the abnormal increase of disease among the children.\n\nMr. Reid's bill for providing for the support of illegitimate children was read the second time, and referred to the committee of the House of Industry, and its object is to provide a fund by taxing the father of the child a certain rate per month, and the money so raised to be used by the Government to undertake the maintenance of such children. The bill will not be returned.\n\nTOWN COUNCIL.\n\nThe Council met on Monday evening, Nov. 1st.\n\nCouncil—Acting Mayor, Hays, Comptroller, Brown, Clerk, and Secretary.\n\nThe minutes of the last meeting were read and approved.\n\nNotice.\n\nCom. Goddard gave notice that at the next meeting of Council he would bring forward a bill for purchasing equipment for the fire department and suppression of fires.\n\nNotice.\n\nCom. Richardson reported that the new sewer was substantially completed, and on motion Messrs. Smith and Miller were appointed to purchase the same for $12.\n\nThe sum of $50 was ordered paid to H. W. Newbold for use of Council Chamber.\n\nActing Mayor Betts and Com. Godl. were appointed a committee to secure a rent roll for Council meetings.\n\nTAXES.\n\nThe time for collecting taxes was extended to the 30th inst.\n\nThe Council then adjourned.\n\nTHE LOCAL PRESS.\n\nSpeaking of the local newspaper the eminent Judge Davis, of the Supreme Court, said: \"Every year every local paper gives from $100 to $1,000 worth of free labor for the publication of the views of which it is located. No other will or can do this. The local citizen, in proportion to the number of newspapers, is taxed only ten cents, and in all fairness, man with man, he ought to be supported, and the local press ought to be encouraged. I have just received a large stock of all kinds of Furniture, consisting of Bedroom and Parlor Suits, Sideboards, Cupboards, Bureaus, Washstands, Sofas, Easy Chairs, Bedsteads, Mattresses, Coils, Cradles, And all kinds of Chairs, etc., which I am Selling at 100 Per Cent. Below Former Prices. Please Call and Inspect our Stock before Buying Elsewhere. Furniture Repaired on Short Notice. Salaman, First Door East of Park. W. B. GOODFELLOW.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886110501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2874, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3840, 3], [3840, 11398, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]