[{"id": "7ce022df6f68811476b3cd1fd1e890f56d8361ed", "text": "THE PRINCE ALBERT TIMES\nSASKATCHEWAN REVIEW.\nPUBLISHED AT PRINCE ALBERT, N.W.T.\nTERMS—50¢ per thousand in advance,\nSingle copies, 10 cents each.\nIn case no paper is posted in this paper, Business hours in this place.\nNo advertisements accepted for less than 15¢.\nAdvertisements without signatures will be inserted until filled.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY.\nTHIS PAPER may be found on\nKNOX & CO.'s News-Stand at this place.\nPersons who desire to advertise, or who desire contracts may\nbe made for the Paper.\nFRIDAY, DEC. 24, 1886.\n\nA MERRY CHRISTMAS.\nWe have much pleasure in again wishing our subscribers and the public generally a \"Merry Christmas.\"\n\nTO OUR SUBSCRIBERS.\nAs a great many of our country subscribers are away, some for several weeks and some for months, we must say that we are very glad to see them back, and hope that they will find their homes just as they left them.\n\nWe therefore trust that our old subscribers as well as our new ones will take advantage of this offer.\n\nORGANIZING.\nThis week we give a record of the proceedings at the meeting of friends of the Government last Tuesday, which was held at Prince Albert. The purpose of the meeting was to consider the question of forming a Liberal Conservative Association, and to nominate a candidate for the position of Mayor.\n\nThe resolution was moved by Mr. Smith, seconded by Mr. Johnson, and carried unanimously.\n\nMeeting of Friends of the Government.\nFormation of a Liberal Conservative Association.\nIn response to the adjournment that was called after the meeting had been called to order, the following resolution was adopted:\n\nResolved, That this meeting do adjourn until further notice.\n\nThe meeting then adjourned.\n\nThe next meeting of friends of the Government will be held on Monday evening, December 30th.\n\nTOWN COUNCIL.\nAs the town for which the present Council was elected expires with the close of this year, and our citizens are very anxious to elect a new council, we trust that the best men possible will be selected by the citizens.\n\nThe present Council has not done so well that they might have done a much better job, but they have done a great deal better. They have been guilty of some omission and commission, but we believe that they have been faithful and honest, and that they have been able to maintain the credit of the town almost ruined so many places.\n\nThe citizens of the town have very little to complain of. We trust all the present members will seek to do better work next year.\n\nTHE WEST END STORE.\nLadies' Six-Button Kid Gloves in White, Cream and Delicate Shades,\nAnd Full Lengths in Silk Thread, Just Received at\nCHAS. MAIR'S WEST END STORE,\nALSO\nFashionable Laces in Cream, White and Black.\nA select assortment of Christmas Cards, very artistic, and at prices which everybody can afford to pay.\n\n'79.\n'86.\nCLEARING SALE!\nALL REMAINING PARLOR STOVES\nAT COST.\nT.J. AGNEW.\nWM. STOBART & CO.\n\nGeneral Merchants\nAND\nIndian Traders.\n\nWM. STOBART & CO.\nC. D. NORTHGRAVES, J. SINCLAIR & CO.\nWatchmaker and Jeweller.\nMerchant Tailors.\n\nNEW GOODS!\nJUST ARRIVED\n\nS.N.—The Tailoring Department is under the direction of Mr. Robinson.\nCOME THIS WAY!\n\nNo Deviation in the Path that Leads to the\n\nBUSIEST STORE IN THE COUNTRY\n\nOur Patronage is Daily increasing, and why Is there a reason for it, or does it merely happen that to-day our trade is much larger than yesterday, and to-morrow it will be larger than to-day? We know this is a community of sensible people, who not only have a reason, but a good one, for any acts they commit. When you see increasing numbers\n\nFlocking to a Particular Store!\n\nYou can put it down as a Fact that there is something there worth having. One or two may be deceived, but a crowd is never misled, and this growing trade of ours is positive proof that we have won the confidence of the public. We are the friend of every economical buyer of\n\nStaple and Fancy Dry Goods,\nDress Goods, Silks,\nMantles and Carpets,\nGent's Furnishings and\nReady Made Clothing.\n\nALSO FULL LINES OF\n\nGENERAL GROCERIES\n\nWhich will always be found unsurpassed in quality and price.\n\nFlour, Feed & Provisions\n\nALWAYS IN STORE\n\nOur Stock in this Department is simply immense, and is one of the best assorted in the North West. Just opened out, another large lot of\n\nChina Tea Sets and\nPainted Granite Ware\n\nDirect from the old country. All new Styles and Patterns, and Prices Low.\n\nGLASSWARE\n\nIn Various Varieties. An examination of our Stock is respectfully solicited.\n\nFarmer's Produce taken in exchange\nHighest Prices Paid for Furs.\n\nJ. M. CAMPBELL'S\nGreat General Store of Prince Albert\n\nT. N. CAMPBELL.\n\nHOLIDAY FANCY GOODS!\n\nTHE LATEST NOVELTIES IN\nPlush, Brass, Bronze and Hand-Painted Goods\n\nNEVER BEFORE INTRODUCED INTO THE COUNTRY, COMPRISING:\n\nODOR BOTTLES,\nFANCY MIRRORS,\nPOLISHED HORN NOVELTIES,\nPARLOR WASTE BASKETS,\nWALL POCKETS,\nWHISK HOLDERS,\nGENT'S DRESSING CASES,\nWATCH RECEIVERS,\nPIPE RACKS,\nPHOTO ALBUMS,\nPHOTO FRAMES,\nAUTO ALBUMS,\nCARD CASES,\nHAND PAINTED BOOKLETS,\n\nHOLIDAY GIFT BOOKS,\nSTANDARD PORTS IN CLOTH,\n\" \" MOROCCO,\nSTANDARD NOVELLS: Dickens, Victor Hugo, Wilkie Collins, Lever, Disraeli,\nE. P. Roe's Works,\nBOYS' OWN ANNUAL,\nGIRLS' OWN ANNUAL,\nRUTLEDGE'S BOYS' ANNUAL,\nCHATTERBOX,\nCHILDREN'S FRIEND,\nLITTLE WIDE AWAKE,\nCHURCH SERVICES AND BIBLES\n\nLATEST NOVELTIES IN\nXmas Cards and Souvenirs.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\" \" Over 15 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nCHRISTMAS THOUGHTS\n\nThough Christian people take issue with one another on points of doctrine and mode of worship, there is one great fact upon which all are agreed; that man's redemption was bought through a God-Man, that by the incarnation of Jesus Christ humanity was enabled to rise above mere humanity, cloth itself with the light of faith, and look forward with a reasonable hope of one day sharing in the joys of that blessed redemption. But this is not all we still desire, that we all should share. How comparatively few, however, contemplate the vast and varied Christian promises of the world, attached only to Christmas to which it is entitled, considering the circumstances that gave rise to it. We are too apt to think what we want, let us suppose that Christmas had never come to pass; that we were in the same case as Jews prior to the coming of Christ, who were looking for the promise to be fulfilled. How helplessly would we be at a loss in comparison to our present state! If, as the Jews had hoped, that a Redeemer would come — but had first fixed their expectations, they lived to hope, to wait, to see the promise sit out to realize, the benefits arising from the fulfillment of the promise. But do we? We have the promises, but what boastful Christians, no matter what particular creed we belong to, who ever came to a time when they could say, \"We celebrate the day as it should be.\" We look back at a time for amusement — not for the spirit of the thing. It is to be pitied that so many of us look upon the day as an occasion for a general display, for much the same in the spirit as the bad boy does the ascent of a circus or a midnight party. Instead of this, the majority of us celebrate Christmas with the way the early Jews celebrated the Feast of the Passover. We have made it black. Contrast our celebration of it with that of the early Christians, who, instead of calling for vengeance, our boasted Christian perfection, the light of faith would soon to burn dimly. Our hearts would soon grow cold, but a few years within the collection of living men, we will not fail to see that Christmas is being used up, that sacred season is passing away, unnoticed by. How many Christians — and they would be glad to be called anything else — do we hear say, \"Christmas? What may day is no more so to me than any other day. It would make no difference to me if I did not celebrate it.\" This is not the reflection — the Christian man, we mean, will see that it makes, or should make, a great difference. For this reason we stand to the contrary. Yes, it makes great difference, else many, very many of us would be sadly disappointed. We do not think that Christmas is more than any other day. It is to diminish the importance, little by little, of the Sabbath. In this way the whole of the week is diminished, and the members of the household of miracles. It is to help the unbeliever to propagate his doctrinal dabbling. We see the children of the faithful, the man who believes that after death comes darkness. To just avoid such a belief is more important to many Christians than its great necessity. The spread of infidelity. Too many of us are willing to believe that infidelity and the faithful is not slow to take advantage of it, his natural conclusion being, \"I must protest and Christians I am not, and so on. If it is a Christmas I am not, at least, not a hypocrite.\"\n\nIn saying this much, we do not stand alone, but we see and believe through the spectacles of any particular creed, nor do we wish it understood that we are preaching against or to a particular system, we are only dealing with a gentler admonition than we are. We are only putting into words the feelings that are in our own souls. We do not say, of course, that all Christians, or any, for that matter, should want a face as hard as Job's, or a Christus triumphans — that there should be no joy among the children of Adam; but we simply refer to the feeling that is felt in disdaining Christmas with something like that sneeriness that it was intended we should do, and that it would be a great pity by example that we believe that but for Christmas we would still be living in hope of salvation, but if we believe in God at all we desire, all the benefits to be derived from the birth and labours of the God-man.\n\nLet it not appearance to know that not withholding the apparent indifference of many, there are others again who look upon Christmas with the same feelings as the early Christians, and that in many a household the simple and affecting tale is told of how.\n\nIn the family of Bethlehem stood Joseph, and Mary his wife, and his mother, and Joseph took form at God's command. And Eve was given him for his bride, and Adam took form before God's throne. That they would take him also, God's command. And Adam and Eve knew no day. But that they aimed before God's eyes, Adam and Eve knew no day. Until the portal of the skies opened, and they knew no day. Of how for many hundreds of years, From Adam until Hezekiah's time, They knew no day. Until the portals of the skies opened, God's promises offered to their ears.\n\nIn these days, the pledge Divine said, That a savour would come of length — A comforter, a gift from God's hand. Of how an humble virgin was — A woman, a virgin, in the days of Joseph. She was the mother of His ancient Son. The sound of the Lord's voice came on the night Kent watch they heard the noise of the Lord's voice. When, let us a ring of heavenly bright Announcement, then the old silence was broken, The Lord's voice came in the wilderness of Bethel, and joyful, they rejoiced, As they beheld the brightness of the Lord, And to that city went their way. That the Lord's voice came on them, Guided by its wonderful light. On this the days of happier days. Until the Lord's voice came on them, And entering the ancient city, They found not him on a throne; But the sun shone on them as a glory. And they followed them down the valley below, And they knew the feet of the stranger, As they journeyed on their way.\n\nHow the Wise Men met the way, And the star of the wonderful star They had seen by night, rising high, And following from lands afar, Guided by its wonderful light.\n\nLo, it vanished from their sight, And approaching Herod's palace They heard the voices of the kings, Of this Jews, for we see now his star.\n\nHow Herod, who was filled with fear, Lest from his crown he should be thrown, Said, \"Bring me the child, that I may worship him.\"\n\nAnd they knew the stable where He dwelt, In which the Saviour was in the horn,\n\nThat he also might show them, A star of light, a guiding star, Though he had covered within his heart The knowledge of the Lord.\n\nHow when the Wise Men journeyed, They knew the place where he was born, And led them to the stable where He dwelt, Mary ever after this child held.\n\nAll kings have heard of Him, As the King the Prophets foretold, And rising high in the Horn Of frankincense and gold, And filled with joy, they hastened toward the place where He was in the horn.\n\nFor they from angel lips had learned Of Herod's jealousy and wrath, Of how he would put them to death, Would send his soldiers to slaughter all.\n\nThat thus the new birth King might fall, But, vain are the schemes of kings And false the boasts of earthly kings, And slaughtered are His enemies' hales.\n\nAnd when they knew the place where He dwelt, In Nazareth city He dwells,\n\nWhen Herod had passed away, They knew the Horn of the Lord's birth, In wisdom increased each day.\n\nHow Herod sent the soldiers of his force, And searched the Horn of Herod's height, How Herod from the grave and pool of death did send his soldiers forth, And many eyes are filled with tears, As they learn of the death of them That had been slain by the sword Of the hate of Bethlehem.\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nRUSSELL & DAVIS.\n\nWHOLESALE & RETAIL\n\nButcherS.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham and\n\nGAME IN SEASON.\n\nBruch Stalls—QuAppelle Station, Fort QuAppelle, and Prince Albert.\n\nRUSSELL & DAVIS.\n\nBROWNS BRICK STORE.\n\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nThe Bulletin, Nov. 27th, says—\n\nA public school has been organized at Victoria under the direction of Mr. Hardisty and Judge Roulston.\n\nThe candidates of Mr. Hardisty for the Committee is being favorably received in Victoria.\n\nDr. Whelan, M.N.W.C., and ladies arrived from Regina on Thursday evening.\n\nF. Povesh has been awarded the contract for the Allwood School, paying him $260.00 for the building of their next store Egg lake and delivering to the Engineer.\n\nMiss Murray and twenty more are expected to arrive shortly to reinforce G divisions of police.\n\nJudge Roulston and party, employed by the Canadian Pacific Railway, visited the vicinity of Victoria this summer, left there for Calgary on the 18th inst.\n\nWinter set in on Saturday last, and weather was quite cold until midday.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\nSideboards, Cupboards, Bureaus.\nWashstands, Sofas, Easy Chairs\nBedsteads, Mattresses, Co's, Cradles,\nAnd all kinds of Chairs, Etc., which I am Selling at 100 Per Cent Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere. Furniture Repaired on Short Notice.\nSaleroom, First Floor West of Bank.\n\nW. B. GOODFELLOW.\n\n1879. 1886\n\nBuffalo Hall!\n\nTHE GREAT HOUSE.\n\nParties looking for Choice and Fresh Goods in Congos, Assam, Hyson, Japan and Black Teas\n\nShould examine our Stock and range of Prices.\n\nThis Season, Our Prices are lower than ever, and we offer Staple and Fancy Groceries and Provisions more greatly reduced on other occasions.\n\nBuffalo Hall has the finest assorted stock of Dry Goods, Men's Furnishings, Mitts, Gloves, Socks, Dulcets, Ladies' and Men's Moccasins, Etc., Etc., ever shown in Prince Albert.\n\nBETTS & Gwynne.\n\nSTOVES!\n\nAre still selling at very low prices. To find out how they are, one should inspect my stock. I sell a Good 25 inch Box Stove for $10 50,\nHandsome heavy Parlor Heater, $18,\nGood square Cook Stove, $27.\n\nI have a first-class workroom, and will execute all orders for Tonsmith's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\nA FULL STOCK.\n\nJ. R. McPhail.\n\nBusiness Notice.\n\nAll parties having any claims against us are requested to hand them in at once, and all parties indebted to us are requested to make satisfactory settlement of their accounts up to 30th of the present month, as we close our year's business at that date.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886122401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 4126, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3168, 2], [3168, 5927, 3], [5927, 16471, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]