[{"id": "19444641e6608481517660bbdcc71d1d435e1be9", "text": "THE PRINCE ALBERT TIMES.\n\nWEDNESDAY, NOVEMBER 1, 1882.\n\nSALUTARY.\n\nIn presenting our patrons and readers with the initial number of the Prince Albert Times, it is but right that we should say a word or two explanatory of our position, our policy, and the course we propose to take in the conduct of this paper.\n\nThe want of a good live news paper, to bring the resources and advantages of this fine portion of the North-West Territory, not so prominently before the public, with a view to encourage the introduction of a good class of emigrants, to settle in the district, and to advocate the best interests of the industrial and Agricultural interests of the country, has long been felt in Prince Albert. Indeed it is a matter of surprise that the people have been content to remain so long without one newspaper, but springing up within the last year in almost every hamlet of any considerable size in Manitoba and the North-West. It is not to be wondered at then, that a place of such importance as Prince Albert, with its large and populous surrounding should demand that this want should be supplied. We have therefore, at large expense, engaged the services of a great difficulty (which at one time seemed to be almost insurmountable) succeeded in bringing up to the North-West our plant and press, and we now hang out our sign upon the humblest saters of journalism, feeling confident that if properly conducted on the lines we have marked out for our guidance, we will merit and receive the confidence and support of the good people of Prince Albert.\n\nIt is customary with most newspapers, in the first issue of their paper to give a flourish list of subscriptions, and the like, the omission and advocacy of which they often tend to devote their columns, and to make large promises as regards grievances and wrongs which although their ostensible are to be remedied, mobility remedied, and the like, we intend to follow this course. Suffice it to say, that it shall be our constant endeavour, and fixed purpose to further the people of Prince Albert in all that is just and right, of which they need not be ashamed. Although primarily and principally devoted to the immediate and personal interests of Prince Albert and surrounding district, it will be our broad and liberal enough in our views and scope, to advocate the advancement of the whole of this great North-West country.\n\nIt is possible, that far as such a thing is possible be entirely independent of either of the great parties which now exist, and whose divisions are so strongly marked, Moderate Conservative views will be our guide, and the government of the day a fair and manly support, so long as their line of policy and conduct of public affairs, does not conflict with justice and what is best for Prince Albert. We give no more than a slavish support to any government, but shall hold ourselves free to criticise, and if necessary to condemn any public measure which in our judgment tends to injure or impair the welfare of this community in particular, or of the North-West in general.\n\nWe shall devote a considerable portion of our space to the Agricultural, Mining and Lumbering interests of this fine country, and shall strenuously advocate the immediate construction of branch lines of Railway to connect with the main line, thereby connecting the interests and advancement of the Prince Albert people. In one word to be of and with yourselves, with a joint interest in everything that conduces to the best interests of our people and communities. Again, craving indulgence at the hands of our readers, at all events for this issue of our paper, and trusting that it will be \"not without a good intention,\" and more virtues of any ever kind, we trust best how to the public of Prince Albert, and commend the Times to the most forgiving consideration.\n\nRAILWAY MATTERS.\n\nOur readers are of course aware that negotiations have been pending with the South Saskatchewan Valley Railway Company, for a terminus at this place. These negotiations reached a conclusion last summer, but have since taken a different shape through objections having been raised by several of the nonresident landholders. The railway question has not been thoroughly discussed by all the parties interested here, and a satisfactory adjustment has been made which only awaits ratification upon the part of the Royal Commission. We can speak more freely at present upon these highly important matters pending the final conclusion of negotiations. We can only say that concerning the old established commercial positions the great distributing centre of this vast district, and the large amount of capital already invested in the varied industries of our community, would almost be foregone conclusion, and in the view of this cannot too highly commend the generous and liberal spirit which has actuated the land owners who are anxious to place their property in the best of their regions, and who are anxious to see the South Saskatchewan Valley Railway. These proposals are all that could be expected from the various gentle men who have visited us, and no doubt will be accepted by the Commissary when interested it manifestly is to seek an intere here. The Hon. Lawrence Clarke and Col. Spear, the esteemed Registrar of Prince Albert, will leave for Regina shortly, and we understand include a final agreement with the Railway Company, after which we may look for a vigorous prosecution of the work and a large expenditure of money.\n\nIn a future issue, we shall refer more fully to this important matter, which we trust will receive its final adjustment, preliminary to actual work upon the line in a few weeks.\n\nTHE COMET.\n\nWe have had an opportunity of witnessing the splendid display of cooperation by our recent brilliant and erratic heavenly visitor, at a time of night, or rather in the early morning, before dawn, when the sky was free from any haze, and there, we should have been enjoying \"baby's sleep, nature's sweet restorer,\" but for the unwelcome intrusion toward a clear consciousness and honest labor. We observe that the astronomers have divided the comet into three parts. We are pleased to find that the comet has had the decency to be divided among itself, and, in stead of running amuck again, only as was confidently predicted it would be, God help comet. Next.\n\nJ. M. CAMPBELL,\n\nDry Goods Dealer in\n\nCampbell's Block\n\nA Full Assortment on hand\n\nSTEWART & WOOTTON,\n\nAGENTS\n\nPrince Albert, N.W.T.\n\nSEWING MACHINES.\n\nThe Western Manufacturing Co.\n\nBiscuits, Candies, Baking Powder.\n\nThe Imperial Insurance Company, of England.\n\nNorth British\n\n(Old Style)\n\nImperial\n\nAssurance Company,\n\nof Montreal.\n\nCotton\n\nInsurance Solicited for above Companies.\n\nSTEWART & WOOTTON,\n\nAGENTS\n\nPrince Albert, N.W.T.\n\nWe beg to inform the Public that we have\n\nREMOVED TO\n\nOUR NEW STORE,\n\nNext to the Banking House\n\nof McArthur Knowles.\nTo the Inhabitants of Prince Albert and Surrounding Country:\n\nBETTS & Gwynne\n\nTake great pleasure in informing the public that their Large Stock for the Fall and Winter Trade has arrived, and that they are now prepared to show their many customers one of the Largest and Best Selected Stocks ever offered in Prince Albert.\n\nDry Goods, Groceries,\nBoots and Shoes,\nClothing and Patent Medicines.\n\nEvery Description Complete in both Staple and Fancy Materials.\n\nLadies' Mantles and Underclothing,\nBlack and Colored Shawls,\nDress Goods and Trimmings,\nManile Cloths, Tweeds and Flannels.\n\nOUR READY-MADE CLOTHING DEPARTMENT\n\nIs stocked with Goods from the Leading Clothing Houses of the Dominion.\n\nHATS, CAPS, GLOVES, MITTS AND MOCASSINS.\n\nIn Boots and Shoes we keep only the Best Goods. As usual, our stock of canned Goods is complete.\n\nCalifornia Fruits, Beef, Tenderloine, Eastern Fruits, Brawn, Salmon, Jams, Jellies, Sardines and Oysters.\n\nCHOICE SELECTIONS IN\nToilet Soaps, Perfumes, Pipes, Tobaccos and Cigars!\n\nAnd all other goods usually kept in a First-class General Store, all secured from Leading Wholesale Houses in the East, and now ready for inspection.\n\nBETTS & Gwynne,\n\nNOTES ON PRINCE ALBERT SETTLEMENT.\n\nMr. Turner of Maclean, Ont., a gentleman who has travelled extensively in the North West, has published a series of very interesting letters in the Montreal newspapers. His observations, opinions, and experience, and his opinions are entitled to weight, and we are therefore pleased to quote him at length, as a high idea of the future prospects of this Settlement. From which we extract the following complimentary notice of Prince Albert:\n\nIts splendid geographical position seems to me to justify the confidence previously expressed of its future importance. After so long a period will become an important centre and distributing commerce centre; many times more populous than the present town, and prosperous towns in the Saskatchewan valley. Besides a modernized Hudson's Bay Company establishment, there are three saw mills and two grist mills, and is the largest emporium of every description of merchandise and manufactures in the district.\n\nThe buildings on the business street to the north of the town, being two to three miles long, when viewed from the river, has an excellent appearance and appearance. Besides a very creditable club house, a number of buildings are being erected on the back streets, and the houses are being built in a very tasteful manner. The lumber supply, and output of wood is almost entirely from the vast forest comprising the vast forest of Moore & McBeath, who have already the plant on the ground, and next year bricks will be manufactured here, as machinery for that purpose is now on hand.\n\nThe Prince Albert Times is Conservative in politics; if local interests are represented by the members here, or even other hands elsewhere in the North West, I am inclined to think the feeling of the people will be such that every political will not be much considered, the universal and main plank in the platform of industry so far as it applies to other interests, would not be added to the platform.\n\nWe propose to devote a portion of our space in the coming Intercolonial Day Issue to the subject, and shall give publicity to information on this subject, with which we may be favored.\n\nWe have been unable to communicate with the following particular connected with the North West Mining Company, Thomas H. Lawrence, Esq., who is engaged in mining operations near the mouth of the river, which, with its wooded banks and islands, looks very beautiful from the town, and still probably will be about the centre of the business part of the city.\n\nRailway facilities are, I understand, progressing favorably and will be completed shortly, seeing the railway company has already purchased land for the right-of-way, and the line will be completed to the town. Lawrence Creek and the old intelligent leading gentlemen of the town, Mr. Lawrence and Mr. Lawrence, have already purchased large tracts of land, and have laid out a town site, which is now being surveyed.\n\nThe company intend next season to commence operations on the new enterprise, the Bishop of Saskatchewan, who has visited the town, and has been most enthusiastic as regards the great North West.\n\nThe building of the railway will be completed shortly, and the company will be able to commence operations early in the spring.\n\nThere is no doubt that the town will be a great centre of trade and commerce, and will be able to compete with any town in the Dominion.\n\nA. L. Ashdown,\n\nGroceries and Provisions\n\nA Well Assorted Stock\n\nLOWEST PRICES.\nPATRICIA KEMBALL.\n\nA NOVEL.\n\nBy G. E. L. Fenn, author of \"Little Lord Fauntleroy,\" \"The True History of the New South Wales,\" etc.\n\nCHAPTER I.\n\nThere was a man named Patricia Kemball who lived in a small cottage near the sea. He was a fisherman by trade and had a wife and two children. One day while out fishing he caught a large fish which he thought was unusual. When he brought it home his family was amazed at its size and beauty. They decided to keep it as a prized possession.\n\nThe next day Patricia went back to the sea and again caught another large fish. This time he took it to town where it was sold for a high price. From then on Patricia became known as a skilled fisherman and his reputation spread far and wide.\n\nOne day a wealthy merchant came to town looking for someone to sell him a large fish. Patricia agreed to sell him the fish he had just caught. The merchant paid a large sum of money for it and took it back to his shop.\n\nPatricia continued to fish every day and soon became famous throughout the region. His skill and dedication to his craft earned him many followers and admirers.\n\nAs Patricia's fame grew, so did his wealth. He began to invest his profits wisely and soon accumulated a significant fortune. With his newfound prosperity, Patricia decided to build a grand house overlooking the sea.\n\nHe worked tirelessly to make his dream a reality, hiring skilled craftsmen and artisans to help bring his vision to life. The house was completed in record time and became a symbol of Patricia's success.\n\nOne day while walking along the beach, Patricia spotted a group of people gathered around a large object. Curious, he approached them and learned that they were celebrating the discovery of a rare gemstone. Intrigued, Patricia offered to purchase it from them.\n\nThe gemstone was unlike anything he had ever seen before. Its vibrant colors and unique shape captivated him instantly. He knew immediately that he wanted to add it to his collection.\n\nWith great excitement, Patricia returned home and began researching the gemstone's origin and value. He discovered that it was a rare species found only in a few locations worldwide. The gemstone was valued at an astronomical price, but Patricia knew he could afford it.\n\nHe arranged for the gemstone to be shipped to him and eagerly awaited its arrival. When it finally arrived, Patricia was overjoyed. He placed it on display in his living room, where it became the centerpiece of his collection.\n\nPatricia continued to pursue his passion for collecting rare and valuable objects. He traveled extensively, seeking out new treasures to add to his growing collection. His dedication to his craft never wavered, and he remained committed to his pursuit until the end of his days.\n\nIn the end, Patricia's legacy lived on through his impressive collection of rare and valuable objects. His story serves as a reminder of the power of dedication and hard work, and how it can lead to incredible achievements.\nThe following is a list of causes disposed of at the recent term of the Court held by Col. Richardson commencing Oct. 28th:\n\nAndrews v. Houghton et al., Trespass, Elliot for plaintiff, Maclean for defendants. Tried by a jury. Verdict for defendants.\n\nMcKee v. Smith, action for breaking down fences across what was claimed to be an old established road which had been abandoned years ago. It was an important case as affecting the rights not only of the present proprietors but of the travelling public generally.\n\nCameron v. Ramsay, Replevin, Maclean for plaintiff, Gunn for defendant. Judgment rendered for plaintiff.\n\nYoung v. Clarke, Replevin. Verdict for plaintiff, Maclean for plaintiff. For details see paragraphs above.\n\nMcBeath v. Boyd, Replevin, McLean & Watson for plaintiff, Elliot for defendants. Judgment rendered for defendants.\n\nThe Queen v. George Finlay, et al., Malicious Injuries to Property. For the Crown, Finlay, et al., for defendants. Cochran, Kay, for defendants. McLean & Watson tried with jury. Verdict not guilty. The judge strongly charged the jury to consider the facts, but the jury acquitted him. There was no justified cause for confusion on the part of the jurors, and therefore he behooved them to acquit.\n\nFerriar v. Smith, Attachment, plaintiff in person, Maclean for defendant, plaintiff non-suited.\n\nFerriar v. McLean, tenant for plaintiff, McLean & Watson for defendants. Suit settled by parties.\n\nStevens v. Thomson, damages for issue of attachment. Maclean for plaintiff, defendant in person. Verdict for plaintiff.\n\nAnderson v. Sanderson, account and set off, McLean for plaintiff, Maclean for defendant. Judgment rendered for defendant.\n\nMcKee v. Smith, Attachment, Gunn and McKee & Watson for plaintiff, Maclean for defendant. Verdict for plaintiff.\n\nAnderson v. Maclean, Damages, Maclean for plaintiff, McKee & Watson for defendants. Judgment rendered for defendants.\n\nCameron v. Moore, et al., Cameron & Anderson, defendants. Damages for issue of attachment. Maclean for plaintiff, defendants for defendants. Plaintiff non-suited on ground that defendants had sold the land before the attachment so that plaintiff's credit has been stopped at a point where it should have been.\n\nPoveshell v. Thomson, tenant for plaintiff, McLean & Watson for defendant. Set off of costs.\n\nWilliamson v. Hughes, Damages, Hughes for plaintiff, defendant not appear. Verdict for plaintiff.\n\nMaclean v. Thomson, account, Maclean for plaintiff, Elliot for defendant. Verdict for plaintiff.\n\nHudson Bay Co. v. Spencer, McLean & Watson for plaintiff, Verdict for plaintiff $725.10.\n\nHudson Bay Co. v. O'Keefe, McLean & Watson for plaintiff, Verdict for plaintiff $441.60.\n\nHudson Bay Co. v. Andrews, Lepine, McLean & Watson for plaintiff. Verdict for defendants.\n\nThere were 27 cases on the docket, a number of which were undefended. It is thought that the court will be able to dispose of all the business before him in the shortest possible time, and to the entire satisfaction of all who had business to transact before him.\n\nDuring the last session presented for time we had another opportunity of calling upon all the good people of Prince Albert to assist their subscriptions for our paper. We trust that there have been many who will join us in supporting our paper. We have already received a large number of subscriptions from our readers.\n\nAs many of our Ontario readers are aware, we intended to have called our paper The Observer, but in deference to the wishes of our friends here we have changed it to The Prince Albert Times, and Saskatchewan Review. Our present heading is temporary. We have already received a large number of subscriptions from our readers.\n\nTHE OLD INDIAN GRAVE YARD.\n\nMEDICAL HALL\n\nT. E. JACKSON,\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT N.W.T.\nTOWN NEWS.\n\nBoo will be scarce this winter here. Thus McKay's new mill will soon be completed.\n\nOver a hundred buildings have been built this season.\n\nA very heavy blizzard has been blowing the last few days.\n\nThe bakery wagons of Mr. Bell come to give us bread daily.\n\nThe wheat has been somewhat delayed by the late heavy rains.\n\nBuy a good house, store, and make home comfortable and pleasant.\n\nAdvertising in the Times, the best advertising medium in North-West Canada.\n\nIt is reported that a team of decorative painters will shortly start business here.\n\nIt is said that Mr. Dobbs, the popular boarding house keeper, is to move to the Mission town.\n\nFinding it inconveniently far to go from the main street occupied by Davis & Smith.\n\nThe school board gave a ball in Senator Macdonald's Hall, Friday evening. It is expected to be a success.\n\nPriests seem to have a lifelong hatred of cold and pool parties.\n\nMr. Davis's philanthropic probably receive the penny readings this winter; their loss is much felt.\n\nMillers, bakers, and butchers are addressed to the proprietors of the Prince Albert Times.\n\nWe are informed that day labor is scarce at the town of Macdonald's Hill which weighs thirty pounds.\n\nBeaver has been caught and seen sporting there; the net set to capture him has been lost in the mill yards.\n\nThere seems to be a scarcity of good timber, although there is plenty of it getting in some heavy stock overland.\n\nThe City Council is fast becoming a police force. The demand for law and order cannot be ignored.\n\nThe season is rather long enough here for building operations, notwithstanding the long open hall and workshops, which are now being completed.\n\nThe owner has requested several times that Mr. M. H. Smith be paid promptly for his services. He has been doing more work than ever before, and the greater part of what he has done is not paid for.\n\nWe were shown the other day the designs for the school, the removal of the snow bank opposite the school house, and the clearing of the road to the school.\n\nThe design for the school, the clearing of the road, and the removal of the snow bank opposite the school house, and the clearing of the road to the school, are all matters of great importance.\n\nWe have heard that the authorities have not found all desirable characters, in several Regina (H.B.) newspapers, who have been arrested, and the complaints of citizens have been made public.\n\nWe have heard that the authorities have not found all desirable characters, in several Regina (H.B.) newspapers, who have been arrested, and the complaints of citizens have been made public.\n\nLUMBER TRADE.\n\nThe recently erected sawmill at this season has been doing considerable business, and we understand that they have been very successful during the past few weeks.\n\nAmongst the many new enterprises which are being started in this town, we are pleased to notice that Mr. Edward Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timber, which he intends to saw into lumber.\n\nThis lumber will be used for fence posts and other purposes.\n\nWe understand that Mr. Wilson has purchased a large quantity of pine timbe...", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882110101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9500, "total-output-tokens": 7107, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6897, 2], [6897, 11562, 3], [11562, 14547, 4], [14547, 18648, 5], [18648, 33463, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]