[{"id": "dd75c2d6886eff2c73be6b232db9aa947f643b78", "text": "INCORPORATION.\n\nWe are pleased to learn that there is likely to be some attempt made to bring this question more directly before the people. The inhabitants of Edmonton and other places in the north have been working hard to get their town incorporated, and now is the time for them to do so. We believe that the North West Council will meet in August and take up this matter again. It is important that the people should be informed of the advantages of incorporation, and we urge them to take advantage of this opportunity.\n\nThere is some probability that a public meeting will be called to consider this matter. We believe that the North West Council will take action soon, and we urge all citizens to attend these meetings and express their opinions.\n\nPublic matters are just now at an impasse. Subscriptions for the new school building have been received, but the work has not yet begun. We urge all citizens to contribute to this worthy cause.\n\nTHE POST OFFICE.\n\nIn both Manitoba and the North West Territories the unexpected rush of immigrants into almost unoccupied localities has been the cause of towns springing into existence. If this trend continues, it is inevitable that the location of the future town will be a matter of considerable difficulty for the Government to select the site for the Post Office. In both cases, the Post Office buildings are located near the center of the town.\n\nThe Government cannot be aware that the Post Office is an inconvenience to the town. It is true that the Post Office is an inconvenience to the town, but the Government cannot be aware that the Post Office is an inconvenience to the town.\n\nQUEEN VICTORIA CENSORED.\n\nPresbyterians the world over are noted for their fearless denunciation of what they regard as the errors of the Church of Scotland. They have just published a report on religion and morals, in which Queen Victoria is censured for permitting the desecration of the Sabbath through the political messengers. This report is not only a blow between Aberdeen and Bellator, but also a blow against the political parties in the United States.\n\n20 lbs Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes Baskets etc., etc\n\nSTEWART & WOOTTON\nITEMS OF INTEREST.\n\nIt is officially denied that there is any cholera at Little Rock.\n\nMontgomery VanMeter will be appointed U.S. Postmaster at Paris.\n\nSeveral counties in Arkansas are in possession of cholera. The authorities are powerless.\n\nThe Chief of Police has been patrolling the streets to watch the landing of any boat, at Galveston.\n\nThe relations between the Vatican and France are improving since the recent exchange of gifts.\n\nThe death of an English missionary at Antigua was attacked by Indians and a named Maria wounded.\n\nJ. W. Hilliard, a reputed citizen of Franklinville, Ohio, indicted for murder in the first degree, was arrested.\n\nThe London County Council decided to withdraw the free use of the hall which the Army has allotted for public Sunday evenings.\n\nM. DeLisle has made a satisfactory arrangement with the British Government in the matter of the proposed new Suez Canal.\n\nThe necessary amount has been subscribed by the Kingston Ladies' Medical College, and the college will open in October next.\n\nMrs. Mary Perry, of Sidney, fell down stairs Friday night and sustained such severe injuries that her situation is considered critical.\n\nIt is reported at Cairo that a raid will be held in readiness to take the Khedive of Naples the spread of cholera makes him anxious.\n\nAn extraordinary, a Toronto American commission has been appointed to examine into the question of the establishment of a petrochemical factory.\n\nThe Hon. Mr. Mercer's new organ formally proposes to the Liberals the union with the Cartier and the defeat of a Conservative like himself.\n\nThe Montreal Temperance celebrated the Twelfth of May usually do, by meeting together at the same time and holding a banquet in the evening.\n\nThe Halifax Branch of the Temperance Alliance at its meeting endorsed the \"No Act\" resolution in Halifax, partly owing to the country's prosperity.\n\nOne of the long pending suits about railway bonds was decided in the Court of Queen's Bench against Mr. L. A. Kendall, the municipal agent of Toronto.\n\nIn the French Chamber at Deputies Barrelet (Republican) moved that an inquiry be made into the condition of the nation was rejected by 204 to 86.\n\nA notice of insolvency case and execution in the civil court with a bond demanded in the amount of $15,000 was served upon the estate of Mr. James Sinclair.\n\nThe Liberal press of Germany cordially supports the North German Government's article regarding the Russian question and its attitude toward the Prussian Government.\n\nAccording to advice from Berlin, the capital of Russia is now suffering from all of the ills that disturb the rest of the nation.\n\nThe cotton market is doing great damage there.\n\nThe condition of soldiers ruined families.\n\nKeep the people away from the outside world.\n\nProvisioners in the city are giving out instructions to the people in the face of the situation.\n\nA package containing fifty-one expensive gold rings, which had been sent by mail, was stolen from a trading dealer in military supplies at the New York Customs House.\n\nAt the Sligo mission, a number of the clergy and congregation were sentenced. Today at 24 years prior sentence, Hopkinson to 12, Hopkinson to 2, and Kelly to 3.\n\nDuring the day, one of the men was found assassinated by a Megantic volunteer, who threw a stone plate out of a car window, killing the man instantly.\n\nPassing Redell brings a host of troubles instead.\n\nThe Hudson's Bay Company from New York to Chicago, and into the South west, has been threatened, and was forced to capitulate.\n\nThe captain's wife, the best friend of the company, was killed by a shot from a yellow fever.\n\nThe company's store has brought another loss, again through George, whose body was found near the scene of the disaster.\n\nThe company's store has brought another loss, again through George, whose body was found near the scene of the disaster.\n\nPRINCE ALBERT\n\nBOOT & SHOE STORE.\n\nJUST RECEIVED another lot of boots with the greatest variety and best value in BOOTS & SHOES.\n\nCheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nKNOX & BARKER,\n\nCarpenters and Builders.\n\nJob Work Promptly Attended to.\n\nPlans and Estimates Furnished when Desired.\n\nResidence—BELL'S RESTAURANT.\n\nBELL HOTEL.\n\nMEALS AT ALL HOURS\n\nW. R. BELL.\n\nPhotographer.\n\nJAMES SINCLAIR.\n\nMerchant Tailor.\n\nJust received his new stock of Spring & Summer Goods.\n\nAnd is prepared to supply his numerous customers with Suits to please the fancy of all.\n\nUNDERCLOTHING\n\nSoft and Hard Felt Hats.\n\nGive me a call.\n\nJ. SINCLAIR.\n\nFarmers' Restaurant.\n\nMeals at All Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stables in connection.\n\nR. J. O'LEARY.\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory.\n\nGOODFELLOW BROS. & CO.\n\nPrince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nGeorge and Coll Griffin, brothers of John Walker, in action over a ten cents note each at a card table.\n\nMcIntosh of Chicago, proposition to settle at 50 cents on the dollar side, but still owing to the refusal of several wealthy creditors to sign the agreement.\n\nThere was a fire in London last Tuesday, the fire department called off the hook, the engine going gently down the side of the establishment, and in the soft hail called up on its side.\n\nPRINCE ALBERT\n\nSIGN OF THE BIG BOOT.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT — N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Bochen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. DRYSDALE, Land Commissioner.\n\nFURNITURE!\n\nJUST RECEIVED\n\nFirst Load from Winnipeg:\n\nPlaster Paris, Building Paper, Plasterers' Trowels, Masons' Trowels, Guns, Canister Powder, Mining Machines.\n\nHardware.\n\nTen per cent off for Cash\n\nT. J. AGNEW'S\nTO THE LADIES. Real Estate ESTABLISHED - 1860.\n\nNEW Spring & Summer Goods\n\nMilitary.\nLadies' and Children's Furnishings\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK,\nRIVER STREET.\n\nON HAND Hardware!\nCookstoves,\nPaints & Oils,\nGlass,\nCoal Oil,\nGranite\nIronware.\n\nJ. R. McPHAIL,\n\nA. L. ASHDOWN,\n\nPRINCE ALBERT, N.W.T.\n\nJUST RECEIVED.\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Gutter Runners, Shirts and Trousers for sale.\n\nCHESTER THOMPSON,\nPRINCE ALBERT.\n\nGRAND UNION\nLivery & Sale Stables.\n\nTHE BEST BEER AND CIGARS\n\nTRY HUGH M'DOUGALL'S BREAD!\n\nAPPLY AT\n\"The Times\" Office,\nPRINCE ALBERT - - - N.W.T.\n\nHEINTZMAN\nAND COMPANY,\nPiano Manufacturers,\n117 KING - ST. WEST,\nNEXT ROSSIN HOUSE.\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL\nAND FINISHED IN FIRST-CLASS STYLE.\n\nFIRST PRIZE WHEREVER EXHIBITED.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\"The Times\" Office,\nPRINCE ALBERT - - - N.W.T.\nNOTICE.\n\nSEWING MACHINES\n\nThe Only Genuine Raymond\n\nFOR SALE\n\nThe Domestic - $50\nThe Winder - $40\nThe Raymond - $30\n\nThis offer is open only for one week and will close then at an apparent Raymond\n\nAnd Raymond machines offered in the market by any person other than the owner of the machines is hereby declared invalid.\n\nS. W. VANLUVEN, T. E. JACKSON.\n\nThere will continue to be HOT TIMES, COLD SWEATS and CYCLES of disappointments for its opposition, followed by SHOWERS of BENEFITS for those who buy reliable goods at fair prices from\n\nBETTS & GWINNE,\n\nDRY GOODS, CLOTHING, GROCERIES and CROCKERY.\n\nCITY AUCTION MART\n\nMARKLEY & ORR,\n\nReal Estate and General Agents—Hold A sale in this district for the\n\nThe Celebrated New York Singer Sewing Machines!\nNEW GOODS ARRIVED THIS WEEK\n\nCONSISTING OF\n\nGROCERIES,\nFancy and Staple.\n\nA LARGE AMOUNT OF\n\nCONFECTIONERY\nETC., ETC.\n\nDry Goods AND Small Wares\n\nBAKING POWDER!\n\nOUR LINES OF\n\nCROCKERY\n\nARE COMPLETE.\n\nPUMPS!\n\nThe Largest and Best Selected Stock of\n\nBOOTS AND SHOES\n\nONE IRON GREY PONY.\n\nOne Grey Mare.\n\nOne Sorrel Colt.\n\nFOR SALE.\n\nIn large or small quantities.\n\nJ. O. DAVIS & CO.,\nImporters and Dealers\n\nPRINCE ALBERT, N.W.T.\n\nMahaffy & Clinkskill,\n\nNEAR TO POST OFFICE.\n\nSHANNON & McLEOD have removed into their new store, one door west of their old stand, and are now prepared to give to the people of Prince Albert a quality of Boots and Shoes never before offered in this town.\n\nThe entire stock has been personally selected, and none but first-class material purchased. We keep no shoddy goods, and we sell at prices that cannot be competed with. Our motto is small profits and speedy delivery.\n\nOrdered work done in first-class style. Repairing promptly attended to. We intend keeping up our reputation for doing first-class work.\n\nAlways on hand a good supply of leather, shoe findings, etc.\n\nOwing to our loss at the Troy fire, we are compelled to conduct our business on a strictly cash system.\n\nSHANNON & McLEOD.\n\n$5 REWARD. NOTICE.\n\nLOST.\n\n13TH OF JULY.\n\nDark Grey Scotch Terrier Dog\n\nAnswer to the same of C.H.B., The above dog will be paid any person returning him to\n\nWM. V. MACLISE\n\nNOTICE.\n\nA citizen of the Saskatchewan District Court Division Number Two will be held at Prince Albert, on the\n\nSECOND DAY OF AUGUST, A.D., 83,\n\nat the hour of TEN o'clock in the forenoon.\n\nJ. FINLAYSON,\n\nCLERK OF THE COURT.\n\nSTRAYED\n\nIn every line\n\nBought from five hands, saving from Ten to Fifteen Per Cent.\n\nIt is our intention to sell out our entire stock at prices that will surprise some of our neighbors.\n\nOur expectations are very large and while some of the leading firms of this place do not profess to have all our goods paid for, and therefore in order to provide for payment of same, we intend to make a sweeping sale of all lines.\n\nOur expectations are very large and while some of the leading firms of this place do not profess to have all our goods paid for, and therefore in order to provide for payment of same, we intend to make a sweeping sale of all lines.\n\n$50 REWARD.\n\nLost last winter, a chestnut horse marked \"G F\" on left fore shoulder.\n\nAny person detaining him after this notice will be prosecuted.\n\n$20 reward will be paid for recovery of same, on returning him to\n\nCAPT. MOORE.\n\nOATS\n\nFOR SALE.\n\nIn large or small quantities.\n\nJ. O. DAVIS & CO.,\nImporters and Dealers\n\nPRINCE ALBERT, N.W.T.\n\nMahaffy & Clinkskill,\n\nNEAR TO POST OFFICE.\n\nASH & ROBBINS,\n\n34 Fulton St., Brooklyn, N.Y.\n\nCONSUMPTION Positively Cured.\n\nAll sufferers from this disease are invited to visit our establishment and purchase our special remedies. These remedies are the only ones that have been found effective in cases of consumption, and all diseases of the throat and bronchial tubes. We have treated many cases successfully by these remedies, and have never had a failure.\n\nWe don't want your money until you see results. We guarantee satisfaction or your money back. Write us at once.\n\nASH & ROBBINS,\n\n34 Fulton St., Brooklyn, N.Y.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883072501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 3430, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2233, 2], [2233, 8701, 3], [8701, 9703, 4], [9703, 10456, 5], [10456, 13697, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]