[{"id": "90bc0d341b9b93a90361044b7939e10fd86ec8ae", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, NOVEMBER 29, 1882.\n\n$2.50 A YEAR.\n\nPRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW\n\nSPINK & MAVETTY\n\nPRINCE ALBERT, N.W.T.\n\nGENERAL DEALERS.\n\nBAIRNS BROS. & CO., PRINCE ALBERT, N.W.T.\n\nTRY HUGH MCDougall's BREAD!\n\nBANKING HOUSE\n\nMacarthur & Knowles,\n\nPrince Albert, N.W.T.\n\nFASHION NOTES.\n\nCOMMUNICATIONS.\n\nMARRIAGE.\nThe wonderful fertility of the soil of Manitoba, and the North West and its advantages for agricultural purposes has seldom been questioned, and therefore it was with much surprise that we read an article in the Halifax, Nova Scotia, Morning Chronicle denouncing the character of the soil of this country, its climate, scenery, resources, and in fact everything belonging to it, in most unmeasured terms. We can quite understand the anxiety of our eastern contemporaries to keep their \"Blue bloods\" in their own country, and to those who are comfortably situated, and earning a good livelihood in their native land, we would say, stay at home. But we happen to know that there are many who desire to see the young men in the towns and country parts of Nova Scotia and the maritime provinces generally, who are barely making a start in life. Clerks at small stores, journeymen mechanics, shopkeepers, and young men tending the farms which have been worked in the same old way, for generations, by their fathers and grandfathers before them. These classes should migrate to a country like this, where, especially those brought up to farming, can obtain facilities for acquiring a home and a competency. Such a rush will make them pay long years of hard labor to acquire in their own country.\n\nWe are surprised that a journal of the liberal and broad views of the Chronicle, should descend to such mischievous and malicious following:\n\n\"While much of the country is undoubtedly very fertile, very much more of it is no better than it should be. Even in the most fertile part of it there are many drawbacks to overcome by the exertion and enterprise of settlers.\" Our contemporary appears to have his remarks upon the authority of Mr. McCready, editor of the Montreal N. B. Herald, and of the members of the Peace River district of the North West last autumn, and we enjoyed the proud distinction of being the only one of the party, who came to \"spy out the province,\" and to bring back a report with him a truly capable expert. Endorsing the unfavorable opinion of this gentleman, the Chronicle proceeds to give the following frightful picture of the hopes of the North West, which is enough to send the average Nova Scotian tremble in his shoes, and the old New-Westerner laugh in his sleeve:\n\n\"The same soil and substance of what he (Mr. McCready) said about the soil, we are now seeing having a tolerable good turn in New Brunswick was better off, and had a fairer prospect of happiness and comfort than the average Manitoba farmer. The same soil and substance of what he (Mr. McCready) said about the soil, we are now seeing having a tolerable good turn in New\nTHE SASKATCHEWAN DISTRICT.\n\nInteresting Interview with Right Rev. Bishop Brown.\n\nQuite a number of gentlemen interested in lands in the District of Saskatchewan were recently engaged in an interview with His Lordship the Bishop of Saskatchewan in the parish of the Tecumseh House, and received most valuable information from that gentleman in regard to the section of country lying between Prince Albert and Edmonton. The representative of the Press having heard of the consultation was also present. After the interview, which was thoroughly characteristic of the Bishop, the right reverend prelate was interrogated as to the general condition of the district.\n\n\"There are no fine farming lands in the North West than in the section of country between Prince Albert and Edmonton. From Battleford to Edmonton on the ice, by steamboat, and by land several times, and, added to that, a better en route object in view, cannot be expected to pay as much attention to the geography of the country as a person who has been on the trip on a specific mission. I have no hesitation in saying, from personal observation, that the district is the oldest residents of that portion of the North West, that the district contiguous to both battleford and Edmonton, is well adapted for farming operations, and must before many years become thickly settled. In some localities less than five miles is occupied by a block farm, several feet in depth, whilst throughout the district will be found plots of sandy nature, and soil, but not so well suited for agricultural purposes.\"\n\n\"What railways are projected through that section?\"\n\n\"From Prince Albert, in a north-west direction, the Saskatchewan Valley line is surveyed; the Portage and West branch line is projected in a northerly course to Prince Albert, and will no doubt be continued westerly to Victoria, and Edmonton. In addition to these lines, the Canadian Pacific Railway is expected to touch the important points in that section of the country. The settlement at present is Prince Albert, near the Canada Pacific main line is Qu'Appelle, distant 15 miles, about seventy miles, this will be a market centre for the district. The line from Edmonton to Winnipeg can now be made in eight days. Whereas for years past it was impossible to travel across the road. A wonderful improvement is noticeable in the district, especially about Prince Albert, and there are every reason to believe that the section of country to which my attention has been called, although not yet settled, is for farming purposes, will be very speedily settled by a desirable class of people.\"\n\nMEDICAL HALL\n\nT. E. JACKSON,\n\nDrugs & Chemicals\n\nDye Stuff, Patent and Proprietary Medicines, Druggists' Sundries, etc.\n\nAgent for North-West Lynam's Celebrated Specifics.\n\nPharmaceutical Prescriptions and Family Remedies carefully prepared.\n\nT. E. JACKSON,\n\nDr. Foster's building West End.\n\nWATCHES, CLOCKS AND JEWELLERY\n\nIN THE MARKET\n\nBest Joseph Rogers & Sons\n\nCUTLERY!\n\nAND A PINT OF SPOTLESS FORKS!\n\nAT R. B. WAY'S\n\nR. B. WAY,\n\nPost Office, Prince Albert, N.W.T.\n\nA. L. ASHDOWN,\n\nWholesale & Retail Dealer\n\nGroceries\n\nProvisions\n\nA Well Assorted Stock\n\nALWAYS ON HAND AND SOLD AT LOWEST PRICES.\n\nTAILOR AND BARBER.\n\nCall on Scotty, the Tailor, for Your Clothes.\n\nFit Guaranteed.\n\nCutting a Specialty.\n\nHair Cutting and Shaving.\n\nJAMES SCOTT,\n\nGABLE HOUSE,\n\nPrince Albert,\n\nN.W.T.\n\nNotice. Established - 1860.\n\nAll parties indebted to us, are requested to make immediate payment, otherwise their accounts will be placed in suit.\n\nMOORE & MACDOUGALL,\n\nMoore's Mill, Nov. 3, 1882.\n\nNotice:\n\nNotice is hereby given that application will be made to the Governor General of the Parliament of Canada, for an act to incorporate and work a line of Railway from Prince Albert to Edmonton, via the Hudson Bay, or to near the Churchill River, and connecting with the Churchill River Railway Company, and that the same will be completed in connection therewith.\n\nHamilton, Nov. 29, 1882.\n\nKILVERT & DUNGAN,\n\nAgents of applicant.\n\nREMOVAL.\n\nThe undersigned will remove to the Mission and will start a\n\nFIRST CLASS HOTEL.\n\nOPEN FIRST OF DECEMBER\n\nMEALS AT ALL HOURS.\n\nA. DOBBS.\n\nJ. L. JOHNSON & CO.,\n\nHave just received a large and general assorted stock of\n\nHardware;\n\nALSO\n\n500 GALLONS OF\n\nCOAL OIL.\n\nNo. 1 Campbell's Block, Prince Albert.\n\nPRINCE ALBERT\n\nFURNITURE STORE\n\nG. CARTER & SON\n\nRED BRICK STORE\n\nOccupied by T. E. Jackson, the agent, and will be prepared to take orders for\n\nBEDSTEADS,\n\nCUPBOARDS,\n\nLOUNGES,\n\nTABLES,\n\nAnd other heavy furniture.\n\nWe have also a large stock coming by rail.\n\nG. CARTER & SON,\n\nPRINCE ALBERT\n\nJ. SINCLAIR,\n\nMERCHANT TAILOR.\n\nFIRST-CLASS GOODS\n\nALWAYS ON HAND\n\nCut & Fit Guaranteed\n\nCENTS' FURNISHINGS\n\n\"The Times\" Office.\n\nFirst Store East of Bank.\n\nPRINCE ALBERT\n\nN.W.T.\nThe Echo House\n\nQu'Appelle\n\nNotice.\n\nA notice that an application will be made to Parliament of the Dominion of Canada for the purpose of making an act to incorporate \"The Saskatchewan and Qu'Appelle Valley Railway Co.\", with full power to purchase land, and operate a railway from a point in Qu'Appelle to a point in Saskatchewan, in a northwesterly direction to some point on the Canadian Pacific Railway.\n\nDated at Prince Albert, November 21st, 1892.\n\nMcKean & Watts, Solicitors and Applicants\n\nReal Estate\n\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS\n\nPRINCE ALBERT\n\nAnd suitable for business purposes or private residences.\n\nFor further particulars apply by letter or otherwise to the undersigned.\n\nC. Mair,\nP. O. Drawer R,\n\nPRINCE ALBERT BAKERY.\n\nTo give an assurance to my customers that I have received their orders, I send them for the Payroll for the last two months, and always keep a sufficient stock on hand to make good any deficiency, and take orders for future supplies.\n\nBREAD, CAKES, PIES.\n\nAll other goods too numerous to mention. All orders promptly attended to, and punctual delivery promised.\n\nW. R. Bell.\n\nWAREHOUSING AT FORT QU'APPHELLE.\n\nSLEIGH & HARNESS.\n\nWill be sold with horses separately.\n\nWill be traded for farm lots or corn.\n\nApply to\n\nE. H. Mason.\n\nAt Dobbs Old Boarding House.\n\nJUST RECEIVED\n\nTwo and three light CHANDELIERS.\n\nTABLE and BRACKET LAMPS.\n\nLANTERS.\n\nSLEIGH BELLS and COAL OIL.\n\nT J AGNEW\nHONOR TO WHOM HONOR IS DUE\n\nIt must have been natural for our realists who followed closely the details of the engagements in the recent Egyptian campaign, how effective was the work done upon the enemy by the troops known as the Imperial Guard. Military tradition has built up the Guard as rigidly superior at this point, and the grandeur of the service and presented without true obstinacy that the trooper should carry out his orders and not be swayed by the dictates. The same suggestion of putting an infantry man on horseback would twenty years hence have been looked upon as a radical innovation and the red tape into a future of rage and resistance. With due respect to the traditions so esteemed, however, we must admit that the Imperial Guard has just and reasonable reverence, we fail in understanding or condemning a rigid adherence to the formulas and traditions in this great and stirring era of change for better or worse. It is akin of course to the spirit which animated the traditions of the last century through which the first Napoleon broke like a thunder bolt. In my opinion, the old Austrian, when he marched and counter-marched for a whole summer and then went back to his quarters, had but a heavy burden hanging over him. He bore a heavy load, but he carried it with dignity from Eupen to Ule and from Ule to the middle of Munster and right battle-field. The whole weight of his tactics is most abundantly shown at Wagram and Austerlitz, however, and justified by the result. We must certainly, that it should be as Bacon says, a real reform that draws on a change, and not a mere change, which is only made under compulsion, as he says again, \"the greatest innovator; and if time after time the same course and windings cannot will not alter, then it is evident what shall be altered? But Imperialist tactics are still under-going change and the appearance of the Guard is not for the better. Thanks largely to the human efforts and sagacity of the late Prince Consort, the Guard has been able to maintain its position, and thanks largely to a Canadian Author, well known for his literary attainments and theoretical views with military history, the Guard, a large number are now put on horseback, or put it in another accurate term, the trooper has been given the opportunity of fighting on horseback.\n\nThe usefulness of such a force needs no explanation like many another example, and the question is not whether the Guard is worth while, but what can be done with regard to it that the military minds of Europe did not think of in long ago, or did not adopt the system. The Guard was created by Napoleon, put out by the Canadian author, to whom we have above referred.\n\nIn 1869 the \"History of Cavalry,\" a work of great talent and laborious research, and of high literary excellence, was published in London by Lord L. E. Egerton Denison, of Canada. Lord Egerton Denison, son of a family connected with the House of Commons, was educated at Harrow School, and was educated at Cambridge University. The work was translated into several languages shortly before its publication in London, and aroused much interest and discussion on the continent of Europe. It was translated into military circles of Europe, and every military journal, according to the light, discussed the merits of the book and its bearing on strategy. It traced the history of cavalry from its infancy down to its latest development at Rossignol and Sedan, its most important characteristics being those devoted to the employment of this branch of the service in the American Civil War. Lord Egerton Denison spoke with comprehensive knowledge of the subject, aided by intimate friendships with many of the leading men of great influence in the South. But the book is delightful reading throughout; and the reader who is fond of military affairs and who wishes to acquire a good grasp such subjects have been handled by a Canadian author. Literary grace, technical accuracy, and a wealth of information are combined in this work. Some years after the appearance of this work a large prize was offered by the Grand Duke Nicholas of Russia for the best work on the organization of cavalry, open to all countries. Among the entries was the work of Lord Egerton Denison, which might have secured a hold for Lord Denison, more Canadian, at attempt to compete with the works of the day was not only worthy enough of attempt, but he succeeded as well, and carried off the prize on the part of the Russian Empire. Under the political conditions then in existence it had to be handed in written in the Russian tongue. Lord Denison was sent to St. Petersburg and had translated there, under his own supervision. He was subsequently honored by the Grand Duke and other military dignitaries, and was much interested in the social and political life of the country, then as now, the center of the Russian army. After some delay in the various ways, contributions from the ablest military writers of the time had been made, and in the closest scrutiny of criticism, Col. Denison's work was considered the most convincing, the most suggestive and exhaustive, and was adopted as a guide for the Russian cavalry regiments, a thousand of which he generally handed over to local charities in St. Petersburg, and raising a balance of £500 through Toronto. This money has been translated into almost every language in Europe. This is not to say that the military mind has been changed to any certain extent, but this one convinced it, and it is largely owing to its influence that the Canadian author has been placed in the Imperial army, and that large numbers of our mounted forces are now trained in the same manner.\n\nOur limited space forbids us to enlarge upon this notable achievement, but it is that of Lord Denison, and we can but reply that he is the most illustrious member of the order of merit on the royal side this year. Of this Canadian author, a vigorous intellect, deeply versed in military history and military organization, we may say that he is the most illustrious member of the order of merit on the royal side this year. Of this Canadian author, a vigorous intellect, deeply versed in military history and military organization, we may say that he is the most illustrious member of the order of merit on the royal side this year.\n\nTHE TELEGRAPH.\n\nThe following letter written by Mr. Hartley Gibbons to Mr. H. C. Stevenson of Prince Albert was kindly furnished to us by Mr. Stevenson. It is one of the closest and most interesting letters Col. Denison ever wrote, and contains the most convincing, the most suggestive and exhaustive, and was adopted as a guide for the Russian cavalry regiments, a thousand of which he generally handed over to local charities in St. Petersburg, and raising a balance of £500 through Toronto. This money has been translated into almost every language in Europe. This is not to say that the military mind has been changed to any certain extent, but this one convinced it, and it is largely owing to its influence that the Canadian author has been placed in the Imperial army, and that large numbers of our mounted forces are now trained in the same manner.\n\nOur limited space forbids us to enlarge upon this notable achievement, but it is that of Lord Denison, and we can but reply that he is the most illustrious member of the order of merit on the royal side this year. Of this Canadian author, a vigorous intellect, deeply versed in military history and military organization, we may say that he is the most illustrious member of the order of merit on the royal side this year.\n\nREAL ESTATE.\n\nThe end-pantry having purchased the Burd & Baker Estate, wishes to inform the public that they are now on the market.\n\nHARRY E. BURD.\n\nNUMBER OF LOTS ON THE Burd & Baker Estate.\n\nGovernment Road, Oct. 10th, 1881.\n\nHis Excellency the Governor General, in the exercise of the powers conferred on him by the Constitution Act, has approved the following appointments:\n\nJ. O. Davis & Co., Caledonian Restaurant.\n\nLivery and Feed Stables.\n\nIron for Sale.\n\nChester Thompson.\n\nTHE BEST BEER AND CIGARS\n\nJohn Wymerich, Prop.\n\nHudson's Bay Co'y.\n\nFarming Lands!\n\nFor Sale in Manitoba & North-west.\n\nThe Hudson's Bay Company owns 7,000,000 acres in the Great Fertile Belt, and now offer for sale 300,000 acres already surveyed by the Government of Canada.\n\nALSO\n\nTown Lots\n\nFor Sale\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nCHOICE OVERCOATS\n\nCall early and get first selection.\n\nKerr & Hamilton,\n\nIronmonger's Store, Prince Albert, N.W.T.\n\nJ. R. M. Phail\n\nHas just received a supply of\n\nSugars, Dried Apples, Tobacco, other Groceries\n\nChains, Powder, Mrs. Potts\n\nSad Irons, Sheaf Hardware, etc.\n\nMen's Beaver Otter Persian Lamb and Astrachan Caps.\n\nMitts and Mocassins of the Best Quality\n\nJ. M. Campbell\n\nBankers, Real Estate, Insurance and Financial Agents.\n\nTHE CABLE HOUSE.\n\nThe Best Beer and Cigars\n\nJohn Wymerich, Prop.\nTOWN NEWS.\n\nTom Davis has a large stock of Japta, Overcoat, Jumpers, Moccasins, that is advertised in the paper to-day.\n\nJ. O. Mackenzie is going to move, to-morrow his bed and household effects Mr. Carter will make new signs on the premises.\n\nA hunter who was killed by a bear, is seen in the show case of J. O. Davis & Co., which that enterprising firm intend giving as a prize to the strongest man in Prince Albert New Year's day. The match is open to all residents of Prince Albert.\n\nTom Davis will have a handsome assortment of Xmas goods over spread in Prince Albert, which he is selling 50 per cent below the usual prices.\n\nAt the general meeting of the Saskatchewan Curling Club, Col. Spence was re-elected President, Mr. H. B. Hay Vice-President, Mr. J. F. Maclean was elected Secretary-Treasurer, Messrs. Brown, Gordon and Maclean were elected committee of general management.\n\nWe are informed that advice were received by telegraph to the effect that Sir Hugh Allan had purchased the Canadian Pacific, Northern and Northwestern Rail way, and that the work will be pushed through at an early date, and at lower rates than hitherto. The question now is, not whether we are to have a railway, but what line will be the first put through.\n\nTom Davis will be glad to purchase for you.\n\nThe above case was heard before Judge McBeth v. Davis, for damages for plaintiff with coat, McLean v. Watson for plaintiff, Ellis v. defendant, Ander v. Smith, for plaintiff, judgment for plaintiff $100 with costs, McLean v. Watson, for plaintiff, Maclean v. Watson, for plaintiff.\n\nLadies, if you want beautiful Cardigan Jackets, Cloaks, Pramadine Scarfs, Ten-ner scarfs, Big Teddy Bear Costumes, etc., you will save money and get the best goods in town by calling at J. O. Davis & Co.\n\nIn the paragraph in our last issue refering to the fact that ex Sergt. Kinnear had been arrested by the police of the District Court, we must not be understood as reflecting in the slightest degree upon the character or conduct of Sergt. Kinnear, who we believe gives every satisfaction in the discharge of his duties, nor do we wish to make any personal attacks.\n\nThe two positions Deputy Sheriff and Clerk, cannot be properly held by the same person.\n\nIn our report of the surprise party held at Athabasca, Mclean's residence, we forgot to mention that Mr. John Mclean entertained the company during the dinner mission. He performed, with his usual eloquence, a very amusing sketch, a beautiful piece called \"The Jack a Tar on Board a Man of War,\" also to the sur-prise of the company, he sang and danced \"The Irish Paddy,\" \"Towards the close of the evening's amuse- ment he sang \"The Old Flag\" and \"Home Sweet Home,\" in fact he promised himself to make the surprise party a success.\n\nSome years ago we heard that the Indians were trying to prevent the cattle from crossing the border into the Dominion, by setting fire to the prairies in front of them. This year, however, the Indians, with all his cuteness, has been circum-vented this time. A change of wind drove the buffalo away from the herds, and this flack movement has driven them in large numbers to the North. Our people have taken advantage of this fact, and have sent Mr. Ellis D.L.S., who is here on his way to Vig- nals, where he will employ himself in rounding up the buffalo, and will probably return within a few weeks.\n\nMr. Charles Levery, manager of the North Western Mining Company of Toronto, who has been in Prince Albert for the last six weeks, went away by the last mail. He goes around the country lecturing the Company on the subject of exploiting the company which now lies at Cumberland, and will make additional and improved apparatus for developing for gold in the Saskatchewan River district. He expects to return about the end of January or beginning of February, when he will superintend the building of a house to receive the ma-chinery. Contracts have been made and hopes have been delivered by the late Mr. McPhee, who has been engaged to build a dam across the river, and to improve the quality of our river, and we have no doubt that Mr. Levery will succeed. Mr. Levery made himself very popular during his short stay here, by his courteous and genial manners.\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nTo the Ladies of PRINCE ALBERT.\n\nWe beg to notify the ladies of Prince Albert that we have just opened up\n\nFIFTEEN CASES GENERAL DRY GOODS\n\nDress Goods Satins Silk Velvets, Velveteens, Cashmere, Taffeta, French Beige and Fancy Dress Goods.\n\nCloakings.\n\nMelton, Fancy Cloakings.\n\nShawls.\n\nTartan, Wool, Fancy Shawls.\n\nHose.\n\nLadies' Balloon Hose, Ladies' Seamless Hose, Ladies' Ribbed Hose, Ladies' Wool Hose, Mince and Children's Hose.\n\nUnderwear.\n\nLadies' Underwear, Ladies' Felt Skirts.\n\nCollars and Cuffs.\n\nWe show a Select Assortment of Ladies' Collars and Cuffs.\n\nSILK HANDKERCHIEFS.\n\nClouds.\n\nMince and Children's Hose.\n\nLadies' Winceys, Woolen Gowns, Flannel, Fancy Ornaments, Quilting Prints, Linings, Lace Curtains, Cloth Covers.\n\nQuilts.\n\nWhite and Colored Quilts.\n\nComforters.\n\nBlankets, Blankets, Blankets.\n\nOil Cloth.\n\nDouble and Fancy Oil Cloths.\n\nGREEN WINDOW HOLLAND Yarns.\n\nCanadian Yarns, Scotch Fingering, White Black, Oxford Grey, Navy Blue, Red, Gold, Silver.\n\nCarpets.\n\nTapestry and Woolen Carpets at very low prices.\n\nBoots.\n\nLadies' Warm Lined Boots.\n\nSTEWART & WOOTTON.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\n\nJust arrived, a Large Assortment of Raphael's Prize Exhibition Cards.\nCall early and make your selections.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHORSE SHOE TO THE FRONT!\n\nI HAVE JUST RECEIVED THE LARGEST AND ONLY STOCK OF\n\nXmas Presents AND Holiday Gifts\n\nEver offered in Prince Albert, which I will sell off at 20 per cent below usual prices. Ladies, come and see for yourselves. I intend to sell at reasonable figures.\n\nALSO JUST RECEIVED LARGE STOCK OF Clothing, Furs, Arctic Overshoes, Cree Moccasins\n\nMADE FROM CANADIAN MOOSE.\n\nSHIRTS. SHIRTS. SHIRTS.\n\nThe only assorted stock in town. Give me a call and satisfy yourself that I will give you the worth of your money.\n\nTHOMAS O. DAVIS,\nSign of The Horse Shoe.\n\n1879. 1882.\n\nSTILL LEADING.\n\nIf a Bostonian invites you to dinner and holds a postcard. N.B. he may say NO BEANS.\n\nOUR OVERALLS\n\nAdvertised last week are going with a rush.\n\nLADIES WILL PLEASE REMEMBER\n\nBetts & Gwynne's\n\nDress Goods, Wincey, Mantles, Mantle Cloths, Underclothing, Satin and Lustre Skirts, Fancy Goods and Laces\n\nGent's Linen and Paper Collars--14 to 17½ Inches\n\nFull Stock Tobacco and Cigars, Groceries and Canned Goods, Toilet Soaps and Patent Medicines\n\nW. J. CARTER,\nPRINCE ALBERT\nBuilder and Contractor.\n\nPLANNING MILLS AND SASH AND DOOR FACTORY.\n\nDOORS, SASH, &C.\n\nPlans nd Estimates furnished when required.\n\nResidence Near Presbyterian Church.\n\nGOODFELLOW BRO'S.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882112901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 6097, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 397, 1], [397, 3059, 2], [3059, 7875, 3], [7875, 9311, 4], [9311, 18485, 5], [18485, 25476, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]