[{"id": "cc5724ebfd87440b465eccd1b6162d53ff19439e", "text": "Our future looks brighter at present than it has done for the past year. We have now every reason for believing that next year, if not this, will see a great railway into Prince Albert and the work will be commenced at once. While we have no doubt that this road will be built we would advise people to keep cool and not get excited over the prospect of a boom or the chance of their expectations being realized for a short time. The opening up of a railroad will improve the condition of everyone in the district, but we do not think it will cause a great rise in real estate prices nor will it bring a rush of immigration until a large immigration takes place, they will not increase much.\n\nWe wish to call the attention of our local representative organizations, such as the Town Council, Board of Trade and Agricultural Societies to the necessity existing for laying the foundations and rearing the structures of this district before the eyes of Canada and other countries. If the railway comes to Prince Albert we want a large immigration and the only way to get a good class of settlers is to make known the advantages which the district offers as a field of settlement. Hitherto such literature has not been brought in many places, but now it has become a necessity. We think some of the societies should be called to task and employ some good man to set out, outside the world in pamphlet form the vast superiority of Saskatchewan as a home for emigrants from other places. We have in our midst men well qualified for the task and we have no doubt that some of them could be induced to write such a pamphlet if the cost of publication were guaranteed.\n\nOur city fathers are to be congratulated on the establishment of a ferry over the river within the town limits, more especially as it has not cost the town one cent. A more valuable arrangement cannot possibly be made. Messrs. Macdonald & Davis, who own the ferry, are also deserving of the thanks of the town for the enterprise they have shown. They have the exclusive privilege of carrying passengers across the river for three years, and we trust that they will find it a paying investment. The ferry will prove a great boon to our citizens, as there are some beautiful drives north of the town. We hope that a road to the Snake Plain settlement will bring a good deal of trade to the town.\n\nA rumor, which we trust will prove to be true, is that the Hon. Mr. Dewdney will visit Prince Albert towards the end of the present month. The late Mr. White was here in 1886, when the first cabinet minister had been in this district. Mr. White's visit has been most beneficial to us in many ways, and we believe that Mr. Dewdney's object in coming up now is to learn by personal contact with the people whether any grievances exist and to what extent. Mr. Dewdney, since becoming Minister of the Interior, has reformed some of the abuses which existed in the Northwest, and seems determined to administer the affairs of his Department in the way which will be most to our advantage. If he visits this place, as we trust he will, we consider it the duty of our citizens to give him the fitting public reception that his position and merits deserve at their hands.\n\nComplaints are being made by our firemen that the citizens do not take the interest in their organization that they should. We entirely agree with them, and say that the citizens of No. 2 fire company are young men who have nothing or very little to lose by a fire, and as they give their services for nothing and keep up their organization, those citizens who do not belong to the company and who might be losing a lot by the loss of fire could do less than give the boys some encouragement, even to the extent of attending their meetings. That would not be much to do, but it would be appreciated by the firemen that the citizens took an interest in their welfare and appreciated their efforts. These fire companies should be kept in a thorough state of efficiency, for although we have been fairly free from fire accidents by fire in the past, there is no telling how soon some old frame building may take fire, and with a favorable wind at the time, the result might be very disastrous. The Town Council should also secure a lot of land in connection, before the price of land goes up, and build a rough shed in which to store the fire apparatus, so as to protect it against the weather and prevent the property being stolen or lost.\n\nA rumor, which we trust will prove to be true, is that the Hon. Mr. Dewdney will visit Prince Albert towards the end of the present month. The late Mr. White was here in 1886, when the first cabinet minister had been in this district. Mr. White's visit has been most beneficial to us in many ways, and we believe that Mr. Dewdney's object in coming up now is to learn by personal contact with the people whether any grievances exist and to what extent. Mr. Dewdney, since becoming Minister of the Interior, has reformed some of the abuses which existed in the Northwest, and seems determined to administer the affairs of his Department in the way which will be most to our advantage. If he visits this place, as we trust he will, we consider it the duty of our citizens to give him the fitting public reception that his position and merits deserve at their hands.\nGENERAL NEWS\n\nOttawa, April 13.—The Government has three hours to decide whether to release Mr. Donald Smith, who brought up his appointment as Minister of Railways and Canals, but Sir John A. Macdonald has not yet made the decision.\n\nMontreal, April 23.—Another push up in sugar prices. The market is now selling at $6 per lb., to be paid in Great Britain. Here granulated at least 15% higher, yellow, 10 to 15. Refiners talk of raising prices.\n\nThe Bank of Montreal dividend was expected to be declared today, but the Board adjourned without action. It is believed that the dividend will be paid by Donald Smith returns from New York, whether he has gone to meet Sir George Stephen.\n\nAndy Mahoney, charged with robbing Van Houten, a traveller of Mrs. Conroy, Toronto, of a large quantity of jewellery, was remanded to the police court, but failed to secure new bail.\n\nThe jail here is overcrowded until fifteen prisoners will have to be sent to Three Rivers to morrow and twenty-five to Quebec.\n\nQuebec, April 23.—Flares were firing all night, and the firemen were called out every hour last night to help in the celebration of St. George's Day, which was further honoured by a special service in the Anglican church.\n\nEverything is being prepared for the opening of navigation. The Richelieu company passengers were put down yesterday morning, and two sailing schooners have been sent to Matane to discharge the cargo of the barges which were stranded there since last fall. Davis new steamer Lionel Lord Stanley, recently built in Clyde, will likely be the first vessel to arrive from the old Cape Race inward bound.\n\nSt. Thomas, Ont., April 23.—In deference to the Minstrel Association, which some time ago started a provincial application for the reduction of Sunday traffic on the railway, Mr. Morford has issued an order to stop the heavy Sunday freight traffic on the Michigan Central railway through this town will be discontinued.\n\nNorthbrook, April 23.—Donald Morrison passed a good night, better than for a long time. There is little fear of his imminent return. When Morrison was examined before the grand jury he found a small calked revolver concealed in his coat. As soon as he is able Morrison will be brought back to this city, but his trial is not expected to take place before October. The feeling among the quarter is bitter and enthusiastic for breaking faith with Morrison and his friends. They say they will be able to prove that Morrison assisted and encouraged the thieves. This will probably tell in Morrison's favor at the trial.\n\nAylmer, April 23.—The coroner's jury, consisting of Mr. Justice Gifford Williams, who disappeared mysteriously eighteen years ago, have been discovered in an old house. An investigation is being held. It is believed to be a case of murder, and the evidence will be forthcoming to convict the perpetuators.\n\nToronto, April 23.—On the colonial party which left here for Manitou on Friday last, there were about 200 settlers. Next Tuesday will be the last postal party of the season.\n\nPrescott, April 23.—Gatineau's residence and Miss Gatineau's bakery was burned to-day. Miss Gatineau was burned to death. Loss, $15,000.\n\nHalifax, April 23.—The schooner Eliza Jane, bound for Liverpool, on the River, is ashore on Fog Cape Pier, and is in need of full of water and will be a total wreck. The crew is safe.\n\nBerlin, Ont., April 23.—The evangelical conference sitting here, has passed a resolution condemning the Quebec government for its policy of excluding the Jesuits and the Dominicans from permission for it to do so.\n\nHalifax, April 23.—John Sutherland and his child, aged 8, His wife and child were killed by lightning striking the house. His wife and three other children were severely injured.\n\nSt. George's Day was celebrated here with the usual procession and services at St. Paul's, performed by Bishop Courtenay Arch. McPhail, J.P., of Gay River, Halifax county, has been arrested for forgery, in the endorsement of a note for $100.\n\nWindsor, April 23.—Sol White is disposing of some of his property and intends going to Europe, where he will remain for several months.\n\nThe Marquis exhibit car arrived here this morning, and has been crowded all day by the people.\n\nPoveshell, April 23.—The Athabaskan is expected for Owen Sound with 20,000 bushels of wheat, 10 cars of grain, 20 cars of stock freight, and a fair list of passengers.\n\nVictoria, B.C., April 23.—The cornerstone of the provincial royal jubilee hospital was laid this afternoon by Mrs. Macdonald, wife of the Premier.\n\nA detachment of marines from H.M.S. Surprise, and the band from the same ship, enlisted in Victoria, in the proceeding.\n\nAbout 5,000 people attended, including 500 school children, who sang hymns. Addresses were made by the Mayor Grant, Judge Crease and others.\n\nMrs. Nelson was presented with a silver cup by the mayor and the band played and the body after a brief repose in the church was carried to the grave in the presence of living the stone, containing the name well and tiny ring. The flag was lowered by Archie-con Scrimm and the national anthems by the school children.\n\nHORSE SHOE STORE.\n\nPrices Lower than Ever\n\nTHOS. O. DAVIS.\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double the size of the stable yard, we respectfully call the attention of the travelling public to these improvements.\n\nWell and river water almost at the door.\n\nWe have also added fresh hay, straw, oats, corn, turnips, etc., to our stable yard, and a turnip toad can be had west of W. Murray, at reasonable prices.\n\nOur rates are new, and not liable to breakage.\n\nNEILSON & McBEATH\n\nA GOOD FISH!\n\nIt is a trite saying, suffered for the sake of disinterested lovers, that there is as good fish in the sea as were before caught therein, but this does not hold good in the case of\n\nW. R. FISH,\n\nThe Merchant.\n\nWho keeps a full line of General Goods at his establishment. He is the best fish in the line of business, and can tell a good story of himself if necessary. This, however, does not prevent him from attending to his numerous customers. He is sure to please, as he has one of the best stocks in town. Call on him.\n\nNEW BAKERY\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE. This is No Humbug.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889051001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 2697, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5324, 2], [5324, 5324, 3], [5324, 11631, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]