[{"id": "f795a8cbc75f19c495301bb05650af20add9b7c8", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 2, 1885.\nVOL. 3.—NO. 48.\n\nBankinghouse\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTransact General Banking Business.\nIntrest allowed on Deposits.\nMoney lent on mortgage.\nDrafts issued at all points in the Dominion.\nCollections undertaken and promptly attended to by Postal Agency.\nBankers—Merchant—Bank of Canada.\n\nLincoln College\nA degree college for modern and classical students.\nPrincipal—Mr. Henry Julian Lyall.\n\nNotice\nThe public are hereby cautioned against purchasing\nTwo Horses, Wagon and Harnesses\nFrom J. O. Davis, as I claim them as my property.\nTHOS. O. DAVIS\n\nHouse to let\nThe dwelling house formerly occupied by Mr. W. J. Kennedy, situated at 12 St. Paul avenue will be let on short or long lease.\nVery suitable for a small family.\nFurther particulars apply to\nJ. F. KENNELED, or\nW. R. GUNN.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment from ever brought into Prince Albert.\nShannon & McLeod.\n\nCaledonia Brewery\nEast End.\nThe proprietor of the above concern is prepared to supply any customer with his beer, either in bottles or kegs for cash.\n\nChas. Woodman Proprietor\n\nMontreal\nSept. 21st. — A cheque for £5,000 has been received in connection with the proceeds of the sale of the property of the late Mr. James Woodman.\n\nHugh McDougall, East End Bakery.\n\nAlex Lang\nGeneral Blacksmith\n\nArthur E. Sifton, Esq.\nBarrister, Attorney, Conveyancer and Solicitor Public\n\nTelegraphic\nThe very latest news by wire\n\nStrayed!\nCause on to six year old mare, purchased at Fulton Settlement, about a month ago.\nOwner can have the same on proving property and paying expenses.\n\nCharles Focha\n\nSuperseded!\nThe Hon. Mr. Justice Shaw of the District Court Division of Municipality of Prince Albert, held his last court.\nHe will now be heard in Edmonton.\n\nTelegraph Office\nNewcastle, Alta., Oct. 2nd — Harvesting is completed and the threshing and fall proceedings have been closed.\n\nChas. A. Young, Proprietor\nBanking House\nW. W. Knowles & Co.\nPhoenix Insurance Company\n\nProprietary Clothing\nSamuel Grant & Co.\n\nGeorge Bentley Barbers and Hair Dresser\nCharges: Moderate\nShop. First floor east Shannon & McLeod's\nJ. D. Hannafin, Auctioneer and Commission Agent\n\nC. H. Murray, Optician\nJ. B. Murray, Chemist\n\nNew York, Sept. 21st. The English cotton growers are worried and nearly in despair at the disaster which befell the English cotton buyers. It is said that over four hundred thousand dollars is estimated to be lost by the loss of two ships. The New Hampshire and the North Star.\n\nExpressed\nExpressed.\n\nK.W. Wilson, Proprietor\n\nTHE CHIT-CHAT LOCALS\nGathered by Mrs. Harrington\n\nWarner's Safe Cave at Clark's drug store.\n\nThere is plenty of good cheap coal oil now at O.T. Davis.\n\nA. Porter left by mistake the stage yesterday for Grande Prairie.\n\nCol. Speakard had a long flagpole placed on the top of his residence.\n\nAs was shown last week, the band played music at the hall where the meeting was held.\n\nMr. Jan Sinclair, the owner of the new building across from the bank.\n\nA. Porter arrived from Regina on Tuesday, where he had been summoned on Judge Scott's case.\n\nThe latest reports from Winnipeg say that Lord Hobson is recovering from his recent illness.\n\nSuperintendent Perry has arrived in town from Prince Albert. He was accompanied by Mr. Terry.\n\nPosters may be seen throughout the city advertising for the Tiffany Hotel Company.\n\nWe have recently visited every branch of the travelling fraternity except the lumber yard.\n\nLast night's stage brought us on the porches of Julia Jackson.\n\nChief Factor G. Belanger, of Cumberland, has arrived in town to take charge of the Prince George Post, here, during the Hon. L. Clarke's absence.\n\nWe understand one of our merchants has taken umbrage at another merchant.\n\nIt seems that some couples expect to go away next week.\n\nJ. M. Campbell has a load valued at $500 consisting of Winnipeg flour and twenty-five barrels of flour on the way.\n\nJohn Ross, who expects he will arrive in a few weeks.\n\nOur representative member, Mr. B. G. Hughes, has returned in town on Monday evening.\n\nF. J. Montgomery's hotel is full of ladies now.\n\nH. W. Goodwin has returned from Prince Albert yesterday.\n\nWe regret the loss of Herrmann but would like to see his business succeed even under the management of his successor.\n\nMontreal\nSept. 21st. — Some of the proprietors of the exhibition building have availed their opportunity to pay for their exhibit space. It is reported that not more than twenty-five per cent of the exhibitors have paid.\n\nThe Calgary Tribune announced that the Bank of Montreal has opened a new branch in Calgary, having been established here.\n\nSt. John's, Newfoundland\nSept. 21st. — The Hon. Mr. Justice Murray of St. John's has been engaged in the practice of law.\n\nDr. H. Grant, Proprietor\nThe Toronto Mail says: It is considered that medals have never before been issued to troops engaged in civil war. Medals were given, it is true, to the British soldiers who took part in the suppression of the Indian mutiny and the Maori and Kaiser revolts; but these latter were not comparable to the task which has been laid upon our own troops.\n\nGratifying this, what of it? There is no precedent simply because there has been no parallel. The medal is the first tangible instance of the fact that a rebellion has been suppressed by citizen soldiers, and this fact is doubtless regarded by the War Office as of sufficient importance to justify its issue.\n\nIt is an excellent moment. It is wrong doing, and so to whom, in giving each voter a token of his Sovereign's appreciation of his patriotism? The Medals were given to the men who did not flinch from the task that was set them, and they are not likely to be forgotten.\n\nInformation has been received by the Militia Department that Imperial silver medals have been issued to the troops recently engaged in the suppression of the North West Rebellion.\n\nKINGSTON.\n\nSeptember 21st. — B. Battery left for Quebec. A Troop Train and a Battery arrived Friday last.\n\nA tally of Red was hung out on Friday night, and the field common by volunteers in camp, in the presence of a number of spectators.\n\nWhen the rope was adjusted the soldiers rode the death warrant, and yelled of hanging him came from the crowd. To their amazement, the officer dangled in the air, they cleared themselves hence.\n\nTORONTO.\n\nNovember 21st. — The Kyle force next to day, and it had been shown that both the Ontario and the Ontario barracks knew Monroe to be a foreigner, yet did not expose him to the authorities. The result of such proceedings would be that some officer of the force would be sent to the provincial authorities, and the property Kyle's bail was fixed at $4000, himself in $1000 and two sureties in $100 each. Mr. Murray Manning is now of his residence.\n\nHAFIZIEG.\n\nHAFIZIEG, N. S. W., AUSTRALIA. A report has been made to Mr. Wallace Barker, Cumberland County, has caused a considerable scare among the residents. A man named Thomas Murray, who lives near Murray's Creek, was reported to have been killed by a bullet fired by a man named Murray. Murray was seen running away from the scene of the shooting.\n\nAn interesting experiment has not been made in England which proves beyond a doubt the exceptional strength and quality of the wheat grown in the Canadian North West.\n\nOn Saturday 27th July last, a sample of No. 1 hard red winter wheat from the Canadian Pacific Railway Dormitory Experiment Farm in the Canadian North West was forwarded by Mr. Alexander Macdonald, Superintendent Canadian Pacific Railway in Europe, to Mr. J. H. Dunham, of the \"Miller\" at a former Colchester, Essex, England, and there seen in what was but partly opened when the sample was gathered on August 12th. Threshing showed to be well developed very sound, and in every respect an excellent sample.\n\nOn the London market the quota price for grain was fixed from 34 to 36 shillings per quarter of 60 lbs, while the best Red wheat was fetching only 32 to 33 shillings, in other words two Canadian North West samples stood up well against English, and obtained a better price.\n\nThe general expression of English millers and dealers was that the wheat was unquestionably a very fine sample, and almost any quantity will be had without difficulty and shipped will find a profitable market in Great Britain.\n\nGuelph.\n\nGuelph, Sept. 21. — Clippers beat the Maple Leafs by 7 to 4.\n\nLondon.\n\nLondon, Sept. 21. — London, 9, Leeds.\n\nNotice of Dissolution.\n\nNotice is hereby given that the Partnership existing between the undersigned as \"Stewart Brothers,\" in Prince Albert, in the North West Territories,\n\nGEORGE MERCHANTS\n\nfor the day following the death of William Stewart, the balance of the Partnership is to be paid to Mr. John Stewart who will carry on the same business under the style of \"George Stewart Brothers and Co.\" and will pay all debts due.\n\nDated at Prince Albert, this 21st day of October, 1885.\n\n(Signed) WILLIAM STEWART,\nby his administrator John Stewart.\n\nJOHN STEWART.\n\nPrince Albert.\n\nReferring to the above we beg to submit that the said Partnership is hereby dissolved.\n\nSTEWART BROTHERS.\n\nPrince Albert, Oct. 21, 1885.\n\nJAMES SIMCLAIR\n\nMerchant Tailor,\n\nAND DEALER IN\n\nGENTS' FURNISHINGS.\n\nAt T. N Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nPromptly attended to\n\nSTEWART BROS.,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\n\nTobaccos,\n\nCoffee,\n\nOatmeal,\n\nSugar,\n\nCanned Goods,\n\nCal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware,\n\nAT COST\n\nNOTICE.\n\nAll parties indebted to the old firm are requested to settle before the 1st October next, failing which the premises will be closed owing to the change in the business.\n\nJOHN A. MACDONALD,\n\nSuperintendent General, Indian Affairs\nTHE SWITCH-TENDER.\n\nA Thrilling Precious Story.\n\nA little white house seems asleep among the blossoming apple trees. It is early morning, and all is light and fresh. In a little room, a man and woman sit by the threshold, a man with a quiet face and an expectant look in his eyes. There is a movement outside the front door—a tree—The man opens the window broader, and from the tree, like a sylvan rustler, comes a smiling little fair-haired girl, who throws herself, with a burst of laughter, into his arms.\n\n\"May I take the little one, Celine?\" asks the father. At these words a lovely blush overspreads the child, much to her appearance.\n\n\"Again!\" she said with a shade of annoyance.\n\n\"Yes, we share her very fairly,\" said the man with the kindest and most paternal smile. \"If you knew,\" he resumed, \"how much the child has been going through. Don't you think me too hard when I find them up long in her absence? Anne grows more restless, more troublesome every day. It is dangerous to let her go with you.\"\n\n\"What do you mean?\" said the man, turning pale.\n\n\"I mean that I am afraid of your rail-road, sir, where you are so accustomed.\"\n\n\"You are very foolish.\"\n\n\"Leave her here. I can hardly breathe while a little girl is down there. It is frightful to think how she might get away and be killed.\"\n\n\"Don't talk so, Celine.\"\n\n\"Oh, sir, she is always away while you are at the switch, and if you looked to after her, you would fail in your duty, and might be responsible for her death.\"\n\n\"Oh, Celine, you don't,\" cried Laurence, who had rushed in at the moment.\n\nThe child was familiar with the passage of the train, it is true, but she is too young to comprehend the danger.\" And his appearance seemed to have vanished.\n\nOne evening, however, when he went home to dinner he had been preceded by the rumor of an accident which had occurred at a neighboring station. A brake man named Simon had been killed by a train. Celine questioned her husband while they were at supper. \"It is true then, the little girl killed Simon?\"\n\n\"No,\" replied Laurence, \"he was in great danger, but he escaped, thanks to his wonderful presence of mind.\"\n\n\"There he is now,\" said Celine.\n\n\"No; and yet the whole town went over him. When Simon saw it too late to save himself, he seized the brake lever of the engine, and when the train passed by he got up again and again and again, until he was made free. At last, as he fell, there came a crash, and he was very warm, after that the time seemed long. That was not killed, but Simon was not really frightened. He is ready to go to work again,\" added Laurence, tranquilly.\n\nBut Celine's anxieties were aroused afresh. Some time after that the hour of service came round, and Celine took the sign section. He could no longer think of taking Anne with him on the evening hours, a poem about the village was inscribed on it. The doc tor who came wrote a prescription, and it is the physicians who find them. They cannot see the child in the town, and you must not wait for them. Let me go on to the railway station where we shall stop and ask the station master on my account for a little lameness. That will quiet the child down. We shall go back and fetch the doctor.\"\n\n\"Celine! Celine!\" cried several times. It was certain that the station master would not hesitate to lend them a hand.\n\nThe young woman thought at first of leaving Anne alone, as she had particu larly restless all day, Celine concluded to take her. They had to pass Lamont's store on their way, and they heard Anne now coming, and as soon as they were within hearing, began to question them.\n\n\"Old Gratehouse is very ill, and I am going to the station for medicine.\"\n\n\"That's right. We have Anne.\"\n\nCeline lifted the sign over the head of his father, who took the precious burden on his shoulders and returned with her mother, before whom she lay.\n\nSuddenly the engine appeared, the smoke curling, the darkness gathering, the noise coming, the children stopped. Anne did not stop, however, but travelled faster than her companions. He realized that the child regarded everything as duty. He saw in the station the frightful accident he would have caused, and heard the cries of the wounded, the last gasps of the dying. The problem was before him—his daughter or others? It was no alternative between the two. With a feeling prompting the sentiment of duty became most powerful, and he saw not merely in his hands the lives of two children, but a thousand more, perhaps the future of a nation. He paused, finally knowing what he did, and went to meet the child.\n\n\"Oh, on it went, and he could see it pass the station, going by as if it were happy and carefree. He turned back, into the darkness. Duty had been strongest. Staggered, staggered, Anne, Laurence came to the house where they had helped him kill his child.\n\n\"Now,\" he said, \"it is my turn to die.\"\n\nThe other train was about to pass. He stepped forward, crossed his arms, and waited. The child stood still, hesitating, hesitating, hesitating, thinking of nothing, there he stood.\n\nBut that instant a burst of laughter sounded behind him. He turned, wild with hope.\n\n\"Oh, naughty papa! he won't play with Anne,\" said the most beloved of voices.\n\nThe child was clinging to him. Laurence bent not to see, but to hear. His feet came then alike. He raised her and fed with his treasure into his little cabin. Then he put her on the ground before the fire, and Anne laughed, and Anne bore so much joy and felt fainting beside her daughter, who, in her turn, screamed with delight.\n\nAt this moment Celine arrived. She heard Anne's voice, and hastened her steps. Anne's stepping inspired her also. Anne! Anne! Anne! She ran to Anne, crying, \"Mamma, mamma, I am frightfully hurt.\"\n\n\"What is the matter?\"\n\n\"Papa has fallen down.\"\n\nCeline rushed toward the nearby bench. Anne stood there completely in silence, stretched on the ground. She went for help, and the doctor, who had been called by Anne, restored the poor man to consciousness. The next day when Laurence rose his wife, Anne, came to the window, and looked out toward the east, where she had exhibited a corpse like pillar which never left him to the sight of man. Laurence proceeded to tell them all. When he had finished, the poor father turned to Anne and said:\n\n\"Bah, darling, why weren't you quicker?\"\n\n\"Why,\" said the child, \"I did what Simon did.\"\n\nPRINCE ALBERT\n\nPlanning Mills and\n\nSash and Door Factory\n\nCor. Vanney and Maclean Sts.\n\nPrince Albert, W. T.\n\nNotice\n\nClaims of Half-Breeds and Original Indians\n\nWHEATSKIES—Since the completion of the Half-Breed Act, the claims of many families have been under the Manitoba Act, extra compensation has been refused by the Government of Manitoba, on the 16th July, 1870, the claimants were informed that their claims were invalid, some are still coming for compensation, while many have been refused. It is now necessary for those who claim that they are children of Half-Breed heads of families to go to the offices of the Department of Indian Affairs, Ottawa, and Wherries, the 160,000 acres set apart for each Half-Breed child entitled, must be exhausted by such allotment, and by the 20th November, 1875, a bill was introduced in Parliament, and it has been decided to extinguish each such allotment by the sale of an equal amount of land to each Half-Breed child entitled.\n\nNotice is hereby given to all Half-Breed heads of families resident in Prince Albert, and vicinity, to appear at the Department of Indian Affairs, Ottawa, and the \"Original White Settlers,\" and the \"Half-Breed Heads of Families,\" to make claim to the compensation due to them, in the name of the late Mr. J. J. B. Smith, Secretary of State, who will be present at the Department of the Interior, Ottawa, May 20th, 1876.\n\nJ. D. MAVEETY, Publisher and Proprietor\n\n3rd St., Prince Albert, Sask\nRECEPTION.\n\nOf the Hon. Thomas White\n\nOn Monday night a meeting was held in the school house, to consider the best way of honouring the Hon. Thomas White, Minister of Interior, who is about to visit this place.\n\nMr. O. E. Hughes was appointed Chairman, and Mr. J. F. A. Still, Secretary.\n\nThe Chairman in a few remarks, explained the object of the meeting. Calling upon each member present to give his ideas upon the matter.\n\nMr. John Stewart then suggested that the committee be appointed to take action, and called upon to explain what step had already been taken.\n\nMr. James MacArthur, as a member of the committee, briefly explained the step taken, and suggested that the report be given and submitted.\n\nMr. James MacArthur moved Mr. Taggart seconded that Messrs. MacArthur, Stewart, Miller and Colman be appointed a general committee to make arrangements for the reception of the Hon. Thomas White.\n\nFollowing were the names of the committee:\n\nMessrs. Adam McBeth, Wm. Fletcher, Wm. Miller, Geo. East, Andrew Spencer, Chas. Adams, Wm. Miller, Craig, Captain Henry, H. M. Montgomery, Capt. R. H. Bradenhorst, T. S. Davison, Andrew Goddard, Wm. Birkett, John Johnson, James MacArthur, Mr. P. B. Bell, J. F. McKeen, John Stewart, A. H. Clark, Col. C. E. Montgomery, Mr. G. Graham, Col. W. H. McKeen, Wm. W. MacLennan, T. N. Campbell, O. E. Hughes, J. F. A. Still, Dr. Smith, John McFarlane, Wm. McMillan, Archibald McKay, Cassie Flett, H. J. Montgomery, J. Kennedy, Geo. Dick, Wm. Carter, D. H. MacIntosh, Geo. Macintosh, Wm. P. Ross, Wm. Ross, R. J. Paterson, A. McNaab, A. MacLeod, John Macdonald.\n\nThe motion was then carried.\n\nMoved by Mr. J. Carter, seconded by Mr. Hamilton, that a public banquet be given to the Hon. Thomas White, and the committee appointed have full power to make necessary arrangements.\n\nThe motion then adjourned until the general meeting next week.\n\nAt the meeting of the general committee Mr. J. MacArthur was chosen Chairman, and Mr. J. F. A. Still, Secretary.\n\nA finance committee was appointed as follows:\n\nMessrs. J. MacArthur, H. J. Mayette, Col. Montgomery, Capt. S. D. H., Mr. Macintosh, Mr. Stewart, O. E. Hughes, Wm. Miller, Archibald McKay.\n\nMoved by Mr. J. Carter, seconded by Wm. Hamilton, that the committee report to the general committee at this place, on Thursday next at 5 o'clock p.m., and that the Secretary be authorized to send notice of the meeting to the committee.\n\nOn motion of Mr. A. H. Clark, the Chairman, Secretary and Messrs. were appointed a committee to communicate with the Hon. Thomas White about the time and place for the banquet, and report at meeting on Thursday.\n\nParliamentary adjournment the general committee met Thursday at 5 p.m.\n\nThe finance committee handed in their report which was carried.\n\nMotion made by Mr. Hamilton and seconded by Capt. Stewart that the committee address, draft an address, and present the same to a meeting of the general committee next Monday next, at the school house at 7 p.m.\n\nThe committee on decoration and banquet will also report at the meeting on Monday next.\n\nThe meeting then adjourned to meet again on Monday evening.\n\nGERMANY.\n\nBerlin, Sept. 21.—The national Zeppelin airship Germany is ready to admit Spanish prisoners captured at Tapia, but the fate of the whole English fleet, especially after the English rights had been settled in 1876 the Spanish Minister declared that the fleet in the Caroline had been saved by Spain.\n\nTURKEY.\n\nThe hand rendered some very recent and kindly services during the course of the evening, which was greatly appreciated.\n\nLORNE AGRICULTURAL SOCIETY\n\nSecond Annual Dinner.\n\nThe Second Annual Dinner of the Lorne Agricultural Society took place last evening at the Central Restaurant, Messrs. Craig, Montgomery, Mr. Miller, Craig, Montgomery, and was attended by the prominent agricultural men of the district. There were about sixty sat down to dinner, and when the speeches were over, Mr. Montgomery and Captains Macdonald and Ross, and Messrs. John Macdonald, Vice President and A. L. Macdonald, Secretary, addressed the members. After the main part of the dinner was over, the toast of the \"Queen,\" which was duly honoured.\n\nThe chairman then gave the \"Princess Alexandra,\" which was received by the Royal family, which was received with enthusiasm.\n\nThe next toast was the \"Government General of Canada,\" which was received with enthusiastic.\n\nThen came the \"Army and Navy,\" which was given in the names of Col. Macdonald and Capt. Stewart.\n\nCol. Macdonald spoke on rising, and said that he had been called upon several times to respond to this toast, but that on this occasion he would not respond to it, but that he was pleased to see that this coming from the prince of Prince Albert. The Col. paid a high tribute to the Duke and Duchess of Connaught, and also to various exhibits at the show.\n\nCapt. Stewart was enthusiastically received. He said that he was very thankful for the Government at Ottawa having named the services of the Prince Albert committee, and also that they had had an official dinner at this place. He took part in the rebellion, but that he had written to the Minister of Militia to that effect.\n\nThe next toast was the \"Lorne Agricultural Society\" and responded to by Mr. Macdonald, a member of the society.\n\nMr. Craig, was asked to propose the toast of the \"Prince Albert committee,\" and made a few remarks, and read a letter of apology sent from Mr. O. E. Hughes, the chairman elect, for Mr. Craig's absence.\n\nAfter which he called upon Mr. Newlands, young lawyer of our town, Capt. Henry then proposed the \"Prince Albert committee,\" and Mr. Craig replied, Mr. Miller to his feet, who told us that none of the directors had been appointed, and that there was a great amount of many advantages to the town, and that it could not be a success, but that others had a strong reason to believe that it would succeed, and he was delighted to have an exhibition, which he said, as well as all knew, was a credit to older and younger citizens alike.\n\nMr. Miller gave great praise to the indefatigable exertions of Mr. Craig, and said that he thought it was due to him that the show had been brought to such a success.\n\nMr. Craig then proposed the toast of the Parliament of Canada, to which Mr. John McNaab, M.P.P., for Neidpath, responded, and the toast was received at once.\n\nMr. Craig then proposed the toast of Prince Albert, since he had first visited fifteen years ago, and that it was a very important day in the history of the town and county, for their industry and enterprise.\n\nMr. Craig then proposed the toast of Mr. J. L. Johnson, then faced the gathering with a lively and well rendered song.\n\nOther speeches had been made by Messrs. T. N. Campbell on behalf of the ladies, Mr. Vandenbergh the farmers, and Mr. A. H. Clark, the dinner was brought to a close by singing the National Anthem.\n\nHAMILTON.\n\nHamilton, Sept. 21.—Brigadier has captured the Archbishop of Verona; the king and numerous ladies have demanded the sum of £3,000 for the ransom of the princess.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine Plastering Hair, steam refined Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the wants of the territory Department.\n\nAn Elegant assortment of Carmela, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Sodas, Fruits, Yaffle Pinners, Lemon Creams and Iced Sultanas.\n\nGENERAL GROCERIES.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. HUGHES & CO., General Merchants and Indian Traders.\n\nHave just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising Morton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also our best Ogilvie's Flour, Which we will sell cheap for cash.\n\nT. O. DAVIS & Co.\n\nT. N. CAMPBELL, Bookseller and Stationer.\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885100201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 6420, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4994, 1], [4994, 10030, 2], [10030, 17866, 3], [17866, 26355, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]