[{"id": "304e0d065007912d07f0bb11a286d48cd135d5e5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 31, 1885.\n$2.50 A YEAR.\n\nBANKINGHOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest Discounted on Deposits.\nDrafts Discounted available at all points in the Province.\nBankers—Merchant Bank of Canada\nBankers—Merchant Bank of Canada\n\nSTEPHEN BREWSTER.\nSolicitor of the Supreme Court of Justice\nof England.\nNOTARY PUBLIC.\nPrince Albert, N.W.T.\nFORRES & NEWLANDS.\nBarristers, Notaries Public.\nOffice—T. N. Campbell, Stationer.\nPrince Albert, N.W.T.\nF. F. FORRES & H. W. NEWLANDS.\nBarristers, Solicitors, Conveyancers\nPrince Albert\nW. GUNN, M.A.\nBarrister, Solicitor, Conveyancer\nPrince Albert\nDE A. STACKHOUSE.\nDENTIST.\nPRINCE ALBERT, N.W.T.\nNOTICE.\nNotice hereby given that the partnership existing between us, as at present constituted, is now by mutual consent ended, and the business will thereafter be conducted by Gilbert E. Carter.\nSigned\nGILBERT CARTER\nBARRISTER\nPRINCE ALBERT\nPlanning Mills and Sash and Door Factory\nCORN, BEET AND MACAROON FACTORY\nSash, Doors, Frames, Blinds, Moldings and Builders' Furnishings made on the shortest notice.\nA. GOODFELLOW.\nPrince Albert, N.W.T.\n\nMILK.\nTwelve Quarts for a Dollar.\nGood fresh milk will be delivered to any part of town, every day. Leave your orders at J. M. Campbell's store.\n\nWM BROWN\nEAST END BAKERY!\nBREAD unsually good by any west of Winnipeg.\n1 kind of Cakes and Pastry made to order.\n\nHUGH MCDougall\nEast End Bakery.\n\nROBERT THOMSON,\nSign & Ornamental Painter.\nCutting and Paperhang-\ning on short notice.\nDecorative Painting a Specialty.\n\nSTRAWED!\nStrayed on to my premises on Saturday, the 4th inst.\nTwo Sous and 1 Barrow Pig\nThe owner requested to pay damages and take them away, or they will be sold.\nWILLIAM SHIPMAN.\n\nNOTICE.\nAs we intend dissolving partnership, all parties indebted to us must settle their accounts in full date by July first, the 1st day of August, 1885; otherwise their accounts will be placed in court for collection.\n\nMARKLEY & CO.\nNOTICE.\nNotice is hereby given that any person or persons found cutting hay on the property of Spencer Estate, River Lot No. 31, of the special survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nO. E. HUGHES.\n\nCALEDONIA BREWERY\nEAST END.\nIn connection with the Brewery.\nThe Best Cigars always on hand.\n\nCHAS. WOODMAN\nPROPRIETOR.\n\nNEW YORK.\nNew York, July 20.—The health board started out from here today. This is the largest number reported for any day for 1885. Concerning the death of persons who died of consumption, there was a case today to determine whether either case under the prescribed figures. After examination, the case was dismissed.\n\nCANADIAN\nLUNDSTAD\nTuesday, September 1.\nFour Amur, July 20.—The most notable event of the evening was when a series of matches took place during this afternoon and evening. As each regiment arrived on the field, they were greeted by members of the opposing teams. The matches were played on the field, and the spectators watched eagerly as each team tried its best to win.\n\nGENERAL NEWS.\nNIAGARA FALLS, N.Y., July 20.—The body of Miss McIver, who was swept away while on the excursion to the International Falls, was found this afternoon wedged between two rocks at Swift Current, on the Canada side. All the clothes of the victim were identified by the coroner.\n\nGREAT BRITAIN.\nLondon, July 20.—A private telegram from Mr. Lord Aberdeen says that the Empress Willi has been engaged for London Station and several fitting runs. After arriving at Louis Island he received, however, no further news of his party.\n\nAt an Exeter Hall meeting, General Booth read a letter written by Miss Booth to him in reply to a letter written by the Duke of Wellington, which had been asked by the Queen. Booth acknowledged Miss Booth's letter.\n\nSASKATCHEWAN RIFLE CLUB\nEAST END.\nThe second target practice of this club will take place at the ranges on Saturday next, Aug. 1st.\nParties desiring to compete must enter their names at the ranges before 12 o'clock noon. After that time entries must be made with the Captain.\n\nMembers of the above club must be prepared to govern themselves by the following rules at all times:\n\n1. The entrance fee for this club shall be $1.00 per member, and who have already paid the same shall be exempt from payment for the ensuing year.\n2. Any member who fails to attend a competition without the club shall be fined $1.00.\n3. A series of prizes will be given on Saturday next to the winners.\n\nFiring will commence at 1 p.m. sharp.\n\nCHAS. WOODMAN\nSecretary.\n\nSASKATCHEWAN RIFLE ASSOCIATION.\nThe first meeting of the Association will take place on its rifle ground, Prince Albert, on Tuesday, September 1.\n\nPORT ARTHUR.\nFour Amur, July 20.—The most notable event of the evening was when a series of matches took place during this afternoon and evening. As each regiment arrived on the field, they were greeted by members of the opposing teams. The matches were played on the field, and the spectators watched eagerly as each team tried its best to win.\n\nS. BREWSTER.\n\nWANTED\nCHIT-CHAT LOCALS.\nGathered by our Reporters.\nWarner's Safe Cake at Clark's Drug Store.\nEight pounds of good sugar for $1 at Mr. Campbell's.\nEmerson College will open on Monday, August 2nd, at 6 a.m.\nMr. James Macintosh has donated a lot to be given by the Lorne Agricultural Society.\nMr. A. Evans, barkeep of Wengen, arrived down the river by ship from Fort Macleod.\nHe left by the mail for Winnipag.\n\nMr. Driscoll, agent of the Temperance Colonization Co. at Saskatoon, and party, arrived in town on Wednesday evening. They enjoyed their trip immensely.\n\nWe are given to understand that Mr. Driscoll, who was visiting his last base had been arrested and taken to Regina, was wanted as a witness at the trial being going on there at present.\n\nThere has been considerable excitement on the South beach between the landing at the Halton settlement and Swift Current, caused by the police.\n\nMr. Driscoll, who has offered the public of Prince Albert an opportunity of learning French language and of acquiring knowledge of it, has been called upon by many of our young citizens.\n\nMr. R. McLvor, of this place, received a letter from Mr. Driscoll, who has been working with a missionary to appear before Mr. J. J. Campbell, J.P., to answer the charge of having in his possession an instrument not without being properly registered. It was thought to determine whether either case under the prescribed figures. After examination, the case was dismissed.\n\nOn the morning following the police on the east side of our streets. Some natives were seen near the police, but nothing was heard.\n\nThe \"good Indians\" was one of those whom the police brought in from the east side. The police came to a house of considerable note to have it placed into a rope, became so excited over what had come through the walls inside, that they fell to fighting together, then the other end of the rope came over and locked itself down on their heads and necks.\n\nHis hands were lying loosely in front of his body. Dr. Bain held an impact on his head.\n\nMr. Driscoll, who has offered the public of Prince Albert an opportunity of learning French language and of acquiring knowledge of it, has been called upon by many of our young citizens.\n\nMr. Driscoll, who has offered the public of Prince Albert an opportunity of learning French language and of acquiring knowledge of it, has been called upon by many of our young citizens.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N. W. T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's—11 a.m.—Rev. E. Matheson.\n\nThe Mission Chapel.\n\nSt. John's—12:30 p.m.—Rev. J. F. Prichard.\n\nSt. James'—3 p.m.—Rev. Mr. P. Murray.\n\nSt. Paul's—3 p.m.—Rev. Mr. Murray.\n\nSt. Andrew's—3 p.m.—Rev. Mr. Murray.\n\nSt. Peter's—3 p.m.—Rev. Mr. Murray.\n\nFRIDAY, JULY 31, 1885.\n\nA REASONABLE VIEW.\n\nAs might be expected from that portion of the Dominion press which has so little self respect as to declare that a thing must be right because it is done by a particular Government, or merely because it is achieved by a very different motive, are gradually succeeding in seriously damaging the present Administration in the regard of all excepting themselves and all others. In their desire to shield the Government they are moving heaven and earth to demonstrate that the late miserable rebellion was due to the white settlers having been provoked by the Government into doing something. If proving this gross falsehood to be true, will they condescend to explain two things—how would it come that the people of the country, a majority of whom are natives and old country people who do not take the faintest interest in Dominion politics, excepting as they affect their Territory, and are naturally imbued with a love of peace, should have been worked upon by a handful of God agitators to the point of entertaining the idea of a rebellion in order to embarrass the Conservative Government, and furthermore, what of the demands in any way generally sympathized with it would have embarrassed the Government to grant? Should those anxious to establish this view succeed in their attempt by the time they have answered these questions we suspect the Government will pray to be delivered from their friends. Probably the position adopted by the press, which we believe to be the true one, will prove more meliorate and acceptable, and we may briefly restate it. Our contention is this, that the idea of a rebellion originated with Riel, who doubtless was encouraged by Fenians across the line; that Riel had been for long tampering with those of the Metis and Indians most likely to fall in with his views; that there was wide-spread discontent among the settlers generally, which resulted chiefly from circumstances beyond the control of any Government; and that the distance of Ontario from the scene of action prevented their understanding the necessity of at all costs hurrying on with certain matters which could only be overcome with great difficulty in a country the total population of which was so rapidly increasing, but yet from its immense size was only sparsely settled in any of its parts. That this district contained men who had taken up lands in the hope that, from information obtained from the Mackenzie River the rail would come this way, is an assertion as to as we know meaningless. We are unaware of any man to-day who has purchased lands here before the present route of the C. P. R. was settled. Prince Albert was originally chosen as a seat for missionary laborers, and had so many advantages that very prominent Red River settlement settlers, who had their own reasons for desiring a change, settled round the Mission. The settlement had a gradual and legitimate growth, increasing as the family names advanced in number, and while the settlers cherished the not extravagant hope that by this time railway communication would be very near, no disappointment was felt when the records were looked for so far from Manitoba. This is the sort of nonsense those wishing to account for widespread rebellious sentiment which did not exist are reduced to. The present route of the C. P. R. destroyed our local market to the north, the people felt indignant at having to pay for their wood and other things hauled to get them, under favorable circumstances is quite the most and only natural, especially when any appreciable number of them thought that the Government wasagitators or deceivers to embroil the Government because it was Conservative is utterly untrue. This discontent probably induced those of the Metis who were interested in a connection with Riel to take the time necessary for his introduction. At any rate the movement was suggested by Napoleon Nault, a notary and not by a white man. All sections of the population were affected by the effect of keeping the bulk of the white settlers and English half-breeds from giving any further publicity to their discontent. From this point onwards the situation was such as to confirm to the Metis to allow whites and English speaking half-breeds, the whole number of whom did not exceed a dozen. Of course new men were said to have joined them, but the real fact remains that none were incapable of the mental and restraint required to keep silent about these grievances when Riel had appeared upon the scene and although the Government stated that they allowed to be admitted to the rebellion, they did not co-operate actively with the movement. That the handiwork of reckless men referred to may have been the result and consequence of the extreme sentiment to the Metis is possible. If any proof of this can be adduced they should be punished. That the bulk of the settlers who exercised great patience and who indirectly encourage disloyalty, and refused their lives to put down the rebellion when it broke out, and incurred the hostility of the rebels before it was too late, should help to prevent in time to save their wives and children should now be made responsible for it is impossible. What real regard for the true interests of the Government can anyone say has been paid to people than to adapt this habit, and pursue a consequent policy? One can hardly refrain from suspecting this course for have for its object the desire to stir up another far more formidable rebellion within a year, and consequently overthrow the Government. If there be not treachery in this kind of friendship, there must instantly.\n\nOUR SIOUX.\n\nTime goes on, and yet there is nothing done about the Sioux, who after having been supported for years past by this settlement, were the first to join against us at Batoche. We again hear reports of a poll. The Sioux. Indeed here are those and the children of those who mercilessly massacred the Minnesota settlers, and in addition to butcher- ing men, women and children, even committed atrocities perpetrated even found as outrage and torture upon their victims, that their diabolical invention could suggest. These settlers, so far from having injured them, had been treated with every kindness in spite of which they had in this horrible manner to exonerate some grievance inflicted on the savages by the Government or its contractors. Having succeeded by their carelessness in getting the soldiers sent to punish them, they consulted their safety by crossing the line and obtained an asylum very little deserved. While a number of them, their families and friends, went to the States a portion of them who felt that they had been guilty of such atrocities as would not make it safe for them to return under any circumstances, came here. This last time some number of settlers found them assuming as threatening a tone that they had to apply to the Government for an accommodation. After repeated representations, the Government gave such of them as choose to accept it a reserve and the means to start at farming. A considerable number, however, were allowed to follow their friends and relatives abroad. Times have as a rule been hard, and when many a settler proudly bore the most severe priva- tions, the Sioux invited himself to share the sufferings of those settlers who had sacrificed themselves to feed his family. As a return when the rebellion broke out he refused to accostations and to remain neutral, but hurried off to join the rebels. This was done not by those here and on the reserve. They very hostages who had been pampered here could hardly be restrained by the Metis from massacring our settlers who were defenseless. It is a horrible fall from high places about their having been compelled to join, but no word to justify the assertion. A good deal is made by some people, that the Indians are showing a fine Christian philanthropy in forgetting these devils, to the danger of the lives of innocent settlers, of some having remained quietly across the river. Certainly the sickness of a few families sometimes will call an excellent excuse for keeping a close watch upon our garrison and carrying all the news to Batoche. While some of these treacherous ruffians are endeavoring to create an uproar, others who see how treacherous most prominent at Batoche and are afraid of being identified by the prisoners are hidden about, living upon what is offered to them from the settlers by the traders. We believe that their removal is a matter for the Indian Department. Be that as it may, the sooner they are attended to the better. We would object to the settlers at Batoche being left under a shadow until the stretchers are about. Although so far keeping out of sight, there is ample evidence of their presence, and so soon as they find no arms for remains there here there will be trouble. The more we hear of the Sioux the less we shall deal with them, but we hesitate to advise what will form a dangerous precedent.\n\nIn an article of last issue met dis- arming settlers, in a sentence comparing the loyalty of the whites and half-breeds, we said that the former should have read than a mean of them.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and to sell a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction wade.\n\nTHOS. POWERS, STEWART\n\nBROS., TRADERS,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS and GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Peas.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nNOTICE.\n\nAll parties indebted to us must be settled before the 1st August next, owing to an intended change in the business.\n\nSTEWART BROS.\nWELCOME TO OUR VOLUNTEERS.\n\nTeemer's Regatta.\n\nGenuine Imported Havana Cigars.\n\nALEX. LANG\n\nGENERAL BLACKSMITH.\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nSHANNON & McLEOD\n\nFRIDAY, JULY 31, 1886.\nTHE REBELLION.\n\n(Continued from our last.)\n\nOn the morning of Friday, the 25th, the day following the Col. Irvin assembly of his officers, he determined to abandon the fort under the threat of extermination by the enemy who were invading the valley. Accordingly, he ordered the evacuation of the fort. The order was immediately obeyed by Capt. Veatch with his men and T. N. Campbell as subalterns.\n\nThe expression of the opinion that the whole force should abandon Carson and move to Prince Albert, the only place which could offer temporary shelter, was raised by Major Geer, who ad-\n\nmitted, however, that that was not of much practical importance in view of the general advantages of the pro-\n\nposal. The officers of the preceding day had been so intent upon the success of the operation that one which would have been put down by force of arms and the vote of the majority might have been uncertain. All that was certainly known at the time was that the half-breeds had no hearts to fight for their homes and that there was no prospect that there were Indians cooperating with them. The extent to which the inco-\n\nherence might have extended among the bands of Indians which surrounded Prince Albert could not be even guessed at, and while there was really very little to be gained by holding out, the force required for that purpose was urgently needed to protect the settlement and defend it against all the incursions of the surrounding district, where were collected all the stores that dis-\n\ntributed from the fort to every important point in the disturbed part of the country. The determination there-\n\nfore was made to hold out at all costs. Prince Albert was unexpectedly a civic one, nor would the volunteers have con-\n\nceived that they could be defeated or felt in any way by the property of the town. This determination as-\n\nserted, measures were taken to carry out the plan which had been laid out; the day preparations were made to carry off as many as possible of what stores and provisions there were, and the enemy should fall into their hands. The question of defending the post on\n\nthe morning of Friday, the 25th, was an idea abandoned, but the noise of the explosion caused by blowing it up, or setting fire to it, should attract the attention of the enemy and bring on attack under terrific disadvantages. In that case, in the course of the day, the store of stuff for Indian trading was concealed away off at a distance, in case of what should happen to the building which was a post at the time the Indians came in. As night set in, the scene in the courtyard of the fort was a busy one. A noise which seemed to an-\n\nchor order reigned in reality, and all that was being looked on, along with the building, was being moved and prepared for the duty to be performed, and the leaders of the movement—Arrows, who had been killed in the battle on the 19th, before, which had passed through his heart, and Arnold and Garret, who seriously believed, one in the early morning and the other in the noon—were considered to their last de-\n\nfending places. The necessity which ar-\n\nrived in the form of a gale of wind, some twenty yards of smoke from the fire, which was often supposed to be a wood stove, gave occasion to the German, who had probably been engaged in his work, to say that the enemy would be able to see him and to see by the light of the fire. However, the enemy did not come, and the smoke continued to rise until the morning. The enemy did not come, and the smoke continued to rise until the morning.\n\nBuffalo Hall! SUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the selection of the necessary Department.\n\nAn Elegant Assortment of Carneval, French Creams and other Mixed Goods, Kuts and Raisins, together with Fresh Biscuits in Sodas, Fruit, Taffy Fingers, Lemon Creams and Iced Sultanas.\n\nMake a choice addition to our well assorted line of GENERAL GROCERIES.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. Hughes & Co., General Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising Morton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also one car load Ogilvie's Flour, Which we will sell cheap for cash.\n\nO. E. Hughes & Co.\n\nT. N. Campbell, Bookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nJUST RECEIVED\n\nJ. M. Campbell\n\nAT THE\n\nHORSE SHOE STORE\n\nA LARGE STOCK OF\n\nHats, Summer Suits, Prints and Dress Goods\n\nALSO A SUPPLY OF FRESH GROCERIES\n\nT. O. Davis J. M. Campbell.\n\nROYAL BAKING POWDER Absolutely Pure.\n\nThis Post Office Registration. A proof of strength and wholesome quality. One pound is sufficient for any purpose. Sold only in one place.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885073101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5522, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 7516, 1], [7516, 17955, 2], [17955, 18450, 3], [18450, 23582, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]