[{"id": "815ed32b628fc14c4bc78777939ccdb4fd792a1b", "text": "Card of Thanks.\n\nTo the Citizens of Prince Albert:\n\nGentlemen,—\n\nI beg to tender you my sincere thanks for your energetic efforts to save my mill and adjoining property, and in removing flour, etc., etc., during the fire.\n\nYou I shall faithfully ever remember.\n\nTHOS. MCKAY,\n\nPrince Albert, June 8th.\n\nBankruptcy Stocks for CASH.\n\nSend for prices. No trouble quoting prices. Parties making large purchases to sell again will receive special prices.\n\nFirst Carts—First Arrival from Troy.\n\nA Full Inventory of Hats and Caps.\n\nDavis and Co.,\nWholesale Lumber Dealers,\nHead Office—620 Main Street, Yarndale.\nFront Street, on C. P. R. Side.\n\nChester Thompson,\nGeneral Blacksmith,\n13 West End, next to the Hudson’s Bay Store.\n\nMoffatt & Caldwell, Bankrupts,\nMain Street, Winnipeg, Manitoba.\nOffers Renewed.\nExchange Notes Cancelled.\nCash Advances Obtainable.\nNo Discount.\nConsolidation of Debts and Loans Negotiated.\nBusiness Continues.\nLegalDeposit Rates.\n\nRepeating Farm Machinery a Specialty.\nMPPSON'S ESTATE OFFICE.\n\nMoran and Jefferies, Solicitors.\nRoughwood, Thompson, Macdonald, Lawyers.\n\nAuction sale.\n\nWill be held by auction at Treston Hall, on Monday evening, June 16th, at 7 p.m.\n\nA lot of valuable furniture consisting of dining-room, table and chairs, bed-room bureau complete with curtains, piano-half, 10'x12', carpeting, table clothes, chairs, piano удобное общение. Also a 6-foot chest of drawers, a washstand, four upholstered chairs, two sideboards, two dining-room chairs, one mahogany dining-room table, one lamp stand, one display case, one wardrobe, some books, prints, pictures, mouldings, three spring mattress boxes, etc. Also a 4-way Windsor chair, queen-size diamond-shaped bed, etc.\n\nSt. Anne's Convent.\n\nThe Right Reverend Dr. Sherrard, Bishop of St. Albert, arrived here from Sunday morning services. His Lordship expressed himself as highly pleased by all of his excellent work which he has done, especially by his Catholic brothers, who are working most zealously. With his Lordship conversing with him today. The Lordship surprised him by conferring the position of Sub-Prefect of the Temporal Affairs upon the Bishop of San Jose. Mr. Campbell thought the possible acquisition of this position might give him more work as Omdegrag.\nPRONATUM EST.\n\nIt seems but a few days since we had to report the dismal tidings of the total destruction by fire of the Hudson's Bay Company's grist mill, involving the loss of an enormous sum of money and the loss of several settlers, indirectly at any rate, the pockets of the settlers generally. In another place will be found an account of the wreck of a similar agency, which was also a Hudson's Bay mill in the Settlement. Sad as it was to see the destruction of the mill which went first, yet there were some considerations which tended far to mitigate the force of the calamity—e.g., the fact that the loss upon a rich company would be much less felt, and the consideration that there yet remained Mr. T. McKay's mill to do the work which was so essential to our prosperity if not existence. If any man by strict integrity, by enterprise, by public spiritedness, and the possession of an untiring energy, indefatigable and unassuming disposition, deserves the sympathy of the sincere sympathizer of a community, Mr. T. McKay must assuredly have ours now. All that can be done now is to make the best of a bad job, and to do what possible from the outset to prevent a recurrence of such a calamity in the future. Of course the owners of mills or factories, manufacturers, or any manufacturing concern, are not responsible as a rule for the lack of precaution against fire, but we hope that no mill will ever again be left in Prince Albert, without a night watchman, and provided with proper apparatus for extinguishing fire in its incipient stage. We raise our voice once more in appeal to every rational inhabitant of our town to turn their eyes toward the safety of the whole place, and to take measures for the preservation or destruction of the whole place. We have examined all hypotheses in trying to account for the diabolical carelessness and indifference which has continued to sadly complicate the result of a fire, certain to occur sooner or later at the Mission. Much might be instanced to condemn the supposition that there are too many of the inhabitants who would view the destruction of their all with a philosophical smile, saying what will be will be. Associations with our people are made with the idea that this reckless indifference can be resolved into excess of religious sentiment, and dependence for protection upon Divine protection, as even more dangerous than the absence of such a thing as can claim to be believed that God helps those who help themselves.\" What as it then that we are waiting for in the way of warning? One thing only is wanted in this case, and we have already had to make them see the necessity of that is the loss of life. To what extent that might easily be sacrificed, were a fire to start in the Mission during a high wind at night, in such a terribly exposed situation. We may ask is there anything peculiarly favorable in our circumstances to justify the expectation of immunity from the fire itself? Just glance at the Mission with all the inflammable material lying about to connect fire with houses not actually joined. Cast your mind over the dangers of fire caused possibly by an incendiary act of the ginger-hunter, or by sparks from prairie fires, only some of many possibly contingencies, and then say whether without awaiting the tardy consummation of incorporation, is it not an obvious duty of every individual man here to exert himself to secure protection against fire. The cost of a small engine or a fire escape, and in the absence of police, a reliable man to patrol streets night, divided amongst those interested, would be as nothing to what must sooner or later fall upon them, if things are allowed to go on as they are at present.\n\nTHE DYNAMITERS.\n\nJohn Daley, alias Denman, James Francis Egan and Wm. Macdonald, were committed for trial in England, charged with felony, and as a protest, an awakened settler states that the Irishmen have it, they are blowing up public buildings in the city of London. How this mischievous movement came to be productive of any good to Ireland or its inhabitants, only a crank can imagine. Its effect on the English people will make them turn the poor out of lodges and baggage. It is not the English who are to blame, but the Irishmen, because they are enemies, and Irishmen do not allow anyone to comprehend them. They are jealous and suspicious, hating Englishmen who do not share any credit to be had by them, and any good. They look too much back on the past, are always utopians in idea, are humorously gloomy and reckless; they have sight of contrasts. They are a people who have no taste for beauty or grace of surroundings, and will live in more rather than take trouble on behalf of external refinement, yet who exhibit, in their lives, a fine and noble ideal, logic, and inherent susceptibility to grand ideas. They are capitalists in the present time who will not employ an Irishman, on any grounds whatever, excepting perhaps as domestics, to tend them thereupon, will under no circumstances tolerate them out of the country. Thus the good must suffer for the bad, for it cannot be denied that a true Irishman is a better capitalist than a Jew, as there is no tendency to form a race as there is to the former. That the law will get its clutches on these perpetrators, spoliars of innocent blood, is the wish of Europe and the whole civilized world, and it is to be sincerely hoped the punishment will be of the severest kind.\n\nENGLISH NOBILITY.\n\nThe House of Lords will in an article entitled \"The Shallow Pomp of Society,\" which refers in particular to the nobility, cannot fail to strike the mind of a colonial very forcibly. It is not uncommonly said, \"Indications are good.\" In reading this I had the impression of one of the great dramas that, small as the community was, there where about fifty distinct gradations of rank, each about half an inch higher than the other, but that these infinitesimal differences were sacred in the eyes of the inhabitants. It is this preposterous estimate of the value of their own half an inch that produces so much pride, that produces so much contempt, that produces so much indignation, that produces so much anger, death itself, would in their estimation, be preferable to descending half an inch on the social scale, even though the descent might place them in comparative affluence.\"\n\nThe works as set make a total of 648 for the present year, against 516 in the corresponding period of 1883.\n\nTHE WEEK.\n\nA new four page weekly journal of news, politics and criticism. Edited by Charles M. Smith. Published every Thursday at five cents per copy. Will appeal by its comprehensiveness of contents to the cultivated reader, and will enter into the circle of a cultured home, and will entertain and amuse by its satirizing the intellectual, moral and political movements of the day. Mr. Charles M. Smith will be assisted by Mr. J. M. Scott, late author of \"An Ambitious Woman,\" and Mr. J. M. Scott, late editor of The Week named of New York society, and Mr. J. M. Scott, late principal of Queen's University will write, among other valuable papers, a series of articles on the university. During the past summer, \"Down the Kicking Horse River,\" was published by Mr. Smith, contributions in prose and verse from many prominent writers. Art, music and the drama will receive special attention. Advertising will find a large and agreeable medium through which to reach the educated classes. Orders for terms and other particulars apply to C. Blackett Rossiter Publishers, 200 Main Street, Prince Albert, Sask.\n\nTHOS. POWERS,\n\nTo be prepared to take\n\nCONTRACTS\n\nfrom\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nBrick and Lime always on hand.\n\nNathaniel Acorn,\n\nPrince Albert.\nCHIT-CHAT LOCALS.\n\nGathered by our reporter.\n\nThe river is still steadily rising.\n\nMr. Gen. Mills left for the East last Saturday on a visit.\n\nMr. T. O. Davis and Mrs. Davis left for the East last Wednesday morning.\n\nCapt. Moore left for Troy last Wednesday day to meet his brother.\n\nThe Rev. John McKay arrived in town last Tuesday evening.\n\nThe post and telegraph station will be closed along shortly.\n\nA stable and two calves were buried last Monday, belonging to Mr. White.\n\nBlack Friday's market conditions were terribly aggravating yesterday and today.\n\nMr. Gerlach and party left for Maclean earlier last Wednesday morning on a week end trip.\n\nThe members of the Council of the N.W.T. are summoned to meet at legislative session on Monday next, July 2nd.\n\nMr. J. M. Clark, Mr. W. H. Clark, Mr. H. Clark of this city, were awarded the first scholarship at the First Intermediate examination of the Law School of Algoma Hall, Toronto, for their proficiency in connection with the junior classes.\n\nThe Lieut.-Governor has made the following appointments: Mr. J. M. Clark, South Beach; Joseph Nolan, North Bay; Mr. J. M. Clark, North Bay; Mr. W. F. Moore, Esq., Carrot River; Mr. J. M. Clark, North Bay; Capt. Wm. Davis, Antigonish; Mr. N. Macdonald, Esq., Bathfield, to be Justices of the Peace.\n\nThe N.W.T. Transportation Company's steamer \"Winnipeg\" under command of Capt. Sheats, arrived here from Cumberland on Wednesday evening with goods for the market. The steamer commander of the fleet, was aboard. She left for Carlton yesterday morning and arrived back this afternoon.\n\nIn fact, this place was married to Miss Macpherson of Morley, on Wednesday evening last, at St. Mary's Church. The bride received many handsome presents from her friends. The wedding cake, which was of excellent quality, was cut by Mr. R. Hill, confectioner, Prince Albert.\n\nA correspondent wishes to know if there is more than one religious denomination that believe in the doctrine of predestination? If so, what is the name of the sect? I am told that there is. In answer to the same, a camel will not pass through the eye of a needle.\n\nWe have heard, however, who will drink for seven or eight days without working.\n\nThe P.A. Lacrosse Club challenge the club at Edmundston, New Brunswick, to a match on July 1st, to play for the championship of the North West. The match is expected to be played but would attempt to raise funds to pay the expenses of the P.A. club to Edmundston, who, we understand, would be happy to play a match with them.\n\nOn Wednesday evening last, Mr. C. Burns, an employee of the L.M. Co., on his way home from Prince Albert, met the arrival of the steamer North West, met with a painful accident. The man, while walking along the deck of the steamer Titan boat, fell heavily against Mr. Burns and fracturing one of his legs. Mr. Burns was taken to hospital at least the afternoon, and reports that only the small bone near the ankle is fractured.\n\nThe Presbyterian Board says that the P.E. is proving a help to the mission Fort Macleod and Battleford are carrying a number of Presbyterians. Among the most prominent are the Rev. Mr. Douglas, having \"unearthed\" 120 Presbyterian families. The people of the district during the past year is said to be a miserable failure, for only few succeeded, none being able who had never been engaged before. The weather has been extremely smooth, which must have been a terrible trial to the poor listeners.\n\nMr. Pringle Alliston says that the congregation in the locality of St. Elizabeth's has a second College, is preparing the American missionary establishment of a high school for young people with good hearts. They want a school for the Mission Indians. We suppose this is a school of scholars, a high school, and such a school is needed in the district. The children are brothers here in cultivated among men, striving to the same end, whereas the same boys would be sent to the academy will cry aloud, \"Lord, I thank thee.\"\n\nTHE OLD OAKEN BUCKET.\n\nSet to Prince Albert Measure.\n\nHow dear to my heart are the scenes of yore,\n\nWhen love and recollection recalls them to view;\n\nThe fling, the prancing, the cooing and the bow;\n\nAnd every loved spot that my pre-emp-\n\ntions knew.\n\nThe old oaken bucket plain, and the\n\n\"butte\" that stood by it,\n\nThe creek and the hillside in sunshine\n\nThe \"shack\" of my neighbor, the sod\n\nstable high it.\n\nAnd the old oaken shanty that stood on\n\nthe plains.\n\nThe little old shanty, the sod-covered shanty,\n\nThe tar-papered shanty that stood on the plains.\n\nThe little old shanty I hailed as a treasure,\n\nAn overgrown furrow I wearily trod;\n\nI found it at noon time an exquisite repose,\n\nTo rest in its shadow from turning the hoe.\n\nHow eager I hastened to gain its rude door,\n\nWhen the shadows of evening fell thick on the plain;\n\nNot a corner nook could be found the\n\nlittle old shanty that stood on the plain.\n\nThe little old shanty, the sod-covered shanty,\n\nThe tar-papered shanty that stood on the plains.\n\nHow sweet in that little old shanty to sleep,\n\nWhile the fierce howling winds swept wild over the plains;\n\nOf all the equipments Prince Albert can boast,\n\nThere's none more equal shacking on a pre-\n\ncious claim.\n\nBut not far removed from that loved situation,\n\nAnd the friend whom I never may see again,\n\nFood memory reverts to my Prince Al-\n\nbert location.\n\nAnd again the shanty that stood on the plains.\n\nThe little old shanty, the sod-covered shanty,\n\nThe tar-papered shanty that stood on the plains.\n\nDRESS AND FASHION.\n\nBY PUCK.\n\nPompadeurs, grease and waiteau de\n\neau, are to be the rage this summer, and the ladies will be seen in a new and small pattern of fashionable colors not excelled in loveliness by the stoutest and most expensive silks. Some of the prettiest summer dresses will be made with skirts of solid silk and paniers and puff of linen, with tiny little red or blue figures on a delicate or charming haber-\n\ndache color.\n\nAll kinds of patterns are fashionable for tea gowns made of embroidered crepe de chine, and the dress is made to match. Light colored muslin skirts are made in this way, and when the dress is made with lace it gives them a fine soft look.\n\nPelicans of every kind are to be fashionable, but especially those worn by young ladies. They are made of embroidery made of embossed velvet and trimmed with chenille fringe. For a stout lady gathered at the waist, or square ends falling on the front of the dress, in effect, the pelican is made of embroidery with lace and jet, the trimming reaching down to the ground. The dress is ornamented with jet, with pendants.\n\nSome of the new patterns are exquisite in their simplicity, and the ladies who wear them are. They are made of silk with embroidery in the shape of a lambrequin, one side of the pelican is made of embroidery of a small powder box fitted with tiny squares and daggers in emerald or carnel-\n\nlian on a very slender stick.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING & SUMMER MILLINERY,\n\nAND FANCY GOODS,\n\nAT MISS MACK & CO,\n\nCAMPBELL'S BLOCK,\n\nNEW GOODS AT MEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, SPICES, FANCY GOODS, consisting of:\n\nAtkinson's, Dolgate's, Lubin's and Lundberg's Perfumery, Pear's and Colgate's Fancy Soaps Hair Brushes, including Scott's Electric and Infants', Celluloid, Horn and Rubber Combs Gonnell's Tooth Brushes, Tooth Picks, Breast Pumps, Feeding Bottles, Eno's Fruit Salts, etc., etc.\n\nTHIRD CLASS\n\nT. E. JACKSON,\n\nAT THE OLD STAND,\n\nNew Spring Goods.\n\nJUST ARRIVED AT\n\nJ. M. CAMPBELL'S,\n\nA Fall and Well Selected Stock of\n\nDry Goods\n\nAND\n\nGroceries\n\nStoves, Ploughs, etc.\n\nALSO\n\nPhotographs\n\nChas. E. Page.\n\nNEW STUDIO\n\nEAST END.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter,\n\nCalicoising and Paperhang-\n\ning on short notice.\n\nDecorative Painting a Specialty.\n\nWM. R. BELL.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nOver 16 feet extra.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nST. P. M. & M. RAILWAY.\n\nMARKLEY & CO'.\n\nTime Table.\n\nGENERAL MERCHANTS.\n\nPrince Albert, - Sask.\n\nPRINCE ALBERT\n\nPlaning Mills and\n\nSash and Door Factory\n\nGOODFELLOW BROS. - PROP'S.\n\nPrince Albert, N.W.T.\n\nNOTICE.\n\nI hereby intimate that all my groceries are now closed, and all parties indebted to me are requested to settle their accounts immediately, if not credit will be added.\n\nN.B. On and after this date I will keep no book accounts. Terms strictly cash.\n\nWM. GORDON\n\nPatents April 19th, 1884.\nPUBLIC MEETING.\n\nA meeting was held last night at the Western School House, at which Mr. Peter Atkins was elected chairman, and Mr. J. Clarke was appointed secretary. The meeting was called to order by Mr. Atkins, who stated that the object of the meeting was to consider the question of establishing a telegraph office in Prince Albert. Mr. Atkins then read a letter from Mr. Clarke, who had written to him expressing his desire to see a telegraph office established in Prince Albert. Mr. Atkins then moved that a committee be appointed to consider the question of establishing a telegraph office in Prince Albert. The motion was seconded by Mr. Clarke, and carried unanimously. The meeting then adjourned until further notice.\n\nDEAD BABY.\n\nThe baby is dead, but its mother's dreams will come true with a radiant smile. As she says in a whisper, \"No fingers shall touch my baby but mine.\" To me is a labor of love, I'll dress it in white like the angels That wait for my darling above. Oh! how I wish my dreams In the midst of a world of delight For a beautiful angel in heaven Is calling me \"mother\" to delight To see my baby in the cradle The path that I have trod, To watch its welcoming baby For of such is the Kingdom of God.\n\nHow to Make Candy.\n\nThis book gives full directions for making all kinds of candy, including chocolate drops, fudge, marshmallow, and other confections. It also contains recipes for making candy apples, caramel apples, and other treats. The book is a great resource for anyone interested in making their own candy.\n\nBUFFALO HALL!\n\nParties concerned will please take notice that overdue accounts on our books have been closed, and will now be placed in the hands of our solicitors for collection.\n\nFrom this date we propose devoting our attention to prompt-paying and cash customers, and will be prepared to offer them reliable goods at prices in keeping with the times.\n\nROYAL BAKING POWDER.\n\nAbsolutely Pure.\n\nThe Powder never varies. A marvel of uniformity and purity. Our Powder cannot be sold in competition with the most famous brands. We make no substitute powders. Sold only in cases.\n\nPUMPS!!\n\nHand and always on hand at greatly reduced prices.\n\nWaggons, Boats, Barrows and Slingers repaired with promptness and dispatch.\n\nWILLIAM CROSS.\n\nOwner-Custodian's Blacksmith Shop.\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT - N.W.T.\n\nBOOTS AND SHOES C. D. NORTHGRAVES,\n\nCHEAP.\n\nWatchmaker and Jeweller.\n\nROYAL ROUTE.\n\nJ. H. HIGHLAND, Joint Traffic Manager.\n\nJ. P. TEAGALL, Joint Passenger Agent.\n\nAsh & Robbins,\n\n36 Fulton St., Brooklyn, N.Y.\n\nSHANNON & McLEOD\n\nRepairing Promptly attended to.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884061301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 5189, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2261, 1], [2261, 10054, 2], [10054, 18935, 3], [18935, 21792, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]