[{"id": "e62754796e0a7bed4f7c76d3f61e5bca407fb223", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETTY\nAT PRINCE ALBERT N.W.T.\nTerms—Subscriptions in advance\n$1.00 per year; single copies 5 cents each.\nAdvertising rates on application.\nNo contracts made under three months' notice.\nAll advertisements will be inserted until paid for, except personal.\nJ. D. MAVETTY, Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Albert's Anglican Church—11 a.m.—Rev. Canon F. J. Potts—3 p.m.—Rev. Canon Flint\nSt. Paul's—3 p.m.—Rev. Dr. MacKay\nSt. John's—3 p.m.—Rev. Dr. MacKay\nSt. Andrew's—3 p.m.—Rev. Dr. MacKay\nSt. Mark's—3 p.m.—Rev. Dr. MacKay\nMethodist Church—Hill Street—11 a.m.—Rev. Mr. Johnson\nMethodist Church—West Hill Street—11 a.m.—Rev. Mr. Johnson\nMethodist Church—East Hill Street—11 a.m.—Rev. Mr. Johnson\nMethodist Church—East Hill Street—2 p.m.—Rev. Mr. Johnson\nMethodist Church—East Hill Street—7 p.m.—Rev. Mr. Johnson\n\nFRIDAY, NOV. 30, 1888.\n\nTHE ASSEMBLY.\n\nIn the published reports of the proceedings of the Legislative Assembly it is stated that a motion was adopted asking the Standing Committee to consider the advisability of establishing a code of procedure for collecting small debts at a reasonable cost, and to report to the House as early as possible. We hear nothing of the report of Tweed and Davidson, the mover and seconder of the resolution referred to, and we express the hope that very beneficial legislation will be the result. We have pointed out before that Mr. Corley, it seems, as much to collect $5 as $500 as the law now stands. There should be some means whereby small debts could be collected at a trifling expense. This is not a reason why some summary procedure, such as a magistrate's court, should not be adopted, whereby people would be spared the necessity of going through all the trouble and expensive process of the Supreme Court. At present to obtain judgment for $5, even where a lawyer is not employed, costs at least $5, while the costs on a $100 debt are only $10. These costs are very much higher when the claim is contested, and if an advocate is employed and the claim contested they range from $15 to $30, and often very much higher.\n\nMr. Betts, of the Assembly, has moved for a memorial to the Dominion Government, asking that immediate action be taken in the matter of railway extension to the valley of the Saskatchewan. We have seen no part of the proposed memorial, but are therefore not in a position to say much about it. But we object to the words, \"Valley of the Saskatchewan.\" Mr. Betts has said that it is indefinite. We want a railway to Prince Albert, Saskatoon and Cumberland are each on the valley of the Saskatchewan, but a railway to either of those points would not benefit us much. We have full confidence that Mr. Betts will see to the proper wording of the memorial.\n\nWhile the Assembly at Regina is tinkering at and amending the various Ordinances of the North-West Council, we would like to see one very important amendment made in the Municipal Ordinance. As it is now Educational and Religious institutions of certain kinds are allowed to hold property to an extent, in the latter case unlimited, free from taxation. This we consider is wrong and should be done away with; all exemptions should be abolished; there are now in this Municipality several churches and two incorporated seminaries each of which may, by holding land, and thus create an unlimited liability, free from taxation whenever it is used for educational purposes or not. We contend that if a college or other institution of any kind chooses to own 100 acres or any greater quantity of land, it should be taxed for it. Municipal councils have power to remit any taxes they think fit and we think that the council of this Municipality should deal with it. If the council of a municipality thinks that any land or other property should be taxed then they should have the power of excluding it, but it is an outrage on the public for the Legislature to say that certain religious institutions shall have half the land in the municipality free from taxes for all time to come; such creatures of the Roman Catholic evil in the older provinces and they should not be allowed here.\n\nThresholding will soon be completed in this district when we will be in a position to give the farmers the information for the year from what we can learn at present the yields appear to be as large as ever. There is no doubt that there is very little poor grain in the district; there has not been as much jirds this fall as usual. Taken altogether the crops this year have been good, and it has been a good season for farming. Wheat is well adapted for farming.\n\nGO TO AGNEW'S FOR Stoves Stoves Heating Drums Stovepipe Coal Oil T.J. AGNEW W.STOBART & CO.\n\nIndian Traders AND General Merchants\n\nPrince Albert and Duck Lake\n\nSASK. FOR THE Best Assorted Stock of CONFECTIONERY GO TO H. M'DOUGALL'S BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL\n\nDUNN'S BAKING POWDER THE BOOK'S BEST FRIEND\n\nCAMPBELL'S TONIC ELIXIR\n\nCampbell's Cathartic Compound (Eau-de-Cologne)\n\nCures Chronic Constipation, Catarrh, and all Complaints\n\nPrice 25 Cents each.\n\nDAVIS & LAWRENCE CO., Limited.\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed uiting,\n\nTrowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nR. C. WIGMORE & CO.\n\nHave removed to their new premises,\n\nSECOND DOOR EAST OF OLD STAND\n\nWhere they will be pleased to meet their numerous new and old customers.\n\nClearing Sale still going on.\n\nR. C. WIGMORE & CO.\n\n1879.\n\nBuffalo Hall!\n\nMixing Room for Winter Stock new on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the talorce of our Dry Goods and Clothing\n\nNow in stock will be sold\n\nFOR TWO WEEKS ONLY\n\nAT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne\n\nT. N. Campbell\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed uiting,\n\nTrowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nNORTHWEST ASSEMBLY.\n\nEDMONTON, NOV. 13.—The Speaker took the chair at the usual hour and the clock struck two precisely. Mr. Tariff presented a memorial from the Northwest Provincial Council, and moved that it be received. Carried.\n\nCayley moved the adoption of the report, and also moved the House into committee on the subject. The motion was carried by the unanimous consent of the members present. Cayley introduced a bill for the protection of persons engaged in the construction of the Canadian Pacific Railway. The bill was read a first reading, second reading to follow tomorrow. The House then adjourned.\n\nEDMONTON, NOV. 14.—After the reading of the journal, Mr. Cayley moved a resolution from settlers in township 14, range 25, praying for certain road improvements. The motion was carried. It was moved that the petition be referred to the Advisory Board. Carried.\n\nBettie moved that the House adjourn for the day. Tweed moved, seconded by David Ross, that the Civil Justice Committee be requested to consider the advisability of establishing a scale of compensation for both large and small debts at a reasonable rate and as early as possible.\n\nCayley moved that the House in its country desire was that there should, if possible, be established a quicker mode of collection of debts than at present. As matters now stand it would be impossible to collect a $25 account in $25. What we require is more from the fees of the courts. The motion was carried.\n\nEDMONTON, NOV. 15.—The Speaker laid on the table the following returns: Copies of correspondence between the Council respecting municipal and county matters passed during the last session of the Northwest Council; copies of letters from Governor General for half breed claims and the ballot system, payment of pre-emptive rights, homesteads, liquor system, reduction of regulations, system of legislation, and division of the Territorial Districts.\n\nBettie gave notice that he will on Friday move that the Dominion Government be requested to take immediate action on the matter of the Indians in the valley of the Saskatchewan.\n\nClinkskill gives notice of a motion to be made by him for compensation to loyal half breeds for losses occasioned by the rebellion, and asking an investigation by a judge of the supreme court of Saskatchewan district.\n\nEDMONTON, NOV. 16.—After the reading of the journals to-day several petitions were received.\n\nBettie, in proposing his resolution regarding French railways, reminded us that last year the half breed claims were raised one hundred and twenty thousand pounds of grain. Last year they raised only sixty thousand, not because of a bad season but because there was no market. He said there was a promising acreage that way should be extended to the half breeds. He asked that an address be presented to the Dominion Government asking for the extension. (A branch meeting of the half breed country.) Oliver supported the motion.\n\nBettie said he wished to add to the motion that the same be transmitted to the Dominion Government.\n\nCayley moved the reference of the subject to a committee.\n\nBettie accepted the committee.\n\nClinkskill in moving a resolution regarding the half breed claims of citizens for made a lengthy speech, referred to his motion and referred to those half breed claims, the peculiar situation and sufferings during the war. He stated how they had lost all their stock and been taken prisoners by the Indians. They were treated partly as rebels. In support of his motion he read a letter from his son in which he asked them to come and take Battleford. He moved that an address be presented to the half breed claimants of citizens for compensation to loyal half breeds for losses sustained, great hardship has been caused thereby and that an investigation be made thereof by a judge of the supreme court of Saskatchewan district, who should be empowered to grant such compensation to such half breed claims may be found justly entitled thereto.\n\nCayley—would move that the matter be referred to a committee consisting of Clinkskill, Sanderson, Berry, Oliver and Mitchell.\n\nAt 17 o'clock the House adjourned.\n\nEDMONTON, NOV. 17.—After reading the parliamentary reports for the different committees the House proceeded to adopt.\n\nCayley’s sitting was very short; and a good deal of the time was taken up by Clinkskill with his half breed compensation bills.\n\nChapter 27, regarding hawkers and peddlers, was considered. Considerable discussion was had regarding the various amendments made, some of which is incorporated in townships and municipalities, and others he stated in the municipality amendment was carried after considerable discussion.\n\nChapter 38 was the next considered. Cayley moved to introduce a similar amendment regarding the provisions of the amendment was lost. The chapter was then adopted.\n\nThe House then adjourned.\n\nONE MORE Great Clearing Sale.\n\nNext to the usual November’s\n\nAnd Hypophosphites.\n\nAlmost as Palatable as Milk.\n\nSo dispensed that the most delicate stomach can digest it.\n\nPROFITS. Return 60¢ per cent.\n\nSCOTT’S EMULSION OF PURE COD LIVER OIL.\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP.G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nANNEXATION.\n\nThe banquet to the Hon. J. H. Pope, Minister of Railways and Canals, was a magnificent affair. The Hon. Mr. John Macdonald delivered an eloquent reception. In the course of Sir John's speech he spoke in the highest terms of Mr. Pope, and then turned to the question of annexation—\"It seemed to be the impression that he would make an important announcement at this banquet. It was the day of the day. (Applause.) He wished to speak on this matter with no uncertain sound. We are now subjects and not know that our status as citizens is being connected with that great empire. As we were then British subjects, so expect to be British subjects. What would we gain by a change? If there is a country on the face of the globe that is honest and progressive, it is the Dominion of Canada. We have a law-abiding population, extant now and again in the Northwest. (Laughter.) We have a government, a rich soil and an energetic people. We have good laws wisely administered. In every branch of industry our country is prominent. We have no reason to envy any other country, and as a member of self-interest it would be most unprofitable for us to attempt to sever our connection with Great Britain and unite ourselves to the country south of us, great as it may be. The Canadian constitution is much superior to the American constitution; we are not subject to the tyranny of the majority, and should be acting against our best interests if we were to change our form of government. We are not subjects of the Mother Country. What should we gain by such a change? We might get little more than the Copperhead (laughter) but in a color way, what can we see but the gainers. On the other hand we would be the sufferers. From Washington to the border our rights as free men. Are we going to sell our heritage for such a mess of potage? Annexation would mean taxation, which would lead to direct taxation, and if we adopted Commercial Union or Unrestricted Reciprocity, which we propose doing, the same thing, we would have to apply our diminished revenue by resorting to direct taxation. I, for one, am convinced that annexation has been commenced in a spirit of desperation, will succeed to nothing. The country under Conservative administration prospered and the people have faith in us, and on the part of the government I wish to say that whatever policy it may be as it has been, Canada for the Canadians, by the maintenance of a moderate protective system, and our infant industries as inaugurated in 1878. We would be blind to our interest if we did not maintain that system. We are opposed to annexation in every form, whether it is in plain terms or disguised under other names, or in any shape whatever. It is our principles, and I believe they will meet with the approbation of the country, and those who are prepared to meet us will find their banner in 1892, and when, which I may perhaps say, but a simple consulting physician, I hope to bring this question to victory by my colleagues. We have no fear of the result. We believe that in 1892, when the question comes up, it shall triumph; that we shall open our eyes to the fact that all small matters that they deserve, and that new power of shell shall be given the Conservative Government.\" (Applause.) Sir John spoke with such force was very actively listened to, and was frequently applauded.\n\nSILK RIBBONS:\n\nThese of our ladies who would like to have a cheap, large package of extra fine American Ribbons by mail in different widths and all the latest fashionable designs—Flowers, Bows, Strings, Neckwear, Scarfs, Trimming for Hats, Laces, etc., etc.—can get an astonishing big bargain, owing to the low prices charged wholesale by Ribbon Manufacturing Co., by sending only 25 cents to the address we give below.\n\nAs a special offer, this house will give double the value of any order sent from America if you will send the names and P.O. addresses of three friends, together with ordering and mention the name of this paper. No prices less than our real value in regular trade will be charged, money cheerfully refunded. Three packages for 25 cents. Address Mrs. E. M. RIBBON AGENCY, JERSEY CITY, N.J.\n\nWalters & Baker are selling Twoscent Overcoats for $1.\n\nBRADFORD CUPPER—A very interesting 15th century copper cup, made in England in the 16th. How they can be purchased now for 35 cents. Address Mrs. E. M. RIBBON AGENCY, JERSEY CITY, N.J.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nSCRATCHED 28 YEARS\n\nJ. A. CONVERSE MFG CO\n\nPROPRIETORS—MONTREAL\n\nMANUFACTURERS OF\n\nJUTE AND COTTON BAGS,\n\nPronounced, by practical con-\n\nsumers, superior to any-\n\nthing in the Canadian Market.\n\nWRITE FOR INFORMATION.\n\nManufacturers also of the celebrated\n\n\"RED CAP\" BRAND\n\nManilla Binder Twine\n\nAgents—MERRICK, ANDERSON & Co.\n\nWinnipeg, Man.\n\nGRAND UNION LIVERY STABLE.\n\nOpposition is the Life of Trade.\n\nA First-class Livery, Feed and Sale Stable.\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham and\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of the public to their new location.\n\nWe have also added some fresh horses to our well-known list of prime restaurant, carriage and harness horses. We are determined to be able to supply the Dominion this fall, the nobler ones having been removed to get them in.\n\nThree Months Free\n\nTHE WEEKLY EMPIRE\n\nCanada's Leading Paper.\n\nTHREE MONTHS FREE\n\nTHE EMPIRE, since its establishment, has met with such marked success as to place it in the proud position of Canada's Leading Journal, but in order to place the WEEKLY EMPIRE in the possession of the Dominion this fall, the nobler ones have determined to get them.\n\nFIFTEEN MONTHS FOR $1.\n\nNow is the time to subscribe.\n\nAddress THE EMPIRE, Toronto.\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888113001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 4381, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6916, 2], [6916, 12272, 3], [12272, 18205, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]