[{"id": "4ddf9a3e4bbeda5fbddebe34afb2a7d8399538ba", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MAY 2, 1884.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nFIRE! FIRE! FIRE!\nPUMP ON WATER.\nWells Sink and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN,\nPrince Albert.\n\nNOTICE.\nI would respectfully inform the public of Prince Albert and vicinity that I have leased Michel Scher's Blacksmith Shop where I will be happy to see all who will favor me with their custom.\n\nGood Work at Fair Prices.\n\nISAIAS MCCALL,\nGeneral Blacksmith.\n\nFarmers' Restaurant.\nMeals at all Hours.\nGood Beer and Cigars always on hand.\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\nProprietor.\n\nNEW GOODS!\nMEDICAL HALL.\nAn assortment of Drugs, Spices, Fancy Goods.\n\nAtkinson's Colgate's, Ludin's and Lambourne's Perfumery, Pear's and Calgate's Fancy Soaps, Hair Brushes, Toothbrushes, Ear Drops, Electric and Infants' Oil, L. Horn and Rubber Combs, Russell's Tooth Brushes, Tooth Picks, Brush Stands, Bottles, etc., etc.\n\nTERMS EASY.\n\nT. E. JACKSON,\nAT THE OLD STAND.\n\nFIRST CASE BY EXPRESS\n\nNEW SPRING AND SUMMER MILLINERY.\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nHATS AND CAPS.\nSPRING GOODS!\n\nCHESTER THOMPSON, CHIT-CHAT LOCALS.\n\nGeneral Blacksmith.\nEast End next to the Hudson's Bay Store.\n\nRepairing Farm Machinery Specialty.\n\nThose interested in\nTOWN LOTS\nBeing on the Estate of the late Mr. McHugh.\nAnd lying north of McHugh street are quoted to meet us at the office of Messrs. McHugh & Co., Saturday, the 3rd inst., at 7 p.m. For the purpose of taking action to procure the Patent for the Lots.\n\nTHOMAS MCNAY\n\nWhy Don't the Girls Propose?\nWhy don't the girls propose, Papa?\nWhy don't the girls propose?\nEach one seems coming to the point,\nAnd then away she goes.\nThey're not quite so sure this year,\nAs they used to be last year.\nThey flirt quite in a manly way,\nBut oh, they won't propose.\n\nI've read the latest fashions,\nAnd seen the latest fashions,\nAnd danced the same old dance,\nWith a quite commonplace skill;\nI am sure that I could know\nA thing or two about them,\nAnd I seem to understand them,\nBut they won't—what do you propose?\n\nThat most remarkable of stories,\nThat most remarkable of stories,\nThat most remarkable of stories,\nAbout making dresses,\nI have studied with attention,\nTill my head begins to spin.\nThat may be, may not attract them,\nYet still they seem, you see, one.\n\nI've practiced charming innocence,\nAnd creeping at the play;\nAnd playing at the game,\nIn a most engaging way;\nFor I stand hard by knicks and hips,\nAnd laugh at all the tricks they play.\nAnd smiled with sweet pretension,\nBut they will not propose.\n\nIt's really very hard, Papa—there's none for me to choose from—there's nothing to catch my eye.\nThe water is warm and faint; but while I propose every art,\nI'm afraid they'll laugh at me.\nWhy do the girls propose, Papa?\nWhy do the girls propose?\n\nIt is now announced that the English and American Governments are to unite in common cause and concerted action against dynamite conspiracies and assassins. This is as it should be. Governments should combine to put an end to any movement tending to undermine the basis of peace and safety and malicious destruction of life and property. It has been very discreditable to the American authorities for years and years, and the honest and brave men have been allowed to go on with impunity in their open band of organizations expressly designed to destroy the public property and endanger the lives of thousands of innocent citizens as well as to collect large sums of money for that express purpose. In few other countries would anything so dangerous and so destructive have been so long permitted.\n\nMr. Barker, of Ross & Barker, contractors, left for Battleford last Tuesday, where they have secured a contract from the Indian Department.\n\nGathered by our Reporters.\n\nBeautiful weather.\nBusiness is still quiet.\nCountry is very dry.\nThe country air and cool nights.\nSaw J.J. Johnston's new barns and also Messrs. Knox & Barker are building a pipe stage.\nMy friends will leave for Troy in a day or two.\nIn another column will be found an article by Mr. Acorn.\nMr. David Siddons left for Battleford yesterday.\nSee Moore & Macdonald's lumber ad in another column.\nMr. William Bishop will leave for Battleford shortly.\nSgt. Stewart arrived back from Battleford last Wednesday.\nThe water in the creek is as low as we have ever seen it during the fall.\nMr. R. J. Puttichard and family arrived from Kidson last Friday evening.\nThe Que Appelle River and Moose Lake are now being navigated for a short time.\nWe are glad to understand that a number of emigrants intend to leave for the City this week.\nWe have received a copy of the Empire International. We gladly add it to our excellent list.\nJames McGill arrives in town this morning.\nHe says he has heard that the police that he had visited Michel Scher's blacksmith shop, Scow.\nCapt. Davis succeeds in being a crew of three men, who are going to bring the steamer Marquis up the river.\nWe have received a copy of the Empress International. We shall be glad to allow it to be returned.\nWe have heard that Mr. Wm. Miller has gone to England to see after Manitoba's interests before the Privy Council in the boundary dispute.\nThe wife of Hon. C. P. Brown died here last night.\nSeveral large numbers of immigrants arriving daily.\nWeather not bad and rainy.\nTuesday May 1. Profound consternation through the discovery of two persons dynamite cartridges with five pounds of dynamite each. The Imperial Munitions Office at the parliament buildings, they were found by a man named Thomas Wilson. A thorough search revealed two more approaching the speakers chamber, these cartridges were found by Mr. Wilson and have been placed in police custody pending discovery. There is great excitement throughout the present city. The cartridges are about six inches long by one and a half in diameter, and contain a charge of dynamite. It was evidently kept to keep moisture out. If the cartridges found would have been enough to blow up the whole city.\nPortage la Prairie, May 1. John Boulter, of this town, cleared for the States after examining his chests containing dynamite cartridges. The particulars of the case are very sad.\nHavana, Cuba, May 1. A terrible explosion killed 21 persons, 74, 160,000 cartridges and 200 pounds of powder and a barrel of dynamite blown up. Havana badly shaken up.\n\nTELEGRAHIC.\n\nLocal House Adjourned.\nWill Meet Again on May 26\nHon. Mr. Miller gone to England.\nTo Look After Manitoba's Interests in Boundary Dispute.\nDr. Wilson sworn in as Provincial Secretary.\nEmigrants Arriving Daily.\nGreat Excitement in Toronto.\nDynamite Cartridges Found in and around the Parliament Buildings.\nOne of the Cartridges Sufficient to Blow up the Wing of the Buildings.\nA Lawyer Skips to the States.\nHe Swallows His Checks out of Thousands of Dollars.\nTerrible Explosion of Gunpowder in Cuba.\nSeveral Killed and Wounded and a Large Amount of Explosives Destroyed.\nHavana Badly Shaken Up.\n\nBy Special Telegraph to The Times.\n\nWednesday, May 1. House adjourned until 2 o'clock to allow delegates to return to their homes.\nHon. Wm. Miller has gone to England to see after Manitoba's interests before the Privy Council in the boundary dispute.\nThe wife of Hon. C. P. Brown died here last night.\nLarge numbers of immigrants arriving daily.\nWeather not bad and rainy.\nTuesday May 1. Profound consternation through the discovery of two persons dynamite cartridges with five pounds of dynamite each. The Imperial Munitions Office at the parliament buildings, they were found by a man named Thomas Wilson. A thorough search revealed two more approaching the speakers chamber, these cartridges were found by Mr. Wilson and have been placed in police custody pending discovery. There is great excitement throughout the present city. The cartridges are about six inches long by one and a half in diameter, and contain a charge of dynamite. It was evidently kept to keep moisture out. If the cartridges found would have been enough to blow up the whole city.\nPortage la Prairie, May 1. John Boulter, of this town, cleared for the States after examining his chests containing dynamite cartridges. The particulars of the case are very sad.\nHavana, Cuba, May 1. A terrible explosion killed 21 persons, 74, 160,000 cartridges and 200 pounds of powder and a barrel of dynamite blown up. Havana badly shaken up.\n\nThe Woman's Physician.\nThis book contains a complete medical work for ladies. Fully answers all questions such modern practice presents making a valuable guide. Gives causes and symptoms of diseases and remedies. Each disease is given in plain language written by ladies who have made these diseases their specialty. It is a book which every woman, young or old, should read. It is recommended by physicians as a help and companion as a guide for the sick. Handsomely bound and illustrated. Sent postpaid for $1.00.\nAddress: Remington Printing Company, No. 23, Union Block, Rochester, N.Y.\nPRINCE ALBERT TIMES\nSASKATCHEWAN REVIEW\n\nSPINK & MAVETY\n\nPRINCE ALBERT, N.W.T.\n\nThe Bishop in England\n\nBread unsupposed by any word of Winnipeg.\n\nNINE Loaves for $1\n\nPublic Notice\n\nFurniture\n\nJ.J.G. General Merchants, Sask.\n\nOffice and Workshop\n\nW.J.Carter, Builder and Contractor\n\nOffices Promptly Attended at Plans and Estimates Furnished When Required.\n\nPlanning and Matching done to order, next to HBC Grid Mill.\n\nPlaning near Presbyterian Church.\nAMERICAN.\n\nPUMPS!!\n\nSan Francisco, April 20.—The six day contest, the bicycle versus the horse, was finished today. Mr. Anderson had a number of followers who thought Mr. Armande rode alternately on bicycles. The two latter made 1675 miles, the best record ever made by any two men. Portland, Ore., April 19.—Andrew Higgins, a wealthy farmer near Portland, was killed by a falling tree. Mrs. Knott, who staggered out of a short distance from the house and buried it, was severely injured. She was found foraging in the woods. Knott supposed that Higgins had been killed in the house. A vigilance committee is looking into his death.\n\nCanada Life Assurance Company\n\nHamilton, Ont.\n\nCapital: Canada, nearly $8,000,000\nAnnual Income: over $1,000,000\n\nA. SPROAT,\nPrince Albert District Agent\n\nGENERAL.\n\nBellingham, April 19. It is feared that a return of the Eastern's allows may prove disastrous to the city. The mayor has called a meeting of the citizens to discuss the situation.\n\nPRINCE ALBERT\n\nPlanning Mills and Sash and Door Factory\n\nGOODFELLOW BROS. - PROP'S.\n\nCAMPBELL'S BLOCK.\n\nHow to Make Candy\n\nThis book gives full directions for making all kinds of candy and confectionery. It contains recipes for chocolate drops, French mixed and all other kinds of candies contained in this book. Any one can have these candies at home at less than one cent each. Address Rochester, N.Y.\n\nJ. M. CAMPBELL.\n\nJAMES SINCLAIR,\n\nMerchant Tailor.\n\nHas just received his new stock of Fall and Winter Goods.\n\nSuites to please the fancy of all.\n\nUNDERCLOTHING\n\nA Large Assortment of FUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\n\nWALTERS & BAKER,\n\nGeneral Merchants.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nA LARGE STOCK OF Watches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND\n\nPromptly Attended to\nTERRITORIAL NEWS.\n\nCALGARY\nFrom the Herald, April 16.\nThe Bow is in full flood of ice.\nThe government is offering a proposition for the sale of the river for $1. No buyers.\nLarge parties are starting for the Mountain in connection with tours.\nThe C. P. R. line is excellent in the lower end.\nThe line is now being constructed at this place by the government.\nA gold commissioner's office at the mouth of the Kicking Horse River.\nMcVitty has been appointed as the new commissioner.\nFort MacLeod.\nFrom the Gazette, April 17.\nThe prairie to the south-east across Belly River, caught fire on Tuesday afternoon.\nConway, McCann and Robinson have gone on a visit to Montana. They are not expected back until Thursday afternoon.\nThe Medicine Hat coach started from here yesterday morning for Edmonton.\nThe Medicine Hat coach will start again tomorrow morning for Edmonton.\nThe Medicine Hat coach will start again tomorrow morning for Edmonton.\nThe Medicine Hat coach will start again tomorrow morning for Edmonton.\nThe Medicine Hat coach will start again tomorrow morning for Edmonton.\nThe Medicine Hat coach will start again tomorrow morning for Edmonton.\nTHE DUDE.\nHow they came to let a dude stay in Texas.\n\"Talk about yer deeds,\" said a Texan stockman on the Chicago, Burlington and Quincy train last night, \"a little the dude don't live up to what he's a fellow that says he's a dude ought to be able to do.\"\n\"He don't stay in Texas long, I guess, and all little things like that.\"\n\"Yes, he's there now.\"\n\"I thought they wouldn't let a dude live in Texas, didn't I?\"\n\"Well, I'll tell you how it was we come ter let him stay. He come down here on the train as a regular dude, but he had a lot of money in his pockets and a lot of clothes on his back.\"\n\"He's got a lot of money in his pockets and a lot of clothes on his back.\"\n\"He's got a lot of money in his pockets and a lot of clothes on his back.\"\n\"He's got a lot of money in his pockets and a lot of clothes on his back.\"\n\"He's got a lot of money in his pockets and a lot of clothes on his back.\"\n\nMOOSE JAW\nFrom the Moose Jaw Tribune, April 18.\nGreat fishing in the creek.\nThe Moose Jaw River and Thunder Creek have once more attained respectability, thanks to the efforts of the local government.\nNumerous Temperance Clubs have been organized throughout the province, with the object of promoting temperance among the citizens.\nThe C. E. R. R. has obtained a new locomotive for the efficient work at their new well at Regina.\nAn attractive programme was presented at the annual Band Concert and Banquet, to augment the entertainment offered.\nThe entertainment was a complete success and reflects credit on those who undertook to be responsible for it.\n\nREGINA\nFrom the Leader, April 19.\nAs it has been stated that we have no rain in Regina, excepting in June, we are obliged to rely upon the heavy rain which fell yesterday, to prove that this statement is utterly untrue.\nThe C. E. R. R. has obtained a new locomotive for the efficient work at their new well at Regina.\nAn attractive programme was presented at the annual Band Concert and Banquet, to augment the entertainment offered.\nThe entertainment was a complete success and reflects credit on those who undertook to be responsible for it.\n\nMANITOBA.\nFrom the Winnipeg Free Press, April 20.\nThe Manitoba Government is urging up.\nThe Sons of Temperance now number five hundred members.\nThere is much talk of a company being formed in the city of Winnipeg, and it is expected that this can be found within the limits of the province.\nIt is understood that no store suitable for building purposes can be found east or west, and it is very likely that our quarters will be started up again before long.\n\nPORTAGE LA PRAIRIE.\nFrom the Evening Telegram, April 21.\nBeautiful weather.\nFishing and shooting will commence in a few days.\nW. Pratt sold 3,000 bushels of wheat when this week.\nTwo shipments arrived here this week, one to different points along the M. & N. W. Ry.\nThe junior branch of the Y. M. C. A. has organized an infantry company in connection with their association.\n\nWINNIPEG.\nFrom the Telegram, April 22.\nThe new mining regulations of the Dominion Government are causing great dissatisfaction among practical miners at Silver City.\nCalgary has been erected into an outport custom and a warehousing port, and placed under the control of the coldest winter of Winnipeg.\nThe adherents of the Church of England in Calgary have resolved to organize a church in that town.\nSubscription is being asked to provide a parish hall.\nA kitchener donated the sum of $100.\nA clergyman has been appointed as assistant minister.\nThe snow is rapidly disappearing off the summit of the Rockies.\nThe survey party detailed for the purpose of making a survey through the Kicking Horse Pass, are already located and hard at work.\nMessrs. McMillan and Smith have returned from their trip, while Neilson, Weston and Quickborn's parties are working from the other side towards the summit.\nIt is reported that the Provincial Government telegraphed to Ottawa that the Legislative Council desire a delegation, consisting of three members, to be received, to whom answer was given that the request of the resolution passed by the council would be complied with, and that the delegation would be refused.\nThe delegation would be met at any time by the Dominion Government.\n\nTHE WEEK.\nA new journal named Letters and Criticisms, edited by Mr. Roberta, published every Monday, will be issued next Saturday.\nThe new journal is now on the press.\nThe first issue will contain a series of letters to the different families which exist in the city of Winnipeg.\nMr. Roberta will be the regular contributor.\nMr. Edgar Fawcett will be the regular contributor.\nA list of names of contributors will be included in each issue.\nLetters and Criticisms contains articles of interest to the public, such as essays, reviews, etc., and is intended for the benefit of the most prominent American and Canadian writers.\nAdvertisers will find The Week a special class of advertising, and will be assured of the best prices.\nC. Blackett Robinson, Publishers.\n\nPHOTOGRAPHS.\nChas. E. Page.\nNEW STUDIO.\nEAST END.\nPrince Albert Bakery.\nAsh & Robbins, 360 Fulton St., Brooklyn, N.Y.\nCONSUMPTION.\nPositively cured.\nAll cases of this disease, whatever stage they may be in, will yield to our treatment.\nWe do not want your money until you are cured.\nFor your life worth saving, consult us today.\nAsh & Robbins, 360 Fulton St., Brooklyn, N.Y.\n\nDRY LUMBER.\nMOORE & MACDOWALL.\nWish to inform the Public that they have on hand and for sale Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., $42\nDressed Siding, $48\nUndressed do., $42\nSheeting, $30\nCommon Lumber, $35\nDimension do., $40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTHE GABLE NOTICE.\nAll parties indebted to us are requested to call and settle their accounts by the 1st of May. All accounts not arranged by that date will be put on our books for collection.\n\nMARKLEY & COY.\nNOTICE.\nI hereby intimate that all outstanding accounts are now closed, and all parties indebted to me are requested to settle the same immediately; if not paid, will be referred to Mr. H. R. Do and after this date will be put on our books.\n\nWM. GORDON.\nPatentee.\nAsh & Robbins, 360 Fulton St., Brooklyn, N.Y.\n\nC. Blackett Robinson, Publishers.\n\nFit, Epilepsy, or falling sickness.\nPERFECTION HERB POWDER.\nGrated Indefinite Herbs Powdered.\nThis is a powerful tonic, and is recommended for all cases of nervous debility, neurasthenia, neuritis, etc., and is also useful in cases of dyspepsia, indigestion, etc.\nAsh & Robbins, 360 Fulton St., Brooklyn, N.Y.\n\nR. B. Way.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884050201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4736, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 9107, 1], [9107, 9559, 2], [9559, 11617, 3], [11617, 19534, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]