[{"id": "aca622c6b91a4f75b6c5176ad1a7096a421891d6", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 31, 1888.\n\n$2.50 A YEAR.\n\nLOCAL ITEMS.\n\nSugar and Confectionery of all kinds received this week. Walters & Baker.\nThe new season's fruit is now in. Ripe and Jordan Lime Fruit Juices for sale at the Medical Hall.\n\nSeveral freighers have arrived during the past week, bringing in the first stock of fresh vegetables from the market.\n\nJ. Lestock Reid, D.L.S., was in town this week looking up to help maintain the proper order among the citizens.\n\nMossie Neilson and N. Cockrell had eight and one-third thousand shingles in two hours and fifteen minutes at St. Catharines one day last week. Next.\n\nWe believe there is a party in town who are planning to purchase several barrows and start about town. Some of the animals claimed are known in the settlement for at least six years.\n\nMr. Prout has recently presented the Rifle Association with a magnificent pair of field glasses, for the general use of its members when shooting. The Association tendered their hearty congratulations to the worthiness of the president's generosity.\n\nPOPULAR PEOPLE.\n\nAre invited to visit our store. Popular remedies are also as invariably pleasant to use, and certain in their results, Mr. John Conner (of Chetwynd, Ont.), says.\n\nWell and river water almost at the door. We have added some fresh hones to our own stock, which are guaranteed by the public and physicians, getting as good results as any other variety of water in use at reasonable prices.\n\nLamberts taken at reasonable prices.\n\nOur goods are noted for their fashionable shape and superior quality. Are in half size and in numerous widths, and are made in every style. Custom Work made and repaired.\n\nBy buying your boots and shoes at our store, you are safe on the road. Come in and see what we are doing.\n\nMISS AULD\n\nMiss Auld informs the ladies of Prince Albert and vicinity that she has opened her establishment at No. 10, Princess Street. She offers a large and well-selected stock of Millinery and Fancy Goods.\n\nHaving secured the services of a First-class Dress & Mantle Maker.\n\nLOOK HERE!\n\nW. SHANNON & CO.\n\nHave just received the first consignment of BOOTS, SHOES and School Bags.\n\nFor spring and summer wear for Indians.\n\nTrunks, Vailies and School Bags.\n\nFull lines of Ladies' and Children's Hats.\n\nEvery attention paid to the incoming public.\n\nTHOS. ORAM\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nGrand weather for haying and harvesting.\n\nSt. Ann's Convent opened on Monday, the 27th.\n\nImprove the appearance of River street by painting the telegraph poles.\n\nLarge quantities of hay have already been brought into town lately.\n\nLeave your subscriptions for the Dominion Illustrated at Cann's Bookstore.\n\nSeveral happy events in the matrimonial line have been recorded for the week.\n\nMr. H. M. Hamilton and wife and family, left this week for their home at Battleford.\n\nMr. N. MacLeod & Co. are busy opening up their new stock of boots and shoes just received.\n\nEmilie Fruit Salt, Warner's Safe Cure, Lambert's Spice Cure and Papoma at T. E. Taylor's.\n\nThe municipal taxes due this town for 1886 and 1887 will be advertised by the Sherriff next week.\n\nThe school cannot leave for Saskatoon until about the 15th inst., on account of the illness of some of their horses.\n\nNo rush for going back to school when the schoolmaster can get out of beef at MacDonald's for 10 cents per pound.\n\nA Sheriff's sale of lumber took place on Saturday afternoon at Mr. Smith & Baker's; good prices were obtained.\n\nWm. Shannon & Co. have just received the finest selection of fall and winter boots ever since, bought in Ottawa.\n\nMr. Markley, General Agent for the Confederation Life Association, took passage on the east bound stage for Winnipeg.\n\nAmong recent Duch. Lake residents whom we noticed in town last week were Messrs. R. B. Macdonald, Mr. J. McKenna and Mr. T. Kelly.\n\nMr. Harry Newlands and his bountiful bride arrived in town on Tuesday evening. They are now engaged in adjusting people to their new home and hope they may have a long and prosperous life.\n\nMr. James Sinclair, who has just returned from a trip to the east, will be in town along the railway, which he visited, business is very dull and none have half the money they had in Prince Albert.\n\nR. C. Wilson & Co.'s new store is being rapidly pushed forward. This firm has a growing closing sale and invites everyone to come and see their advertisements on another page.\n\nMessrs. W. Tait and J. B. Mack left on Thursday for the east. The former, who has been away for months, will return about the middle of September. The latter returns from Winnipeg.\n\nThe successful cup presented by the Royal Agricultural Society of Canada has been received by President Johnston and co. in view of the latter mentioned event. The cup will be shown for the last meeting.\n\nMr. J. L. Johnston arrived back in town on the last night of the meet. Mr. J. L. Johnston has been away with the business done in Prince Albert compared with the dull times experienced in Winnipeg.\n\nCaptain Wilson, accompanied by the two young Irish gentlemen who came out with him, has been spending the last month in Prince Albert. Left this week for Ireland. We wish them a pleasant and speedy trip.\n\nThe weather has been the best month or two, and many farmers want to ripen their crops. Harvey has been out for several days and almost every farmer has been busy harvesting. We believe the frost has done little or no damage.\n\nMr. Joe Phelan, Indian Agent at Edmonton, spent a few days in a tour for Indian Field Instructor at Fort Leduc, where he examined the buildings occupied by himself and his staff.\n\nPublications at lowest rates.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\nFRIDAY, AUGUST 31, 1886.\n\nNORTHEAST ORDINANCES\nHis Lordship Judge Richardson and Mr. A. E. Foster are now busy engaged in consolidating the Ordinances passed by the Northwest Council, with a view to having them revised and re-enacted by the Legislative Assembly. A number of the Ordinances is very much needed, and we are glad that it is being done. There are several of the Ordinances, too, which require amendments, and we take occasion now to point out one or two of these in which some of them stand in need of amendment. And first to the Municipal Ordinance, 1885. Section two provides for the erection of rural municipalities containing an area of not less than two square miles, but there is no provision made for the election of town municipalities, unless they be incorporated by an act of the Legislature. That we claim is an unnecessary proceeding; the same provisions should apply to the incorporation of towns as to rural municipalities. Section twenty should be amended so as to give municipal councils power to prescribe the form of oath to be taken by electors. Section 127, subsection (c), which should be changed. Under this sub-section as it now stands any collegiate institute, incorporated seminary, etc., may hold any quantity of land and such land be exempt from taxation. We can see no good reason why any institution should be allowed to hold more land than it actually uses, except from taxation. Where land is held, even by a public educational institution, and not used, it should be taxed. As the law stands at present, all any ratepayer has to do in order to avoid taxation is to execute a bogus transfer of his property to some collegiate institute. Another unnecessary provision in the existing Ordinance is that which requires lands to be sold for arrears of taxes to be advertised in a weekly newspaper published in Regina (see 259) or in the North-West Gazette. What sense, or result, is there in advertising Prince Albert lands in Regina? If there were no paper published here the case might be different. It is not likely that people would come up here from the capital of the Territorial government to tax sale, and we do not suppose that half a dozen citizens of this place would see the advertisement if inserted in the official gazette or a Regina weekly for two months. It simply means that a great deal of our money must go out of the place for nothing. If we have to sell land for taxes, let it be advertised where the land is to be sold and the probable purchaser resides. The time allowed for the redemption of land is too long. Section 257 allows two years. The time should be limited to one year from date of sale; there is no great inducement to purchase when the ratepayer has to wait two years for his deed, and although he is allowed twenty per cent. interest on his money if the land is redeemed, Speculators do not purchase at tax sales for the sake of the interest; their object is to secure the land and when they see a good chance of the title being completed they will not care about investing. There are several other points in which this Ordinance might be improved upon, and to which we hope to refer in a future issue, as well as to some of the other Ordinances.\n\nHORSE SHOE STORE\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\nFifty Chests Choice Congo Tea\nWhich we will sell until further notice at $2 per lb.\nFresh importations in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\nFull Lines of Windowcurtains\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC.\nBOOTS AND SHOES ARRIVING WEEKLY\n10,000 CHOICE CIGARS!\nAt Manufacturers' Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS\nIN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nAND\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed uttings, Trowsering and Overcoating WORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\n\nRUSSELL & DAVIS\nWHOLESALE AND RETAIL\nButchers\nBeef, Pork, Mutton, Sausage,\nBacon, Ham and GAME IN SEASON.\nRUSSELL & DAVIS\nRIVER STREET.\n\n\"BELL\" ORGANS\nUnpreached for Tone and Quality.\nCATALOGUES FREE.\nBELL & CO., Guelph, Ont.\nANNUAL MEETING\n\nThe annual general meeting of the Saskatchewan Provincial Rifle Association was held on Thursday last week and continued for two succeeding days. The proceedings were conducted in every respect. Owing to a number of circumstances it was found impossible to get the full range of the district in which the association had its head quarters, the fact of their being no means of crossing the river would have prevented.\n\nThere were large numbers present at the meetings and the results of the three days shooting show a marked improvement over other years. The weather was very fine except for the very bad wind and the wind was very often uncomfortable, but notwithstanding all these difficulties the shooters did very well.\n\nMONTANA MATCH.\n\nThe first event of the meeting was the Montana Match, in which there were forty-nine entries. There were twenty-five prizes in kind donated by our local merchants and others. Firing commenced at nine o'clock and under the conditions of this match were ranges 200, 400 and 600 yards. Sabre rifle, service rifle and shotgun ranges.\n\nThe following are the prize winners together with their scores—\n\n1. Kerr, Const., lang., presented by Coon, M. J., St. Albert.\n2. Baker, F. C., copper tea kettle by Coon, Agnes.\n3. McKay, James, pair pictures by Nelson, Mrs.\n4. Fleming, Corp., pair spurs by R. H. Smith.\n5. Cathcart, Inspector, goods to the value of $8, by J. Shaw.\n6. Begin, Capt., pair boots, leather, by J. M. Campbell.\n7. Baker, Corp., pair pants, by Betts & Co., Edmonton.\n8. Perry, Major, gloves, by Wm. Sodaro & Co., Edmonton.\n9. Baker, F. C., Daisy gun, by D. Savory.\n10. Agnew, T. J. photo frame by J. Cass.\n11. Pollock, H. B., dome, W. Tate.\n12. McKay, Rev., Archdeacon, which holder, by J. J. Cass.\n13. Parker, Sergt., check, by T. N. Campbell.\n14. Hart, Const., cuff buttons, by R. W. Hart.\n15. Talbot, Sergt., ring, by J. E. Talbot.\n16. Turner, F. gloves, Sodaro & Co., Edmonton.\n17. Godsell, Mr., watch, McCaig, Edmonton.\n18. Hart, J. W. slippers, McCaig, Edmonton.\n19. Reid, H., photographic, H. Reid, Edmonton.\n20. Reid, D. J., pants, W. R. Reid, Edmonton.\n21. Reid, D. J., shirt, McCaig, Edmonton.\n22. Reid, D. J., socks, McCaig, Edmonton.\n23. Reid, D. J., socks, McCaig, Edmonton.\n24. Reid, D. J., socks, McCaig, Edmonton.\n25. Reid, D. J., socks, McCaig, Edmonton.\n26. Reid, D. J., socks, McCaig, Edmonton.\n27. Reid, D. J., socks, McCaig, Edmonton.\n28. Reid, D. J., socks, McCaig, Edmonton.\n29. Reid, D. J., socks, McCaig, Edmonton.\n30. Reid, D. J., socks, McCaig, Edmonton.\n31. Reid, D. J., socks, McCaig, Edmonton.\n32. Reid, D. J., socks, McCaig, Edmonton.\n33. Reid, D. J., socks, McCaig, Edmonton.\n34. Reid, D. J., socks, McCaig, Edmonton.\n35. Reid, D. J., socks, McCaig, Edmonton.\n36. Reid, D. J., socks, McCaig, Edmonton.\n37. Reid, D. J., socks, McCaig, Edmonton.\n38. Reid, D. J., socks, McCaig, Edmonton.\n39. Reid, D. J., socks, McCaig, Edmonton.\n40. Reid, D. J., socks, McCaig, Edmonton.\n41. Reid, D. J., socks, McCaig, Edmonton.\n42. Reid, D. J., socks, McCaig, Edmonton.\n43. Reid, D. J., socks, McCaig, Edmonton.\n44. Reid, D. J., socks, McCaig, Edmonton.\n45. Reid, D. J., socks, McCaig, Edmonton.\n46. Reid, D. J., socks, McCaig, Edmonton.\n47. Reid, D. J., socks, McCaig, Edmonton.\n48. Reid, D. J., socks, McCaig, Edmonton.\n49. Reid, D. J., socks, McCaig, Edmonton.\n\nThe next event of the day was the Association Match for which there were about fifty entries. There were twenty-five cash prizes amounting altogether to $100. The ranges were 200, 400 and 600 yards. Sabre rifle, service rifle and shotgun ranges. This match was concluded on Friday morning with the following results—\n\n| No. | Prize | Value |\n|-----|-------|-------|\n| 1   | $100  | President's Cup |\n| 2   | $50   | Johnson's Fluid Beef |\n| 3   | $25   | Perry, Major |\n| 4   | $25   | McCaig, Edmonton |\n| 5   | $25   | McCaig, Edmonton |\n| 6   | $25   | McCaig, Edmonton |\n| 7   | $25   | McCaig, Edmonton |\n| 8   | $25   | McCaig, Edmonton |\n| 9   | $25   | McCaig, Edmonton |\n| 10  | $25   | McCaig, Edmonton |\n| 11  | $25   | McCaig, Edmonton |\n| 12  | $25   | McCaig, Edmonton |\n| 13  | $25   | McCaig, Edmonton |\n| 14  | $25   | McCaig, Edmonton |\n| 15  | $25   | McCaig, Edmonton |\n| 16  | $25   | McCaig, Edmonton |\n| 17  | $25   | McCaig, Edmonton |\n| 18  | $25   | McCaig, Edmonton |\n| 19  | $25   | McCaig, Edmonton |\n| 20  | $25   | McCaig, Edmonton |\n| 21  | $25   | McCaig, Edmonton |\n| 22  | $25   | McCaig, Edmonton |\n| 23  | $25   | McCaig, Edmonton |\n| 24  | $25   | McCaig, Edmonton |\n| 25  | $25   | McCaig, Edmonton |\n\nAnd its claims are fully authenticated by the following testimonials:\n\n\"Mr. Campbell's Remedy is the only authority in England and America and a great multitude who have tested its merits. Its use is not confined to invalids and convalescents but anyone who wishes to be in good health and avoid all ailments should try it regularly, and prove its wonderful strengthening and invigorating effects.\"\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nFar surpassing any previous season, both for richness, design and quality. The Variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nIn the last two matches the competition was keenly contested, and the highest score being entitled to the Dominion Rifle Association medal. T. E. Baker and Const. Leslie, each with 128 points tied for first place off the fire line, but each at 300 yards, Baker winning with a score of forty to his competitor's fourteen and thus securing the medal.\n\n**THE MACDONALD MATCH**\n\nThere were over forty entries in this match. The prizes were a challenge cup, presented by Mr. H. Macdonald, M.P., and £5 added by the Association. The ranges were 600 and 400 yards, and the first prize was won by James McKay—D. Williams, second, shooting the same score but falling off the firing range. The following are the scores—\n\n| No. | Name          | Score |\n|-----|---------------|-------|\n| 1   | Baker, T.E.   | 128   |\n| 2   | Leslie, Const. | 128   |\n| 3   | McKay, James  | 128   |\n| 4   | Williams, D.   | 128   |\n| 5   | Bailey, Sergt. | 127   |\n| 6   | Montgomery     | 127   |\n| 7   | Turner, Sergt. | 127   |\n| 8   | Park, Sergt.   | 127   |\n| 9   | Horne, Sergt.  | 127   |\n| 10  | Clarke, Sergt. | 127   |\n| 11  | Rogers, Sergt. | 127   |\n| 12  | Bailey, Sergt. | 127   |\n| 13  | Bailey, Sergt. | 127   |\n| 14  | Bailey, Sergt. | 127   |\n| 15  | Bailey, Sergt. | 127   |\n\n**LAURIE'S MATCH**\n\nThe most interesting event of the meeting came off on Friday afternoon. This was the Laurie Match; shot at 400 yards with the rifle, seven rounds. The first prize was awarded to Sergt. J. S. second, a beautiful gold hanger; third, a bronze sauce; fourth, silver spoon holder. The prizes were presented by the ladies of Prince Albert, each lady subscriber selecting a member of the association to represent her. Each subscriber winning a prize to hang it over the body whom he represented or to some one of the family. A large number of ladies attended the fair and were present on the grounds during the progress of the match and assisted in the refreshments after the shooting as the gentlemen. The ladies very kindly provided refreshments on the grounds for the members of the association and did things for them which they could possibly do. No doubt their presence contributed in no small degree to the success of the affair. We were glad in this match, and we trust that on future occasions they will pay a visit to our local Winstons. The shooting was good throughout, in fact could not be better. D. Williams and Sergt. F. Talbot, both of Prince Albert, scored 25, and it was not expected that their scores would be beaten, until Const. Bailey by his own account, shot a perfect bull's-eye, making the possible thirty-five. Excitement ran high when Sergt. Facker had scored an 11, and Bailey and it looked as though if Const. Bailey could not be alone with his gun, the aggregate last that night would be 50. Const. Bailey then became the winner of the most coveted cup, and was warmly congratulated by all who knew him. The excitement when the firing ceased was carried up to the ladies' refreshment tent by his lordship, Lord Lauries, who presented the cup to Mr. Spark, the only whose colour he wore. The following are some of the best scores—\n\n| No. | Name          | Score |\n|-----|---------------|-------|\n| 1   | Bailey, Sergt. | 35    |\n| 2   | Bailey, Sergt. | 35    |\n| 3   | Bailey, Sergt. | 35    |\n| 4   | Bailey, Sergt. | 35    |\n| 5   | Bailey, Sergt. | 35    |\n| 6   | Bailey, Sergt. | 35    |\n| 7   | Bailey, Sergt. | 35    |\n| 8   | Bailey, Sergt. | 35    |\n| 9   | Bailey, Sergt. | 35    |\n| 10  | Bailey, Sergt. | 35    |\n\n**ALL COMERS' MATCH**\n\nThere was not such a large attendance of members as usual Saturday as on the two preceding days. The first event this morning was the All-Comers' Match. Ten rounds of twenty-eight shots short. The prizes being a medal presented by Sergt. A. Bailey, £5 and £30 added by the association. The match was won by T. E. Baker. During the shooting in this match Capt. Thos. McKay donated a valuable silver cup, which was won by Const. Leslie who almost made the possible. The following are the winners and their scores—\n\n| No. | Name          | Score |\n|-----|---------------|-------|\n| 1   | Baker, T.E.   | 128   |\n| 2   | Leslie, Const. | 128   |\n| 3   | McKay, James  | 128   |\n| 4   | Williams, D.   | 128   |\n| 5   | Bailey, Sergt. | 127   |\n| 6   | Montgomery     | 127   |\n| 7   | Turner, Sergt. | 127   |\n| 8   | Park, Sergt.   | 127   |\n| 9   | Horne, Sergt.  | 127   |\n| 10  | Clarke, Sergt. | 127   |\n| 11  | Rogers, Sergt. | 127   |\n| 12  | Bailey, Sergt. | 127   |\n| 13  | Bailey, Sergt. | 127   |\n| 14  | Bailey, Sergt. | 127   |\n\n**NEW GOODS NOW OPEN**\n\nLadies' Jerseys and Jackets, Coats, Bustles, Hosiery and Gloves, and a full line of General Dry Goods. Fine Assortment of Men's and Boys' Hats! In Felt and Straw. A Full Line of Men's and Boys' Clothing & Mens' Furnishings Groceries, All New and Fresh in both Staple and Fancy Goods.\n\n**BETTS & Gwynne**\n\nR.C.W. & Co.\n\nA Large Assortment of Summer Dress Goods, The Latest Shades of Muslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies Hats, Caps and Straws\n\nThese Goods will be sold at bottom prices, Inspection invited.\n\n**R. C. Wigmore & Co.**\n\nFor the Best Assorted Stock of Confectionery\n\n**Notice!**\n\nAll overdue accounts will be placed in the hands of my attorney for collection if not settled by note or otherwise on or before August 1st, 1888.\n\n**W. R. Fish's Bakery**\n\nCentral Store\n\nGoods delivered to all parts of the town free of charge.\n\n**H. MacDougall**\n\nGo to Agnew's\n\n**Grand Union Livery Stable**\n\nOpposition is the life of trade\n\n**Donaldson & Pembroke**\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888083101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 6071, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5704, 1], [5704, 10458, 2], [10458, 15944, 3], [15944, 21579, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]