[{"id": "95fd25043c453dc8d12cd1ebb8ac2fbd9f069e83", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JUNE 25, 1886.\n\n$2.50 A YEAR.\n\nBANKINGHOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nTRADE MARKS AND GENERAL BANKING BUSINESS.\nINTEREST ALLOWED ON DEPOSITS.\nNOTES DRAWN UPON THE BANK.\nDEPOSITS AVAILABLE AT ALL POINTS IN THE PROVINCE.\nCOLLECTIONS AND TRANSFERS PROMPTLY AND RELIABLY.\nBANKER'S MERCHANT - Bank of Canada\n\nWILLIAM V. MACLUSIE\nBarrister, Notary Public, Etc.\nPRINCE ALBERT - N.W.T.\n\nSTEPHEN BICKNELL\nNotary Public of the Supreme Court of Justice in England.\nNOTARY PUBLIC\nLate MacMillan & Elliot.\nPRINCE ALBERT\n\nNORRIS & NEWLANDS\nBarristers, Solicitors Public.\nPrince Albert, Sask., N.W.T.\n\nF.F. FORRESTER\nH.W. NEWLANDS\nAttorney, Conveyancer\nPRINCE ALBERT\n\nETHELLE SIFTON, B.A.\nBarrister, Attorney, Conveyancer\nPRINCE ALBERT\n\nW.R. GUNN, M.A.\nBarrister, Solicitor Public, Conveyancer\nPRINCE ALBERT\n\nD'ARCY'S STABLES\nPRINCE ALBERT\n\nDENTIST\nPRINCE ALBERT, N.W.T.\n\nGEORGE A. BENTLEY\nBarber and Hair Dresser\nPRINCE ALBERT\n\nJ.D. HANNAH\nCommissioner and Commission Agent\nPRINCE ALBERT\n\nFURNITURE!\nCALL AT\nMiss Maguire's\nAnd see the largest and best assorted stock of\nHATS & BONNETS\nEver shown in Prince Albert, all perfectly new and latest styles.\nMiss Maguire, Campbell's Block.\n\nWANTED\n1,000 Men Wanted\n500 Women Wanted\n500 Boys Wanted\n500 Girls Wanted\n500 Children Wanted\n\nBOOTS AND SHOES\nAt Shannon & McLeod\nSHANNON & MCLEOD\nSHANNON & MCLEOD\n\nA.W.R. MARKLEY, THOS. POWERS\nCONTRACTORS\nPRINCE ALBERT\n\nTHE OLD RELIABLE\nA LARGE SUPPLY OF THE GENUINE OLD WEIGHT CLOCKS.\nSIDE LINE OF NICKEL CLOCKS, WALMATH, ETC.\nFINE INTERCHANGEABLE SPARE PARTS.\nWATCHES\nTO PRINCE ALBERT and points between Prince Albert and Saskatchewan Ferry (30 miles). We will make special arrangements for delivery at any point along the line. We will also make special arrangements for delivery at any point along the line. We will also make special arrangements for delivery at any point along the line.\n\nNOTICE\nTO PRINCE ALBERT and points between Prince Albert and Saskatchewan Ferry (30 miles). We will make special arrangements for delivery at any point along the line. We will also make special arrangements for delivery at any point along the line.\n\nTELEGRAPHIC\nTHE VERY LATEST NEWS BY WIRE\n\nCHIT-CHAT LOCALS\nGathered by\nVery hot.\nWhen will that heat arrive?\nLime Juice at Clark's Drug Store.\nSomebody was planting the town seed.\nPure Citrus Magnesium and Zinc Fruit Salt at Clark's Drug Store.\nWork on the foundation of the Court House will be finished this week.\nThe examination of the convict school will take place on the 8th of August.\nE.J. Jackson is sole agent for this district for the electoral literature Special Tactics.\nThere has been no good crop of potatoes, but several bushels of corn have been put in this year.\nA law has been passed by the Town Council imposing a tax on dogs of $2 and $4 per dog.\nMontreal Lime Fruit Juice, Johnston's Fruit Beef and Liquid Roman, for sale at Medical Hall.\nCannabis seeds, vegetables in the Red River valley shipped a little on the night of the 14th. Wheat not injured.\nClergy Park and Poveshell Denison District, South End, one of the best spots of T.E. Jackson's.\nThe assessment of Prince Albert Pro.\nPublic School District No. 3, assessed at $300,000, something like $300,000 more than last year.\nElectric Hair Brushes, Electric and Fresh Beards, Toiletries and Perfumery, sold by T.E. Jackson.\nW.C. Maclean, barrister, left for London Monday morning to attend the sitting of the court to be held on the 20th. Will have charge of all the cases.\nOn Wednesday evening the band gave the citizens a serenade from the water. The music sounded delightful, as if the band had been trained by the most skilled musicians.\nA Star, who recently lost his wife, this week presented with gold by Hon. Lawrence Clarke, $100 by Mr. Sanderson, and $50 by Mr. Young. Such generous contributions, so truly commendable.\nMr. J.F.A. Stott, Fairview Creek, received a visit by last mail from Mr. Murray Britton. Mr. Britton and Mr. Maclean visited Winnipeg on Monday last. They interviewed the Lieut. Governor and spoke of the high value of the medical exceptions they have from His Honor.\nA cedar shell has just been built by Mr. Murray Britton, and will be used as a promenade by competent judges to test the skill of workmanship to be done by W.R. Fisher. The dimensions are Length, 23 ft.; width, 10 inches; depth, 9 inches. Winnipeg has now a builder of W.R. Fisher of this town.\nIt is expected that in a couple of weeks Lord Dufferin, Governor General, will visit this city. He has been here before, and the result was that he was met by a large crowd of people who came to see him. We think we should unite in making him feel very much at home. Our Council should be forward in this matter and do everything in its power to make him feel at home and comfortable. We have no hesitation in saying that should His Honour decide to pay us another visit, he will receive a very cordial welcome.\nSome party started off after the other day near the height of the creek and subject to the current of the river. The result was that the boat was turned over and the result was that he was met by a large crowd of people who came to see him. People who are in harness ought to be taught, by legal process, that there is an obstruction in force preventing a boat from going up or down the river. I am not going to engage in anything when it has answered its legitimate purpose.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nTERMS—50¢ per number in advance\nSingle copies, 10 cents each.\nNo advertisements inserted for less than $1.\nAdvertisements without instructions will be returned without fail.\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVEETY, Proprietor.\n\nTHIS PAPER may be found on\nHawley & Co.'s newspaper stand at\nthe corner of Main and Main streets,\nin Prince Albert, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—Rev. Mr. Macdonald, Bishop.\n7 p.m.—The Mission Chapel.\n\nSt. Paul's.\n11 a.m.—Rev. Mr. Wright.\n3 p.m.—Sunday School.\n7 p.m.—Rev. Mr. Macdonald, Bishop.\n\nSt. Catherines.\n9 a.m.—Rev. Canon Fleet, R.D.\n\nSt. John's.\n9 a.m.—Rev. Mr. Macdonald, Bishop.\n12 noon.—Rev. Mr. Macdonald, Bishop.\n\nST. PAUL'S (Presbyterian).\n9 a.m.—Rev. Mr. Macdonald, Bishop.\n12 noon.—Rev. Mr. Macdonald, Bishop.\n\nFRIDAY, JUNE 25, 1886.\n\nHere most, the anarchist, is now putting in practice in jail, the doctrines he has preached outside. He is bringing into the fold a host of perfect equality with thieves and ruined gentlemen of all grades of society. It is to be hoped he may prove a martyr to his principles.\n\nThe Emigrant speaking of the Manitoba and Northwestern Railway, says: \"Its northern terminus will be Prince Albert, 450 miles west of present main Saskatchewan River. At present there are 150 miles of this road under operation, leaving 300 to be built. Fifty more miles will be in operation this fall. At the rate of fifty miles a year we shall have to wait five years before we hear the sound of the new horse whistling.\"\n\nBecause Senator O'Donohoe sold himself to the Conservative party for a banquet—a deal paid more than he was worth—and the banquet is not forthcoming, the Irish Canada does want its co-religionists disfranchised. We would recommend our Catholic friends to accede to the proposition at least so far as Senator O'Donohoe and Pat Boyle are concerned. It would go a great way in stopping the \"present truculent system\" inaugurated and carried on by O'Donohoe, Boyle & Co.\n\nThe bill respecting fishing by foreign vessels lately passed by the Dominion Parliament provides that any vessel which, after having entered Canadian waters, fails to comply with the laws of Canada or the United Kingdom, shall forfeit tackle, rigging, apparel, furniture, stores and cargo. Under this bill it will not be necessary to prove specific offenses.\n\nJames E. Steen, Secretary of the Winnipeg Board of Trade, in a recent article on Northwestern Trade, gives a good account of the Northwest containing 244 and upwards of business concerns, and says there are 249 other points throughout the Northwest with less than 25 traders in each. Since Prince Albert is not included among these figures, the impression likely to be created that we belong to the latter, and we beg to call Mr. Steen's attention to the fact that there are plenty places of business needing trading facilities in Prince Albert, and that while we would like to have railway connection, we are not like some other places in the Northwest, unable to exist without it.\n\nThere is not a doubt that the Northwest has a great future before it. The Pacific Railway has provided the main outlet and the imagination which is necessary, but the fertility of its soil will be the great attraction which will draw settlers to it. No doubt settlers will have some hardships to endure, and no doubt many will be fitted for agricultural life and these will fail. But on the whole, the settlers are pleased with the country and confident of their success in it. Their hardships are not so severe as those of the early settlers in Ontario, and the whole period through which they must pass will be short. The Ontario pioneer was forced to clear his land before he could cultivate it, and he had to make a living out of it before he could hope to live in anything like comfort. The Northwest settler has just to take over a year or two and then all is plain sailing before him.\n\nHamilton Spectator.\n\nWhile Canadians have been staggered on many occasions by the lamentable ignorance which some prominent journalists display of Canada and Canadian affairs, it is a pleasure to us to be able to find one (the Editor) able to speak intelligently and truthfully of \"how they manage it in Canada.\" In its issue of May 11th, review the history of Canada under consideration, giving the causes which led to the union, and concludes: \"It only remains to be said that by federation the struggling colonies of North America have been united, and the prosperous backwoodsmen thereafter have seen a success both politically, socially and commercially, and that the Dominion is now making rapid strides in the development of her resources, which, when they come to play place her amongst the nations of the world, always, we hope and believe, under the British flag, of which her sons are admittedly so proud.\"\n\nMISTAKEN SYMPATHY.\n\nSays Le Presse: \"Louis Riel was hanged on November 16th. His newborn infant died in its mother's arms. This will be the turn of the mother, who has already lost her son, surely. Surely the vengeance of the Orange lodges incited by Sir John Macdonald and by the French Canadian press, which has been the bane of the country, is by this act glutted. Is not the ruin of the unfortunate race of French and Catholic halfbreeds, which they have determined to root out of the North-west, simply because it is French and Catholic, now complete? Whilst the wretched widow was lying in agony on her deathbed, thinking of him who is no more, and of her poor fatherless child left friendless in the world, the Parliament of Quebec, urged by our Ministers to show its devotion to Sir John and Sir Hector, refused to express the slightest regret over the death of Red River, the death of a race which had finally been doomed to dishonor its memory.\"\n\nThis is very touching, but is not likely to awake much sympathy in the hearts of those who knew the late lamented deceased, chief of the Metis. There is no cause for a vote for poor outraged humanity can fail to have sympathy for his mother, wife and children. It is, fortunately, seldom that a family in the Northwest become bereft of both husband and father, an act which makes a protector, as was Louis Riel. He was the personification of beggary of allness, while at the same time he was a tyrant, who exercised the most outrageous and atheistic powers to force his brother Metis to join him in the endeavor to defy the Government, and he more than any other man, is responsible for the ruin of the French half breed race. We do not sympathize with him. Well, we mistake very much the temper of the French of Lower Canada if they are to be influenced by such appeals to vote against Sir John Macdonald. We only intervene with regard to Riel was not hang him when he first rebelled. It would have saved a great deal of trouble, and the Metis of the South Branch would have been spared the humiliation which he brought upon them.\n\nBut the strongest feature in this endeavor to arouse opposition to the Government of Sir John Macdonald is the course pursued by the Globe. We can understand the Globe opposing Sir John Macdonald grounds. That is its business. But when we find a prominent journalist shedding tears of sympathy for a creature who richly deserved hanging, we confess it astonishes us. His Le Globe is a daily newspaper to shout for the murdered people of Frog Lake, no tears of sympathy for the gallant boys who laid down their lives in defense of their flag? Has it no tears of sympathy for the widows and orphans of those brave parents whose sorrow was brought about by the machinations of Riel and his lieutenants? No, apparent none. It is too busy shedding tears over the death of a man who damaged his own house by burning it, friends, a curse to his people, and who deserved as richly to die as the murderer of Hon. Thomas D'Arcy McGee. The needs of the Liberal party must be great when its organs are unable to seek such tactics as these.\n\nCol. Schreiber, representing the Dominion government, on June 8th landed a party of 80 lumbermen at Wood Mountain with a large party to establish head-quarters, and make preparations for the opening of their ranch, which is located in the immediate vicinity of this post. They have run on route from Hay River, and will be here in a few days to be followed in a short time by an additional ten thousand. They propose to bring in a total of twenty-six thousand acres of land, and a house of seven hundred thousand acres for twenty-one years. They express themselves highly satisfied with the country as a grazing district.\n\nThe police patrol which has been established along the boundary is doing excellent service in the suppression of horse stealing and crimes of a similar nature.\n\nThe mail arrived at Prince Albert on Tuesday last, bringing in one passenger, Mr. Marsh, a student of Knox College, who will be engaged in the duties at Carrot River, and teach in the college there during the summer.\n\nHARDWARE BOOMING\n\nIn order to enable parties to build cheaply, I will sell building material at the following low rates for cash, viz:\n\nNails, $6.50 per keg,\nHair, 250 per bale,\nTar Paper, $6.25 per 100 lbs\nBarbed Wire, $11\n\nNOTE—Special figures to contractors.\n\nT.J. AGNEW.\n\nLumber Lumber\n\nWe will place on banks of Saskatchewan River, at Medicine Hat, ready for rafting,\n\nDressed Boards, $25 per m.\nScantling and Joist, up to 1 ft., 25 \"\nFlooring, Ceiling and Siding, 30 \"\nShingles, 4 \"\nTar and Brown Paper, 4cts lb.\nDoors, 2f 6in x 6f 6in, 1½ 2.30 each\nDoors, 2f 6in x 6f 8in, 1½ 2.40 \"\nDoors, 2f 10 x 6f 10½ 2.70 \"\n\nSASH FROM $1.30 TO $2.80 PER PAIR GLAZED\n\nAbove prices for cash only.\n\nCorrespondence solicited.\n\nTHE MEDICINE HAT LUMBER CO'Y.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—59 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and Special Departments of Occasional Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor every where.\n\nTHE MANITOBA SUN,\n12 Market St. E.,\nWinnipeg, Man.\nTO THE LADIES.\n\nNEW GOODS AT MISS MACK & CO\n\nFirst Door East Telegraph Office, CALEDONIA BREWERY EAST END.\n\nA SUFFERER.\n\nFrom the Progress.\n\nLIVERY & FEED STABLE CHAS. WOODMAN PROPRIETOR.\n\nROYAL MAIL STAGE I WEEKLY.\n\nTELEGRAFICS.\n\nThe following telegram was received yesterday:\n\nOttawa, June 23rd, 1866.\n\nA Good-bye, Prince Albert.\n\nSee Sir John again by the fall of next year. We have been obliged to place the harness at our own Prince Albert.\n\nJ. F. PETES.\nD. H. MACDOWALL.\n\nT. E. Jackson is sole agent for the sale of the celebrated Lucerne Spacemen.\n\nJust finished one gross of 60 Board Jambs at Caledonia.\n\nDemanding the same amount will be 110 values for the next selection.\n\nJ. H. Macdonald, Louis-Joseph, from the market. For sale at Clark's Drug Store.\n\nJ. F. Kennedy has left the offices of Moore & Macdowall & Co., and contemplate starting business for himself.\n\nParties wishing to obtain furniture at very reasonable rates should call on Mr. Macdowall at his residence or in the basement of another column.\n\nFor the cheapest Groceries and supplies in the Town, see Mr. Macdowall, who offers $42.50 per 100 lbs. Sugar $10 per 100 lbs. Oats $1.25 per bushel.\n\nPatent Linseed Magnesia and Eggs from S. H. Scott & Co., New York.\n\nMontreal Line Fruit June, Johnson's Land Beef and Liquid Hamlet, for sale at the lowest prices.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by writing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 107 Broadway, New York.\n\nWANTED\n\nLady.\n\nSHANNON & MCLEOD\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES FOR\n\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelings,\nDress Goods,\nSilks,\nLinen, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\nGROCER AND DRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 15 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings at cheap rates by any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nMOORE & MACDOWALL\nNOVA SCOTIA.\n\nFor the information of those who may not understand them, we give the names of the members in the platform of the association:\n\nThat the total debt of Canada is $25,000,000 (millions), which is more debt than she had when she entered the union of Confederation; That the rate of interest on the national debt is 3 per cent.; That by an increase in tariff they are now contributing $4,000,000 annually on their own account; and annual payments to the Dominion Treasury they have never received adequate return; That the bondholders have been paid off; That $95,000,000 of which Nova Scotia pays $4,500,000, the interest on which is 6 per cent.; That the people of Nova Scotia are for the construction of a way from which they receive no benefit; That while the people of Nova Scotia are suffering in the west, not a mile of railway has been constructed in Nova Scotia by the Dominion government except the Dartmouth branch, which was undertaken when the municipality guaranteed the cost for four years in advance. This was effected at a loss made by the Government at Ottawa to secure the passage of a reciprocity treaty with the United States; That the people of Nova Scotia and people of the west are opposed to such treaty, as expressed by the Tory party; That the award of four and a half millions received from the sale of the lands of the Dominion of New Caledonia, the largest part of which belongs to Nova Scotia, has been taken to pay the interest on the national debt; That the works from which we receive most advantage; That the total disregard of our privileges, rights and interests, and the vast extravagance in increasing the public debt and annual expenditure of the Dominion has shamed the patriotism and energies of all the people, and render it utterly impossible that we can any longer remain a part of the confederation.\"\n\nTHE AGRICULTURAL COLLEGE.\n\nA Buffalo Ranch to be Started.\n\nThe Winnipeg Sun says: \"Major Bell, the famous Bell farm, is the Queen's own sheep ranch. 'Every thing on the farm looks splendid,' he said. 'I never in any previous year saw anything to equal the condition of the sheep. They will be shipped out in two weeks.'\n\n\"What about the proposed agricultural college?\"\n\n\"Well, Prof. Tanner, who is to have charge of it is now in England to obtain students and experience in agricultur- al studies so that it will be quite a large institution. Prof. Tanner and an assistant will conduct the college and instruction will be given in practical and theoretical farming. A small sum will be charged students for board and room. If successful it will be a great success and will be the means of inducing many young Englishmen and others to come to Canada and settle here, receiving a thorough training in the old college.\"\n\n\"I noticed in the Sun last night,\" continued the Major, \"a paragraph about a man in Texas who was starting a buffalo ranch. I thought it was a good and excellent idea. I was specially interested in it, as a number of acres near my place would make a good buffalo ranch near Winnipeg. We have purchased Capt. Robson's herd of buffaloes and will start a fine farm there. We will get some good cows or fine bullocks and cross them with buffaloes, and will try to bring to the country a superior breed of thoroughbred cattle.\"\n\nTERRITORIAL NEWS.\n\nFORT MCLEOD.\n\nFrom the Gazette.\n\nChurch destroyed. (Expressed) Fort McLeod, was destroyed by fire on the 2nd inst. It was the finest church in the diocese of Saskatchewan. The total loss is estimated at between £1,000 and £2,000. Immediate steps are being taken to build a new church.\n\nPolice officer. Colville, after serving one year's sentence in the police guard room for stealing a revolver, escaped last night. He bored through the bars of his cell. A party has gone in pursuit.\n\nREGINA.\n\nFrom the Leader.\n\nThe Long Lake Railway was opened on the 7th inst., for traffic to Carman, a distance of twenty-five miles. About fifty people took advantage of an invitation extended by Mr. G. R. Popple to take a trip over the line. The party started about five o'clock in the evening to take dinner at the Palmer House. Traveling by dog sleds, they returned to Mr. Popple's on his enterprise. Traveling will be completed to Long Lake this week, when a boat will be put on the lake opening up a new route to Battleford.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nPresbyterian churches are being erected at Beaver Bar and Fort Saskatchewan. The Edmonton congregation three churches are to be built and commodious log buildings erected. Work will commence early in the spring. An Indian mission school has also been established at the Stanley Plains Reserve.\n\nA considerable drop in the price of fur is reported.\n\nTraveling will be started. About two weeks later than last year.\n\nE. Rossellow has two stables by fire on Friday of last week.\n\nJ. Colburn lost his stable by fire on Friday of last week.\n\nClark's Gunsmith, June 12th. The old gunsmith shop used by the people of Saskatchewan from the military authorities last year, and the wire cage given them by ten men, was destroyed by fire caused by a spark by the blacksmiths. The result in Prince Albert has just decided in favor of the gunsmiths.\n\nS. H. Kerr, of Winnipeg, passed yesterday raising a large which was sunk in the river near the elbow on the way across the water. The contents dry and clean are suffering.\n\nLETHBRIDGE.\n\nFrom the News.\n\nMr. E. T. Galt, accompanied by a party of friends from Montreal, has gone on a visit to the west coast of Canada.\n\nWe understand it is the intention to build police barracks here this summer. The plans and specifications are not quite completed yet.\n\nThe cricket teams are practically over, and we are now engaged in collecting funds from Medicine Hat on the 1st of July.\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held in the Council Chamber on Monday evening.\n\nPresent: Coms. Brown, Ratcliff, and Macdonald.\n\nOn motion of Coms. Brown and Ratcliff, Com. Goodfellow took the chair.\n\nThe minutes of the last meeting were read and adopted.\n\nA communication was received from W. H. Taylor, Town Solicitor, re col- lector's bonds.\n\nA by-law for the expanding of Rev- erend Thomas' improvements was in- troduced by Com. Ratcliff.\n\nThe Council went into Committee of the Whole to consider by law for Re- v. Thomas' improvements and bonds, with Com. Ratcliff in the chair.\n\nThe by-law was considered clause by clause.\n\nThe Committee rose and the Chairman reported accordingly.\n\nThe by-law was then read a third time and passed, and ordered to be signed and numbered.\n\nThe by-law to amend by law No. 1 re- lating to the inspectors was read a second time.\n\nThe Council went into Committee of the Whole to consider by law to amend by law No. 1, Com. Brown in the chair.\n\nThe by-law was considered and adopt- ed, and ordered to be signed and numbered, and on motion was ordered to be signed and numbered.\n\nThe by-law Regulating Transient Traders was read a second time.\n\nThe by-law Regulating the Regula- tion of Fire Departments was read a second time.\n\nMoved by Com. Brown, seconded by Com. Ratcliff, that the by-law for Re- v. Thomas' improvements be not read a third time.\n\nCom. Ratcliff was authorized to get the necessary permits for draining sloughs between 3rd street and River.\n\nThe Council then adjourned.\n\nOn Tuesday the telephone was con- nected to the wires in the telegraph office, and the first call was made at Clark's Crossing, and the first conversation by telepho- ne held between two places distance 85 miles.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nFURNITURE!\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all The Latest Designs!\n\nwhich I am selling at reasonable rates to make room for a large stock coming up by boat. Call and inspect my stock and get prices.\n\nSalterton, First Door West of Bank.\n\nW. B. GOODFELLOW.\n\nBuffalo Hall!\n\nOUR SUMMER STOCK IS NOW COMPLETE.\n\nLadies should examine our stock of Fancy Dress Goods, Prints, Cottons, etc.\n\nGents should see our Mammoth Stock of Clothing and Furnishings.\n\nFamilies should be entirely supplied from the Finest Stock of Staple & Fancy Groceries EVER OPENED HERE.\n\nBETTS & GWYNNE.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886062501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 6647, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5472, 1], [5472, 15944, 2], [15944, 18281, 3], [18281, 26586, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]