[{"id": "285f23343907b7c090fda7aed91f1229cce89976", "text": "**BANKING HOUSE**\n\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\n**PRINCE ALBERT, N. W. T., FRIDAY, MARCH 28, 1884.**\n\n**COMMUNICATIONS.**\n\n**FIRE PROTECTION.**\n\n_To the Editor of The Times._\n\nSir,—I was pleased to read in The Times of the 21st that we were in a fair way to be incorporated. I have no doubt that the first important business that will engage the attention of the council will be that of fire protection. I trust the lease taken by Mr. Smith for the fire hall will not be neglected. Although the fire company were early in attendance with what apparatus they had, and worked hard and efficiently, there was nothing to show by citizens, etc., all they could do was to save the store house. The mill had to go, and I am afraid, also, the lumber yard. If a spark, a clean engine thrown two streams had been on hand, all before the men came, and thus saved the cost of his fine engine. Another matter, gunpowder is kept in large quantities, and if the fire should break out, so kept that it can be easily got at and removed in case of fire, as great loss of life may result in case of fire.\n\nRespectfully,\n\nJOHN F. KENNEDY, Sec.\n\n**CHIT-CHAT LOCALS.**\n\n_Gathered by our Reporters._\n\nMr. Wm. Gordon got back from Troy on Monday last.\n\nSee Wm. Croat's going advertising in another column.\n\nMr. Allan Clark has arrived back home from Fort Pittage last Monday.\n\nThe next session of the North West Council will be held in July next.\n\nThe weather has almost disappeared here for a few days. The spring is coming on.\n\nMr. Allan Clark has started back home.\n\nThere will be a meeting of the Prince Albert Fire Co. at Mr. Garcia's workshop this evening, at 7:30 sharp. Business is important.\n\nSeeds—Alex Clark & Co., family chemists, have just received a large selection of seeds from Mr. E. Smith in Cal. Smith's report.\n\nThere will be a meeting of the Prince Albert Fire Co. at Mr. Garcia's workshop this evening, at 7:30 sharp. Business is important.\n\nSeeds—Alex Clark & Co., family chemists, have just received a large selection of seeds from Mr. E. Smith in Cal. Smith's report.\n\nA requisition is being taken round for signatures for Mr. E. Smith to stand forward as a candidate for mayor in the event of incorporation.\n\nThe Hon. Alexander Macdonald will hold the first of many annual meetings on May 27th next, when a good programme will be offered.\n\nHis Lordship, the Bishop of Saskatchewan, has approved the Rev. E. Parker Smith's request (Humility) for the Rev. H. G. P. Cameron's admission to the status of Anglican after Eastern Rite.\n\nThe Hon. J. M. Johnson, president of the Saskatchewan Curling Club, has sent from the Hon. L. Clarke, patron of the club, two beautiful silver bowls mounted with silver cups as prizes, which will be given to the members of the Saskatcheawin Club, and the other to the members of the Argyle Club who win the annual sweepstakes.\n\nThe 17th annual of the C. M. Clarke musical programme is under the able direction of Mr. J. M. Johnson, and the orchestra conducted by Mr. J. M. Johnson, the choir will be directed by Mr. J. M. Johnson.\n\nCURLING.\n\nYesterday an annual bonspiel was held on the river rink, the members of both the Saskatchewan and Argyle clubs, parading their prowess in the art of curling, which is not a rare accomplishment, but a very few of us have seen anything like that in years past.\n\nThe Argyle club beat the Saskatcheawin 21, leaving the latter club winners by three points.\n\n**TELEGRAFIQUE.**\n\n_HOUSE STILL IN SESSION._\n\n_No Business of Importance last Week—Budget Speech Tomorrow._\n\n_Immigrants arriving from Ontario._\n\n_Railway Collision—Passengers Injured._\n\n_Mild Weather in Manitoba._\n\n_Sir Charles Tupper will oppose San Francisco, Winnipeg and H.B. Railway._\n\n_The Opposition to take up Manitoban Grievances._\n\n_Debate on Prohibition—Vote in Favor decided by Large Majority._\n\n_Sir John A. M. Seriously Ill._\n\n_Philanthropic Advertised Exhibition of Good Old Ideas._\n\n_Heavy Floods at London._\n\n_Toronto Bribe Case Still Going on in Federal Court._\n\n_Destroying Evidence Against Mayor Talk of Arrest._\n\n_Experiment Increasing in the Damaging Facts come out._\n\n_The Ontario Parliament Proceeded._\n\n_Terrorized Streetcar of G. B. R. Employers._\n\n_Advance at British Relieved by Strikers' Large Number of Demonstrators._\n\n_Scenes—Terrific Clashes—Horses, Trains and Characters—Great Loss of Life._\n\n_By Special Telegraph to The Times._\n\n_WINNIPEG, March 27th.—The Local House is still in Session. Nothing of the matter. There is a great deal of excitement, mostly private bills. Premier Norquay will make his budget speech tomorrow.\n\nA large number of immigrants are arriving from Ontario and England.\n\nOn Wednesday a train of twenty-eight cars of immigrants and baggage left for Portage la Prairie. Hope, with about thirty passengers was run into by an express train near St. Paul. The coaches of Settlers' Express were badly injured, and the passengers severely injured, and taken to the hospital at St. Paul.\n\nThe weather is cool and rainy. The land has been badly damaged.\n\n_Ottawa_, March 27th.—Sir Charles Tupper may be opposed the passage of the San Francisco, Winnipeg and Hudson Bay Railway bill.\n\nThe opposition bring up Manitoban grievances to day.\n\nA long debate on prohibition occurred yesterday in favor of it was defeated by eighty-two.\n\nSir Leonard Tilley voted against prohibition. He said he had heard the effects of the law in New Brunswick, and that worse evils existed there than now under the beverage laws.\n\nMr. A. Macdonald is seriously ill, and unable to sit in Parliament.\n\n_Toronto_, March 27th.—The question of prohibition is being strongly advocated here.\n\nThe prohibitionists are asking that the Scott act be submitted to the electors all over the Dominion simultaneously.\n\nHeavy floods at London, and the river rising.\n\nThe Kingston Road bridge has been seriously damaged.\n\nThe trial of Bandits, Kirkland, Monk and others, at the Police Court, is still going on. Kirkland has been bailed by Mr. Goldwin Smith. Several cases evi-\n\nQuota a number of hanging dogs have been found on the property of Mr. Brewer, where a public dinner house is intended to be erected by the settlers of the town. The dogs were killed by the tenants of the place for his groceries. Mr. Goldwin Smith said that he knew Charles Grant was arrested again for killing a horse, after killing the horse of Mr. Herbert. Peter killed five mouses.\nTHE PRINCE ALBERT TIME\nAND SASKATCHEWAN REVIEW\nSPINK & MAVEETY\nT. H. SPINK\nPRINCE ALBERT, N. W. T.\nTRAINS—180 per ann in advance notice, except in case of fire.\nIn case of fire, mail paid by insured.\nBusiness letters, etc., per line.\nAll letters to be addressed to the Proprietor.\n\nTHE HUDSON BAY ROUTE\nThat nameless working steadily at surely as it has been gathering the course of slowly passing ages has silently accumulating in these Territories a rich abundance of all things suited to the requirements of civilized man. We have no cause to open our dispute. That the discovery of this fact should have been made just as signs of share, if slow, decayin the older inhabited portions of the North appear to us to be fraught with that reaction in the condition of society caused by the rapidly increasing practical application to the wants of man of old world scientific discoveries, not without a large significance in casting the horoscope of our prosperity in this vast country. What, however, more immediately and intimately concerns us just now is the question as to how we are to secure to ourselves the greatest possible benefits which ought justly to reward our enterprise, our labors and services privations as the pioneers of civilization? The answer to this most vital question seems far to seek. Indicating the depression, necessary consequent upon hopes and schemes allowed to run riot, owing to the fact that the immigration of our kind has been on such a scale that in a short while consumers of produce have already so far outstripped supply beyond the means that an unmitigated surplus is absolutely necessary for our salvation. It seems almost superfluous to add that nothing but the steady demand for timber in the provinces may see a legitimate one to them, but they must distinctly understand that we do not intend to form the subject of our own experiment. The refusal to deem our lives to be worth our own expenditure seems selfish, but we can't help it. The solution of the Hudson Straits question seems to us to mean life or death for the settlers. While quite aware that mere personal denunciation can carry no great weight either way, we must say that a careful examination of the facts so far adduced strongly tends to strengthen our conviction of the practicality of the route, the more so, as we notice that a contrary view is supported by a great extent of men who until recently succeeded in convincing Europe that this country was useless unless for fur trading. That idea is already a tradition, and we believe that the importance of the profits only realized by the Hudson Bay Company will soon be relegated to the same category. Space only permits us to glance at this large question, and as probably all that can so far be said about it is not yet altogether discussed, we pass on with solemn regard to this matter being scrutinized. That their conduct with respect to other matters is subjected to the same feeling they must be aware, and we trust that by refusing to pander to the selfish interests of the opponents of this scheme, they may succeed in creating much existing bitterness. The conduct of the C.P.R. authorities seems to bear out our expectations that so far from opposing the movement, they are doing all in their power to facilitate the prosperity of the Territories as a whole and their own must be mutually involved. We believe that anything they may lose by the emergence of the new line in the eastern portion of their line, where they have to contend with powerful opposition, will before long be more than compensated for by the increased traffic on the new line, which must be of most important link in the communication between the Pacific Ocean and Europe. That must jealously should exist in and around the Hudson Bay Provinces is a fear, is incredible, but we believe the proportion of that antagonism, and the benefits certain to accrue to us from the completion of the railway will be more than the risk. We would humbly advise its opponents to give in gracefully, to resign themselves to the inevitable. They can only hope at most to retard for a time what is a foregone conclusion, and moreover, create much bitterness in those whose prosperity, we might say very existence, depends upon the speedy opening of the route to the West. Meanwhile we earnestly hope that the people of Manitoba and the North West Territories will sink all other differences for the present and to a large extent, in the support of their leaders in carrying through, as compared with which all else sinks into insignificance.\n\nWith regard to Mr. D. Cameron's story as told in his letter, we consider it an imperative public duty to point out the significance of his statement. He has stated that the entry of his land has been productive except from Crown Timber Agent for whom he claims on logs cut under circumstances described in his letter. Putting aside the question of a timber agent's right to enter a settler's land on us under our peculiar circumstances, it is to be tolerated that a proper share of the timber industry is to call us to account. The timber cut several years ago, at a time when there was no timber agent in the District, if even in the Territories? In those days a settler would have just as soon been asked to lend a person's cattle at the rate of a penny. We believe this action to be ultra vires, even had they had the decency to hear Cameron's side of the case. If the matter cannot, unless Cameron can produce a receipt for an unsubstantiated claim of a totally uncertain amount, he may have been jumped and lost the use of ten years' labor and prison. The thin thread is the fact of it all ugly look of tyranny. It would look as if the Timber Agent, ashamed of his actions, had recourse to something not unlike a conspiracy to bulldoze. Perhaps, though, he can explain. We trust he will do so and that people here realize whether their position is to be under police officers, Crown timber or other agents, analogous to that of Russian serfs.\n\nTHE HORSE SHOE STORE\n\nThere is a motto that's plain if you follow\nYou will find in the end it will pay.\nSuccess will come if you make efforts anew,\nA result that answered in event that is gained\nWhen buying your property go where they say.\n\nAt the store they call the \"Horse Shoe.\"\nIt is not only cents but dollars you will save.\nWill leave you a hundred more to the good\nRemember the motto and also the place,\nAnd you'll be glad you've bought there.\n\nWe are determined to sell out at occasional Hard Lines.\nBetter tuck next time.\n\nThe Boom is of\n\nWhat cannot be avoided\nTwice children's weaknesses to lament.\nHow often in affairs of men we do\nFail limitation end in worst failure?\nIf trouble must be made, decide at once,\nAnd with proceeds of the sale buy cheaper.\n\nG. BLACKETT & CO.,\nJ. A. Scott & Co.,\nToronto.\n\nBranch Store\n\nNear the building occupied by the late firm of Ash & Robbins, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO.,\nWholesale and Retail\n\nAsh & Robbins,\n360 Fulton St., Brooklyn, N.Y.\n\nCONSUMPTION Positively Cured.\n\nAll sufferers from this disease that are suffering from consumption are invited to visit our establishment, where we have prepared a preparation known to cure Consumption. This preparation is made by a chemist who has been engaged in the manufacture of medicines for many years, and who is thoroughly conversant with the subject. We have prepared a special preparation for consumption, which is guaranteed to be effective. We have prepared a special preparation for consumption, which is guaranteed to be effective.\n\nAsh & Robbins,\n360 Fulton St., Brooklyn, N.Y.\n\nFRIDAY, MARCH 28, 1884.\n\nRoyal Mail.\nCHEAP FARES.\nPrices to suit the Times.\n\nFrom Prince Albert to Troy.\nSingle Round Trip $5.00\nTwo Way $9.00\nReturn $10.00\nRailroad tickets included in package.\nThe above fares are exclusively for business purposes. For pleasure trips, only full further notice.\n\nSTEWART, LLOYD & Co., Mail Contractors.\n\nPUBLIC NOTICE:\n\nAll persons are hereby required to take notice that the cutting of timber as the public lands of Canada, without the permission of the Minister of the Interior or the Local Agent, is prohibited by law, and all timber so cut without such permission is liable to seizure, and to be dealt with as the Minister of the Interior may direct.\n\nEach settler on a homestead quarter-section not having timber land, must notify the Minister of the Interior, or the Agent of the Dominion Lands, purchase a wood lot not exceeding five acres, at twenty-five cents per acre.\n\nAny person other than a homestead settler desiring permission to cut timber, must notify the Minister of the Interior, or the Agent of the Interior, who will deal with the matter.\n\nPersons who have already cut timber, must notify the Minister of the Interior, or the Agent of the Interior, who will deal with the matter.\n\nNotice is hereby given that the Crown Timber Agent at his office will be open from the 1st May, otherwise the said time will be extended under the provisions of Land Act's.\n\nD. J. WATSON, Crown Timber Agent.\n\nSTRAVED\n\nOn the premises of the undersigned, about a month ago, a black brown mare about a year old, feet and face white.\n\nThe owner can have her by paying cost. If not claimed before the expiry of two months will be sold to pay expenses.\n\nT. N. ISBISTER, South Branch.\n\nMarch 18th, 1884.\n\nNOTICE.\n\nAll parties holding lots on the Presbyterian Mission\n\nProperties are requested to make their second payment on the same, not later than 1st of May, which agreements of sale will be given.\n\nT. N. CAMPBELL, Agent,\nForeign Mission Committee.\n\nSEEDS!\n\nAgricultural, Garden and Flower seeds. Crocus, Tulip, Hyacinth, Lily, Peony seeds. True Seeds, carefully selected and treated. Our Illustrated catalogue free on application.\n\nR. R. KEITH & CO., Seedsmen, 40 Main St., Winnipeg.\n\nDr. A. STACKHOUSE,\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nThe Grand Central RESTAURANT\n(Old Woodbine Saloon.)\n\nThis new Restaurant has been opened and is ready for business.\n\nMEALS AT ALL TIMES.\n\nTHOMAS ORAM, Prop.\n\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE NO. 208.\n\nNear Presbyterian Church.\nH. B. ROUTE AGAIN.\n\nJ. Lemire, of Long Lake, sailed from St. John's in the \"H. B. Co. ship Prince of Wales,\" for York Factory. Had mild weather and a pleasant trip all the way out. Saw the steamer \"Nipigon\" account-\ning Cape Resolution, at the entrance to Hudson's straits, about the last of June. Could not get through the narrows at that time. There was consid-\nerable fog, but the ship did not lie up,\nwas so low in the straits that the boat-\nmen could see over her deck, and the\nweather and navigation good. Only\ndifficulty, the current was strong and not\nproperly known; it had to be kept well astern\nto keep the vessel going. When\nthere was a tide with a copper wave so that it\nwould give the true direction. When\nnear the entrance, there was a sudden\nattention of Equinaxus, but no cause\nfor alarm. After passing through the\nstraits about August 1st, went south-\neastward between Manfield\nisland and the main land. There en-\ncountered fine flow, and smooth water.\nThe turn of the tide released the vessel, and no\nmore ice was seen. The weather was\nunusually calm and fine. No Indians\nwere seen in the straits or bay, and there\nare no violent storms.\n\nLaunched at York Factory on August 15th. About seven miles out\nfrom York, and in low tide the vessels\nhave only room to swing, with bare sand\nbanks on either side.\n\nMr. Lemire remained at York factory\nduring the years '62, '63 and part of '64,\nthe ships being laid up during those\nthree weeks, leaving for England about\nthe middle of September. Ice took\nYork river early last October, '64, and\nkept gradually freezing further down\nthe river until winter. Although open water could not\nbe seen in the head of the river, the snow\nand ice was very heavy. The\nweather was generally dead calm and\nvery cold, the thermometer frequently\nreading below zero, and sometimes six\nfeet deep. All winters similar in char-\nacter. Spring thaw commenced at\nthe latter part of April or first of May.\nYork river opens about May 30th, and\nthe hay clear of snow about June 10th.\nVehicles can travel before York river\nbreaks a passage through the ice to\nthe open water. The fish are white\ngenerally, but are very thick along the shores.\nThe summer season is generally very\nlate. June 1st thermometer regis-\ntered 100° in the shade. Turnips and radishes grow well at\nthe fort and potatoes have been tried, but\nonly grown in small quantities. There\nwas frost in June and July.\n\nAfter leaving York Mr. Lemire resided\nin the Rainy Lake district for several\nyears. In 1870, the steamer last, of\n\"H. B.\" took passage in a new vessel called\nthe Prince Rupert. Mr. Lemire, Eng. Saws a\ngreat deal of the country, and has visited\nreaching Manfield island. Passed\nthe island in the night, five days out from\nYork. Saw no ice along the shores or\nin the straits. Had no fog, as there\nare none in the fall. Passed cape Resolu-\ntion north, about July 15th. York. Kept\nnorth about three weeks. York river\ngales across the ocean, and no ice.\nLeft the best India dock, London,\ntwenty-five afters noon.\n\nLeft Stromness again for the North\nWest on June 18th, 1870, in the Prince\nRupert. Eng. Saws a great deal of the\ncountry, and has visited reaching Manfield island. Passed\nthe island in the night, five days out from\nYork. Saw no ice along the shores or\nin the straits. Had no fog, as there\nare none in the fall. Passed cape Resolu-\ntion north, about July 15th. York. Kept\nnorth about three weeks. York river\ngales across the ocean, and no ice.\nLeft the best India dock, London,\ntwenty-five afters noon.\n\nLeft Stromness again for the North\nWest on June 18th, 1870, in the Prince\nRupert. Eng. Saws a great deal of the\ncountry, and has visited reaching Manfield island. Passed\nthe island in the night, five days out from\nYork. Saw no ice along the shores or\nin the straits. Had no fog, as there\nare none in the fall. Passed cape Resolu-\ntion north, about July 15th. York. Kept\nnorth about three weeks. York river\ngales across the ocean, and no ice.\nLeft the best India dock, London,\ntwenty-five afters noon.\n\nThe trip is usually made by the\n\"H. B.\" ships in from five to eight\nweeks, and the return in from thirty\nto thirty-five weeks. Weather good all\nthe time. By mistake reached Sugar\ntrees on the coast, far west of York near-\nest York, but returned to York next day,\nsix weeks and a day from Stromness.\nAfter entering the bay on this trip, met\nand Yankee, Capt. Johnson, who had\ntried the bay three weeks before and\nhad seen no ice while passing through the\nstraits.\n\nThe next trip is usually made by the\n\"H. B.\" ships in from five to eight\nweeks, and the return in from thirty\nto thirty-five weeks. Weather good all\nthe time. By mistake reached Sugar\ntrees on the coast, far west of York near-\nest York, but returned to York next day,\nsix weeks and a day from Stromness.\nAfter entering the bay on this trip, met\nand Yankee, Capt. Johnson, who had\ntried the bay three weeks before and\nhad seen no ice while passing through the\nstraits.\nITEMS OF INTEREST.\n\nTHE VERY LATEST NEWS.\n\nCANADIAN.\n\nPORTSMOUTH, FRIDAY, March 15.—R. R. Marshall has purchased H. R. Banks' lumber yard, through the Ontario Bank.\n\nA successful carnival, the largest ever held in this city, was held last night at George Craig's yard.\n\nGeorge Craig has made arrangements to supply newspapers with goods.\n\nSTEVENSON CITY, N. W. T., March 15.—An election meeting of citizens was held last night to consider the means of establishing a newspaper. The greatest enthusiasm prevailed throughout the town, and a substantial sum of money was raised.\n\nMr. Stevenson, formerly manager of Grey's Tobacco Factory, has been elected president of the association. The plant is to be procured as soon as possible, and the Silver City Press will be located here.\n\nThe election was held May 15.\n\nMONTREAL, March 14.—The Canada Guv'nor contains a dispatch from A. B. Murray, of St. Boniface, at present third commissioner under the McNally Act, for the liquor license district of Portage la Prairie, to the effect that he has been appointed to the same district, and Joseph F. Tremblay to be the third commissioner for the same district.\n\nIt was rumoured at the time that Mr. Murray had received an intimation to use every precaution, as dynamiters were supposed to be gathering together on the building site.\n\nThe guard was increased, and the Speaker of the Commons and others who were appointed to the building site retired from their quarters on Saturday evening. It is said, however, that Mr. Murray left early owing to his being ill.\n\nMontreal, March 15.—The Canadian Pacific has reduced freight rates on grain shipped from Chicago to 2 cents per hundred pounds.\n\nTOMATOES, March 15.—The tomato crop is reported to be very good, and the market is expected to be active.\n\nST. LOUIS, March 15.—A gas explosion occurred in the Liberal Club building today, killing all the members in the building and several others outside.\n\nWinnipeg, March 16.—This morning at 8 o'clock two prisoners confined in the Provincial jailhouse and the jailer and family occupied a brickyard were captured. Later advice states that one of them was captured, and the other is thought to have been severely wounded by the jibes.\n\nLast night three men, coloured, got into the former's mistress' house and threw a lamp striking Scott on the head and breaking the lamp. The oil took fire and Scott was badly burned. One was arrested.\n\nAMERICAN.\n\nMINNEAPOLIS, March 16.—At the Pantages' opera last night a tragic accident occurred. Mrs. Harris was acting as usher when she fell and was killed, and her body was thrown into the orchestra pit.\n\nNEW YORK, March 16.—A prize fight for $500 between Hogan and Hart was fought today on a barge which was towed across East River. Hogan won in four rounds.\n\nST. LOUIS, March 16.—Arrangements are being made for an international bear show of dogs, to be held here about the middle of April.\n\nNASHVILLE, KY., March 16.—The Quaker City is reported to be engaged in killing and burning of seven head out of the Owl Creek herd.\n\nDavenport, March 16.—On June 1st, 1867, Charlotte Kate, a pretty girl, 18 years old, was murdered in her home on Oak Street by a man named Harris. The murderer said yesterday that he had killed her because she had confessed that her own mother had committed adultery.\n\nPLATTSBURGH, March 16.—A Walnut street, Marshall County, two men were killed by a horse which was running loose. One of the victims was identified as Haggard, who drank and walked to clean out John Cherriman's saloon. Our knockdown Cherriman down and the other knocked him down. Cherriman, who was drunk, shot Harris dead and put two balls into Hardman's head, from which he died three days later.\n\nNEW ORLEANS, March 16.—From Sharkey County, Mississippi, came the news that Greenwood, 100 miles below, the water is over all places except a few mounds sufficient for stock to stand on. The town of Greenwood is now a sea except a warehouse and the court house. Shell Mounds and Slides are both overflown. No loss of life or stock has yet been reported.\n\nGENERAL.\n\nLONDON, Eng., March 15.—The Commons continued in session all night debating the Egyptian question.\n\nIt is rumored that the Government desiring to test the opinion of the country in regard to their Egyptian policy has sent a special agent to Egypt and informed the Queen of this decision.\n\nDELAWARE, March 17.—The counties of Tyrone, Clinton, Susquehanna and Northumberland have been declared under the Reims Act in view of possible riots today.\n\nParis, March 16.—The French advance from Rich Nain has begun. Gen. Desaix marches upon Thudupurin, and General Ney marches upon Langres.\n\nThe Government has instructed Gen. Millet commander of the land forces in Tonquin, not to cease military operations against Thudupurin and Longchon. Prime Minister Ferry has responded direct negotiations with Marquis Tung for a treaty based upon the conditions that the French be allowed to retain possession of Rich Nain.\n\nHavana, March 15.—(i.e.), Velarde, a cavalry officer, three sailors and twenty-five civilians were arrested at General Velarde's house on Saturday, and were taken to Havana and other places, including Belgrano Villa Campa. The Government has given no time being given for a military uprising similar to that of August last. Many more persons were arrested today.\n\nBuenos Aires, March 15.—A meeting of the Progressives today to resolve to pass with the Liberal Union was adopted.\n\nU.S. President Grant has accepted Prince Albert's invitation to dinner on the 23rd with the Empress William.\n\nFARMERS' Attention!\n\nThe Champion Cabinet CREAM CHURN.\n\nThe very best in the market, now on hand at\n\nJ. M. CAMPBELL.\n\nALSO\n\nPloughs and Harrows.\n\nFURNITURE\n\nJust arrived, in addition to our former large stock, we have received several Fancy Parlor Bedroom Sets. Give us a call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions, Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nG. & G. E. CARTER,\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory\n\nROYAL BAKING POWDER Co., 100 Wall St., N.Y.\n\nTHE FIRST INSTALLMENT OF A LARGE STOCK OF\n\nMowers and Rakes\n\nFrom the celebrated Royal Manufacturing Co., A. J. O. Smith, Buford Breakers\n\nHave arrived at the Implement Departments of Jackson & Jackson, and arrive shortly\n\nThe Lion Reaper.\n\nHandy Wheat Mills.\n\nBuffalo Harness and Ploughs\n\nJACKSON & JACKSON\n\nBUFFALO HALL!\n\nClose Buyers Still Patronize THIS OLD RELIABLE HOUSE.\n\nWe Need Money and are Willing to Sacrifice on Goods to get it.\n\nOver due accounts should be attended to at once to avoid costs.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nA FULL STOCK OF\n\nPowder, Shot, Caps and Shells.\n\nField Hoes, Spades, Garden Rakes, Shovels, Forks, Rope, Etc., at\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company owns 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRUGES, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884032801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 7029, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6417, 1], [6417, 16623, 2], [16623, 21580, 3], [21580, 29258, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]