[{"id": "1ddd7996ccd0c750c71065130db88ca43cb14195", "text": "ARBOR DAY.\n\nHis Honor Lieutenant-Governor Dowling has proclaimed Saturday, May 1st, as Arbor Day. Arbor Day is a good occasion to show our keen care and attention to the beautification and protection of our parks, and we have no doubt the pioneer who have, so far, built up cities, towns, villages, farms, and timber and success, will look on tree-planting as an expression of the natural goodness and beauty of this vast north-western country.\n\nP. A. C. BAND.\n\nWe trust the suggestion which we have thrown out regarding the providing of uniforms for the P. A. C. Band will be cheerfully and promptly acted upon.\n\nGeo. M. Shier, President\n\nR. B. WAY.\n\nPortage Street Jewellers.\n\nPRINCE ALBERT.\n\nBanking Mills and Sash and Door Factory.\n\nCOMMISSIONERS:\n\nJOHN SMITH, Q.C., PRINCE ALBERT.\nCOL. MARSHALL MACKEY, PRINCE ALBERT.\nJ. ALFRED DOUGLAS, PRINCE ALBERT.\nGEORGE H. YOUNG, PRINCE ALBERT.\n\nLOSSES CLAIMS:\n\nPRINCE ALBERT.\nFRANK HILL, BARRISTER.\nR. W. NEWLANDS, BARRISTER.\nA. GOODFELLOW, PRINCE ALBERT.\n\nNOTICE:\n\nHaving received notice from Prince Albert, Monday last, that all parties interested in the sale of the said land are invited to purchase or to pay mesne rent for the balance thereof before the 14th February, 1866, now, therefore, having regard to the provisions of Section 32 of the Lands Act of 1866, so far as they affect the present case:\n\nPARTIES HAVING ACCOUNTS OUTPUT\n\nIn pursuance of the order above mentioned, I hereby request all parties interested in the sale of the said land to purchase or pay mesne rent for the balance thereof before the 14th February, 1866, now, therefore, having regard to the provisions of Section 32 of the Lands Act of 1866, so far as they affect the present case:\n\nPARTIES HAVING ACCOUNTS OUTPUT\n\nPRINCE ALBERT AND SONS\nSTERLING SILVER AND NORTEH\n\nStill Selling\n\nTrimmings Hats, Silk Underwear, Woolen and Flannel Socks, Woollen Gloves, Children's Boards and Toys, Apples, Oranges.\n\nMiss Maguire,\n\nPost Office\n\nBOOK STORE\n\nBooks, Stationery, Fancy Goods Accordeons, Violins, Violin fittings.\n\nNEW GOODS!\n\nJust Arrived\n\nE. J. CANN.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, APRIL 2, 1866\n\nOUR LOCAL VOLUNTEERS\n\nOur readers are aware that our volunteers have been called \"Bill of Rights,\" recently submitted to the Government at Ottawa by delegates from the North West, and asked for the establishment of a police force, and we can assure our readers that the Prince Albert Times is in favor of such a measure being taken. We believe that the Prince Albert Volunteers should be left alone by us towards advancing the interests of the settlement, and the satisfaction of our readers' wishes in this matter will be our first concern.\n\nCall and examine before purchasing elsewhere.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTHE PROPOSED MAIL ROUTE CHANGE.\n\nThe discussion now going forward over the proposed mail route change from Qu'Appelle to Prince Albert, has raised a question as to whether the new route will be an improvement over the present one. The proposal is that the mail should be delivered by horseback from Qu'Appelle to Prince Albert via the Red River Valley. This would mean that the mail would have to travel a longer distance than it does now, but proponents argue that the new route would be more efficient and less expensive.\n\nThe idea behind the proposal is to reduce the cost of delivering mail to Prince Albert. Currently, the mail is delivered by train from Regina to Qu'Appelle, and then by horseback to Prince Albert. The proponents of the new route argue that this would save money and time.\n\nThe debate over the proposed route change has been intense, with both sides making strong arguments. Supporters of the new route argue that it would be faster and cheaper, while opponents argue that it would be less reliable and more expensive.\n\nIn conclusion, the proposed mail route change is a complex issue that requires careful consideration. While there are valid arguments on both sides, the decision ultimately rests with the government and the citizens of Saskatchewan.\n\nCOMMUNICATIONS.\n\nREGINA VS. QU'APPELLE.\n\nTo the Editor of The Times:\n\nSir,-I trust the rivalry will not end.\n\nSir,-I believe that two progressive little towns on the C.P.R., Regina and Qu'Appelle, over the proposed change in the mail route, shall not be allowed to settle their differences by force. Albert one way or the other is arriving at a proper conclusion to this important question, and that neither party of sympathy with those who may suffer, or of personal interest in them, who may be injured by the change, shall be permitted to bias their judgment.\n\nLet them not look at the question through the eyes of Regina or Qu'Appelle, but rather consider how Prince Albert will be affected by the change, if such be made, and what it will be worth to him.\n\nWhether we get our mail by Qu'Appelle or Long Lake is not of very great importance to us, but we cannot expect more than a weekly service for a little time to come, but the development of the country, the opening up of new fields of trade, and the consequent closer and more frequent communication between the settlements in the Saskatchewan district, will be of primary importance to the people of Prince Albert. By the proposed route, Prince Albert will be connected with Regina and Long Lake, thus ending out other communications for the present. Prince Albert will be brought into direct connection with the Saskatchewan Branch, thus affording a more profitable field for the sale of trade, and those goods, facilities too which at present are almost as hard to reach by mail as the north pole, would be within easy reach.\n\nThe proposed route change would mean that the mail would be delivered by horseback from Qu'Appelle to Prince Albert via the Red River Valley. This would mean that the mail would have to travel a longer distance than it does now, but proponents argue that the new route would be more efficient and less expensive.\n\nThe debate over the proposed route change has been intense, with both sides making strong arguments. Supporters of the new route argue that it would be faster and cheaper, while opponents argue that it would be less reliable and more expensive.\n\nIn conclusion, the proposed mail route change is a complex issue that requires careful consideration. While there are valid arguments on both sides, the decision ultimately rests with the government and the citizens of Saskatchewan.\n\nSEED GRAIN.\n\nThe seed grain has almost all been threshed and is being distributed to settlers according to the mill's instructions, giving each an average of about forty bushels of grain. Some settlers that applied for large quantities are still disappointed as they believe that even at the present time the amount they apply for, so as to be ready at the most critical moment when the spring comes to commence seeding operations. Mr. Rogers intends to make a second distribution about the first of May, when he hopes that all the settlers regularly申请的种子将会有申请，而任何数量的种子将被分配给那些已经申请了超过四十个谷物的。\n\nThe seed grain has almost all been threshed and is being distributed to settlers according to the mill's instructions, giving each an average of about forty bushels of grain. Some settlers that applied for large quantities are still disappointed as they believe that even at the present time the amount they apply for, so as to be ready at the most critical moment when the spring comes to commence seeding operations. Mr. Rogers intends to make a second distribution about the first of May, when he hopes that all the settlers regularly申请的种子将会有申请，而任何数量的种子将被分配给那些已经申请了超过四十个谷物的。\nGENERAL NEWS.\n\nThe Manitoba & Northwestern Railway are making preparations for a large number of immigrants who are expected to arrive in Winnipeg during the coming season. They intend erecting an immigrant building at Riel's Point, where they will be properly provided for.\n\nIn previous issues of Ottawa, Mr. A.W. Ross is paying special attention to Northwest matters, regarding which he has placed a number of questions and answers in his paper.\n\nHon. Thomas Walter intends making another visit to the Northwest this year and will call on Sir John Macdonald when on the latter occasion he was unable to reach. It is certainly Mr. Walter's intention to give special attention to regard to the wants and requirements of the vast Northwest country, and that he will do so is evident from the interest he has already shown in the subject.\n\nThe Chamber of Commerce, the most prominent body in the city of Kingston, has petitioned the Governor-General to support the Canadian Pacific Railway Company, in view of the opinions of the great public in the political and commercial interests of Great Britain and the Empire to Australia via the North-West. The Canadian Pacific appear to have confidence in Canadian enterprise, for they are confident of obtaining the contract for the line to our midst to accomplish their purpose.\n\nThe volunteers' medals have arrived and will be presented to those who before the present session had been in the service of the regiment, with his rank and pay, having been engaged in the war. The medal will be presented by Mr. John Francis Ryan, gunner of No. 2 Battery, who was wounded in the recent engagement near the Northwood during the campaign, which settled on his lungs.\n\nCapt. Fowles, of the Seventh Fusiliers, received a wound in the right arm, while he was engaged in some operation of ammunition incurred in the Northwood engagement.\n\nThe Evening Journal has a special from Washington, which says: \"President Arthur's health has completely recovered from the effects of the cold weather.\"\n\nMr. Ross who is taking charge of the hospital at Fort Garry, Mr. Macdonald's absence, will ask of the proper authorities that the hospital will be purchased, and if a purchase cannot be made, he will see that the hospital is kept up. He also said that a hospital would be established in the Northwood.\n\nThe average importation of horses from Canada into the United States has been about 22,000 per year for several years past. The average price per horse imported was $65, whereas last year it was $149. This shows not only a rapid improvement in the quality of the supply, but the fact that the market is now so good that many are willing to pay more than past, and, in many cases, even equal to the price paid for the better class of animals. The difference in Canada, represented in these values, is said (October 27) to be $84.\n\nDelegates from the Winnipeg, St. Paul and Minneapolis boat clubs met at the Hotel Royal today and decided to establish a new club called the \"Minnesota and Winnipeg Amateur Rowing Association.\" The first regatta will be held next spring between Winnipeg and Minneapolis, July 1st. E.W. Van Allen, of Winnipeg, presided at the meeting. The plan, that this became was of an informal nature, and it will probably not be adopted until next season.\n\nCROWFOOT'S THANKS.\n\nFrom the Winnipeg Free Press.\n\nThe following letter was sent by Crowfoot, the Blackfoot Chief, to Mr. Van Horne, General Manager of the Canadian Pacific Railway, acknowledging the receipt of a report prepared over the line. The reference to the \"shame and disgrace\" is explained by the fact that the gun was found hanging from a frame with a glass over it, and a chain attached whereby to hang it around his neck.\n\nSAHA PAHA NOON,\n\n20 November, 1886.\n\nIstamakasahas, W.C. Van Horne.\n\nIt is a sad matter indeed, but am anxious to know what has been done to prevent such things from happening again.\n\nJ. L. JOHNSON & CO.,\nHardware,\nTinware,\nGroceries.\n\nBoss Churns!\n\nNB—The DOMINION LANTERN—Latest and best improved, at\n\nJ.L. JOHNSON & CO.'S.\n\n1886 SPRING SEASON 1886\n\nWM. STOBART & CO.\n\nHaving received a full assortment of STAPLE and FANCY\n\nDry Goods,\nGroceries, etc.\n\nWe beg to call the attention of our customers and the public to our fine new stock, now mostly completed.\n\nBusiness now being under new management, the public will receive its best attention, and we will endeavor to keep on hand the requirements of our customers.\n\nYour inspection is solicited.\n\nWM. STOBART & CO.,\n\n1879.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF\n\nDomestic and Imported Cigars\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlor de los Benitos,\nCreme de la Creme,\nBelle Cuba,\nHenry Clays and Wagner.\n\nALL CHOICE GOODS AND SEASONED.\n\nBETTS & Gwynne.\n\nExamine Our Stock of Amos Confectionery and Biscuits.\n\nIMPORTANT NOTICE.\n\nOUR MOTTO:\n\nSmall Profits, Quick Sales and No Credits.\n\nJust received, all kinds of Men's, Women's, Minors and Children's Boots and Shoes, Rubbers, etc., etc.,\n\nOF ALL STYLES AND SIZES.\n\nWe cannot find time to do more than announce that every kind of every description in the store is A1, and made by the best manufacturers in America or Europe. We have a large assortment of boots and shoes, ready to try on, by advising their friends to come and see themselves. They are neat and are both cheap and good. Remember the fact, that our prices are so small that we cannot afford to make any mistake, and they will be returned. We have a special offer for boots and shoes.\n\nSHANNON & McLEOD.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886040201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3262, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2079, 1], [2079, 3293, 2], [3293, 8125, 3], [8125, 13666, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]