[{"id": "724c00dc791cebbec73b680b6db40f26ef6e6c85", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, JUNE 30, 1893.\n\n$2.50 A YEAR.\n\nAuction Sale of Valuable Property. Canadian North West Territories\n\nIn the Saskatchewan District (XIIIth Division)\n\nThursday, July 12th, 1894.\n\nMarkley & Orr, Hugh J. Montgomery\n\nReal Estate Agent\n\nBanking House\n\nof Macarthur & Knowles, Prince Albert, N.W.T.\n\nTransact a General Banking Business.\nInterest Available on Deposits.\n\nBranch Office, Prince Albert, N.W.T.\n\nBankers' Hall\n\nPRINCE ALBERT, N.W.T.\n\nBANKERS' Hall, Exchange Place\n\nADVERTISING\n\nThe Comedy Club and Dance Halls\n\nPRINCE ALBERT, N.W.T.\n\nItems of Interest\n\nPrayer meeting of the Friends at the Corner of Main Street and McLeod Avenue; Mr. Norman Bailey presiding.\n\nFor more details about this event or any other matters, please contact the Friends' office located at 123 Main Street.\n\nPRINCE ALBERT, N.W.T.\n\nMINISTERS AND MERCHANTS\n\nAsh & Robbins\n\nconsumption\n\nPossibly cured.\n\nAsh & Robbins, 300 Fulton St., Brooklyn, N.Y.\n\nCONSUMPTION\n\nAsh & Robbins, 300 Fulton St., Brooklyn, N.Y.\n\nASH & ROBBINS\n\nGeneral Merchandise\n\nAsh & Robbins, 300 Fulton St., Brooklyn, N.Y.\nIndian Schools.\n\nThe Prince Albert Times\n\nWednesday, June 20, 1883\n\nIndian schools have been opened at Prince Albert, which is to be expanded in erecting schools for the Indian children of the North West. Sir Hector Langevin expects to secure the attendance of thirty children at the opening of each of these schools. Two are to be located at Qu'Appelle and one at Battleford, the one at Battleford being Protestant, the others Catholic. The sum of $1,000 is set aside for the amount of rent, salary to be paid to each school and a further sum of $5,000 has been granted each for boarding and other expenses. What may be the exact nature of the system to be introduced has not been definitely explained, but it will be the intention of the Government to commence huge boarding schools for the education of the embryo red man. If so the people will naturally object to paying for the education of non-national schools. That the present system of Indian schools has been a failure is owing more to the manner in which it has been carried out than to the system itself. The treaties made with the various tribes bind the Government to establish schools for the education of Indian children on the various reserves. In the absence of all specific conditions as to the qualifications of the teachers to be employed, it is generally understood that the Government will employ competent men to manage these schools, but as they offer a salary of about three hundred dollars per annum, the result has been practically a dead letter except in such reserves as have received the benefit of assistance from one or other of the various missionary societies who have visited them. No comparison has been made to induce attendance, and the consequence has been that even in the few schools which have been established, the efforts of the teachers have been wholly in vain. The sum of money which has been applied to Mr. Beaudry's schools would have gone very far to perfect the various schools on the different reserves and would not have left the Lord's treasury open to the suspicion of having some more personal object in view than that of the education of Indian youth. It would also have been beneficial to the larger number of the Indians than the present system can ever be expected to reach. The children could have been taught some occupation during their course and would have been a well fitted to fight their way through life by the average youth in any part of the Dominion. But the education of \"my Indians,\" as our egotistical Government calls them, is just now receiving an amount of attention at the hands of Mr. Beaudry which the Reform press afraid that an experienced man might not think it was beneath his dignity to wield the buck over the children of the mighty Chief Pape especially if the situation had an attachment of $5,000 per annum.\n\nThe Land Sale.\n\nThe excitement in Manitoba over the great land sale is intense. The press, independent of political connection, condemn the sale in no measured terms and many expect that bloodshed will be the result of any attempt to drive the Indians from their homes. The sale itself was an utter failure, netting very little more than enough to pay expenses. An inspector was sent by the Government to examine the lands and report upon the improvements made and length of time of settlement that each settler had completed, and this inspector is charged with favoring those settlers who are friendly to the Government and discouraging those who are otherwise disposed. Two men at Wabasso are cited as a case in point. One of these having resided on his claim for a short time and made a substantial improvement, the other felt that he too had resided almost continuously on his and made considerable improvements. At the time of the inspector's visit both of these men were absent, the former at work in the field, the latter in Ontario bringing up stock and implements for his farm, yet the former is to be allowed a homestead entry, the latter has been forced to take his farm. Three classes of settlers are being badly suffered by the grievous wrong by the Government, the first being those who set on the lands previous to their withdrawal from homestead entry, some of whom are being deprived of their homes. There are also those who settled an advance of the C. P. R. construction on lands not contained within the \"mile limit\" as the railway was located at that time, subsequently settling on and at last purchasing or buying the land, altered and many of these settlers are now to be deprived of their homes because they are within the mile limit of the railway as now located. Those who managed at the time the order was passed and who consequently knew nothing of it, but who nevertheless located on land in good faith and without knowledge of the new element during these two years, in many cases have sacrificed to the end of filthy lucre by a government who already have an overflowing treasury. Altogether the transaction only one more than three sets which have bought the homesteads of our North West lands and reflects no credit either upon the Government, the inspector or the legislative body. Many of the settlers are suffering, and those who are included, sold and when full payment come to hand it is expected that many will have been in entire ignorance of the sale until some time after the sale was advertised and proclaimed and been sold. Another sale is shortly to be held, when we may expect just such another outbreak of popular feeling. In some places the settlers threaten bloodshed rather than be deprived of their homes in order that the land holder may have \"superior possession\" of their lands. The stubbornness of the Marquisian Government did much to prevent the sale, although the actual sale takes place to take place in this country, but the present law and the manner in which they are administered are a constant hindrance to those in the west who have done their duty and have purchased the unclaimed and ruined lands of the settlers. Settler leagues are formed in several of the disaffected districts and these districts outside of Southern Manitoba are now making a stand. We look for trouble in the future and endeavor to remedy the evil which already exists as well as prevent the introduction of the marquisian land laws. Speaking generally speaking the Government's sale has subjected our fellow settlers to the south of this State been subjected.\n\nMAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers Northcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing 20 lbs Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes Baskets etc., etc\n\nSTEWARD & WOOTTON\nThe Royal Baker and Pastry Cook.\n\nA royal addition to the kitchen library. It contains over two hundred recipes pertaining to every department of the art, including baking, confectionery, preserving, cakes, sauces, puddings, pastries, and all kinds of confections, including the making of chocolate, coffee, tea, and other beverages, and all other necessary knowledge for the cook, confectioner, and pastry cook. It will be found invaluable for the modest housewife, who desires to prepare her food and make her own bread and cakes in a simple and economical way. Each recipe is given full and explicit directions for preparing together with accompanying sketches, drawings, and photographs, so that even the novice can go through the operations with success, while a special chapter is devoted to the art of making soups and broths, as well as the preparation of all kinds of food and delicacies for the sick. The book has been prepared under the personal supervision of Prof. Eichmann, head of the New York Cooking School, and is the most valuable of its kind ever issued on the subject of cooking. It is now ready for publication. It is bound up in the highest style of leather, printed on fine paper with elaborate illustrations throughout. We are assured that every copy of the \"Royal Baking Powder\" contains an order for one of these valuable books.\n\nNo Wonder He Couldn't Find It.\n\nWell, sir, the paper goes again,\" exclaimed Colonel Mowbray, after a few weeks since I had a chance to read that paper, and unless there is a return soon somebody's going to be very uncomfortable. Sarah,\" to the colonel's ear, \"I have just seen something in the morning paper.\"\n\n\"What paper, boss?\"\n\nThe paper that's thrown on the gallery every morning.\n\n\"I see, sir, what are you doing there this morning?\" observed a gentleman to his neighbour.\n\n\"I'm doing some tricks.\"\n\n\"Give me a little evidence of your ability,\" said the gentleman.\n\nHaving been requested, I had identified the cards in their magical style and performed some very clever work with them. The person who dropped the character into the mix, landed, and was killed.\n\n\"Jim, you are quite a juggler.\"\n\n\"Oh, no, massa, I am only a negro man.\"\n\nRecommended for Wrestling, Temptation.\n\nAnother long-ago tale has been discovered, but strange to say, the gentleman who saw it did not adhere to the conventional rules.\n\n\"And you say that the snake did not roll after you,\" said a man when the hoop was thrown at him.\n\n\"No, he did not roll after me.\"\n\n\"You didn't jump behind a tree, then jump out as the snake struck at you?\"\n\n\"No, sir.\"\n\n\"And the horse on the tree did not suffer and die within two hours?\"\n\n\"No, sir.\"\n\n\"My friend, here is a $20 gold piece. A man who can defy temptation, as you have done, deserves a reward. You shall be rewarded.\"—Arabian Traveler.\n\nSuddenly Taken from Life.\n\n\"How was your, Mister Lippenstein?\" said a man, who was pandering to the feelings of the guide, who was deathly pale.\n\n\"There you have your health, Schloke. But wasn't that thing?\"\n\n\"Yes,\" said the guide, scratching his head, and the other, drawing an unexplained pledge across his eyes.\n\n\"Excuse me, my dear Schloke, how was it?\"\n\n\"Well, you see, Moses, it occurred in the night. I think it was Schloke who was doing something.\"\n\nSpring Summer Goods.\n\nAnd is prepared to supply his customers with:\n\nSuits to please the fancy of all.\n\nJust received a large stock of:\n\nUNDERCLOTHING\n\nA fresh supply of stylish:\n\nSoft and Hard Felt Hats\n\nGive me a call.\n\nJ. Sinclair\n\nWalter's\n\nThe Prince Albert Times\n\nAND\n\nSaskatchewan Review.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 per annum.\n\n\"The Times\" contains all original matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your advertisement read by all.\n\nReplete with local and general news.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\n\nBill Heads,\n\nEnvelopes,\n\nCirculars,\n\nDodgers,\n\nBusiness Cards,\n\nLegal Printing,\n\nPamphlets,\n\nEtc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETTY,\n\nProprietors,\n\nRiver Street,\n\nPrince Albert\nMAKE HOME HAPPY.\n\nHow to Make the Children, and Make Them Love Their Mama.\n\nInvent every possible amusement to keep them busy and happy at home. Never miss the opportunity to take pictures, coats, hats and boots. Never mind if they do make a mess around you, with their clothes and toys. You would think again if we could have a vision of the young ones going out together, dressed in their Sunday best, playing in the snow, laughing and enjoying themselves. The influence of a bright smile is more powerful than any other. The circle formed by casting a stone into the water, if gone on and on through a man's life, would show how much worldly pleasures may weaken the remembrance for a time, but each touch upon the heart would bring back the image of the old man, and his face, his voice, and his loving words will come up before him like a revelation. The time will come when you will think that you will give the world to have your house surrounded by the dear hands of those very boys who now play with you, and who will step in the hall, and their rude cheeks laid up to yours; when you would rather have them there than all the paintings of Thomas or the songs of Nilsson; when you would gladly dirty carpets, ave, live without a cent to eat, but have them there, right, strong, dear hands beside you once more. Then play with and pet them. Praise their drawings, Betty's music and baby stories, and Dick's inventions. Encourage Tom to chop off his stick of wood, and Dick to persevere in making his toy boat. Tell him about the great figures, tell him he is your famous mathematician; and if another loves geography, tell him he must be sure to make a good spelling bee in a short minute. Go with them to see their young rabbits and chickens and pigeons, and down to the creek to see their favorite fishing operation. Have them gather your mosses and grasses and bright autumn leaves, and tell them that the snow is over all the earth. And you will keep yourself young and fresh by entering into their games.\n\nHome life is the sure test of character. Let a husband be cowardly and shy, and he will grow cold and unmanly. The children will feel the effect of his timidity and young bears. The failure becomes callous, cowardly, hard, kind of two-legged brutes with, however, a certain amount of self-defense. They develop an unnatural growth and sharpness of teeth, and the result is a hideous ugly face and a hideous brow. This is what the family circle should be. If one must be rude to any, let it be so that one can do nothing worse than laugh at the rude one. Let one of the loved ones be taken away, and memory recalls a thousand sayings on regret, and the soul writhes and suffers painfully. The grave cannot hide the white faces of those who sleep. The coffin is closed, and the soul goes to its rest. They draw us farther than we would go. They force us to remember a man never seen except in death. His looks are those of a wife or mother's grave. His eyes glisten wondrous clear, and in his deathbed he beholds what is to be lost, and he bemoans it. He is not the lord of the feelings of the loved. It is a pitiable picture of human weakness when those we love are treated worst.\n\nA lesson to a boy.\n\nGet away from school a little while every day, my boy. Stand one side and let the world run by while you get acquainted with yourself, and see what kind of a fellow you are. You have had questions about yourself; find out all you can about yourself. Ascertain from your parents whether you are the manner of a man; people say you are, find out if you are always honest; if you are always truthful; if you are always decent; if your life is as good and upright at 11 o'clock at night as it is at noon; if you are as anxious to do your own work as you are to do a Sunday school picnic if you are as good a boy when you go to Church as you are at home; if you are as good a boy as the sort of young man your father hopes you are, your mother says you are, and your grandmother says you are. Get on intimate terms with yourself, my boy, and believe me, every time you come out from under your father's roof, you will be a stronger, better, prouder man than you forget this, Telamonian, and it will do you good.\n\nA moving spectacle. A load of farm tools. Not a bit of material value. The chamberlain. A stupid ignorant man is generally regarded.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweler.\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\nPiano Manufacturers,\n117 KING - ST. WEST,\nNEXT ROSSIN HOUSE,\nTORONTO, - - ONT.\nPianos to Suit the Climate of the North West.\nALL MADE OF THE BEST MATERIAL\nAND FINISHED IN FIRST-CLASS STYLE.\nFIRST PRIZE WHEREVER EXHIBITED.\nNEW PATENT BRIDGES.\nNone but First-class Workmen Employed in their Manufacture.\nAPPLY AT\n\"The Times\" Office,\nPRINCE ALBERT - - N. W. T.\nONLY A BOY.\n\nWritten by Mr. MacKenzie of the Toronto Evening Telegram.\n\nThe following story appeared in the Toronto Evening Telegram:\n\nThere was once a boy who lived in a small village. He was very poor and had no friends. One day, while he was playing outside, he heard a loud noise coming from inside his house. He rushed inside and found his mother lying on the floor, unconscious. The boy knew what to do. He quickly got up and started running towards the nearest town. He arrived there just in time to see a doctor arrive at the scene. The doctor examined the woman and declared her dead. The boy then returned home and told everyone about what had happened. From that day on, the boy became known as the \"Hero of the Village.\"\n\nPRINCE ALBERT\n\nUNIVERSITY OF SASKATCHEWAN\n\nBefore going to England, His Lordship the Bishop of Saskatchewan had a petition drawn up and signed by himself and several prominent citizens of the province. This petition asks for the establishment of the University of Saskatchewan. The Bishop has written to the Prime Minister of Canada, asking him to consider the petition. The Bishop has also written to the Governor General, requesting him to give the matter his attention.\n\nBOOT & SHOE STORE.\n\nJUST RECEIVED another lot of boots with the greatest variety and best value in Prince Albert.\n\nBoots & Shoes Cheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nHUDSON'S BAY COY.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 5,000,000 acres in the Great Ferri Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynn, Rat Range, Portage la Prairie and Godden, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC.J. BRIDGES, Land Commissioner.\n\nBOOTS AND SHOES.\n\nShannon & McLeod,\n\nBoot and Shoemakers.\n\nA. L. ASHDOWN,\n\nDEALER IN\n\nGroceries and Provisions.\n\nPRINCE ALBERT, S.W.T.\n\nTO THE LADIES.\n\nNEW Spring & Summer Goods\n\nJUST RECEIVED BY EXPRESS\n\nMilinery, Ladies' and Childrens' Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO.,\n\nCAMPBELL'S BLOCK,\n\nRIVER STREET.\n\nPRINCE ALBERT\n\nReal Estate\n\nFOR SALE A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY SITUATED IN PRINCE ALBERT\n\nAnd suitable for business purposes or private residences. For further particulars apply by letter or otherwise to the undersigned.\n\nC. MAIR,\n\nP.O. DRAWER K,\n\nPrince Albert, N.W.T.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Cutter Runners, Shafts and Tongues for sale.\n\nAnd a variety of other articles required by farmers, in first-class Blacksmith Shop.\n\nMiss Mack & Co.,\n\nCampbell's Block,\n\nRiver Street.\n\nPRINCE ALBERT\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT\n\nLivery & Sale Stables,\n\nNo. 1 Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nWe will supply the arrival of any regular passenger train to passengers at any part of the route.\n\nS. J. DONALDSON, Prop.\nMAHAFFY AND CLINKSKILL General Supplies\n\nAnd are offering the same at very low prices.\n\nThe Stock is large and well assorted. The prices are such as to give universal satisfaction. An early visit is recommended, as the choice lots are being rapidly sold out.\n\nStand--Next Post Office,\nIn Front of McKay's Mill.\n\n1879. 1883\n\nBUFFALO HALL\n\nNo Shoddy Goods\n\nNo Shoddy Prices\n\nBETTS & Gwynne.\n\nGENTS' IF YOU WANT\n\nSummer Straw Hats, Dress Shirts, Ties, Suspenders, Hose, Underclothing,\n\nStylish Suits of Clothing in great variety.\n\nCALL AT THE HORSE SHOE STORE.\nRIVER STREET.\n\nAll and every kind of goods at Reduced Prices.\n\nTHOS. O. DAVIS.\n\nT. N. Campbell,\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert -- N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883062001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 4990, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1149, 1], [1149, 8041, 2], [8041, 12090, 3], [12090, 16898, 4], [16898, 20240, 5], [20240, 21134, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]