[{"id": "04b1d3df558a1c30f4a8bfe2cc96aeb2395a8747", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nTHE MUNICIPALITY ORDINANCE\n\nWe have now an opportunity to make a somewhat hasty report of the bill which was passed at the recent meeting of the North West Council in regard to the incorporation of a new municipality. It is a matter of vital importance to this community, we give our readers a synopsis of its principal provisions:\n\n1. The municipality will consist of two townships, each containing not less than five hundred acres of land, making a total area of one thousand acres.\n\n2. The municipality will be known as \"Prince Albert.\"\n\n3. The municipality will be governed by a council consisting of three members elected by the voters.\n\n4. The municipality will levy taxes to provide for the maintenance of roads, bridges, and other public works.\n\n5. The municipality will be responsible for the care of the poor and the maintenance of a hospital.\n\n6. The municipality will be entitled to receive grants from the Dominion government for the construction of public buildings.\n\n7. The municipality will be subject to the jurisdiction of the North West Council.\n\nThe ordinance will be submitted to the Legislative Assembly for approval.\n\nNO IRISH NEED APPLY\n\nCHARITY.\n\nTo the Editor of The Times,\n\nSir,-A person who is without means or property, who has been reduced to the necessity of begging, and who is unable to earn his living by honest labor, should be encouraged to seek charity. The poor are entitled to assistance from those who are able to give it.\n\nD. J. MAGUIRE.\n\nPrince Albert District, N.W.T.\nOctober 31, 1883.\n\nNOTICE.\n\nMr. George Cassie,\nwill act as my agent.\n\nG. T. BROWN\n\nKILVERT & DUGGAN\nSolictors for Appointments\n\nFURNITURE\n\nJust arrived. In addition to our former stock, we have received:\n\nFancy Parlor and Bedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\nChairs of nearly all descriptions.\n\nCradles & Cribs for the Babies.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\n\nSaskatchewan.\n\nGeneral Merchants.\n\nSTEWART & WOOTTON\n\nWholesale and Retail.\n\nPrince Albert.\nDIED IN THE FAITH.\n\nThe Prophet of a Life in Which There Was No Room for Doubt and No Sunshine.\n\nWhen the meeting was over, the Lord said to me, \"Go back to your home and tell your family about the death of Uncle Daniel.\" I went back to my home and told my family about Uncle Daniel's death. They were very sad and cried. I knew that Uncle Daniel had died in the faith.\n\nNEW FALL AND WINTER MILLINERY.\n\nLADIES' DOLMANS AND CLOAKS.\n\nFur Caps and Muff.\n\nWool Goods.\n\nLadies and Children General Furnishings.\n\nMISS MACK & CO., CAMPERELL'S BLOCK, PRINCE ALBERT.\n\nWALTERS AND BAKER, General Merchants.\n\nPrince Albert, Baltoche's Lorraine Patrick, D.L.S.\n\nTimber Limits Surveyed and all kinds of surveying done at short rates.\n\nGovernment House, Prince Albert, N.W.T.\n\nFARMERS ATTENTION!\n\nFarmers, Attention! A Harvey Smith has been engaged to make a survey of the land near Rossin House.\n\nBrantford Reapers, Brantford Mowers and Rakes, Snowball and Spelt Wagons, Stubble and Grass Plows.\n\nA Large Stock of R. J. Smith's 20 Brantford Card Binders.\n\nS. W. VANLEUEN, Pita, Philipps, P. Hall, Siskins.\n\nASH & ROBBINS, CONSUMPTION Positively Cured.\n\nJUST RECEIVED.\n\nSteel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and other Harness, Shafts and Tires for sale.\n\nCHESTER THOMPSON, PRINCE ALBERT.\n\nReal Estate\n\nFOR SALE: A NUMBER OF CHOICE BUILDING LOTS.\n\nPRINCE ALBERT.\n\nC. MAIR, P.O. DRAWER 1, PRINCE ALBERT.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\nBEATEN AT HIS OWN GAME.\n\nThe local article of confidence man is quite mysterious in his way, but hardly yet, to the astonishment of the scientific members of the fraternity was rapidly arriving from New York and Chicago to gather in the country visitor crop.\n\nLast Wednesday, as the overnight train was disgorging its passengers in the Union depot, a pale and looking young man walked into the gray coat storekeeper who was staring open-mouthed around him, and clasped him fervently by the hand.\n\n\"Why, why do you do, Mr. Goffy?\"\n\n\"I thought you knew my name was Goffy,\" said the delegate from the foothills, who immediately and distinctly obtruded that \"Jas. Goffy, Vaish,\" was painted in big letters on the valise he carried in his hand.\n\n\"Well, Jas., old man, you can't have forgotten me, Mr. Sanders—your old friend. How are all the boys in Idaho?\"\n\n\"Think you see yer, glad yer see yer. I've got a present for yer bad memory, but seeing as how yer here, yer may have somethin', and the gangster.\"\n\n\"Of course you do. Coming down for a little look at the old sights. I'm going to pay you a visit. I'll see you after dinner, and we'll take a walk on the valley together. Here's my address.\"\n\n\"Thank you, thank you, my boy,\" and the hayseed party much affected. \"There's the first kind words I've heard since Left home, and, with the most natural of his simple, hearty manner, took the young man in his arms and hugged him. Then, going where to meet later, he shuffled along.\n\nThat afternoon the plausible young man was down at headquarters complaining that his watch had been robbed of its watch and pocketed by a \"bootlegger\" up as an old granger.\n\n\"There wasn't nothing particular in them, but they was worth something,\" explained, \"and the watch was cruel, but I'm blessed if I want to be beat at my own game.\" Pooh!\n\nPROSPECTUS OF THE Prince Albert Directory AND BUSINESS GUIDE.\n\nIt is proposed to issue a Business Directory for the Town of Prince Albert and Districts of Lloyd and Lorne which will contain the advertisements of each business establishment, (to be in serial order at separate rate) and a descriptive notice of each place.\n\nThe prospectus will contain a history of Prince Albert, its present condition and future prospects, together with a statement of this year's crops, etc., so that they can be accounted for the District of Lorne, extent of acreage, number of cattle, sheep, etc., increase over last year's crop, population of District, and other useful information, written by well known writers.\n\nAbout 500 or more copies will be published according to the encouragement received, and distributed throughout the Dominion and the Mother Country.\n\nIt is hoped that by this means, benefits will result, not only to each individual advertiser and subscriber, but that the whole country will benefit thereby and appreciate what has been done abroad and a healthy emigration encouraged to this country.\n\nPrice of advertisement, whole page, with notice on opposite page, $10; two copies gratis. Single copies, 50c.\n\nSaskatchewan District Court.\n\nDIVISION NO. TWO.\n\nThe office of the Clerk of the Court has been removed to the new building nearly opposite Thos. McKay's mills, River street. Office hours from 9 a.m. to 4 p.m., on Tuesdays and Fridays.\n\nJOSEPH FINLAYSON,\nClerk of the Court.\n\nMEDICAL HALL. BLACKSMITH'S SHOP.\n\nT. E. JACKSON,\n\nChemist of Drugs.\n\nHas on hand large supply of Drugs, Chemicals, Dye Staffs, Spices, Druggist's Sundries, Perfumery, Toilet Articles, Sponges, Patent Medicines.\n\nT. E. JACKSON,\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nA. T. Campbell's New Store\n\nLARGE STOCK OF Watches, Clocks and Jewellery.\n\nKEPT CONSTANTLY ON HAND\n\nWatches, Clocks, Jewellery, and Stationery.\n\nJoseph Rogers & Sons, Cutlers,\n\nWatchmakers, Jewelers.\n\nEverything warranted as represented.\n\nGUARANTEED TO BE THE BEST.\n\nAnnual Income, over $1,000,000.\n\nCapital & Funds, nearly $6,000,000.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance COMPANY\n\nESTABLISHED 1867\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nA. SPROAT,\n\nAgent.\n\nPrince Albert District, N.W.T.\n\nDr. A. Stackhouse,\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nRead This\n\nONLY\n\n$3.50\n\nFOR $3.50\n\nTHE WEEKLY GLOBE\n\nSPINK & MAVETY,\n\nPRINTER,\n\nRIVER STREET,\n\nPRINCE ALBERT\nBONANZA!\nStill on the War Path\n\nWith a larger line of goods\nAnd slaughtering the prices.\n\nDry Goods and Novelties!\n\nIncluding a large line of\nNovelty Goods, Ladies' Jewelry, and\nSewing Books, Ladies' Books, and\nJerseys, Handkerchiefs, Laces, Silk\nStockings, Umbrellas, Umbrella\nSpecials, Blouses, Pants, Gingham,\nWiney's White and Colored Flannel,\nHosiery, Knit Goods, Ladies' Underwear,\nClothing, For Caps and Overcoats,\nGloves, Hats, Scarfs, Shawls, Bonnets,\nBoots, Shoes, Hosiery, etc.\n\nJ. M. CAMPBELL.\nO. E. HUGHES\n& CO.,\nGeneral Merchants\nAND\nIndian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nJAMES SINCLAIR,\nMerchant Tailor,\n\nHas just received his new stock of\nFall and Winter Goods,\nAnd is prepared to supply his numerous\ncustomers with\nSuits to please the fancy of all.\n\nAlso a large stock of\nUNDERCLOTHING\n\nA Large Assortment of\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\nEast End Bakery\n\nEight Leaves for $1.\n\nTakes and Pastry Made to Order\n\nHUGH MCDougall\nEast End Bakery:\n\nTHE CABLE HOUSE,\nTHE BEST\nBEER AND CIGARS\n\nOf the finest brands always on hand.\nWHOLESALE AND RETAIL\n\nJOHN WYMBERSKICH, Prop.\n\nCOAL OIL.\n\n500 GALLONS,\nAMERICAN AND CANADIAN.\n\nAT\nJ. L. JOHNSON & CO.'S.\n\nN.B. — We sell by Imperial Measure. You get one-fifth more by buying Imperial Measure. Test it by the weight.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS FOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 3,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\nTOWN LOTS FOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Bochon, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRYDELL, Land Commissioner.\n\nPrince Albert Bakery.\n\n2LB LOAF, 12C.\n9 LOAVES, 1S.\n\nCakes and Pastry always on hand and made to order.\n\nWM. R. BELL.\nNOTICE.\n\nJUST ARRIVED\n100 HORSES\nCONSISTING OF\nWORK, SADDLE AND\nBROOD MARES.\n\nPurchasing, express and passengers\nline from Gabriel's Crossing to Troy\nand back.\n\nPH. GARNOT.\nAgent (Gabriel's Crossing, South Branch)\n\nTRESTON HOUSE\nBest Billiard Hall west of Winnipeg\n\nFIRST CLASS\nPOOL & CAROM TABLES\n\nWM. BURKE, Prop.\nKNOX & BARKER\n\nBeg respectfully to announce that they have removed to their new workshop near the Presbyterian Church, and are in a position to fill all orders entrusted to them. All work of carpenter and cabinet work promptly attended to. Plans and estimates furnished. Satisfaction guaranteed. Office & workshop near the Presbyterian Church.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nFresh News.\n\nO. H. Hughes & Co., have driven in 25 new wagons from their yard. They have been out and can now supply beef at very reasonable rates, by the quarter or otherwise.\n\nAppointments.\n\nThe Board of Commissioners has appointed the Rev. John Hardwick, his late chaplain, Chaplain-in-Chief, in England, to become Secretary-Chaplain of the Province of Saskatchewan.\n\nGrand Views.\n\nIt is stated that the Department of the Interior will shortly make an effort to settle all the old settlers claims against the Government, but it is not known when the final settlement will be made. A good deal of correspondence has been exchanged in this connection. It was thought that the settlement would be made last fall, but Mr. Lindsay Russell finally adjourned them last summer, but that government officials have been unable to settle the matter. We are told that Mr. Lindsay Russell is still unable to settle the matter. We are told that Mr. Lindsay Russell is still unable to settle the matter.\n\nArrival of the New Governor-General.\n\nThe Marquis of Lorne, the new Governor-General of the Dominion, will arrive here early next week. He will be received by His Excellency the Governor-General of Canada and after having been sworn in by Lord Lorne in the presence of the Cabinet, Mr. Macdonald, the Prime Minister, will preside over the Court, proceeded by special train to Ottawa where they were officially received by the Governor-General. The Marquis of Lorne will be sworn into office on December 1st.\n\nChanges in the Cabinet.\n\nAs the new Governor-General, Sir John Macdonald has resigned the Ministry of the Interior. He was succeeded by Hon. Senator McPherson. The Ministry of the Interior will now be under the supervision of the Indian and Police Departments. Hon. Senator McPherson was for the last few months the Minister practically acting as Minister of the Interior has been sworn in as Minister of the Interior. He will be sworn into office from the Speakership of the Senate and which position Senator Miller of Nova Scotia holds. Hon. Senator McPherson is one of the ablest debaters and one of the most powerful speakers in the Senate. He has been a member of the Senate for many years and has been a great friend of the government since Confederation. We are glad to see him in the Senate again and we hope he will continue to serve the country.\n\nThe Recreation Rooms.\n\nThe recreation rooms of the rooms of the club, in the building, will take place this evening, and at the same time the opening address will be given by the Secretary. The Committee have prepared a literary and musical programme, comprising readings, songs, and music. The programme will be a large success and a good collection will be taken up towards the upkeep of the club. There are great advantages in joining the club and we urge all who are interested to join.\n\nThe Women's Work.\n\nThe Women's Work is doing good work. The ladies, who are members of the club, are engaged in various charitable works. They are doing good work and we urge all members to join.\n\nThe Regina Leader.\n\nThe Regina Leader is doing good work. The paper is doing good work and we urge all members to join.\n\nFacts!\n\nBUFFALO HALL\n\nFall and Winter Stock\n\nCOMPLETE IN\n\nDry Goods, Clothing,\n\nGroceries and\n\nProvisions,\n\nWHICH MUST BE SOLD,\n\n100 TONS OF CANADIAN\n\nShort Clear Bacon,\n\nHead Light Coal Oil.\n\nREMEMBER,\n\nBETTS & Gwynne.\n\nCITY AUCTION MART\n\nMARKLEY & ORR,\n\nReal Estate and General Auctioneers.\n\nKNOX & BARKER,\n\nHugh J. Montgomery,\n\nReal Estate Agent,\n\nAuctioneer, Etc.\n\nOFFICE AND WORKSHOP,\n\nNear Presbyterian Church.\n\nMANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\nTHE LARGEST PAPER IN CANADA!\n\nTHREE MONTHS FREE.\n\nThree Handsome Cash Prizes\n\nof $500-$300-$100.\n\nJ. O. Davis & Co.\n\nWholesale and Retail.\n\nHOW TO SUBSCRIBE\n\nBuffalo Hall, Winnipeg, Manitoba.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883111601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 3948, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2142, 2], [2142, 3900, 3], [3900, 8140, 4], [8140, 11028, 5], [11028, 14912, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]