[{"id": "7ad1dc1168768a843bceb8dded54232ae08c35eb", "text": "COMMUNICATIONS.\n\nWe do not hold ourselves responsible for any errors or omissions in the above advertisements.\n\nALGOMA, SASKATCHEWAN.\n\nSun.—In a recent issue, you quoted remarks from Mr. Flett, Bishop of Algoma, Saskatchewan, in his letter to the Editor of The Times. We have received the impression that the Bishop of Saskatchewan, in his letter, was speaking of Holy Trinity Church, Winnipeg, on \"Christians\" in this Province, and then referred to the Bishop of Algoma.\n\nThere is no ground whatever for this impression. Not the least reference was made to the Bishop of Algoma, or to his views, in the series of communications which will be seen from a report of a public meeting by the Winnipeg Free Press, held last Saturday evening. We would be glad if you will publish the Free Press report. I am sure you will feel with me in its justice fair to the Bishop of Saskatchewann.\n\nJAMES FLETT, R.D.,\nChaplain to the Lord Bishop of Algoma.\n\nThe Right Rev. Bishop of Saskatchewann has been very active recently in Holy Trinity Church on the subject of the final judgment. Towards the close of his discourse, he spoke of the world to be judged, and shown that the best will be not the creeds or denominations to which men belong, but the works they perform. He pointed out a great lesson which professing Christians have to learn. He did not say that those present in the great church were all belonging to the Church of England. He showed that there were many members of the different Protestant denominations who had repented and joined the Roman Catholic hierarchy. Was there not an example for all to keep in view, that it was not the denomination, or the church, but the works done by the members, which determined their eternal character? If this was the case, ought they not to remember that one of the chief objects of the Reformation was that the Church of England should be brought back to the primitive purity? He urged that the keep their doctrine and practice pure, and that they should not allow themselves before they were members of any particular church to become Christians; that Protestants may be saved, and that the Roman Catholics may be damned, if they do not maintain the chastity of speaking of their Roman Catholic brethren as if they were not Christians. He said that he could not see that he had been setting forth in the sermon. As a resident of the North-West, he had heard eight times that he should stand behind a shadow of doubt and tell his hearers that they were not Christians. Catholics had been abused for years for their lack of charity towards the poor Indians of the great northern part of the continent. Such unfair treatment was not to be expected; the devotion and the energy shown by bishops and priests of the Roman Catholic Church in the mission of proclaiming the Gospel of Christ amongst the Indians. He had seen the Indians treated with kindness; they supported orphanages, and had been visited by bishops. But a few years ago, during the time of the visit of His Excellency the Governor General, he had seen the tears trickling down the cheeks of the Indians, who were told that the mission of the prayers of the poor orphan children at St. Albert, near Edmonton, had been abandoned. He thought that he could not forbear to mention especially the great Christian charity showing itself in the north-western part of the continent. He knew that the rain we are having now does come from the spring rains, and that the crops will be good when they will mature well.\n\nWe hear that the services of Mr. Hill, Bishop of Algoma, have been attended by a large congregation from the con- gregation which he has organized and industriously built up in the east end of the city. Such a thing will not be tolerated by the people of the east end with such neglect as the bereavement of his con- nection with them. We have all fifteen of Christians that he had here. The speaker regarded this as a noble example second only to the bishop's personal purity and holy life—a life that he had known to be such for at least thirty-two years of his life. He had always been a Christian and living brotherly conduct to every Christian in this Province, and then went on to speak of the Bishop of Algoma. We hope that the people of this country, in the future as in the past, will be distinguished by their religious enthusiasm, and that they will be remembered for their piety and faithfulness. We believe that they were true of all creeds, and that members of the different churches.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nW.R. Gurney returned from Battleford with the mail on Monday.\n\nMr. Whiting and mother left for the East yesterday afternoon.\n\nCapt. Davis, wife and family left for Winnipeg yesterday afternoon.\n\nProf. Goldie Smith, Toronto, is making a visit to the district.\n\nMr. Beal left for Qu'Appelle depot on Thursday to meet his better half.\n\nT. O. Davis has removed his store to the Wascana Building.\n\nThe shop will remain in the temporary Chapel on Sunday evening tent.\n\nLouis Reid addressed a meeting of half breed Indians at Fort Macleod a few days ago.\n\nTwo W. M. Davis has been returned to the store lately occupied by T. O. Davis.\n\nThe crew of the skippers came down the river yesterday morning and left for the East in the afternoon.\n\nInspector Howie, N. W. M. P., has been sent to Battleford and is stationed there to take the Battleford district.\n\nThe steamer Magpie and Manitoona went up the river on Tuesday to Sturgeon Lake where they are to be laid up for the winter.\n\nMiller & Woodman, Calumetta River, have dissolved partnership by mutual consent. Mr. Woodman continues the business.\n\nMr. C. B. Reynolds, Land Commissioner for the H. R. C., arrived here on Monday and left for Waskesiu early next morning.\n\nMr. G. E. Carter, Secretary, Prince Albert Chamber of Commerce, Edmonton, Ont., last Wednesday, to whom we present our congratulations. The happy young couple recently married.\n\nMr. J. A. Murray, the student, did not advertise the date for the opening of Miss Isaac's school. We hope when Mr. Murray returns to start doing something for the benefit of the high school.\n\nWe have had placed on our table by a representative of the crops in the neigh- bourhood, the barley being especially very good and ripe, one sample being spoken of as being very good, whilst the wheat, most of the samples show full kernels, both others are green and handled with the least we had on hand.\n\nThe two York boats for O. E. Hughes & Co. are now nearly finished and only require the finishing of the sails and complete, which owing to the wet weather the builders have been unable to do. When ready they will be sent down the river by Mr. MacPherson, who will accompany the party at which place he will be staying.\n\nThe weather this week has been very cold and wet. On Monday the ground in the vicinity of Duke Lake was white with snow, which was still lying there without melting all day, which the settlers say was the worst in their experience this winter. The fields are reported to have been covered with snow for two years, while the small crops have suffered. Yesterday harvesting commenced at the east end of Lake Diefenbach, and the fields are all cut out from here to Sibbert and look well.\n\nAt Sibbert, on Monday last, Augustus MacPherson and his family were brought before Hilary Mitchell, Esq., J.P., charged with wilfully destroy- ing Saskatoon trees on Dominion Lands contrary to the provisions of the Domi- nion Lands Act. After bearing evidence against the charges the case was dismissed without costs, and the defendants were severely reprimanded.\n\nThe remarks in our leader of last week concerning the Indians having been near the text of the ordinance. We have received the following statement from the Indians: We have heard the language of action of the government officials. Territorial and provincial agents alike by making payment of goods intended to be sent to the Indians to the Trappists, while the Indians have never objected to the provisions of the ordinance.\n\nThe prayers preached in St. Mary's Church on Sunday morning last, and Canon Flett conducted the services in the interest of the Indians, evening. At the close of the sermon Canon Flett intimated to the congregation that owing to his illness he had requested a special chap- eron to appear and convey his attention to the Chapel. Great disappointment is felt at this sudden change, as he has conducted a good congregation and is greatly liked by the people. A petition in his name has been taken around signatures, and it is requested that he be permitted to be trusted the Bishop will fill the Canon's place with an equally good man, so that the congregation will not be dissuaded away.\n\nTELEGRAPIHC.\n\nBy Special Telegraph to The Times.\n\nThere was an alarming increase of measles cases in Calgary. On the 6th, 273 deaths, and 618 new cases were reported.\n\nAlbany is declared to be infected and every precaution is being taken to prevent its spreading.\n\nCleveland, Ohio, was devastated by fire on the 4th inst. Total loss, nine million dollars.\n\nOver one hundred members of the British Association are on a trip to the Rockies.\n\nThe Fall Mail Gazette says the Chinese Government has made a declaration of war in the form of a manifesto, and that the Chinese officials stated that war will shortly be declared against China by France. A fresh expedition of a more important nature has already been prepared.\n\nA large gold find is reported at Bennett, Montana. Instances are given of $500 being found in a twenty feet square. Great excitement prevails.\n\nThe services of T. R. Bowkorth have been secured for one of the Canadian contingents of the Gordon Expedition. He has had experience in the Nile and was on the Stanley expedition.\n\nSir David MacPherson has returned to Ottawa. He will not go to the North West this fall as expected.\n\nWHAT THEY ARE SAYING.\n\nWere you at the dance last night? I am asked to the next one.—Crazy Sally\n\nWas I nuts a bunny looking soggy and rather sober?—Wiggly the wrestler.\n\nI'm feeling in bed but still was very dry.—W. H. F.\n\nI made a muck boy.—Billy B.\n\nHe's a little ducky of a man and I've been saying that all day.—Billy B.\n\nI am thin and as usual was very rather sober.—Hansley.\n\nI am awfully sorry I was not there.—Hansley.\n\nIt had to come to the baby.—The Mother.\n\nWe will have more of it.—John M.\nOUR LUNACY LAWS.\n\nIt is asserted that the circumstances preceding the death of an unfortunate young man named F. E. Finnack are to become the subject of an official investigation, and some persons who are charged with having treated the deceased most brutally, by carrying him from Fort Macleod to Calgary, over the back of a buckskin in the braiding of a horse, are said to have heard that the matter is to be strictly inquired into, the more so as the youth in custody had not been guilty of any crime, but was deserving of the utmost commiseration. The case has now become acute, and we cannot help recalling a single instance of conduct on the part of any one of them as worthy of humanity. So far from this being the case, whatever other faults some of these men may have had, they certainly seem thoroughly kind hearted fellows, and we sincerely trust that the result of this investigation may tend to the discovery of the black sheep among their number. In any case, we presume that so far as the mode of conveyance is concerned the men started with what was provided by the orders of their superiors, who are probably anxious to rid themselves of the best at hand, while the type of an irresponsible being on such a journey may have been necessary for his own safety. There seems to be something lacking in the humanity which produces the possibility of satisfactory legislation on the subject, and if the lunacy laws are such as to excite the grave alarm in the mind of an eminent legal judge today in so highly civilized a country as England, we need not be surprised to find them highly unsatisfactory in these Territories. That they require immediate improvement is obvious, and we respectfully feel it every magistrate, who acts under them as they exist, has tried conscientiously to reconcile the provisions provided with the safety of the public, and the true interests of the unfortunate patient, whose life has become affected. As the law at present stands a man may exhibit the most marked indications of derangement which often precede dangerous outbreaks, and until he has \"established a probability of committing some criminal offence\" or still more probably has committed one, he must be allowed to go about to the annoyance of the public or their property, as well as our own, say nothing of the possible property of being at the mercy of any unscrupulous blackguard who is mean enough to take advantage of his inability to manage his affairs. Such cases are by no means fanciful, as those who were in this place some two years ago must admit. At that time a young gentleman whose name was Finnack, affected insanity, suffering from mental weakness, and fighting women, but yet could not upon examination be said to have exhibited a purpose of crime, and the authorities as usual, to be at large, experimented. The happiest results from the treatment of those competent to take charge of such cases are obtained. Many cases might be cited, but it seems too self evident to require demonstration, that considering the interest of the individual affected or of the public it is rather late to take charge of a similar fate after he has killed himself or some one else.\n\nTREE CULTURE.\n\nTree culture is now assuming some attention from the settlers in this country, and the question naturally arises, what trees are most easily to succeed. Mr. Wagner, M. P. H., for Woodlands, Manitoba, has undertaken at his own expense extensive experimental nurseries to test the forest best suited for the North West, and has thus far procured from Northern Europe, a number of trees, with varied results. So far he reports that the European ash and American lime are doing well, and that the linden or lime has come up well. The success of the linden as a tree, however, has never been very great in this country, but if the individual were to plant the American linden or the poplar in 25 acres. The maple or spruce of Europe promises well, and if a success is proved a very valuable tree. There is a species of maple similar to the American sugar maple, known as the silver leaf maple or box elder (Acer saccharum), which grows very rapidly, and forms in the other provinces, where cultivated, a fine shade tree. In its native state it is modest and lack of symmetry, but judicious pruning when young, would overcome this defect. The cypress, cedar and Eastern larch tried by Mr. Wagner, are failing. The poplar, the hackberry, the sycamore, and the silver birch, are doing well, owing to their rapid growth, and also from their wood proving valuable as timber. The firs, spruces and pines introduced from Europe by Mr. Macdonald, will fail in Manitoba, and many of the trees planted ten years ago are now thirty feet high, and afford wood useful for farm purposes, with this exception, also, after the third or fourth year it produces a good crop of fruit.\n\nForests affect the climate of a country, first, by the chemical action of their leaves which decomposes the carbonic acid of the air, fixing oxygen on the earth's surface, liberating the oxygen; there is then a physical action in hindering evaporation and stopping currents of air, and in covering the ground with a thick layer which holds water like a sponge and which holds water during the dry season, and permits the same to drain down into the ground. For this reason, ought to make a country cooler by withdrawing the carbon from the air; the heat that is set free when wood is burned is the very heat that was being absorbed by the growing growths. The mean temperature of a wooded country is always lower than that of a similarly situated treeless country; but, and this is important, the cold is less extreme, as well as the extremes of change; temperatures are gradual. In addition, forests arrest and destroy mirages, rendering their site and neighborhood healthy; they set a limit to the spreading of the spores of disease, and prevent cornfields from orchardly, their humus atrophies, and the feathered inhabitants they encourage, effectually obstruct the march of locusts and other destructive insects, while affording protection to and promoting the increase of the honey bee. Although forests produce little or no effect on the average rainfall of a tract of country, their presence or absence does affect the rainfall, regard to its distribution and consequent to the fertility of the land, by which its gradual accumulation gives rise to springs and rivulets, and equalizes the flow of streams and rivers. They also build up and maintain the soil, depositing on the rock, by the penetration and chemical action of water, and aiding in the surface action of the minute elements of vegetable nutrition. The culture of trees, therefore, benefits us, both in natural and artificial ways.\n\nTHE WEST END HOUSE.\n\nGood Boarding Stable in connection.\n\nGood Beer and Cigars always on hand.\n\nJ. R. O'LEARY\n\nPROPRIETOR\n\nS. H. & Co.,\n\nBakers and Confectioners.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING ON HAND.\n\nLUMBER, SHINGLES,\n\nDOORS, SASH,\n\nMOULDINGS,\n\nAND ALL SORTS OF BUILDING MATERIAL,\n\nfor sale at lowest prices. We are now selling two\n\nBankrupt Stocks for Cash\n\nDAVIS & CO.\n\nWholesale Lumber Dealers\n\nHead Office - 600 Main Street.\n\nYard - Preston Street, at C. P. R. Bridge.\n\nAsh & Robbins, 800 Fulton St., Brooklyn, N.Y.\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDresseed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 16 feet extra.\"\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduced rate.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETY - PROPS.\n\nRIVER ST., PRINCE ALBERT, SASK.\n\nPUMPS !! PHOTOGRAPHS !\n\nChas. E. Page.\n\nNEW STUDIO\n\nEAST END.\n\nNOTICE.\n\nI hereby intimate that all our accounts are now closed, and all parties indebted to me are requested to settle the same immediately; if not paid will be added to W.H. On and after this date I will keep no more accounts. Terms strictly cash.\n\nW.M. GORDON.\n\nApril 1st, 1884.\nCORRESPONDENCE.\n\nFrom Moose Jaw to Medicine Hat.\n\nMoose Jaw, 300 miles from Winnipeg, is a compact little town of about 750 inhabitants. The Moose Jaw Creek is a small but picturesque stream, traversed by both large and small trees, running past the eastern portion of the town. The water is of a rather tasteless, but abundant supply of good water during the heat of the summer months. The population has at everything decreased since last fall, owing to the fact that frame houses have been lately erected and are in course of erection, there are signs that the town will be greatly improved in appearance. It is expected that Moose Jaw will be the terminus of the projected line from St. Boniface and North Battleford, if such a line were to be constructed. If so, it would give the town a permanent hold on prosperity, as the town is situated in a district that has been covered since the days of early stockyards, used for resting, watering and feeding the cattle, which were being shipped to Chicago via Moose Jaw, through the C. P. R. to Chicago. Several large train loads have already been forwarded from this point, and the town is but the forerunner of a heavy traffic in cattle. The C. P. R., by shorter distance and quicker transit, offers a decided attraction to the Montana ranchers, than the Northern Pacific. Moose Jaw supports many large firms engaged in the trade, among them J. & J. Mclean and Baker & Co., grocers; Robson & Kenney, general merchants; R. Bogue, hardware; and K. H. Smith, lumber. There are also a number of good hotels, the best being the Brickhouse, owned by Mr. George Robson. There are also Judge Mr. Macdonald and the Moose Jaw News is edited here. Many newspapers are still in their infancy yet the Englishman, the Western Mail and Mclean's, the C. P. R. road house, and several lumber yards employ quite a number of hands. The religious views of the population are well attended to, as there are Methodist, Presbyterian and Anglican churches, besides Roman Catholic chapels. The crops in this district are fairly good and the farmers are expecting more than an average crop.\n\nLeaving Moose Jaw for the west, the C. P. R. line passes through a level tract of country, watered by a number of small streams, and traverses a large extent of ground on both sides of the line has been broken for agriculture, and we find the crops are generally good, the higher ground to the north. Between Edmonton and Caron, two surface of the country is broken, consisting of uplands and hills, these sand hills continue until Marchand is passed, when all signs of farming disappear, and we enter a sterile district. From Caron to Paskapoo the country changes into gently rolling prairies with numerous ponds and marshes along the creeks. From Caron, as far as Farwell, there is no place as far as the eye can reach an occasional range of rough hills, which are covered with timber, being filled with alkaline ponds. In the centre of the hills, at Secorran, the C. P. R. has built a station, and here the soil, having been brought from the coastal plains, the crops of which look to my eye rather poor, the straw being short and thin. We pass through the town of the north east end of old Wascana Lake, and in addition to the usual section house etc., there is a large grain yard, used for storing grain, and near the yard the C. P. R. Leaving Chaplin we pass by quite a stretch of large hills, the prairie being covered with various trees, rolling and after passing Harold change into high hills. The ground all along is almost entirely covered with prairie, and lies alongside one of the above mentioned lakes, which abounds with wild fowl. From Harold to Swift Current we pass wholly rolling prairies, which flatten down towards the lakes; this sort of country continues until the town is reached. This is a fine large lake, which towards the north west end is completely covered with reeds and rushes. South of Rush Lake is located a house for water fowl, and it was here that I had the satisfaction of seeing the satisfaction of seeing pelicans coming in from the south, of freedom. From Rush Lake to Waskada the track passes through a level valley, between which are several small lakes, the being fine grass growing land, and a crop of hay seed to have been successfully gathered. Towards the north west rolling prairies commence again, but changes after passing that place to a valley, with a small range of hills on either side. This continues until Swift Current is reached. The town of Swift Current has not come up to its present stage last year, nor even though there is a fine school building, dining hall attached, and a round house.\n\nThe whole town consists of three stores, (the principal one being a large one,) two lumber yards, a blacksmith shop and a few houses. Swift Current is built in a fine position, well sheltered and watered from the creek near at hand. At the C. P. R. farm here the grass is all cut and the reapers are now doing a good job. This seems a favorite camping place for Cree Indians who come here in large numbers during the month of June. Large numbers of buffalo have been killed in the surrounding country and several hundreds of hides are now being shipped out. From Swift Current to Lumsden and Goose Lake, we again pass through the inevitable prairie, with the exception of a few small hills. These marshes are absolutely alive with wild ducks and geese. To the north west of the prairie there are large alkaline lakes, to the north of the track. Rolling prairies with marshes and alkaline lakes continue until we reach the town of Lumsden. Between Till Lake and Cypress the rolling prairie is sandy and mixed with alkaline, plenty of water holes and marshes, and the eastern side of the town is covered with the same. The country towards southeast is mostly the same; rolling prairies with marshes and large alkaline lakes. As far as Cypress there are rolling shocks, no wood, only Marshes and Marshes. Cypress is the northern boundary of the prairie, and here we pass through a field of large marshes and lakes as well as several small marshes, creeks, etc., the side of the prairie hills to the southeast, and the west side to the southwest. Here I wish to remark the perspicuity with which the C. P. R. track have kept together, they having continually crossed each other the most of the points.\n\n(To be Continued.)\n\nNEW GOODS!\n\nMEDICAL HALL\n\nBurdock Blood Bitters,\nBurdock Healing Ointment,\nBurdock Pills,\nVictoria Hypophosphites,\nVictor & Bucha and Uva Ursi,\nFreeman's Worm Powder,\nYellow Oil.\n\nT. E. JACKSON,\nAT THE OLD STAND,\nSHANNON & MCLEOD\n\nFRESH ARRIVALS FROM THE EAST AT\nJ. M. CAMPBELL'S,\nA LARGE CONSIGNMENT OF\nDry Goods\nAnd Groceries\nAlso Coal Oil.\n\nPRINCE ALBERT\nPlowing Mills and\nSash and Door Factory\nPRINCE ALBERT\nWoodfellow Bros., Prop'ts.\n\nFourth Judicial District Court\nDIVISION NO. 2\n\nNotice is hereby given that the sitting of the\nSt. Albert County Court, Division No.\nwill be held at Prince Albert, on\nMonday, November 3rd, 1884,\nat 10 o'clock a.m. All parties interested\nare respectfully invited to attend and\nmake application. In testimony whereof\nI have hereunto set my hand this\nday of October, 1883.\n\nJOSEPH FINLAYSON,\nClerk of the Court.\nPrince Albert, Aug. 12th, 1883.\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings,\nReady-made Clothing and Table Oil Cloths\nEvaporated Peaches, Evaporated Apples,\nPrime Tomatoes, Choice Oat Meal,\nAnd Canadian Cheese.\n\nTOBACCOS.\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Bolden Rule\nand Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR\nHARVEST TOOLS\nAT\nJ. L. JOHNSON & CO.\nA FULL STOCK OF\nHay, Manure, and Barley Forks, Scythes,\nSnaths, and Grain Cradles.\nAlso the best Machinery Oil for\nMowers and Reapers now in\nthe market.\n\nJ. L. JOHNSON & CO.\nT. N. Campbell,\nBookseller and Stationer\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884091201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6245, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 10385, 1], [10385, 17687, 2], [17687, 19018, 3], [19018, 27120, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]