[{"id": "5c5d7c6519bb61892a79d56e4672a5d6fe4c46d9", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETY\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY-CHURCH SERVICES\n\nSt. Mary's\n11 a.m. - His Lordship the Bishop of Sask.\n1 p.m. - The Rev. Principal First.\n\nThe Mission Chapel\n11 a.m. - The Rev. Principal First.\n1 p.m. - His Lordship the Bishop of Sask.\n\nSt. Catharine's\n11 a.m. and 7 p.m. - Rev. Mr. Macintosh.\n\nSt. James'\n11 a.m. - His Lordship the Bishop of Sask.\n5 p.m. - Rev. Mr. Wilson.\n\nSt. Matthew's\n11 a.m. - His Lordship the Bishop of Sask.\n\nSt. Paul's (Presbyterian)\n11 a.m. and 7 p.m. - Rev. Mr. Macintosh.\n\nFRIDAY, NOVEMBER 7, 1884.\n\nN.W. COUNCIL ELECTION.\n\nIt may strike many that the discussion of matters pertaining to the election of a representative of this electoral district in the North West Council for the next two years is rather premature, but we were they aware of the amount of interest which has been taken by some for any part taken with regard to the election of the coming member, they would no longer hold that opinion. In fact many, if not most of us, feel equally surprised and delighted to learn that we are not to be put to the trouble of exercising our minds with the selection of a candidate at all. Certain gentlemen actuated by the slightest suspicion of the matter as well as all others concerning what is likely to prove most beneficial to the inhabitants of the Territories at large, have been favorably impressed with the proposal to have very kindly decided that one of themselves must be the coming man, as the providential and bestowed upon them serves merely to afford them deeper insight into what is for the best. If the proposal does not extend to the immediate measures required to give effect to their inspired views, they have to confound, in case of our community as a whole, the provisions which are made for all of these arrangements, have to recur to the vulgar and disgustingly earthly state old lodges of putting up two names to split the vote, one of which will hardly be elected, at least at this juncture which will no doubt be duly revealed to them as the right one, resign in favor of the other. Were it absolutely certain that the inspiration referred to was genuine, and that damned for we would allow the electors to rejoice and to cooperate instead of kicking against the pricks. We would say then that however unsatisfactory it might be, men manifest entirely in experience, with the most imperfect if any liberal education, to the casual eye seemingly actuated by selfish motives only, and representing principles by insensible self-sufficiency, we must remember that when viewed by the light of faith, what appears most distasteful may in reality be unconditionally for our good. It is well not to regard the question as a question, but to take time to consider a decision and have no doubt that in due time we will feel irresistibly drawn in the right direction.\n\nPUBLIC NOTICE.\n\nCOAL OIL.\n\nBUY American Coal Oil, FOR ECONOMY AND LIGHT.\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSTILL IN A STATE OF DISORDER!\n\nThe Balance of our Stock will in consequence be SOLD AT COST FOR CASH, to make room for large Fall Importations now on the way.\n\nCall at once with MONEY or PRODUCE and get the BARGAINS.\n\nBETTS & Gwynne.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE Victor Well Boring & Rock Drilling Machinery.\n\nWe mean it and are prepared to demonstrate the fact. The WELL-MERITED SUCCESS which has crowned our efforts during the past fifteen years, and with EVERYTHING necessary to make the job complete in every possible way. Our Machinery is operated by either Man, Horse or Mule and works very rapidly. They range in size from\n\n3 Inch to 4 Feet in Diameter\n\nand will bore and drill ANY REQUIRED DEPTH. They will bore successfully through the hardest rock and the most difficult soil. They are used for Stone Coal, Slate, Hard Pan Gravel, Lava, Bedrock, Serpentine and Conglomerate Rock. They are portable, simple to operate, the very best for Wells in Quick Sand. They are light running, simple to manufacture, and are demanded by the highest class of prospectors as the most practical Machine existent. They are ordered by some of the highest State Officers. They are also used for Prospecting for Gold, Silver, Coal Oil and all kinds of Minerais. And for sinking Artesian Wells and Coal Shafts, etc., they are unequalled. We also furnish Engine, Pumps, Wind Mills, Hydraulic Presses, Poveshell, Belt Ma chines, etc., for both Prospecting and Mining Wells and Mounds of all kinds. Good Active Agents wanted in every County in the World.\n\nAddress: VICTOR WELL AUGER & MACHINE CO., 511 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nT. N. Campbell, Bookseller and Stationer\n\nJUST RECEIVED A LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nWINTER AMUSEMENTS.\n\nThere can be no reason why the winter evening public entertainments which have afforded so much harm-\nful amusement to our citizens with more or less regularity during the past six winters here, should not be made most successful this year, and we attribute so much import-\nance to the fact that we feel our read-\ners will think the space devoted to a few remarks about them by far too means wasted. The reason for do-\ning so just now is that so far we have not heard of any active measures to organize anything of the kind, and the season for them has already been\ncentered upon, while the existence here of so much and varied talent of the necessary sort, renders some organ-\nized effort all that is necessary to provide a regular series of first-class entertainments such as cannot fail not only to contribute to the pleasure, but also to the moral and social benefit of all the people of our town. Six years ago the strong con-\nvictions of our citizens could hardly be expected from the introduction of some social recreation of an improv-\ning yet not too heavy kind, led to the institution of what, for want of a better name, were designated Penny Reading Rooms. Many of these rooms in the way at that stage of the settle-\nment's development drew forth the most melancholy prognostications with regard to the result, which how-\never were found to be altogether groundless as the expectations of the promoters of the scheme were more than realized, and the per-\nformances of the original society were pronounced, more especially during the latter part of the season, by competent judges to be such as would have deserved credit under far more favorable circum-\nstances. The following year the so-\nciety met a natural death, which un-\nfortunately silenced its voice, but was chiefly to the fact that the for that time considerable influx of strangers had not had time to coalesce with the people already settled here. The new entertainments provided until last winter, although the performances were only occasional, and the result of fitful efforts. Last winter the entertainments, which were all formed on the original model, were furnished with tolerable regularity in connection with the Voice Men's Literary Society, while others with a strictly musical programme were intro-\nduced in aid of the newly formed and much appreciated brass band which is now doing a good work feature of our winter life. We note too that as a result of the great suc-\ncess attending the first attempt at private theatricals in our settlement, offers were made for the entertainment of his-\ntories to a generous width who hap-\npily had been afforded pleasant hours to his friends, the performance of amateur theatricals became a regu-\nlar institution. In urging that im-\nmediate action be taken with the end referred to, we are assisted by the certain knowledge that as young folks will by an inevitable law of na-\nture find amusement of some sort, the only effect of failing to supply such as is at once wholesome and im-\nproving, will be the taking refuge in something, to put it mildly, of a less innocent nature. We are pre-\npared to go far greater lengths and expend far more money (not merely financial) and win, if the kind of entertainments we speak of. The direct and indirect benefits from gathering together, in a pleasant healthy social atmosphere, young men and women may easily perceive the contents of literature work for them-\nselves and affording them well se-\nlected readings and recreations seem\nSASKATCHEWAN DIOCESE.\n\nHis Lordship the Bishop of Saskatchewan returned to Prince Albert on Friday last from his missionary tour in the new part of the Diocese. His journey extended as far as Lagun in the Rocky Mountains where seven mission Indians gathered. At Lagun he said the 15th of October he held an ordination when the Rev. W. W. Thomas was ordained to the Diaconate. Mr. Thomas is now studying at St. Michael's Missionary School's Diligent College, where he was admitted to the Priestly Orders. Mr. Thomas was ordained by the Bishop of Saskatchewan before he left England. The Rev. P. K. Smith, M.A., of the University of Toronto, was present. Mr. Gagnon acted as temporary Chaplain to the Bishop and presented the candidate. The Rev. J. T. Travis of Fort Macleod assisted in the ceremony. The Bishop preached both morning and evening to large congregations and took pains to explain the doctrine of the church as shown both by pastors and people, in their having in so short a time arrived at the very highest degree of thought which they were assembled. The offerings at the two services combined was more than the church had ever received.\n\nThe following day the Bishop visited the mission at the Blackfoot Crossing where he met the children who called \"Crowfoot\" and shook the whole Blackfoot tribe. The mission school house was filled in the afternoon with the children who came to see \"Crowfoot\" and the chief sent in rank named \"Old Sun\" made long speeches in reply to the Bishop. The Bishop told the history of the mission to them to listen to the Missionary, to send their children to school, to be guided by the Bible, to work, to improve themselves by learning to farm and make practical trades. He pointed out to them how kind and generous the government was in taking such pains to teach them how to improve their condition. The replies of the children were very satisfactory, indicating a wish to be pious and a desire feeling of the importance of doing things in the right way. The Rev. W. W. Thomas is in charge of the mission is making rapid progress among the Indians and has been a successful missionary. He had the children in singing hymn songs in Blackfoot.\n\nThe Bishop was present at the Provincial Assembly at Regina the first week of October, and returned to Winnipeg to take part in the celebration of the opening of Parliament on the 15th Oct. On the journey homewards he met with a serious accident. He was obliged to leave accompanied him through all the long journey and returned with him in good health.\n\nTELEGRAFIC.\n\nBy Special Telegraphic The Times Of April 28, Nov. 7 - In the House of Lords Earl Russell and the Government had no chance to recover in the event of the defeat of the King's and capture of the Queen.\n\nLord Wolseley has arrived at Douglas. The South Act was carried in both Houses of Parliament, but the South Act and majority of the ballot papers were stolen, probably by the anti-Souths. The bill will not affect the South.\n\nA disastrous fire occurred Saturday between negroes and Democrats at Baton Rouge, Louisiana, and many lives and two hundred ballot boxes were stolen, probably by the anti-Souths. The fire did not affect the South.\n\nThe President's contest is still undecided, both parties claiming the victory. The tall returns are not yet to hand.\n\nA heavy gale of wind accompanied by a heavy fall of snow was reported from the Gulf of St. Lawrence. Great damage has been done to property at Quebec. Hundreds of trees have been uprooted.\n\nA shipwreck was made by the sea in the road bed of the Polar colonial at Rio, and trains are unable to transfer.\n\nWe regret to hear that Mr. George Hart is suffering from a severe attack of consumption of the lungs.\n\nPOLICE NEWS.\n\nSept. Gagnon is in command at Carleton.\n\nSergeant Major Dunn with Const. Wm. Metzler, Fleming and Hinch arrived from Carleton on Saturday and returned on Tuesday morning.\n\nSergeant Gagnon returned on Saturday and left again on Tuesday for Carleton where he is at present to be stationed.\n\nThe Bishop visited the new school at Crowfoot yesterday. A strong guard of constables with four large cells has been erected by Captains Cookson and Kierman.\n\nThe Rev. Mr. Monkman and Humphrey are being tried this afternoon before Judge Belson.\n\nMr. T. E. Baker, of this town, was married last evening to Miss Florence A. Murray, daughter of Mr. Murray, who resides in this town. Mr. J. W. Reid. We tender the happy couple our hearty congratulations.\n\nST. ANDREW'S SOCIETY.\n\nA meeting of the members of the society was held in the Mission Hall on Friday evening, Nov. 16th. The officers elected were: President, Mr. J. W. Reid; Vice-President, Mr. J. W. Reid; Secretary, Mr. J. W. Reid; Treasurer, Mr. J. W. Reid; and in addition Mr. W. Napper, Sec.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAt T. N. Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND\n\nNOTICE.\n\nI beg to notify my customers and the public generally that I have REMOVED my stock to \"TRESTON HOUSE,\" and have now on hand a full line of Hardware, Stoves and Stovepipes, at greatly reduced figures. All overdue accounts are now closed.\n\nT. J. AGNEW.\n\nNEW GOODS!\n\nMEDICAL HALL\n\nBurdock Blood Bitters,\n\nBurdock Healing Ointment,\n\nBurdock Pills,\n\nVictoria Hypophosphites,\n\nVictor's Bucha and Uva Ursi,\n\nFreeman's Worm Powders,\n\nYellow Oil.\n\nJ. M. JACKSON,\n\nAT THE OLD STAND.\n\nCONSUMPTION\n\nPositively Cured.\n\nFor sale at lowest prices.\n\nBankrupt Stocks for CASH\n\nSend for prices. No trouble quoting prices. Parties making large purchases to sell again will receive special prices.\n\nASH & ROBBINS,\n\nWhole Lumber Dealers.\n\nHead Office - 60 Main Street. Yard\n\nPoveshell Street, on C. P. R. Siding.\n\nTENDERS WANTED\n\nFOR\n\nSTOCK\n\nAND\n\nBOOK-DEPTS,\n\nESTATE OF J. O. DAVIS & CO.\n\nThe Stock amounts to about $6,000\n\nThe Book Debts amounts to about $2,300\n\nTenders in writing will be received by the undersigned up till the 31st inst. for the above.\n\nParties making other than a CASH offer will please state security.\n\nThe highest or any tender not necessarily accepted.\n\nPHILIP THOMAS,\n\nAGENT FOR Robert Dunn, Trustee.\n\nPrince Albert, Oct. 12th, 1884.\n\nA.W.R. MARKLEY,\n\nGeneral Agent and Auctioneer,\n\nPRINCE ALBERT, SASK.\n\nJ. M. CAMPBELL\n\nHas just received a complete and well assorted stock of shoes.\n\nShawls,\n\nHosiery,\n\nSheetings,\n\nBlankets,\n\nReady Made Clothing, and Underclothing.\n\nA full line of GROCERIES.\n\nAlso PRATT'S ASTRAL OIL which, for comfort, safety and brilliancy, excels anything in the market.\n\nPRICES TO SUIT THE TIMES.\n\nJ. M. CAMPBELL,\n\nLUMBER, SHINGLES,\n\nDOORS, SASH,\n\nMOULDINGS,\n\nBUILDING MATERIAL,\n\nfor sale at lowest prices.\n\nBankrupt Stocks for CASH\n\nSend for prices. No trouble quoting prices. Parties making large purchases to sell again will receive special prices.\n\nDAVIS & CO.\n\nWhole Lumber Dealers.\n\nHead Office - 60 Main Street. Yard\n\nPoveshell Street, on C. P. R. Siding.\n\nNATHANIEL ACORN\n\nPrince Albert.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884110701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 3719, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4970, 2], [4970, 8491, 3], [8491, 15453, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]