[{"id": "3aa1b4ddca37651ed81860d57a35579717f6599e", "text": "FRIDAY, APRIL 13, 1888.\n\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAUETTY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's and St. Mary's Churches—9 A.M.—Rev. Canon F. J. Macdonald, St. Alban's Church—10:30 A.M.—Rev. Canon F. J. Macdonald, St. Mary's Church—12 Noon—Rev. Canon F. J. Macdonald.\n\nNOTICE\n\nMISS AULD\n\nHow to inform the ladies of Prince Albert that you are engaged to Mr. J. A. Fraser, a large number of letters have been sent out by the Miss Auld's Office.\n\nTORONTO WORLD\n\nIs absolutely the best Paste in Canada.\n\nThe latest and best Paste now on the market, and the most economical for the money.\n\nTHOS. O. DAVIS\n\n'79.\n\nNOTICE\n\nT. J. AGNEW takes stock and Closes his Books on 30th of April. Parties indebted to him would greatly oblige by arranging their accounts previous to that date.\n\nFULL LINES ON HAND OF\nBREAK PLOWS, CROSS PLOWS;\nIRON HARROWS, GARDEN TOOLS, COAL OIL,\nBOSS CHURNS, MILK PAILS, CREAMERS,\nBUILDING HARDWARE\n\nAT\nT. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 10 Battery St., New York.\n\nOffice Stationery, etc., etc.,\nTHE CANADIAN MORMONS\n\nThe following is an extract from the report of Mr. J. M. Campbell, Inspector of Customs, in reference to the new Mormon colony near Lethbridge.\n\nThe new settlement is in the Department of Alberta, and I have been informed by the settlers that they have found the Mormons out in the country, and that they are very friendly. They have also been very hospitable to me, and I have been able to get some information about their lives here.\n\nThey have built several houses and are now living in them. They are very industrious and hardworking people, and I am sure that they will be successful in their new home.\n\nI have visited the colony several times and have seen the progress they have made. They are very friendly and welcoming to strangers, and I am sure that they will be successful in their new home.\n\nI have visited the colony several times and have seen the progress they have made. They are very friendly and welcoming to strangers, and I am sure that they will be successful in their new home.\n\nDUNN'S BAKING POWDER\n\nA Dead Drop\n\nPRICES\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness design and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nAsh to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER--Hop--ALE\n\nDelivered to all Parts of the Town.\n\nMINTOSH & GEPROND\n\nGO TO CANN'S BOOK STORE\n\nFOR STATIONERY,\n\nSCHOOL BOOKS,\n\nETC. ETC.\n\nGRAND UNION LIVESTOCK STABLE\n\nOpposition is the Life of Trade\n\nA First-class Livestock, Feeds and Sale Barn\n\nWe would like to invite the public when in town to visit our stable and barns at any time during daylight hours. We have a large number of horses and mules for sale, and also a few cattle and hogs.\n\nOur stable is located just west of the train station, and is easily accessible from any part of town.\n\nWe offer a wide variety of livestock, including horses, mules, cattle, and hogs. Our prices are competitive, and we are always willing to negotiate.\n\nFor more information, please contact us at (555) 123-4567.\n\nG. H. CAMPBELL\n\nGENERAL\n\nRailroad - Steamship\n\nTICKET AGENT,\n\n471 MAIN STREET. - WINNIPEG, MAN.\n\nHeadquarters for all Lines, as under:\n\nAllianz, Dominion, State, Canadian Pacific, Canadian National, White Star, Great Western, Lloyd's Great Western Line, Birkenhead Line, Anchor Line, Italian Line, and every other Line between Atlantic and Pacific Ocean.\n\nFulfiller of \"Campbell's Steambath Co.\"\n\nWe offer a complete line of bathhouse supplies, including towels, soap, and other bath accessories.\n\nFor more information, please contact us at (555) 123-4567.\n\nJ. R. McPHAIL'S\n\nThe balance of our Heating Stoves and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPHAIL\n\nROBERTSON & ROBERTSON\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowering and Overcoating WORSTEDS,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominions.\n\nSUMMER SUITINGS\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888041301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 1522, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1300, 2], [1300, 3176, 3], [3176, 5163, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]