[{"id": "217deac8aaafc27e3d43c2da6b487cb70bd95dd2", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 11, 1884.\n\n$2.60 A YEAR.\n\nNOTICE.\n\nThe Department of Indian Affairs being desirous of having Grass Mills erected in each of the following places in the North West Territories—Messrs. Mentioned below, will be given.\n\nAt a point adjacent to the Indian Village near Prince Albert, about thirty-three miles south of Cariboo Plains, at a point to be fixed by the Government at Edmonton, Battleford, Pitk. or Callican, to any of whom acceptance of the terms must be sent on or before SATURDAY, JUNE NINTH, 1884.\n\nFor full particulars apply to the Honorary Commissioner of Indian Affairs, Prince Albert.\n\nCHIT-CHAT LOKAL.\n\nGathered from Reporters.\n\nAn outbreak of typhoid fever has been reported at Fort Battleford.\n\nO. E. HUGHES & CO.\nWHOLESALE DEALERS,\nCARTERS, COMMISSIONERS.\nPRINCE ALBERT, N.W.T.\nW. GUNN M. A.\nFARMERS, MERCHANTS, FARMERS, COMMISSIONERS.\nMONTANA, WICHITA, OKANAGON, WINNIPIG.\nMONTANA, WICHITA, OKANAGON, WINNIPEG.\nMONTANA, WICHITA, OKANAGON, WINNIPEG.\nMONTANA, WICHITA, OKANAGON, WINNIPEG.\nMONTANA, WICHITA, OKANAGON, WINNIPEG.\n\nNEW GOODS!\n\nFresh Cheese.\nFresh Jam.\nFresh Prunes.\nFresh Raisins.\nFresh Lemons, etc., etc.\nCOMPLETE STOCK\nDRY GOODS AND CLOTHING.\nCALL AND SEE OUR\n$8 SUITS,\nALL WOOL.\nT.O. DAVIS\nLUMBER, SHINGLES,\nDOORS, SASH, MOULDINGS.\nAND ALL KINDS OF BUILDING MATERIAL.\nBankrupt Stocks for CASH.\nDAVIS & CO.\nWholesale Lumber Dealers.\nHead Office: 500 Main Street,\nYard Offices: Short of K.C.F.S. siding.\nRepairing and Job Work promptly attended to and executed.\nR.H. BRATNOBER,\nEAST END.\n\nBANKING HOUSE\n\nMacarthur & Knowles\nPrince Albert, N.W.T.\nPrince Albert's General Banking House.\nINTERESTS APPLY.\nTel.: [Address not visible]\nNo banking operations at all points.\nInstitution of checks postponed until further notice.\n\nTELEGRAHIC.\n\nTHE CONSPIRACY CASE.\n\nHow J.M. Pope Subpoened to appear before Royal Commission.\nMeeting of Grand Lodge, A.F.A.M.\nHon. Mr. Carson Experts to be the new Lieutenant-Governor.\nCamp Fire at Aldershot Camp.\nExtraordinary Exhibition of Engineering Among our Men.\nProfessor Kutta's theories Proposition.\nThe Scourge Expected to spread all over Europe.\nGreat Anxiety Among Stakes at the Park.\nThe incident United Immediately.\nSignal Stations and Observation Measures are being Enforced.\n\nTHE PUBLIC SENTIENCE.\n\nThe Sport which was postponed on Dominion Day owing to the wet weather was successfully concluded last Saturday.\nIt was attended by a large crowd, who took full advantage of the fine day and the event presented quite an appearance.\nThe firing was excellently handled, and the prize of the game, which was not completed till late at night.\n\nSPORTS.\n\nThe sport which was postponed on Dominion Day owing to the wet weather was successfully concluded last Saturday.\nIt was attended by a large crowd, who took full advantage of the fine day and the event presented quite an appearance.\nThe firing was excellently handled, and the prize of the game, which was not completed till late at night.\n\nTHE CARROT RIVER.\n\nA party of settlers have been making their way to this new town.\nThey are expected back in a few weeks, or so, they will return having a better and a more substantial stone bridge.\n\nPont du Bois Rd., J. Macdonald, 5th Dist.\nPoveshilo Rd., G. Smith, 3rd Dist.\nStanding Rock Rd., J.J. McClelland, 2nd Dist.\nRunning Horse Rd., Steppe, 3rd Dist.\nSupernatural Pools Rd., O. McKeown, 3rd Dist.\nVaseux Lake Rd., J.G. Houston, 4th Dist.\nTwenty Yard Rd., Mr. Brown, 4th Dist.\nYukon Rd., J.S. Brown, 3rd Dist.\nYorkton Rd., J. Macdonald, 5th Dist.\nYoung River Rd., Mr. Paterson, 5th Dist.\nBoy's Rd., Mr. Welshman, 2nd Dist.\nWatson Rd., S.A. Atkinson.\nTakttav Rd., Mr. Powers.\n\nFROM TRUDON AND MARQUET.\n\nNews from Trudon and Marqued most alarming. At one former place this is astonishing. The number of patients and thirty new cases were reported in the hospitals today. In ten minutes there have been nine admissions for burial. Rumors are prevailing among the ignorant classes that many have been buried alive without examination. At Marqued there were sixteen deaths and twenty new cases were taken to the hospital. Notwithstanding the efforts of the doctors there was a lack of food.\n\nA Telegram from London states that an English diplomat visited the province and expressed great satisfaction there was such a lack of food.\n\nThe consumption is spreading all along the Frontiers and cannot be stopped. There are three dead people reported at Hay, where the disease has made its appearance where throughout the country preparations are being made to meet the situation.\n\nDr. Keith said that the prospect of a spread of the disease over all provinces was not very certain; but also the fear that the disease might be carried from one province to another and reach the whole province, being met with.\n\nThe opinion is that the disease will be carried from one province to another and reach the whole province, being met with.\n\nThere may be cases of carriers but there are several who are carrying the disease.\n\nIn conclusion, it was stated that the situation was not very certain; but also the fear that the disease might be carried from one province to another and reach the whole province, being met with.\n\nMr. W.B., Enfield (Nottingham), reports that the disease is spreading throughout the provinces and the government has been unable to do anything to prevent it.\n\n(Top of page)\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\nJ. D. MAVEETY\nPRINCE ALBERT, N. W. T.\n\nPRINCE ALBERT, N. W. T.\nTERMS—Two per month in advance.\nIn case not paid by the 1st of each month, an additional five cents will be charged.\nAll letters to be addressed to the Proprietor.\n\nTHE FRENCH IN MOROCCO.\nAsia and Africa are quietly having territories upgraded by the French. A short time ago it was Annam that had submitted itself to France, and now the king of the large and populous province of Cambodja, which has administered his kingdom under a French protectorate, voluntarily abdicated and handed over all his possessions to the negociation of the French Government General of Canton, China at Saigon, for a financial consideration. Some day, soon it may be, we shall hear of the French in Morocco, for the Sultan, the only person there who is new on the scene, and will shortly be in Madagascar. The situation is a most interesting one.\n\nM. Ferry's ambition, for a long time, has been to stretch the frontier of Algeria from the River Oum Er-Rbia to the Mediterranean. He placed an Emirauté on the throne, who would rule the new province in the name of France. The Sheik of Wazan, a formidable rival of the Sultan, whose descendants are the Prophet, and exercises a moral religious sway over the Mohammedans of the Province, has accepted French nationality. It seems certain that the French will succeed in the plan. First because the Sultan has accepted French nationality; secondly, because with French help he can reach the throne; and third, because France has already sent Commissioners who will have no difficulty in having a strong fleet on the coast. The Sultan is powerless, not able even to put future no mason will be guilty of holding his own against a weak Spanish screening a bad mason, because he cannot attack France, nor any other European power. Egypt by Britain, Tripoli by Italy, Tunis by Spain, and Algeria by France. Morocco being the last independent Arabian State, will soon fall into the hands of France. No one is likely to interfere with it. If Europe does she interferes with the British extension to the Mediterranean. Germany cares little how France may transfer her power in foreign countries, so long as it does not diminish her power in Europe. Besides, when the Dutch line comes to an end in Holland there will be a further partition of small States to be made in which both Germany and France will be interested.\n\nABOUT RELIEF.\nThe question of Bradlangh for sitting and voting as a non-English parish member without having been sworn in by the Speaker is attracting attention in England, and it is hinted that Lord Chief Justice Coleridge, the presiding judge, observed the oath to which Bradlangh swore, but would be unwilling to swear the Lord Chief Justice did, as he is a liberal minded man, and if there is any doubt as to Bradlangh's capability, Bradlangh is entitled to the best treatment in the world. In regard to the point raised by Bradlangh to the effect that the Speaker had acted illegally in refusing to administer the oath to him without having his religious belief proved, the court held that the question must be reserved for the decision of a jury. The whole question rests upon this point, as how can he be declared a Non believer besides Bradlangh can tell what is Bradlangh's religious belief? Even Bradlangh himself might have some difficulty in intimating just what his belief is, between his beliefs and his belief and ours. No man can draw a line around his belief and say that beyond that line he does not go. Much less can anyone make up his mind what he really believes and what he thinks he believes, or what he says. How is a jury to settle the question? Even if a jury were able to take language and get inside of a man's head and examine his mental processes they could not declare what he believed or what he did not believe. For all that any person knows to the contrary, half the members of the British Parliament do not believe what most men Bradlangh does, and yet they sit and vote with impunity, with none to molest or make them afraid. Bradlangh is not the only atheist by any means who has a seat in parliament.\n\nCOMMUNICATIONS.\nWe do not hold ourselves responsible for the views expressed by correspondents.\n\nTRIBUTE TO THE TRAVELLER.\nTo the Editor of The Times.\nSir,—I quite agree with the letter signed \"Rehabus,\" in your last issue, in reference to Freemasonry. Some claim Masonry is a bad religion. Masons are human beings, the same as church members. We have hypocrites in our churches, but we do not denounce religion on that account. Masons do not choose to be hypocrites. They are human beings together to whom murderers and vice, as I have been frequently told by men that should know better. I consider a mason that will violate his obligations willfully, intolerable to tolerate. I hope no future no mason will be guilty of holding his own against a weak Spanish screening a bad mason, because he cannot attack France, nor any other European power. Egypt by Britain, Tripoli by Italy, Tunis by Spain, and Algeria by France. Morocco being the last independent Arabian State, will soon fall into the hands of France. No one is likely to interfere with it. If Europe does she interferes with the British extension to the Mediterranean. Germany cares little how France may transfer her power in foreign countries, so long as it does not diminish her power in Europe. Besides, when the Dutch line comes to an end in Holland there will be a further partition of small States to be made in which both Germany and France will be interested.\n\nJUSTICE.\nThe Woman's Philanthropist.\nA woman's philanthropy is a woman's work for humanity. Fully answered all questions which modesty prevents asking a smile which causes and symptoms of all diseases. This book contains a complete course in plain language, written by ladies who have made various diseases their special study. It is written in plain language which every woman, young or old, could read. It is now recorded by the United States Patent Office as a work for the age. Handsomely bound and illustrated. Sent postpaid for $1.00.\nAddress the Rochester Publishing Co., No. 304 Main, Albion, Mich., Rochester, N.Y.\n\nMrs. J. F. Butten, Mrs. Miss Butler, and Miss Butler, Prince Albert, N.W.T., on Wednesday, and in response to the question of Mr. Robb, Boyle, Prince Albert.\n\nTHE GABLE HOUSE.\n\nPrince Albert Bakery.\nW. R. Bell,\nConfectioner and Baker\n\nTHE WEST END HOUSE.\nMeals at all Hours.\nGood Beer and Cigars always on hand.\nGood Boarding Stable in connection.\nR. J. O'Leary\nProprietor\n\nEAST END BAKERY.\nBread unsurpassed by any firm of Winnipeg.\nNine Loaves for $1\nAll kinds of cakes and Pastries Made to Order.\nHugh McDougall, East End Bakery.\n\nPUBLIC NOTICE.\nAll persons are hereby required to take notice that the cutting of timber on any land within the jurisdiction of the Minister of the Interior or the Land Commissioner, or any part thereof, is prohibited by law, and such timber as cut without authority is liable to seizure, and the owner thereof liable to prosecution under the provisions of the Act of the Interior may direct.\n\nAny person who cuts or quarter cuts not having timber on it, may, on conviction before a Justice of the Peace, be ordered to remove the timber, or be fined $50.\n\nAny person who cuts timber on Dominion lands, purchase a wood lot on Dominion lands, or remove at $6 per acre.\n\nAny person who cuts timber on any other description of land, must make application thereto to the Minister of the Interior or the Land Commissioner, or any part thereof, and such application according to law. Persons who cut timber on Dominion lands without authority must pay the fine of $50, and be ordered to remove the timber, or be fined $50.\n\nThis notice is given in pursuance of the provisions contained in the Act of the Interior as stated under the Dominion Lands Act.\n\nD. J. Waggoneer,\nCrown Timber Agent.\n\nFURNITURE.\nJust arrived, in addition to our former large stock we have received:\n\nFancy Parlor Bedroom Sets.\nBedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\nChairs of nearly all descriptions.\nCradles & Cribs for the Babies.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & C. E. Carter,\nKnox & Barker,\nCarpenters, etc.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\nFire! Fire! Fire!\nPump on Water.\nWells sunk and Pumps made and repaired.\n\nOrders left at J. L. Johnson & Co. will be promptly attended to.\n\nNathaniel Acorn,\nPrince Albert.\nMANITOBA.\n\nRAIL PORTAGE.\n\nFrom the Progress, June 24.\n\nStreet improvements in Winnipeg are now proceeding at a rapid rate. The sidewalks of Second Avenue are being constructed, and the contractors have already laid several feet of concrete along this street, between Main Street and the railway yard. The work is progressing steadily, and the citizens of Winnipeg will soon be able to enjoy the advantages of properly paved streets.\n\nA HIGH SCHOOL.\n\nFirst Case by Express.\n\nWe are glad to announce that the Provincial Assembly has taken action on the petition from the citizens of Winnipeg for the establishment of a high school. We present the following from their circular:\n\nNEW SPRING & SUMMER MILLINERY.\n\nAND FANCY GOODS.\n\nMISS MACK & CO.,\n\nCAMPBELL'S BLOCK,\n\nROBERT THOMSON,\n\nSign & Ornamental Painter.\n\nDecorative Painting & Stenciling.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO!\n\nEAST END NOTICE.\n\nI hereby inform all subscribers that on Monday, July 15th, I will be engaged in repairing ironwork and everyone who has any ironwork done in their houses. I can be reached by telegraph or personal visit.\n\nMENNONIA.\n\nFrom the Tribune, June 16.\n\nThrongs of people turned out to witness the proceedings of the annual meeting of the Mennonite Church of Manitoba. The services were conducted by Rev. J. F. Hutter, followed by a sermon by Mr. Hutter. The meeting was a great success, both financially and otherwise.\n\nPORTAGE LA PRAIRIE.\n\nFrom the Reviewer, June 27.\n\nFarmers will commence cutting hay next week.\n\nThe cricket club concert on Wednesday evening was a great success, both financially and otherwise.\n\nThe cricket club concert from Portage Lake Park on Friday night was also a great success, both financially and otherwise.\n\nWINNIPEG.\n\nFree Press, June 30.\n\nA sale of lands has been arranged between the Dominion Government and the Canada Southern Railway Company.\n\nThe Canadian Pacific Railway Company has extended an offer to purchase land in the city limits of Winnipeg. The offer is in the form of a written agreement, and the company has agreed to pay $15 per acre for the land.\n\nA HIGH SCHOOL.\n\nFirst Case by Express.\n\nWe are glad to announce that the Provincial Assembly has taken action on the petition from the citizens of Winnipeg for the establishment of a high school. We present the following from their circular:\n\nNEW SPRING & SUMMER MILLINERY.\n\nAND FANCY GOODS.\n\nMISS MACK & CO.,\n\nCAMPBELL'S BLOCK,\n\nROBERT THOMSON,\n\nSign & Ornamental Painter.\n\nDecorative Painting & Stenciling.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO!\n\nEAST END NOTICE.\n\nI hereby inform all subscribers that on Monday, July 15th, I will be engaged in repairing ironwork and everyone who has any ironwork done in their houses. I can be reached by telegraph or personal visit.\n\nMENNONIA.\n\nFrom the Tribune, June 16.\n\nThrongs of people turned out to witness the proceedings of the annual meeting of the Mennonite Church of Manitoba. The services were conducted by Rev. J. F. Hutter, followed by a sermon by Mr. Hutter. The meeting was a great success, both financially and otherwise.\n\nPORTAGE LA PRAIRIE.\n\nFrom the Reviewer, June 27.\n\nFarmers will commence cutting hay next week.\n\nThe cricket club concert on Wednesday evening was a great success, both financially and otherwise.\n\nThe cricket club concert from Portage Lake Park on Friday night was also a great success, both financially and otherwise.\n\nWINNIPEG.\n\nFree Press, June 30.\n\nA sale of lands has been arranged between the Dominion Government and the Canada Southern Railway Company.\n\nThe Canadian Pacific Railway Company has extended an offer to purchase land in the city limits of Winnipeg. The offer is in the form of a written agreement, and the company has agreed to pay $15 per acre for the land.\nREPORT OF THE DELEGATES TO LOUIS RIEL\n\nIn reply to the report of the delegates who went to Montana to interview Mr. Louis Riel.\n\nTo the gentlemen of the Committee intrusted with the secret mission, appointed by the Government of the North-West, Hon. Wm. Creighton, President, Louis Simond, Secretary.\n\nGentlemen—As your delegates for that purpose, we have made a journey of about 700 miles to seek an interview with Mr. Riel. We had to go into the country of Mr. David Thompson, near St. Peter's Mission, in the Counties of Leduc and Clark, beyond the River Red, at the foot of the Rocky Mountains. We found him there after having approached him with the object of our mission; we handed him our credentials and told him our errand. We then proceeded to meet with him, also the document whereby he had public notice given to the North-Western people that he was prepared, if he could, and did, to make peace. This interview took place on the 4th of June. Mr. Riel said that he would be willing to be allowed twenty-four hours to think the matter over before giving us an answer. He spoke to me very kindly. Mrs. Riel in a very friendly manner. Their conduct was smooth, simple and true. They invited us into their house of a very poor man, the feeling of the winter was more or less painful, but certainly Mr. Riel was very kind. The dinner was delicious. The kindness of his house reminded us of the opportunities that had been afforded us to become rich, and how easy it makes to become rich, and how easy it makes to become poor, and how all risks are stood by the conductors of this great work. We were very much struck by the Manitoba and how much she struggled for the whole North-West, and seeing how much she was doing for the Indians back, after a long trip of about 1,000 miles, with twice as much cold, disease, sickness, and death, and seeing her seek him in a foreign land. After taking into consideration the object of our mission, we thought that Mr. Riel from the other side of the line would be of use to the North-West, also that he had been very kind to us, and that he would do what he could to help us, so far as he had any power, those who happened to be in need of help. We thought that the North-West Indians needed particular care due to the fact that they had suffered a great deal for the cause and suffering, that he had yet interest in the Indians, and that he was willing to go and stand behind them, and that he would do what he could to help us. We thought to accompany us with his wife and children, and to start with him on the 18th of June. That trip would have been pleasant in every respect, except that Mrs. Riel had great trouble with her baby, which fell sick through exposure; we sincerely hope that she will get well soon, and that child will soon recover. Mr. Riel came to help in many ways, and we hope that he will be quite content and that this settlement will see its way to do what is right for the North-West. Further information with regards to our delegation will be given to your committee at your earliest convenience, as you may see fit, and we have the honor to submit herewith the written answer given to the delegation by Mr. Riel, which answers all the questions we put to him, and gives a full account of the result and on the line of action which we have to follow. His communications are very clear and to the point, and we feel very confident, as his intentions are to help us, but, if we understand him well, he will not be able to give us any great assistance to embarrass the Government. We have the honor to be, Gentlemen, your delegates and representatives,\n\nJ. H. DUNBAR, J. BOWLES, MONTREAL, JULY 10, 1884.\n\nNEW SPRING GOODS.\n\nJUST ARRIVED AT J. M. CAMPBELL'S, A Full and Well Selected Stock of Dry Goods AND Groceries ALSO Stoves, Ploughs, etc.\n\nNEW GOODS AT MEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, SPIC'S, FANCY GOODS, including Atkinson's Colgate's, Lubin's and Lambour's Perfumery, Pear's and Colgate's Fancy Soaps Hair Brushes, including Scott's Electric and Infants', Celluloid, Horn and Rubber Combs, Tooth Brushes, Tooth Picks, Breast Pumps, Feeding Bottles, Eno's Fruit Salts, etc., etc.\n\nT. K. JACKSON, AT THIS OLD STAND.\n\nWatches, Clocks, Jewellery, Stationery.\n\nR. B. WAY, Post Office, Prince Albert, N.W.T.\n\nPUMPS!\n\nMade and always on hand at greatly reduced prices.\n\nWAGGONS, BARROWES AND BOATS repaired with neatness and dispatch.\n\nWILLIAM CROSS, Boots and Shoes CHEAP.\n\nBoots AND Shoes\n\nIn Prince Albert and are selling at prices which defy competition.\n\nCUSTOM WORK\n\nREPAIRING\n\nPromises attended to.\n\nSHANNON & MCLEOD\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nNOTICE!\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that after June 30th their terms will be net cash to all who do not make satisfactory settlement of their accounts to that date.\n\nN.B.—A good supply of American Coal Oil now on hand.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nTHE PRINCE ALBERT TIMES\n\nAND SASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in Advertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETY, PROPS.\n\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884071101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 5705, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5432, 1], [5432, 14006, 2], [14006, 17761, 3], [17761, 23673, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]