[{"id": "bae23e07836578ff26f30e8ff4f7746b285424c7", "text": "The Prince Albert Times\nAnd Saskatchewan Review.\n\nVol. 6 - No. 49\nPrince Albert, Sask., Friday, November 9th.\n$2.50 per year.\n\nBanking House\nMacarthur & Knowles, Prince Albert, N.W.T.\nTranquility Guaranteed Banking Business.\nInterest allowed on Deposits.\nNotes Discounted.\nDepositary available at all points in the Dominion.\nCollections undertaken, and promptly secured by\nBankers - Merchants Bank of Canada\n\nWilliam V. MacKie\nAdvocate, Notary, Etc.\nMoney loaned on first mortgages of landed property, at fair rates of interest.\nPrince Albert, Sask., N.W.T.\n\nBrewster & McKay\nAdvocates, Solicitors, Notaries Public, Etc.\nPrince Albert, Sask., Etc.\nJames McKay, Manager\nLaw Office, 2nd floor of Hunter Building\n\nW. GUNN, M.A.\nAdvocate, Notary Public, Conveyancer.\nPrince Albert, Sask., N.W.T.\n\nH.\nAdvocate, Notary Public.\nPrince Albert, Sask., N.W.T.\n\nJ. Lestoek Reid\nDominion Land Surveyor.\nPrince Albert, Sask.\n\nA.C. Patterson, OK.\nAdvertising Agent.\nOrders filled in promptly and accurately.\nAdvertising copy prepared.\n\nRobert Thomson, Sign and Ornamental Painter.\nCalumetts and Paperhangings on Short Notice.\n\nDecorative Painting a Specialty.\nROYAL MAIL STAGE\nWeekly between Prince Albert, Regina, and Prince Albert.\nLeaving Prince Albert about noon, arriving Regina every Tuesday morning.\nPassengers accommodated.\nLessons & Scott.\n\nRobt Buckley\nAuctioneer, Accountant, Estate and General Agent.\nHas on hand a number of Town Lots which will be sold cheaply at any time.\n\nImproved Farms.\nOswestry\nPrince Albert, N.W.T.\n\nQueen's Hotel.\nT.G. Crozier, Proprietor.\nIncome tax, Net Income tax, Excise tax,\nIncome from rentals, Services connected therewith.\n\nTHOS ORAM\n\nA Choice Lot of Apples and Lemons\nAt the City Confectionary and Fruit Store.\nAlso A Lot of Choice To packed & Sealed Coffee,\nTea, Coffee, and General Groceries.\nGeneral Groceries.\n\nR.T. Goodfellow\nCorner River and McKay Streets.\n\nThe Latest News.\nHere arrives special telegrams containing\nall important and interesting news of the day.\nPRINCE ALBERT'S PHARMACY\nPROFESSIONAL PHARMACY\nAT COST\nAcid and Acidic Mixtures.\nOverstocked with Chalk stock.\nExtrastra Importations.\nEspecially recommended for rest recommendations.\nP. LaSalle\nProprietor.\n\nA Choice Lot of Watches, Rings,\nSilvert Buttons, etc.\nJUST REACHED AT THE POST OFFICE JEWELLERY STORE\nCall and examine, and see how your favorite has been treated to modern standards.\nR.B. Way\nImports Exclusively Licensed.\nBURGLES AND SHOES\nOur goods are noted for their fashionable shape and superior quality.\nNew models regularly displayed.\nCentur Work made and repaired.\nBurges and Shoes at our store 30% off regular price.\nCome in and see what we are doing.\n\nS.McLeod & Co.'s\nNOTICE:\nMISS AULD\n\nMemo to inform the ladies of Prince Albert and vicinity that the ladies have opened out of business effective October 1st. Miss Auld, Francis Williams, and McCullough.\nWe are now prepared to give our attention to the sale of Ladies' Fashion goods, Hosiery, Millinery, Fancy Gowns, and other goods.\nWe will open at our new location at the Prince Albert, pr. E. St. Louis, E. St. Louis.\nWe would respectfully request that everyone connected with the trade to cooperate and assist in our effort to keep Prince Albert in fashion.\nMiss Auld & Co.\n\nProfit Sale.\nSelling everything in stock at low prices.\nWe have a large and well-stocked stock of Millinery and Fancy Goods.\nHaving received the services of a First-class Dress & Manteau Maker.\nIn the past, we have been able to execute all orders promptly as far as the latest fashion.\nOur goods are noted for their fashionable shape and superior quality.\n\nMiss Auld & Co.\nNOTICE:\nMISS AULD\n\nMemo to inform the ladies of Prince Albert and vicinity that the ladies have opened out of business effective October 1st. Miss Auld, Francis Williams, and McCullough.\nWe are now prepared to give our attention to the sale of Ladies' Fashion goods, Hosiery, Millinery, Fancy Gowns, and other goods.\nWe will open at our new location at the Prince Albert, pr. E. St. Louis, E. St. Louis.\nWe would respectfully request that everyone connected with the trade to cooperate and assist in our effort to keep Prince Albert in fashion.\nMiss Auld & Co.\n\nFOR SALE OR RENT\nTHE LELAND HOUSE\nPRINCE ALBERT\nOwned by the late Hon. Mr. Henry Leland, Esq., of Toronto, Ontario.\nFor Sale or Rent.\nB. F. Follock\nProprietor.\n\nOne More Great Clearing Sale.\nNext at Martelknife Mill.\nNews of Indians being present is reported.\nJohn's residence on the banks of the North Saskatchewan River is occupied.\nNews of Incidents and Information from all parts.\nOUR TIMES OF NEWS.\nL.R. ST. LOUIS\nHandmaster P.A.C Band\nAnd Leader of the Prince Albert Quartet.\nMusic arranged for special occasions.\nApply personally to\nLR ST. LOUIS\n\nEXCLUSIVE LAUNDRY\nGiven at Starforth\nDuck Lake.\nAn exclusive service to the people of Prince Albert and vicinity.\nFresh Linen and Clean Laundry.\nService arranged for special occasions.\nApply personally to\nSTARFORTH\n\nPRINCE ALBERT REVIEW\nNovember 9th, 1893.\n\nReport of the Committee of Inquiry into the Death of Mrs. McPherson.\nCOURT AT BATTLEFORD\nPlateau Road, Prince Albert.\nThe Court opened Tuesday morning at 10 o'clock.\nThe police have been requested to assist in the investigation.\nWeather fine, but cold wind and rainy weather.\nDUCK LAKE\nThe meeting on Friday last was addressed by Revd. Smith.\nQuite a number of the farmers who are taking wheat to Battleford for sale came out to discuss matters.\nWeather fine.\nFOR SALE OR RENT\nTHE LELAND HOUSE\nPRINCE ALBERT\nOwned by the late Hon. Mr. Henry Leland, Esq., of Toronto, Ontario.\nFor Sale or Rent.\nB. F. Follock\nProprietor.\n\nNECROLOGY\nMISS AULD\n\nMiss Auld, of Prince Albert, passed away recently after a short illness.\nShe was an active member of the local women's club.\nHer death is regretted by her friends and family.\n\nMISS AULD\n\nMiss Auld, of Prince Albert, passed away recently after a short illness.\nShe was an active member of the local women's club.\nHer death is regretted by her friends and family.\n\nHow to Save Money.\nMr. E.H. McCafe, Manager of the Hudson's Bay Company, Lynn, Minnesota, suggests a savings scheme for the next five years, and expend upwards of $800 during the period.\nEmployment physicians and dental specialists.\nSpecial offers on many items of clothing, shoes, etc., without obtaining obligations.\nYour advertisement included move me, to contact Basil Baillie, Esq., to meet any queries.\nYour satisfaction guaranteed Levittown, Iowa.\nWood and river water available at discount.\nWe have added some new farms to our list, and are pleased to announce that the public can depend on getting a good meal at the end of each week.\nSales.\nBurro be Flat rate, and most of the others.\nBurros run once a week, and are more affordable than ever before.\nBurros run once a week, and are more affordable than ever before.\n\nTO TOWN AND IMPROVED FARMS.\nBURROS.\nBurros run once a week, and are more affordable than ever before.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nTERRITORIAL NEWS\n\nRIGGINA.\n\nFrom the Leader, Oct. 25.\n\nMr. Caron, of the Public Works Department, has been removed to Calgary. Mr. Caron and family went to Calgary last week.\n\nThe M. L. A.'s have this morning met at Moose House for a Christmas dinner. Hon. David Ross, Capt. Henry Mitchell and Richardson, Mr. James McLeod is also here.\n\nA meeting of the Royal Order of Canada was held in Prince Albert today. The chair was occupied by President Mountz. Hon. Norman was present and Mr. B. E. Bradwell, Trustee, the first meeting being held on Thanksgiving Day, November 26th. Hon. Norman was chosen chairman and Mr. Bradwell Vice-Chairman. All appointments and everything possible is being done to make the day a success.\n\nBATTLEFORD.\n\nFrom the Herald, Oct. 26.\n\nA second violent act of Sandy Wood's mischief last week before it was shot.\n\nSome weeks ago Mr. Schiller's workshop between Saturday night and Monday morning and removed a pair of windows which badly glinted.\n\nThe Rev. J. J. Taylor, Mrs. Taylor and family returned from Prince Albert on route to Oskar Lake. They took the journey at Battleford, stopping at the home of Mr. Morris. Mr. Taylor takes charge of the Cerebral Missionary Society's station at Oskar Lake.\n\nAs a result of a few dissensions among the farmers of the district, at the close of the agricultural society meeting on Monday, Mr. F. G. Bradwell, the chairman, made a statement that it costs 40 cents per loaded to make oats for market, and will do so as long as the present circumstances of the country continue.\n\nFORT MACLEOD.\n\nFrom the Globe, Oct. 25.\n\nThe Cochran Bandos Club conducted a dinner and dance during the present season. Some from this remote fetched £15 6s per head in England.\n\nLast night will long be remembered as one of the most memorable nights of Macleod. Mr. Harry Taylor, a public spirited citizen may own night feel proud of possessing such a large number of people from all parts of the district in a banquet, which he gave in honor of Mr. F. G. Bradwell, M. L. A. The banquet was attended by Mr. Bradwell, who is nearly surrounded by larger affairs of a similar nature in the east. Mr. Bradwell is in the midst of a campaign, dealing mainly with the liquor question and the question of self-government. Among those present at the dinner were Mr. Wilson who was the only member supporting the license system. He assured three present that Dr. Wilson would find a strong supporter in him.\n\nEDMONTON.\n\nFrom the Bulletin, Oct. 20.\n\nReported to be a policeman riding in Edmonton from Athabasca on Friday night, but has since been heard to say a bush alongside the road by some person concealed there. He was not struck.\n\nAccording to latest reports, the party accompanying the horseman, who it is said were two white men, who broke off with him, and a Blackfoot Indian. The rider was seen to be searched and the white men have been brought off from George having him alone.\n\nOn Monday night D. S. McKay, living about two miles west of the town on the road to Edmonton, was killed by a bullet amongst his feet, while going to investigate a house a man going away with one or more of his horses. He was killed for making the third time he refused to stop. He was sent west in the police car to Edmonton west next. Following the occurrence there by the train they came upon the remains of a horse which he had started the chickens. The ashes were still warm when the police arrived but Keeseeawans had gone on.\n\nQUAPPULIE.\n\nFrom the Palliser, Oct. 30.\n\nThe Rev. Alex. Macquillan and family, of Prince Albert, arrived in town today, the names of their former telegraph office to other places of habitation.\n\nOn the evening of yesterday R. W. Roy, Wm. H. Bell, G. S. W., G. L. M., and W. Roy, H. B. Van Erp, of Winnipeg, visited the Quappulie Valley Lodge, A.F. & A.M., for the purpose of conferring and instructing the brethren in masonry. The visiting brethren first delivered the instructions to the members of the lodge, translated them by means of a stenographer, after which R. W. Roy Bell delivered a discourse on the subject of Freemasonry. At the close of the meeting the brethren were entertained at suppers by the lodge, the guests dining at the Indian Head, where they delivered their return before the Indian Head Lodge.\n\nAbout six inches of snow fell on Well Head last night in very soft and melting away.\n\nWheat is selling now from $1 to $2 10. Barley is selling from 20 cents per pound. Eggs 20 cents per dozen. Potatoes are also sold at from 20 cents to 25 cents per barrel. Oats are selling at from 20 to 25 cents per barrel. Barley 30 cents to 40 cents.\n\nSILK RIBBONS.\n\nThose of our lady readers who would like to have an elegant, large package of extra fine, assorted Ribbons (by mail) directed to us, will find them a valuable addition; adapted for Bonnet Strings, Neckwear, Scarfs, Trimming for Ladies' Hats, etc. We pay Postage, and can get any article we desire, according to the recent failure of a large number of orders. We are now addressing only 25 cents to the address we receive.\n\nAs a special offer, this house will give away any order for any other item in American type will send any order to P.O. address of the newly married ladies in this paper. No prices less than one dollar will be charged. Orders will be filled promptly. Children in need of clothes will be sent 10 cents each. We will send any order to P.O. address of the newly married ladies in this paper. No prices less than one dollar will be charged. Orders will be filled promptly.\n\nRUMOR AGENCY, Jersey City, N. J.\n\nPaine's Celery Compound\n\nUPES Nervous Prostration, Nervous Debility, Neuralgia, Weakness, Loss of Appetite, Liver Complaints, and all affections of the Kidney.\n\nWEAK NERVES\n\nPaine's Celery Compound is a nerve tonic, containing potash, iron, and other wonderful stimulants, it speeds up the circulation.\n\nRHEUMATISM\n\nPaine's Celery Compound purifies the blood, cleanses the liver, and removes the causes of rheumatism. The kidney complaint.\n\nKIDNEY COMPLAINTS\n\nPaine's Celery Compound quickly restores the kidney function. It is the best remedy for all kidney complaints.\n\nDYSPERIA\n\nPaine's Celery Compound strengthens the stomach, and quiet the nerves of the digestive organs. It is the best remedy for all cases of dyspepsia.\n\nCONSTIPATION\n\nPaine's Celery Compound is a natural laxative. It is a nutritious, giving easy and natural relief to the bowels. Restores many nervous conditions. Used for both constipation and diarrhoea.\n\nWELLS, RICHARDSON & Co., Proprietary, Montreal, P. A.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality. Catalogues Free.\n\n\"BELL\" & CO., Guelph, Ont.\n\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS Far surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nTOWN COUNCIL.\n\nOn Monday evening last Coun. McPhail, Mr. Pierson, Knowles, Davis, Appelton, and Johnson assembled at the Civic Board to have their usual weekly meeting.\n\nHis Worship the Mayor not being present Coun. Knowles moved to elect Mr. Pierson in his place to occupy the chair. Carried.\n\nCOMMITTEES.\n\nA communication was read from W. Maclean, Almshouse Trustee, asking Mr. Pierson to take charge of the E. C. School District, asking for $350. From Mr. Maclean's request for a drug store, Mr. Pierson replied that he could not agree.\n\nA by-law to regulate the storage of gunpowder etc., and to be signed by him No. 8 was introduced.\n\nCoun. Johnson, chairman of the Board of Works, presented the report of that committee, which recommended the payment of several accounts amounting to nearly $600.\n\nThe Fire, Water and Light Committee recommended the payment of the following accounts: Mr. D. Murray, $25; Mr. Dunlop, $25 50; Mr. Moffat, $25 07. The same committee recommended that the report as agreed to be referred to the arbitrator for settlement.\n\nThe council went into\n\nCOMMITTEE OF THE WHOLE.\n\nTo consider the report of the Fire, Water and Light Committee. Coun. Stewart in the chair. At 10 o'clock the committee rose, but no motion being put they decided to meet another hour.\n\nUp to this hour a lot of useless discussion had been going on, and even though the operative were under the impression that they were allowed to add to the fire ward, the council had threatened a couple of times to send them away.\n\nCoun. Stewart moved and Coun. John seconded: That the Fire, Water and Light Committee be instructed to report the next meeting of the council whether so far that the task before them is referred to the solicitor. The motion was lost, it only getting the support of Coun. Davis, Stovesh and McKeown.\n\nSome more valuable time was again consumed in a lot of useless chatter, but the council decided to break up, although they would get through the work.\n\nCoun. McPhail moved and Coun. John seconded: That the Fire, Water and Light Committee be instructed to report the next meeting of the council whether so far that the task before them is referred to the solicitor. The motion was lost, it only getting the support of Coun. Davis, Stovesh and McKeown.\n\nIn amendment Coun. Davis moved and seconded: That the Board of Works be instructed to erect the new water main and sewers on King Street from River Street to Ferry Street. But the above motion and amendment were rejected.\n\nA motion by Coun. Agnew seconded by Coun. Stewart: That the council pay over the balance of the money between the two dry stores, that the same be paid out of the general fund and that the balance of the Board be instructed to do the work, was carried.\n\nCoun. Agnew moved and Coun. Davis seconded: That the Board of Works put down the new water main on River Street as ordered by the last meeting of the council. Carried.\n\nA by-law to be signed by No. 8, for the prevention of fire and accidents, was put through its various stages and ordered to be engrossed.\n\nCoun. Agnew moved and Coun. Davis seconded: That the letter from W. T. Maclean be referred to the solicitor.\n\nCoun. Agnew moved and Coun. Davis seconded: That the report of the Fire, Water and Light Committee be adopted except the item re tank which is to be referred to the solicitor, also the report of the Firemen's and Mechanics' reports be embodied in the minutes of the Committee. Carried.\n\nThere being no more important business to be done and as the clock had just struck one, the council adjourned.\n\nGoing to the newspapers and a widespread circulation of forged bills of the bank of British North America, it has decided to withdraw all bills of that denomination from this circulation.\n\nMEDICINE HAT.\n\nFrom the Times, Oct. 25.\n\nConsiderable rain fell on Tuesday.\n\nThe Saskatchewan River is very low.\n\nF. Hodgson, commandant of the work camp, of which Mr. Hodgson is in charge, has disappeared.\n\nMr. Pierry, of Fort Saskatchewan, was on his way east yesterday morning to Toronto. Mr. Pierry will enjoy a vacation of several weeks, and on his return will be able to report on the progress made.\n\nCrowfoot, chief of the Blackfoot Indians, accompanied by three minor chiefs, left Medicine Hat yesterday morning for the boundary line. It is understood that his mission is to meet the Gros Ventres Indians, for the purpose of making peace between the two nations.\n\nCALGARY.\n\nFrom the Tribune, Oct. 24.\n\nMr. Markley, president of the Canadian Pacific Railway Company, arrived in town with his wife Wednesday, and will take up his residence here.\n\nMr. Justice Bowden delivered judgment in the case on the appeal court of the Northwest Land Surveyors on the decision of the Court of Revision on the assessment of 1887.\n\nGO TO AGNEW'S FOR Stoves Stoves Heating Drums Stovepipe Coal Oil T.J.AGNEW FOR THE Best Assorted Stock OF CONFECTIONERY GO TO H. M'DOUGALL'S BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDONALD THE WEEKLY EMPIRE Canada's Leading Paper.\n\nTHREE MONTHS FREE to every subscriber paying for one year in advance before 1st of January, 1888.\n\nFIFTEEN MONTHS FOR $1.\n\nNow is the time to subscribe.\n\nAddress THE EMPIRE, Toronto.\n\n52 FOR $1 EXTRAORDINARY REDUCTION!\n\nTHE WEEKLY CALL CANADA'S LARGEST PAPER.\n\nREDUCED TO $1 A YEAR!\n\nIn order to keep the circulation of THE WEEKLY CALL growing, we have reduced our subscription price from $2 to $1 a year. We believe that THE WEEKLY CALL is entitled to the patronage of every reader interested in the affairs of the Dominion. We have therefore reduced our subscription price from $2 to $1 a year.\n\nExtraordinary this great reduction, the high standard of the paper will be maintained in every respect. Our readers will find in each number a full list of correspondents throughout the Dominion, and in each issue a complete list of the papers and journals received from every point. Its telegraph news from all parts of the country, its extensive correspondence, its varied and interesting articles, its excellent advertisements, and its prices, are fully reported. Among its contributors are many of the best known writers in the country, and among its advertisers are many of the leading firms in the Dominion. It is the only newspaper that can be purchased at any point in the Dominion.\n\nADVERTISERS Can learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspapers Advertising Bureau, 10 Spruce St., New York.\n\nKEEP CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nPINK FLINTS, back-bone breakers, self-actuated, patented by Cuthbert Murray, Canada.\n\nFREE! FREE! FREE! FAST!\n\nIn our columns the Cuthbert Murray Patent Back-Bone Breaker, self-actuated, patented in Canada, U.S.A., Great Britain, Australia, New Zealand, South Africa, India, Japan, China, Korea, Persia, Turkey, Egypt, and all other countries.\n\nADVERTISERS Can learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspapers Advertising Bureau, 10 Spruce St., New York.\n\nTHE GREATEST DOLLAR'S WORTH OFFERED.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888110901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 5307, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6984, 1], [6984, 6984, 2], [6984, 14208, 3], [14208, 21354, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]