[{"id": "f21bdb9ab03fec51e6f52148ea920bae3af8a691", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N. W. T.\nTUESDAY—8:30 p.m., in advance\nof the regular issue, each week.\nA new issue will be inserted in this\npaper every fourth Tuesday.\nAdvertising rates—$1.00 per column inch.\nAdvertisements without instructions will\nnot be accepted.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Anne's and St. Mary's Churches.\n11 a.m.—Morning Service in both Churches.\n12 noon.—Lunch at the Church Hall.\n4:30 p.m.—Evening Service in both Churches.\nIn charge, Rev. A. H. Wright.\n\nThis Paper may be had free by subscription.\nSubscription Rates—$1.00 per year.\nAddress all communications to the Editor.\n\nNEW YORK\n\nFRIDAY, OCT. 29, 1877\n\nIt is quite clear that the subject of commercial union will come up in the arguments of the future, so that those who were looking forward to the meeting of the commission to see the whole question settled in an off-hand way by Canada conceding the right to American fishers not to make any demand whatever at pleasure in exchange for commercial union with the United States, may as well make up their minds to disappointment. The name of the Canadian commissioner has not been officially made known, and although all eyes naturally turned to Sir John Macdonald, the man chosen is Sir Charles Tupper.\n\nThe prosecution of Dublin newspapers for printing reports of Nationalist meetings which have been proclaimed by the Government has so far turned out a failure. The Crimes Act provides that a newspaper which publishes any report of an illegal meeting shall be liable to be suppressed. Any meeting is illegal that is proclaimed by the Government. This interference with the freedom of the press is not disliked in Ireland, and even in England where everything Irish is looked upon as a nuisance—except Irish whiskey—there is considerable disapproval of the gagging of the press. Gaggings the press is wrong, and that will be seen as an entirely new attempt to apply the gag in Dublin. Just now the Government authorities in Ireland are having themselves laughed at, through their failure to secure the arrest of Lord Maynooth Sullivan, who owns a newspaper which offended in the way referred to. The break down of a protestation always has a bad moral effect, but the very fact that the protestation will not stick does show that the judges who are trying the cases are not the hardened Jeffries that they have been described. The Dublin Castle authorities are evidently at their wits' end in trying to keep the streets as clean as possible from the Nationalist knaves, as long as they succeed in doing so by pressing down the lids is problematical.\n\nThe Toronto Telegram says: As it is apparent there will be several bye-elections held in Parliament next month, the suggestion is made by Mr. Goldwin Smith that advantage should be taken of the opportunity to test the feelings of the farmers on the question of commercial union. This subject has been the main topic of discussion on the platform and in the press for some time, and its advocates are found declaring that it has made remarkable headway among the agriculturists. In view of the case, the effect can be readily determined by the bye-elections by observing the farmers vote, that is, if the farmers take sufficient interest in it to put their party politics aside and vote on the question. The real point of the agitation is that the farmers put themselves on the question of commercial union, although it may be assumed that the Reform party is steadily growing more favorably disposed toward the idea, the Conservative party is drawing away from it. Sir John is known to disagree with it, Mr. Chapleau has spoken against it, and the Conservative press is generally opposed to it. It is only when they get a chance. On the other hand Mr. Laurier has been squirming somewhat violently in the direction of commercial union, Sir Richard Cartwright has announced his approval of it, and the Reform party may be taken to be backing it up. There are straws showing which way the wind is blowing. If the farmers could be induced to leave their party prejudices behind and sweep the country with their votes, then the party who professed to know the farmers best say that their politics is ingrained into them like their religion, and that they would no more think of changing the one than they would of changing the other.\n\nMYSTERY.\n\nMARVELOUS—INCORRIGIBLE.\nLionel Daintree, the celebrated farceur, has written and acted in a number of works, which are acknowledged in all parts of the world to be far superior to those of his contemporaries. His genius is such that he is able to produce only artist who grasps with bearded skill and exquisite manipulation feats of modern art, which are impossible to anyone else. He has been engaged in a series of the most puzzling, bewildering, marvellous, incomprehensible and extraordinary illusions, which have been the subject of comment for many years, and all have been transported into the realm of the mysterious and the unknown.\n\nRead the following clipping from the New York Herald: \"The Grand Opera House was crowded last evening to witness the great English pantomime 'Black Art,' as performed by Lionel Daintree. The performance was a most brilliant affair, and the audience was delighted with the spectacle. It was performed nightly by the same company, and the performances are as follows: Monday evenings the pantomime is given in full, Tuesday evenings the pantomime is given in a shortened form, Wednesday evenings the pantomime is given in a shortened form, Thursday evenings the pantomime is given in a shortened form, Friday evenings the pantomime is given in a shortened form, Saturday evenings the pantomime is given in a shortened form, Sunday evenings the pantomime is given in a shortened form.\"\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., 10 Spruce St., New York. Send 10c for 100-Page Pamphlet.\n\nTHE SUN!\n\nDAILY AND WEEKLY.\nIndependent in Politics.\nThe Leading and Popular Paper of the CANADIAN NORTHWEST.\nHas a City Circulation Greater than the Combined Circulation of All Other Western Newspapers. It is recognized as the Great Advertising Medium.\n\nAMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nMINTON & CERROD.\n\nNotice.\n\nCall and inspect our improved Heating Drums.\n\nStoves and Stovepipes put up and cleaned on short notice.\n\nPanel Doors and Sash.\n\nSchool Books and Stationery.\nPublic and High School Text Books.\nSchool Requisites of every description.\nStephens' Blue Black Ink.\nALL SIZES—WRITING AND COPYING.\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED.\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimey Rugs, Window Curtains Red and Yellow, Door Mats, Cotton Silk Corded Cushions, Empire Cloth in Black and Garnet, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beezee Veiling, Linen Muslin Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Readymade Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Pigs, Dates and Tinned Goods of all kinds.\n\nInspection is solicited.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling\n\nAMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nMINTON & CERROD.\n\nSubscription Price\n\nDaily—5c per week; 20c per month; 30c per quarter; $1.00 per year.\n\nTRIMLY IN ADVANCE.\n\nAddress\n\n\"The Sun,\" Winnipeg.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspapers in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of current European, Canadian and United States News.\n\nSpecial news stories compiled by reliable correspondents throughout Manitoba, the Northwest Territories and the United States.\n\nComplete reports of Parliamentary proceedings at Ottawa.\n\nThe Morning Call alone receives the night dispatches of the United Press and the Associated Press, and a news service unequaled anywhere in the great nation.\n\nSubscription rates: One Year $5; three months $1; Six Months $2.50; Quarterly $1.50; Monthly $1; Weekly 10c (free to any address on application).\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nADTON BROWNA, President and Editor-in-Chief.\nThe Northwest Council\n\nThe sixth and probably the last session of the present Legislative Assembly was held early this month.\n\nAs members of the council know, the debate was prolonged in the absence of prominent citizenry and secretaries, who were distinguished by their attendance at the same assembly a year ago, all the available rooms in the Council Chamber being utilized. At 12 o’clock last evening, Lt. Governor Arthur Pearson appeared unexpectedly, and escorted by the guard of the Mounted Police, and the Mountie Police Band, arrived at the Chamber.\n\nThe following members were present:\nLieut. Richard O’Brien, Hon. Macdonald, Hon. David B. Smith, Hon. James C. Graylay, Hon. Lair, Hon. Goldy, Hon. Edward C. Crooke, Hon. Charles W. Taylor.\n\nTheir Excellencies in their presence, Hon. Watson, Hon. F. W. Hutton, Mr. Re- sider, Mr. W. Sutherland, for the Qu’Appelle Appellants.\n\nHon. John Nicholls, Mr. W. T. Smith, Hon. J. D. A. Macdonald, Hon. F. W. Hutton. However, the discussion, which occupied most of the day, never once came to pass.\n\nSome of the insights into the past are rather interesting; we could have been more expansive, except that there does not seem to be any additional information available.\n\nRegarding the frontier townships, there now are four (Prairie, Red River Minnitaw, Red River Lakes agencies), four Roman Catholic, six Protestant, two Metis, one United Church.\n\nThere is an abundant yield from the soil, and this has met the demands of our neighbours, even though they have had to purchase grain from distant places due to the low prices obtained by their produce.\n\nSenator Donaghue stated that he had some important matters to report concerning the Lieutenant.\n\nThe election will also be conducted fairly, and the vote will be counted promptly.\n\nMr. Anderson moved, seconded by Mr. Shand, that the Commissioner be appointed to act in his stead while he is away.\n\nMr. Greaves moved, seconded by the Mayor, that the Secretary be appointed in his stead.\n\nMr. Simpson moved, seconded by Mr. Macdonald, that the Auditor be appointed in his stead.\n\nThe House sat and adjourns sine die.\n\n---\nLACROSSE.\n\nPrince Albert L. C. C. versus P. A. H. C.\n\nA large number of people were at the McPhee grounds Friday last, to witness the last game of lacrosse that season be- tween the Prince Albert Lacrosse Club and the Albert Lacrosse Club and the N.W.M. Police Lacrosse Club. The day was cool and the field was quite wet from the rain, but the players had no complaint whatever, and the match ended with three games for the Prince Albert side for the P.A. club in less than two minutes' playing time.\n\nThe Prince Albert team got off to a good start and it was easy to perceive there was good trim and good spirit among the members who obtained one match. The P.A. team gradually got there, and when the game was actually started, with both teams making up the twelve, having to play the first game with eleven men. C. Macdonald was appointed referee, and substitution to both teams was again allowed as referee. S.J. Donaldson and Const. Macdonald acted as umpires. The teams were:\n\nPOLICE\n\nMcKean Goal Wigmore\nJoyce Point R. C. Wigmore\nPerry Cover Point Way\nPowers Defence Field Macdonald\nTaylor Offside Smith\nSmith Offside Smith\nAske Centre Macdonald\nLarsson Home Field Kerr\nMorrow Home Leslie\nTaylor Home Macdonald\nTalbot Home Garnett\n— Jarvis Captain A.P. Stewart\n\nFish and Spear were unable to make it in this matter, Fish being disabled by an injury to his knee, and Spear not having recovered from injuries received in a previous match. The first game was played for the Prince Albert team won. The first game commenced by Officer calling the ball to the centre, and the ball was checked so he was induced to let it drop. It was then sent down to the P.A. flags and after a little skirmishing, Powers shot for house, but the house keeper saved it. Powers then sent it a distance from the flags. Wigmore being unable to pick it up by others, Powers drove it out and missed the ball in the third quarter column. In the second game Officer again sent the ball and directed it to Kerr, who was unable to get it, and through a number of players and into Knowles' stick, who immediately sent it up towards Fisher, who was unable to depart of feeling the weight of the ball. This game lasted fifteen seconds. The Prince Albert team was led by the Police, who all the way through showed plainly the benefits of practice, while they played a most creditable tennis ball for forty-five minutes. Everyone was deprived in these two games of witnessing the skill of the best player at their own ball in the world, with the Prince Albert defence throughout. Kerr was as good an opponent as ever was likely to be found and made a splendid play in the second half. On the Police side Perry, Doyle and Powers worked with cool heads, and took advantage of every opportunity to open up. The Prince Albert Lacrosse Clubs were entertained by the Police club by refreshments during the interval. Cold, Spear presented a most excellent evening was spent together, and the company dispersed on the ringing of God save the Queen.\n\nNANKADAM.\n\nThe annual migration of settlers to Moose Jaw and Regina for supplies has commenced, and the trail is crowded. Mr. Stephenson, Government Inspector of the North West Mounted Police, and his family are happy.\n\nTelephone communications between here and Clarke's Crossing was opened on the 1st of October last, and will prove a boon to this out-of-way place.\n\nMr. Angus McIntosh suffered severely by the late prairie fires which have raged in the vicinity. He lost his stable, a large quantity of hay and a new self binder, together with a number of minor articles.\n\nHeavy prairie fires have been burning near and about here for some time, but so far no damage has been done in the immediate vicinity.\n\nThe Rev. Mr. Howard paid Saskatoon a visit recently, and exchanged palpite with Mr. Hodgson.\n\nNaphtol, Vaseline, Tonic, Vaseline Camphor Oil, and Vaseline Cold Cream at Clark's Drug Store.\n\nJ. M. CAMPBELL\n\nIn now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods\n\nDress Goods Of the Latest Styles, with Trimmings and Buttons to match.\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nAll Prices and Styles.\n\nLADIES', MISSES' AND CHILDREN'S Wool Hoods and Clouds IN ENDLESS VARIETY.\n\nReady Made Clothing OF THE LATEST STYLES.\n\nFancy Underclothing AT PLAIN PRICES.\n\nBoots and Shoes\n\nMitts and Moccasins\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR!\n\nJUST RECEIVED\n\nOats, Wheat and Barley BOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nR. C. WIGMORE & CO.\n\nBoys' and Men's UNDERCLOTHING!\n\nAt Wholesale Prices\n\nAT\n\nR. C. WIGMORE & CO.'S.\n\n1879.\n\nBuffalo Hall!\n\nTO HAND THIS WEEK:\n\nElegant Jerseys and Jersey Jackets,\nSatin and Felt Skirts,\nBlack and Plaid Shawls,\nWool Princes and Ornaments,\nFur Caps and Jackets,\nBurmeses, Crete and Lace Curtains,\nCorsets—Best makers only.\nTapestry Table Covers,\nAnd a Long List of Men's Fur Caps.\n\nNew open and ready for inspection.\n\nBETTS & Gwynne.\n\nESTABLISHED: 1879.\n\nUPRIGHT AND BOX Heating Stoves\n\nFrom the Plainest to the Most Elaborate Design.\n\nHeating Drums\n\nIn Great Variety.\n\nAmerican Coal Oil\n\nJ. R. McPhail.\n\nRobertson Robertson\n\nMerchant Tailor\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887102801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3832, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8358, 2], [8358, 10482, 3], [10482, 15926, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]