[{"id": "0f29b5db47dc5c21e96a5b2290d88b14a63d4b81", "text": "Notice: To Shipmers\n\nThe Lake Steamers will leave Selkirk to connect with the Saskatchewan River Steamer at Grand Rapids on the 8th May.\n\nAll Goods at Market at this dangerous setting of the Steamer will be sold for cash by Messrs. Donaldson & Co., A. Black and Sons, &c.\n\nThe Winnipeg and Western Transport Company intends, through their Agent Mr. MacAuley at Selkirk, to appear shortly for land survey and chart as payment for all làmnment or materials required in connection therewith at this time.\n\nContracts are given for the establishment of a Hotel at Prince Albert; the Hon. P. J. Robinson appoiniting a number of persons to this purpose.\n\nContracts will be given shortly at a large rate.\n\nA large span of the unfinished Royal Hotel for sale by T. E. Black, is now open for inspection.\n\nWe are pleased to announce that Mr. Keen and Mr. Borders have been successful in their efforts and the new clubrooms are now operational.\n\nCarpets and Furniture, now displaying cleaners and household supplies, are advertised at a special price.\n\nFor the convenience of our patrons who desire accommodations at reasonable rates, we are pleased to announce that the first floor of the newly built Hotel has been opened to the public.\n\nThe Prince Albert Denominational Church invites all members and friends to join us in celebrating our 25th anniversary.\n\nWanted: The services of a well-known local artist for a large painting project.\n\nNotice: To Installers\n\nThe Earl of Selkirk's Grammar School is now ready to receive pupils.\n\nNotice: To Visitors\n\nA special train will run from Prince Albert to Winnipeg for the Dominion Exhibition, leaving on June 27th.\n\nNotice: To Employers\n\nThe Prince Albert Chamber of Commerce is pleased to announce the opening of a new branch office in downtown Prince Albert.\n\nNotice: To Politicians\n\nThe Prince Albert进步党 is now recruiting members for its upcoming election campaign.\n\nNotice: To Publishers\n\nPrince Albert Times & Saskatchewan Review is pleased to announce the continuation of monthly book club meetings.\n\nNotice: To Entrepreneurs\n\nA new real estate agency called \"Albert Properties\" has just opened in downtown Prince Albert.\n\nNotice: To Landowners\n\nA new subdivision is being planned for the north end of Prince Albert.\n\nNotice: To Tourists\n\nThe Prince Albert Regional Parks Board is pleased to announce the opening of a new recreational area near the city.\n\nNotice: To Students\n\nThe University of Saskatchewan is pleased to announce the opening of a new medical school campus in Prince Albert.\n\nNotice: To Businesses\n\nA new coffee shop called \"The Original Bean\" has just opened in downtown Prince Albert.\n\nNotice: To Voters\n\nThe next municipal election in Prince Albert will be held on September 15th.\n\nNotice: To Realtors\n\nA new real estate market has just opened in the downtown district of Prince Albert.\n\nNotice: To Landlords\n\nA new real estate market has just opened in downtown Prince Albert.\n\nNotice: To Farmers\n\nThe Prince Albert Grains Exchange is pleased to announce the opening of a new grain elevator.\n\nNotice: To Teachers\n\nThe Prince Albert Teachers' Association is pleased to announce the opening of a new professional development center.\n\nNotice: To Cooks\n\nThe Prince Albert Culinary School is pleased to announce the opening of a new cooking class schedule.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S.\n11 a.m.—Rev. Mr. Macleod.\n12 noon—Rev. Mr. Macleod.\n\nTHE MISSION CHAPEL.\n11 a.m.—Rev. A.A. H. Wright.\n12 noon—Rev. Mr. Macleod.\n\nST. CATHARINE'S.\n11 a.m.—Rev. Mr. Macleod.\n12 noon—Rev. Mr. Macleod.\n\nST. PAUL'S.\n12 noon—Rev. Canon Pratt, B.D.\n\nST. ANDREW'S.\n12 noon—Rev. Mr. Macleod.\n\nST. JOHN'S.\n12 noon—Rev. Mr. Macleod.\n\nST. JAMES'.\n12 noon—Rev. Mr. Macleod.\n\nST. ANNE'S, R. CATHOLIC.\n6.30 p.m.—Rev. Mr. Macleod.\n\nST. ANNE'S (Presbyterian).\n12 noon—Rev. Mr. Macleod.\n\nFRIDAY, JUNE 18, 1886.\n\nTo a reverend gentleman who made a speech on decoration day in Edmonton, a jingo nature, the Hamilton Spectator recommends \"peel ginger, a slave's head and a diet of Canadian fish.\" But pray won't we have to bait him first.\n\nSays the Regina Leader, evidently having reference to the puddle near by: \"It is a pleasant sight to see the yacht scudding along the lake, in the evening sun, her sails purple in the haze.\" It may be, but her sails purple in her rays is enough to disturb the anum cum dignitate of an Egyptian mummy.\n\nThe President of the great republic of the south of us was married on Thursday last. Her Majesty sent her congratulations to the happy couple. We cannot afford to wire our congratulations and will have to content ourselves with drinking the health of the happy couple in lime juice and water. A little soon, it is said, is not symbolic of their future, we hope.\n\nThe Edmonton Bulletin says that since Mr. Dewdney became Lieut. Governor of the Northwest, the mounted police \"have deteriorated in the eyes of the world to a non-descript institution, neither horse nor good red herring.\" But what has his Honor to do with the police? As well charge him with being responsible for the silly utterances of the Bulletin man.\n\nBy reference to our telegrams it will be seen that the Nova Scotia elections have resulted in the government being sustained by a large majority on a straight-out protectionist platform. In view of the fact, that better terms is not what Nova Scotia wants, but separation pure and simple, there will be some difficulty in arriving at a settlement which will be at once satisfactory to Nova Scotia and the Dominion. It will now be in order for the enemies of confederation to cheer on the Blue Nose secessionists.\n\nThe Lethbridge News, in an article dealing with the representation in the Commons, says: \"Northwest first\" must be the short anchor of any candidate who hopes to weather the storms of an election contest successfully. In a country so vast as ours, it must be remembered that our representatives in the House of Commons will have other interests than those of the Northwest to look after, and that the question of national unity at stake it will be their duty to uphold them even at the sacrifice of territorial interests. For instance, there are certain well defined principles upon which the two great Canadian parties stand apart. One believes in free trade, the other in protection. Must our representatives hold no opinion on these questions? Must they be neither free traders nor protectionists, must they not yield allegiance to principles—must they be idiots? Or holding opinions upon these questions, must they be forced to pocket them, and hold themselves like a man standing in the polling place, silent for the highest bidder? For our part we want to see men of principles sent to the Commons, who will hold above price their personal honor, and stand still, and fight for the national interests. \"Northwest first\" may do very well to catch salmon, but the \"Dominion first\" should be the cry of every true Canadian, be he Liberal or Conservative.\n\nST LOUIS DE LANGEVIN.\n\nAs a single handed twister and distorter of the truth, the Globe is not to be excused. The Edmonton Bulletin man says: \"Secondly, we are well aware, of course, that the Globe's commissioners are not supposed to have any control over the police, but are supposed to let constables work out their own deserts as such. He is charged with the express purpose of lying, even to the extent of denying the truth of the sworn testimony of those who appeared before the Globe and have the public behind them. It is, as for the Bulletin man, we always credited him with having, at least a well grounded conviction that the truth is neither that false hood—when the truth answers his purpose.\n\nThe Globe's commissioner, in obedience to his superiors, visited this part of the country a short time ago, and the excellent man got evidence to disprove the statements of Mr. Pearce with regard to the treatment by the Government and the Prince Albert Colonization Society, the settlers of the parish of St Louis de Langevin. His first report appears in the Globe of the 28th of April last, and a weaker attempt to make out a case against Government and the P.A.C. Society it would be hard to imagine. Even those very halfwits whose cause the commissioner assumes to champion give a flat denial to every statement made by him. They avow that they knew nothing about Mr. Pearce, that they did not know of the existence of the Society until after the rebellion. But whether they did or did not know of the existence of the Society, their fact, namely, untruthfulness and moral inveterate, that not one of those who had settled in the parish previous to the transfer or after, was ever disturbed by the Government or the Society. They may not have been able to enter their claims, but the justice of their claims was never questioned. They had possession, and had only to comply with the settlement during the second quarter when the lands were open for entry. It is true that men after the stamp of the Globe's commissioners and the Bulletin man, who do not stop short of saying anything which will pocket the enemy for every interest at stake, start with what results the public well know, to make the non-confiding halfbreeds believe that their rights were being ignored. We have everything but sympathy for the poor halfbreeds. Well, we are not without sympathy for them, but we trust our sympathy arises from pure motives. We would have them believe that there are true friends and guides whom older they disregarded before; would have them turn a deaf ear to the serpent though the Globe should be his mouth-piece, and the Edmonton Bulletin man his.\n\nBut in the endeavor to prove Mr. Pearce's report as unreliable the Globe's commissioners asks, with Le Meurde of the 16th of January last: Whether the names of the P.A.C. men were deprived of their lands to the Government in favor of the Prince Albert Colonization Society? and answers the question by giving the names of the purchasers of the lands of St Louis de Langevin, who, he alleges, the Government thus treated. But there were forty-five claimants in this parish. What became of the lands of the other twenty-five? Did the Government sell them out? To show, however, how worthless this statement is, we have only to mention the fact that one of the parties named, Michel Caron (Miss Keene), the Globe says, obtained his patent in 1881, four entered for their lands in 1882, two in 1883, and the rest, with few exceptions, have preferred evidence in support of their claims. These men have become convinced that the settlers were deprived of their lands in favor of the P.A.C. Society. True the unoccupied land in the parish was sold to the Society, but the unoccupied land claimed, held, belonged to the Government, and the occupied land, the claims of the settlers, belonged to the latter, at least they were in possession, and could not be dispossessed provided they adhered to the law in regard to settlement during the time the Globe's commissioner and the Bulletin man well know. But it is well also, that the people should understand that the Government are the guardians of the public domain, and would not permit the sale of land. But when a leading public journal makes false statements, and other journals reiterate them, we think nothing but our duty to give what we consider to be a true statement of the case. We say more when the Globe was more scrupulous than it is now. It perhaps had a stronger hold on the public mind then, but we must say to have lost it, and with declining prestige, naturally enough, there may be a corresponding decline in journalistic morality.\n\nJames Wagnon arrived in Edmonton yesterday morning, crossing last night, and returned to-day.\n\nTin Roofing and Eavetroughing\n\nAT LOW RATES.\n\n2,000 lbs. Barbed Wire TO HAND.\n\nWARNING\n\nAll overdue accounts not settled by June 15th will be closed without further notice or favor.\n\nLumber Lumber\n\nWe will place on banks of Saskatchewan River, at Medicine Hat, ready for rafting.\n\nDressed Boards, $25 per m.\nScantling and Joist, up to 1 ft., 25 \"\nFlooring, Ceiling and Siding, 30 \"\nShingles, 4 \"\n\nTar and Brown Paper. 4cts \" lb.\nDoors, 2f 6in x 6f 6in, 1s 2.30 each\nDoors, 2f 8in x 6f 8in, 1s 2.40 \"\nDoors 2f 10 x 6f 10 1s 2.70 \"\n\nSASH FROM $1.80 TO $2.80 PER PAIR GLAZED\n\nAbove prices for cash only.\n\nCorrespondence solicited.\n\nTHE MEDICINE HAT LUMBER CO'Y.\nW. T. FINLAY, Manage.\n\nP.S.—Bills cut to order.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of\n\n$1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and special Departments of Popular Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor everywhere.\n\n* * * Parties intending to subscribe are requested to send their names with the place of residence to the office of THE MANITOBA SUN.\n\nTHE MANITOBA SUN.\n10 Market St. E.,\nWinnipeg, Man.\nCONFIRMATION SERVICE\n\nOn the 13th inst., Wednesday at St. Mary's Church a confirmation service was held by His Grace the Bishop of Saskatchewan, a large congregation being present.\n\nThe candidates were presented by the Rev. A. A. H. Wright, assisted by Mr. J. Macleod, to the Bishop at the close of the Divine Service.\n\nAfter the introduction of the confirmation service had been ended by the Bishop, the Rev. Mr. Wright addressed the candidates who, (as well as most of the congregation) were deeply moved when His Lordship referred to the situation in which he was being placed in mourning, which was so on account of the sudden death of his wife. The Bishop said that he was the afternoon to be buried in the spotless white dress it had been intended she should have been wearing.\n\nHe then asked the candidates \"Do you here, in the presence of God, and this congregation, renounce all sin, and make a fresh beginning in your name at your baptism; renouncing and confessing the same in your own persons, and promising diligence henceforth to believe, to believe, and do all those things which your godfathers and godmothers have undertaken and promised?\"\n\nIf they answered, \"I do,\" then the Bishop laid his hands upon each of them, saying, \"Be thou sealed.\"\n\nAfter laying on of hands, during which time the hymn stanzas filled the church, the Bishop closed the service with the usual prayers and blessing.\n\nBy request, Mr. E. J. Cann of this town, president of the Saskatchewan Mission chapel choir assisted that of St. Mary's church choir, and the choirs were joined by the organist.\n\nCRICKET MATCH\n\nA return match between the Argyle and Mission clubs took place on the grounds of the former, at the east end, on Saturday afternoon, ending in a draw. Though the weather was changeable and wet in the forenoon, and fears were entertained that the game would be impossible to finish, the afternoon weather changed and the match was proceeded with. At the occasion of the former match the Mission club had enlisted three new recruits, and we noticed that the Argyles contained amongst their number several who had not appeared in the last match. The Argyles were the first to get the bat, and retired after making a score of 45. The Mission team then came out, and made a good start, like number of runs. After lunch, which was provided by the Argyles, the latter got the better of the game the second time and retired with a score of 80. The Mission club then took their second innings, and made a score of 29, but the game had to be discontinued after a score of 34 being made with no one out, drawn, Mission 80, Argyle 29 of the 34.\n\nThe following is the score:\n\n| Team       | Runs | Wickets |\n|------------|------|---------|\n| Mission    | 80   |         |\n| Argyle     | 29   |         |\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowall & Co., Newspapers Advertising Bureau, 102 South St., New York.\n\nWANTED\n\nLADY\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nCOMMERCIAL BANK.\n\nANNUAL MEETING OF THE COMMERCIAL BANK OF MANITOBA.\n\nReport of the Directors—Statement of Assets and Liabilities—Remarks of Mr. Macdonald.\n\nThe annual general meeting of the bank was held on May 25th. Mr. Macdonald took the chair, and the shareholders were present in large numbers. The report of the directors follows:\n\nThe bank has been doing business for several months, and we have the pleasure of announcing that our assets now stand at $143,269, less than the $150,000 which had been anticipated at the beginning of the year. This decrease is due to the fact that the bank has not been able to attract sufficient deposits to meet its liabilities. We are confident, however, that with the aid of our depositors and the good management of the bank, we shall be able to increase our assets in the near future.\n\nThe bank has also been engaged in purchasing land for future expansion, and we are pleased to announce that we have purchased a large tract of land near Winnipeg, which we believe will be an excellent site for our future operations.\n\nWe would like to express our appreciation to all our depositors and shareholders for their continued support, and we are confident that with their help we shall be able to maintain our position as the leading bank in the province.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nBuffalo Hall! Our Summer Stock Now Complete.\n\nFancy Dress Goods, Prints, Cottons, etc.\n\nClothing and Furnishings.\n\nFamilies should be entirely supplied from the Finest Stock of Staple & Fancy Groceries Ever Opened Here.\n\nBETTS & Gwynne.\n\nWARNING.\n\nA Large Stock of the Latest Styles Furniture!\n\nClose at hand and expected to arrive here in a few days.\n\nPRICES\n\n75 per cent. below any prices quoted by dealers here.\n\nFurther notice will be given on what day this sale opens. Sale Rooms will be in central part of town.\n\nW. B. Goodfellow.\n\nJ. J. Johnson & Co.\n\nHardware.\n\nWM. STOBART & CO.\n\nDry Goods, Groceries, etc.\n\nHaving received a full assortment of Staple and Fancy Goods.\n\nJUST ARRIVED.\n\nCENTRAL FURNISHINGS.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886061801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6272, "total-output-tokens": 4374, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3315, 1], [3315, 13236, 2], [13236, 16416, 3], [16416, 18485, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]