[{"id": "4dfa6f953555463cc40b2802d0381af2d4921584", "text": "BANKINGHOUSE OF Macarthur & Knowles, Prince Albert, N.W.T.\n\nPRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MARCH 15, 1889.\n\n$2.50 A YEAR.\n\nTEACHER WANTED\n\nTeacher wanted for Willowbrook School No. 16, N.W.T. Second or third class teacher. Salary $30 per month. Address: J. PAUL, Town, Willowbrook P.O.\n\nTEACHER WANTED\n\nTeacher wanted—male or female—male preferred—for Willowbrook School No. 16, N.W.T. Salary $30 per month. Address: Geo. Taylor, Esq., Willowbrook P.O.\n\nDISOLUTION OF PARTNERSHIP.\n\nNotice is hereby given that the partners—Mr. H. Walterz and Mr. F.C. Baker—have dissolved their partnership by mutual consent. All debts due from the firm will be paid in full. Address: H. Walterz, Esq., Willowbrook P.O.; and F.C. Baker, Esq., Willowbrook P.O.\n\nDENTIST\n\nC. R. STOVEL\n\nDentist.\n\nOffice over the Hudson's Bay Co.'s Drug Store, Tail's Block.\n\nJ. LESTOCK REID\n\nDominion Land Surveyor.\n\nPRINCE ALBERT PHARMACY\n\nWilliam Shannon\n\nPRINCE ALBERT\n\nROYAL MAIL STAGE COACH\n\nWeekly between Qu'Appelle Station and Prince Albert. Leaving Prince Albert every Tuesday morning at 10 o'clock. Passengers accommodated at reasonable rates.\n\nLEESON & SCOTT\n\nMILLINERY\n\nNEW Winter Goods\n\nJUST RECEIVED AT\n\nMRS. A. S. STEWART'S\n\nDress & Mantle Making a Specialty\n\nROBT BUCKLEY\n\nAuctioneer, Accountant, Estate and General Agent.\n\nHas on hand a number of TOWN LOTS which will be sold cheap on easy terms.\n\nIMPROVED FARMS.\n\nQUEEN'S HOTEL\n\nT. ORAM, Proprietor.\n\nLeading Hotel in Saskatchewan.\n\nBoard by the day or week.\n\nThe Bar is supplied with the finest brands of Qu'Appelle Beer, Cider and Blackwood Brown Beer, also Soft Drinks.\n\nEvery attention paid to the travelling public.\n\nTHOS. ORAM\n\nNEW BAKERY\n\nH. McColl\n\nI beg to inform the public that we have opened a Bakery between J. L. Johnston and Mr. Campbell's House, where I will always have on hand a fine choice stock of Bread and Fancy Cakes, Xmas and Wedding Cakes. A catalogue, and make on short notice. Very prompt delivery to all parts of the town.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nC. V. Allanway, Esq., for Winnipeg on the stage this week.\n\nThis is the last week of the Grand Camping Out at Red Deer.\n\nA large order for Groceries, Linen and Muslin ribbon for sale at F. C. Baker's.\n\nNext Sunday is the anniversary of the birth of St. Patrick, Ireland's patron saint.\n\nL. R. St. Louis, our late housemate, has gone to Qu'Appelle to take charge of the school.\n\nA. R. McKay left on the east going stage this week for Qu'Appelle from there to go to the Peace coast.\n\nEliza Smith, Mrs. Smith's daughter, is trying to build a bridge across the creek, at Red Deer Hill. The price is $100.\n\nSamuel's cattle yard is now filled with sheep, swine, cattle, etc., and will soon be empty. Remember the four little words \"not for cash.\"\n\nMr. Smith has given the names, brick and plaster work on the new convent building. Work will begin as soon as the snow is sufficiently off the ground to allow of its execution.\n\nThe weather for the last few days has been very cold, at least we felt it cold on account of the blowing snow and wet weather conditions. The snow on the thickest part got down to this last spell was 18 below zero.\n\nFour years ago on the 18th inst., the Northwest rebellion broke out, and on the following day the police and Prince Albert citizens assembled on the hill opposite the fort at Carleton, none of whom returned.\n\nA local organization of the Reform Association was formed last evening and the following offices elected: President, Mr. Maclean; Vice-President, J. McFarlane; Secretary-Treasurer, Mr. Conroy, Sec-Treas., T. E. Jackson.\n\nHatch & Baker have secured the contract for the building of the new school at Red Deer Creek (at G. Campbell's). The contract price was $1500. This is the second building they have the contract to build this spring.\n\nA meeting of Anglicans will be held in Woonsocket Church on Wednesday evening, the 20th, and will discuss the matter of celebrating the anniversary of the birth of St. George, England's patron saint. All Anglicans are invited to attend.\n\nCommissioner Godlet and Secretary McNeil, of the scrapping committee, have returned from Prince Albert, where they had given out about $10,000 in warrants. Mr. Godlet has bought for Duck Lake last Wednesday.\n\nAs will seen by posters around town, the old Presbyterian Church will be sold by public auction—morning afternoon. This is the oldest building in town—being occupied by the Presbyterian Church Society prior to religion, they could not do better than purchase this old building.\n\nThere is now in Prince Albert a copy of the Memorial Star in which is given a description of their new and commodious building, detailing the various services rendered, the history and brief history of the origin and progress of the paper, which is just put into operation. It is a common sight to see an Indian with a hamper of kindling wood walking along the street trying to make a bargain.\n\nADVERTISEMENTS\n\nBankinghouse of Macarthur & Knowles, Prince Albert, N.W.T.\n\nPRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MARCH 15, 1889.\n\n$2.50 A YEAR.\n\nTEACHER WANTED\n\nTeacher wanted for Willowbrook School No. 16, N.W.T. Second or third class teacher. Salary $30 per month. Address: J. PAUL, Town, Willowbrook P.O.\n\nTEACHER WANTED\n\nTeacher wanted—male or female—male preferred—for Willowbrook School No. 16, N.W.T. Salary $30 per month. Address: Geo. Taylor, Esq., Willowbrook P.O.\n\nDISOLUTION OF PARTNERSHIP.\n\nNotice is hereby given that the partners—Mr. H. Walterz and Mr. F.C. Baker—have dissolved their partnership by mutual consent. All debts due from the firm will be paid in full. Address: H. Walterz, Esq., Willowbrook P.O.; and F.C. Baker, Esq., Willowbrook P.O.\n\nDENTIST\n\nC. R. STOVEL\n\nDentist.\n\nOffice over the Hudson's Bay Co.'s Drug Store, Tail's Block.\n\nJ. LESTOCK REID\n\nDominion Land Surveyor.\n\nPRINCE ALBERT PHARMACY\n\nWilliam Shannon\n\nPRINCE ALBERT\n\nROYAL MAIL STAGE COACH\n\nWeekly between Qu'Appelle Station and Prince Albert. Leaving Prince Albert every Tuesday morning at 10 o'clock. Passengers accommodated at reasonable rates.\n\nLEESON & SCOTT\n\nMILLINERY\n\nNEW Winter Goods\n\nJUST RECEIVED AT\n\nMRS. A. S. STEWART'S\n\nDress & Mantle Making a Specialty\n\nROBT BUCKLEY\n\nAuctioneer, Accountant, Estate and General Agent.\n\nHas on hand a number of TOWN LOTS which will be sold cheap on easy terms.\n\nIMPROVED FARMS.\n\nQUEEN'S HOTEL\n\nT. ORAM, Proprietor.\n\nLeading Hotel in Saskatchewan.\n\nBoard by the day or week.\n\nThe Bar is supplied with the finest brands of Qu'Appelle Beer, Cider and Blackwood Brown Beer, also Soft Drinks.\n\nEvery attention paid to the travelling public.\n\nTHOS. ORAM\n\nNEW BAKERY\n\nH. McColl\n\nI beg to inform the public that we have opened a Bakery between J. L. Johnston and Mr. Campbell's House, where I will always have on hand a fine choice stock of Bread and Fancy Cakes, Xmas and Wedding Cakes. A catalogue, and make on short notice. Very prompt delivery to all parts of the town.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nC. V. Allanway, Esq., for Winnipeg on the stage this week.\n\nThis is the last week of the Grand Camping Out at Red Deer.\n\nA large order for Groceries, Linen and Muslin ribbon for sale at F. C. Baker's.\n\nNext Sunday is the anniversary of the birth of St. Patrick, Ireland's patron saint.\n\nL. R. St. Louis, our late housemate, has gone to Qu'Appelle to take charge of the school.\n\nA. R. McKay left on the east going stage this week for Qu'Appelle from there to go to the Peace coast.\n\nEliza Smith, Mrs. Smith's daughter, is trying to build a bridge across the creek, at Red Deer Hill. The price is $100.\n\nSamuel's cattle yard is now filled with sheep, swine, cattle, etc., and will soon be empty. Remember the four little words \"not for cash.\"\n\nMr. Smith has given the names, brick and plaster work on the new convent building. Work will begin as soon as the snow is sufficiently off the ground to allow of its execution.\n\nThe weather for the last few days has been very cold, at least we felt it cold on account of the blowing snow and wet weather conditions. The snow on the thickest part got down to this last spell was 18 below zero.\n\nFour years ago on the 18th inst., the Northwest rebellion broke out, and on the following day the police and Prince Albert citizens assembled on the hill opposite the fort at Carleton, none of whom returned.\n\nA local organization of the Reform Association was formed last evening and the following offices elected: President, Mr. Maclean; Vice-President, J. McFarlane; Secretary-Treasurer, Mr. Conroy, Sec-Treas., T. E. Jackson.\n\nHatch & Baker have secured the contract for the building of the new school at Red Deer Creek (at G. Campbell's). The contract price was $1500. This is the second building they have the contract to build this spring.\n\nA meeting of Anglicans will be held in Woonsocket Church on Wednesday evening, the 20th, and will discuss the matter of celebrating the anniversary of the birth of St. George, England's patron saint. All Anglicans are invited to attend.\n\nCommissioner Godlet and Secretary McNeil, of the scrapping committee, have returned from Prince Albert, where they had given out about $10,000 in warrants. Mr. Godlet has bought for Duck Lake last Wednesday.\n\nAs will seen by posters around town, the old Presbyterian Church will be sold by public auction—morning afternoon. This is the oldest building in town—being occupied by the Presbyterian Church Society prior to religion, they could not do better than purchase this old building.\n\nThere is now in Prince Albert a copy of the Memorial Star in which is given a description of their new and commodious building, detailing the various services rendered, the history and brief history of the origin and progress of the paper, which is just put into operation. It is a common sight to see an Indian with a hamper of kindling wood walking along the street trying to make a bargain.\n\nADVERTISEMENTS\nThe Prince Albert Times\nand Saskatchewan Review,\nPublished by\nJ. D. Maveety\nPrince Albert, N.W.T.\n\nTerms—$2.50 per annum in advance\nSingle copies—10 cents each\n\nNo advertisements inserted for less than $10.00 per year.\n\nNo contracts made under three months.\n\nNo advertisements inserted for less than $10.00 per year.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVEETY, Proprietor\n\nSUNDAY CHURCH SERVICES\n\nSt. Albans Church—Services, 8 a.m., and 3 p.m.; Sunday School, 9 a.m.; Rev. Mr. Smith, Pastor.\n\nSt. Catharine's—10 a.m.—Rev. Canon Pritchard, Rector.\n\nSt. Paul's—3 p.m.—Rev. Canon Pritchard, Rector.\n\nSt. Andrew's—10:30 a.m.—Rev. Dr. Macdonald, Rector.\n\nSt. John's—3 p.m.—Rev. Dr. Macdonald, Rector.\n\nSt. James'—3 p.m.—Rev. Dr. Macdonald, Rector.\n\nSt. Paul's Presbyterian—11 a.m. and 6 p.m.—Rev. Mr. Wright.\n\nMethodist Church—Sunday School—10 a.m.; Island Lakeshore—alternate Sunday morning—Rev. Mr. Wright; Evening—Wesleyan Church—Rev. Mr. Wright.\n\nSt. Anne's—10:30 a.m. and 3 p.m.—Rev. Mr. Wright.\n\nThis paper is not responsible for any errors or omissions.\n\nFRIDAY, MARCH 15, 1889.\n\nThe following are among the latest batch of rumors from Ottawa:\n\n1. That Sir John will be raised to the peerage of Great Britain.\n\n2. That Sir Hector Langevin will go to London as Canadian High Commissioner.\n\n3. There will be a general election before the opening of Parliament.\n\n4. It is within the range of probabilities that Sir John will be raised to the peerage of Great Britain.\n\nSuch an act would be a fitting recognition of his long and important services to the British Empire, and there is no British statesman of today who more richly deserves that honor; the latter half of rumor No. 1 has been knocked in the head by the recent appointment of an English diplomat to Washington. With regard to next rumor, there does not seem to be the slightest foundation for it.\n\nThe Reformers are, and have been for a long time, anxious that the leadership of the old Conser vative party should pass into the hands of Sir John Macdonald. They are painfully cognizant of the fact that they cannot cope with his exalted statesmanship, and that as long as he holds the reins of power they will stick together. But the chances of witnessing the advent of a reformer will remain in the dim perspective of the future. They believe that when he ceases to lead the party it will be split up into factions and they will ride into power over its ruins.\n\nSuch is their only hope, and no doubt this rumor was fattened by the wish that all these things would happen.\n\nThere is at present no great probability that a change will be made in the leadership of the party; but if there is, no better man could be appointed to succeed Sir Charles Tupper than the present Minister of Public Works, and the reentrance of Sir Charles into the Cabinet would be highly beneficial. Sir Charles would be hailed with delight by every one. Sir John Macdonald has said that there need be no anxiety on the score of a general election taking place. He sees no reason why there should be one before 1892, and so far as the present test shows that Sir John is not going to have one until the fullness of time is ripe, simply to gratify the wishes of office seekers and others. This disposes of rumor No. 4.\n\nWe notice that some of the Liberal M.P.'s have been having their annual fling at the member for Saskatchewan in the House of Commons, and relieved themselves of their pent-up feelings by rehearsing the accusations and venefaces charges against Mr. Macdonald and the Government of undue influence in the Northwest election. Some of them, too, displayed a woeful inability to ignore, as well as a woeful disregard for, the facts. Their ignorance is inexcusable, their mendacity pardonable only on the grounds of their political faith. Mr. Mulock, member for North York, stated that he only vote Mr. Macdonald ever gave him any intimation that the Northwest was wrong when he voted to send an agent of the Government to corrupt the electorate of Saskatchewan. What could he mean? He had never heard in his party anyone say that there was any fact of the fact that Mr. Macdonald never sat in Parliament and consequently could not have voted until after the election in 1887. But facts are nothing to the Liberals.\n\nThe public should take advantage of HETZ & TWINE'S 5th Annual Grand Clearing Sale. The reductions from the usual Prince Albert prices can hardly be realized without a personal inspection. They deal largely in dry goods, but during the past ten days considerable have been made in it. Buy a well assorted stock is still offered, and it is the fault of the public themselves if advantage is not taken of the clearing sale prices they offer for the next week or ten days.\n\nR. C. Wigmore & Co.\nMen's and Boys' Underclothing\nMen's Cardigan Jackets\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\n\nA Paying Investment. Examine Our Stock.\n\nR. C. Wigmore & Co.\n\nT. N. Campbell\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Prizes of every description,\nStephens' Blue Black Ink.\n\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.\n\nRobertson & Robertson\nMerchant Tailors\nGENTS FURNISHINGS\nImported Tweed Suitings,\nTrowering and Overcoating\nWORSTEDS,\nIn English and American Lines,\nCanadian Tweeds\nSUMMER SUITINGS\nIn all colors\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nVICTORIA\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's House\n\nWe have enlarged our premises to double their original size, and are now respectfully invited to the patronage of our new and convenient location.\n\nWe have also added some fresh horses to our stable, which will be available at reasonable prices.\n\nN.B.—Our rigs are new, and not liable to break down.\n\nNEILSON & McBEATH\nFOR THE Best Assorted Stock of CONFECTIONERY\n\nGO TO H. M'DOUGALL'S BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL\nW. STOBART & CO.\n\nIndian Traders\nGeneral Merchants\n\nPrince Albert and Duck Lake\nSASK.\n\nPaine's Celery Compound\n\nFor The Nervous\nThe Debilitated\nThe Aged.\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 10 Spring St., New York.\n\nG. H. CAMPBELL\nGENERAL Railroad & Steamship TICKET AGENT,\n471 MAIN STREET. — WINNIPEG, MAN.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 10 Spring St., New York.\n\nJ. M. CAMPBELL\nLUMBER.\nMOORE & MACDOWALL (LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN, Sec.-Treas\n\nAGENTS:\n\nP. G. GRAY, Edmonton, Alta.\nJ. FRASER TIMS, Fot Saskatchewan Alta.\nMahaffey & Clinkskill, Battleford, Sask\nA SAD OCCURRENCE\n\nTHE FATE OF THE FINLAYSONS.\n\nTo the Editor of the Times,\n\nSir,—For the information of the friends and acquaintances of the late Finlayson family, who may be disposed to report the following, which I have in all the information I have yet received, on the 2nd of August last, Mr. Finlayson, as above stated, from his native country, near Fort A in Canada, arrived at Cumberland Harbour in two boats loaded with provisions, provisions, and provisions. Lake for the purpose of hunting deer, trapping for beaver animals and trading with the Indians. They hired two men and proceeded up the river, and arrived in the end of September and prepared their winter quarters about nine miles from our settlement. They had been successful in securing a good supply of fish. Some time after the lake set fast, they started back to get a supply of provisions; it is stated they were going to our Lake. Brochu post about 200 miles farther north on the same lake. This was a most daring undertaking, as the river was very deep, dotted all over with islands and the course followed by our men is very difficult to navigate. The river is very perilous and has not been explored and there are no landmarks. No person knows where the river flows or what it contains, but the quantity seems not to be very great, so they had only two dogs to lead their whole equipment. Nothing was heard of them until a party went out trapping and found their bodies about a mile and a half from their house. It is supposed that they lost their way and wandered off into the lake for a long while endeavoring to find their home; that their provisions became exhausted and they died of starvation or exhaustion. It is strange, however, that they did not endeavor to make their way back to their dogs as one of them was alive when found and was subsiding on the carcass of the dead companion. Report says they kept their dogs with them until it was too late and they could not be saved to me and I may be able to give fuller particulars of the sad affair. I do not know the Christian names of these men nor do I know any of their relatives or friends but I shall willingly give any information I may have to any parties interested. Mr. Hamilton, the postmaster at Deer Lake, on hearing of the sad occurrence proceeded immediately to the fatal spot and buried the remains decently buried. To prevent their property being carried off by Indians it was removed to our Lake.\n\nH. BELONGER, C. P.,\nHudson's Bay Co., Cumberland District.\n\n[These men came to the Saskatchewan district from Ontario some years ago and settled near the Carrot River, where they went into farming and more especially stock raising. They were men of good character and of great reverence. Donald, the older brother, was married and leaves a wife and three small children. His younger brother, Roy, left, her former home, last fall to stay until this spring, when he was to return and take charge of the Carrot River farm, the youngest of whom was not married. They were both men who were highly respected by all who knew them. Donald was the son-in-law of that young man Stevens who died here of typhoid fever about two months ago and whose death caused great affliction among his nearest and greatest friends. We extend our heartfelt sympathy to the bereaved wife and family and other relatives of the unfortunate ones.]\n\n65 AND 66 LBS. PER BUSHL.\n\nSamples of Red and White Flax Grown at Prince Albert, Sask.\n\nWe quote the following from a late issue of the Winnipeg Tribune:\n\n\"All the talk on Change this morning is over samples of red and white Flax grown at Prince Albert, Sask., and exhibited by Mr. N. Sawil. They were sent to that gentleman by Mr. A. F. Edin, who commented on the fact that the M. & N.W. R.R. the red Flax was worth $1.00 per bushel and the white Flax $3.00 per bushel. The red Flax is perfectly pure, and seems so, even to the inspectors' own eye. The white Flax is not of quality, but is not so nice to look at. It is said that the samples produced are superior to anything else in the market. An expert seed grower from Prince Albert states that the samples are really the finest he ever saw.\"\n\nThis is spring, sweet, balmy spring! Some stock that T.O. bought last fall upon the promise of a pick. Upon the promise of a pick. He says it is early yet. Up to now, the snow sticks. The snow sticks most go. So we have to wait and see. And give the folks a shoe.\n\nRemember, the balance of our winter stock must be sold out to make room for the new. We are convinced that the best way to save money is to buy better to sell at cost and have the use of the money for six months, what we can replace goods at the same figures. We do not advertise to humbug anyone.\n\nThis is business, not humbugging. We get the best of the money.\n\nTHOS. O. DAVIS.\n\nHORSE SHOE STORE.\n\nThis is spring, sweet, balmy spring! Some stock that T.O. bought last fall upon the promise of a pick. Upon the promise of a pick. He says it is early yet. Up to now, the snow sticks. The snow sticks most go. So we have to wait and see. And give the folks a shoe.\n\nRemember, the balance of our winter stock must be sold out to make room for the new. We are convinced that the best way to save money is to buy better to sell at cost and have the use of the money for six months, what we can replace goods at the same figures. We do not advertise to humbug anyone.\n\nThis is business, not humbugging. We get the best of the money.\n\nTHOS. O. DAVIS.\n\nIMPORTANT CLUB OFFER OUR READERS!\n\nDOMINION ILLUSTRATED\n\nThe only high class Illustrated Canadian Weekly, given to its readers the best of literature, accompanied by the engravings of the highest order. The Press throughout the Dominion has declared it to be worthy of Canada and deserving universal support; but its best recommendation lies in its steadily INCREASING CIRCULATION.\n\nSUBSCRIPTION $4 A YEAR. 10 CENTS A NUMBER.\n\nSPRINT ARRANGEMENTS with Messrs. G. E. Desbarats & Son, Publishers, enable us to offer the DOMINION ILLUSTRATED WITH THE PRINCE ALBERT TIMES AT $5 A YEAR.\n\nSend your order (with cash) to The Times Office.\n\nA GOOD FISH! RUSSELL & DAVIS\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\nBacon, Ham and GAME IN SEASON.\n\nRUSSELL & DAVIS\nRIVER STREET.\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.\n\nNow is the Time To Order EAVESTROUGHING", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889031501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 5865, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 9991, 1], [9991, 15514, 2], [15514, 16902, 3], [16902, 23237, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]