[{"id": "2ada84443e73cb94c41641e7c45895ac715fa337", "text": "THE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nTHEME—$10 per annum in advance.\n\nThis paper will be inserted in the paper. Business letters &c., please.\n\nNo advertisements accepted for less than $10.\n\nAdvertisements without restrictions will be inserted without charge.\n\nAll letters to be addressed to the Proprietor Mr. J. D. MAVEETY.\n\nTHIS PAPER will be found at all Principal Newspapers in Prince Albert, Saskatchewan.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n\nThe Mission Chapel.\n\n11 a.m.—Services in both churches.\n\n1 p.m.—Sunday School 2 p.m.—Curate in charge.\n\nRev. Mr. Cunningham, Theological Student.\n\nHis Lordship the Bishop will preach as a rule, when at home; St. Mary's in the morning and St. Andrew's in the evening.\n\nSt. Catharine's\n\n10:30 a.m.—Rev. Canon Fleet, B.D.\n\nSt. Paul's\n\n1 p.m.—Rev. Canon Fleet, B.D.\n\nSt. Andrew's\n\n10:30 a.m.—Mr. Maclean.\n\nSt. John's\n\n1 p.m.—Rev. Mr. Maclean.\n\nSt. James'\n\n1 p.m.—Ven. Archdeacon McKeen, B.D.\n\nSt. Anne's R. Catholic.\n\n10:30 a.m. and 5 p.m.—Rev. Pere Pera.\n\nSt. Paul's (Presbyterian).\n\n11 a.m. and 7 p.m.—Rev. Mr. McWilliam.\n\nFRIDAY, JULY 9, 1886.\n\nThe Cabinet has decided to locate the police barracks at Prince Albert. The building will contain accommodation for a full troop and the construction will commence this summer.\n\nThe Canadian exhibit at the Colonial exhibition is attracting much attention in England. The newspapers are doing much of it, and it seems to be quite a revelation to the average Britisher.\n\nThe G.O.M. compares himself and his Scotch constituency to a chieftain and gay with a young and handsome bride. Mr. Gladstone has been doing his best in the world to know that it is a dangerous alliance. The young and handsome bride is too apt to give the old man the shake.\n\nThe bill now amending the British North America Act as to permit the representation of the Northwest Territories in the Senate and the Commons has passed the Dominion Parliament and awaits the Royal assent. With the passage of this measure the Act of the Dominion Parliament, with the same object in view, becomes law.\n\nThe twenty-four hour system went into effect on the Canadian Pacific Railroad on the 15th, and will doubtless soon be brought into everyday use by the public in general. The new system comes a little awkward at first, but will soon be made easy way, owing to its manifest advantages. Had the plan been measured in this manner from the first, an attempt at introducing a.m. and p.m. would have been stoutly resisted.\n\nOttawa is legislating against the Salvation army. If Ottawa desires to get rid of the Salvationists she should make a day of rest. There is nothing a Salvationist can do but serve as \"persecution.\" Persecution will make almost anything successful, and it invariably favors a religious sect. If Ottawa desires to be rid of the Salvationists, it must be done by force, all the law to do is to let the Salvationists religiously alone.\n\nThe great interest taken in the Colonial Exhibition has suggested the desirability of establishing in London a permanent museum containing articles characteristic of each colony. Such a museum could be a tribute to such a project, and it is possible that the colonies may join. Something in the nature of a permanent exhibition would popularize the colonies in England, and would tend to attract the attention of potential emigrants to British fields for settlement.\n\nNegotiations for a treaty of the Stantead, Sherbrooke and Charlevoix, Waterloo and Magog, Mississauga and Black River Valley and International railway of Maine to the Atlantic at New York, which would virtually belong to the Canadian Pacific, has been consummated. A special general meeting of shareholders has been called to authorize the acceptance of the agreement with the Government by the International railway of Canada for the construction in part of the railway connecting Montreal with the ports of St. John and Halifax.\n\nThe Canadian American has been studying Halifax and the Nova Scotia trade market field from the Chicago point of observation, and this is what it makes out of it. Some Haligonians are quite earnest in asserting that confederation is injuring their province and keeping their trade away. But Nova Scotia, situated as the Dominion of Halifax would not have much of a future before it. As a Canadian city it will be the terminus of the Canadian Pacific line, a great Scottish town located in a very fine position, surrounded by countries with hostile tariffs in a very soon drop into obscurity. And annexed to the United States states, simply because it is a good natural port of the tradition of Halifax to Portland and Boston. Halifax will gradually grow into prominence as a Canadian city.\n\nHUDSON'S BAY RAILWAY.\n\nThe following is from a paper by Mr. W. Shefford who passed over the route last year. \"And here it may be well to consider why such facilities should be offered by the Canadian authorities to bring about the completion of the railway and work. Fortunately, the cause is not far to seek. The fertile North-west, with all its advantages, has one disadvantage in being more remote from the main Canada from the Atlantic ocean. Many mining settlers are thus delayed, and induced to settle in the eastern provinces. The communication with the mother country is less direct, and the land transport is greatly enhanced by a continuous journey of some 1,800 miles after reaching the port of Montreal. Although travelling is made comfortable and cheap, the first class fare between Edmonton and Fort Edmonton is sufficiently tedious and expensive to deter new arrival from going farther west, especially when the more favored inhabitants of the East are offering them the best inducements to settle with them for goods traffic, however good the road and economical the working or it, the cost of carriage by land must always greatly exceed that by sea, to say nothing of the fatigue and consequent shortage and loss of cattle in long railway journeys.\"\n\nRETURNING REASON\n\nA report was put in circulation to the effect that the Dominion Government had withdrawn from its promise with regard to the fishery question, and that it had issued a circular to collectors of customs instructing them to refrain from enforcing the provisions of the treaty of 1818. It turns out that this report was in no way supported by facts. The circular really issued merely defined the duties of collectors, and left the cruisers to continue making seizures of foreign vessels bound within the three-mile limit.\n\nIt is now stated on good authority that the only rumored change of base on the fishery question, which has any foundation in fact has been made by the Yankee fishermen, whose views seem to be the same as the direction of the new treaty. According to the Halifax Herald, Captain Blake, a prominent Gloucester fisherman, admits frankly that Canadian waters are absolutely essential to the success of the American salmon fisheries, and that the killing of every Canadian fisher in free markets in return for fishing in Canadian waters. New England fishermen generally, he adds, are sick of the Canadian state of things and not likely to accept a treaty. He says Canadian should pay but little attention to what American papers say to the contrary, especially the sensational ones, for the fact is American fishermen must have Canadian prices. He claims further that there are now fourteen scowmen laid up in Boston, unable to obtain crews. Captain John Chisholm, master of another American vessel, holds the same opinion, and says that the treaty is a bad one. The press, too, sensational papers excepted—is beginning to comprehend the situation. The Bedford Times, for example, says the Canadians, so far, have treated the treaty as a matter of right, and it is added, that our fishermen desire to use Canadian fisheries—and it is very evident that they do—they must be a new treaty, and one somewhat better.\" There are other evidences of returning tea, south of the line.\n\nThe firm stand taken by the Dominion Government has evidently had a most desirable effect. Should the treaty fail to arise it is not improbable that a new and more favorable treaty may ere long be negotiated. But it has been well said that if the Gloucester fishermen really want to come to terms they could call upon many international politicians, such as Mr. Blaine, in excess of zeal in the wrong direction is creating ill-feeling and doing no good—Manitobian.\n\nStar Blanket, one of the rebellious prisoners, has been released from Stony Mountain by order of the Government. It is said that Star Blanket, and was a leading disaffected spirit in that district.\n\nOne hundred and ninety-two boys from Dr. Bernardo's Home, London, arrived at Quebec on the steamship Lake Superior. They are going to the North-West. The boys came also from the boys' aid funds from Middlemere Home, Hamilton. These are for Ontario and the North-West.\n\nEmmanuel Boudreau, of Montreal, is dead. He made himself conspicuous in the recent disturbances by giving protection to the Orangemen to walk on the 12th of July, on the ground that they were entitled to it, and years later to prevent these parades he became the arrest of several of his leaders. He was a member of the executive of the Orange Order of Quebec since 1867.\n\nT. J. AGNEW.\n\nMachine Oil $1 per gallon,\n\nAmerican Coal Oil 75c.\n\nEocene Oil, 90c.\n\nFULL LINES OF Hay and Harvest Tools.\n\nT. J. AGNEW.\n\nLumber Lumber\n\nWe will place on banks of Saskatchewan River, at Medicine Hat ready for rafting.\n\nDressed Boards, $25 per m.\n\nScantling and Joist, up to 18 ft, 25 \"\n\nFlooring, Ceiling and Siding, 30 \"\n\nShingles, 4 \"\n\nTar and Brown Paper, 4cts \" lb.\n\nDoors, 2f 6in x 6f 6in, 1½ 2.30 each\n\nDoors, 2f 8in x 6f 8in, 1½ 2.40 \"\n\nDoors 2f 10 x 6f 10½ 2.70 \"\n\nSASH FROM $1 80 TO $2 80 PER PAIR GLAZED\n\nAbove prices for cash only.\n\nCorrespondence solicited.\n\nTHE MEDICINE HAT LUMBER CO'Y.\n\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—50 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week,\n\nSelected Miscellany,\n\nAn Interesting Serial\n\nand Special Departments of Peculiar Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor even where—\n\nPersons intending to subscribe are requested to send their names with the price of subscription to the office of THE MANITOBA SUN,\n\n12 Market St. E., Winnipeg, Man.\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES\nFOR\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinen, etc.\n\nGO TO\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings at cheaply any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886070901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 2807, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10713, 2], [10713, 11465, 3], [11465, 11465, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]