[{"id": "a043726933cfe3b2cdf2434f1dd8d74d31b33104", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\nTERMS—$2.50 per month in advance.\nSingle copies 10 cents each.\nIn case of death or accident, or if paper becomes lost, a claim will be inserted in this paper. Business hours 9 a.m. to 6 p.m., every day except Sunday.\nNo advertisement inserted for less than $1.\nAdvertisements without instructions will be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's and St. Mark's Churches.\nSt. Paul's Church, Prince Albert.\nSt. Peter's Church, Prince Albert.\nSt. John's Church, Prince Albert.\nSt. Andrew's Church, Prince Albert.\nSt. Matthew's Church, Prince Albert.\nSt. Luke's Church, Prince Albert.\nSt. Mark's Church, Prince Albert.\nSt. Peter's Church, Prince Albert.\n\nTHIS PAPER MAY BE PURCHASED AT THE OFFICE OF THE PROPRIETOR, PRINCE ALBERT, N.W.T.\n\nFRIDAY, APRIL 15, 1887.\n\nHOUSE OF COMMONS\n\nThe House of Commons met on Wednesday last. J. A. Ounsted, M.P. for Lethbridge, was elected speaker by acclamation. The Opposition evidently not thinking it advisable to show their weakness by contesting his election. The Speech from the Throne contains an address where a proposal to give more Northern representation in the Senate, so that we may have representation in the Senate as soon as in the Commons, or as soon after as possible, was to be expected. As representing the interests of Canada who would place the Territories at a disadvantage, and would not be carrying out the provisions of the Act of Union. We may therefore look for the speedy appointment of senators for the Northwest. Our representative will be do not know, nor shall we venture to prophesy for fear we should endanger our reputation as prophets. Although, as also stated in the Speech to the proposal to build new barracks at Calgary and Prince Albert, at an expense of $100,000. Owing to the great interest in the outcome of the fate of Canadian vessels navigating the lakes, the Government have decided to ask Parliament for a grant to construct a canal at Sault Ste Marie. This un derlined proposal is undesirable, necessary not only in the interests of commerce, but from a national point of view, as by the closing of the present canal against Canadian vessels, a currency difficulty might arise under the late statutory acts passed by the American Senate. Canadian vessels would be prevented from entering Lake Superior. The fisheries negotiations are still pending, but the position of the matter is not indicated. We are satisfied, however, that the interests of Canada will not be sacrificed, even at the peril of offending Uncle Sam.\n\nNext comes the consideration of the several national questions with which the Government will have to deal, which will be matters relating to Manitoba and the Northwest. Manitoba appears to be almost unanimous in opposition to Disallowance, and would seem to be determined to force the Government to pay attention to the Dominion, to violate the agreement made between it and the C. P. R. syndicate. When we remember that Manitoba owns the proud position it holds today as the youngest but most populous Province, to the entire pride of the syndicate, the benefits of which invested their money in the C. P. R. on the understanding that their interests would be protected for twenty years, it does seem a strange thing that they should be pursuing the course it is. But not only is private money invested in the C. P. R., but the credit of the nation suffers. If the policy of disallowance be maintained, in the national interest, whatever consideration may be given to Manitoba in lieu of its alleged advantages under the agreement between the Syndicate and the Government.\n\nAs for the Northwest, the main question with which the House will have to deal will be the granting of an act legalizing the existence, the encouragement of North-west railways, and the payment of the rebellious losses. As to the powers of our legislature, we presume they will be every concession to our demands. No bill, however, will pass the House by the provisions of which Assiniboin will have the balance of power in the Legislature, it will not only place the other districts at its mercy, but will be a continued demand for redress. We have, as we said before, no ambition to rob Assiniboin of the capital, but we are prepared to have a fair representation in the House, and to bear the rebellion losses, we trust, will be paid as soon as possible, as many of the demands will be heard in Parliament as have been labouring under difficulties ever since the rising. The question of the guard and the Indian Police should also be considered favourably and promptly acted upon.\n\nThere can be no question as to the importance of both these matters of business to be transacted, and the eagerness of the Opposition to press the question of the police is evident. But that Mr. Blake, who has been re-elected, leader of the Liberals, will take any action in the capacity for many years yet we have the slightest doubt.\n\nTHE INDIAN QUESTION\n\nThe Calgary question of the first importance is the question in which it takes exception to the present mode of dealing with the Indians. Mr. Macdonald says that there is a recommendation that a reserve be set apart in the Red Deer district for all Indians who desire to settle, within limits which all whites, save Government officers and missionaries, should be excluded. It is stated that no white Indian should be allowed to go beyond pain of fine and imprisonment.\n\nThere is no doubt such an arrangement would be very advantageous, the proximity of the Indians to the different settlements having had a decided influence upon the peace of mind proposed by our contemporary, however, is a new one. It was suggested that an arrangement should be made with the different tribes, and was objected to for good reasons, the chief amongst which was that the Indians, whose lands are now occupied by white men, would have no more power for harm in case of a rising. The Indians cannot be trusted, and there would be less likelihood of a general rising. Another reason for doing so would be to stop the constant use of old time feuds breaking out between tribes. To say that the different tribes are friendly towards each other is nothing but a proof that they will always maintain the same amicable relations, and that when a spirit of independence is not only gained against trouble between the tribes, but trouble between the tribes and the Government.\n\nIt is impossible to consider the treatment of the Indians as received by the Indians in the past. The political stances of the Grizz leaders have been well known, and it would be in order to make political capital out of them. The Indians, as far as we know, are not considered as being able to defend themselves, and the Indians who are suspected of being Tories.\n\nThe Cheapest House in Town is T. N. CAMPBELL.\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL SIZES—WRITING AND COPYING,\nOffice Stationery, etc., etc.\n\nCaledonia Brewery\nEAST END.\n\nLIVERY & FEED STABLE\n\nCHAS. WOODMAN\nPROPRIETOR\n\nG. D. NORTHGRAVES\n\nWatchmaker and Jeweller,\n\nA LARGE STOCK OF Watches, Clocks and Jewellery.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.,\nNewspaper Advertising Bureau,\n10 Spruce St., New York.\n\nFerry's Seeds\n\n6,000,000 BEEF BUSHS\n\nA.C. PATTERSON\n\nFor information.\n\nThe proprietors of the above concern is prepared to supply customers with beef bush seeds at bullion rates for sale.\n\nPat Bitters, $1.15 per dozen.\nQuart Bottles, $1.25 per dozen.\n\nKeep at the per gallon.\n\nIn any sized cask delivered to all parts of the town.\n\nA Billiard Table and Saloon\nIn connection with the Brewery.\nThe Best Cigars always on hand.\n\nLARGE STOCK OF Watches, Clocks and Jewellery.\n\nREPAIRING PROMPTLY ATTENDED TO.\nAGRICULTURAL\n\nFarmers,\n\nThroughout cultivation combined with stock raising being done by two men, who are both quite experienced in the art of farming, it will be seen that the best method is to use breeding of animals which are well adapted to the local conditions. The same rule applies to the breeding of dairy cattle, sheep, and swine. It should be noted that the best results are obtained when breeders work under the supervision of experienced farmers, who have a thorough knowledge of animal husbandry.\n\nThe following tips are given to farmers:\n\n1. Never overstock your land.\n2. Keep your livestock healthy through proper diet.\n3. Ensure adequate shelter for your animals.\n4. Maintain good sanitation practices.\n5. Regularly vaccinate your livestock against diseases.\n6. Rotate crops to maintain soil fertility.\n7. Use approved chemicals for pest control.\n8. Seek assistance from agricultural extension agents when needed.\n\nThese tips will ensure a successful farming operation.\n\nTHE PRINCE ALBERT TIMES\n\nSubscribe for The Times and get the latest news and happenings around town. $250 per annum\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nJOBS PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY.\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\nCOMMUNICATIONS.\n\nTHE IMPERIAL INSTITUTE.\n\nWe have received the following letter from His Honor Lieutenant-Governor Dr. Denison, announcing the proposed establishment of an Imperial Institute in London, Eng., in commemoration of the Queen's reign, and in honour of Her Majesty to the Throne. As loyal British Subjects we are expected to contribute our quota towards the establishment of the Memorial Institute, and we have no doubt the people of this district will respond to the call in this letter, which explains itself:\n\nTo the Editor of the Times,\n\nSir,-You are aware that it has been determined to celebrate the 25th anniversary of Her Majesty's accession to the Throne by the establishment in London of an Imperial Institute in United Kingdom, the Colonies and India, as a permanent commemoration of the Jubilee year of Her reign, and all the services rendered by Her to the Empire. To Royal Highness The Prince of Wales, in recognition of his services in connection with this Institute, and in accordance with His Royal Highness' wishes, be devoted to that object.\n\nIn this connection also I desire to appeal to the Queen's subjects throughout Her Majesty's Dominions to give a generous support to establish and constitute such a Memorial.\n\nAlthough a previous communication on this subject addressed by me very generally invited contributions, and hitherto borne but little fruit, I propose to make a further effort to awaken as interest in this matter, and I hope may be productive of better results.\n\nI shall deem it very unfortunate if the loyal feeling pervading these territories fails to respond to this opportunity for expression and we omit to participate in a project with which all other Colonists and Her Majesty's Dominions will doubtless be associated.\n\nWhile I am fully sensible of the difficulty which exists amongst us in the country at large, to all raise public subscriptions, even for the double object, I presume to think that, if the existing associations could be here placed at a very low figure, the number of our subscribers would yet prove to be so large that the total amount would form no mean addition to the general fund.\n\nWith a view therefore to secure widespread response to the appeal, which has been addressed to us, and to give an opportunity to all who are disposed to do their bit, I have thought it desirable to make a further effort to awaken as interest in this matter, and I hope may be productive of better results.\n\nIt is proposed to hold a public meeting in Regina at an early date, and I shall be glad to see the example generally followed.\n\nI have the honor to be, Sir, your obedient servant,\n\nE. DENISON,\nLieutenant-Governor,\nRegina, N.W.T., 28th March, 1887.\n\nOn the 12th Jan., in St. James' Palace, the Prince of Wales, said of the proposed Institute—\n\n\"It is my hope that the Institute will form an important link in the union between our Colonial settlers and those persons at home who are interested in emigration. Much information and even instruction may beneficially be imparted to those who need gathering up, and those who are aware that the competition of industry all over the world has become keen, whilst the resources of Canada have been profoundly affected by the recent rapid progress of science, and in the increase of the facilities of communication offered by steam and the electric telegraph. In consequence of these changes all nations are making strenuous efforts to produce a trained intelligence among their people. The working classes of this country have not been slow to show their desire for improvement in this direction. They wish to place themselves in a position of intellectual power by using all opportunities offered to them to acquire an understanding of principles as well as of the practical side of life, in which they are engaged and about to be employed. It is the duty of the Colonies and India when they visit this country for business and pleasure, and they, in turn, when visiting the Colonies and India of the United Kingdom, will find in the collections, libraries, conference and museum rooms of the Imperial Institute, a valuable aid in promoting the commerce and improving the manufacturing industries of the Empire. I am sure that the Queen's subjects visiting this country will find some sort of social welcome within the walls of the Imperial Institute, and that it will thus be an emblem, as well as a practical exponent, of the community of interests and feelings of belonging through out the extended dominions of the Queen.\"\n\nTOWN COUNCIL.\n\nThe Council met in the Council Chamber on Monday evening last.\n\nPresent: Mayor, Mr. Bain, and Councillors Bain, Stewart, and Bradburn.\n\nThe minutes of the last meeting were read and adopted.\n\nTenders.\n\nA communication was received from John Mair in reference to the seizure of a dog by the town Constable.\n\nTenders will be received by the undersigned until next week, for the following articles for Fire Brigade:\n\n1. A wheeled Hook and Ladder Truck.\n2. A wheeled Hook and Ladder Truck.\n3. A Spruce or Spruce Ladders, 30 feet long.\n4. A Spruce Sailing Ladders, 18 feet long.\n5. Fire Axes.\n6. 120 Galvanized Iron Buckets.\n7. Hooks, with Dug Ropes.\n8. 100 Fire Poles, spruce handles.\n\nThe lowest tender not necessarily accepted.\n\nHUGH U. BAIN,\nChairman Board of Works.\n\nFOR A CHEAP BABY CARRIAGE\n\nGO TO CANN'S BOOK STORE\n\nFISH ON THE WAR PATH.\n\nBombarding Every Department. Shattering prices with grand effect.\n\nFresh Seeds at Clark's Drug Store.\n\nT. O. Davis has clothing that will fit a woman of any size to the waist.\n\nTurnip, Carrot and Mangel Seeds at Clark's Drug Store.\n\nThe Quebec Nationalists think that the federal election law should be amended, but it is much easier for them to propose such a step than to carry it into effect. The Act of Union was the result of the deliberations of the ablest men in Canada, and it is not likely to suffer any alterations at the suggestion of the enemies of Union.\n\nAT FISH'S.\n\nBUFFALO HALL!\n\nGRAND STOCK-TAKING SALE NOW GOING ON.\n\nDry Goods, Clothing And Groceries ALL REDUCED IN PRICE.\n\nBETTS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware, House Furnishing hardware, Carpenters' Tools, Paints and Oils, Barbed Fencing Wire, Stoves and Tinware.\n\nALSO A FRESH STOCK OF Groceries, Teas, Tobaccos, Etc.\n\nCALL AND GET PRICES.\n\nJ. R. McPhail.\n\nTHE WEST END STORE\n\nJUST ARRIVED, NEW GOODS AT CHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Cloths, Window Valances in Scarlet and Yellow, Door Mat, Curtain Cloths, Silk Corded Cloakings, Empress Cloth in Black and Garnet, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beecce Veiling, Ladies' Silk Ties, Tinsel, etc., etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Tinned Goods of all kinds.\n\nInspection is solicited.\n\nRUSSELL & DAVIS, PRINCE ALBERT WHOLESALE & RETAIL BREWERY.\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and GAME IN SEASON.\n\nAMBER--(Hop--ALE.\n\nDelivered to all Parts of the Town.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nM'INTOSH & CERRIOND.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887041501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3862, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8041, 2], [8041, 9491, 3], [9491, 16745, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]