[{"id": "bd5bb96bee41e619aec62778a53ca7520b3aa571", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JANUARY 30, 1886.\n\nBanking House at Macarthur & Knowles, Prince Albert, N.W.T.\nNotices of the Hon. W. A. Mellen, Barrister-at-Law, Prince Albert.\nNotice. All parties interested in us are requested to give notice that when their amounts will be handed over for our account, we intend discharging the mortgage of our present undertaking.\nNotice. Notice is hereby given that the Secretary and Solicitors—Partnership Solicitors—of the Royal and Provincial Bankruptcy Court—will apply for the dissolution of the company under the provisions of the Bankruptcy Act.\nPublic Notice. Public Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any party engaged in the transportation of goods by land in a province within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deems necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested therein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nNotice. Notice is hereby given by the lieutenant-governor of the North West Territories, and is directed to all persons who may be interested herein, that the provisions enumerated in this order are directed against any person engaged in the transportation of goods by land within those limits, or hereafter to be permitted, who shall not make such proof as the lieutenant-governor may deem necessary.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVESTY\n\nPRINCE ALBERT, N. W. T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m., The Rev. Principal Flatt.\n7 p.m., Rev. J. H. Hilton.\n\nThe Mission Chapel.\n9 a.m., Mr. Lea (from St. Mary's).\n10 a.m., Mr. Lea (from Wesley School).\nRev. A. H. White.\n\nSt. John's.\n10 a.m., Mr. Lea (from Wesley School).\nRev. E. Matheson.\n\nSt. Cuthbert's.\n10 a.m., Mr. Lea (from Wesley School).\nRev. E. Matheson.\n\nSt. Paul's.\n11 a.m., The Rev. Principal Flatt.\n\nSt. Andrew's.\n10 a.m., Rev. J. F. Prichard.\n\nSt. James'.\n11 a.m., Mr. Lea (from Wesley School).\nRev. J. F. Prichard.\n\nSt. John's.\n9 a.m., Mr. Lea (from Wesley School).\nRev. J. F. Prichard.\n\nSt. John's Church.\n10 a.m., Mr. Lea (from Wesley School).\nRev. J. F. Prichard.\n\nC. M. Church, Red Deer Park.\nRev. J. F. Prichard.\n\nC. Methodist Church, Goschen.\nRev. J. F. Prichard.\n\nC. Methodist Church, Mission.\nRev. J. F. Prichard.\n\nFRIDAY, JANUARY 30, 1885.\n\nAnother victim of tea-totalism—Chief Running Wolf was only back in his own country before ten when any other squaw in camp could have challenged him to an open fight. Chief Running Wolf's squaw was five months along, when in the act of taking the tea from her mother's lips she died. Now it is evident that had the liquor been intoxicating, that child could never have happened, as the deceased lady must have been unconscious before doing herself any harm.\n\nSome provisions of the Canadian Fishery Act have been extended to Manitoba and North-West relating to white fish and trout. It seems curious that this should not be advertised more widely as it will affect a vast number of classes in the Territories, who, as a rule, seem to be very fond of the matter. But kind of change is rather too sweeping in its application to a country like this, nor do we think the people of this district, many of whom can hardly keep body and soul together without any interference with what to many is absolutely a necessity of life, viz.—their winter supply of white fish.\n\nThe people of Prince Albert have always been very liberal, especially to charity. It would be a great act of charity if the government would intercede among the Indians near the river, and see what state they are in, and if they are not able to get their food, to send them some flour or hard up. Some apply to Mr. Moffat for supplies, but he has no authority to lend them. The Indians are a great deal worse off than they are as they do, but it would not say much for the people of this town if they actually knew that within a radius of half a mile their fellow men are dying of starvation.\n\nIt is rumored that Chaplain, sheriff of the North West Territories will succeed the late F. H. Emms as secretary of public works, and it is said the Government will not increase the North West Mounted Police.\n\nA Canadian Pacific train drawn by two locomotives ran into a train of flat cars 25 miles from Montreal. The locomotives were wrecked, the passenger cars derailed, and the occupants of the cars badly shaken up. The loss to the company is very heavy.\n\nThe ice palace and the comittee at Montreal are being pushed on rapidly in readiness for the opening day.\n\nThe Canadian Pacific Railway say a plot is on foot in New York to help their securities.\n\nHearing Piles—Symptoms and Treatment.\n\nThe symptoms are headache like pericarditis, nausea, vomiting, diarrhoea, constipation, very distressing, particularity at night; sickness and pinworms were also present. The patient said that the private parts are sometimes affected. It allowed us to examine very serious results.\n\nMEDICAL HALL\n\nBurdock Blood Eaters.\n\nBurdock Healing Ointment.\n\nBurdon's Pills.\n\nVictoria Hypophosphites.\n\nVictor's Bath and Uva Ursi.\n\nFreeman's Worm Powder.\n\nYellow Oil.\n\nSTRAYED!\n\nStrayed on my property about three months ago.\n\nA Dark Brown Mare with Red Colt.\n\nOwner will please prove property, pay expenses and take them away immediately.\n\nDONALD MCLEOD.\n\nForks of the Road.\n\nJAMES SINCLAIR\n\nMerchant Taylor.\n\nGEORGE D. JOHNSON\n\nWatchmaker and Jeweller.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nJ. M. CAMPBELL\n\nHas just received a complete and well assorted stock of choice Shawls, Sheetings, Shirtings, Blankets, Ready Made Clothing, and Underclothing.\n\nA full line of Groceries.\n\nAlso Pratt's Astral Oil, which for comfort, safety and cleanliness, excels anything in the market.\n\nPRICES TO SUIT THE TIMES.\n\nJ. M. Campbell\n\nNEW GOODS!\n\nMEDICAL HALL\n\nBurdock Blood Eaters.\n\nBurdock Healing Ointment.\n\nBurdon's Pills.\n\nVictoria Hypophosphites.\n\nVictor's Bath and Uva Ursi.\n\nFreeman's Worm Powder.\n\nYellow Oil.\n\nE. JACKSON\n\nWHINNIPG FLOUR\n\nPatent Process.\n\nStrong Bakers.\n\nWheat Flour.\n\nJOHN A. MACDONALD\n\nPRINCE ALBERT, SASK.\n\nCREELMAN BROS.\n\nGEORGETOWN, ONT.\n\nThe Dominion Organ and Piano Co.\nA BIG COAL FIELD.\n\nProfessor Newton, a practical American geologist who has been prospecting in this country for a number of months, and who discovered the immense coal mine at Crowfoot Crossing, arrived in the city last week. Mr. Newton has been engaged by the professor since morning, and the latter gave some particulars regarding the coal.\n\n\"The coal,\" said the professor, \"shows the least percentage of water of any coal west of the Rocky Mountains. So far as we have discovered, no coal is exactly adapted for that purpose; and for particular purposes it cannot be improved upon. I found it and found no sulphur in it so that any quantity could be stored in woods without any danger of ignition. You know great trouble is experienced with some coal in consequence of its aptness to ignite, charring in a few minutes. Now, if such was discovered near the Crowfoot Crossing, would be worth $10,000 an acre in the Western States. There is sufficient coal here to keep the whole North-West warm for a million years.\n\nI consider there is enough coal there to last all the world for centuries. The seam is over four feet thick, which is much larger than almost any seam in United States. The shaft is 135 feet deep and eight feet in diameter. Over the seam is a stratum of stone more than five feet thick. This will make an excellent roof for the mine. There are several other seams encountered on the way down, but none of them are so good and none near so thick as the bottom seam.\"\n\nThe proprietor is confident that if the mines were developed the coal would be used to supply Dakota, Montana and Minnesota. He thinks it would soon supplant all other fuel in those states. While the shaft for the coal is very thin, the stone four feet thick, of a very rich character was struck. Professor Newton says it possesses untold wealth, and if its richness were made known, a sensation among capitalists would be created.\n\nTHE SCORING FOR THE RACE.\n\nTo the Editor of the Times,\n\nSir,—I am sorry to say that any man who would have the audacity to go to your office and falsify the score of some of the men that took part in the race last night, is unworthy of your notice. I was also surprised at you for charging the score without the consent of the judges and all parties interested. If the race club are going to allow a false vote hereafter, scores should be kept by the best method possible.\n\nSuch conduct would not be tolerated among savages, much less in a civilized community. When Mr. Cherry was called Mr. F. Cherry's name was nine miles and five laps, not eight miles and fourteen laps, as stated in your paper of the 23rd inst. Every man entitled to his rights, so Mr. Cherry entitled to nine miles and five laps in the last race.\n\nYours, &c.,\nO. C. MacLeod.\n\nSaucer.\n\nMr. MacLeod seems to be really surprised, and as we do not wish to surprise him any more, we will let him go by without saying that he ruined the score from a gentleman whom we would not care to implicate the charge of falsifying.\n\nCANADIAN.\n\nOTTAWA, Jan. 18.—The writ for the Dominion election in Saskatoon has been issued.\n\nSir Leonard Tilley has been forbidden by his doctors to go out after midnight.\n\nJohn Macdonald, nominated for the Legislature against Darling Reform, has retired from the contest.\n\nEMMANUEL COLLEGE\n\nPRINCIPAL:\n\nThe Rev. W. R. FLETT, B.A.,\n\nCantab., Late Foundation Scholar of Sydney College, England.\n\nTHE NEXT TERM BEGINS ON\n\nMonday, January 12th.\n\nBesides the ordinary subjects read at a Public School, each pupil is taught the Elements of Scientific Agriculture.\n\nA Laboratory is provided, where the Principles of Elementary Qualitative and Quantitative Chemical Analysis are taught.\n\nSpecial Evening Lectures to Students Reading for the Matriculation Examination of the University of Saskatchewan.\n\nFor further particulars apply to the\n\nREV. THE PRINCIPAL,\n\nEmmanuel College, Prince Albert, Sask.\n\n1879.\n\nBuffalo Hall!\n\nCARD OF THANKS.\n\nDuring the whole time we have been in business we never have had a more successful holiday season than the one just past. Our sales have been large and of a substantial character, and we feel sure that we have enrolled many new names as regular customers. Such a state of affairs is impossible except to something as it does that our continued efforts to provide the best of everything in our line at the least possible cost have been so generally appreciated.\n\nTo all who have patronized us, not only during the holiday season but also throughout the whole of 1884, we beg to tender our sincere thanks and to intimate that a large assortment of Dry Goods, Clothing, Fun and Games is still fresh, well selected and extremely varied, and in order to clear up before spring trade every department has been overhauled and articles marked at clearing sale prices.\n\nBETTS & GYNNIE.\n\nNOTICE.\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\nTHE MAIL ROBBER.\n\nCHICAGO, Jan. 16.—A well-known horse thief yesterday was arrested at a well-known gambling house in Chicago, a man of 35 years old, who claimed to be a nephew of Sir Alexander Campbell, M.P., of Dundee. Sir Alexander Campbell, however, has been in London for some time, so the claim cannot be true. The man was arrested by the police, and it is said that he was carrying a large amount of money when he was apprehended. He was taken to the police station, where he was questioned about his activities. It is believed that he was involved in a number of thefts in the city, and he was charged with grand larceny. He was held without bail until his arraignment in court.\n\nSTEWART BROS., TRADERS, GENERAL MERCHANTS,\n\nOn Thursday the return match was played between the Argyle and Saskatoon Curling Clubs, on the rink of the former, and resulted in favor of the Saskatoon by our side. The game was very exciting.\n\nBoots, AND Shoes, Hardware, Wall Paper, AND Crockery AT COST\n\nFlour, $5, Biscuits, 15c, Oatmeal, 9c, Black Tea, 50c, Japan Tea, 50c, Beef, 10c, Pork, 10c.\n\nDRY LUMBER.\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48 Undressed do., 42 Dressed Siding, 48 Undressed do., 42 Sheeting, 30 Common Lumber, 35 Dimension do., 40\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885013001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4022, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4688, 1], [4688, 9442, 2], [9442, 14725, 3], [14725, 16643, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]