[{"id": "389d6b35c88bceb40e9f7a65240c404b316713fb", "text": "We are glad to observe that the subject of secondary education in our town is being taken hold of vigorously by hands well qualified for the purpose. For primary education, the Government has done sufficient encouragement and the judicious management of our school trustees in procuring teaching power of high standard, and their arrangements for providing early supplies of ample school accommodation are nothing to be desired. In the rector of the present High School, too, we have a gentlemen who not only encourage a certain amount of improvement on the part of the school, but to this extent urge upon the present officers to make every effort in the direction of making the institution what it might become—a model of its kind.\n\nWe feel sure that our children will benefit by such excellent arrangements, and that they would consider themselves well provided for in having such a first-class school at their command. We may therefore highly recommend this institution to those who may be desirous of sending their children there to be educated in the best manner possible.\n\nSUNDAY CHURCH SERVICES\nSt. Alban’s and St. Mary’s Churches—10 a.m.—Services are held both churches and services are conducted by Revs. A. H. Wright, Rector, and Rev. Canon Plett, B.D., Reader.\nSt. Andrew’s—12 noon—Rev. Canon Plett, B.D., Reader.\nSt. John’s—1 p.m.—Rev. M. Massic.\nSt. Matthew’s—2 p.m.—Rev. J. Harbour.\nMcKay’s—5 p.m.—Rev. J. McLaren.\nRev. Richard’s—6 p.m.—Rev. James Hunter.\nRev. M. Massic—7 p.m.—Rev. F. Hunter.\nRev. W. McReekin—8 p.m.—Rev. J. Macrae.\n\nThis Sunday: All men called to meet at 9 o’clock at Fisherman’s Hall, where breakfast will be served.\n\nNEW YORK\n\nFRIDAY, JULY 8, 1877.\n\nEDITORIAL NOTES.\nThrough the courtesy of Mr. Carroll, M.P., we have been favored with several annual departmental reports, to some portions of which we may probably direct attention in a future issue.\n\nThe accounts which are now published and delivered while the Royal Jubilee has been celebrated all over the globe are of a nature to gratify the somewhat exacting amateur proper of all true Britons, so much as the imagination of other peoples and nationalities. It may be safely said that no single event in history has ever occasioned so spontaneous, so genuine, so widespread expression of recognition and anticipation of the earth as Queen Victoria’s Jubilee. It has been like that “touch of nature which makes the whole world kin.”\n\nAmong the occurrences that are reaching of their most memorable celebrations, interest naturally centers in the gorgeous pageant at Westminster Abbey. Future it was that this brilliant spectacle which, in living contrast throws all previous triumphs of journalism in shadow should have been enacted in that historic scene which for eight hundred years has been the scene of so many striking incidents in the nation’s annals—at once the crowning place and the resting place of kings, the Valhalla of British heroes—the resting place of poets, of scholars, and of statesmen.\n\nBut perhaps the most impressive feature in the spectacle to a great degree, whatever people in the contemplation of these vast multitudes of royal subjects of different religious faiths and political creeds—but of one heart and one mind in their love of Queen and country, no denizens claim; the tents and war- implements of every “coign of vantage” from palace gate to abbey tower. And as the deafening roar from myriads of loyal throats swelled and died down along the route, it must have been strongly borne in upon thoughtful minds how deeply seated and genuine is British loyalty, and how far removed above the strife of parties.\n\n* * *\nT is a rich, rough gem,\nBorn to who cana\nThe heart of a free-born Englishman.\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY.\nPublisher and Proprietor.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., \"Over 16 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nHarvest Tools, Machine Oils, Barbed Fence Wire, Coal Oil, Building Hardware, Tin Roofing, Eavetrou hin, GO TO J. R. McPHAIL’S.\n\nMy Stock is large and well selected, and I have rated prices very low, so as to meet any competition, even that of those who are making great clearing sale so frequently. Call and get prices before purchasing.\n\n— FOR —\n\n**FTY LANE — HALF-SEIZE HEATS.**\n\n1st, McKeown, Wm., Eccles, $30; 2nd, Brown, S. J., Basco, $30; 3rd, Euceris, G. E., Phillis, $30; 4th, N. W. P., Bradly, $30.\n\n**QUARTER-LANE SEMI-FINALS.**\n\n1st, Stedman, C. M., Essex, $50; 2nd, Macdonald, W. E., Cavan, $50; 3rd, Barker, J., Dundee, $30.\n\n**QUARTER LANE FINALS.**\n\n1st, Penrose, J. G., Liverpool, $50; 2nd, Evans, W. J., Dublin, $50; 3rd, Higgins, D., England, $50.\n\n**HALF-LANE FINALS.**\n\n1st, Murray, J., Scotland, $50; 2nd, Macdonald, W. E., Cavan, $50; 3rd, Barker, J., Dundee, $50.\n\n**FOR —**\n\nThe day was spent in Prince Albert by the Queen’s Jubilee Music Society – Letter from Mr. Reid.\n\nFriday last was also the royal visit to a party at Prince Albert. The weather was sunny and fine, and there were bands and rain, which, though of vast importance to our agricultural friends, was not enough to prevent people from gathering in large numbers. Fortunately, however, the morning breaks appeared, and the parade was well attended and celebrated by the royal bands as they marched through town.\n\nAt seven o’clock in the morning the P. A. Band went out and commenced the day’s rejoicings by playing the Royal Air Band, followed by a band of music in excellent style.\n\nThe next part of the programme made up by the Police Band, and the N.W. Police played on the bandstand in front of the former, and which turned out so beautifully. The police bands have been recently organized, but the struggles were insufficient in having come so near the conclusion.\n\nWith a little more practice, we shall have no doubt of the end result, which will make an interesting treat for those who come to see them show good work. Perhaps the best part of the programme was the salutes fired by the crowd of salutes, which was arranged by Judge McCann, President. The next part of the programme was the chairman, Judge Isaac Smith, and the chief Justice, Mr. Isaac Smith. He then proceeded to explain the programme, which was most excellent. He spoke at length about the importance of the day and the significance of the event itself.\n\nMr. Isaac Smith接着上场，领导了整个节目。他热情洋溢地发表了讲话，解释了活动的国家战略，并强调了这个特定日子的重要性。这次演讲深受听众的喜爱。\n\n接着是表情生动的音乐表演，由皇家空中乐队和警察乐队演奏。表演者们表现出了无与伦比的热情，观众被他们的精彩演出所感染。\n\n在一天结束之际，皇家空中乐队再次登台，演奏了受欢迎的乐曲。当天的节目如此成功，以至于引起了赞赏和热烈讨论。", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887070801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 1906, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3719, 2], [3719, 4361, 3], [4361, 6974, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]