[{"id": "bfb17c9b032fd50d193805e0c3df8051208e0c2d", "text": "BUFFALO HALL\n\nLEADS AGAIN.\n\nOur Great Clearing Sale is still going on, and for a few days more we will offer all our\n\nDry Goods at Cost,\nReady-made Clothing, do Gent's Furnishings, do., Ladies' Furnishings, do., Infants' Clothing, do.\n\nGROCERIES\nAt Greatly Reduced Prices. All for Spot Cash.\n\nWe advertise facts only. Examine Stock and Prices.\n\nBETTS & Gwynne.\nCITY AUCTION MART\nMARKLEY & ORR,\nReal Estate and General Agents—Sole Agents in this district for the\nThe Celebrated New York Singer Sewing Machines\nANUX & BARKER,\nCarpenters and Builders,\nJob Work Promptly Attended to.\nPlans and Estimates Furnished when Desired.\nResidence—Bell's Restaurant.\n\nMANITOBA WEEKLY FREE PRESS.\nTHE MONARCH OF THE WEEKLIES.\nTHE LARGEST PAPER IN CANADA!\nTHREE MONTHS FREE.\nThree Handsome Cash Prizes\n$500-$200-$100.\n\nThe following telegraph has been received by the Minister of Agriculture:\n\"From Sir Charles Tupper:\nThe English authorities declared that the Canadian cattle imported in the Oregon and Nipissing districts were not fit for market. I went to Liverpool on Monday and succeeded in demonstrating that the cattle were free from any disease. I returned last night. This morning, and this morning, the Secretary of State for Post Office announced that orders will be given immediately for the release of all Canadian cattle.\" This will be good news for Canadians.\nTHE NORTH WEST COUNCIL\n\nTHURSDAY, SEPT. 13.\n\nThe Lieutenant Governor took the chair at 2 o'clock.\n\nTHE MUNICIPAL BILL.\n\nThe bill was taken up and on this and succeeding days all proper proceedings, the Council proceeded every day until Monday at nine o'clock a.m. The bill virtually passed yesterday and now is ready for the assent of His Excellency. Moose Jaw, Regina, Qu'Appelle and other places can have an opportunity of adequate incorporation.\n\nFRIDAY, SEPT. 14.\n\nMr. Oliver brought in a bill on this subject.\n\nSATURDAY, SEPT. 15.\n\nHis Honor took the chair at 10 o'clock and the Municipal Bill was proceeded with.\n\nSUNDAY, SEPT. 16.\n\nThe Governor took the chair at 9 a.m., the bill dealing with Municipalities occupied the whole day.\n\nOn Tuesday the Committee from the Civic Committee met on the Council and made suggestions to the effect that one month's residence and fees or taxes, be the test of qualification of electors, and that the qualifications of mayor aldermen or councillors should be the same as those who are entitled to the right of their division freeholders to the amount of $500, or tenants $1,000 or a certain proportion thereof, so that the qualifications of electors should be freeholders in their own right or right of their wives or husbands, and that before the time by law, have to run, the number of aldermen or councillors in each ward shall be fixed, and that the number of wards (whether as one or more) should be optional.\n\nWEDNESDAY, SEPT. 19.\n\nMr. Jackson moved that the Council be adjourned to the Government building praying for a recess of grievances, which was ordered to meet for consideration.\n\nThe Municipal Bill passed through committee on the Council returning.\n\nMr. White gave notice that he would move that the bill be referred to the Standing Committee.\n\nDuring the week Bills on woods, contracts, protection of sheep, auction laws, banking house, police force, local law and justiciable were before the stage.\n\nThe Council adjourned at 10 o'clock and 7 p.m., when they again took up the Municipal Bill and adopted some of the suggestions made by the Civic Committee.\n\nPROSPECTUS OF THE Prince Albert Directory AND BUSINESS GUIDE.\n\nIt is proposed to issue a Business Directory for the town of Prince Albert and District, containing a list of all persons engaged in business, who will publish the advertisements of such persons as may desire to be included therein, at a reasonable rate and a short period.\n\nThis edition will contain a history of Prince Albert, its present condition and future prospects, together with a list of the year's crops, as far as they are known, and a list of the principal firms, excepting those engaged in agriculture, and a description of the town and its surroundings.\n\nA large number of firms will be paid.\n\nBrantford, Ontario, has been engaged recently, which will be distributed throughout the Province and the Western Country.\n\nIt is believed that by this means, benefit will result, not only to each individual advertiser, but also to the town itself, whose prosperity will become better known and more widely appreciated, and a large number of inquiries encouraged to this end.\n\nCompetition of the Beauties.\n\nLondon has a lovely competition among its beauties, particularly in the case of the women who took the greatest advantage of the occasion. Miss Langley won of the best, and Miss Langley was awarded by Lady Dudley. The prize was presented by Lady Dudley and Lady Langley was awarded the prize. Miss Langley and Miss Dudley were the only two who took part in the competition. Miss Langley was the first to arrive, followed by Miss Dudley.\n\nJUST RECEIVED\n\nTHE WHOLESALE SLAUGHTER OF PRICES\n\nOF FALL GOODS\n\nWHICH WILL BE SOLD AT THE LOWEST PRICES.\n\nSECOND TO NONE IN PRINCE ALBERT.\n\nJ. M. CAMPBELL.\n\nReal Estate\n\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY LOCATED IN PRINCE ALBERT\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory\n\nC. MAIR,\n\nP. O. DRAWER R.\n\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory\n\nGOODFELLOW BROS. - PROP'S.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done under the direction of Mr. Carter.\n\nUlster Overcoats\n\nGLOVES and MITTENS\n\nFarmers Attention!\n\nA. H. Martin Son & Co. have delivered to the market a large assortment of goods, consisting of:\n\nBrantford Reapers.\n\nBrantford Mowers and Rakes.\n\nSnowball & Spaghetti Wagons.\n\nStubble and Grass Flails.\n\nA Large Stock of Seed.\n\n20 Brantford Cord Binders.\n\nS. W. VANLUVEN,\n\nFirst installment of a large stock of Mowers and Rakes.\n\nBuford Breakers\n\nThe Lion Reaper.\n\nHoney Family Mills.\n\nWheat Harvesters.\n\nCorn Ploughs\n\nJ. O. DAVIS & CO.\n\nWholesale and Retail.\n\nPRINCE ALBERT\n\nHORSE SHOE STORE,\n\nCAMPBELL'S BLOCK.\n\nAGAIN TO THE FRONT.\n\nPositively last two weeks of Great Bargains for cash. Our goods are going fast. Call and see.\n\nShirts worth $3.50, $2.25.\n\nUnderclothing $1.50 a suit.\n\nFine Tweed Suits $12.\n\nFINEST ASSORTMENT IN TOWN OF Ladies' and Gent's Gloves, Mits and Hosiery.\n\nFur Goods of all kinds.\n\nStaple Lines of Groceries.\n\nFresh Butter and Eggs always on hand.\n\nTHOMAS O. DAVIS.\n\nJ. L. JOHNSON & CO.\n\nHAVE A FULL STOCK.\n\nPowder,\n\nShot,\n\nGuns,\n\nHarvest Tools,\n\nBuilding Hardware,\n\nPlaster and Plastering Hair.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nMusical Instruments,\n\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO.'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 700,000 acres in the Great Prairie Belt, and now offer for sale 1,000,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynn, Rat Portage, Portage la Prairie and Gouin, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information regarding these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRYCE, Land Commissioner.\nMOUNTED POLICE.\n\nThe Mounted Police Force is not yet officially organized, but members of it have been recently appointed by the Government. The force will be under the command of Mr. Macdonald, who has been appointed to the position. It is expected that the force will be ready for service in a few weeks.\n\nCOMMUNICATIONS.\n\nAGRICULTURAL SOCIETY.\n\nTo the Editor of The Times:\n\nIn your issue of last week you mentioned the formation of an agricultural society in the townships of the surrounding country. A society of that kind is of great importance to the farmers, and will promote the welfare of the community. It is proposed to hold meetings at least once a month, and to exchange ideas and experiences among the members.\n\nBAKING POWDER.\n\nROYAL\n\nABSOLUTELY PURE.\n\nThis Powder never varies. A sample of any size can be sent free from the factory. It is made from the finest flour, and is guaranteed to be of the highest quality.\n\nSPORTING NOTES.\n\nATHLETIC.\n\nHockey will soon be played in Canada, and the first game will be held in Toronto. The teams will consist of the best players from all over the country.\n\nPRICES.\n\nThis Powder never varies. A sample of any size can be sent free from the factory. It is made from the finest flour, and is guaranteed to be of the highest quality.\n\nSTOVES.\n\nJUST RECEIVED.\n\nBox Stoves\nCook Stoves\nParlor Cookers\nParlor Heaters\nDrum Stoves & Stovepipes\n\nMADE TO ORDER BY\n\nT. J. AGNEW'S\n\nWholesale and Retail.\n\nJAMES SINCLAIR\n\nMerchant Tailor.\n\nHas just received his new stock of Spring and Summer Goods.\n\nAnd is prepared to supply his numerous customers with\n\nSuites to please the fancy of all.\n\nJust received a large stock of\n\nUNDERCLOTHING\n\nA fresh supply of excellent\n\nSoft and Hard Felt Hats\n\nGive me a call.\n\nJ. SINCLAIR.\n\nO. E. HUGHES\n\n& CO.,\n\nGeneral Merchants\n\nAND\n\nIndian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nFURNITURE.\n\nJust arrived. In addition to our former large stock we have received some\n\nFancy Parlor and Bedroom Sets,\nSideboards, Bureaus, Bedsteads,\nChairs of nearly all descriptions.\n\nCrawley's Cribs for the Babies\nRocking Chairs for the Ladies\nMattresses Single & Double\nto suit Customers.\n\nG. & G. E. CARTER,\n\nSTOVES\n\nJUST RECEIVED\n\nTHIRD DEEYMOND, D.L.S.\n\nCanada Life Assurance COMPANY\n\nESTABLISHED\n\nHEAD OFFICE\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $8,000,000\n\nAnnual Income, over $1,000,000.\n\nA recent agent of the Company will visit this town next week, and will offer the best terms to those interested.\n\nA. SPROAT,\n\nAGENCY,\n\nPrince Albert District, N.W.T.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, also a little R. merry Shirts and Trousers for sale.\n\nAnd a variety of other articles\n\nCHESTER THOMPSON,\n\nPRINTING ALBERT.\n\nTO THE LADIES.\n\nNEW\n\nSpring and Summer Goods\n\nJUST RECEIVED BY EXPRESS.\n\nMillinery,\n\nLadies' and Children's Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK,\n\nRIVER STREET,\n\nN.W.T.\n\nNotice\n\nIn order to prevent the further spread of the disease, it is recommended that all persons who have been exposed to the infection should be isolated until they are free from symptoms.\n\nMiss Mack & Co.\n\nCampbell's Block,\n\nRiver Street,\n\nN.W.T.\n\nPrince Albert, N.W.T.\n\nGeneral Merchants\n\nSaskatchewan.\n\nSTEWART & WOOTTON,\n\nWholesale and Retail.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883100301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 2850, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1359, 2], [1359, 1359, 3], [1359, 1359, 4], [1359, 7492, 5], [7492, 10780, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]