[{"id": "9ce2d3376e60e8c949907b308f0f2526fe750aa3", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 11, 1885.\n\nVol. 3. — No. 45.\n\nBANKINGHOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nPrince Albert, N.W.T.\nA. GOODFELLOW.\nPrince Albert, N.W.T.\n\nEAST END BAKERY\nHugh M'Dougall,\nEAST END BAKERY.\n\nALEX. LANG\nGENERAL BLACKSMITH,\nEast End Bakery.\n\nCALEDONIA BREWERY\nEAST END.\n\nDENTIST.\nJ. D. Hannafin,\nPrince Albert, N.W.T.\n\nAUCTIONEER AND COMMISSION AGENT\nJ. D. Hannafin,\n\nFURNITURE\nCHEAPER THAN EVER.\n\nGILBERT E. CARTER — ROBERT THOMSON,\nSign & Ornamental Painter,\nCustommaking and Paperhang-\ning on short notice.\n\nDecorative Painting a Specialty.\n\nCITY BILLIARDSALOON\nCorner Church and Neat Streets.\n\nA. W. R. Markley,\nGen. Agent and Auctioneer,\nAlbert.\nConfederation Life Association, Toronto.\n\nLester Manufacturing Co., New York.\nOffice in Mr. Brewster's Office.\n\nLOST\n\nA BAY MARE:\nWith halter on; branded D on left\nshoulder; narrow white stripe on\nforehead; short cut tail.\n\nAny party returning or giving in-\nformation that will lead to the\nrecovery of above to Mr. Starcher,\nEmmanuel College, will be suitably\nrewarded.\n\nTELEGRA PHIC,\nCHIT-CHAT LOCALS.\nAlice Islands in the Gulf of Mexico.\n\nBy the Right Honorable Sir John Alexander,\nMinister of Indian Affairs.\nPrince Albert, N.W.T.\n\nTo all whom these presents may come,\nbe it known:\n\nWHEREAS it is in England by the Act of Parliament 27 & 28 of Geo. I, c. 26, of the four-\nty seventh year of His Majesty's Reign, entitled \"An Act for further to assist the In-\ndians,\" similar to the Dominion Act, 1879, among other things to the effect that the\nMinister General of Indian Affairs may, when he thinks fit, direct any Indian or Indians so\npresent, by public notice to the contrary, to set out and remove from the land on which\nthey have been living and working toward the Indians in this Province of Manitoba or to\nany other land or lands within any part of the North-Western Territory, or in any part thereof, of\nCanada, or to any other lands, and every person who after such notice shall fail or refuse\nto carry the provisions of the said Act into effect, or who shall continue to remain upon any\nland, and every person who fails or refuses to do so, is hereby directed and ordered by the\nAct of Parliament 29 & 30 of Geo. meg, c. 25, and under the authority of the Government\nof Canada, to give effect to such provisions of the Act, as may be made by law in the future,\nand any person who shall disobey such order herein contained, or who shall fail or refuse\nto give effect thereto, shall be liable to be dealt with as the law may provide for such cases.\n\nThe Honourable Mr. Justice Murray of Ontario has issued a warrant against the\nMinister Alexander for his conduct in the case of Thomas Liscombe.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, SEPTEMBER II, 1885.\n\nTHE LAND POLICY.\n\nWe have endeavoured in recent articles to show how the present system of reserving odd sections School lands, and sections for the Hudson Bay Company improperly affects the settlement of the country at various stages. What we propose to do now is to demonstrate the same evil tendency of taking up of second homesteads, which we believe to be the greatest possible benefit to those allowed to do so, as well as to the community at large, unless under very exceptional circumstances. Can no arrangement be made to meet these extreme and exceptional cases where they may be most ten to suffer in the interests of the majority. The amount of land which may be homesteaded and preempted by a bona fide settler, is as much if not more than he can hope to farm successfully, and has been so before to day to pay out to our farmers that a great deal of their bad fortune has been the direct result of attempting to cultivate imperfectly too large an acreage of land, nor have we seen the slightest reason after the election. What this we consider to be beyond dispute, none of the two ambitious farmers have used or brought under cultivation any thing like the quantity of land at third division, and there can be not the slightest doubt when borne in mind, that the intention of taking up a second homestead is not purely for speculative purposes. It is sometimes urged with a degree of plausibility that what has been done, what is required to obtain his patent may greatly benefit himself by selling out, and so obtaining capital to proceed to farm anew with increased resources, and upon an extended scale. We cannot see why he would do this, for what he hopes to turn by having to begin again afresh is probably of quite as much value to him as the money an other man will be disposed to pay him in order to start that much ahead. Supposing however that he should receive a price suffi-\n\nciently large to make it worth his while to sell out, he must be in a position to buy new land, and if he does not succeed, nor will he have the land by having to do so, when we remember that in order to obtain it as a homestead he is required to bring forty acres into cultivation within three years. We have no hesitation in saying that this is no provision for capital as compared to sell his original homestead in order to acquire it he is not in a position to farm forty acres in three years, after taxing every land. There is also the question that he must desire to lay off a considerable proportion of the newly acquired capital in providing himself with superior tools to those he has parted with, and in the case of the homestead being sold, this, as prices for improved farms go, will leave him very little for the bringing of that acreage of land under cultivation in the given time, and will simply result in his being compelled to do what he promised for, and be unable to guard against, the sort of cultivation already alluded to, as responsible for many of the farmers troubles. The real remedy for this want of capital appears to us to consist in something different to buying a home and parting with it. It may be open to question whether the system of giving government loans upon homestead security is preferable. In our opinion it is not, but until we see how far it can harm them may be in it, it sometimes will not hurt the whole community in addition to the individual. However the true solution of the difficulty appears to us to be in leaving them to their own devices. Let them sit down and count the cost before beginning to build their house. Should they see no certainty of having the necessary funds to finish advantageously after work done, going to catch the patents to the land, then let them set to and hire out their services for a season to those better off, and take up homesteads for themselves strong enough has been said from their own mouths in such a dismal state. As the subjects presents itself to our view, the only circumstance which would render the granting of a second homestead legitimate would be when a man had good reasons for doing so, another district, and then no second homestead would be allowed within the district where the first had been parted with. In no case should an applicant be allowed a second home-stead until he has actually transferred the first to a bona fide resident farmer.\n\nTHE ELECTION.\n\nThe extremely limited powers of the North West Council induce us to repeat at this juncture, what is generally overlooked, that fact that what it has to do, is as far as it goes, of very great importance. The local councils are elected by it for districts within the Territories, and sit there daily, and the statutes framed for their convenience and protection will most assuredly prove very unsatisfactory to the people come to the conclusion that it means not who goes to make them up. The two councils already held to send representatives from this district to the Council, there certainly was no lack of interest among them, there was a difference of spirit displayed which showed that the people had something more than the chasing the man who would be most suitable for the work required in view. Whether as a reaction from their former zeal, or from the fact that the taking of the census seemed to give near promise of representation of a very different degree of importance, the fact remains that the councils have done, to the eye of every one, and troubled themselves little if at all about the nomination of candidates for the coming assembly of the Council. The result of the convention this year is to show that there are still some who do declare that they knew nothing at all about it, and do not feel the smallest extent bound by its action. For this result however they have only to thank their own laziness, and the fact that they have been for the action of a very few that would not, now that the day for nomination has gone by, be the limited choice of representatives now given to select them. There is a good deal of talk going about, of selecting the best nominated candidates over Territorial party lines, if we may be allowed so to express the position. To put the matter in plain words there are men who consider that the nomination of the council has been up to the present section of our community who were most in sympathy with the tone of feeling and the movement which doubtless against the intentions of most of them, culminated in the late disastrous rebellion. These holding the opinion are inclined to work against the convention's choice, and no doubt if they are right in there belief it will be impossible for them to aid actively any movement in the councils. Dr. A. Porter into the Council. In our opinion however it will be very injurious to raise such an issue at this juncture, which should have been considered long ago, if to be done at all. Had there who were present at the present convention had, everything considered, been treating the Territories fairly well, and we believe men of this opinion to be in the majority wished to be guided by the choice of a representative for the North West Council it was clearly their duty to have stated their intention in time, and then to have consulted others of the same way of thinking as to what course should be. To add the supposed nomination now is simply to register an utterly false impression of the public sentiment with regard to the mooted point. There are numbers of men in the electoral district who are decidedly opposed to what was here harangued in itself might have been construed into sympathy with what ended in a criminal and senseless rebellion, who will utterly refuse to vote for the only men who can as things stand, be elected by the A. L. F. party. The best thing which in conclusion can now be done is to let things take their course, and for men who believe that the convention's nominee is put up as an assertion of ultra-radicalism to abstain from voting all together.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHOS. POWERS, STEWART BROS., TRADERS, GENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nNOTICE.\n\nAll parties indebted to us must be served before the 1st August next, owing to an intended change in the business.\n\nSTEWART BROS.\nNORTH-WEST NOTES.\n\nWINNIPEG.\n\nWinnipeg, Sept. 1.—Kelly, the suspected murderer of Mrs. Burt, deceased in British Columbia, was arrested this morning at St. Vincent in the Canada House, where he has been sleeping. He was taken to the Encomium and from thence to St. Vincent. Constable Krause took him into his own door and gave him a place to lay in bed, while Chief Murray and Sergt. McRea placed their revolvers at his head. He was conveyed to Hallock this morning to await extradition, as he refused to cross over the line.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nEdmonton, Aug. 15.—There are rumors that a large body of Indians are collected near Squaw Lake or the Head Hill, evidently not for peaceful purposes.\n\nHumming birds are very abundant frequently lately. This fact is not so common at Edmonton, but Mr. J. Hayes says that at the foot of the mountains west of Edmonton, north of the Jasper Pass, they are quite numerous.\n\nAn Indian named Michel, of Alexis Le Sue, June land, was killed on Saturday August 1st, while hunting near the Athabasca river by three black bears. He went about, and as he did not return he was followed by his companions. When they came back he had been killed, the flesh eaten off, and a knife grasped in the hand. His gun was broken and the ground and bushes around showed that a fierce fight had occurred.\n\nSome of the Indians who took part in the attack have returned to Edmonton. They are not in favor with those of the band who remained at Athabasca. They say they were sent to bring in reserves to the military authorities at Pitt, but have no documents to show in proof. They tell how a number of Indians were engaged in the matter of disarmament. Many of the best weapons were not brought in, but were concealed safely in the woods. Those Indians who had been taken in police headquarters, and as the pieces above were no use they were allowed to keep them. Afterwards the pieces were put together and the guns were as good as new.\n\nGENERAL NEWS.\n\nGREAT BRITAIN.\n\nLondon, Aug. 30.—Graves of the chums, now buried, will be removed at Lily Bridge on Monday next with procession. Cremations in a mile race, £600. The weather is fine and the condition, and the feeling is even. Sir John Astley will present a gold watch to the winner. The match creates the greatest interest among the spectators.\n\nST. PAUL.\n\nSt. Paul, Aug. 28.—The complete success of the appeal to the Legislature of the State of Minnesota for the sale of $12,000,000 in Municipal bonds. The sale of the bonds was made at $11,475 per $100, or 114.75 per cent. In last period Municipal bonds were sold at $11,250 or 112.50 per cent.\n\nCANADIAN.\n\nTHE CAPITAL.\n\nOttawa, Sept. 1.—Chief Commissioner Wainwright, of the Royal Canadian Mounted Police, has been appointed to the position of Inspector General of the Force. He succeeds Mr. Macdonald, who has been appointed to the position of Inspector General of the Force.\n\nJAMES SINCLAIR THE PRINCE ALBERT TIMES\n\nMerchant Tailor,\n\nAND DEALER IN\n\nGENTS' FURNISHINGS.\n\nPUBLIC NOTICE.\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nCOMMUNICATIONS.\n\nA CONTRADICTION.\n\nTo the Editor of the Times,\n\nSir,—I have nothing to pretend to be the author of anything further in reference to Mr. J. C. McKenzie, or the pretended communications to which he has referred, but I have thought it my duty to make an intelligent plebiscite of your readers blame me for giving undeserved prominence to a publication which I believe myself to be responsible for his silly vapourings. In your last issue, however, a communication appeared from Mr. J. C. McKenzie, in reply to the above-mentioned article, and how pretentious it is that in justice to myself I feel called upon to say, and will do so in the following words:—Mr. McKenzie then has McKenzie to stick into that obscenity to which he belongs and from which he cannot escape.\n\nThe only paragraph in Mr. McKenzie’s letter which I wish to show your readers is the following:—“I am convinced that I had prepared for publication those charges against Mr. J. C. Waggoner, (now Sir J. C. Waggoner,) at Ottawa, and that I had ‘painted our streets’ in search of some one to assume the responsibility for them. I must emphatically deny, and I defy J. C. McKenzie to name a single individual in Prince Albert or elsewhere before whom I would not have been willing to attract to any such charge, and in this connection I may say that Mr. McKenzie was unable to name anyone, and that Mr. Waggoner is quite characteristic of the man, for in my own knowledge Mr. Waggoner has never attempted to justify his official position than this very same J. C. McKenzie. With regard to Mr. McKenzie’s allegations against me, I have no personal or official capacity I am nothing. I feel that I enjoy the confidence of every body who resides in Prince Albert, whose children attend its schools, and whom I can afford to smile at his silly and mean mongering efforts to injure, and win for himself a few votes by playing upon his congenial spirits. I do not intend to follow McKenzie’s example and resort to libelous charges, but will content myself as a justifiable way, until now is already known here of the man and anything he may say about me will be met by a flame of unappeasable feeling that is already burning, and steadily, and which reflects, I think, a great deal of credit on McKenzie, and equally a high. Before closing permit me to say that I have no desire to become embroiled in any controversy with the Police, but at the same time I cannot refrain from disclosing the attention of your readers to the fact that McKenzie has better fitted in what he says, especially in his last letter, to a private letter to a friend in Canada, viz., Mr. E. E., he knowingly attached a malicious interpretation to the conduct of the force engaged in the fight at the Hall, and attempt to excite the feelings of the community, as intended for publication. It was a lie all the same; McKenzie admits it, and I have no doubt that the same statement upon the man who even in a pitiable letter would give utterance to statements which have been false, slanderous and malicious.\n\nMr. McKenzie complains by saying it is not his business to take full account of facts. Why did he not do so? Is the truth, and say that the party who discharged his dirty work in the same manner as the others, and why should the press not again assist him in perpetrating a crime? I may have to say, in answer to his vile insinuations, that I have no personal bias against me.\n\nYours, etc.,\n\nH. J. MONTGOMERY.\n\nIRISH REBELLION\n\nA Struggle Which lasted Eleven Years, and Destroyed Nearly Half the People.\n\nThe struggle lasted eleven years. Lord Clanricarde, who was in command of the union as a war of extermination. W. Petty calculated that, out of a population of Ireland, there were as many as fifteen per cent, of the race perishing by famine. Where tranquility was restored abroad, the ill land belonging to the Irish in Dublin was confiscated. The King and the Monarch was confiscated, and the French settlement for the purpose of allowing no herding or house building and almost total depopulation. The chief waste in the progress of the rebellion, was selected by Cromwell as the future home of the Irish. The French settlers, on which the confiscations of Cromwell was based, were capable of so wide an asylum that the French army could not escape. In the first place all persons who had taken part in the rebellion before November, 1652, or who had in any way assisted the rebels before that date, and also those who were not belonging to the government of Ireland, were sentenced to death and to the absolute loss of their properties. Secondly all head men who could not pay their fines were sentenced to death and to the absolute loss of their properties. Lastly all head men who could not pay their fines were sentenced to death and to the absolute loss of their properties. The disbanded people were scattered throughout the country on certain day and were forbidden to return to the Sinnans on pain of death. The Irish were not permitted to return to the country until the restoration. With the return of the Royal family matters mended a little, but no attempt was made to undo the great wrongs inflicted on the Irish who had been done by the Commonwealth. The country had been given up to the English, and the Irish were forced to live in subjection in satisfaction for services of peace, or as it was held by persons in payment for services of war. The Irish were obliged to pay a heavy tax, and were subjected to the royal sanction in the Parliament at the beginning of the insurrection. It would seem that the Irish had diverged from their interests. At the same time, it requires impossible to defend the Irish cause, and the English cause, which it was sought to satisfy the various claims to lands. This Act simply confirmed the rights of the settlers, and laid little or nothing to satisfy the high handed wrongs which had been perpetrated under the Protectorate’s rule. The Irish were deprived of their rights, who had been deprived for their attachment to the English crown had their property confiscated, while the English were excluded forever from their old possessions, and no less than seven million acres of land were confiscated. The Acts were set out under this Act to a number of English adventurers in the total exclusion of the old inhabitants of the island. — The Contemporary Review.\n\nArms to be taken from the Tower.\n\nWith the exception of the riffles in the Armoury, which will remain as one of the curiosities of London, the whole of the arms, and the munition store kept at the Tower will be removed to Woolwich, the central depot of England. The Tower is now occupied by a great interest in the Tower and desired to have it preserved purely as an ancient monument. The Tower is in a most perfect example of the Norman castle in existence, is therefore to be now accomplished. The Tower was originally built as a fortress, and was in connection with the authorities of the War Department with a view to the common safety. It was a military store, the armament, armaments and arms, which employed at the Tower more than 1,000 workmen and labourers to keep the Tower in repair, entirely of the utilitarian features, which exposed to extra risk and a certain destruction, and as much as possible to avoid it. In 1878 the barrack and hospital stores were removed to Woolwich, and the Tower was left as the seat of the work people, and a few years after wards the accommodation followed, lest the Tower should be used as a place to store the arms. These stores were taken to Woolwich, and the Tower of London was removed out in use as a military store. The Tower was closed to it, and a spectacle of unrealized interest to the thousands of visitors who come to see the capital.—London Press.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, MachineOil,Turpentine Plastering Hair, steam refined. Powder, Shot, Caps, Shells, Etc., Etc.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent’s Furnishings, Hats, etc., Have been selected with the greatest care, while special attention has been given to our Grocery and Grocer’s Department.\n\nAn Elegant Assortment of Carmels, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Sodas, Fruits, Toffee Fingers, Lemon Creams and Iced Sultanas Make a choice addition to our well assorted line of GENERAL GROCERIES.\n\nPIPS, TOBACCOES, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. HUGHES & Co.,\n\nGeneral Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising Morton’s Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also one car load Ogilvie’s Flour,\n\nWhich we sell cheap for cash.\n\nO. E. HUGHES & Co.\n\nT. N. CAMBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nT. E. JACKSON, Prince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885091101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 5695, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2752, 1], [2752, 11739, 2], [11739, 15098, 3], [15098, 24323, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]