[{"id": "71ba26fc4f2ad024f861ae01e24510cdd99a8dc3", "text": "PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 24, 1885.\n\n$2.60 A YEAR.\n\nBANKING HOUSE OF Macarthur & Knowles, Prince Albert, N.W.T.\nPrince Albert, N.W.T.\nTrust not General Banking Business.\nInterest allowed on Deposits.\nMoney Deposited available at all points in the Dominion.\nQuestions understood and promptly answered by:\nMACARTHUR — Merchant Bank of Canada\n\nNOTICE.\n\nAs we intend dissolving partnership, and have included our names in these accounts from this date, we will rely on the law court for collection.\n\nMARKEY & CO.\nEncourage Home Manufactures\nWASHING MACHINES MADE TO ORDER.\nPrice $10. Give Them a Trial.\nWells Drilled and Pumps Made and Repaired.\n\nOrders sent at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\nPrince Albert.\n\nCALEDONIA BREWERY\nEAST END.\nThe proprietor of the above concern is prepared to supply local customers with his best brew in bottles or kegs for sale.\n\nPlant Bottles, 81 cents.\nQuart Bottles, 82 ½ cents per dozen.\n\nAny such orders delivered to all parts of town.\n\nWM BROWN\nEAST END BAKERY.\nBread unsurpassed by any west of Winnipeg.\nVisit any of the Cakes and Pastries made to order.\n\nHugh McDougall\nEast End Bakery.\n\nTHE GABLE HOUSE.\n\nPRINCE ALBERT\nPlaning Mills and Sash and Door Factory\nCor. Ross and MacKay Sts.\nSash Doors, Frames, Blinds, Mouldings and Builders' Furnishings made on the shortest notice.\nA. GOODFELLOW\nPrince Albert, N.W.T.\n\nNOTICE.\nPUBLIC NOTICE.\nPublic notice hereby given that proceedings have been taken against the erection of the proposed Municipality of the Town of Prince Albert, comprised of the following tracts of land:\n\nLot nos. thirty-nine, eighty-eight to ninety-three inclusive; lot nos. twenty-one, eighty-three to eighty-five; lot nos. thirty-eight, ninety-three to ninety-six inclusive; lot nos. thirty-eight to eighty-two inclusive; and lot nos. sixty-three to eighty-two inclusive, as per record in the office of the Surveyor General, to wit: Lot no. thirty-eight and part thereof, also lot thirty-eight and lot thirty-eight and part thereof, the southwest quarter of lot sixty-three and part thereof, the southeast quarter of lot eighty-three and part thereof, the northeast quarter of lot eighty-four and part thereof, the southeast quarter of lot eighty-five; part of lot ninety-three, being part of the southwesterly quarter of the northwest quarter of the northwesterly quarter of lot ninety-three; the northerly two hundred acres described as having its northern and eastern boundary lines along the Boty River, and the southwesterly quarter containing four hundred acres, described as having its southern and western boundary line along the Boty River, and the northeasterly quarter containing three hundred and seventy-five acres, described as having its northern and eastern boundary line along the Boty River, and the southeasterly quarter containing five hundred acres, described as having its southern and western boundary line along the Boty River, and the northerly quarter containing four hundred acres, described as having its northern and eastern boundary line along the Boty River, and the southerly quarter containing three hundred and seventy-five acres, described as having its southern and western boundary line along the Boty River; the northerly one thousand eight hundred and thirty acres hereinafter mentioned, lying within the limits of the municipality.\n\nNotice is hereby given to any person whose occupation of any person other than the Township Council must be given up the undermentioned forthwith.\n\nAny person retaining such same after this notice will be prosecuted.\n\nBy order,\n\nGeo. M. Moffatt,\nInspector N.W.M.F.\n\nNOTICE.\nLE FRANCAIS ET LA MUSIC.\nFrench and Music are the greatest companions, the former being the practical language, and the latter, an ever-present companion, the importance of which I offer to the pupils of Government Rifles and others, who desire to improve their music sense. The school begins Tuesday next, and I shall make a specialty of teaching the French language. The school will open on TUESDAY, Aug 1st, 1885. The only difference between this school and others is that it can only be pursued by attendance from the morning school until 3 o'clock p.m. For further particulars apply to\n\nL. R. Taylor.\n\nNOTICE.\nSTRAYED!\nTwo Sons and One Barrow Pig.\nThe owner is requested to pay damages and take them away, or they will be sold.\nWILLIAM SHUPAN\n\nNOTICE.\nNotice is hereby given that all Government Rifles and other armory personnel are required to present themselves at the Office of the Royal Canadian Mounted Police Station.\nAt this time of year, the fencing of cattle pasture lands will again commence, and the Department of Agriculture would wish to join the question of the public interest in this matter, so as to keep the peace and ensure a good season for the growing season.\n\nInspectors Havoc and party who were out last night in the Carrot River district were interrupted by seven Indians in custody.\n\nMr. Thomas Powers has given Mr. M. H. Clark, Sec. Trustee of the Levese Agri Cultural Society, a special prize in the Labour Department.\n\nMr. John Wylie has paid his bill to Mr. Murray. Murray has held out for more, but in the end Murray got a trip across the Mountain to the Pacific coast.\n\nWe have a pleasant trip.\n\nJ. F. Wilder Principal of the Portage-in-Parade School, has been appointed of teacher of the Royal Alexander Agri Cultural Society.\n\nMr. Royton McCallum, Reg., First Stage Coachman of the Alexandria district, has been engaged for two years, in which he has driven a stage to Edmonton.\n\nParliament at Ottawa.\n\nThe Hon. E. Dewdney, Leader of the North West Territorial Government House, Regina, July 13, 1885.\n\nWANTED\nA TEACHER.\nMale or Female—For Prince Albert East Public School.\nApply before 9th inst. to\nJoseph Colquhoun.\n\nTENDERS.\nTenders will be received by the undersigned to be signed by them.\nSaturday, the 13th inst.,\nSupplying the Princess Albert Postmaster.\nPublic tender.\nFor particular apply to\nJohn Stewart, Sec. Board\n\nGenuine Imported HAVANA CIGARISI\nCHOICE BRANDS BY T. E. JACKSON'S.\nTRY THEM.\n\nHON. J. M. McGUIRE\nHon. John Magee\nHon. Wm. W. Johnson\nHon. J. J. Cliff\nHon. Joseph Colquhoun\nHon. James Mungo Smith\nHon. Wm. Watson\nHon. Robert Thomson\nHon. Daniel Smith\nHon. J. W. Morrison\nHon. Wm. H. Sergel\nHon. J. M. Fitzell\nHon. R. J. Scott\nHon. J. K. Bell\nHon. Wm. G. O'Malley\n\nSPANISH VINTAGE OF HAVANA CIGARS\nLOCAL BREWERY OFFER.\nCHIT-CHAT LOCALS.\n\ngathered by our Reporters.\n\nGood flour at T. O. Davis'.\nGood cigarettes at T. O. Davis'.\nChoice Tobacco at Clark's Drug Store.\nTen bars of laundry soap at Stewart Bros.\nBreakfast bacon, spiced rolls and ham at Walter's Baker.\nThe day breaks bright, this good and fair weather be keeping us.\n\nStray news of note:\n\nNotice is hereby given that the City of Prince Albert will be situated on the point where the western boundary line of the town (and eighty-eight rods on the north side) runs along the west bank of the North Saskatchewan River, thence south along said western boundary line to the line running due south but thirty rods west astronometrically across lots sixty-eight to seventy-eight aforesaid, thence aforesaid eastward to a point where the north boundary line of the town is situated on the point where the water's edge, on the south side of the north Saskatchewan River, thence south along said western boundary line to the line running due east but thirty rods west astronometrically across lots sixty-eight to seventy-eight aforesaid and distant therefrom until the railway line of Canada Southern & Pacific Company, as per plan, drawing of which will be exhibited in the office of the Receiving Agent, Dunlop, 8th and Princess Street, and joined by a town site.\n\nThe above description covers the town site as per plan of subdivision of the City of Prince Albert, together with the line of Lots No. One hundred and seven:\n\nSecond Section of Ordinance No. 6 of 1882, Western Canada Federal Act.\n\nMr. Williams has held the waterworks contract at the rate of one thousand eight hundred and thirty acres per hectare.\n\nMr. Paine, coming from England, will have visited the town for the first publication of this notice in the Prince Albert Times and Saskatchewan Review.\n\nMr. Dewney, the man who was serving as Governor's Bodyguard, has been arrested, but the Minister of Revenue, Mr. Kidd, has refused to arrest him, saying that he cannot be arrested without the Governor's consent.\n\nMr. Murray, the man who is supposed to have been employed by the Government in the construction of the Canadian Pacific Railway, has been arrested, but the Minister of Revenue, Mr. Kidd, has refused to arrest him, saying that he cannot be arrested without the Governor's consent.\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVETTY\n\nPRINCE ALBERT, N.W.T.\n\nTERMS—$2.00 per month in advance.\n\nNo advertisements will be inserted in this paper. Business matters, etc., per line.\n\nNo advertisement inserted for less than $1.00.\n\nAdvertisements and instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—Rev. A. H. Wright.\nThe Church Chapel.\n3 p.m.—Rev. J. Matheson.\n6 p.m.—Sunday School.\n11 a.m.—Rev. E. Macdonald.\n\nSt. John's Church Services.\n10:30 a.m.—Rev. J. Prickett.\n1 p.m.—Rev. J. Prickett.\nSt. Paul's.\n3 p.m.—Rev. Canon Firth.\nSt. Andrew's.\n10:30 a.m.—Rev. J. Prickett.\nSt. John's.\n3 p.m.—Rev. J. Prickett.\nSt. Paul's.\n1 p.m.—Rev. J. Prickett.\nSt. Anne's, R.Catholic.\n10:30 a.m. and 5 p.m.—Rev. Pedro Andre.\nSt. Paul's (Presbyterian).\n11 a.m. and 7 p.m.—Rev. Mr. Williamson.\n\nFRIDAY, JULY 24, 1885.\n\nTHE MAIN'S CORRESPONDENT\n\nThe Toronto Main evidently thinks that he can compound the Government's difficulties, when there was yet time to effect it on behalf of the Eastern Provinces, such support towards helping the struggling settlers of the Territories as would certainly have prevented the recent rebellion, but now refuses to saddle the white settlers generally with the blame. It forgets that should it succeed in proving that the bulk of the Canadian, native and old-country residents are ripe for rebellion, it will be unable to arrest its course, and that its policy will only then have begun, when the reason of the widespread and intolerable discontent has been found. That with such an object the Main should publish and adopt the views of those who wish to saddle all who will not ever furnish the evidence of good faith—to say nothing of accuracy—which might be afforded by the addition of their names to their epistles, speaks badly for its own honesty. It is evident that the end repent having on such evidence tried to blight the reputation of a community in general and some individuals in particular. The Main probably deceived by the evidence of indiscreet and uneducated persons contained in M.G.'s letter, failed to inform itself that he, although giving his initials, lives in so great obscurity that suspicion of him as the author has never arisen, and that in consequence of his object, probably the only result obtained by those who strive to injure would be his imprisonment and the starvation of his family. While quite aware that he has made impositions against several, totally innocent people, and has let himself and others, generally speaking, into the hands of his supposed friends—quite open to attack, we think that he should be allowed more rope to hang himself. Curiously enough as he conceals each letter, he forgets that while he does so, he makes the charges and then transfers them to the public. Even honest men must see that the open and forcible manner in which these warnings were given had the object of getting the danger removed and stamped out at once. That this belief with Government support is untrue. The few admissions which could only be published in our paper we have had since the articles referred to were written. If \"F.B.M.\" can, without exposing himself too far, better the Mets by convincing the small clique in power that he is right, let him do it; he has no resort to countering the intentions of some well-intentioned articles of ours into sympathy with them, we are sorry for their cause. The French officers of a dismounted company stationed here, have been found at Batcote when like the dispositions to those in relation—commonly assisted by the volunteers to have endeavored to make the same assault on F.B.M.'s post, by uncovering evidence in advance. We expect to hear more of him before the trials are over, and that he will be found to be right, that while supporting the Government as far as possible, we have not shared the guilt of suppressing what we could uphold of a nature likely to erupt in the future.\n\nDISARMING SETTLERS\n\nAs far as can be ascertained from telegraphic despatches the intention of the Government is to proceed certainly to disarm the Territorial, and to disarm settlers therein. Full particulars of the proposed measure are not to hand as we write, but we learn indirectly that white settlers will be exempt from its operation—this is the only certainty likely to carry out this proposal, and as opinion that the Government is taking a step best with difficulties upon every side. In the first place it is very questionable whether they can succeed in disarming the disloyal, any settler at all, unless they have previously succeeded in depriving the Indian of every weapon, not excluding their bows and arrows, or else have made arrangements to put them in the possession of the half-breeds, but to insure their keeping, at that interval. There certainly are many few localities the population of which is so distinctly loyal or rebel in tendency as to allow of the application of the measure, and with the half-breeds it seems to us that it will be impossible to provide a district and say that all its inhabitants should be disarmed. Of course on the face of it there would be an enormous injustice in attempting to disarm a considerable number of half-breeds while white settlers are exempted, because there are large numbers of the half-breeds who have proved themselves to be quite as loyal and trustworthy as the best of the white settlers, and very much more so than many of the Indians. Again supposing that by some means which at present are not apparent, some equitable distinction between loyal and disloyal could be arrived at, and that the latter would be able to search for and seize the arms of those regarded as unworthy? We ventured some time ago to call attention to the necessity of making what radical measures may be considered before the actual dispersal of the forces under Gen. Middleton's command. It certainly seems a curious policy to first remove the troops and then immediately initiate such measures as will allow all parties left behind to be free among a majority of the inhabitants of the Territories who, from certain indications intelligible to old settlers, may be said to be by no means so thoroughly disheartened as is asserted by people at a distance. Such columns to justify the suspicion that we would give utterance to alarmist views, but in the face of the tone adopted by those who were lately in open rebellion and manifestly sympathetic to a movement to a certain extent, we feel our duty to plainly and distinctly tell the Government that instead of exhausting conciliatory measures, it should attempt any of an irritating tendency, it must first consider what hope it has of effecting its purpose, to send another army such force as has already been drawn. It must be borne in mind that while only a handful of the settlers were engaged in the recent writhed business, so will all find that only a generous policy will enable the Government to depend upon their support again. Suppose this to be assured, the proposed force of a thousand police will have the work cut out on to prevent the organization of a second band of the leaders and Indians from having most serious consequences, so having made a suitably severe example of the ring leaders in the late outbreak, it will be necessary to keep the Indians in hydra, and instead of keeping up class or race prejudices, to trust to careful and kindly treatment in future. In place of attempting to disarm the half-breeds in any number it will be far better to organize an army of equally equipped rifle corps composed of both whites and half-breeds known to be loyal, and to hasten on railway communication, supposing that all the Indians and all the settlers are loyal as has been always open to organized disarmament, it would be very questionable as to whether it would be safe in a country of such vast extent and with so small a police force to trust that portion of the inhabitants to carry arms, unless when called out as volunteers to act under responsible authority. We trust that the Government will carefully consider these points before proceeding to undertake a measure which will involve such serious difficulties such as they probably have little idea of.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 17 feet extra.\"\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWART BROS., TRADERS, GENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas, Tobaccos, Coffee, Oatmeal, Sugars, Canned Goods, Cat. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nNOTICE.\n\nAll parties interested in must be set before the 1st August next, owing to an intended change in the business.\n\nSTEWART BROS.\nCOMMUNICATIONS.\n\nONE OF THE WOMEN.\n\nTo the Editor of The Times.\n\nSir,—I cannot conceive why any woman in Prince Albert should be annoyed because I wrote a note to Col. Irvine towards the Irving House. Why have we not some of our valiant fifteen and twenty-five ladies who are working for their lives, while the Mounted Police were walking around town with rifles and saber-arms? They did such good work that was done during the trouble. Why did the ladies of Prince Albert not show a charitable spirit by sending some of their surplus money to good use like their sisters in the East and the Old Country? Had they been there to help those suffering the sick and wounded, they would then be worthy of praise! I fail to see any good reason why the hardworking people of Prince Albert. He was here as a public servant, paid a large salary by the Government to do his duty, and I am sure he did well. We should mark by doing it too well. It is to be hoped the leading ladies will make better use of their money in future.\n\nYours truly,\n\nANOTHER WOMAN.\n\nDominion Parliament.\n\nOTTAWA, July 13.—In the House today Sir John said that during recent negotiations would be opened with the Governors of Ontario, Quebec, and Quebec, in order to settle absolutely and forever what the boundaries between Manitoba and Ontario, Ontario and Keewatin, and between Ontario and the region lying to the north. Imperial legislation would then be invited. The northern boundary of Ontario would extend from Lake Superior to the west, formal, as the boundary between it and Ontario had been fixed by the Privy Council.\n\nCANADIAN.\n\nTHE CAPITAL.\n\nOTTAWA, July 13.—Mrs. Delaney, whose husband was killed at Frog Lake, arrived in the city this morning from the North West, and left for Aylmer to-day.\n\nSix men, while ramming the Carl Rapids Rapids, were here to-day set. Four of them clung to their boat, and the other two swam ashore. The four of them were thrown over to the Demi-charge Rapids, half a mile below, and were there washed off the boat and drowned. They were Mr. Wm. Christie, Phil. Martin and George Langlier. None of the bodies have been recovered yet.\n\nTORONTO.\n\nToronto, July 13.—Mary Ann Bailey, a married woman and mother of seven children, attempted to drown herself in the Bay yesterday afternoon. At the time she was intoxicated, and had been drinking, and was tired of life. She was allowed to go on her husband promising to look after her.\n\nMONTREAL.\n\nMontreal, July 13.—Many cases of poisoning by canned lobsters are reported. The President of France has conferred the cross of the Legion of Honour on Mayor Beauregard.\n\nAt the meeting of the executive committee of the Quebec Rifle Association to-day, great dissatisfaction with the Dominion of Canada's conduct in the matter was expressed. One member stated that out of one package of ten rounds three cartridges missed fire, three missed the target, and four were useless. The marksmen, who were Windshields men, made seventeen points.\n\nSix men, members of small gun were permitted this city to-day. The military returns for the past week show ten deaths in the city proper from the disease, and five in the suburbs.\n\nHAMILTON.\n\nHamilton, July 13.—The Lioness Victorian's Association meets to-morrow afternoon to discuss the advisability of raising the price of tickets from ten cents a glass to account of the increase in the city.\n\nNORTH-WEST NOTES.\n\nBATTLEFORD.\n\nBattleford, July 13.—Miserable Man is making a clean breast of matters, and supplying many missing links in evil connecting the brothers to the uprisings.\n\nAn Indian arrested for a minor offence proves to be the murderer of Chief Big Head.\n\nCamp fever is raging at Fort Pitt. Col. Osborne Smith is ill. A doctor came from here to-day.\n\nWhite Clouds advancing towards Fort Pitt with prisoners.\n\nBy the flying of a scouting that came in contact with saw at the Princes Hotel yesterday, Capt. Gordon, aged 19, was killed, and a severe flesh wound inflicted on the head of Malcolm Young.\n\nGENERAL NEWS.\n\nGREAT BRITAIN.\n\nLondon, July 13.—The late meeting of Whimbrels was opened to-day in splendid weather and with a full camp. The Government is ignorant of the reported offer of El Mahdi, through Mons. Rollins, to release gen. Gordon for £5,000.\n\nGERMANY.\n\nBerlin, July 13.—Empress Augusta offers a prize of £1,000 for the best portable hospital tent for war or epidemic use. Competitors are to exhibit the tents at the Artwork Exhibition.\n\nTELEGRAFIC.\n\nTHE VERY LATEST NEWS BY WIRE.\n\n(By Special Telegraph.)\n\nCLARK'S CROSSING, July 24.\n\nGen. Middleton has gone to the Rocky Mountains.\n\nCrow's council has refused guarantee of the conduct for Gabriel Dumont from the States as a witness in Riel's trial.\n\nMilitary telegraph operators in the North West are now employed in the va. pors and posts. The only one employed in Government service being J. S. Macdonald of Battleford who has been appointed to the office just opened at Wood Mountain.\n\nGen. Middleton has ordered distribution of 2,200 tons of oats sent amongst the famines of Saskatchewan from grain piles here but nearly all has been hauled away by contractor Sinclair, before order was received.\n\nCapt. Secretary, Assistant to Chief Transport Officer Redman leaves Qu'Appelle for here tomorrow and Mr. Redman will be expected in Prince Albert in a few days.\n\nA Shiek has arrived at Cairo, who was present at the funeral of El Mahdi, and confirms the truth of the false prophet's death already reported.\n\nGen. Grant died on Wednesday. No arrangements have been made for the funeral.\n\nThe Dominion Parliament was prorogued last night.\n\nCicero is again rising in Spain.\n\nCol. Williams was buried in Port Hope on the 21st. Fifteen thousand people were present. The most imposing ceremony ever seen in Canada.\n\nSir Leonard Tilly has arrived in Ont. from England.\n\nRiel's trial has been postponed for one month, the defense a chance to procure evidence.\n\nThe air. Quebec of the Sarria line, steamship, left here yesterday at 12 o'clock in feet of water. The vessel and cargo are a total loss. The passengers and crew are safe.\n\nFor good corn and oat meal, see T. O. Davis.\n\nThe latest styles of hard and soft felt hats at Walters & Baker's.\n\nFresh meat, fish, eggs, and farm produce in season and ground at shortest hours.\n\nA supply of bill heads, statements, etc., just received at this office.\n\nALEX. LANG\n\nGENERAL BLACKSMITH.\n\nHas opened a shop in this east end, directly opposite the Hotel Craigwill.\n\nMachining and General Blacksmithing done promptly throughout.\n\nAll kinds of Iron Workings Required and put in order.\n\nALEX. LANG,\n\nPRINCE ALBERT,\n\nSASK.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nSHANNON & McLEOD\nTHE REBELLION.\n\n(Continued from Our Last.)\n\nWhile the right at Black Lake had carried the step up to the 20th of March, the left had made no advance of what had been going on at Prince Albert in the interval between that date and the departure of Col. Irwin.\n\nCarleton, although this should not be omitted, there was little of interest to the government at this juncture, very shortly. It has already been noted that a committee was appointed to make preparations for the defense of the town, and that instructions had been given to Col. Sprattwood to take charge of the volunteers, while Inspector Moffat would remain at Carleton to keep in touch with Goschen. The measures adopted for defense were, briefly speaking, the throwing up of breastworks and redoubts to watch the points from which an advance could be made by the enemy—no attempt being made to prevent Col. Irwin by courier, in consequence of the interruption of that by telegraph. These arrangements were so far from being complete that it is impossible to speak of them with any degree of qualified approval of what was done with the main body of the volunteers within the town. The result of the committee's proceedings, more especially after the event, is very simple, and it must be allowed that it was not very satisfactory to the government. The committee had been instructed to make such preparations as they thought necessary to defend the town, and patrolling the environs of the town was a most important duty which they had neglected. It is true that knowledge of drill had been had some promise, but the fact that the affair was going to be carried to the length of bloodshed, there seemed to be a great deal to be said for the committee at any moment with the force known to be on the road and believed to be marching towards Carleton. Unfortunately there were none who remembered that Col. Irwin had been ordered to Carleton, and induced his followers to have joined him during the flood River rebellion to have gone out to waylay the expedition which was to have been sent to take Col. Irwin prisoner. Col. Irwin at a disadvantage and cut off from supplies, and that he could have done nothing to prevent the advance of the rebels, and that he failed to do so was owing to two things—one being the indecision which had prevented him from adopting the standard of a second rate man, the other the fact that Col. Irwin took care that his followers should be kept together, and tended to march steadily upon Carleton, while he made his way round by another route. There it may be stated that Col. Irwin did nothing to prevent the advance of the fact of his having done so may be regarded as a Parliamentary interference on behalf of the government, and taking advantage of his ability to ambush Irwin's force at certain points where, with his own followers, he could have prevented it from reaching Carleton immediately after the return of the force engaged in the field. If it can be supposed that Col. Irwin had been able to have delayed the advance of the rebels until he could have brought his followers into action, the result might have been different. Another opportunity to annihilate the whole rebel force as well as to put out the fire which was burning in the suburbs of the town, and the destruction of the town itself, was afforded by the fact that the fire had broken out and was allowed to spread from the defences of the French fort. Col. Irwin, however, had been ordered the half breed and Indian militia to his command, this ignorance of what was going on in the town itself was forgivable on the part of the rebel leader. Perhaps, however, the greatest mistake of all was that Col. Irwin was not his position to pitch on this settlement immediately after the fight at Black Lake. His followers were wholly unprepared by the fact that the French half breed leader knew he knew that Col. Irwin's force had entered the fort, and that the\n\n---\n\n1879. Buffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Cloth ing, Gant's Furnishings, Hats, etc., Have been selected with the greatest care, while our prices have been given to the advertiser for our Grocery Department.\n\nGarnetts, Fresh Oysters and other Mix'd Oats, Biscuits, Baking Powder, together with Fresh Biscuits in Pots, Fruits, Toffee Fingers, Lemon Oranges and Seed Salted Nuts.\n\nGENERAL GROCERIES.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBEETTS & Gwynne.\n\nO. E. HUGHES & CO.,\nGeneral Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of:\n\nDry Goods, Hats,\nReady Made Clothing,\nBoots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising:\nMorton's Celebrated Jams,\nJellies, Pickles, Confectionery,\nTeas and Sugar.\n\nWhich we will sell cheap for cash.\n\nC. H. HUGHES & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nJUST RECEIVED\nJ. M. CAMPBELL\nAT THE\nHORSE SHOE STORE\nA LARGE STOCK OF\nREADYMADE CLOTHING\nDry Goods\nCrockery,\nGroceries!\nAlso a large Quantity of\nWINNIPEG FLOUR,\nCHEAP FOR CASH.\n\nT. O. DAVIS J. M. CAMPBELL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885072401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 7062, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8773, 1], [8773, 18008, 2], [18008, 25019, 3], [25019, 30276, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]