[{"id": "3eebdb24b29dfee97a961172c2539b2ba718f288", "text": "DEATH OF BISHOP MCLEAN\n\nIt is our painful duty this week to have to announce the death of the Right Rev. John McLean, Bishop of Manitoba, which took place at Bishop's Court, a few minutes before noon on Sunday last, the 7th inst. Decoan had been for some time previous to his death afflicted with Bright's disease of the kidney, which had prevented him from making a trip throughout his diocese and the accident which happened to him at Edmonton was the cause of his death. When he arrived from Edmonton he was very low, but it was hoped that with good care he would recover. Fate, however, decided otherwise.\n\nIt was scarcely more than midway on life's pathway, nor had Bishop Mclean been long years to lay down his pilgrim's staff.\n\nIn his death the Anglican church of the Northwest loses a zealous and persistent worker whose labors included an eloquent preaching, and the Town of Prince Albert one of its best, if not its best, friend. To Mrs. Mclean and the other members of her family we tender our sincerest sympathy, and in doing so we assure them only echo the sentiments of all who knew them and by their mention to all those who had the pleasure of the acquaintance of the late prelate.\n\nThis week we are unable to do more in the way of a sketch of the life of the deceased than quote from a letter to be found in Morgan's Annual, but next week we hope to be able to refer at length to his life and labors in the Northwest.\n\n[The Rt. Rev. John Mclean was a native of Scotland, and was born at Pertham on the 17th of November, 1821. He took the degree of M. A. at the University of Aberdeen in 1851, and in 1856 was ordained deacon, and in 1858 was made curate of St. Paul's, London, Ont., where he remained eight years, when he was appointed first Bishop of Australia, and Rector of the Cathedral and Warden and Divinity Professor of St. John's College, Rupert's Land. The doctorate of divinity (honoris causa) was conferred on him in 1871, and D.D. in the same year. In 1871 he was appointed Bishop of Manitoba, and six years afterwards he founded Emmanuel College, of which he was Warden and Divinity Prof.]\nTERRITORIAL NEWS\n\nEDMONTON.\n\nThe Edmonton School Board has cleared all liabilities and now has $700 in hand.\n\nThe new school building will be ready for occupancy next fall.\n\nThe Edmonton Fire Department has purchased two new fire engines.\n\nThe Edmonton Chamber of Commerce has approved the construction of a new city hall.\n\nCALGARY.\n\nThe Calgary Herald reports that the city's population has grown by 10% since last year.\n\nThe Calgary Stampede has been cancelled due to the poor weather conditions.\n\nThe Calgary Exhibition and Stampede will be held from July 25th to August 4th.\n\nThe Calgary Zoo has opened its new aquarium.\n\nThe Calgary Public Library has added over 1,000 new books to its collection.\n\nThe Calgary Police Department has arrested a man for shoplifting.\n\nThe Calgary Fire Department has responded to over 100 emergency calls this week.\n\nThe Calgary Chamber of Commerce has approved the construction of a new convention center.\n\nThe Calgary Stampede has been cancelled due to the poor weather conditions.\n\nThe Calgary Exhibition and Stampede will be held from July 25th to August 4th.\n\nThe Calgary Zoo has opened its new aquarium.\n\nThe Calgary Public Library has added over 1,000 new books to its collection.\n\nThe Calgary Police Department has arrested a man for shoplifting.\n\nThe Calgary Fire Department has responded to over 100 emergency calls this week.\n\nThe Calgary Chamber of Commerce has approved the construction of a new convention center.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR White Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetin\n\nDress Goods,\n\nSilks,\n\nLinen, etc.\n\nGO TO J. M. CAMPBELL'S,\n\nGROCER AND DRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\"Over 19 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings at cheaply any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nNorth West Council.\n\nThe Council has been very busy during the past week, and the next day could scarcely be called one, only lasting a few minutes.\n\nMr. Maclean removed from the committee a resolution recommending that the legislature ought by the Regina and Qu'Appelle petition be brought forward as private bills. The motion was carried almost unanimously. Mr. Breda bill requesting illegitimate children.\n\nThe motion of Dr. Wilson was added to the committee on schools and finance, and that of Col. Irvine to those on miscellaneous subjects and papers.\n\nMr. Maclean moved the adjournment, and the question being put, that the civil justice committee expect to get the jurisdiction through the proper hands and at the proper agency, by the adjournment of the session. Mr. Louden moved an amendment so that the latter estimate was more economical than usual, and another (opposite) levy for so young a country.\n\nMr. Ross presented the report of the finance committee recommending advances to agriculture societies through their representatives as follows: R. C. Grant, $25; J. T. Smith, $10; A. S. Bellwood, $25; J. S. Turrill, $30; S. Marshallsay, $25; R. D. Laidler, $10; Fred Boyle, $50; H. S. Cunningham, $50; Dr. Wilson, $10; and A. W. Hughes, $50.\n\nThe report was received.\n\nHis Honor presented an application for a grant from the Saskatchewan Agricultural Society. Referred to the finance committee.\n\nMr. Perley moved for a committee consisting of Messrs. Scott, Mr. Terry, Jolly, and himself to be appointed to consider the ordinance of 1883.\n\nMr. Second introduced a private bill to legalize the bonus by law of Regina.\n\nMr. Turrill drew attention to the loose women who have been allowed to conduct houses. He thought the license of the Northwest was of a very low order.\n\nMr. Cowburn introduced a bill to legalize a license by law of Qu'Appelle.\n\nMr. Reid objected to many bills which had been in connection with the railroads for the support of illegitimate children, and he asked that it be allowed to stand.\n\nCol. Richardson moved the committee in the name of the council, to consider the civil justice ordinance, or public notice act. After a few clauses had been passed, Mr. McLeod raised the objection that the bill would not work satisfactorily, and they were only losing time going on with it in its present shape. He proposed that the committee consider the bill printed as they intended to present it, and then the council would be able to deal with it intelligently. He moved that the committee rise and go to Portage.\n\nThe council adjourned about three o'clock.\n\nMr. Hayter Reid's bill has been moved on the committee. The report of the naval committee has been received, and two others added which provide that \"other evidence than that of the mother as to the defendant being the father of the child shall be necessary,\" and \"no action shall be brought after the expiration of six months from the date of the birth of the child.\" The third reading has been deferred.\n\nMr. Hughes will ask the council to consider a resolution asking the Government to erect a bridge across the South Saskatchewan near Saskatoon, for the benefit of the Long Branch and Saskatchewan Railway. It is said this will all that is needed to assure the extension of the railway.\n\nMr. Cunningham intends moving for a committee to consider all questions affecting the Metis of the Northwest and report therein.\n\nANNUAL SCHOOL MEETING\n\nThe annual meeting of the ratepayers of Prince Albert Protestant Public School District No. 10, was held in the School House on Tuesday, November 7th, at 1 p.m., Mr. J. R. McPail in the chair.\n\nThe reports of the Sec., Treas., Teacher and Trustees were read at the meeting, and were well received by those present, who expressed general satisfaction at the manner in which the affairs of the district have been conducted. A letter from the auditor, Mr. Thos. E. Parker, certifying to the correctness of the accounts, was also read.\n\nIt was then moved by Mr. J. Courtney, seconded by Mr. G. Love, that the reports as read be adopted. Carried unanimously.\n\nMoved by Mr. Love, seconded by Mr. Courtney, that a vote of thanks be tendered the retiring trustees for their faithful services over the management of the affairs of the district for the past year, and that a report of this meeting, together with the vote already read, be sent to the Treas. for publication.\n\nCarried.\n\nThe meeting then adjourned,\n\nTRUSTEES' REPORT.\n\nBalance on hand Oct. 1st, 1886. $250.00 Cash received during the year. $900.00 Amount of school fees. $250.00 Balance on hand at close of school year. $400.00 Amount due the district. $250.00 Total. $650.00\n\nEXPENSES.\n\nNumber of days school was kept open succeeding the last annual meeting, 190; total number of children attending school, 25; average attendance, 14; Religious faith—Protestant, 12; Roman Catholic, 5. Average attendance for the year, 13.\n\nCondition of education taught in the school are Reading, Writing, Arithmetic, Grammar and Geography, 14 children beginning Reading, 28 Writing, Arithmetic, 10 Grammar, 10 Latin and Geography.\n\nThe report of the school board on the condition of the school buildings, and the statement of the school expenses, are as follows:\n\nReading, Writing, Arithmetic, excellent results; Grammar and Geography, very good; children attending school regularly and school furniture in good order; register carefully and neatly kept; school time tabularly arranged.\n\nREV. DR. JARDINE.\n\nFrom the Knoxville Evening Record of October 28th, we quote the following:\n\n\"According to reports from the committee of the Evangelical Alliance, held on Saturday, the 23rd inst., the following statement was passed:\n\n'To the Reverend People of Prince Albert, N. W. T.\n\n\"It is known that a meeting of the executive committee of the Evangelical Alliance, holding its annual session at the Rev. G. A. Jameson, pastor of the Congregational church, and seconded by the Rev. Hugh M. F. Smith (pastor of St. John's Presbyterian Church), the executive committee desires to put on record the high esteem in which it holds the Reverend Dr. Jardine, and the faithful work in the community.\n\n\"That the members of the committee view his departure from Prince Albert as a great loss, and that they desire to extend their personal sympathy and best wishes to him. The members of the committee most heartily commend him to the protection and guidance of Almighty God, and to the Heavenly King of kings, and Prince Albert, in the hope that the offices he has filled will be filled by one equally fitted to fill them.\"\n\nREVIEW OF THE NEW BOOKS.\n\nBuffalo Hall! IMMENSE WINTERSTOCK NOW OPEN.\n\nLadies, your special attention is called to our Elegant Assortment of Dress Goods and Ladies' Furnishings, Corsets, Hoops, Skirts, Gloves, Grey Flannel, Waistcoats, Caps, Mitts, and Children's Wooden Goods, etc., etc.\n\nMen, your attention is called to our Full Lines of Ready-made Clothing and Ladies' Furnishings, Caps, Mitts, Gloves, Moccasins, etc., etc.\n\nTo the public we now offer a complete assortment of Fancy and Staple Groceries.\n\nThis complete stock of Dry Goods, Clothing and Groceries is now being offered at Innovation Prices.\n\nBETTS & Gwynne.\n\nNEW GOODS ARRIVING\n\nHardware, Stoves and Groceries\n\nIn great variety and at PRICES that will be found the LOWEST in town.\n\nACME CLUB SKATE\n\nThe best and most convenient Skate made at Reasonable Prices.\n\nJ. R. McPhail.\n\nAT Lowest Prices,\n\nBuilding Hardware, Locks, Hinges, Glass, Putty, Paints and Oil.\n\nPOWDER, SHOT AND LOADED SHELLS.\n\nN. B.—A large Supply best American Coalton\n\nAT J. L. Johnson & Co.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of-\n\nBEDROOM AND PARLOR SUITES, Sideboards, Cupboards, Bureaus, Washstands, Sofas, Easy Chairs, Bedsteads, Mattresses, Co's, Cradles, And all kinds of Chairs, etc., which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nFurniture Repaired on Short Notice.\n\nSalesroom, First Door East of Bank.\n\nW. B. Goodfellow.\n\nNEW GOODS\n\nAT MISS MACK & Co.\n\nFirst Door East Telegraph Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886111201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3110, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2121, 2], [2121, 4364, 3], [4364, 12505, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]