[{"id": "f1a74a268dd3c288c65a740083a916b1b1ded5e7", "text": "CHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nWe have received a lengthy communication signed \"The Apophatic Chimaera,\" against the granting of a licence for a brewery, which he respectfully requests from publication, saying it in such case we shall not fail to give fair play. We will do so, and hope each.\n\nA dance will be held in St. Paul's Church Hall next Saturday evening, commencing at nine. Rev. Caspar Halifax, minister.\n\nBANKING HOUSE\n\nMacarthur & Knowles,\n\nPrince Albert, N.W.T.\n\nTransact a General Banking Business.\n\nReceived Deposits for Accrued Interest Accumulated at all points in the Dominion.\n\nGovernment Adjustments and Payments.\n\nBank National Bank of Canada.\n\nJohn B. Dunlop, M.D.,\n\nLL.D., Surviving Secretary.\n\nRoyal College of Surgeons,\n\nand Lectures Professor of the\n\nKing's and Queen's College of Physicians, Ireland.\n\nProposals can be made at the Treasurer's Office, at the present time.\n\nMILLER & ELLIOT.\n\nGeorge Miller, Solicitors, etc.\n\nW. H. GUNN, C.J.\n\nBarrister. Solicitor, Speaker.\n\nLocally sought for by many interested persons. Horse about fifteen years old. Phone, Patent Office near Alamo British & Colonial Universal Company.\n\nPRINCE ALBERT.\n\nWilliam V. Macarthur,\n\nII. S.W.\n\nBranch Manager.\n\nPROFESSIONAL ADVERTISERS.\n\nL. S. James, Attorney, etc.\n\n* SHUTTERS' AJDUCT.\n\nJ. Lockett Reid, D.L.S., and partners,\n\nhave been away for some time past visiting Lapin, U.S.A., touring notable localities—sections, quarters, streets, etc., but that passage whether for business or pleasure, I may say he is lonely when alongside. We have drilled into his head that which was prominent would be lost without a prompt keep beneath, and say this site—like the ages—grows tender once planted.\n\nWe have heard of no tidings that could possibly make for blush. If enterprise can make as the Dominion Land Office can do—make it snow by storms of local snow which never find their way to the Southerners—we must expect volume from climate. Proposals are accepted.\n\nAMBULANCE CHAIR.\n\nP. Liston Bud, Dr., Newell E. Metcalfe, Messrs. McNaughtons and Mr. Larry Murray, has presented to Prince Albert Dispensary six up-to-date ambulance chairs. May God bless those who donated.\n\nStorage at Phoebe Hills, Langopp, will be completed by locker in three weeks. Many of those who live there want results published.\n\nSHUTTLE'S ADJUNCT.\n\nH. Allport & Son, manufacturers, are anxious.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW. PRINCE ALBERT, N.W.T., WEDNESDAY, SEPTEMBER 19, 1883.\n\nNavigation operatives of two thousand operating riders are engaged on the river three-fourths of the company's effects have been vessel by neap tide and so to nearly all those engagements which are Answer. Of course not. The best does not get leeching with the Company. When vessel Captain P. Murray was towing to the extreme boundary of water in Clearwater, many vessels would find them asrstance not not make for traction behind it. They were forced to tie up to the bank. But the men they are in hopes of doing much better. Murray has brought in the boat again by the South Branch, which has carried at least two passengers in across the river, but as high as Highwood Lake. The reputers are the thousands that have joined rising during the spring and rapidly climb for an early start in setting improvements.\n\nAn important business has been closed for a government called attention to the necessity for the formation of an agricultural community. District No. 27, where this note is written, recognizes that much of the population are engaged in agriculture. Such should be encouraged, and similar plans will be adopted in other districts at future meetings. The Department of Agriculture, through the Billi, the Minister of Public Instruction of Lunanyg, \"representing consultations\" upon the subject, have increased the demand. Something similar to that will follow for this Territory, when the opportunity is opened upon it—the people who are interested in farming should take advantage of same opportunity. The reasonable rates that the farmers will get for their crops will largely increase their returns.\n\nThe wind itself.\n\nThe town has existed two stories chimed! (With the exception of a description from nine miles off) which will make us remember what area if we could see anything of the North-West. We regret that the grass grows). We must play some no more in the absence from the city of Mr. R. Soule, who would be wondering if the far-off neighborhood of Edmonton. Ranches Question? The minds of the most humble readers of our paper who could enter our midst.\n\nThe wood yard.\n\nMr. J. Becker Crolly, M.O.S.D.; Mr. and Mrs. Alexander, are preparing for their move.\n\nDEVELOPMENT IN THE NORTH-WEST.\n\nA brilliant display of northern lights near Dufferin has been obtained during the recent weeks of July. The large activity on the District will be islands from offices at Edmonton. A good number of those now shut up and ready for service will be opened under the local Board's orders and moved along the roads. We advise a visit for inspection of the immediate vicinity.\n\nBRITISH SETTLEMENTS.\n\nThe Marquis of Chess is heavily loaded now on the east side of the mountain,б\n\nMr. E. H. Brown is erecting a frame house on the McGogger estate for Mr. McGogger, former Prince Albert.\n\nThe new Popula North-Western Provincial Council.\n\nFIRE DEPARTMENT.\n\nTwo new Fire Department Appointments筆\n\nLos Angeles County, L.W.G.\n\nThe Prince Albert Times and Saskatchewan Review...\n\nPrince Albert News Bulletin...\nTHE PRINCE ALBERT TIMES\nWEDNESDAY, SEPTEMBER 19, 1883.\n\nOUR WANTS AND OUR GRIEVANCES\n\nIt is now more than six months since we first called the attention of the Dominion Government to some of the prominent requirements of this portion of the Province. The time has passed and there is no prospect of an immediate settlement. The memorial which had been prepared by two of our prominent residents at the special request of the Premier, and presented to the Government a year ago last spring, which would have satisfied the present requirements of this district, has been allowed to fall into desuetude. Since then another memorial—this time addressed to the House of Commons—has been prepared and presented by the inhabitants on the same subject, which was presented to Parliament by a prominent supporter of the Government in the House. In the meantime, however, the question has been raised again, and a new petition has been presented by Mr. Blair, the leader of the Opposition. It is now time to inquire what has been the result? Literally nothing—except the expenditure of thousands of dollars. The Government has not yet answered the petition, nor has any satisfactory reply been given to the many grievances which have been so long laboring under. Since then another memorial—this time addressed to the House of Commons—has been prepared and presented by the inhabitants on the same subject, which was presented to Parliament by a prominent supporter of the Government in the House. In the meantime, however, the question has been raised again, and a new petition has been presented by Mr. Blair, the leader of the Opposition. It is now time to inquire what has been the result? Literally nothing—except the expenditure of thousands of dollars. The Government has not yet answered the petition, nor has any satisfactory reply been given to the many grievances which have been so long laboring under.\n\nPONY FOR SALE.\n\nA Native Pony for sale (mare in foal). Will be sold cheap. Apply to The Times Office.\n\nUNITED STATES Life Insurance Co'y,\nthe City of New York.\n\nEstablished 1869.\n\nDeposit with Soundest Government.\n\nOffice, Bird Block, 433 Main St.\n\nG. H. Maguire, Provincial Manager.\n\nJohn F. Betts, Agent.\n\nLorraine Patrick, D.L.S.\n\nTimber Limits Surveyed and all kinds of surveying done on shortest possible notice.\n\nLorraine Patrick, D.L.S.\n\nPrince Albert, Saskatchewan.\n\nGeneral Merchants.\n\nPrince Albert.\n\nSaskatchewan.\n\nWholesale and Retail.\nSermon to Young Men\n\nBy Rev. James Simeonright.\n\nOn Tuesday morning, 10th of September,\n\nI write unto you, young men, because you are weak in the flesh, lest the devil should tempt you.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\n\nThere is not a more interesting object of contemplation than the young man entering this life, full of hope, ambition, and enthusiasm, yet exposed to the wicked one. I Tim. iv. xv.\nPROSPECTUS OF THE Prince Albert Directory AND BUSINESS GUIDE.\n\nIt is proposed to issue a Business Directory for the Town of Prince Albert, and the County of Nipissing, containing which will contain the advertisements of each business establishment, to be in accordance with the rules and a descriptive list of streets.\n\nThe press will contain a history of Prince Albert, its present condition, future prospects, together with a statement of the year's crops, as far as they can be ascertained for the District of Toronto, and also a statement of the number of bushels per acre, increase over last year's crop, population of District, and other useful information, written by a well known journalist.\n\nAbout 500 or more copies will be published (according to the response received) next week, and distributed throughout the Dominion and the Mother Country.\n\nIt is expected that by this means, benefit will result, not only to each individual advertiser and subscriber, but that the whole country will become better informed, and that the best at home and abroad, and healthy emigration encouraged to this country.\n\nPrice of advertisements, while paper is good, will be 25 cents per square inch, with notice of opposite page, and two copies given free.\n\nSHANNON & McLEOD FURNITURE I FURNITURE I G. & C. E. CARTER.\n\nFOR SALE.\n\nLumber Waggon, Mower and Hay Rake. Democrat Waggon, Horse and Single Harness.\n\nALL IN GOOD ORDER.\n\nPORTLAND, TERMINAL. The above in the possession of C. J. Campbell.\n\nNOTICE!\n\nThe following parties having freight at the Forks of the Red River, are requested to inform the same, so that the steamer may be able to make up this season:\n\nT. G. JACKSON.\nRIDER & JOHNSON.\nJ. A. HILL.\nG. G. E. CARTER.\n\nIf any of the above parties wish their goods to be brought up at owner's expense, please apply at the office of Mr. Carter, who will be pleased to oblige.\n\nREGINALD BRATTY.\n\nTO LET.\n\nBrick Store\n\nIn Centre of the Mission.\n\nOne of the Best Business Stands in Town.\n\nApply to\n\nGEORGE T. BROWN.\n\nJ. M. Campbell\n\nHas removed to his old stand, one door west of the Hotel, a large stock of dry goods, clothing, Carriages, Mowers, Scythes, Winches, Plows, etc., etc., all in first-class order.\n\nJust received a valuable collection of heavy and light plow gear consisting of heavy plows, team, single, tobacco, salt, etc., Carriages in Prince Albert.\n\nA large stock of Lumber has just arrived.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nS. J. DONALDSON, Prop.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Belts and Chains, Sheep and Cattle Ropes, Sheep Skins and Tungus for sale.\n\nAnd a variety of other articles generally found in a first-class store.\n\nMore shoes and repairing fare, Machinery specials.\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT.\n\nGRAND CHANCE.\n\nTHE PRINCE ALBERT Planing Mills and Sash & Door Factory FOR SALE.\n\nThe present consists of:\n\n1 Surface Planer,\n1 Matche,\n1 Tenant Machine,\n1 Stickler,\n2 Saws,\n1 Mortice Machine,\n1 Turning Lathe,\n1 Jig Saw, etc.\n\nAll run by steam power.\n\nALSO\n\n1 20-horse Power Engine,\n1 25-horse Power Boiler.\n\nThe Building, 30 x 55 ft.\n\nFour Lots, 30 x 132 ft.\n\nWill be sold separately or with machinery.\n\nThe building is in excellent condition, and suitable for a first-class boarding house. The machinery is in good working order, and will be sold as a unit.\n\nFor further particulars apply to\n\nGOODFELLOW BROS.\n\nFOR SALE\n\nTO LET.\n\nThe large and commodious Store\n\nAt present occupied by Walters & Baker.\n\nAlso a large lot in the rear, flat, suitable for a store, or two rooms adjoining suitable for offices or bedrooms.\n\nTerms reasonable.\n\nPossession in October.\n\nTerms reasonable.\n\nJOHN FLETT.\n\nCarpenter.\n\nPRINCEALBERTBAKERY\n\nWe wish to inform the residents of Prince Albert and surrounding country that we have moved our establishment and are prepared to furnish the public with all kinds of Confectionery, Cakes and Bread.\n\nNow doing business in connection.\n\nBaker, Table Board, R. J. Baker, bakers.\n\nOrder now for your next order.\n\nWHITELOCK & M'IVOR.\n\nNOTICE!\n\nBeing my temporary absence from Prince Albert.\n\nH. J. MONTGOMERY\n\nWill be away about. Parties requiring Brick, Cordwood, Etc., can arrange with him for the same.\n\nE. WALDO.\n\nPRINCE ALBERT, Sept. 4, 1883.\n\nO. E. HUGHES & CO.,\n\nFARMERS ATTENTION!\n\nGeneral Merchants\n\nAND\n\nIndian Traders,\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\nPRINCE ALBERT, N.W.T.\nTHE NORTH WEST COUNCIL\n\nPetitions Presented Other Business.\n\nSaskatoon, Aug. 30. The following petitions were presented:\n\nBy Mr. Brown—Similar petition regarding the sale of liquor.\n\nBy Mr. White—Similar petition regarding the sale of liquor.\n\nThe above were referred to Standing Committee on Municipal Affairs.\n\nBy Mr. White—Petition of members of the legal profession praying for an ordinance regulating their profession.\n\nReport of Special Committee on the petition relating to the sale of ale and porter in the Territories. Minority report made objections to such step.\n\nBill to enable the Board of Health of Medicine Hat to purchase land presented by Mr. Macdonald, read first time.\n\nA bill to prevent the sale of stolen horses, read a second time.\n\nMr. Macdonald obtained leave to bring in a bill to amend the revenue respecting the sale of beer and ale.\n\nHis Honor presented a bill respecting infectious diseases of horses and cattle.\n\nRead a second time.\n\nThe Council resolved itself into committees of the whole to report respecting the matters mentioned in the bills.\n\nMr. Macdonald supported the prayer of the petitioners, arguing that to have light beer would be a great benefit to the temperance movement. At present the very strongest whisky was brought in, and even poorer classes consume while the freight kept other classes away.\n\nMr. Oliver made a speech against the petition.\n\nCol. MacLeod thought the majority of the people were in favor of keeping things as they now stand.\n\nMr. Campbell also supported the petition on the ground that good wholesome beer would be a blessing to the people.\n\nCol. Richardson also spoke against the petition.\n\nMr. Ross advocated the petition. They said whisky brought in in every shape, and the Mounted Police were incapable of keeping it out, and could not keep it out, and therefore it was better to allow light beers to be manufactured.\n\nProgress was reported.\n\nMessrs. John Stewart and W. Naylor, proprietors of the St. Andrew's Society in this town.\n\nA stable belonging to Mr. Eliot was destroyed by fire this afternoon. Cause, electricity and heat.\n\nIn another saloon, under the heading \"Personal,\" will be seen the notice of the departure of Messrs. Kennedy and O'Donnell. We understand that the above named gentlemen do not start till tomorrow morning.\n\nJ. C. Macdonald has removed to his new store, one door above Bett & Co., where he will continue the business of boots and shoes last week, which will be continued at the same bargain in ladies' and other garters.\n\nNOTICE.\n\nI have been informed by my friends and the police that the premises occupied by me at present in the Westminister Hotel Hall, No. 12, Princess Street, will be vacated by me on or about September 15th, and will continue the business elsewhere.\n\nThinking it would be for your own personal safety, I advise you to make your purchases in some other establishment.\n\nTHOMAS O. DAVIS.\n\nN.B. All accounts due me forwarded immediately to the hands of Mr. Davis.\n\nSOCIAL\n\nA social will be held in Prince Province Hotel, Prince Albert, on Saturday evening, 7th inst.\n\nOn Saturday next, 22nd inst., at 8 p.m., when addresses will be presented by the Hon. Mr. Justice Murray, followed by a musical entertainment.\n\nThe proceeds of other donations will be given to the Ladies' Musical Association.\n\nTHOMAS POWERS.\n\nHugh J. Montgomery, Real Estate Agent.\n\nAUCTIONEER, ETC.\n\nMoney invested. Patents approved.\n\nTown Lots for Sale.\n\nPRINCE ALBERT, N.W.T.\n\nJ. L. JOHNSON & CO.\n\nHAVE A FULL STOCK\n\nPowder,\nShot,\nGuns,\nHarvest Tools,\nBuilding Hardware,\nPlaster and\nPlastering Hair.\n\nHORSE SHOE STORE,\nCAMPBELL'S BLOCK.\n\nSelling Off!\nSelling Off!\n\nNow is Your Time to Get Good Bargains\n\nCall and See, as We Must Close Out\n\nThe Stock this Month for Cash.\n\nFarmers' Produce only taken in exchange for Goods.\n\nTHOMAS O. DAVIS.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\nBill Heads,\nEnvelopes,\nCirculars,\nDodgers,\nBusiness Cards,\nLegal Printing,\nPamphlets,\nEtc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nPRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\nMEDICAL HALL\n\nT. E. JACKSON.\n\nBUFFALO HALL\n\nTHE LEADING\n\nDry Goods, Clothing and Grocery House\n\nOF PRINCE ALBERT.\n\nFor Thirty Days Only!\n\nDRY GOODS\n\nAND CLOTHING\n\nAt Cost for Cash.\n\nBETTS & Gwynne.\n\nCITY AUCTION MART\n\nMARKLEY & ORR,\n\nReal Estate and General Agents\n\nThe Celebrated New York Singer Sewing Machines!\n\nKnox & Barker, Canada Life Assurance\n\nCarpenters and Builders,\n\nJob Work Promptly Attended To\n\nASH & ROBBINS.\n\nConsumption\n\nPositively Curled.\n\nWALTERS\n\nAND\n\nBAKER,\n\nGeneral Merchants,\n\nPrince Albert, Batche's\n\nTRY\n\nHugh McDougall's Bread!\n\nHugh McDougall\n\nFirst End Bakery\n\nNOTICE.\n\nTo Merchants and Others.\n\nA. R. Burns\n\nPRINCE ALBERT\n\nPlumbing Mills and\n\nSash and Door Factory\n\nGOODFELLOW BROS., PROP'S.\n\nPrince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nSpring and Summer Goods\n\nJUST RECEIVED BY EXPRESS.\n\nMillinery,\n\nLadies' and\n\nChildren's Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO,\n\nCampbell's Block\n\nRiver Street.\n\nPrince Albert, N.W.T.\n\nJ. SINCLAIR.\n\nUNDERCLOTHING\n\nSoft and Hard Felt Hats.\n\nGive me a call.\n\nJ. Sinclair.\n\nMORAY & CALDWELL, Bankers\n\nMain Street, Prince Albert, N.W.T.\n\nPRINCE ALBERT\n\nTO THE LADIES.\n\nNEW\n\nSpring and Summer Goods\n\nJUST RECEIVED BY EXPRESS.\n\nMillinery,\n\nLadies' and\n\nChildren's Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO,\n\nCampbell's Block\n\nRiver Street.\n\nPrince Albert, N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883091901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 5176, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5509, 1], [5509, 7963, 2], [7963, 9969, 3], [9969, 14511, 4], [14511, 19647, 5], [19647, 21126, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]