[{"id": "2918bb0c39009e1e7100757a546e68485745a343", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nTERMS: $2.50 per annum in advance.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\nH. a.m.—His Lordship the Bishop.\n7 a.m.—Mr. Wright.\nThe Mission Chapel.\nH. a.m.—Rev. A. H. Wright.\n3 p.m.—Sunday School.\n7 p.m.—His Lordship the Bishop.\n\nSt. Paul's.\n3 p.m.—Rev. Canon Field, B.D.\n\nSt. John's.\n9 a.m.—Rev. Canon Field, B.D.\n\nSt. Luke's.\n9 a.m.—Rev. Canon Field, B.D.\n\nSt. James'.\n9 a.m.—Rev. Canon Field, B.D.\n\nSt. Anne's, R. Catholic.\n6 p.m.—Rev. Mr. Andrews.\n\nSt. Paul's (Presbyterian).\n9 a.m.—Rev. Mr. Williams.\n\nFRIDAY, MARCH 26, 1886.\n\nThe Winnipeg Morning News says: Hon. Mr. White was interviewed yesterday by gentlemen interested in the Hudson's Bay Railway scheme with reference to certain representations made in the press prior to the proposed vote. The Minister is said to have given a most evocable reply, and it is expected that the wishes of the department will be met. This does not seem to accord with the Free Press' statement that the Government is hostile to the Hudson's Bay project, and that Mr. White is at all times ready to do anything in his power against the interests of this country.\n\nIt is intelligence here stated that Mr. Royal has received a letter from French capitalists making enquiries for the fullest particulars of the Hudson's Bay Railway enterprise. The statement is that the Frenchmen will require the necessary capital will come at once subscribed in France. The president and directors of the company, as well as the people of this country, are to be assured that the money for the construction of the road is obtainable, but the sooner it is coming the better. The time of the year selected for the commencement, named 4th of August, is said to probably be a calm, to allow preparing foreign emigration.\n\nCANADIAN MANUFACTURES.\n\nThe Montreal Herald also discusses \"our manufactures.\" It is stated that Canada has made strides in the direction of manufacturing. Canadian industry may seem to many insignificant; its proportions may, in fact, be small; but any proposition to stop it would be met with an expression of popular indignation. It has cost, not the promoters only, but the people of Canada generally, something, a good deal, to build up Canadian manufactures, and now that they have them, the people generally feel a pride in their progress and in the advance made towards perfection, and will not willingly let even the crippled members of the family be brought down.\n\nAt the present time, considerable interest is being manifested in Canadian exhibits which are leaving for London, and published descriptions of them are attracting considerable attention. The effect upon the view of a piece of these exhibits is very striking, and the effect upon Englishmen, who will look upon the whole display under one roof, will, no doubt, be very great. What Canadian goods are likely to find an important market in England, or that Englishmen for a century to come will be convinced that the idea of Canada becoming Englishmen, free from foreign fields. We do not expect that even a glimmering of such a prospect will present itself to the average English mind. But much will be accomplished if Canada can convince Englishmen, however, that Canada is a fully civilized country; that the skilled industries and arts of the world are in Canada; that in manufacturing ability we are equal to any country of the same population; and that in coming to Canada Englishmen will not be coming to a country wholly devoted to agriculture and stock raising, but to a country where there are great interests which they are to fostered and encouraged when they need it, but it is also a great thing to have within ourselves the means of rendering ourselves self-supporting. If we cannot manufacture produce of other countries, especially in what may be called the essential manufactures.\n\nNORTH WEST PRODUCTS.\n\nThe C.P.R. exhibition at the Richmond Street depot yesterday drew a large crowd of visitors, who took great interest in carefully surveying the various productive exhibits of our great Northwest. The native grasses and the cereals are represented by specimens of wheat, rye, oats, and barley, grown on the plains, on the sides of the car. The five tree species of the native grasses are something prodigious, and could only attain such a growth in the open forest soil. One wild variety of grass was found to grow three feet in width and six feet high. Wind grew so luxuriantly that they cover the ground in one solid mass. It would be imagined from the appearance of the grass that this native grass that has an extensive range must be a cheap commodity in the Northwest. Our cereals, no less than the grasses, are immense. There are specimens of Russian wheat, which run high, together with the standard is only 44 bushels to the acre. The industrial progress may be felt for specimens of sawmills and locomotives. Specimens of lumber of the best quality were displayed in Paris, and will be shown at the exhibition in London in the course of a few days. It is to be hoped that a great change has come over all the red western folks, which are the inhabitants of the country, in the prominent varieties grown in the prairies, which are now being sent to the Northwest. It is useless to go into how far they have progressed, as the samples are too good in the world, and carried off the first medals at the Amsterdam exhibition last year. A glance at the soil wherein the P.R. exhibit was grown, which are shown in the glass cases in the different parts of the car—will convince anyone of their fertility, and that they will support only the most luxuriant vegetation. The soil shown is very deep, dark, and heavy, very fertile. It is in general a deep black argillaceous morain or loam, resting on a tenacious clay subsoil, and is so rich that it does not require the use of manure for crops. The other grain, such as peas and beans, showed to advantage, as did also flax and hemp. The seventy kinds of potatoes were mammoths, and would naturally be raised from such soil. One sample of Rose yielded two hundred pounds of potatoes by the Rev. Leo Guetz on new prairie soil with no extra labor. Gigantic pumpkins onions and kohlrabi, wild and garden fruits showed that all the vegetables which are grown in a more southern latitude can be grown in the Northwest. The Indian corn exhibit was grown by the Sisters of Charity at St. Boniface.\n\nThe car, which was under the control of Messrs. Bailey and Bedford, was taken to Clinton, on the London, Huron and Bruce train, and the exhibits will be exhibited there today. Mr. Bailey estimates that between 4,500 and 5,000 people viewed the products while the car was in London, and says the prospects of emigration to the North West this year are very promising.\n\nWAR DECLARATION.\n\nW. C. RAMSAY\n\nWould respectfully inform his friends and the public generally that he has closed his Harness and Blacksmith business, and has removed same to River Street, near J. L. Johnson's. He has been engaged in the civil war against the present high prices charged for harnessing and general blacksmithing. A trial is respectfully advised.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTECUMSEH.\n\nA new drama entitled \"Tecumseh\" has just been published by our talented fellow townsmen Mr. Charles Mair. Through his efforts we have the honor to record one of the advanced steps in this work.\n\n\"Tecumseh\" is a work of great literary merit and well deserves the praise showered upon it by the Canadian press. As it is only yet in the hands of the general public, we cannot do more than briefly describe the course of the drama.\n\nThe chief character in Tecumseh is the great Shawnee chief who in the war of 1812 linked his fortunes with the British and fought them now against the Americans. His name is not imaginary. Tecumseh was actually a chief who led his band to victory in many a fight and was a wise and far seeing statesman, of high character and great abilities. He was listened to with respect by the British commanders. He was also a humane and kindhearted man, loved by his friends and respected by his enemies.\n\nThe first scene opens on the banks of the Tippecanoe river, where Tecumseh, when a young man, had visited the Indians. It is a mission on a mission to the other tribes endeavoring to unite them against their common enemy, the white man. Tecumseh visits his brother, summoned the \"Prophet,\" a cruel and crafty man, whose hatred of the whites is intense. Tecumseh, in attempting to encompass his overthrow, and obtain for himself the chiefship of the tribe, so that he may work out his own designs against the whites. Before his schemes are matured, Tecumseh arrives back with his followers, who have been defeated in battle.\n\nHe immediately takes the Prophet to account for his actions during the battle, and learns that an old bugle player had captured and would have put to death him for the interference of Lena Tecumseh, who falls in love with Tecumseh and profits him until Tecumseh's arrival. The romance of the latter is developed, and Tecumseh seems to loan whom he wishes to marry in spite of the laws of the tribe that require marriages to be arranged.\n\nIn the opening part of the second act, Tecumseh, who had been summoned by General Harrison the President of the United States, to meet him at Vincennes, finds his grievances, having a child of his own, too much to go and meet the Americans. They take with them four hundred warriors, including Tecumseh, who is convinced representing a wrong. The act closes with a vivid account of Tecumseh's interview with Harrison. As this interview actually took place, Tecumseh could not have been actually used by him, but was used for dramatic interest. It is here that some of the finest passages in the poem are to be heard. Tecumseh shows himself in a clear and forcible manner.\n\nThe third act gives an account of Tecumseh's meeting with the Prophet, his attempt to get his tribe to make an attack upon the American forces. General Harrison, however, refuses to allow Tecumseh to join his forces. Tecumseh returns back to find his tribe broken and scattered and all his plans frustrated. He returns to his people, the remnants of his tribe and makes his forces with those of Shawnee Brock, the chief of the Shawnee tribe.\n\nIn the fourth act the political situation of 1812 is described, and Tecumseh's attempt to gain the support of the British is narrated. Next to Tecumseh, Brock is the last and most natural character in this work. The fifth act describes the defeat by General Brock of the American commander, who, with his whole army, is killed in battle.\n\nThe sixth act gives an account of the ensuing events of the year 1813. General Brock is assassinated and Tecumseh's attempt to rally his tribe is frustrated. The depth of the grief felt is shown in the death of Tecumseh's wife, who is mourned by her tribe. In the seventh act, Tecumseh's death is narrated. The play ends with the death of Tecumseh's wife, who is mourned by her tribe.\n\nTHE PRINCE ALBERT TIMES\n\nORGAN AND PIANO CO.\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all Inscriptions done neatly, quickly and cheaply!\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3rd St., Prince Albert, Sask\nIn the House today Mr. Watson presented the petition of Thomas C. Sandilands and others of Winnipeg, asking an extension of the Prairie and Rainy River Railway Company.\n\nBowell and others of Thompson, petitioned for an extension of the railway from Medicine Hat to the coal fields on the South Saskatchewan River, to be called the Medicine Hat Railway and Coal Company.\n\nSir Hector Langevin presented a report containing a report of the meeting held at Levis. The report represents that holding peculiar views as to religion and morality, Mr. Bowell was promptly sent and accountable, being capable of distinguishing right from wrong.\n\nIt is stated that when the Finance Minister makes his Budget speech he will propose increased duties on tobacco and spirits. There will be an addition of four cents per pound in duty upon tobacco manufactured in Canada, and ten cents per dollar per thousand upon home manufactured cigars. It is also reported that a tax of five cents per pound will be imposed on tea, and two cents per pound on coffee, and that Customs and Excise duties on wine and spirits of all kinds will be increased.\n\nA return brought down yesterday, in answer to a question by Mr. Landrkin, shows that the contract for carrying the mails between Calgary and Fort Macleod was awarded to Mr. Randle, who has paid for two years $2,500 a year, although there were three lower tenders, one at $2,100, one at $1,750, and another at $1,600. Mr. Randle has $400 a year on this job, which sum goes to the already heavily subsidized railway family of Mr. Randle.\n\nMr. Blake will ask how many homesteads have been entered within the C. P. R. district, and what the difference between the first and fifth meridians.\n\nMr. Landrkin will ask what tax per ton will be charged on the land of the Northwest who owns for his own use over 50 tons of hay on Government land in the district, and what the value of the acres $100 a year on this job, which sum goes to the already heavily subsidized railway family of Mr. Randle.\n\nMr. Royal will ask whether the Metis of the Lake of the Woods, Fort Alexander and of Beheira River have the same rights as those of the province of Mani toba, and North West Territories, or if they have not whether the Government intends to listen to their complaints.\n\nThey were especially requested to make a statement regarding the charges that white settlers at Prince Albert were guilty of fomenting the rebellion, that Mr. Smith was a chief point in aid of the Government.\n\nSir John is still confined to his bed, Archbishop Taché is here.\n\nALONE ON THE OCEAN.\n\nStartling Adventure of An Old Lady.\n\nIntelligence of a peculiar occurrence comes from Shetland. While a small trading smack was on its voyage from Lerwick to Lerwick, the smack was knocked overboard, and the other two members of the crew immediately have disappeared. The only boat was then proceeded to the rescue of the old lady, leaving alone on the smack an old woman aged seventy-three. The men were unsuccessful in their attempt to save the skipper, but when they put ashore to regain the smack, they found to their astonishment that the old lady had tried to overturn the smack, and they pulled the boat away, so that they reached the shore without difficulty.\n\nThe old lady, who was named Mrs. Wilson, was taken to the hospital, where she was treated and nursed, and has since been examined by Messrs. Bully and Spindler, who found her in good health and well and complains of pains in her chest and in her swollen legs. The physician said she could not have been thrown any fear, and that she will be able to start on a homeward journey in a few days.\n\nWhen the news of the accident was heard here a few days ago, but nothing else, a navigator at Lerwick was asked to state to say it was impossible that such a vessel could founder in the winter gales, but it seems like the direct Providence the pious old lady invoked.\n\nAn enthusiastic old Highland lady had a pet case so much attached to him that it was to follow him in his daily walks round his estate. One day he came across a labourer digging a ditch. The man said he was working for the owner and wished to eject a large stone that interfered his progress. The lady, not wishing to fail in her duty, said \"Come and stand around the stone.\" The man heard it not, but certainly went on with his work. When the owner came along the same road, the lady still found the man picking away at the stone. Angry at the delay, she cried out \"Come,\" and he shouted to him: \"Ye stupid ass, didn't I tell ye to look round about the place?\" \"I'm doing it,\" said the man, \"look at it!\" The woman ceased her labours, and leaning on his pick, quietly retorted \"Ye cannae see, can ye awa hame an tak yer work?\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886032601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 3946, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7732, 2], [7732, 11957, 3], [11957, 16699, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]