[{"id": "0bc53906c0a30d3e8e878d997624a395700a54f7", "text": "CARNIVAL\n\nThe members of the Argyle Curling and Skating Rink held their first carnival on Friday last evening. Everything was arranged in a most becoming manner. The band was there and played several excellent pieces during the evening. The supper was excellent, both in quality and quantity. The entertainment was many and some of them hilarious, and there was plenty of pleasure.\n\nThe judges Mr. H. Smith, Dr. Bain and Capt. Perry—had their hands full, however, as the teams were very strong. The winners were the Argyle Ladies' costume—Miss Brittain, a Flower Girl, Whisk Holder—Mrs. Dux, Head Girl—Miss MacKenzie, and Shell: Miss Maclean, Swiss Peasant Girl, Inlandian. Gent's costume—Mr. Murray, White Star, Red Rover, Cocktail, Red White and Blue, and Flag of Ceylon. Mrs. Mclean, Beachcomber, Lady Captain Mitis, Miss A. Murray, Highland Riding Hood, Locket—Miss A. Murray, Red Coats, Miss A. Murray, Tray Table—Miss Murray, Blue Star, Navy, Negative—Miss Murray, Indian Boy, Knife—Master Bradbeer, Indian Boy, Dressing Case—A. Holmes, Negro Mule, Meccano Pipe—R. Speare, Small Handkerchief—Miss Murray, Many others were included, but as they failed to bring their cards we were unable to secure them.\n\nFlannel and all Woolen Goods at G. Campbell's\n\nIf you want the best Hat in Town go to T. O. Davis.\n\nT. O. Davis will move into his new store next the first of April. Look out for good bargains the balance of this month.\n\nREPLY.\n\nThe following is a reply to an address from Mr. Thor. Swanston by the P. A. Band.\n\nGentlemen, I regret owing to my illness, I was deprived of the pleasure of meeting you on New Year's day, and that hitherto, in the absence of asking you to accept my presentation, I have been obliged to make you the recipient of a number of letters which was singularly gratifying to me as from the moment I have been able to take a slight interest in matters in encouraging your efforts. This interest has been amply repaid by the experiment I made in writing this letter and convinced myself. The marked proficiency to which you have attained is credit not only to yourselves but to the Town of Prince Albert, and I trust by continuous practice and study you will maintain the standard of excellence which has been the cause of so much praise so frequently passed upon you. In thanking you for your kindness and consideration I extend wishes and those of my family for your happiness and prosperity during the ensuing year.\n\nI have the honour to be, gentlemen,\n\nYour obedient servant,\n\nTHOR. SWANSTON.\nPrince Albert, 1st Feb. 1886.\n\nJAMES SINCLAIR\n\nMerchant Tailor.\n\nAND DEALER IN\n\nGENTS' FURNISHINGS\n\nMISS MAGUIRE,\n\nPOST OFFICE BOOK STORE\n\nBooks, Stationery, Fancy Goods, Accordions, Violins, Violin fittings, The latest Eastern Papers and Books sent post paid.\n\nE. J. CANN.\nThe Prince Albert Times\n\nJ. D. Maveety\n\nAt Prince Albert N.W.T.\n\nTerms—$1.50 per month in advance; single copies, 10 cents each.\n\nNo advertisements accepted except those from local advertisers.\n\nAll letters to be addressed to the Proprietor.\n\nThis Paper may be found at every Drug Store, General Store, and News Bureau, on every street, where advertisements are made for it.\n\nNEW YORK\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\n11 a.m.—His Lordship, the Bishop\n7 p.m.—Mt. Maran.\n\nThe Mission Chapel\n11 a.m.—Rev. A. H. Wright.\n2 p.m.—Sunday School.\n\n7 p.m.—His Lordship the Bishop.\n\nSt. Catherines.\n3 p.m.—Rev. Mr. B. D.\n\nSt. Paul's.\n3 p.m.—Rev. Canon Flett, R.D.\n\nSt. Andrew's.\n9.45 a.m.—Rev. E. Matheson.\n\nSt. John's.\n3 p.m.—Rev. E. Matheson.\n\nSt. James'.\n4.45 p.m.—Ven. Archdeacon McKay R.D.\n\nSt. Anne's (Catholic).\n12 noon.—Rev. Mr. Murray.\n\nSt. Paul's (Presbyterian).\n11 a.m. and 6 p.m.—Rev. Mr. McWilliam.\n\nFRIDAY, MARCH 12, 1886.\n\nThe Dominion Parliament was formally opened on Feb. 25th, by Governor General Macdonald, in the presence of an immense concourse of spectators. Unusual interest attaches to the present session, and in addition to the members, there are many visitors in the city.\n\nThe House of Commons dealing largely with West coast matters. The country is congratulated on the fact that peace and order have been restored and now prevail throughout our territories. Intimations have been received from the Government to allow any tendency to panic through the fear of a recurrence of disorders have resolved upon making preliminary arrangements such as the transfer of supplies to the North-West, and to those who desire to settle there, effective protection against disturbances. Demands have been made for a simple and immediate settlement of the question in the North-West. His Excellency announced the intention of the Government to submit such a measure. The expediency of immigration has been discussed, and action has been taken before the Government during the recess, and His Excellency informs Parliament that a measure for that purpose will be introduced by the Government. The House of the North-West has been busy doing nothing to follow a representation of the people in Parliament. A measure for that purpose will be introduced.\n\nOther provisions of the memorial promised to be granted during the session were an immediate settlement of the North-West claims, an act of minister, the Committee to have power to incorporate companies for territorial objects, Halton's Cor-pus Act, Territorial Court of Appeal, appointment of residents to positions of trust, food supplies to police to be purchased there. The Government promised to use its influence to have freight rates on the Pacific, especially on Columbia lumber, reduced. The charge made to settlers for wood was reduced. The opening of settlements of considerable numbers was considered. It is probable a survey of the trail to Peace River will be made. The right to enter pre-emption as second homesteads was rejected, but the Government will probably give returns for extra duties either for forest or tree culture. The demand that odd sections be opened for settlement is not decided. Sir John said the Pacific must pay its way. The question had been delegated to the Government in lieu of the payment to take back the Pacific lands along the track and open them to settlement on the usual conditions. Governor Irvine then spoke favorably on the construction of the Hudson Bay road. The demand that the services of the peace and home guards be recognized in the same manner as elsewhere. The delegates were promised that a special mission to settle outstanding half breed claims would be sent from Winnipeg in a few weeks. A second company composed of men including Mr. Maclean, and authorized to settle rebellious places in payment of settlers and merchants who gave supplies, will be despatched from Ottawa next week.\n\nThe Federal Government is reported to be considering a scheme to place the Mounted Police under the control of the Militia Department. The change would probably meet with much approval from the public, but gratifying to the police themselves. The greatest confidence has been felt in the Militia Department since the late rebellion in the Northwest.\n\nA conference of immigration agents with the Secretary of the Department of Agriculture was held in Ottawa, the object being to secure the passage of new laws, etc., which is gratifying to know that a large immigration is anticipated, and that special plans will be taken in regard to the provision of assisted passages. Artisans and others desirous of trying their fortune in Canada, will have to find their way across the Atlantic as best they can.\n\nThe Ministerial Committee on the question relative to the sale from the North-West Commissary says:—\"It is clearly evident on the whole, that brighter and more prosperous days are directly ahead of the Northwest. The winter of our discontent is passing away, and spring and summer will soon have changed into glorious summer. Not only are substantial grievances being removed, but the substantial wants of the Territory are to be promptly and completely satisfied. The people of the Northwest are most cordially congratulated on their good fortune.\"\n\nQUAPPPELLE\n\nFrom the Vallet.\n\nDr. Hall has returned from his professional trip to the Indian reserves to Major Carter, Assistant Commissioner N.W.M.P., passed through here this way to begin, from the north on Tuesday last.\n\nMessrs. D. H. McMillan & Co., celebrated the opening of the mill, at the Quappelle, Thursday evening by entertainments at the residence of the proprietor of the municipality, at the Queen's Hotel.\n\nCommunications.\n\nSETTLERS AND THE RELIEF QUESTION.\n\nTo the Editor of The Times.\n\nSir,—In The Times of 5th inst., appears a report of a settlers' meeting at St. Catharines, in which the farmers expressed their great protest concerning principally in the fact that they were unnecessarily detained here last spring, rendering impossible the planting of crops.\n\nThat the farmers were detained on account of the small amount of wheat crop is quite true and, from our present point of view, this detention may, in some respects, have been justified.\n\nBut it must be remembered that in the end of April and beginning of May last, the situation was very uncertain as to the state of affairs outside. The farmers were very anxious to get home and join their families, and were made fully aware of the fact, but not seeing their way to accede to their request, the authorities called out various volunteer companies and made a statement, from which it appeared that no attempt to subdue force was known to General Middleton, and that as little of the rebel tactics, and nothing at all of the intentions abroad.\n\nWith certain exceptions however, it was evident that the rebels lay in strong force between the General's position and Prince Albert, and that they would hold the latter place. In all the circumstances, the Colonel considered it would be best to keep his men in camp, and themselves over the country, thereby becoming liable to be cut off in detail in case of necessity, and also in case of rising on this place, and equally wrong to weaken the defense of the town where so many women, children, women and children are stationed.\n\nBut whether rightly or wrongly, Col. Irvine did decide to detain the cavalry until the end of June, as reported, sealing the Government, most of the full responsibility for so doing. At this juncture, when the situation was plainly pointed out to Col. Irvine that the situation rendered it certain there could be little or no farming for the year and that the settlers in camp were likely to be provoked for many of the settlers till the latter part of 1886. The Colonel's promise was broken, and the settlers pretty high figure, grain from those of settlers who had and were willing to sell, and who were obliged to sell their crops to those who were not for some reason as to have any for sale. Some settlers were obliged to sell their grain at a premium and were paid for it, but a larger number had none itself, have had to sell their crops at a premium and now they ask something, he does not see how an insufficient of Col. Irvine's promises.\n\nHad the Government seen fit to allow an early release, there would have been satisfaction for the loss of farming last year owing to the rebellion, it is believed that the settlers would have been able to rely on any amount. Messrs. Mann and Osmundt, the government arbitrators, were appointed to investigate, when here in August. These gentlemen came over, promising to make a representation to the Government, and stated that they did not consider the claims in the scope of their duties, but would have been glad to see the Commission bring their findings to the attention thereof. This Commission has not yet turned up and there has been no satisfaction given.\n\nThere has been no lack of effort to bring the attention of the settlers before the authorities, and it is reported that when General Middleton arrived here from Bathurst, a deputation, appeared at a large meeting of settlers and requested him to investigate and report on the matter fully (see Times report of 3rd June). The times promised to forward the petition to the authorities in Ottawa and no doubt he did so.\n\nAgain, the visit of the Hon. Thomas Whitehouse, the Minister of Agriculture, to the district, and his careful consideration of the matters brought before him and his evident readiness to do what he could for the settlers, as well as all the already producing fruit.\n\nYour columns of Friday last show the proceedings of the meetings, and now that the matter has passed into the able hands of our respected member, these interested interested it will not be allowed to fall into oblivion.\n\nMarch 9th, 1886.\n\nGREAT CLEARING SALE!!\n\nJ. M. Campbell's.\n\nCall and examine before purchasing elsewhere.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\" Over 13 feet extra.\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nNORTH WEST NOTES\n\nCALGARY.\n\nFrom the Herald.\n\nThe thermometer was 57 above zero to-day in the shade.\n\nCol. Hammond returned from Edmonton yesterday.\n\nMr. C. R. Howell, of Winnipeg, arrived here today.\n\nI. O. Baker & Co. are shipping up 600 bags of flour to Victoria via Peace Hills, where they will store them. This is part of the Indians' contract supply.\n\nSigns of spring are numerous. The grass is beginning to grow, the prairie dogs are busy in their burrows, and farmers and prairie fires are racing to the woods.\n\nMr. Geo. A. Stewart, D.L.S., C.E., accompanied by a party of six, including Messrs. Macdonald, B. Sherwood and Ed. Smith, left last Sunday for the survey of the National Park. The work is expected to take up most of the summer.\n\nThe old men of the North West used to congregate the young bloods of Calgary a year and a half ago, has at last been realized. The river has moved across to-day by Bowell Olds. It will be moved to the lots next Mr. Daniel.\n\nThere seems very little doubt that Col. Irvine will promptly fill the commandant's seat in N.W.M. In this event, it is stated that an Imperial officer will command the force. There being no suitable talent in Canada, of course, there is nothing for it but than to get an Imperial officer to teach the police the goose step.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nThursday another all week.\n\nBlizzards lay and crust on the snow.\n\nRoads hard south of the Loup Pine.\n\nA Robertson has sold a yoke of beef to Mr. M. McCaffrey.\n\nX St. Jean's new well has eight feet of good water at a depth of thirty-five feet.\n\nA Rowland and J. Fasel have children suffering from diphtheria. No fatal cases.\n\nRev. J. A. McLachlan and wife and J. A. Mitchell, Indians agent, arrived from Fort Macleod yesterday.\n\nHalf the shares in the proposed company have been subscribed and the remainder of the company will be provided with.\n\nThe W. S. Sutton rallied his organ at the Jasper house on Monday evening last, having a kind word for each one there.\n\nOn Saturday evening last the H. R. Co.'s clerk celebrated their removal to new quarters by the fort by an oyster supper.\n\nThat same evening had his feet cut severely and had to be carried home by toboggan accident on Tuesday evening. He was taken up insensible.\n\nIt is reported that the commission of the scrip commission of last summer has been appointed sole commissioner to settle claims of all sufferers, and that it will begin work as soon as the snow will permit.\n\nA Friday of hot work, as a brother belonging to the St. Albert Mission was crossing Belly's bridge on the Sturgeon River, when the bridge gave way. The creek, the bridge collapsed, killing horses, sheep, load and man suddenly down into the river, a distance of about ten feet. A slight wound in the right leg was the only injury sustained. The bridge is a total wreck.\n\nLETHBRIDGE.\n\nFrom the News.\n\nMr. H. F. Greenwood left yesterday for Medicine Hat. He will be absent two or three days.\n\nConductor Hong started on Wednesday morning for Edmonton on the stage.\n\nWe hope he will have a good time.\n\nMr. O. S. Mann returned from his ranch yesterday. He visited the castle in that vicinity as the sleek and smooth well.\n\nHalf ball were to be a favorite game next with the boys here lately. Nearly every afternoon a game may be seen in progress on the grounds.\n\nPrairie fires are burning both north and west of the town for some days, but the fire department of Tuesday evening extinguished them.\n\nStaff Sergeant Saffery, Miss Saffery and child and Miss Saunders came in on Saturday evening. The former and family went on to M. L. Leslie's Sunday.\n\nThe stage on Wednesday evening last was unable to cross the river at this point owing to the condition of the road.\n\nThe express matter was brought across on a light wagon.\n\nThe musical instruments for the Mr. Lee's band were delivered at the station on Wednesday's train and were sent on to McLeod yesterday. There were sixteen in number and appeared to be in fine order.\n\nOn Sunday evening last, while Mr. Perdue and myself were in the country church we found Mr. Perdue's place and after witnessing the boy in charge of the place to give them grub, they took the boy away and took the best from a quarter hanging up and took it away with them. Mr. Perdue came to town and informed me of what had occurred, and a couple of men were sent out, but nothing was done. Cap. Howes, in the opinion that the boys were hunting lost hounds, and their motions to the boy to come back if he could see any thing. They certainly did not mean any breach of the law or else we would have taken more than they did as no one was on the premises but the small boy.\n\nREGINA.\n\nFrom the Leader.\n\nWeather magnificent.\n\nMr. F. Davis left for the east on Tuesday night.\n\nJohn B. Gough, the eminent temperance lecturer died last week.\n\nMr. J. E. Jackson has severed his connection with the Temperance Colonization Society.\n\nIt is reported that Manitoba has a milling capacity sufficient to turn out 2,500 barrels of flour daily.\n\nIt is also reported that Sir Fred. Middleton will visit the Northwest in March with a flying column of permanent corps.\n\nThe Canadian Pacific Railway have concluded arrangements for steamship connection between Vancouver, B.C., and San Francisco.\n\nJim Moran, an old Regina timer, has returned from a trip to Prince Albert. Jim says he paid $1.75 a mile and rate $1 a bushel. Railroad accommodation is badly needed up north.\n\nThe New Year's Day message from Ottawa that his explanation of the cause of his arrest is satisfactory. The prisoner was released on bail.\n\nThe Qu'Appelle, Long Lake and Saskatchewan railway and steamboat company have decided to build a line from this company's line to Prince Albert to extend from Regina to Wood Mountain, via Prince Albert. Scenic route, the building being estimated at $10,000 a mile, to change the company's name, and far other purposes.\n\nTOWN COUNCIL.\n\nTo the Editor of The Times.\n\nDear Sir,-Kindly allow me to follow up a small, but very truthful item in your last issue regarding the great lack of information displayed by our Town Council, not only by his Worship but the civic board generally.\n\nIn conclusion, the wonderful energy displayed by the council for a month or so after election, their later actions show a decided slackening. I do believe it would be of all advantage to the citizens of this city if the Town Council, too, would consider the welfare of the citizens of this city all the time, as to count for seriously neglecting important public business.\n\nNo doubt for their own protection they secured a for Council room a place so small as to practically prevent the holding of any important meeting, which will in a large measure excuse the fact that very few people know who is to blame for these matters being passed for want of a question. If a newspaper man might be able to give information to satisfy the public, but as yet there is no such paper. The Folks' Guard, 2nd, exactly how many meetings have already been called at which the citizens of this city have been present and absent on these underhanded occasions? Later on, unless they better explain why they are unable to perform what purpose they took the trouble of passing by laws at all, why committees were named and a few other points to which I think electors may freely refer.\n\nGreat praise is due the drivers of the mail stage for their regularity in delivering the mails, notwithstanding the cold and bad state of the roads at times.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAND—ON DROP THE FINEST STOCKS OF\n\nDomestic and Imported Cigars\n\nEVER OFFERED IN PRINCE ALBERT.\n\nFlor de Benitos, Creme de la Creme, Belle Cuba, Henry Clays and Wagner.\n\nALL CHOICE GOODS AND SEASONED.\n\nBETTS & Gwynne.\n\nExamine Our Stock of Xmas Confectionery and Biscuits.\n\nBUY YOUR Hardware,\n\nStoves,\n\nTinware,\n\nCoal Oil,\n\nGroceries,\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nWM. STOBART & CO.,\n\nGeneral Merchants and Indian Traders,\n\nHAVE JUST RECEIVED A LARGE ASSORTMENT OF\n\nPrints, Hats,\n\nCrockery and Groceries,\n\nWhich they will sell at the lowest cash prices.\n\nBest American Coal Oil 80c. per gallon.\n\nSeasoned Cordwood 82 50 per cord.\n\nGolden Syrup 84 50 per Reg.\n\nPrince Albert - Sask\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAT T. Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nKEPT CONSTANTLY ON HAND\n\nT. E. JACKSON.\n\nNew Stand, in the building lately erected as a Post Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886031201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5008, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2801, 1], [2801, 13310, 2], [13310, 13310, 3], [13310, 21743, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]