[{"id": "ab3c630640d7b60d7360e16f3359d90bd6512661", "text": "THE PRINCE ALBERT TIMES.\nWEDNESDAY, NOVEMBER 8, 1882.\n\nLAND PATENTS.\nAmongst the many grievances under which the people of Prince Albert have labored for years past, there is none greater than the delay on the part of the Government in granting patents to those settlers who have been engaged in the cultivation of the Dominion Land regulations, and have qualified themselves to obtain patents from the Crown, of lands upon which they have been living and cultivating, yet up to this time they have received no valid or legal title. This is a matter of the most vital importance to every settler in Prince Albert, and one which should be settled without further delay. It seems almost incredible to an outsider that the present state of affairs should have been allowed to continue for so long a time; yet it speaks well for the patience and forbearance of the Prince Albert people that their just discontent has been confined to remonstrance and frequent memorializing of the Dominion Government.\n\nFor the information of those who are not posted on the subject, we may briefly state the present position of the land question. In the first place, there has not been a single case where a settlement has been made in respect to the purchase of land under the Dominion Land regulations; nor has there been any attempt at making a settlement with regard to the sale of land. Consequently, although transfers of land have been made to prospectors, the land has still remained in the possession of the original owner, and there is plenty of suitable timber for a short time. A brief statement regarding the land question shows that the question of land has been a source of much trouble, and the difficulties connected therewith have been such as to prevent many from purchasing land. The result of these difficulties has been that the number of settlers has decreased, and the population of Prince Albert has been reduced.\n\nINDUSTRIES.\nThere is nothing so conducive to the prosperity and material advancement of a town as the establishment of a good manufacturing industry. There are several of these branches of industry which might be advantageously worked in Prince Albert, with comparatively small capital. For example, there is a great demand for goods, and a large market for them exists. The manufacture of goods would be an excellent business for a man who is willing to take the risk. The market for goods is very large, and there is plenty of work to be done.\n\nPROTESTANT MEETING.\nThe annual meeting of the Presbyterian congregation was held on the fifth inst., and although the weather was very fine, the attendance was larger than usual. Mr. Knowles was appointed secretary. The treasurer, Mr. Powers, read his report, which showed that the funds were quite sufficient to meet the expenses of the year. The report was unanimously adopted. The following were elected to the committee: Mr. Knowles, Mr. Murray, Mr. MacArthur, Mr. Foster, Mr. Carter, Mr. Speer, and Dr. McKenzie. The next meeting was arranged for December 15th.\n\nSTEWART AND WOOTTON.\nPrince Albert, N.W.T.\nNEW GOODS ARRIVING DAILY.\n\nGroceries, Provisions, Staple and Fancy Dry Goods\n\nALWAYS ON HAND. ALSO\n\nOut & Fit Guaranteed GENTS' FURNISHINGS\n\nFirst Store East of Bank.\n\nT.J. AGNEW\nHARDWARE,\nSTOVES,\nTINWARE,\nBLACKSMITHING\nReal Estate\n\nFOR SALE A NUMBER OF\n\nCENTRALS SITUATED IN\nPRINCE ALBERT\n\nAnd suitable for business purposes or private residences.\n\nFor further particulars apply by letter or otherwise to the undersigned.\n\nREMOVED TO\nOUR NEW STORE,\n\nNext to the Banking House\nCopper-Plating Bath.\n\nTwo experiments, at a mine operated by William Utter, at Camp Sue, near Milton, Ont., water came in and work stopped. To keep the large iron boiler hot and from rusting, but also to prevent it from drying up and failing to provide it was let down into the water. Next season, when the boiler was filled with water, it was copper bound and copper heated. From this has sprung quite an industry, and the boilers are now being shipped from our water overalls. The water contains an acid which has the property of taking up into solution the particles of copper, and these are carried away in solution which is let go, particle by particle, as the acid is picked up. It is a simple and cheap method, and this acid may make another profit still if it will get another chemical into the water which is used in the manufacture of gold down into the Stanislaus River. The copper industry consists in taking back all of the copper which is dissolved out, where it is thrown into vats of water caught in which the metals are soon changed to copper, the acid then taking the form of a black scum, and flowing away. To make sure of catching the acid, a sweep is put in the copper vat, so that it glides to the width of head, one vat is placed below another down the bank to the river, and when the water is let off, it has been, its full load and left pay, for its metal is genuine copper—standard metal.\n\nLife in the East.\n\nHow the Goldminers of Borneo Enjoyed\n\nOnce upon the shores of Borneo, Malabar Rose second determined to make up for the miseries he had endured in gold. Surrounding himself with companions and parasites, he became a hunter of life of appalling licentiousness. The State jewels, which lie in the dark stone vaults of his house, are not enough to satisfy him in public. His person glittered with rubies, emeralds, and diamonds, among which was the famous Borneo stone known as the \"diamond of the world,\" valued at half a million dollars. He killed his enemies with women, since they fed all classes of society, and his victims were always so delighted that he thought nothing of ordering them to die. Any woman who could be bought to be his mistress through the streets. Fathers became afraid to trust their daughters in the streets; husbands were afraid to leave their wives in the streets. At a short distance from the city gates, there was a race course, in the center of which stood a huge tree, the trunk of which was hollowed out to drive out to this circle of tall palms, an army of boys shouting and cheering. An army of boys would surround the tree, and a silk curtain extending to a height of dozens feet from the ground. Then the women sat in the trees, the children playing, the sound of laughter, the delighted shrieks of men, the shrill cries of women added to the general confusion. The war and his parasites were celebrating a saturnalia compared with which the most extravagant carnival of the past, stake and gain profitable. New York Herald.\n\nNewspaper Work.\n\nA few years ago the newspaper profession was looked down upon as nothing but a livelihood for the weak and capable of the lowest social degradation. Now, however, it is different. Every one of those young men who have just left school, who are eager to earn their living and who have had to offer their services to be installed in some respectable office, have been able to break through the walls of a newspaper office and relate what they are able to speak. Newspapers are now looked upon as the best outlet for getting as many facts, and as much of them as possible, in the shortest possible space. It takes young men fresh from college, who have been trained to think, and until that knowledge is obtained, they have to suffer from a pain while writing, but they are learning and have never with their elegant penmanship illustrated the most interesting stories. It has been instructive to see the eyes of new men and the facility of getting it speedily. It is a privilege to publish the news of the latest happenings, and no sooner does the goal he started out to reach.\n\nThe most remarkable thing, however, is the manner in which the newspapers are produced by journalism by other people. Once a woman lawyer wrote a notice that she was going to be married, and more unpredictable than a diagnosis, and then many success, in actually seeing themselves in positions. As a rule, the newspapers are very generous in taking departures. A lot of them are ap-\n\nMEDICAL HALL\n\nT. E. JACKSON,\n\nDEALER IN DRUGS & CHEMICALS\n\nDye Stuffs, Patent and Proprietary Medicines, Druggists' Supplies, etc.\n\nAgreed for Mr. Jackson's Celebrated Specialties.\n\nPainful Remedies and Family Recipes carefully prepared.\n\nT. E. JACKSON,\n\nDr. Porter's Building, West End.\n\nPRINCE ALBERT BAKERY.\n\nI beg to announce to my customers and the public generally, thanking them for their patronage during the last few months, and looking forward to future, that I am prepared to give satisfaction and attention to all orders received.\n\nCONSTANTLY KEPT ON HAND\n\nPREPARED\n\nCAKES, PIES,\n\nAnd other things too numerous to mention.\n\nAll Orders promptly attended to, and charged according to quality.\n\nHighest cash paid for Flour, Wheat, Butter, Eggs, etc.\n\nW. R. BELL\n\nTRY\n\nHUGH M'DOUGALL'S BREAD!\n\nHugh M'Dougall\n\nEnd End Bakery.\n\nR. THOMSON\n\nSign and Ornamental Painter.\n\nCalomining Paperhanging\n\nON SHORT NOTICE.\n\nDecorative Painting Specialty\n\nPRINCE ALBERT\n\nPLANNING MILLS AND SASH AND DOOR FACTORY\n\nDOORS, SASH, &c.,\n\nKept constantly on hand, and machine work done.\n\nBest Watches, Clocks and Jewellery\n\nIN THE MARKET.\n\nBest Joseph Rogers & Sons\n\nCutlery!\n\nSPoons AND FORKS\n\nAT R. B. WAY,\n\nNORTH-WEST CLOTHING HOUSE\n\nGent's Outfitting Goods.\n\nSuites, Pants and Vests,\n\nOveralls, Moccasins, Mitts,\n\nUndershirts and Drawers,\n\nAND GENERAL LINES OF\n\nKERR & HAMILTON,\n\nIndian Commissioner Mackenzie and North-West Territories.\n\nESTABLISHED - 1860.\n\nHEINTZMAN COMPANY,\n\nPiano Manufacturers,\n\n117 KING ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\nLADIES COLUMN.\n\nFashions for Autumn.\n\nThe beauty and cost of the new fabrics compel a resort to styles which display their merit at the utmost advantage. The scarf is a Palmer ornament. Thus, instead of the much trimmed skirt of plain silk, wood, or satin, we have a perfectly plain skirt draped in a graceful manner, and edged with a thick triple ruching. The overdress may be a panneled pelon or the more costly silk, but it is often tended and draped at the back. Or it may be a coat with tails and a vest, the latter affording a good opportunity for contrast or ornamentation. The vest is a revival of the season, and in connection with the dress coat it is often given a semi-military touch, which is, however, softened by the full square. \"Alice\" ties are in vogue, at the throat, and also by the side, and are an excellent addition to the garments. The dress coat is short in the front, and has a deep straight, and ornamented by the deep square vest—what is known as the Louis XIV. vest.\n\nThese styles are not new; but they are the revivals of different periods, and have the effect of novelty to those who have not seen them before.\n\nA very promising way to drape dresses is at the full, gusset, or plastron, pleated or gathered. This often extends from the throat below the waist, forming a low, full skirt, with a sagging panel below the Bretan strap belt or buckle which holds it across the front. This style has been adopted by Mrs. S. A. Smith, who has a broad band of embroidery, brocade, or rich figured paintery, etc., worked into the dress. There are innumerable ways of making to good advantage even a small quantity of very heavy material. A stiff material, like the very best, as part of the table, either above or below, is effective. This is the case with Mrs. Turke's embroidery used in conjunction with pongee and China crepe in crane shocks.\n\nThere is a great difference in distinction between the arrangement of gold lace for evening and day wear. Short dresses, with a large bow at the neck, a figured trunk, often a plain draped back and plain bengal or bodice. Dinner and evening dresses on the same line, made of plain silk, figured stuff often show a skirt of the soft color, shirred or ruched upon the hips, with piping or bengal at the waist. The dress is in West tea style, and small train of figured bengalee in the striking colors of purple, tan, and black. Mrs. John Drew's dresses as \"Mrs. Malaprop\" at the Union Square, tell the story of the old-fashioned lady, well fitted, and with the exception of the height of the head-dresses which may possibly express the idea of the \"old-fashioned,\" during the present season, would serve as elegant models for the elegant dinner and evening dress. Mrs. Drew's dress, which she wears, the petticoat of one is blue with trims of blue and rose red bengal, another is blue with rose red bengal divided into puffs, with trims over each of rich bengalee supple, with an effective bow at the waist, and tied together upon it. The third is pale mauve with front of mauve velvet, and mauve net trim, with a bengalee dress of figured muslin, brown shaded in the ground color. Carriage bouquet of pansy-colored roses (or this may appear in the painting) and the grave yellow lilies. There is a red rose also at the side of the plumage of the feathers which ornament the powdered hair.\n\nThe very long trains, it is a comfort to see, are generally abundant. At the third dress parade of the season in Baltimore, where were many beautiful and new dresses, only one very long skirt was worn, and that belonged to a white satin dress which was not new, and it looked old, shabby and out of place. The dresses of Friday afternoon were magnificent and fantastic, because they have no more connection with the cost of the material than the others, still the latter is supposed to have a fine style which justifies its existence. It is in vogue to have a dress which will hang will fly. The square tails at the end of a skirt has no reason whatever for its being, except that it looks very pretty, and it is a more sensible inconvenience which should never again have an existent.\n\nThe dress coat is a style which affords an excellent opportunity for playing of the wide range allowed in the choice of material and the making of half evening dresses.\n\nA short dress of pale pink satin, for example, was made perfectly plain back and front, straight gathered skirts,\nTOWN NEWS.\n\nBusiness is rushing this week so in the River News.\n\nBuy a Homestead place, and take home agreeable and pleasant.\n\nAdvertise in the Times, our best advertising medium in Prince Albert.\n\nThe lighting of the Presbyterian church has been vastly improved by the addition of new windows.\n\nThe merchants are requested to send in their advertisement changes not later than Wednesday evening.\n\nAll communications and letters to be addressed to the proprietors of the Prince Albert Times.\n\nA young man named Nelson living 6 miles from Prince Albert had two of his fingers taken off while working with an axe.\n\nIt is reported large numbers of carts loaded with merchandise for Prince Albert are now at the river waiting for the ice bridge, the bridges do not seem to be good at present, or probably they have been destroyed.\n\nIt is to be hoped that the government will carry out the same policy here in the North-West as they have done in Manitoba, with regard to river lots, viz., to give free patents to all actual users and not to those who merely speculate.\n\nThe people of Prince Albert will be satisfied with nothing less than this.\n\nDuring the long winter evenings a very pleasant recreation would be the establishment of pony readings. A suitable place such as Hurd & Baker's building, where the ponies are kept, might be set up for the purpose, and there ought to be plenty capable of giving good readings and recitations.\n\nSome fears were entertained that the delegates, Col. Sproul and Hon. Lawrence Clarke, would be detained at Batoche's crossing, on account of the floe being too heavy in the river, but we are happy to learn that they have already returned last Sunday, and are now well on their way to Qu'Appelle.\n\nWe wish them success.\n\nAn important matter which requires immediate attention, on the part of the government, is the establishment of a telegraph line between Prince Albert and Grand Rapids, in order to remove the sand bars and also the fear of rock which has been disturbing the navigation of the river. We understand that an appropriation of $30,000 has been already made for this purpose, and we hope it will be speedily completed.\n\nMr. J. N. Campbell has just returned from his trip over the plains, he landed only two days ago at the river as soon as the floe had been broken up for the season, and succeeded in buying a large quantity of provisions and 1500 yards of Mr. A. Fisher's team to run in the boat, and take these provisions to the Fort. Mr. Fisher's account that Indians don't freeze two years.\n\nBy private conveyance, Mr. Edward Flood visited the head of the Prince Albert-Saskatchewan, and Mr. McPail, also chairman of Prince Albert, arrived yesterday afternoon. Mr. McPail was delayed 24 hours at the South Bluffs by the flooding ice. This caused a large number of people to go out on the river waiting for the time to get clear, and Mr. Flood intended to establish a prospector's camp near the mouth of the Saskatchewan.\n\nThere is abundant material in Prince Albert for the formation of an Historical Society, and we would suggest that the members of the same take advantage of this opportunity.\n\nThe following is a list of ice cases left over from last week:\n\nLosing 7 sufficient to make an agreement. Elliot for phantail, cases are in demand needed for phantail, 82¢.\n\nGent's No. 1 Otter, Beaver and Astricen Caps.\n\nBEITTS & GYNNIE\n\nDry Goods, Clothing, Books, Shoes,\n\nGroceries, Provisions and Patent Medicines\n\nLADIES' DEPARTMENT\n\nBlack and Colored Dress Goods,\nCambric and Woolen Underwear,\nInfants' Rakes and Knitted Goods,\nHats, Shawls and Caps.\n\nGent's No. 1 Otter, Beaver and Astricen Caps\n\nBEAVR GAUNTLETS.\n\nTHE ONLY NOVELTY STORE.\n\nTHE HORSE SHOE,\n\nFOUR CORNERS WEST OF THE BANK.\n\nWhere we have on hand one of the largest and best assorted stocks of Fancy Goods ever offered in Prince Albert.\n\nLadies' Gold and Bead Sets, Jewelry, Watches, Pins, Brooches, Etc., etc.\n\nCHILDREN'S TOYS, NOVELTIES, DOLLS AND AMUSEMENTS\n\nWATCHES.\n\nCLOTHES.\n\nDavis & Smith.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gueschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nSTEWART & WOOTTON\n\nGeneral Merchants,\n\nWHOLESALE & RETAIL\n\nGroceries and Provisions,\nDry Goods, Clothing,\nHardware, Furs,\nHats and Caps,\nBoots and Shoes,\nPaints and Oils.\n\nEIGHTY-THREE CARTS GENERAL GOODS!!\n\nNOW DUE.\n\nFINE ASSORTMENT OF\n\nRobes,\n\nRaccoon and Buffalo Coats\n\nTO ARRIVE.\n\nTHE ECHO HOUSE\n\nQU'APPELLE.\n\nNotice that an application will be made to the Government of Canada in the next session thereof for an extension of the right-of-way of the Hudson Bay Railway, with power to build a branch line from the point of entry to the Settlement of Prince Albert, in the North-West Territories, to the mouth of the Saskatchewan River, and from that point on Hudson's Bay, all or near thereto.\n\nApplications will be received until the first day of November, A.D. 1882.\n\nJ. M. STUART, Collector for Applicants.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882110801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 4668, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3555, 2], [3555, 9797, 3], [9797, 9797, 4], [9797, 14226, 5], [14226, 19585, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]