[{"id": "e819ff5fb3bb9cf973418ab6d3b8be57ba7c8f7b", "text": "THE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nPUBLISHED EVERY FRIDAY.\n\nJ. D. MAVEETY.\n\nPRINCE ALBERT N.W.T.\n\nFRIDAY, JULY 1, 1857.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's and St. Mary's Church, 9 a.m., Sunday School, 10 a.m.; Church Service, 12 noon; Evening Service, 6 p.m.; Canon Piatt.\n\nSt. Paul's Church, 3 p.m.; Rev. Canon Piatt.\n\nSt. Andrew's Church, 5 p.m.; Mr. MacKenzie.\n\nSt. James' Church, 3 p.m.; Ven. Archdeacon.\n\nSt. John's Church, 5 p.m.; Mr. MacKenzie.\n\nSt. Paul's Presbyterian Church, 6 p.m.; Mr. MacKenzie.\n\nMethodist Church, Red Deer Hill and Woodside, 6 p.m.; Mr. MacKenzie.\n\nEpiscopal Church, 6 p.m.; Mr. MacKenzie.\n\nThis paper may be found in the following places:\n\nNEW YORK\n\nFRIDAY, JULY 1, 1857.\n\nWe are glad to observe that during the recent North West Termination are to be visited by members of the Cabinet Ministers. Sir John Macdonald is expected to visit the North West at Red River Springs. The Hon. Mr. Thompson, as it is reported, will visit Manitoba and the Territories and Hon. Mr. White will also visit the Far West. It is said that Mr. Thompson is among others on the tour. Here he will be subject to keen criticism. However, it is anticipated that nothing but honest impressions will be given to the public by him.\n\nThe continued interest Ministers are taking in the North West, as evidenced by their personal visits year by year, is highly commendable. It demonstrates their sense of responsibility and its importance, which is emphasized in its most reliable form and must have more forceful and lasting influence than the Ministerial visits that have been made in the past. It shows that the Government has not forgotten its obligations and that departmental reports or ministerial visits are no longer acceptable.\n\nCOMMUNICATIONS.\n\nWe observe Sir William recently introduced a bill into the House proposing to send land surveyors to examine the boundaries between the Assiniboia, Long Lake, and Saskatchewan, when no provisions exist to cover the North Branch at the point where the first recorded boundary line was drawn through Assiniboia. We believe that such a proposal would be well received by the Government, who have been engaged in similar surveys for many years.\n\nSEED GRAIN.\n\nI understand that Mr. McTaggart has sent his seed grain to the Government, and I am sure that it will be received with great satisfaction. It is a fact that the Government has been engaged in seed grain surveys for many years.\n\nTHE WEST END STORE.\n\nJUST ARRIVED.\n\nNEW GOODS.\n\nAT\n\nCHAS. MAIR'S W ST END STORE,\n\nNairn's Velling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Repro, Wool in Handloom and Slade, Yellow Door Mats, Crocheted Doilies, etc., etc.\n\nALL AT LOW PRICES.\n\nA large stock of Ready-made Clothing and Fresh Groceries, including Coffee Collections, Biscuits, Figs, Dates and Timed Goods of all kinds.\n\nInspection is solicited.\n\nCALEDONIA BREWERY.\n\nNEW FERRY.\n\nEAST END.\n\nTHE DARTMOUTH ROPEWORK CO.\n\nHALIFAX, NOVA SCOTIA.\n\nBINDER TWINE\n\nFOR THE HARVEST OF 1857.\n\nSTRENGTH AND EVENNESS\n\nTHE FARMERS OF CANADA\n\nDARTMOUTH ROPEWORK CO.\n\n18 WELLINGTON ST. WEST, TORONTO.\nFRIDAY, JULY 1, 1867.\n\nST. ANNY'S CONVENT\n\nSecond Annual Distribution of Prizes.\n\nOn Monday, the 25th, the second annual distribution of prizes in the above institution was held in the school-room, under the charge of Miss Wilson.\n\nMiss Wilson has extended their instructions not only to the parents and guardians of the children, but also to the teachers and pupils themselves; and there was a large turn out of pupils from the town and surrounding district. The children, both boys and girls, were very attentive and excellent scholars. Miss Wilson has been very successful in her endeavours to improve the moral and intellectual condition of the children. She has been very attentive to the young lady pupils. At the conclusion of the proceedings, Miss Wilson spoke to the pupils, and after the interesting pre- sentation of prizes had been concluded, Mr. Clarke spoke to the pupils.\n\nMiss Wilson spoke to the pupils, and after the interesting presentation of prizes had been concluded, Mr. Clarke spoke to the pupils.\n\nPUBLIC NOTICE.\n\nNotice hereby given that a light grey flannel, without horns, with a better quality of wool than usual, and very heavy, has been captured and placed in the hands of the police. Any person who may have seen or heard anything relating to the capture of the same is requested to communicate with Andrew Spencer, Esq., at his residence.\n\nANDREW SPENCER, J.P.\nRed Deer Hill, June 27th, 1867.\n\nRUSSELL & DAVIS,\nWHOLESALE & RETAIL\nButchers.\n\nGAME IN SEASON.\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham, and\n\nBRUNCH STALLS—Qu'Appelle Station,\nFort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\nBROWN'S BRICK STORE\n\nPRINCE ALBERT\n\nBREWERY.\n\nPure and Sparkling\nAMBER—Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nMINTON & GERRARD\n\n\"BELL\" ORGANS\n\nCatalogues free.\n\nDELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co.,\nNewspaper Advertising Bureau,\nSuite 100 (for 1000 copies).\nMontreal.\n\nTHE PRINCE ALBERT TIMES\n\nAND—\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETTY.\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nPICNIC\n\nOn Monday the annual picnic of Lindsay School was held with great success. The day was fine and cool, with a slight shower, but this can scarcely be said to have at all dampened the spirits of the assembled company, extracted from the pleasantness of the meeting. Owing to the high place which Mr. Atwater holds in the esteem not only of scholars but pupils alike, there was a large turn out of the population of Lindsay and to the eye of an astron- omer the scene presented itself as one observing the affectionate deference of old and young towards the teacher who had been so kind as to give all in return. The large company included guests from neighboring parishes and friends from Prince Albert holding a comfort and companionship. Mr. Atwater and parishioners were indefatigably active.\n\nIn preparation for the meeting a large and lofty pine tree bower had been constructed adjoining the school house, where the children could sit comfortably under the boughs, and a part of the area en- closed was comfortably floored where the band could be placed and where afterwards an \"evolution\" of dance was indulged in.\n\nA special feature in the programme was a tall flag staff on which in honor of the jubilee of our Gracious Queen that ed an elegant union jack, visited from afar by the Queen herself. When the Duke of Prince Albert paid a flying visit to the school on a musical mission and put the children through their paces in a most engaging style, and while the company assembled as assembling Mr. T. Adams played a selection of tunes on the harmonium which were most appreciated.\n\nAbout mid-day the serious business of lunchroom commenced and was promptly concluded by all present. The children first, visitors next and the general com- pany afterwards. The elders then in groups visited the grounds and took in the prospects of the crops and the affairs of the nation generally, while the young- sters played games and games and games until at a given signal the whole company assembled in and about the bower. The children sang, under the able leadership of Mr. Adams, sang with fine effect the Queen's Anthem in which the whole assembly joined.\n\nMr. Atwater then addressed the assem- bly a few well chosen remarks of a generous character. He spoke of the obligations which existed between the inhabitants of Lindsay and himself, engaging the children for their future and assuring them that they should be well educated and the children for their attentiveness and attention which he highly commended and encouraged in him as their teacher. He also mentioned the great obligations they were under to treat their parents with respect in school affairs and finally, referring to the auspicious date on which their picnic was being held, he referred to the many reasons which existed for a warm and heartfelt celebration of the Queen's Jubilee. These remarks were received with warm applause by the large audience.\n\nMr. James Flett, incumbent of the parish then delivered a short address ad- mirably suited to the occasion. The Canon, from his wide experience, fully concurred in the charitable intentions as- sociated with the kindly and harmonious cha- racter of the people of Lindsay. His interest in the welfare of the school was a source of great pleasure to him and, he sincerely hoped, of some profit to them. He also spoke of the importance of the school and, after some highly apposite historical allusions, forcibly endorsed the chair- man's sentiments regarding the aims and ambitions. Having made a special reference to the day's proceedings, the Canon concluded with an interesting address upon the importance with which the spiritual and temporal welfare of the People.\n\nCapt. Craig was next called upon. He spoke of the importance of harmony every where, especially in small communities and in the various parts of the country on the state of matters among them as disclosed in the remarks of the previous speaker. He congratulated the school on possessing a prominent head like Mr. Atwater, spoke to the children on the importance of education and cre- ated enthusiasm in taking advantage of the unusual opportunity of acquiring learn- ing that was now within their reach. Having spoken briefly to the gathering, he made way for Mr. Charles Adams, who, good naturedly without the damping effects of a heavy thunder shower, spoke briefly and pleasantly on the topics of the day and, in connection with the reign of George the Third, one of the few sovereigns who knew how to make a public speech. Mr. Andrew Spencer then took the floor and spoke in a kindly style appro- priately wound up this part of the programme by a very general observation or two on the subject of the weather, his views with the sentiments that had fallen from previous speakers and his good wishes to all present.\n\nCheers were then given for the teacher, the trustees, the guests, Mrs. Canon Flett who had presided over the children in such a agreeable way, the teachers, special cheers for the Queen were called for first, Crees, then in English and given by all the children present. After the order of the evening was at its stage your correspondent must call a halt. He endeavored to keep the children quiet kept it up till the small hours, but this was long after he had sought the arms of \"Tired nature's sweet remedy, balmy rest.\"\n\nOUR DAIRY BREAD\n\nHeavy or sour bread or biscuit has been injurious to the digestive organs and the nervous system health we enjoy. How important our present happiness and future welfare unbalances the bless- ing of good health. Under a suitable condi- tion, it is easy to repair the damage. Notwithstanding these facts, thousands of persons daily jeopardize not only their own lives, but the lives and the health and lives of others, by using articles in the preparation of their food which are injurious to the body which they know nothing. Perhaps few cents may have been saved, or it may have been thought that the article was more cheaply used, and the housekeeper takes the re- sponsibility and possibly will never know the mischief that has been wrought. Parents who are anxious for the welfare of their children may have lost their appetites, or lack pulse, so the true cause rarely is known. The dough is mixed in the dough-pan, the dough is simply to well it and form little cells through every part. These cells are filled with carbonic acid gas, which causes the dough to rise during the process of baking.\n\nThe Royal is made from pure grain and contains in a clear of this article a highly carbonized bicarbonate of soda that generates the gas alluded to; and, when mixed with flour, it is perfectly fitted, tested and adapted to each other, that during the whole time of bake- ing, and even remains to undermine the cells, to give a light, flaky, airy sour bread, but if directions are followed, every article will be found sweet and wholesome.\n\nTOWN COUNCIL\n\nAn adjourned meeting of the Council was held on Monday evening last.\n\nPresent Coms. Bain, Agnew and Stewart, with Mayor MacArthur in the chair.\n\nThe usual routine of reading minutes was gone through, when a\n\nCOMMUNICATION\n\nwas read from V. Maclean on behalf of the South Eastern Rail Road Company of Jacob referring to right of way across river lot 52.\n\nAN ANNOUNCEMENT\n\nwas received from M. McLaughlin for removing matter, 817, referred to Finance Committee.\n\nCom. Bain moved a resolution adopted by a law to pro- vide for good order and the suppression of vice and immorality.\n\nCom. Stewart introduced a by law for the appointment of a special police officer.\n\nSPECIAL COUNCIL REPORT\n\nCom. Bain had the contract for holders to W. J. Carter and the rest of the ap- pliances to Mr. Farquhar.\n\nOn motion of Coms. Agnew and Bain, the other made by the Mayor, the report was accepted and the Town Solicitor instructed to see the\n\nCom. Bain reported that he had ad- vertised for tenders for water tanks.\n\nCom. Stewart gave notice that he would move a by law to close streets before lot 398.\n\nMoved by Com. Bain, seconded by Com. Stewart that in view of the recent fire at the Transporation Company building a loading and ware- house, all taxes against their Company be assessed.\n\nThe by law for licensing livery stables, etc., was read a third time and passed, and ordered to be signed, sealed and announced.\n\nThe by law for appointing a License Inspector was passed, and ordered to be signed, sealed and announced.\n\nThe Council adjourned.\n\nREAD THESE PRICES!\n\nNAILS, $6 75 per keg,\nTARRED PAPER, 6 per 100 lbs,\nBARBED FENCE WIRE, 10 50 per 100 lbs.,\nMILK PANS, 2 per dozen,\nTIN ROOFING, 10 per square,\nEAVETROUGHING, 12½c per foot.\n\nMy Timothil having arrived, I can undertake all work in this line, and will guarantee satisfaction.\n\nGroceries and General Supplies\nAll at Bottom Figures, for cash, at\nJ. R. McPhail.\n\nRobertson & Robertson,\nMerchant Tailors\nAND\nGENTS FURNISHINGS\nA LARGE STOCK OF\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\n\n1879.\n\nBUFFALO HALL!\nNEW GOODS ARE BEING OPEN EACH WEEK\nalways on hand Fresh Linen to\nDry Goods, Clothing and Groceries\nPrices will be found right and nothing but reliable goods shown.\nBUFFALO HALL FOR\nDress Goods, Corsets, Hosiery, etc., Ready-made Clothing\nBETTS & Gwynne.\nDress Goods, all shades\nIrish Diaper Linen,\nIndia Linen, Muslins,\nNuns' Veiling,\nSilk Gloves, Cottons,\nGingham, Prints,\nWincies, Ladies Jerseys\nBoys' Jersey Suits,\nReady-made Clothing,\nFROM FOUR YEARS UP—AT\nR. C. Wigmore & Co.'s.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887070101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3856, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3137, 2], [3137, 6032, 3], [6032, 15713, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]