[{"id": "d95fb87ed8d8a339a62bbff1683e12ad5c820fac", "text": "JUST RECEIVED\n\nMAMMOTH STOCK OF\n\nFRESH GOODS\n\nJust received by steamers\n\nNorthcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince A\n\nDry Goods\nGroceries\nProvisions\nCrockery\nHardware\nBoots and Shoes\nWooden Ware\nFancy Goods\nClothing\n\n20 bls Mess Pork\nBacon and Ham\nCanned Fruits\nMaple Sugar\nBiscuits\nCigars and\nFancy Pipes\nBaskets etc., etc\n\nSTEWART & WOOTTON\nWALTERS THE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\nGeneral Merchants,\n\nPrince Albert, Batoche's\n\nSTOBART, EDEN & CO., General Merchants\n\nMARKLEY & ORR, HUGH J. MONTGOMERY, Real Estate Agent, AUCTIONEER, ETC.\n\nPRINCE ALBERT, N.W.T.\n\nReal Estate Exchange.\n\nPETERSON, HANAFIN & KEENAN, Auctioneers, Valuators, Real Estate Commission and Insurance Agents.\n\nPRINCE ALBERT, N.W.T.\n\nReal Estate For Sale - A Number of Choice Building Lots\n\nPRINCE ALBERT\n\nC. MAIR P. DRAWER & Co.\n\nJACKSON & JACKSON\n\nHarrows, Seeders, Etc.\n\nHAS JUST ARRIVED.\n\nSPINK & MAVETY, PROPRIETORS,\n\nRIVER STREET, PRINCE ALBERT\nITEMS OF INTEREST.\n\nA Shanghai dispatch says that the situation there is becoming very serious, and that the foreign troops are preparing for an attack.\n\nAn inquiry into the murder of Lord Montague has been made in London, and the police have arrested two men as suspects.\n\nThe trial of the Marquis de Talleyrand has been postponed until next week, due to the illness of the defendant.\n\nThe death of the Duke of Orleans has been announced, and his funeral will take place next month.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT N.W.T.\nNEW ARRIVALS\n\nThe following is a list of passengers who arrived by steamer North West last Sunday morning:\n\nPRINCE ALBERT - N.W.T.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\n\"The Hudson's Bay Company own 7,500,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres already surveyed by the Government of Canada.\"\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, Red Lyon, Rat Portage, Portage la Prairie and Godden, N.W.T.\n\nThe以上文段来自于一份报纸的广告和通知内容。\n1879. BUFFALO HALL. 1883.\n\nThe Old, Reliable Dry Goods, Clothing, Grocery, Crockery and Patent Medicine House still to the front\n\nRETTS & Gwynne\n\nNow an exhibition, conspicuous among them being some choice selections in Bunting and De Beige, Dress Goods, Elegant Infant Robes, Evening Shawls and Kid Gloves, Frillings, Lace Trimmings, Corsets, Hosiery, Smallfurnishings and a full line of Crook's Celebrated Black Silk Capes. Our Brown and White Ducks, Ticking, Sheetings, Jeans and Gambros, together with our English and American Prints\n\nMake this branch of our business the most complete ever opened here, and at prices without an equal in the country. Grand Display of READY-MADE CLOTHING BOUGHT AND PAID FOR.\n\nMen's, Women's and Boys' Suits, representing one of the largest and most fashionable clothing outfits ever shown in this district, and owing to our disappointment in not securing larger premises, we have decided to offer for the next THIRTY DAYS every article in this department at cash prices which cannot help but extinguish opposition.\n\nMen's Knit Jerseys, Shirts, Tie Collars and Gloves, Hard and Soft American Hats and Helmets and a Big Outfit of Straw Goods—Every article new and stylish\n\nTWENTY-FOUR DOZEN PAIRS OF Our now Celebrated Double-stitched Overalls\n\nREADY FOR INSPECTION.\n\nWe take pleasure in assuring that we are still in a position to maintain the reputation we have gained in our GROCERY DEPARTMENT.\n\nAs usual, our stock of Choice Goods is unequalled, while our Groceries, Spices, etc., will be found pure and unadulterated. Every article has been selected for its usefulness, not cheapness.\n\nSTAPLE CROCKERY\n\nThe best on the market. In PATENT MEDICINES we show a full line of every kind of simple goods.\n\nDOMINION DAY.\n\nIce Celebration in Prince Albert.\n\nMAHAFFY AND CLINKSKILL\n\nGeneral Supplies\n\nAnd are offering the same at very low prices.\n\nThe Stock is large and well assorted. The prices are such as to give universal satisfaction. An early visit is recommended, as the choice ones are being rapidly sold out.\n\nStand—Next Post Office,\n\nFIRE IN WINNIPEG.\n\nMAMMOTH Flower and Vegetable Gardens\n\nJOHN BROWN\n\nNew Ferry.\n\nLe Pine's Crossing, N.B.\n\nA fire has devastated and destroyed several residences and stores along the river bank.\n\nThis disaster has caused considerable damage to the town.\n\nJOHN BROWN.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883070401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 1427, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 453, 2], [453, 1096, 3], [1096, 1929, 4], [1929, 2418, 5], [2418, 4760, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]