[{"id": "b24695ca8c5835fc0caed8541d718b15165b0515", "text": "Notice is hereby given that Owen Edward Hughes, of the Town of Prince Albert, in the North West Territories—Equire, has ceased from and after this date to be Manager of the business known and carried on under the name, style and firm of O. E. HUGHES & CO., at the Hotel and Post Office, Prince Albert, by him late located in Prince Albert, by whom said hotel was located in England, and that said Owen Edward Hughes is not, and from and after this date, in any way empowered to transact or perform any sort or description of business for me, either under such firm name or otherwise.\n\nDated at said Town of Prince Albert, this twenty-sixth day of December, A.D. 1855.\n\nWILLIAM STOBART,\nBy his Attorney,\n\nFRED W. STOBART\n\nSTRAYED!\n\nStrayed onto my premises, about last October, Red and White Heifer. More white than red; small horns; two years old.\n\nOwner can make inquiry regarding property and paying expenses.\n\nJOHN GREY,\nTownship 47, R.S. No. 28.\n\nMISS MCGUIRE\n\nMiss McGuire wishes to inform the public of Prince Albert and the surrounding country that she has opened out a Millinery, Dressmaking and Mantle making shop, where she is prepared to undertake all kinds of work connected with the business, and guarantees satisfaction.\n\nMISS MCGUIRE,\n\nCAMPBELL'S BLOCK.\n\nMISS MCGUIRE\n\nThe particularity following existing, and will be used under the style and firm of \"KNOX & BARKER\" by mutual consent this day been dissolved. All debts owing to said partners will be paid in full, and the balance due to be settled on or before the fourteenth day of November next, and to be paid to Mr. Knox, who will conduct the business.\n\nWILLIAM KNOK,\nPRINCE ALBERT, SASK., N.W.T.,\nOctober 3rd, 1865.\n\nLEARN FRENCH IN THREE MONTHS\n\nHaving discontinued my French classes during the past winter, I am now ready to open again. The classes will be conducted regularly at their present, will re-open on the first of December.\n\nEVENING PRIVATE FRENCH SCHOOL\n\nAnyone desirous of learning French on a short course, will find the opportunity to learn French in three months.\n\nL. R. ST. LOUIS\n\nHOLIDAY GOODS, TOYS, ETC.\n\nJust received — An immense assortment of XMAS PRESENTS consisting of Ladies' Hand Bags, Ladies' Companions, Writing Desks, Photo Frames, Whisk Holders, Photo Albums, Work Boxes, Autograph Albums, Dolls, Doll Furniture, Hand Sleighs, Tea Sets, Toy Pianos, Etc.\n\nMISS MCGUIRE,\n\nPRINCE ALBERT.\n\nMISS MCGUIRE\n\nNotice is hereby given that Owen Edward Hughes, of the Town of Prince Albert, in the North West Territories—Equire, has ceased from and after this date to be Manager of the business known and carried on under the name, style and firm of O. E. HUGHES & CO., at the Hotel and Post Office, Prince Albert, by him late located in England, and that said Owen Edward Hughes is not, and from and after this date, in any way empowered to transact or perform any sort or description of business for me, either under such firm name or otherwise.\n\nDated at said Town of Prince Albert, this twenty-sixth day of December, A.D. 1855.\n\nWILLIAM STOBART,\nBy his Attorney,\n\nFRED W. STOBART\n\nMISS MCGUIRE\n\nMiss McGuire wishes to inform the public of Prince Albert and the surrounding country that she has opened out a Millinery, Dressmaking and Mantle making shop, where she is prepared to undertake all kinds of work connected with the business, and guarantees satisfaction.\n\nMISS MCGUIRE,\n\nCAMPBELL'S BLOCK.\n\nMISS MCGUIRE\n\nThe particularity following existing, and will be used under the style and firm of \"KNOX & BARKER\" by mutual consent this day been dissolved. All debts owing to said partners will be paid in full, and the balance due to be settled on or before the fourteenth day of November next, and to be paid to Mr. Knox, who will conduct the business.\n\nWILLIAM KNOK,\nPRINCE ALBERT, SASK., N.W.T.,\nOctober 3rd, 1865.\n\nLEARN FRENCH IN THREE MONTHS\n\nHaving discontinued my French classes during the past winter, I am now ready to open again. The classes will be conducted regularly at their present, will re-open on the first of December.\n\nEVENING PRIVATE FRENCH SCHOOL\n\nAnyone desirous of learning French on a short course, will find the opportunity to learn French in three months.\n\nL. R. ST. LOUIS\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nThis Paper may be found in every newspaper office in Canada, and in New York.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\n11 a.m.—Rev. Mr. Massie.\nThe Minster Chapel.\n1 p.m.—Rev. Mr. Wright.\n2 p.m.—Rev. Mr. Scholz.\n7 p.m.—His Lordship the Bishop.\n\nSt. Catharine's\n11 a.m.—Rev. Mr. Macdonald.\n2 p.m.—Rev. Mr. Macdonald.\n\nSt. Paul's\n1 p.m.—Rev. Canon Field, B.D.\nSt. Andrew's\n11 a.m.—Rev. Mr. Field, B.D.\nSt. John's\n1 p.m.—Rev. Archdeacon McKay, B.D.\nSt. James'\n1 p.m.—Rev. Mr. Field, B.D.\nSt. Anne's, R. Catholic\n11 a.m.—Rev. Mr. Field, B.D.\nSt. Paul's Presbyterian\n11 a.m.—Rev. Mr. McMillan.\n\nFRIDAY, DEC. 25, 1885.\n\nCHRISTMAS\n\nWe had almost forgotten that the Christmas season had arrived, if it were not for the Sunday School subscription list which has been going the rounds, and which is in the weather now, but rather than to make any pleasure unmarked by pain. We believe that it is only to child ren that the present can be called a Christmas, and to them the expectation is often filled with hopes that are never realized.\n\nIf we stand for a moment and look back over the past year we will surely see the saddest in our history, but one mixed with many pleasant memories, with many expectations realized, and a year during which great strides have been made forward by our town. No one can visit Prince Albert at this time, and see what we have passed through, but what will say that the future is full of hope, and the coming year will be unsurpassed in its many pleasant anticipations. During the past year we have lost some of our most familiar faces, and although their places have been taken by others in the business of the town, they will never be missed in the hearts of their friends. It is this feeling that makes this Christmas, which otherwise would have been the happiest in our history, a very sorrowful one to many amongst us. To those of our readers who have the misfortune to be bachelor s, the Christmas season is not likely to bring much good cheer, especially to families who have the wife and mother at their head, and we doubt not but that many a lone man will vow that next Christmas he will find a home. If our paper should allow it we would like to review the improvements and additions which have been made to our town during the past year, but we will not do so except for a future number, and we sincerely trust that the difficulties under which THE P. A. Club has labored will be overcome during the coming year, and that with the help of our patrons, we may meet the winter of all our patrons.\n\nThe Methodist says that his members have been gathering together, and the expected presence of the ex-militia leader will no longer be a source of embarrassment. It is satisfactory to know that the entertainments, which were entirely of a religious character, were not attended by any of the military leader, to further widen public feeling.\n\nLieut.-Gen. Dowling has given a written guarantee to Mr. O. E. Hughes, Esq., that he, Lieut.-Gen. Dowling, will hold himself, who has threatened to prosecute him, will not be prosecuted or interfered with by the Government. They will, however, be open to prosecution for any stolen property in their possession.\n\nMr. O. E. Hughes, M.N.W.C., has been faithful and trustworthy throughout the administration of the District of Prince Albert and western district, and has taken a deep interest in all matters pertaining to the rights of the people. The substance of a long report, moved to Mr. Hughes, and seconded by Mr. Prin ce, of Wabasso, relates to the advisability of settling the legitimate claims of settlers rendered destitute by the late settlement, has been moved by Lieut.-Gen. Dowling to the Government in allowing the law to be carried out in regard to the claims paid as soon as possible.\n\nThe North West Council, the members of which must be given power to thoroughly comprehend the situation, to provide for the ensuing result, and to bring to a strong term, the action of the Dominion Government in allowing the law to be carried out in regard to the claims paid as soon as possible.\n\nWhen the question of the claims have been held in certain of the towns of the Dominion, at which it was sought to condemn the Dominion Govern ment for allowing the settlement of the Council to carry out effect in the case of Lord Kitchener, who had stirred up rebellion among the half-breeds and Indians in these Terr itories, and who, after a fair and impartial trial by a competent tribunal, whereas the peace and tranquility and prosperity of these Territories would have been jeopardized and a feeling of insecurity would have existed among the settlers had the same two cases been heard, who had not shrunk from the terrible responsibility of uniting the half-breeds and Indians to armed insurrection had permitted to proceed, would have been far more disastrous. And whereas a fair, just and impartial administration of the law must be had, if the laws of our country are to be respected by all classes irrespective of nationality; therefore this Council desires to urge the said council to pass an act in the nature of the Dominion Govern ment in allowing the sentence of the Court to be carried into effect.\n\nOUR PUBLIC SCHOOL HONOR ROLL\n\nFOR QUARTER ENDING DECEMBER 30.\n\nGirls—Alice Stewart, Virginia Mc Kay, Jane McIlwain, Ethel Gordon, Agnes Thompson, Clara Edwards, Emma Wilson, Anna Dilworth, Jessie Dilworth, Annie McCaggart, Lizzie Dilworth, Anna Sower.\n\nBoys—Roy McIlwain, Tom MacKay, Willie MacKay, Alex MacKenzie, Willie MacKenzie, Fred McLeod, John McLeod, Willie Gordon, Robert Ross, John Gordon, Jack Burdett, Frank Robertson, Robert Robertson, William Gordon, Robert McCaggart, William McTaggart, Richard Gordon, James Sower, John Dilworth.\n\nPROTESTS\n\nSamuel Hill—At O. O. Smith, McKay, Sam Dilworth, Willie Gordon, Willie MacKenzie, Henry Oakes.\n\nH. H. IV—At O. O. Smith, Ethel Gordon, Clara Evans, James MacKenzie, Alfred McCaggart, Fred McCaggart, John Dilworth, Frank Robertson.\n\nIV—At O. O. Smith, Ethel Gordon, Willie Gordon, Anna Dilworth, Anna Sower, Arthur W., Mrs. Balintine, Wm. MacKenzie, Alex MacKenzie, John Dilworth.\n\nMr. O. E. Hughes, M.N.W.C., has been faithful and trustworthy throughout the administration of the District of Prince Albert and western district, and has taken a deep interest in all matters pertaining to the rights of the people. The substance of a long report, moved to Mr. Hughes, and seconded by Mr. Prin ce, of Wabasso, relates to the advisability of settling the legitimate claims of settlers rendered destitute by the late settlement, has been moved by Lieut.-Gen. Dowling to the Government in allowing the law to be carried out in regard to the claims paid as soon as possible.\n\nThe North West Council, the members of which must be given power to thoroughly comprehend the situation, to provide for the ensuing result, and to bring to a strong term, the action of the Dominion Government in allowing the law to be carried out in regard to the claims paid as soon as possible.\n\nWhen the question of the claims have been held in certain of the towns of the Dominion, at which it was sought to condemn the Dominion Govern ment for allowing the settlement of the Council to carry out effect in the case of Lord Kitchener, who had stirred up rebellion among the half-breeds and Indians in these Terr itories, and who, after a fair and impartial trial by a competent tribunal, whereas the peace and tranquility and prosperity of these Territories would have been jeopardized and a feeling of insecurity would have existed among the settlers had the same two cases been heard, who had not shrunk from the terrible responsibility of uniting the half-breeds and Indians to armed insurrection had permitted to proceed, would have been far more disastrous. And whereas a fair, just and impartial administration of the law must be had, if the laws of our country are to be respected by all classes irrespective of nationality; therefore this Council desires to urge the said council to pass an act in the nature of the Dominion Govern ment in allowing the sentence of the Court to be carried into effect.\n\nOUR PUBLIC SCHOOL HONOR ROLL\n\nFOR QUARTER ENDING DECEMBER 30.\n\nGirls—Alice Stewart, Virginia Mc Kay, Jane McIlwain, Ethel Gordon, Agnes Thompson, Clara Edwards, Emma Wilson, Anna Dilworth, Jessie Dilworth, Annie McCaggart, Lizzie Dilworth, Anna Sower.\n\nBoys—Roy McIlwain, Tom MacKay, Willie MacKay, Alex MacKenzie, Willie MacKenzie, Fred McLeod, John McLeod, Willie Gordon, Robert Ross, John Gordon, Jack Burdett, Frank Robertson, Robert Robertson, William Gordon, Robert McCaggart, William McTaggart, Richard Gordon, James Sower, John Dilworth.\n\nPROTESTS\n\nSamuel Hill—At O. O. Smith, McKay, Sam Dilworth, Willie Gordon, Willie MacKenzie, Henry Oakes.\n\nH. H. IV—At O. O. Smith, Ethel Gordon, Clara Evans, James MacKenzie, Alfred McCaggart, Fred McCaggart, John Dilworth, Frank Robertson.\n\nIV—At O. O. Smith, Ethel Gordon, Willie Gordon, Anna Dilworth, Anna Sower, Arthur W., Mrs. Balintine, Wm. MacKenzie, Alex MacKenzie, John Dilworth.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWARD BROS., TRADERS, GENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL CROPS\n\nTeas, Tobacco, Coffee, Oatmeal, Sugars, Canned Goods, Cal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nLAST NOTICE.\n\nAfter the 31st December all the old firm accounts will be handed over for collection.\n\nSTEWART BROS. T. E. JACKSON\nNORTH WEST NOTES\n\nEDMONTON.\n\nFrom the Bulletin.\n\nHay is now delivered in town at $1 per bushel.\n\nMr. H. B. Cox's mill has been grinding this week.\n\nG. A. Watson is removing his law office to the big house.\n\nA police detachment for this post is on its way from Regina.\n\nThe new bakery will make its first issue of the staff in time on Wednesday.\n\nWaters are expected to be very numerous, and the fall crops generally promise to be large.\n\nIt is rumored that Blackfoot runners are among the Cree at Prince Albert, meeting them to rebellion.\n\nThe Nor-West Farmer has issued No. 4, which contains 32 pages, and does not fail to tell all trade.\n\nIt is estimated that the Militia Department accounts remaining unpaid in this district amount to nearly $12,000.\n\nHog raising is becoming an important industry in this settlement. Lately Mr. D. Ross killed 52 hogs, 32 of which averaged 150 pounds apiece dressed. He has 40 on hand yet.\n\nMr. S. Robertson returned on Sunday evening with his strayed team of horses. They were found near Battle river, at the outlet of the Crooked lake.\n\nQU'APPELLE.\n\nFrom the Valdez.\n\nSt. John's church will be consecrated on St. John's day, Sunday, the 29th.\n\nThe first real cold dip passed over this district the beginning of this week—thermometer down to 15° below, it is said.\n\nMr. R. Stephenson has been in operation on his newly purchased land and cattle company's lands during the past week.\n\nThe flour mill is giving universal satisfaction; but, unfortunately, they have had to shut down owing to the bursting of a boiler. It is being repaired, and will be running in order in a few days.\n\nMrs. French's claim has been passed by the commission. She will receive a grant of about $1,000 and an annual allowance of about $50, and the children will be provided for until they are 16 and 21 respectively.\n\nCALGARY.\n\nFrom the Herald.\n\nWe understand that a project for a public school is to be erected on the Government site, has been set on foot, and that considerable donations have been already made towards it.\n\nThe sale of town lots on the Government site is still going on very steadily. Up to this date 80 double lots (5x10) have been disposed of at an average price of $75. We hear that the Government have notified the Corporation that they are ready to transfer to the town that part of the site along the street through in the western boundary of the section, to be held in trust as a park reserve.\n\nA prominent Hamilton firm, whose name is withheld for the present, is thinking of opening a hardware store and agricultural implement manufacturing in Calgary presently. We extend a hearty welcome to the newcomers, and believe they will have an excellent field here.\n\nTHOS. POWERS,\n\nIN PROVINCIAL CONTRACTS\n\nBrick, Plastering and Stone Work\n\nAffordable prices guaranteed.\n\nBrick and Lime always on hand.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter\n\nDecorative Painting a Specialty\n\nLINCOLN COLLEGE\n\nWilliam Knox,\n\nCarpenter, Etc.\n\nOffice and Workshop\n\nNear Presbyterian Church.\n\nSTRAYED!\n\nBLACK MARE COLT.\n\nOwner can have same by proving property and paying expenses.\n\nROGERS BROS.\n\nSTRAYED!\n\nOwner can have same by proving property and paying expenses.\n\nJAMES SINCLAIR,\n\nMerchant Tailor,\n\nGENTS' FURNISHINGS.\n\nNOTICE.\n\nA STRAY YEARLING HEIFER.\n\nBlack heifer, left ear cut short.\n\nOwner can get same by proving property and paying expenses.\n\nCHAS. ADAMS,\n\nRed Deer Hill.\n\nNOV. 8, 1885.\n\nPUBLIC NOTICE.\n\nPublic notice is hereby given that, pursuant to an order of His Honour the Lieutenant Governor, the following appointments have been made:\n\nEvery appointment hereinbefore made of Justices of the Peace, in and for the County of Prince Albert, to take effect on the 1st day of January next, except such Justices of the Peace as are the members of the Legislative Assembly of the Province of Saskatchewan and Alberta, and members of their respective Provincial Governments, and members of the Executive Council of the Province, except as otherwise provided by the Constitution Act, 1867, and the Constitution Act, 1870.\n\nBy Command,\n\nA. E. Forget,\n\nClerk of Council and Secretary to the Lieutenant Governor.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Premiums and Grand Prize Scheme.\n\nOver $1,400 worth of handsome prizes to be given away.\n\n100 Splendid Prizes.\n\nBalance of 1885 FREE. Only $2 to 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nAt no former period in the history of the Manitoba Weekly Free Press have the publications made such an appeal to the people of the province for so large a number of subscribers as at the present time. The demand for the newspapers is unprecedented, and every year improvement will be introduced wherever possible.\n\nThe Nor-West Farmer is doing more than ever before to promote the interests and welfare of the settlers in the North-West. It is the only newspaper that gives the people of the Canadian North-West a voice in the councils of the Dominion government.\n\nHelp Along the Good Work.\n\nBy SUBSCRIBING TO THE FREE PRESS.\n\nONLY $1 A YEAR.\n\nThe Nor-West Farmer is doing more than ever before to promote the interests and welfare of the settlers in the North-West. It is the only newspaper that gives the people of the Canadian North-West a voice in the councils of the Dominion government.\n\nHOW TO SUBSCRIBE.\n\nEnclose Two Dollars in registered letter (writing name and postoffice very plainly) and address to\n\nFREE PRESS, WINNIPEG, MAN.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOttawa invitations done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nComplimentary Supper\n\nTo H. Pearce, Esq., D.L.C.\n\nEvery pleasant and enjoyable time was spent Thursday evening at the Complimentary Supper given by Mr. Pearce, Esq., to Messrs. Stewart, Brown and Betts.\n\nAbout thirty sat down in the saloon, among whom were—Colonel Spratt, Brown and Betts, J. Stewart, W. V. Maclean, D. Maclean, Capt. S. Baker, Capt. J. M. Clark, Capt. Henry, Capt. G. S. Davison, T. N. Campbell, G. D. Northgate, Geo. McLeod, D. J. Waggner, Capt. J. S. Clark, J. J. Montgomery, J. G. Parker, A. McNab, W. J. Barker, S. McNab, Capt. J. M. Clark, L. B. R. Gordon, J. C. Maclean, O. Davis, J. F. Stall and others.\n\nThe chair was occupied by Mr. Miller, President of the Local Agricultural Society, and to his right sat Mr. Pearce, the guest of the evening.\n\nThe vice-chair was occupied by Col. Spratt.\n\nAfter all had partaken of the above, a good deal of the evening was spent in letters of apology from Messrs. Belanger, Kennedy, Agnew and Spencer, regretting their inability to be present.\n\nThe Chairman then proposed—\"The Queen and Royal Family,\" which was duly honoured.\n\nThe next toast proposed was the \"Governor General and Lieutenant Governor,\" which was loudly cheered.\n\nMr. J. M. Johnson sang a song, which was most appreciated.\n\nThe Army, Navy and Volunteers were then proposed, and was ably responded to by Mr. J. Stewart.\n\nThe Chairman then proposed—\"Our Land,\" and in doing so spoke in very flattering terms of the present efficient and worthy officials. These sentiments were concurred in by Col. Spratt and Capt. Henry.\n\nMr. Pearce, on rising, was loudly cheered. He thanked them for their very kind attention, saying they had been most kind and that on several occasions he wished he was an orator. When he accepted the toast he would be present under one condition that he could do no speaking.\n\nHe thanked the Agricultural Society for the very kind reception they had given him, and said he always took a great interest in agricultural matters, being the son of a farmer, and would ever be interested in anything that spoke of meeting the Agricultural Society again in future, and said he hoped they would then be more successful than they had been before.\n\nIn regard to the Prince Albert Volunteers, he said he would carry his vote for them to the last. He was the Hon. Mr. Watts, and how happily pleased he was with the reception he had received from the citizens of Prince Albert. He thought Mr. White was the right man in the right place. In speaking of Mr. White's position, Mr. David Maclean said he was a hard worker and a well wisher of the Dominion, especially the North West and had given up his health for the benefit of all health. He considered himself an outsider in this country, having spent eight winters in the North West, and the last four years he was connected with the Land Board. He then alluded to his own position, saying he was in pleasing circumstances under which he first met the worthy chairman. He referred to Mr. Maclean and the late chairman of the North West Land Com- mission, and said that the delay in the settlement of the land question was owing to the ill health of this gentleman.\n\nAfter a very neat and pleasing speech, which he thought was longer than it ought to have been, he took his leave, amidst a round of cheers.\n\nCol. Spratt, vice-chairman, proposed the prosperity of the Town of Prince Albert, coupled with the names of Commissaries Betts, Brown and Beaudette.\n\nMr. T. Parker sang \"Home of Oak\" in his usual song style.\n\nMr. J. Stewart proposed the \"Bay,\" which was very neatly responded to by Mr. Maclean.\n\n\"Agriculture and Commerce\" was proposed by Spratt, coupled with the names of Messrs. Waggner, Craig, Stewart and Betts.\n\nMr. W. J. Barker then sang \"The Old Man's Prayer,\" which was very well received.\n\nMr. J. L. Johnson, being called upon, made a short but real speech, which was followed by a song from Mr. D. J. Waggner.\n\n\"The Ladies\" was next proposed, coupled with the names of Messrs. Wilson, Campbell and Clark.\n\nThe next toast proposed was \"The President of the Local Agricultural Society,\" to whom Mr. Miller ably replied.\n\n\"The Volunteer Corps,\" which was next proposed, coupled with the names of Messrs. Rao, Dock, Schmidt and Montgomerie.\n\nThe last toast proposed was our \"Absent Friends,\" coupled with the names of Hon. L. Clark, Capt. Moore and Capt. Henry.\n\nAfter singing \"Auld Lang Syne,\" all bid Mr. Pearce farewell, who then took his departure.\n\nDRAMATIC ENTERTAINMENT.\n\nThe Dramatic Club entertainment by the North West Mounted Police took place in the saloon, and was very amusing, lasting on Friday evening, and was largely attended, there being about 150 present.\n\nThe stage was very simply fitted out and appropriately decorated with flags and evergreens. The stage was divided into two parts, the first part consisting of the part of the Prince Albert Concert Band, and was well received.\n\nThe second part of the programme consisted of a force proposed by \"Raising the Wires.\" This part of the entertainment was very separately very interesting, and was well received.\n\nAll the characters were well known, particularly Peggy (father), Mrs. Peggy (mother), Jerry (son), Peggy's lover, by Capt. Niven, Savas, a Yorkshireman, by Com. W. James, and the rest by Messrs. Craig, Maclean, Com. T. G. O'Brien.\n\nThe entertainment was most agreeable, and as it is the custom of the Dramatic Club to give a series of entertainments during the winter months, we have no doubt they will continue to give such entertainments, but we are glad to know that Capt. Perry has moved out the law to the contrary.\n\nWe are assured that in the future proper precaution will be taken so that such occurrences will not again take place.\n\nTOWN COUNCIL.\n\nThe Council met at Mr. Newland's office on Monday evening.\n\nPresent Comms. Brown, Betts and Beaudette.\n\nConn. Brown in the chair.\n\nThe minutes of last meeting were read.\n\nThe by-laws to regulate proceedings in the Council and the committee thereof were read a second time.\n\nThe Council then resolved itself into the Committee of the whole to consider the by-laws.\n\nConn. Beaudette in the chair.\n\nThe by-laws were read clause by clause.\n\nMoved by Conn. Beatty, seconded by Conn. Brown, that committee rise to report. Carried.\n\nConn. Beatty reported that clause 33 did not apply.\n\nMoved by Conn. Beaudette, seconded by Conn. Beatty, that by law be read clause by clause.\n\nConn. Beatty in the chair.\n\nMoved by Conn. Beaudette, seconded by Conn. Beatty, that by law be read clause by clause.\n\nConn. Beatty in the chair.\n\nMoved by Conn. Beaudette, seconded by Conn. Beatty, that Conn. Brown be appointed to go abroad to secure the services of a special constable for certain days.\n\nCouncil adjourned, to meet on Mon. day, 29th inst.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF Domestic and Imported Cigars.\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlur de Bonitos,\nCreme de la Creme,\nBelle Cuba,\nHenry Clays and Wagners\n\nALL CHOICE GOODS AND SEASONED.\n\nBETTS & GWYNNE.\n\nExamine Our Stock of Xmas Confectionery and Biscuits.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine, Plastering Hair, steam refined Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOUNTINGS—PICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended.\n\nPrince Albert — N.W.T.\n\nWAR DECLARED!\n\nW. C. RAMSAY\n\nEAST END.\n\nBREAD unsupervised by any west of Winnipeg.\n\nBlends of Cake and Paste made to order.\n\nHugh McDougall,\n\nEast End Bakery.\n\nALEX. LANG\n\nGENERAL BLACKSMITH\n\nHandy shop at the east end, directly opposite the Post Office, near the Hardware and General Merchants' yard door and shop.\n\nAll kinds of Blacksmith Work required and paid for.\n\nAlex. Lang,\n\nPrince Albert.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885122501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 6823, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4195, 1], [4195, 13889, 2], [13889, 19743, 3], [19743, 27735, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]