[{"id": "7e6369fbdc5d471cf911219e492f469d32c6884a", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 17th, 1884.\n\n$2 50 A YEAR.\n\nBANKINGHOUSE\nOF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nConducted by Messrs. Macarthur & Knowles.\nTelephone - Telegram Office.\nMr. Knowles, Manager.\nMr. Macarthur, Bank Secretary.\nAddress - Prince Albert, N.W.T.\n\nTELEGRAPHIC.\nBy Special Telegraphic Cable.\nMayday, Oct. 17. - A terrible dynamite explosion occurred at the Quebec parliament buildings on the 16th inst., while the workmen were at dinner. The explosion caused considerable damage to the building; and it appears that the explosion was caused by stray bullets from a 2-pounder cannon. The cause of the explosion is unknown, but it is believed to be connected with the recent revolution in Quebec. We understand that the explosion was caused by a bomb planted in the building, and that it was not caused by any other means. The explosion was heard throughout all parts of Quebec, and it is feared that it may have caused injuries to some of the bystanders. The explosion has caused great consternation among the inhabitants of Quebec, who are now on the alert for any further outbreaks.\n\nORDER IN COUNCIL.\nGOVERNMENT HOUSE, OTTAWA.\nMonday, the 15th day of September, 1884.\nHIS EXCELLENCY THE GOVERNOR-\nGENERAL IN COUNCIL.\n\nWHEREAS the disease of pesteux ponans - mange in swine has become prevalent throughout the Western cities of Illinois as well as in many Eastern cities of the United States, and whereas the disease is communicable from swine to swine as well as to man, and whereas the disease is highly dangerous to the health and welfare of the people of these states, it is hereby ordered that the importation of swine into the United States for sale shall be prohibited effective immediately.\n\nAt Scioto, Indiana, on the 3rd day of October, 1884.\n\nTENDERS FOR FLOUR.\nMcManus and Sons, March 1st, 1885.\nAt BATTLEFORD, March 1st, 1885.\nAt PCH PADDY, March 1st, 1885.\nAt CARLTON, December 1st, 1884.\nShould tender be required before date expressed above, the same will be given under such conditions as may be made.\n\nPESTUOUS MANGE: THE DISEASE OF THE NORTH WEST TERRITORIES.\nBy the Honourable Mr. Secretary, Minister of Agriculture.\n\nCanada has recently been visited by a disease known as \"pesteux ponans\" or mange. This disease attacks swine and causes them to suffer greatly. In order to prevent its spread, it is now being demanded by the public that swine be killed when they show signs of this disease. It is now being demanded by the public that swine be killed when they show signs of this disease.\n\nWe have been informed it is likely that the Government will shortly announce its intention of making our farmers with sheep and animals carry these laws. In pursuance of this, we propose to commence an appeal against the claim for these animals, and set out in search of justice with which he was charged upon that occasion.\n\nThe French were defeated at Tannen on November 20th, 1871.\n\nThe Madallas officials appear to be convinced that the crisis is ended.\n\nThe scheme proposed by Sir David Macdonald is to be given preference in North-West Territory has been sanctioned and approved by the Cabinet, the only fee required being ten cents per acre cover every thirty acres.\n\nWITH THE PROGRESS OF THE MADALERS.\nJOHN J. MCUIRIE, Private Secretary.\nJOHN W. MCADAM, Deputy Private Secretary.\n\nCHIT-CHAT LOCALS.\nCHIT-CHAT LOCALS.\n\nGathered by your Reporters.\nJ. L. Johnson & Co. have just received a stock of hardware; also a full line of plates and cutlery.\nFor Sale - A strong, serviceable cutter sharpener; will exchange for a pair.\nAPPLY AT THIS OFFICE.\nOn Thursday and Friday next the Royal Canadian Mounted Police will bring their snow-shoes, guns in private entry.\nEntries will be accepted on Monday next, at 1 pm, by mail.\nMr. E. F. FUGERET.\nIndian Agent, Carleton, N.W.T.\nTEL. No. 123.\nWe lay the attention of the public to this fact that our funds are being shown as soon as possible, and as they are now opened up, the disposable accounts will be transferred to the new accounts, so as to complete any unfinished business at this moment. We cannot prevent the sale of any property which has been disposed of, but we can assure you that with proper precautions the sale will proceed with the utmost dispatch.\n\nNOTICE.\n\nPOLICE NEWS.\nCOMMISSIONER WHITE, Major Cromer and Mr. Macdonald of the Royal Canadian Mounted Police. The Commissioner has been transferred from Battleford to Regina, and has left Battleford on Tuesday last.\nMr. Macdonald, accompanying the Commissioner White, has left for Regina on Wednesday morning in the train which leaves Battleford at 9 o'clock.\nWe have just received intelligence that the Commissioners were here on Tuesday morning. We have also heard that the Commissioner's wife and children were here on Saturday afternoon, and that they were returning to Regina yesterday morning.\nMajor Cromer's residence has been transferred to Regina. We have also received information that Mr. Macdonald is still living at Battleford.\nThe Polices' quarters will be removed to the large block building in the east end of the town, which is undergoing extensive repairs. Large stables are in course of erection, and the officer's building has been taken off Commissioner Cromer's store at hospital.\nNotice: You are hereby informed that the new stables will be completed within twenty-four hours.\nCOMMISSIONER WHITE, Major Cromer and Mr. Macdonald of the Royal Canadian Mounted Police. The Commissioner has been transferred from Battleford to Regina, and has left Battleford on Tuesday last.\nMr. Macdonald, accompanying the Commissioner White, has left for Regina on Wednesday morning in the train which leaves Battleford at 9 o'clock.\nWe have just received intelligence that the Commissioners were here on Tuesday morning. We have also heard that the Commissioner's wife and children were here on Saturday afternoon, and that they were returning to Regina yesterday morning.\nMajor Cromer's residence has been transferred to Regina. We have also received information that Mr. Macdonald is still living at Battleford.\nThe Polices' quarters will be removed to the large block building in the east end of the town, which is undergoing extensive repairs. Large stables are in course of erection, and the officer's building has been taken off Commissioner Cromer's store at hospital.\nCommissioner McDonald has moved his office to Regina.\nFRIDAY, OCTOBER 17, 1884.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETY\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, OCTOBER 17, 1884.\n\nKUL VIX.\n\nThe time is nearly approaching when we fear that it will prove equally idle and suicidal to attempt concealment of the evil days which have fallen upon our district, but we can do nothing advantageously in this topic until much more exact information, to be gathered from the output of the threshing mills and other sources, shall have put us in a position to do something more than merely to wait and to groan at adversity. What we desire to make plain at the present stage of events, is the folly of refusing to acknowledge the true state of things, even in the event of their turning out to be highly unfavorable to us. Owing to the amount of competition and rivalry in the matter of securing immigration, which naturally exists between the widely separated points of the Territories where the most promising fields of enterprise have already formed, there has arisen a sort of spasmodic sentiment, which stigmatizes as dishonorable or undesirable the utmost exertion with regard to any particular locality if it be unfavorable to it, by any of its residents. There does no doubt under certain circumstances exist an appreciable difference in the immediate effect of a suppression of the truth and a deliberate assertion of a falsehood, but after all that difference is one of degree rather than of kind. It has always been, as we have often stated our own desire, to avoid the appearance by burying in the verge of falsehood exaggeration with regard to the capabilities of our own neighborhood to enticing settlers of rose-colored prospects doomed to be disappointed and to add that the merits of this moderation is much lessened by the fact of our conviction that the statement of the naked truth with regard to our vicinity would offer such an alternative as may serve as the least degree likely to prove a profitable addition to our community. Should the result of this year's harvest unhappily render it necessary to go to the field to rake up some mention, we are glad to feel that we will be spared the unpleasant dish served up to those who have to eat their own words, nor shall anything inherent in the nature of false hopes fall into that of suppression of the truth. To put aside the question of morality, and apply the standard of expediency, it still seems to us that the adage \"honesty is the best policy\" meets the case in our present circumstances. It must seem only natural to reasonable minds to expect occasional reverses even in places where the general conditions are like our own exceptionally favorable, and, therefore, the slightest suspicion of such as might naturally occur, can only serve to excite suspicion. Should we have at last to chronicle a year of failure, that fact instead of detracting from the desirability of our district, as a place of settlement by farmers, can only be most favorably contrasted with the sufferings and misfortunes known to the whole world, which have happened repeatedly within the time that we have spent in this country, and almost every part of our country is now suffering from railway communications, and the consequent cost of conveying flour and grain for seed to this place if necessary will make the failure of our crops a matter of serious concern, and to have a significance which really in no way bears upon the capacities of our country. Just as we attempted to explain in our last statement, we believe that this should be accepted as depending upon the general prosperity of a community after an exhaustive examination of all attendant circumstances, so must the relation of the condition of the community to the peculiar local capabilities and resources of any district, be used for decision. Therefore, it can be clearly demonstrated that our natural advantages are so great, that only the mistakes of the farmers themselves have left them without comfortable reserves against the inevitable rainy days, then it becomes due to the honesty to expose these errors. We trust in view of this that we should be under the necessity of taking this course, and that the judge has acted in the spirit of John's comforters, or trying to aid wisdom which always comes so easily after the event.\n\nAUCTION SALE.\nOf Valuable Town Property.\n\nNEW SPRING AND SUMMER MILLINERY.\nAND FANCY GOODS.\n\nMISS MACK & CO.,\nAT THE SHERRIFF'S OFFICE, PRINCE ALBERT.\n\nPUBLIC AUCTION,\nON WEDNESDAY, THE 22ND INST.,\nAT THE SHERRIFF'S OFFICE, PRINCE ALBERT.\n\nFURNITURE.\nFancy Parlor and Bedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions.\nBradles & Cribs for the Babies.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\nEAST END BAKERY.\n\nBREAD unsurpassed by any west of Winnipeg.\nNINE Loaves for $1\nAll kinds of Cake and Pastry Made.\n\nHUGH MCDougall,\nEast End Bakery.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nPUMP ON WATER.\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN,\nPrince Albert.\n\nNOTICE.\nI beg to notify my customers and the public generally that I have REMOVED my stock to \"TRESFON HOUSE,\" and have now on hand a full line of Hardware, Stoves and Stovepipes, at greatly reduced figures. All overdue accounts are now closed.\n\nT. J. AGNEW.\nFIRST CASE BY EXPRESS.\n\nBUY YOUR HARVEST TOOLS AT\nJ. L. JOHNSON & CO.\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Saths, and Grain Cradles.\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\nT. N. CAMPBELL,\nBookseller and Stationer\nJUST RECEIVED A LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\n$25 TO $50 PER DAY!\nVictor Well Boring & Rock Drilling Machinery,\nCan easily be made using the OLD RELIABLE\nWe make it not only superior to the best, but the WELL MUFFLER, which has covered our efforts during the last fifteen years, and with EXCELLENT RESULTS, we are MONARCH OF ALL in every country in the world. Our Machine is operated by either Man, Horse or Steam, and works very rapidly. They range in sizes from 3 Inch to 4 Feet in Diameter and will bore and drill ANY REQUIRED DEPTH. They will bore successfully and satisfactorily in all kinds of Earth, soft Sand and Limestone. Britannia Rock Drills are also furnished, and guaranteed to make the very best of Wells in Quick Speed. They are light, portable, easy to handle, and will bore through any rock, and are the best and most practical Machine ever made. They are endorsed by the highest authorities. They are also extensively used in prospecting for Coal, Gold, Silver, Quartz and all kinds of Minerals.\n\nAnd for such purposes as are mentioned above, we also furnish Engines, Boilers, Wind Mills, Hydraulic Lamps, Hose Povess, Brick Making Tools, Portable Forges, Rock Drills and Machinery of all kinds.\n\nGrand Advertiser throughout the Western and Eastern Worlds.\n\nAddress, VICTOR WELL AUGER & MACHINE CO., 341 Pine Street, ST. LOUIS, MISSOURI, U.S.A.\n\nBuffalo Hall!\nHosiery, Goves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCOS.\nPrince of Wales and Gold Flake Chewings, Myrtle Navy, Golden Pole and Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\nHARDWARE!\n\n1879.\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the errors committed by correspondents.\n\nEXPLANATION.\n\nTo the Editor of The Times\n\nSir.—I beg you will kindly insert these few lines in your paper. I am very sorry to have the story go about among the public that a stolen cow was found in my possession and that the law had me called in to make up damages.\n\nThe truth of the matter is that I bought a cow about three weeks ago from Mr. Carter, and paid him his usual price (45¢ in cash), which I considered was fair value for an animal of its size. I held the cow until June. The cow was steady through the summer, and every pasture along the road could be seen being milked, and I may say the produce was excellent. I must say regret that I cannot at any real distance, although I recognize the name Carter, but I could not find Mr. Carter or his wife, who was the servant of Mr. A. Kennedy in said and said the cow was her property. As he could not produce any authority from Mrs. Kennedy, nor any evidence of her owning the cow, I refused to let her take the beast, as I thought that if I gave it up to her, she would be liable to be charged with theft. I could not ask Mr. Carter to refund my money. However, I thought it best to try to get the cow back, so that I could give it up myself, and be glad to get it off my hands, if Mrs. Kennedy would look at it herself, and claim it. I thought by this course of conduct that I was justified in keeping it until it was identified by the owner or some one who knew it. Next day I saw it was served with a writ, and the cow taken by the deputy sheriff. This, for all I know, may be law but it is not justifiable, and the treatment of a civilized person by another.\n\nJAMES WHITE.\n\n[We quite sympathize with Mr. White's annoyance at having an animal taken away from him without his having been served with a warrant, but believe he has acted within the natural bounds of his rights.]\n\nFourth Judicial District Court\n\nDIVISION NO. 2.\n\nNotice is hereby given that sitting of the Court will be held at Prince Albert, on Monday, November 3rd, 1884, at 10 o'clock a.m., all parties interested are respectfully invited to attend the proceedings accordingly. By order of the Honorable Magistrate.\n\nJAMES FINLAYSON,\n\nJudge of the Court.\n\nPrince Albert, Aug. 15th, 1884.\n\nWATCHES, CLOCKS, JEWELLERY.\n\nR. B. WAY,\n\nPost Office, Prince Albert, N.W.T.\n\nTHE GABLE HOUSE.\n\nThe best Caron & Pigeon Hole Tables in the Territory.\n\nJOHN WYNNERICH, PROP.\n\nMEDICINE HAT.\n\nThe steamer which was washed away by a sudden rise of the river has been found up stream and placed in its old position.\n\nThe members of the Mark Hall Church held a concert in the church the other evening, clear of charge.\n\nThe Royal Route.\n\nPassengers over the Royal Route have all the advantages of the regular trains. Palace Dining cars, Imperial Sleeping Rooms, Buffet cars, and express cars, and high-class service. No charge for baggage from Winnipeg to Chicago, with no change of car fare. Mail and baggage also on change of cars. Rates to Chicago, Kansas City, and St. Louis.\n\nDecorative Painting & Specialty.\n\nROYAL ROUTE.\n\nT. W. TRAVIS, Agent.\n\nThe best Caron & Pigeon Hole Tables in the Territory.\n\nJOHN WYNNERICH, PROP.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nThe PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, - PROPS,\nPUMPS & PHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO\n\nWILLIAM CROSS,\n\nROBRT THOMSON,\n\nSign & Ornamental Painter,\n\nChester Thompson,\n\nGeneral Blacksmith,\n\nRepairing Farm Machinery & Specialties.\n**SHEEP**\n\nAbout the middle of July, the first flock of sheep was received by the district agent, at a country post between here having been started by Mr. Steel, from a point where they had crossed the river of about 100 miles south of this place. The number of sheep in the course of this time was nearly 3,000, being the total in the vicinity of 600 in the last six weeks. The only other lambing which extended in a heavy storm of rain three days before planting out on the plains north of the fifth day, during which several head of cattle were killed. Between the third and seventh Creek was within a short distance of all the mountains, and the quartz floor of the creek was high above the mountain side.\n\nMr. Steel, though he did not lose his load of sheep, but obtained them back at the end of six weeks, when the snows came down again, has returned to his own district. The sheep which were brought in from Mr. Steel's district were, mostly, of native breed, and the number was not as large as usual.\n\nMr. Steel, who had been among the herdsmen since the spring, but very late in the season, has since returned to his own district.\n\n**THOS. POWERS**\n\n**TENDERS WANTED**\n\nFOR\n\n**STOCK AND BOOK-DERTS**\n\nESTATE OF J. O. DAVIS & CO.\n\nThe Stock amounts to about... $6,000\n\nThe Book Debts amount to about... $2,300\n\nTencents in writing will be received by the undersigned not until the 31st inst. before above.\n\nParties making other than a CASH offer will please state security.\n\nThe highest or any tender not necessarily accepted.\n\n**PHILP THOMAS**\n\nAGENT FOR\n\nRobert Dunn, Trustee.\n\nPrince Albert, Oct. 15th, 1884.\n\n**NEW GOODS !**\n\n**MEDICAL HALL**\n\nBurdock Blood Bitters,\n\nBurdock Heating Ointment,\n\nBurdock Pills,\n\nVictoria Hypophosphates,\n\nVictor's Bucha and Uva Ursi,\n\nFreeman's Worm Powder.\n\nYellow Ol.\n\n**T. R. JACKSON**\n\nAT THE OLD STABLE,\n\nCONSUMPTION\n\nPositively Cured,\n\nAll sufferers from this disease that are disposed to take any kind of help before adopting this plan will be deemed to have waived their claim upon the proprietors that will make them passengers by sea for free passage to any port where they may desire to live, and will be allowed to return in two or three months after.\n\n**PRICES TO SUIT THE TIMES**\n\n**J. M. CAMPBELL**\n\n**LUMBER, SHUTTERS, DOORS, SASH, MOULDINGS,** etc., etc.\n\n**BUILDING MATERIAL**\n\nfor sale at lowest prices. We are now selling:\n\nBankrupt Stocks for CASH\n\nSend for prices. No trouble seeking prices. Parties making large purchases to sell again will receive special prices.\n\n**DAVIS AND CO.**\n\nWholesale Lumber Dealers,\n\nHead Office—100 Main Street Yorkton Street, C. P. R. siding.\n\n**THE WEEK**\n\n**THE WEST END HOUSE**\n\n**Bankrupt Stocks for CASH**\n\nSend for prices. No trouble seeking prices. Parties making large purchases to sell again will receive special prices.\n\nR. J. O'REARY\n\nProprietor.\n\n**GOODFELLOW BROS.**\n\nPropr.\n\nPrince Albert, N. W. T.\n\n**PRINCE ALBERT**\n\nEating Mills and Sawmills.\n\n**ASH & ROBBINS**\n\n300 Prince Street.\n\n**C. D. NOONE**\n\nJeweller.\n\n**PRINCE ALBERT**\n\nNew Post Office opened.\n\n**THOS. POWERS**\n\n**INFORMATION Wanted**\n\n**TRACTORS**\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. All materials furnished.\n\n**HORSE SHOE STORE**\n\nNEAR THE BANK.\n\nSpecial Prices in Collins, Clothing and Underwear.\n\nFine lot ot Overcoats at Cost.\n\nN. R. I. have a large stock of Ladies and Girls Linen Kid Mitts and Gloves that I am selling at net cost.\n\nGive me a call, there's trouble at the shop.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884101701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5356, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6447, 1], [6447, 14050, 2], [14050, 18412, 3], [18412, 21905, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]