[{"id": "98b98818ae19029a32e3de02eb09a8339c6cc595", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nThis paper may be issued by anyone who desires.\n\nThis is a weekly newspaper, and will continue every week until further notice.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n\nThe Mission Chapel.\n\nThe following services will take place in St. Mary's Church:\n\n10:30 a.m. - Morning Service in both Churches and at the Mission Chapel.\n\n5:30 p.m. - Evening Service.\n\nST. CATHERINES.\nMt. Dominic's.\n\n3 p.m. - Mt. Dominic's Church, Mt. Dominic's.\n\n10:30 a.m. - Mt. Dominic's Church.\n\nSt. John's Church.\n\n3 p.m. - Mt. Dominic's Church.\n\nSt. James's Church.\n\n3 p.m. - Mt. Dominic's Church.\n\nMount Albert Church.\n\n6 p.m. - Mt. Dominic's Church.\n\nFRIDAY, SEPT. 3, 1886.\n\nFICTION.\n\nAs most people have a taste for fiction in these degenerate days, we will, with your permission, gentle readers, give a brief chapter from a recent speech of the Hon. Mr. Mercer on the election of the House of Commons. We are aware that Mr. Mercer is a writer of fiction, but he can utter fiction with an ease and elegance only equaled, if fanged, by Mr. Mercer, and if he has the luck to see his prose, he will be forced to broken form he will hang quite an extensive work of fiction to hang his name down to posterity. But while Mr. Mercer excels in fiction, he excels in truth, which is the most necessary to disturb his peculiar turn of mind-in the pathetic, and we have no doubt many hot tears must have trickled down the cheeks of the French habitants whom he has both in his letters addressed to the churches and Chambly during the last few weeks. Yes, see that he excels in fiction, and it is because of our fear that strong minds may grow weak and forget who they are as we are suddenly plunged into a dark denseness that we have taken this somewhat tedious way of bringing this wonderful full part of fiction to your notice.\n\nThe evening service in the chapter is Bateher, and the author or whatever else you may call them our neighbours the Mets, and a Cockney, and is intended to illus- trate how the religion was brought about.\n\nA young Cockney brought from Eng., land came along, with two or three hairs of hair and a child or two to the un- tame Metes. \"Nice people,\" said Mr. Cockney, \"but you are my property, and you must be good enough to get out.\"\n\n\"Hello, who are you?\" says the Matso.\n\n\"I am an Irishman and a person from London, the son of a lord, or a noble- man of the House of Commons, or a big boy of some sort, and my father has purchased this land from the Canadian Govern-\n\nment.\"\n\n\"My boy, you come at me,\" replies the half-breed. \"This is my farm, my children were raised here and I was raised here myself, and I intend to re-\n\nmain here.\"\n\n\"But I told you you must go out.\"\n\n\"I'm there a man in this meeting who won't get sick of doing that? Put up arms, it will do the trick.\"\n\nAnd whilst he speaks, the stranger comes to take it away from him by means of a sword and pistol the latter, nor can be expected upon the Canadian soil, and not to feel his heart being broken in two pieces.\"\n\nHere a loud cheer. \"No wonder if they would fly to arise, for if there be anything in this world calculated to make a man put up to fighting pitch, it is the appearance of a Cockney with a sword and pistol in his hand.\"\n\nBut the Cockney, like Macdonald's New Zealanders, has yet to learn that Batoche, or any other man or set of men, in the character described by Mr. Mercer, those of you, however, who are familiar with this district, are acquainted with the Lakes connected with it, will doubtless be able to ap-\n\npreciate Mr. Mercer's excellences or wonders. If you did not go to the Lakes' post, he will show himself to be utterly lacking the prime characteristic of prac-\n\ntically—for whom—there seems to be no imagination himself in another country upon which he may be at home as one other. He perhaps imagined himself at Connell, and that was not addressed the peoples of Kerry.\n\nWhat a pity that falsehood can always be made to serve the ends of the demagogue among an intelligent people.\n\nTHE HARVEST\n\nFrom the reports we have received, we are convinced that Prince Albert's crop has suffered less from the drought during the past season than any other portion of the Northwest. The yield of crops, owing to the drought, has not been as high amongst ourselves as that which, but the quality of the crops, particularly owing to the absence of frost, will compare favourably with that of any other part of the terri-\n\ntory. So much so, that some people believe it has been quite some time since Prince Albert has had such a good harvest. But suppose we must look for the reason of the small area of wheat being sown in the fact that many of the former ones were of the common kind. If it had been supplied them by the Government instead of as good quality as it should be. But whatever doubts crops are not as good as they should have been. Of our farmers more care was taken than others, gave the seed the benefit of the doubt, and the conse-\n\nquence is that they are able pay back their loan and sell a good surplus of wheat at a reasonable price. We wish the success continues, the future of the colony must therefore, not be able to repay the amount called for without selling their surplus. In any case there will be a scarcity of seed of good quality next season.\n\nWith regard to the barley and oats we cannot give as favourable a re-\n\nport. The seed barley while it may have been good, does not seem to have been marketed in sufficient quantity, and all we can say now the seed should be this. For this fact, which was caused by the drought, the effect rather barely what it would have been. But with barley, as with the\n\nwhats, though not so generally, some of the farmers were tolerably suc-\n\ncessful. The same remarks would seem to apply to oats. The yield and the quality of the oats and barley, as a whole, therefore, is not nearly as satisfactory as that of wheat, and we are not too surprised if many of the farmers would find themselves unable this year to repay the seed advanced by the government.\n\nAs to the yield of potatoes, we can safely say that there is no likelihood of a shortage.\n\nFARMING.\n\nIt will not, we trust, be considered out of place on our part if we make this suggestion regarding farming in general. To become a successful farmer a same knowledge of details, the same perseverance, is required as in any other business. Show us a successful farmer and we shall show you a patient, painstaking man. We do not say that he can control the climate. He has to take his chances with regard to that; but, he prepares to re-\n\nceive the gift in such a way as to make him, barring the natural draw-\n\nbacks, the greatest possible yield. He does not allow weeds to choke out his grain, absorb the moisture which should go towards nourishing it, and eat it as they are growing, burying them to draw out the soil and the grain to thrust through on the field for days after he cuts it. He wastes nothing, saves everything. We heard a farmer in this district who had six acres of Tynan's oats in entire de-\n\nprived, his wall, and the common consensus was that notwithstanding the drought he had a good crop off the land on which he utilized it. This shows that the location makes all the difference, as also the chance you have of a good turn for your labour. We notice that some farmers do not take proper care of their farming imple-\n\nments, but leave them unshoed, unpolished and neglected. The conse-\n\nquence is that in a short time they are cracked and rusted, and look as if they had come out of the Ark. This is to be regretted, as farming impli-\n\nments run very low. Our advice to the farmers is whatever they use to maintain let it be so done as to assure you the greatest possible reward for your labour.\n\nEDITORIAL NOTES.\n\nThe North-West Council meets on the 3d of October.\n\nThe Chicago Anarchists have been arrested.\n\nThe promoters of the Regina and Long Lake Railway expect to complete the line to Prince Albert by next fall.\n\nThe Manitoba Legislative Council, the leading Liberal papers of Canada, Montreal, and other Liberal papers of the province, declare in support of the Rider proposition.\n\nSir John saw Victoria is only the ter-\n\nminal of the C.P.R., the Canadian Pacific Railway, which covers the distance between that point and Vancouver. The mail cars of the railway will be longer than those of any other railway. What a splendid achievement!\n\nThe U.S. Congress is fast becoming a reflection of Prince Albert College has brought in a bill which provides for abating American ports against all the privileges enjoyed by Canadian non-\n\ncommercial vessels. Yet he says the S.S. has no more use for a treaty with Can-\n\nada than he has for the French Navy, as he would use it in war, whereas it is arranged both by treaty. The genera-\n\nlized American commercial interests are pressing for a wider application of the terms on which Canadian ports on the territory of the U.S., but a denial of like privileges to Canadian American ports or of some sort and to valid purchasers\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—50 Columns all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\n\nTHE WEEKLY EDITION will contain The News of the Week, Selected Miscellaneous, An Interesting Serial and Special Departments of Peculiar Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor every where.\n\nPersons intending to subscribe are requested to send their names, with the price of subscription to the office of THE MANITOBA SUN, 2d Market St. E., Winnipeg, Man.\n\nJ. SINCLAIR & CO. Canada—North West Territories.\n\nNO. 21 OF 1885.\n\nNEW GOODS JUST ARRIVED.\n\nCENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nSHIPMENTS SALE OF LANDS.\n\nBy order of the Property of the Land of Prince of Wales, the land near the Saskatchewan River, on the site of the new town, will be sold for the sum of a quarter of a million dollars on the 13th March, if the sale takes place. The land is situated between the river and the town site, and comprises about 210 acres, according to a plan of survey of the Surveyor General. The land is situated near the townsite of Prince Albert, and is now occupied by the Government Station. The contract will be made with Mr. S. M. Smith, of the Surveyor General's Office, who will make arrangements for the sale of the land. The land will be divided into lots, and each lot will be sold for a certain sum. The land is located on the banks of the Saskatchewan River, and is suitable for settlement and cultivation. The land is situated in the town of Prince Albert, and is located on the site of the new town. The land is suitable for settlement and cultivation. The land is located on the banks of the Saskatchewan River, and is situated in the town of Prince Albert.\n\nSHIPMENTS SALE OF LANDS.\n\nBy order of the Lieutenant-Governor of the Province of Manitoba, the land near the mouth of the Red River, between the town sites of Prince Albert and Beauport, will be sold for the sum of one hundred thousand dollars on the 13th March, if the sale takes place. The land is situated between the river and the town, and comprises about 400 acres. The land will be divided into lots, and each lot will be sold for a certain sum. The land is suitable for settlement and cultivation. The land is located near the townsite of Prince Albert, and is situated on the site of the new town.\n\nSHIPMENTS SALE OF LANDS.\n\nBy order of the Lieutenant-Governor of the Province of Manitoba, the land near the mouth of the Red River, between the town sites of Prince Albert and Beauport, will be sold for the sum of one hundred thousand dollars on the 13th March, if the sale takes place. The land is situated between the river and the town, and comprises about 400 acres. The land will be divided into lots, and each lot will be sold for a certain sum. The land is suitable for settlement and cultivation. The land is located near the townsite of Prince Albert, and is situated on the site of the new town.\n\nSHIPMENTS SALE OF LANDS.\n\nBy order of the Lieutenant-Governor of the Province of Manitoba, the land near the mouth of the Red River, between the town sites of Prince Albert and Beauport, will be sold for the sum of one hundred thousand dollars on the 13th March, if the sale takes place. The land is situated between the river and the town, and comprises about 400 acres. The land will be divided into lots, and each lot will be sold for a certain sum. The land is suitable for settlement and cultivation. The land is located near the townsite of Prince Albert, and is situated on the site of the new town.\nFACTS FOR THE PEOPLE.\n\nFROM THE CANADIAN HANDBOOK.\n\nThe value of Canadian goods exported in 1876 was $29,357,548; being $26,078,646 worth of goods the products of other countries. Of this amount Animals and their products yielded $20,237,704; furs, $3,088,000; minerals, $1,284,293; manufactures, $3,181,501; timber, $4,029,727; wheat, $7,806,000; miscellaneous, $557,374; total, $84,265,164. The value of cheese exported was $29,265,500. Canadian goods at the head of the list were the following:\n\nThe Canadian cattle export trade has increased from 25,337 heifers in 1877, to 143,003 in 1885; sheep, 141,187 to 335,043.\n\nTotal value of goods imported in 1885, $110,941,480. This was worth doing raw material for manufacturing purposes.\n\nThe paid up capital invested in banking on the 30th September last was $60,426,500; the value of government debt, last year, was $17,836,378.\n\nThe capital invested in manufacturing has increased from $77,094,000 in 1871, to $160,300,025 in 1881; hands employed, from 187,942 to 254,836; amount of yearly wages paid, from $1,199,092 to $1,992,092; value of raw material from $1,124,067 to $1,979,100; total value of articles manufactured in 1871, $221,617,778; in 1881, $351,675,056.\n\nThe accumulations of savings in Canada have increased from $6,000,000 in 1871, to $16,000,000 in 1881. The total amount of deposits in the Government Savings and other chartered banks was $36,108,981.\n\nThe wealth of Canada is estimated at $60,000,000,000, and the income $21,000,000,000. The average rate of interest is 4.27 per cent. The percentage of income or capital in Canada is 18.1; in the U.S., 14.3; Europe, 18.8; England, India, &c., 16.6; Australia, 22.5; one-tenth of the Crown lands of Canada as 36 an annual would more than suffice to pay the public debt.\n\nAt the end of last year Canada had 660 newspapers, 71 daily, 10 tri-weekly, 21 weekly, 463 semi-weekly, 13 monthly, and 73 bi-monthly. The percentage of income or capital in Canada is 18.1; in the U.S., 14.3; Europe, 18.8; England, India, &c., 16.6; Australia, 22.5; one-tenth of the Crown lands of Canada as 36 an annual would more than suffice to pay the public debt.\n\nThe number of pupils throughout the Dominion, in 1885, in public, high schools, 13,000; in Universities, 1,000; in private schools, 360; average attendance, 550,400; total expenditure, $1,000,000; in normal schools, $500,000; in technical schools, $250,000; furniture, $25,000,000; and 18,000 teachers were employed in the public schools.\n\nNumber of students of whom 18,000, 250,000,000; total expenditure, 2,000,000.\n\nIn 1885, 235 tons of fresh meat, 10 tons pork and beef, 115 tons preserved meats, 3,629 tons bacon and ham, 28 tons lard, 35,560 hogs' heads, 3,200 tons butter, 1,142,422 tons eggs, 1,142,422 tons eggs (sold in Canada), 11,542,422 tons eggs (sold in the U.S.), 988,825 tons flour, 621,692 hides, horns, &c., 1,758,590 poultry were exported by Canada.\n\nThe total mileage of railways in Canada is 12,275; total amount of capital all kinds held by the Government, $1,000,000; the amount of capital held by the people is up to the end of 1885, was $820,756,704. The earnings of the railways for the year ending June 30th, 1885, was $2,227,499; expenses, $2,013,012.\n\nThe total cost of the canal system (72 miles) of Canada up to 30th June, 1885, was $24,000.\n\nOf the sea-going craft which, in 1885, entered and cleared, 5,190, with a tonnage of 750,000 tons.\n\nThe sea-going vessels entered and cleared at Canadian ports in 1885 amounted to 21,644, with a tonnage of 7,644,012, and carried 294,470 tons. These vessels brought cargoes to Canada from 47,306 tons of telegraph wire in Canada, and 2,400 stations.\n\nTwo ships of war visited Canada on 30th June, 1885; one was 7,000 tons.\n\nThe lighthouse system of Canada contains 300 sea coast lights, 229 land lights, 100 river lights, with fixed lights and 17 lights. The number of light stations with fixed lights is 467, with revolving lights 10.\n\nValue of lumber exported in U.S., $9,353,736; to Canada, $57,557,581.\n\nG. W. Folster and Norman McKay, of the firm of McKay & Folster, at Kinloch River, near the latter town Asia basin, arrived in town this week and will leave for Scotland, having retired from the service.\n\nACROSTIC\n\nTOYS\nNOTIONS\nCRAYONS\nALBUMS\nMAPS\nPENS\nBOOKS\nENVELOPES\nLETTER BOOKS\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR White Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinen, etc.,\nGO TO J. M. CAMPBELL'S,\nGROCER AND DRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 10 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nCOMMUNICATIONS.\n\nSEED GRAIN.\n\nTo the Editor of The Times.\n\nSir,—It will be generally acknowledged that owing to the severe drought of the past season, grain, as a rule, will not average more than half its usual value in the market at that. The quantity now on hand, as a rule, small, and the return, also, is the same, though the former is more abundant which makes it suitable for seed next season.\n\nNow, in regard to the terms. The Government charges us one hundred per cent., for the seed, whereas they tell me that, if the public accounts against the Government bear no interest, why the Government does not charge the public one hundred per cent., and that not in an ordinary way of business, but for the sake of the people, who are treated unfairly. As far as I know, in times of distress in other British colonies, where public works have been started, the other side was treated to assist the people, so such terms were enacted. And mark you, the farmers do not urge the Government to give each pack of grain to each pack of seed, but each pack of grain took hand to give the farmers their harvest. Could it be better bargain than the Government has offered? In fact—and I speak as one of them—the farmers would never have accepted such terms had they been in a position to refuse.\n\nThe freighting of the grain was a deal done by many, and a great number of farmers were thrown into debt by the demanding of two bushels in return for one grain must necessarily fail, such a demand being unreasonable.\n\nWhen it was first suggested that the Government would supply seed for all at cost price, the farmers exclaimed: \"How generous and thoughtful of Sir John!\" But they did not know at the time how the security he was creating.\n\nLet us hope that they will yet come down a great deal on their original terms, and allow the farmers a free hand to accept bushel for bushel, and at least pay many—a myself among others—who will be obliged to sell at a loss, and will not much more than see their farms ruined.\n\nJ. B.\n\nStoney Creek, August 21st, 1886.\n\n[We do not suppose for one moment, that the Government, like Shylock, will exact the pound of flesh; at least, judging by its conduct, we may safely presume that it will, think, be grateful for the opportunity of doing so; those who cannot carry the wheat to market, or the government without distressing themselves will, we have no doubt, get an extension of time, and a little patience will overcome the heribitary, when we take into account the fact that the seed which is demanded by the farmers is worth by costs of the barley 6 cents, and oats 5 cents, and the further fact that two bushels of any other of our seed grain may not bring the price of one bushel, and the farmers do not think it reasonable. In any case the farmers must be asked to contribute towards the costs of the grain, two bushels for one. As to the writer's reflection on the generosity of Sir John, we agree with many patriots of Sir John, but not the least, in very bad taste; but we are in hopes that the government will both serve its purpose and show its own gratitude. From recent information, we are led to believe that his estimate of the yield of the wheat crop is correct, and is far below the mark, though he may be stating his own case correctly. As for the timber, we are sure that it is a free gift, we hardly think it will, and we thank further that no reasonable man would expect it.]\n\nFor the benefit of those who may not have the notice-board in the telegraph office we may state that telegrams must be sent through the telegraph offices for public business between the hours of 9 a.m. and 5 p.m., and from 7 p.m. to 9 p.m., in addition to the above hours, if a customer wishes to send a telegram outside the hours of 8 o'clock a.m. and 5 p.m., and between the hours of 8 o'clock p.m. and 9 p.m., he can do so by making arrangements with the telegraph office, and by paying in addition to the regular rate, the sum of five cents for each additional word, and the sending system, if the message has to be repeated at any station twenty-five cents additional per hour until the operator or station thereof obtains the operator beyond their regular office hours.\n\nTELEGRAPHIC.\n\nTHE VERY LATEST NEWS BY WIRE.\n\n(By Special Telegraph.)\n\nWinnipeg, Sept. 3rd.—Captain Fritschler arrived at Winnipeg today, en route to discover the North Pole.\n\nPangnirtung, Sept. 3rd.—News of Captain Fritschler's discovery of the North Pole, has just arrived.\n\nThere have been important changes made in the cabinet of Manitoba province. The number of cabinet ministers has been increased from five to six by the creation of a portfolio of Ready Money. The new minister has been taken by the Hon. John Morneau, who gave up the Provincial Treasurer to the position. The new Provincial Agricultural Secretary has been appointed, whose admission to the cabinet has long been anticipated. Mr. William Hamilton Gibson, the latter becoming Minister of Public Works and the former Provincial Secretary.\n\nHamilton remains Attorney General.\n\nAn excursion party leaves Winnipeg for Victoria, Sept. 4th.\n\nSir Charles Dilke recently passed through here under a cloud of favour of Beach.\n\nGladstone's pamphlet on the Irish question has been issued, and has joined the loud Government schemes of a new Ministry.\n\nThe building magazine belonging to the Latin Powder Co., Chicago, was struck by lightning yesterday. The building was destroyed instantly, the fire quickly spread and twenty-five others more or less injured.\n\nThree of the Bulgarian Ministers connected with the deposition of Alexander have been sentenced to imprisonment for life.\n\nIt is understood the Quebec elections will be held on the 27th Sept.\n\nSir Wilfrid Laurier.\n\nMr. Laurier, Mr. Blake and Messrs. Macdonalds large gathering of Liberals in Ottawa on Monday night.\n\nMr. Laurier, Mr. Blake and Mr. Macdonald were given a reception by the Conservative and adherents were invited to join them. Mr. Laurier said that he had returned to politics, and if he had to remain in politics another year he would do so again.\n\nEgan was presented Monday with a watch by the Boarded Tradesmen's Association. Later Mr. Egan and Mr. Macdonald gave him a purse of ten dollars and a gold watch.\n\nEgan left today for the west.\n\nVan Horne going to St. Paul at the request of the Canadian Pacific.\n\nSir Charles Dilke, who has been travelling through Montana and the North-west under the name Macdonald, went under the name Falstaff, in order to avoid the Press crowd, which followed A. Smith.\n\nMcKinnon is not to become the Superintendent of the western division of the Canadian Pacific Railway. The position has been accepted by William Porter, president of the eastern division.\n\nA shock of earthquake we felt yesterday throughout the United States. No damage was done to their houses, etc., but no damage done.\n\nThe Canadian Pacific has made a successful test of Canadian mail.\n\nTremors were felt in Idaho, Montana, Wallace Ross and Bank in the interior, and sailing ships in England to-day.\n\nThe weather will be fine today Beach and Turner. Great excitement.\n\nAt Moravia—Are you interested in the purchase of property by a child? If so, you should read the following article by Mrs. Windham's Soothing Scent, which is now being advertised in newspapers throughout the world. Price $1.00. Address Mrs. Windham's Soothing Scent, 10 Wall Street, New York City, and take an order.\n\nHARDWARE.\n\nAMMUNITION!\n\nSHOT,\n\nALL SIZES OF\n\nSHELLS and\n\nWADS.\n\nDupont's Celebrated Ducking Powder.\n\nLoaded Shells always on hand.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nRECEIVED PER STEAMER MARQ IS\n\nDry Goods,\nClothing,\nGroceries,\nProvisions\n\nEvery Department fully assorted—Special Bargains in\nDress Goods, Embroideries, Prints, Sheetings and Plain Cottons.\nStaple and Fancy Groceries, Fresh Hams,\nSpiced Roll Bacon, Maple Sugar and Maple Syrup\nThe Largest Stock of Clothing in town.\n\nBETTS & Gwynne.\n\nFURNITURE.\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all\n\nThe Latest Designs!\n\nwhich I am selling at reasonable rates to make room for a large stock coming up by boat.\n\nCall and inspect my stock and get prices.\n\nSaleroom, First Door West of Bank.\n\nW. B. GOODFELLOW.\n\nWM. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nNEW GOODS\n\nAT\n\nMISS MACK & CO\n\nFirst Door East Telegraph Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886090301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 6891, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 12866, 2], [12866, 17972, 3], [17972, 26413, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]