[{"id": "875e7bb9765d210404b88d742f60ebd1d49ea566", "text": "The Prince Albert Times\n\nJ. D. Maveety\n\nClearing Sale.\n\nParlor Stoves\n\nBox Stoves\n\nAcme Skates\n\nT. J. Agnew's\n\nMagistrates Cottert.\n\nT. N. Campbell's\n\nAdvertisement\n\nThe Prince Albert Times\n\nSaskatchewan Review.\n\n$2.50 per annum\n\nJob Printing\n\nMagnificent Array!\n\nManitoba Weekly Free Press\n\nCanada's Mammoth Paper.\n\n1887 - Campaign - 1888\n\nSixteen Year of Publication.\n\nOnly $2.00 to 1889.\n\nFree Press, Winnipeg, Man.\nEXEMPTIONS\n\nWhen an assessor visits his property, he must be prepared to make a report on its condition and value. The assessor's report will determine the tax rate for the property.\n\nCOMMUNICATIONS\n\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods\n\nDress Goods\n\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nAll Prices and Shades.\n\nLADIES', MISSSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMEN'S\n\nFancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF\n\nMitts and Moccasins\n\nIN THE TOWN.\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., $42\n\nDressed Siding, $42\n\nUndressed do., $35\n\nSheeting, $35\n\nCommon Lumber, $35\n\nDimension do., $35\n\n\"Over 15 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings at cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nThe Court of Appeal.\n\nOn Monday Judge McCreary rendered his decision on the appeal from the assessment of the town of Weyburn. A new assessment was made, and the property assessed was placed upon the property by the Assessor. In the appeal of Thomas Taylor, the charge against him was that the assessed portion included 10 acres on the roll, at which he had been assessed. The charge was also changed from $42 an acre to $40.\n\nIn Hughes' appeal the charge is similar, but the property assessed is different, the property lying aside to the north.\n\nA plot marked on the plan \"Reserved\" contains about 30 acres, and assessed at $40 an acre, whereas the land assessed is only about 10 acres, and assessed at $40 an acre.\n\nThe plot was placed at $600 which does not materially alter the value of the property, but the charge against Hughes was dismissed.\n\nIn the case of W. V. Maclean the total assessment was $1,000, partly caused by the assessment of two lots being taken off, they not belonging to him. The principal part of his appeal was dismissed.\n\nThe appeals of John Macdonald and Lyman Macdonald were dismissed.\n\nIn the appeal of the Rev. Louis Colliers as to the C. C. property the judge held that the C. C. property was exempt under the act of the legislature before the assessment.\n\nIn the appeal of Thomas McKay, no change was made in the value of his property. His assessment was ordered to be reduced to $1,000, and he has agreed to pay the amount of the assessment for sale of same lot. He was also assessed at $11 acres which he did not own, but his assessment was reduced accordingly.\n\nClosing business—See Mrs. J. A. Frazer's Closing Sale Advertisement on first page.\n\nLaurence Spectacles and Eye Glasses on hand in numbers to suit all sights, with right tester, at T. E. Jackson's Drug Store.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Howell & Co., Newspaper Advertising Bureau, 120 Broadway, New York.\n\nSend 10¢ for 100-page pamphlet.\n\nHANLAN DEFEATED.\n\nBeck still the World's Champion Boxer.\n\nSYDNEY, N. S. W., Nov. 27.—The exciting battle for the championship of the world between Hanlan of Toronto and Beck of Australia, was rowed to a close on the Nepean River. Beck won by a single stroke. He started well, took the start and held it to the finish. Hanlan showed a great race and pressed Beck closely until the last stroke. The race was very exciting and was witnessed by thousands of spectators, who held their breath during the contest.\n\nTELEGRAMS CAN BE SENT HERE.\n\nNew York, Nov. 27.—Oscar Hammerstein says that Hanlan's defeat does not affect his claim as the Australian national boxer. He says that in Hanlan's opinion Teerman could defeat Beck in Australia or any where else. Hammerstein says Hanlan's defeat is due to a young man, and the present trip will net him over $5,000, notwithstanding his defeat.\n\nTeerman said to a reporter before the race, \"I may announce that I will go to Australia next year for a championship fight. I am sure that I can win any number of square races for next spring and I think another match will be arranged.\"\n\nCATTLE NUISANCE.\n\nSir,—It is the duty of the Mayor or any one of our Councillors to enforce the laws of the city, and there is nothing more important than the protection of the citizens from the depredations of cattle. Last week I met a team in front of a house in the city, and five cows and a donkey were assisting to lighten my load.\n\nAwaiting information.\n\nYours,\n\nSOUTH BRANCH FARMER.\n\nThe Morning Call.\n\nFull cable and telegraphic reports of current events in Canada and United States News.\n\nSpecial news reports compiled by resident correspondents in Winnipeg, the Northwest Territories and British Columbia.\n\nComplete reports of Parliamentary proceedings at Ottawa and Winnipeg.\n\nTHE MORNING CALL also gives:\n\nThe night schedule of the United Press association in Winnipeg, and the latest news from the lakes.\n\nSubscription rates: One year, $1; six months, $5; three months, $3. Strictly in advance. Sample copies mailed free on request.\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS,\n\nPresident and Editor-in-Chief.\n\nSASKATCHEWAN DIRECTORY.\n\nAt the request of a number of influential citizens of the district, I have devised a directory containing the names and addresses of the citizens of the district of Saskatchewan.\n\nThis directory contains all the matters contained in such publications elsewhere, and will be found a valuable addition to their natural resources, and giving a proper recognition to the citizens.\n\nIt will give complete views of the town of Prince Albert, and will be distributed throughout the district, giving the proper addresses of the citizens, the churches and other directions.\n\nNo citizen will be able to make it thoroughly unavailable as a source of reference for the citizens of the district, and will be found a valuable addition to their natural resources.\n\nThe directory will be issued at a price of ten cents per copy, and twenty-five cents per copy, to those not advertising.\n\nThe publication of this directory may be directed to Editor-in-Chief.\n\nOrders for advertisements must be direct.\n\nParties who have not sent in their order forms will be unable to receive the directory, and will be promptly informed of the contents of the directory.\n\nPlease and forget to come within the next two weeks.\n\nT. T. MCCLINTOCK,\n\nPrince Albert, Sask.\n\nREAD, READ.\n\nThe Next West Farmer will be mailed to any address from now until March 31st, for the regular yearly subscription of $1.00. All subscribers, when renewing, will be given a free copy of the directory. All subscribers will receive a premium picture, \"The House Back,\" or its equivalent.\n\nContents of the paper: 27 pages.\n\nThe Publishers are located in Winnipeg, Manitoba, and are the only Agricultural and Stock Breeders' Newspapers in Canada west of Winnipeg. It is a 34 page monthly, hand written, illustrated, and contains all the latest information on the subject of agricultural publishing.\n\nThe departments are:\n\nAGRICULTURAL FARMERS.\n\nContaining descriptions of the farms (both rural and agricultural) visited during the year.\n\nAGRICULTURAL SOCIETIES.\n\nContaining the news of the latest doings of the different agricultural societies.\n\nLIVE STOCK.\n\nVeterinary Department, in which all veterinarians are invited to send in free of charge by a prominent Veterinary Surgeon.\n\nThe Dairy.\n\nBreeding and Pet Stock.\n\nEditorial.\n\nThe Field.\n\nGrain and Milling.\n\nThe Garden and Forestry.\n\nGame and Sport.\n\nBooks, etc., received.\n\nFarm Notes.\n\nChats with Readers.\n\nCountry Matters.\n\nThe Household.\n\nThe Homestead.\n\nThese departments are supplied by thoroughly competent men, who are interested in the welfare of farmers and obtain their information by a close acquaintance with the best authorities in the country.\n\nAll original articles are accepted without regard to political affiliations. United States and Canada, and it is an attempt to supply the most reliable sources of information to all farmers in the west.\n\nTo subscribers who have not yet sent in their order forms, the following will be included: the latest news from the lakes, the latest news from the West, Kansas, whose traveling correspondence will be kept in touch with the pioneer farmers and their interests.\n\nHOW TO SUBSCRIBE.\n\nEnclose $1 in registered letter with name and address, and post-office box number, and address\n\nNOK WEST FARMER,\n\nWinnipeg, Man.\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held on Monday evening, 29th ult., when the following business was transacted: Mayor Macintosh in the chair.\n\nThe Finance and Assessment Committee recommended the payment of the following accounts: James Bear $8, Andrew Graham $15.\n\nReport accepted.\n\nThere being no other business of importance before the Council adjourned.\n\nThe regular meeting of the Prince Albert Brewery Company was held this day evening last, Mayor Macintosh in the chair. There were also present Councilman Stewart, Boardman and Agent.\n\nA more agreeable and less hazardous lot of men may never again grace the Civic Chamber.\n\nAfter the reading and adoption of the minutes the following communications were received:\n\nTelegram received from J. E. Forgett, President of the Board of Trade, expressing regret at the death of Mr. James Murray, Secretary of the Board of Trade, and extending sympathy to his family.\n\nREPORTS.\n\nThe Treasurer's and License Inspector's reports for November were read and approved.\n\nThe matter of fire protection was discussed at length. It was thought desirable to get the fire company organized and fairly equipped. A fireman's hall was spoken of and would be a move in the right direction.\n\nThe Fire, Health and Street Inspector for a time occupied a back seat but finally proceeded toward before the Civic Chamber and gave an account of his stewardship.\n\nThe following matters were ordered to be paid—J. H. Robertson, $24; M. McLaughlin, $17; W. Downie, $36; Isaac Brown, $15.\n\nThe Ladies' Auxiliary Society was granted the use of the Council Chamber for payment of a sum of money to cover the expenses of the last night's entertainment.\n\nA by-law to prevent persons from the fire who have not paid their taxes was passed and ordered to be engrossed.\n\nA motion was presented to the collector to proceed forthwith and have collection certificates issued by the time specified for the next Ordinance meeting.\n\nThe Saskatoon Directory, which is being prepared by Mr. H. E. McPhail, received a very favorable consideration by the Council.\n\nA by-law of very great length, regulating the proceedings of the Council, Committee and Officers, received its second reading.\n\nThe Council then adjourned to meet on Wednesday, 14th inst., at 7 p.m.\n\nST. ANDREW'S FESTIVAL.\n\nSt. Andrew's Day was duly remembered in Prince Albert by the members of the Society and other friends, by a dinner and ball.\n\nThe dinner took place at the Queen's Hotel and was all that could be desired. The speeches were temperate and delivered by most host Oran, and reflected great credit upon him as a custos to the wants and desires of the guests.\n\nAt 7 p.m. sharp the officers elected for the present term assembled in the dining room, where a large number of guests were present. The following president, Lieut. Col. Sproul. After this pleasant duty was performed the new officers were sworn into office and the old ones were present, repaired to the dining room, where a large number of guests were present. The following officers were elected: Lieut. Col. Sproul, and on his right were seated Mr. Barlow, Honorary Registrar, and Mr. Robert Reid, D. L. S. O., and Mr. Mayne McKay and Mr. John Stewart, President of the Society. The First Vice-Chairman was Mr. J. B. Sanderson, and the Second by Mr. J. Sanderson.\n\nAfter all had feasted upon the luxuries the Council presented \"Queen and Country,\" each guest was invited to rise in the usual royal manner. The Lord-Governor was next proposed and seconded by Mr. J. B. Sanderson, and a song in his usual manner was . The Army and Navy was next proposed and brought Mr. McNair and Sergt. Major Scott to their feet. Messrs. J. E. Johnson and R. H. Thomas rose and spoke an excellent song and were loudly applauded. President Stewart then read letters from His Excellency the Lord-Lieutenant, Mr. Wm. Gordon, and Mr. J. B. Sanderson. From the 1st Vice-Chairman the following toast was proposed: \"To Beauty,\" to which Mr. P. M. Barker replied in a very pleasing manner. The \"Learned\" gentlemen complied with the wishes of President Stewart and presented Mr. G. Brown and was received with obeisance.\n\nThe mayor of the city present, then proceeded to the chair, which was in the residence of Senator Hughes. There present were Billy Simpson present, who dropped the light fantastic till the wax was burned.\n\nThis was the third official assembly of the St. Andrew's Society in this place, and fire that which preceded it was a grand success.\n\nFIRE PROTECTION.\n\nQuite a few and new was made against the Council of 1868-69 not providing the town with such kind of fire protection. The question was fairly discussed, and it could without a large expenditure of money. Since the Council has gone to work and has been doing a good appearance, what are these people doing? Special meetings have been called by the Fire Brigade, Fire Brigade, and almost without a response.\n\nThe question now is going who should take an interest in the establishing and maintaining of efficient Fire Brigade. Undoubtedly there are many carrying on businesses and all who own owners of buildings, yet it is a fact, that hardly a band of firemen could be assembled at the call of the Chief.\n\nOur Council are very liberal to the extent of the aid given to the Fire Brigade, and they have been very generous in aid of flight and wood. Yet no inducement is made towards the payment of the Fire Brigade. It is not necessary to place arguments before the people of any town, but a fire brigade is a necessary and probably small expense. It is to be hoped that the citizens will take an interest in the protection of the town from fire. It may be said that the citizens have been very liberal in providing the apparatus, but we do give very much credit to the citizens of this town for the establishment of a good fire brigade. We feel that the citizens of this town will be interested in the protection of the town from fire. It may be said that the citizens have been very liberal in providing the apparatus, but we do give very much credit to the citizens of this town for the establishment of a good fire brigade. We feel that the citizens of this town will be interested in the protection of the town from fire.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER--(Hop)--ALE.\n\nDelivered to all Parts of the Town.\n\nMINTON & GERROD\n\nXMAS CARDS\n\nIn Endless Variety at\n\nCANN'S BOOK STORE\n\nGRAND UNION LIVERY STABLE\n\nOpposition is the Life of Trade.\n\nCall early and get bargains at Mr. J. F. Francis'.\n\nA 400 pound porker was brought into town by G. B. Sanderson, of St. Catharines, and sold to Mr. Campbell.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887120901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3836, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 419, 2], [419, 9445, 3], [9445, 16087, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]