[{"id": "505ee6b9c342f1a97d523b10e85c0674c0e15a20", "text": "TENDERS.\n\nSUMMERHILL.\nProtestant Public School District No. 34, of the N.W. Territories.\n\nTHE TRUSTEES of the above named School District have advertised for Tenders on FORTY-CCI-FOUR MILLIONDOLLARS for the benefit of the said School District. The terms of the advertisement are in a copy of the same. The trustees further request all Tenders to be submitted by April 25th, 1886.\n\nSIRPAUL DENTON.\n\nNOTICE.\n\nPUBLIC MEETING TO BE HELD ON SATURDAY, APRIL 1sth, 1886, at half past eleven o'clock A.M., between the hours of 9 and 10 o'clock at the permanent school building.\n\nNotice as to how best to proceed with the said school meeting will be given thereafter by the Board of Trustees.\n\nJAMES PARKES.\n\nNOTICE.\n\nSCHOOL DISTRICT OF GREENVILLE.\nProtestant Public School District No. 35, of the N.W. Territories.\n\nThe Board of Trustees of the school stated in a recent report that they have received an unforeseen erosion in the value of our school until June 1st, 25 percent per annum. We are hereby invited to make our reports for the fiscal year beginning July 1st, 1885, and ending June 30th, 1886, to the nearest cent which has been received by us.\n\nThis election will take place on May 31st, unless otherwise notified.\n\nEDWARD R. GOODRICH,\nBanker, Mt. Pleasant.\n\nNOTICE.\n\nQU'APPELLE PROGRESS.\nVOL I, NO. 22.\nQU'APPELLE, ASSIN, APRIL 9, 1886—SIX PAGES.\n\nPrice Five Cents.\n\nWilliam Davis.\nProvisional Trustee, PUBLIC SCHOOL DISTRICT No. 35.\n\nNOTICE.\n\nGU'APPLES, Laying off of Lots.\n\nNOTICE:\n\nREMARKABLE CASE OF GAY & CO UGLY ARMY SCALD.\n\nNOTICE.\n\nASTRAY.\n\nNotes Lost.\n\nNOTICE.\n\nOSTRAV.\n\nCorrespondence.\n\nSIR-Pullmyter to call attention to the political matters of public interest, the speakers engaged, report of the meeting of the last session of the Assembly, and report of the annual report of the province.\n\nPublic Meeting.\n\nN.W. CENTRAL RAILWAY Co.\n\nQString QP\n\n    \nFROM THE CAPITAL.\n\nAn ordinance has been passed improving the streets of the city of Photographs taken from the window of the Governor's house.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting accounts at a higher figure. Besides we will thus speedily secure a larger circulation which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nA. S. EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPHELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPHELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPHELLE STATION.\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\nSUITS FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer For Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\nA large proportion of the Company's Lands is in thickly settled Districts.\nFor Information, Terms and Maps, apply at the offices of the Company, 14 Ward's street, Edinburgh, Scotland; 32 Lombard street, London, England; 94 Main street, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPHELLE FOR LANDS AND TOWN LOTS.\nLESLIE GORDON.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPHELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON\nPROPRIETORS\n\nFURNITURE, FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPHELLE STATION.\nSix Pages, Thirty Columns\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North-West.\n\nTHE Book & Job Printing\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nPoetry.\n\nTHE FAIR MILKMAID.\n\nBy Mr. G. TAYLOR.\n\nShe was a farmer's daughter fair,\nAnd her beauty was rare;\nHer lovely eyes were blue as the sea,\nAnd her cheeks were like rose-red flowers.\nShe was a perfect Venus,\nAnd she knew how to sing and dance,\nAnd she danced more than once,\nAnd I'm sure she never meant about the milkmaid song.\n\nWith her cow she would roam,\nAnd her milk she would draw,\nAnd her cream she would churn,\nAnd her cheese she would make.\nShe was a good housewife too,\nAnd she cooked the best of all,\nAnd she baked the finest bread,\nAnd she sewed the prettiest clothes.\n\nIn the township of St. Malo,\nShe lived in a little cottage,\nShe grew up into a fine young lady,\nAnd she married a good man.\nShe was a perfect housewife,\nAnd she cooked the best of all,\nAnd she baked the finest bread,\nAnd she sewed the prettiest clothes.\n\nWith her cow she would roam,\nAnd her milk she would draw,\nAnd her cream she would churn,\nAnd her cheese she would make.\nShe was a good housewife too,\nAnd she cooked the best of all,\nAnd she baked the finest bread,\nAnd she sewed the prettiest clothes.\n\nThe Progress Store.\n\nThe Progress Store will be found to contain almost everything required in the above line.\nThe Stock was selected with the view of meeting all the wants of the public at the most reasonable prices.\n\nSCHOOL BOOKS AT THE PROGRESS STORE.\n\nPrices that Defy Competition.\n\nFrom other Towns.\nSCHOOL BOARDS SUPPLIED AT PUBLISHERS RETAIL PRICES.\n\nTHE PROGRESS STORE.\n\nWill be found to contain a well selected stock of\nBOOKS, STATIONERY AND FANCY GOODS,\nWhich we will sell at the\nTHE MOST REASONABLE PRICES.\n\nORDERS TAKEN FOR ANY BOOK, NEWSPAPER OR MAGAZINE PUBLISHED.\n\nTWO DOLLARS.\n\nTHE WEEKLY MANITOBAN.\n\nOne of the Best Family Newspapers in the Dominion, for many years.\n\nLatest Cable Intelligence, Canadian News in Detail, and the most complete record to be found anywhere of the News of Manitoba and the Northwest.\n\nMedical, Veterinary & Legal Departments.\n\nAddress:\nThe Business Manager,\nManitoban Office,\nWinnipeg, Man.\nThe Grand Trunk employees have accepted the proposition of the management and a strike is averted.\n\nIt is reported that Russia has notified the Powers of her intention to occupy Bulgaria in the event of Prince Alexander failing to accept the Governmentship of Romania for five years only.\n\nMr. Drummond, of the Northwest Transportation Company says that $6,000 will have already been purchased for the Hudson's Bay Rail Road. This is a hopeful sign that work on the road will be commenced at an early date.\n\nThe secretary of the C.P.R. has recently appointed the agent for Europe from which he states that the prospects are excellent of a large emigration from Wurttemberg, Westphalia Berlin, Prussia, Hanover, Hesse, Bavaria, Bohemia, Austria, Roumania, Hungary and the Rhine provinces.\n\nGeneral Middleton will not undertake the protection of the officers of the 9th Battalion against Colonel Anzianoff, as all complaints should come directly to him; but Sir Henry will this not do. Middleton will also recommend that the force now in New Brunswick be discontinued as their services are no longer required.\n\nSir Horace Benoni, the British Minister to Greece, has been ordered to join the other foreign diplomatic representatives at Athens, or sending to the Greek Government a final step-wise assurance will be sent in attempting to obtain, should Greece ignite in the foreign fleets will not act forth. All the foreign squadrons and warships in Denmark are being hastily reinforced.\n\nThe Act granting the charter to the Manitoba Central has been discarded by the Halifax Government. The Act is being placed so that a law will be made that the Lake of the Woods and the Lake of the Woods would be included in the boundaries of the province of Manitoba. The Act has been amended and it was then resolved to pass the Act immediately to lake the Lake of the Woods.\n\nIf U want a Sewing Machine, Organ or Piano, consult James Weidman, Agent.\n\nJ. Mimikack\n\nMARIA LICHIEWSKA\n\nGRAND COLONIAL EXHIBITION\n\nNOISELESS FANS\n\nTHE CAMERON FAMILY\n\nOur Family Saving Machines\n\nMail Contracts\n\nWilliam W. McLeod\n\nProclamation\nHOME & GOSSIP.\n\nQU'APPELLE\n\n—Seeding.\n—Farmers busy.\n—Duck shooting.\n—Beautiful weather.\n—Sixteen leaves of crop at C. Gibson's place, twenty-five dollars.\n—The balls and hard and soft rubber balls at THE PROGRESS store.\n—Mr. G. S. Davidson left by train last night on a trip to Winnipeg.\n—The Regina Leader calls the editor of the Violette a \"bunyolity.\"\n—(Hon.) Mr. H. Fenwick has returned from Ontario. He brought with him a car load of horses.\n—Mr. P. B. Beauchamp, having a small herd of cattle, is in keeping with his new premises.\n—The Manitoba Sun has come to hand, bright and newy in appearance, likely concluded in every department.\n—Several carloads of corns and ears have been arriving by the C. P. R., some for here, and others for points further west.\n—Opposition is the life of trade.\n—Mr. J. G. Gibb is now engaged for the erection of a bakery on the lot north of Mr. J. P. Bean's store.\n—A Hollinghead, our rustic painting painter, is having a run on sugar work just now. He has turned out five signs within the week, one of which was in gold leaf and another in black.\n—The farmers in this vicinity are vigorously pushing seeding operations, and with the present fine weather conditions, they will nearly all be done before the end of another week.\n—Preparations being made by the ladies and friends of the Presbyterian church, assisted by B. Baxter, for an entertainment in the Immanuel Church hall on Wednesday evening 14th inst.\n—Mr. D. Roy Logan, the tonsorial artist, leaves here Thursday, April 15th, to be abroad two months. Parties wishing anything done in his line will do well to call in the next clipping between now and the 15th.\n—Mr. Alex. McKenzie's new house opposite THE PROGRESS office is now ready for occupancy at a low rate. He is building his own residence, and it is said he will be able to finish in a couple of weeks.\n—The publisher of THE PROGRESS is a keen believer in advertising, and so far as we know, there is no sign that he has put up this week.\n—While it is not too generous or too liberal, it is still an ornament to the street.\n—More houses are wanted in town. There is not enough room for the families of the town, and renting houses will not come or more put their heads together and start a brick yard, and build up a real brick town.\n—We will keep on reminding our correspondents that it takes a whole week to get the type for a newspaper, and that the week following the week they send us letters the newspapers cannot be issued for them. Those who want a copy are being kept over till the next week.\n—Registered at the Queen's Table, Mr. W. Gordon Henderson, Esq., grace of O. B. M. S.; Mr. K. Barrett, H. Fowall, Winnipeg; J. O. Boyle, J. Hayward, Moose Jaw; Mr. J. E. Smith, Fort Qu'Appelle; Mr. M. Robinson, Portage la Prairie; L. J. Peters, Virden; F. W. Comrie, Connaught.\n—The debate last Monday evening in the QU'APPELLE COUNCIL, Royal Temple of Freemasonry, on the question of whether the \"House of Lords be abolished,\" was conducted in a spirited manner, and was probably heard by all the hearers. The argument had its full effect on the minds of the members present, and will be imitated at next meeting. The Council is growing.\n\nTENDERS.\n\nSTORMS SOUTH AND EAST.\n\nChicago, April 6.—A heavy snowstorm, accompanied by high winds, has resulted in practically nothing being accomplished in connection between the west and New York. The storm center is near Buffalo and extends into Canada, and south, covering Chicago, Indianapolis, Detroit, Cincinnati, and even south of the Ohio river. Why the Sun does not reach us complete to New York, up to ten o'clock this morning the telegraph officials have taken their discharge, and left for the east on Tuesday night. They were met by the three men of Mr. E. F. Miller's party, who came in charge of Capt. Peters. A large number of \"I.\" Battery and the artillerymen immediately proceeded to formally send them off with cheers.\n\n—Gunner Wm. Adams, of I. Battery, has presented the editor of THE PROGRESS with a beautiful piece of work. It comprises a wreath surrounding a piece of steel, which is fixed on each side of a bird in each corner of the sheet. The word \"Ulpiope\" is inscribed at the bottom in a neat hand. Altogether it is a fine piece of work.\n\n—Last Saturday a considerable number of people visited THE PROGRESS (Qu'Appelle) by the April Monthly Fair for the sale of all kinds of farm stock. The next fair will be held at the National Hall, May 1st. The Man Fair promises to be a big success, as it will have a good indigenous attendance. We shall also offer prizes for the exhibition of stock, in addition to the opportunity there will be for the sale of goods.\n\n—Registered at the London house, Mr. Campbell, Stoneville; Mr. Lindblom, Touchwood Hills; J. H. Smith, Fort Qu'Appelle; Mr. Clarke and wife, Prince Albert; T. P. Wadsworth, —Samanders, Indian River; Mr. J. E. Smith, Lake of the Woods; Mr. J. Durnan, J. E. Scott, and wife, Regina; Mr. H. Bell, W. K. Scott, and wife, Regina; Mr. N. Cole, Regina; Mr. W. S. Wilson, Regina; Mr. J. Gordon, Fort Qu'Appelle.\n\n—The settlers in Tip. 17 R. 15 are desirous of organizing a school but as yet, lack one of the number of children required under the Dominion Act. We hope they take steps in that direction. Meanwhile the settlers at McLean station are desirous of organizing a school and propose to include a part of that township in their district. We hope that the settlers at McLean will be able to carry out their plans. We believe that the settlers at McLean will be able to carry out their plans.\n\n—PUBLIC SCHOOL REPORT.\n\nThe following report shows the attendance reported by the pupils in the different classes during the fortnight ending April 2nd 1886:\n\n| Class       | Attendance |\n|-------------|------------|\n| First Grade | 30         |\n| Second Grade| 30         |\n| Third Grade | 30         |\n| Fourth Grade| 30         |\n\n—Notice of Dissolution of Copartnership.\n\nTHE COUNCIL OF THE ROYAL TEMPLE OF FREEMASONRY, QU'APPELLE, HEREBY NOTICE THAT THE PARTNERSHIP KNOWN AS THE ROYAL TEMPLE OF FREEMASONRY, QU'APPELLE, HAS BEEN DISSOLVED AS OF APRIL 15TH, 1886.\n\nWitnesses:\nJ. L. GRAHAM\nH. J. ECKERT\nJ. JOSEPH GILLES\n\nNOTICE OF DISSOLUTION OF COPARTNERSHIP.\n\nTHE COUNCIL OF THE ROYAL TEMPLE OF FREEMASONRY, QU'APPELLE, HEREBY NOTICE THAT THE PARTNERSHIP KNOWN AS THE ROYAL TEMPLE OF FREEMASONRY, QU'APPELLE, HAS BEEN DISSOLVED AS OF APRIL 15TH, 1886.\n\nWitnesses:\nJ. L. GRAHAM\nH. J. ECKERT\nJ. JOSEPH GILLES", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886040901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9040, "total-output-tokens": 4196, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2014, 1], [2014, 2014, 2], [2014, 4916, 3], [4916, 6947, 4], [6947, 9056, 5], [9056, 15545, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]