[{"id": "5bd8185a4e3b4c9107473315d712db9c6aec25bf", "text": "OUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of affording advance payment. We can much better afford to publish a paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting nothing at a higher figure. Besides, we will now specify more a larger portion of what will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLiberties.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\nQU'APPELLE ST.\n\nSingle and Double Sides for Hire.\n\nFreighting a Specialty\n\nAll Kinds of Coal\nSold Constantly on Hand at the Lowest Prices.\n\nOats Sold for Horses & Skins\nQU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\nFor First Class Rigs.\n\nDaily Mail Stage to Fort Qu'Appelle,\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has in his possession the largest & best assorted stock west of Brandon consisting of Harness, Saddles, Whips, Belts, Blankets, Circles, Combs and Brushes.\n\nAll Kinds & Sizes of Trunks and Valises.\n\nAgent for Carriage & Buggy Tops.\n\nRemember the Place\nPioneer Harness Shop\nQU'APPELLE.\n\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON FORWARDERS,\n\nAnd Dealers in\nLumber, Lath, Shingles\nDoors, Sash\nBuilding Paper, etc.\n\nOffice West of C.P.R. Station,\nQU'APPELLE.\n\nBranch at Fort Qu'Appelle.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above lines, and our prices will compare favorably with any other house in the North-West.\n\nGive us a call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nOF THE TOWN OF QU'APPELLE:\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON\n\nPROPRIETORS\n\nFURNITURE, FURNITURE.\n\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION!\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\n\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\n\nSix Pages, Thirty Columns\n\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North-West.\n\nTHE Book & Job Printing DEPARTMENT\n\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal Cracked Wheat, Graham Flour, etc., etc.\n\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION.\n\nLove & Raymond,\nPROPRIETORS.\n\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\n\nSUITES FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\n\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\n\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\n\nA large proportion of this Company's Lands is in thickly settled Districts.\n\nFor information, Terms and Maps, apply at the offices of the Company, 14 Castle Street, Edinburgh, Scotland; 75 Lombard Street, London, England; 121 Main Street, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway\nBetween Edmonton and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESLEY GORDON.\nPoetry.\n\nNATURE'S SOCIETY.\n\nWritten on the 18th December, 1869.\n\nNature's true children do not appear\nIn the midst of human cares,\nWith a family to love, to live,\nOr trade, or build, or save.\n\nNor need they wander far away,\nTo find a home where they may dwell;\nOr hang their hopes on some\nOf whom a strange story is told.\n\nHe is known by his kind and benevolent\nHeart, which makes him feel for all he sees,\nFor his own, as for God's, and care\nHas been his daily work and care.\n\nHis love has been ever willing to work\nFor his fellow man; his heart\nFills his duty to mankind by love,\nAnd he labors there without repose.\n\nBut in his case, the soul has flown,\nHis heart is gone, his spirit's gone,\nHis mind is empty, his life is done,\nAnd he lies there alone.\n\nSometimes as mechanic or artist skilled,\nHe has been known to paint or draw,\nHis great tender heart with charity filled,\nAnd his eyes have shone with tears.\n\nSuch tears as lie in hiding, yet will come,\nTo wash away the stains of time,\nAnd bring back to his memory\nA vision of his former fame.\n\nA LITTLE THROUGH THE FARMERS.\n\nA little through the farmers' town,\nOne point to note in favor of the hawkeyes.\nAt this season the house must be well stocked up. If they are kept in confinement, pieces of grain should be placed in the yard during the day.\n\nThe Farmer's Advocate would like to see the whip wholly discarded. An experienced farmer can soon tell who is or is not a horse to be trusted. The whip is the parent of stubbornness. It cannot be found in the pedigrees of every horse.\n\nLow prices, when they come, always bear more heavily on those who follow mixed farming than on those who follow mixed farming. General thrift follows the careful management of the farm, the crops, provides, himself with a few cows, pigs, sheep, and last, but not least, horses.\n\nA disease to gain mankind is \"social laws\" in force. Various re- sults are attributable to its careless and lax execution. It seems to be a small inset that afflicts and troubles the contemplative, yet it is a constant source of trouble for every civilised nation. The best and simplest remedy is to use ketamine.\n\nKetamine is an attractive and attention-seeking insecticide. It is a powerful stimulant and sedative, while it is harmless to man. As it dissolves mix with water, an emulsion should be made with milk, an emulsion should be made with milk and two-thirds milk, either sweet or sour, so found more acceptable, and then applied to the crops in the same way as Paraquat.\n\nA French chemist has invented a new method of preserving the fruit of the grape. The milk or cream placed in a recipient and by means of two electric poles connected together to the liquid, the electric current is established as thoroughly throughout the liquid as it is possible to make it. We do not believe this business has yet reached a stage where the public will have any opportunity of purchasing it.\n\nTo kill lice on cattle a mixture of equal weights of dry sand and five pounds of sulphur will clear fifty head. Use them into a handful, if you have hands, and pour it over windward and throw it or sprinkle it about your cow to get it on. One pound of sulphur will treat five acres every acre. Sulphur, coal oil and hard soap will clean loads of ice and legs and run very gracefully through the feathers.\n\n— A limited number of White Leghorn eggs for setting can be obtained at Tim's Poultry Office.\n\nViolin strings, pipe, purses, al- bums, etc., sent by first-class mail, at the Post Office.\n\n— Patrons wanted at The Pro- vost's Office for subscriptions.\n\nMillions of Pigeons.\n\nInnumerable flocks of pigeons are heard at night in the neighborhood of New York City, in the neighborhood of the city of Chicago, and in other large cities. Very few of them have been seen in the daytime. They are heard loud and clear moving about in the air, and their noise is frequent. Farmer James J. Smith, who lives near the city of Chicago, has a large flock of pigeons in his barn. He says:\n\n\"Father J. was looking over to see what was going on, and saw a terrible big flock of pigeons sailing up from the river. He thought he had got my old shot-gun out, and fired into the tall end of the flock. I went down to see what was going on, and down a pigeon, 'cause I've picked up a gun. I thought I'd try it again, and I did. I went down to see what was going on, and down another pigeon, 'cause I've picked up a gun. I thought I'd try it again, and I did. I went down to see what was going on, and down another pigeon, 'cause I've picked up a gun.\"\n\nThere is nothing more to say about it.\n\nA. HOLLINGSHEAD,\n\nPAINTER.\n\nHOUSE SIGN AND CARRIAGE PAINTING, GRAINING, Glazing, Paper hanging, Kite making.\n\nAll work neatly and promptly executed.\n\nOffice, Walsh St., Qu'Appelle.\n\nRussell & Davis,\n\nWholesale and Retail Dealers in BEEF, POKE, MUTTON, SAUSAGE, HAMS, BACON, ETC.\n\nBeef Cattle & Hogs\n\nALWAYS ON HAND.\n\nTerms Strictly Cash\n\nQU'APPELLE STATION.\n\nBRANCH—FT. QU'APPELLE.\n\nSTOVE and Tin Depot.\n\nE. WISMER\n\nWhile returning thanks for past patronage, would direct attention to a large stock of Stoves and Tinware\n\nMy Stoves are from the best manufacturers, and are guaranteed to be the best specimens of the Northwest trade.\n\nQU'APPELLE STATION.\n\nShoemaker.\n\nFor Boots & Shoes\n\nGO TO\n\nS. H. COLLINS\n\nQU'APPELLE.\n\nWhere you will find the best dealing and every mark kept alike.\n\nGents' and Ladies' Boots Made to Order.\n\nOrders from a distance attended to.\n\nOverhauls, Rubbers, Moccasins Now on Hand.\n\nCarpenter.\n\nJ. B. ROBINSON\n\nContractor, Builder, Etc., Etc.\n\nQU'APPELLE.\n\nAll Work in my Line will Receive Careful Attention.\n\nThe NorWest Farmer\n\nWants Manicota\n\nAND THE WEST\n\nTO YIELD A GREATER RETURN TO THE FARMER.\n\nWe are doing our best to bring about the happy state of things which the help of every intelligent man in the prairie provinces.\n\nTHE NOR' WEST FARMER\n\nAND MANICOTA\n\nis devoted to the interest and advancement of the farmers of the West. It is a weekly paper, and is published at Qu'Appelle, Saskatchewan.\n\nT. WELSH,\n\nGeneral Blacksmith,\n\nQU'APPELLE.\n\nFrom the very liberal allowance he has rec- eived since his arrival here, he feels constrained to return thanks for past kindness, and promises to give his best attention to the interests of the farmers and stock raisers of this district.\n\nJ. McEWAN,\n\nGeneral Blacksmith,\n\nCarriage and Wagon Shop\n\nQU'APPELLE.\n\nHorse Shoeing a Specialty\n\nRepairing Damage to either Wood or Iron Work.\n\nWORK DONE CHEAP FOR CASH\n\nNotice to Builders.\n\nTENDERS required for the undersigned and enclosed \"Tender for Dwelling Houses and Store House, Blackfoot Indian Reserve, near Fort Macleod, Alberta,\" dated the 20th April, 1888, for the erection of two houses, one storehouse, and one Lower Camp at the Blackfoot Reserve.\n\nEach tender must be accompanied by an accepted cheque or money in the hands of the tenderer, payable at the rate of one hundred dollars, and must be received by the 30th April next.\n\nD. E. DUNN,\n\nIndian Office, Regina.\n\nApril 25th, 1888.\n\nNotice to Builders.\n\nTENDERS required for the undersigned and enclosed \"Tender for Dwelling Houses and Store House, Blackfoot Indian Reserve, near Fort Macleod, Alberta,\" dated the 20th April, 1888, for the erection of two houses, one storehouse, and one Lower Camp at the Blackfoot Reserve.\n\nEach tender must be accompanied by an accepted cheque or money in the hands of the tenderer, payable at the rate of one hundred dollars, and must be received by the 30th April next.\n\nD. E. DUNN,\n\nIndian Office, Regina.\n\nApril 25th, 1888.\n\nNotice to Builders.\n\nTENDERS required for the undersigned and enclosed \"Tender for Dwelling Houses and Store House, Blackfoot Indian Reserve, near Fort Macleod, Alberta,\" dated the 20th April, 1888, for the erection of two houses, one storehouse, and one Lower Camp at the Blackfoot Reserve.\n\nEach tender must be accompanied by an accepted cheque or money in the hands of the tenderer, payable at the rate of one hundred dollars, and must be received by the 30th April next.\n\nD. E. DUNN,\n\nIndian Office, Regina.\n\nApril 25th, 1888.\nRapid City Ripples.\n\nTHE NORTHWEST CENTRAL RAILWAY CO.\n\nIt will be remembered with rather better feelings by the people of Rapid City than was the Northwest Central Railway not built to this place last summer because it was whispered there was some difficulty between the President of the Co., Mr. Woodworth, M.P., and Mr. D. B. Woodworth, M.P., the latter being the chairman of the committee of the House of Commons at Ottawa, and it transpires that Mr. D. B. Woodworth, M.P., finding that there would be no profit arising from the building of the road, and that his own interests claimed him to have influence with the Government, demanded from Mr. Henry the half of the profit as a consideration for his influence in securing the land grant for the railway. This Mr. Henry refused to give, and Mr. Woodworth in pursuance of his malicious threat succeeded in delaying matters so last year that the road did not go on. Now the same affair seems to recur, in commencing on it the Colquhoun Tribune says:\n\n\"According to this matter, it is Mr. Woodworth, M.P., not the same Woodworth, M.P., who has the right of the original discoverers of the Bath Hot Springs, but never paid for them, the bargain made not being an arbitration committee to settle his claim.\"\n\nOr may be this is the same Woodworth, M.P., who with native and avante a few nights ago, \"did,\" Mr. Keefe, at the said Bath, took off his ferry boat and landed on the bank to make a claim to the said privilege, and Mr. Woodworth, M.P., knowing that Mr. Keefe had already claimed the ferry (having had one in operation there for some time), unceremoniously ordered Mr. Keefe over to the old Woodworth, M.P., who looked like the very identical man, Mr. Keefe, who had been there before.\n\n\"Oh may be some one could tell us if this is the same Woodworth, M.P., who was there during the last week, landed on the Bath Hot Springs, with native and avante a few nights ago, \"did,\" Mr. Keefe, at the said Bath, took off his ferry boat and landed on the bank to make a claim to the said privilege, and Mr. Woodworth, M.P., knowing that Mr. Keefe had already claimed the ferry (having had one in operation there for some time), unceremoniously ordered Mr. Keefe over to the old Woodworth, M.P., who looked like the very identical man, Mr. Keefe, who had been there before.\n\n\"If you want a Sewing Machine, Organ or Piano, consult\n\nJAMES WEIDMAN,\nAgent.\n\nMAIL CONTRACTS.\n\nThe Toronto Weekly Mail\n\nTHE MAIL\n\nSpecial Offer\n\nTo subscribers to the QUARTERLY PROCLAMATION, who will take out a subscription to THE WEEKLY MAIL for one year to be paid in advance, making the price $1.50 less per year, the publishers enable us to do this. Take advantage of this offer.\n\nWEBSTER'S PRACTICAL SQUARE AND UPRIGHT PIANOS.\n\nLYMAN'S WINE OF BEEF & IRON,\n\nNourishment of Beef,\n\nStimulant of Wine,\n\nAND THE TONIC PROPERTIES OF IRON.\n\nIt has the TONIC BEEF FLAVOR, and is a valuable addition to the table of every intelligent housewife.\n\nGRAND COLONIAL EXHIBITION\n\nIn London, England, 1886.\n\nFirst Royal Exhibition Commenced since 1862.\n\nThe Progress Book and Stationery Store now open.\nHOME & GOSSIP.\n\nQU'APPELLE.\n\n— Glorious weather.\n\n— Good Friday to-day.\n\n— Clean up the back yard.\n\n— Drive off the surface water.\n\n— Work up an early appetite.\n\n— Remember fast day, May lst.\n\n— Day after tomorrow is Easter Sunday.\n\n— Plant your trees on Arbor Day, May 1st.\n\n— Mr. J. P. Boulencamp has put up his new light-house.\n\n— These carloads of way freight, chiefly merchandise, were left off here last Wednesday.\n\n— There promises to be a fruitful year; the weather could not have been better for seeding.\n\n— Mr. Roy Logan, Town Hall Artist, will paint portraits on Saturday, 24th for sure. Call early.\n\n— Attention is directed to the advertisement of Mr. J. McEwan. He keeps for sale blacksmith's tools and iron.\n\n— Read the Lake View Resort advertisement by Mr. E. Daniel. He proposes to hold school-opens on 25th May (the Queen's Birthday).\n\n— Rev. E. Gaunic, L. D. S., Baptist Surgeon of Whitewood, will visit Qu'Appelle, at the Queen's Hotel, on Thursday and Friday, April 28th and 29th.\n\n— The following sums towards the building fund of St. Peter's church are thankfully acknowledged: J. McKee $160; Dr. Edwards $160; W. Henry $10.\n\n— The Superintendent of St. John's College, intends to settle with us in July, the lands by the side of the section thus opening the present trail out to the Elcyber Farm.\n\n— We would remind our readers of the March Sale, which is held here for the sale of all kinds of farm stock. Prizes will be given for largest sheep and cow exhibited. See advertisement.\n\n— Mr. William Leddy, U. D. G. R., M. A., F. A. M., is about to arrive on this Wednesday night.\n\n— Our second installment of the 28th inst., R. W. Ro., J. A. Kerr, D. G. M. and visiting brethren are expected today.\n\n— Today before Good Friday there will be services in St. Peter's church at 11 and 19:30 o'clock (7.30 and 5.30 p.m.). On Easter morning the services will be held at the usual hour and will be full choral.\n\n— Heavy teams carrying large shipments of grain are coming to speed every day of late; and immigrant cars are attached to nearly every train, with manifestoes for various points along the line.\n\n— Large quantities of freight are arriving here every day for Prince Albert, Regina and other places. Although freighters are meeting the goals as a daily rate, the C. P. R. should be enabled to fill orders.\n\n— Mr. J. H. Mcllwain, from Prince Albert, arrived here by train from the east yesterday morning. He was accompanied by Mr. A. Smith Padley, of Winnipeg. He is left yesterday by a special stage for the north.\n\n— A meeting will be held tomor-rrown (Saturday) evening at the school house to make arrangements for a school and teachers for the Queen's birthday. Preparations are being made for a big time. Large crops will be put in next week.\n\n— A very fine, well located store of Beondelchuck has been opened for pioneer church by Mr. J. H. Edmonds. The position is good, geographical and size arrangement is strong, substantial in appearance and well fitted, and does him very great credit.\n\n— Major Short, Dr. Froboess, Mr. R. J. Cowell returned from their western tour last Monday last. They say they had fine routes and if they got many views such as Mr. Cowell did give among us, much must have been the case, but we do not whether they were good eating or not, we are practically in the dark.\n\n— Mr. J. Bouldtine has lately been stocking large quantities of apple, oranges, lemons, etc., to Prince Albert.\n\n— A certain well known citizen in this county has over two hundred and fifty five homes and back yards filled with beautiful fall just in front of Timmins police house. The ride was here.\n\n— Messrs. O. Darmany, W. A. Cooke and E. Kassons, capable for freight business in the entire district will soon be here. Messrs. Moore church stead their final examination Wednesday. It was conducted by Rev. T. Lawrance, principal pupil being Hon. Mr. Condeirro. Expert.\n\n— The Roman Catholics of the town have decided to build a hall. They have purchased a lot in another column. They have secured bids on Walsh street. It will now go to contract when the contractors will call at Church streets.\n\n— Any person wishing to lease ground, will find them treated with \"stick\" will work very well by \"brick.\" W. lately immigrated by His Honour Mayor-Governor. Designed by Mr. David Jones. Will be completed by 1st June\n\n— The Roman Catholic of the town have decided to build a hall. They have purchased a lot in another column. They have secured bids on Walsh street. It will now go to contract when the contractors will call at Church streets.\n\n— Any person wishing to lease ground, will find them treated with \"stick\" will work very well by \"brick.\" W. lately immigrated by His Honour Mayor-Governor. Designed by Mr. David Jones. Will be completed by 1st June.\n\nBUILDING SOCIETY.\n\nThe want of increased accommodation in the town for houses for rent is being felt very much in this town. There are a number of families that would be occupying houses if they could be available.\n\nThe want of more private residences of a proper class that has been very keenly felt by more than one family. In fact ever since the town had a beginning, but especially in this the winter, as the times have been hard to supply this want a building society is to be organized to be called the \"PROGRESS SOCIETY.\"\n\nThere are 925 shares, each 250 dollars, and $1,130,000 have already been subscribed. It is expected that an association will soon be formed to purchase and build a tennis of four houses which are to be rented at a moderate rent.\n\nThe Society will specialise in the undertaking parties who wish to invest small sums, and it will be the object of future houses being accommodated for family residence living in the town at reasonable rates be disposed of a good class. We have the guarantee that the shares will be subscribed and the tennis erected within the shortest possible delay.\n\nPUBLIC SCHOOL REPORT.\n\nThe following report shows the marks obtained by pupils in the different classes for the fortnight ending April 17th 1886.\n\nFIRST CLASS.\n\nLizzie Winletter, Joseph E. Wm. Davison, 344; Donovan Welch, 349; Susan Gobert, 267; John Wiener, 263.\n\nSECOND CLASS.\n\nLeonard Bell 341; Geo. Davidson, 340; Richard Wiener, 259; Mary Grieves 265.\n\nTHIRD CLASS.\n\nFlora Lumsden, 341; Alfreda Welch, 175; Wm. Welch, 165; Famous Gibcole, 157; Mary McLane, 153; Jane McClenny, 131; James Milne, 99; seamstress. Humphreys, 98; Jane Scarff, 89; George Speck, 66; Wm. Lymburner, 66; Floyd Fair, 30; Robert Fox, 10.\n\nFOURTH CLASS.\n\nJudson Bosh, 88; Gertie Davison, 87; Eliza Redwood, 85; Lizzie Scott, 61; Casie Fair, 59; James Fair, 57; John Walker, 7.\n\n— In about ten weeks we will have a choice assortment of honest packages for sale at The Progress Office.\n\nTHE WHISKEY STILL CASE.\n\nWe have such submodule confirmed to be true that the administration of justice that it would be with great unwillingness we were informed by Mr. Smith in the slightest degree miscarried in any manner, where is the case over which he presided. We assure you however, to our recent notice that the case was not lost to use Smith's evidence in order to convict Rodolf. Smith, we have no doubt, but if we were to attempt to try it, we would find ourselves so entirely witness, and it was on his side evidence were respectable informants appointed to us, as has happened under similar circumstances when rods have been destroyed in various instances spoke plainly and strongly against the said运动会. The language of the United Kingdom under Order in Council, 1884, 1885, is such that the judge may have felt he had no alternative but to set aside Smith's act, as he says, “whiskey shall make,\" without putting in any particular what the man knew they were making a whisky when Smith's evidence was raised in a few moments for him, but by a momentary lapse of sensation, that he, as much at least as he thought, was not permitted to decide on this to his part of the law. He would have been able to justify the penalty in this state of Dillon and Winwer that no one could have been insane, seeing when Mrs. Smith was only sixteen. This resolution was the making of a still. We wished We would have been permitted to see on records here that the Act of Parliament 1884, 1885 specifically stated that Mr. Smith, a member of the church, is the first case and we came, but think we will get another opportunity of justice to regard the penalties in the case of Dillon and Winwer who most probably will get their liberty.\n\nTHE PROGRESS STORE.\n\nWill be found to contain almost everything required in the above line. The Stock was selected with the view of meeting all the wants of the public at the most reasonable prices.\n\nSCHOOL BOOKS.\n\nAT THE PROGRESS STORE.\n\nWe will sell school requisites of all kinds at competitive prices.\n\nPrices that Defy Competition.\n\nFrom other Towns.\n\nTHE PROGRESS STORE.\n\nWill be found to contain a well selected stock of\n\nBOOKS, STATIONERY.\n\nFANCY GOODS,\n\nTHE MOST REASONABLE PRICES\n\nTwo Dollars\n\nPm. pm.\n\nTHE WEEKLY MANITOBAN.\n\nOne of the best Family Newspapers in the Dominion, for one year.\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban\n\nThe Weekly Manitoban", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886042301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9132, "total-output-tokens": 8215, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 3838, 3], [3838, 11912, 4], [11912, 15028, 5], [15028, 31217, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]