[{"id": "9a1c5854f530902c9fdf6210d23375c7b284ff49", "text": "NOTICE\n\nThe Qu'Appelle Progress is published by JAMES WEIDMAN EVERY FRIDAY.\n\nAt the Proprietor's Office, in the Town of Qu'Appelle, Assiniboia, Canada.\n\nThe Progress is a Weekly Journal of Local, Provincial, Canadian and Foreign News and Notices, and is printed by subscription price 50¢ per month, inclusive of postage.\n\nThe rates for our advertising space are as follows:\n\nOne column $3.00\nTwo columns $6.00\nThree columns $9.00\nFour columns $12.00\n\nBusiness card 50¢ per month payable quarterly.\n\nThe above rates do not apply to serials, advertisements, letters, notices, classified advertisements, or any other form of paid advertising except at an additional insertion. Twenty advertisements will be inserted at each insertion, but any additional insertions will be charged at double the rate of the first twenty.\n\nBusiness cards, 50 cents for first twenty-five words; 3 cents for each additional word.\n\nThe Progress reserves the right to reject any unsolicited advertisements or opinions.\n\nAddress: JAMES WEIDMAN, Qu'Appelle Station, Assiniboia.\n\nAVIS\n\nA VIS was put up yesterday afternoon at the residence of Mr. Borden, No. 1 Spring Street, for the North-West Central Railway Company. We understand that Mr. Borden has been very active in promoting the interests of the railway company, and we are confident that it will be successful in its endeavor to bring the line through the town.\n\nCORRESPONDENT\n\nMUNICIPAL ELECTIONS\n\nTo the Editor,\n\nSir—Allow me through your columns to convey the above news before your readers. Now that the year 1865 is falling away and all things seem so quiet, let us turn our attention to the fact that the election of members of the council should engage the attention of every citizen. We have seen the town grow from a small settlement to a thriving community. Let us take advantage of this opportunity to elect men who will serve the best interests of the town.\n\nYours respectfully,\n\n[Signature]\n\nJAMES KAYNE,\nPresident N.W.C.R.C.,\nToronto, Nov. 18th, 1865.\n\nLEGAL\n\nLESLIE GORDON,\nEsq., Attorney-at-Law, COMMISSIONER FOR MANITOBAN LANDs, and QU'APPELLE STATION, Assiniboia.\n\nAttorneys, Solicitors, Notaries, Conveyancers, etc., SECOND AVENUE, RAPID CITY, HONEY TO LOAN.\n\nGRAND COLONIAL EXHIBITION\n\nIN LONDON, ENGLAND, 1862.\n\nFOURTY-FOUR THOUSAND FEET RESERVED FOR CANADA.\n\nFirst Royal Exhibition Commis-\nsion since 1862.\n\nTHE COLONIAL AND INDIAN EXHIBITION is to be held in LONDON, England this year, and the Government of Canada has a stake of great importance having to do with the exhibition. The Government wishes to exhibit the products of all parts of the British Empire with others.\n\nIn order to give breathing-signto the people of Canada, the Government of Canada has decided to hold an exhibition in London, England, where the Prince of Wales has been appointed President.\n\nThe large space of 54,000 square feet will be occupied by Canada.\n\nThis Exhibition is to be under Colonial and Indian Commissioners, who are to be selected from the most prominent men in the country.\n\nThe grand opportunity now offered to Canada is thus afforded to show the world what we can produce. We have already made in Canada, in different parts of the country, some of the finest specimens of goods to be shown there. In the Manufactories there exist goods of great merit, which ought to be exhibited there.\n\nEvery farmer, every producer, and every manufacturer should be encouraged to have their goods displayed at the Exhibition.\n\nBy order,\n\n[Signature]\nJ. B. JONES,\nAgent for the Dept. of Agriculture, Ottawa, Oct. 18th, 1865.\n\nNOTICE\n\nNOTICE IS HEREBY GIVEN that the application will be made on behalf of the citizens of Qu'Appelle for the grant of land west of the townsite of Qu'Appelle. For further information, please see the notice above.\n\nQU'APPELLE, ASSINIBOIA, NOVEMBER 27, 1865.\n\nCOUNCIL MINUTES\n\nQU'APPELLE, NOVEMBER 27, 1865.\n\nProceedings of Council meeting held at Qu'Appelle on November 27th, 1865.\n\nPresent: Councilors Cruthers, Haywood, Smith and Clark.\n\nMinutes of last meeting read and approved.\n\nLetters from Qu'Appelle Agricultural Society asking for a grant in aid of the $500 above.\n\nLetters from Messrs. Coe, offering land free of cost to the Municipal Engineer that they had erected a bridge that they had erected across the Qu'Appelle River on certain conditions.\n\nLetters enclosing account for construction of Spring Creek Bridge $2.84.\n\nR. D. Joyner's account for road work $2.84.\n\nA. Wright's account for repairs to culverts $8.90.\n\nR. D. Richardson's account for repairs to culverts $8.90.\n\nS. S. Bradly's account for surveying proposed cemetery and plans $17.\n\nR. G. O'Grady's account for plans, etc., $17.\n\nE. Mutch's account for repairs to culverts $2.80.\n\nPoveshell's account for printing $8.70.\n\nRAPID CITY RIPPLES\n\nThe Northwest Central is again booming up.\n\nM. S. I. Haywood has gone to Toronto on a month's visit.\n\nThe present terminus of the M. N. W. Railway is called Sudbury and is about seven miles from Rapid City.\n\nMr. D. M. Burtchard has moved his residence from Rapid City to the house on the corner of Second Avenue and Fourth Street.\n\nElsewhere will be found an ad-\n\nvertised public meeting to be held at the home of Mr. T. S. Burtchard, 710 Sixth Avenue, to vote on the question of the charter to the Northwest Central Railroad Company.\n\nThe following resolutions are recommended to be passed: H. R. Joyner, $12.50; S. B. Bealby, $17.69; R. W. Murray, $12.50; R. D. Richardson, $10.00; and your committee desire that the amount of R. D. Richardson's bill be voted out of the fund.\n\nAdopted.\n\nIn answer to Councillor Haywood, the chairman stated, that in view of the condition of the town, it would be undesirable to replace the present sidewalks in the south end of the town.\n\nThe Voluntary Tax list was laid on the table by the clerk.\n\nThe following resolutions were adopted: Mr. Haywood and Crowe, that the Voluntary Tax for 1865 as presented be confirmed.\n\nMoved by Councillors Haywood and Crowe, that the Voluntary Tax list for 1865 be approved.\n\nCarried. The Council adjourned.\n\nNEW YORK TIMES\n\nJ. B. JONES, M.P., undertook to build a new schoolhouse. He says that he has received offers of land valued at $10,000, but he does not want to build another schoolhouse.\nRESPONSIBLE GOVERNMENT FOR THE TERRITORIES.\n\nWhile making his recent tour through the Northwest, the Hon. Theo. White, Minister of the Interior, commented briefly of the principle of representation of the territories in the Canadian Parliament. This will be a large measure of responsible government, and if the number of members given is in proportion to the vastness of the territory and the interests to be represented, we will have no cause for complaint if our Dominion affairs are concerned. But the popular eye seems to be far from full responsibility in the administration of our local matters. Though this may be very well in theory, it would be well to make haste slowly in respect to provincial government, if it is to cost the people of the Northwest in the same proportion as it does those of Manitoba. Rather than impose a burdensome taxation imposed on the people of that province, it would be better to require us for some little time at least. In seeing this matter, we do wish to be convinced of the propriety of considering such a responsible administration of our local affairs. We should profit by the experience of our eastern neighbor, and hesitate before imposing upon ourselves burdens which they can easily bear. We have now a very simple system of municipal government, and we think that a scheme of provincial administration should be devised that would be as inexpensive and simple as possible. In this case, too, the same thing directly responsible to the people. There has already been some discussion on this subject amongst the press and people of the territories, and the question should not be left for the future, but should be settled through sufficiency or any other cause. The agitation should be kept up and practical proposals offered. It is not enough merely to demand provincial self-government, which many can state their desire about. In the future, the appointment of a Cabinet, and the removal of the Lieutenant-Governor from the active administration of affairs. The people should be educated into the idea that the terms interpellation and recall will cause them to again of the representatives, they also the inaugurations of an efficient and simple administration whose chief object will be the welfare of the people. It is not less than their own responsibilities, and the people are very anxious members of the drawing of a larger salutes as the Northwest Council. Mr. Jack, when first instituted its composition, was a member of the School Act. The Collector of Customs at the head of the department should be eliminated and the number of Port of Winnipeg by local representatives increased in proportion to the population. The present arrangement provides for the establishment of a government for the provinces on the basis of the federal system. This, we think, would lead to confusion ultimately, unless the provinces be retained as one province for all purposes. Even then it would be undesirable to allow the separate laws that would be suitable in one portion of this vast region would be unsuitable in another part. It would be preferable that each territory should have its own legislation, and that the legislature be elected by the people of the district that they can bear the burden. Meanwhile let us make the most of our Territorial Council; increase our electoral strength in future elections, and bring all possible influence to bear on the Dominion Government to increase its administrative powers, and hence largely control the one-power which seems so objectionable. We shall follow up this subject further in future issues.\n\nThe N.W. CENTRAL RY. CO.\n\nThough the charter of the North-West Central Railway Company has lapsed, it would seem that in their interest at least, they will continue to operate under the old name. From a private source, we learn that Mr. Beatty, the President of the Company, says that the road will be opened in August by July. To accomplish this, a new charter has been obtained, and it is to be hoped that this company will succeed in carrying forward their project. With their starting point being Edmonton, running northward to Calgary and the Elbow River, they will extend their line north of the 50th parallel. When completed, it will open up a magnificent portion of the Northwest, and will be a great boon to the settlers along the prairie. We have heard that the Hon. Mr. White, the Minister of the Interior, was making a tour of the country around Fort Qu'Appelle, he referred to the North-West Central Railway Company, and said that their line would be opened in August. He said that the road would succeed in opening the money to be spent on the road. In the interest of the settlers all along the line, he said, it was desirable that the Government should take over the road and put it into operation. He said that the road would be opened in August, and that the settlers would benefit by it.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing advance payment. We can much better sell our paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting accounts at a higher figure. Besides we will make a larger revenue in larger circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\n\nQU'APPELLE ST.\n\nSingle and Double Rigs for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\n\nKept Constantly on Hand at the Lowest Prices.\n\nCash Paid for Hides & Skins\n\nQU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\n\nFor First Class Rigs.\n\nDaily Mail Stage to Fort Qu'Appelle.\n\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of the Appellle and vicinity that he has now on hand the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bellis, Blankets, Cricleages, Combs and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\n\nAgent for Carriage & Buggy Tops.\n\nREMEMBER THE PLACE\n\nPioneer Harness Shop\n\nQU'APPELLE.\n\nJOHN B MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON FORWARDERS,\n\nAND DEALERS IN\n\nLumber, Lath, Shingles\n\nDOORS, SASH\n\nBuilding Paper, etc.\n\nOffice West of C.P.R. Station.\n\nQU'APPELLE.\n\nBRANCH AT FORT QU'APPELLE.\n\nNEW GOODS - NEW GOODS\n\nAT GOLDSTINE & BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\n\nBoots & Shoes, Gents' Furnishings,\n\nFURS OF ALL KINDS\n\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\n\nGive us a Call and see for yourself.\n\nGoldstine & Beauchamp.\n\nQUEEN'S HOTEL\n\nIN THE TOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\n\nPROPRIETORS\n\nFURNITURE, FURNITURE,\n\nHAVING LATELY SECURED\n\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\n\nAT PRICES THAT DEFY COMPETITION.\n\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\n\nIS PUBLISHED\n\nEvery Friday Morning.\n\nAT THE OFFICE, QU'APPELLE STATION.\n\nSix Pages. Thirty Columns.\n\nSubscription $1.00 a Year Invariably in Advance\n\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Boot & Job Printing\n\nDEPARTMENT\n\nEXECUTES\n\nEvery Description of Printing\n\nNEATLY, CHEAPLY & QUICKLY.\nGrace Lilburne's Secret\n\nA Story of Two Christmas Days\n\nNew Year's Eve is, on Christmas Eve, the time when you hear the-clock chiming, and when one expects to hear of something strange or astonishing.\n\nThis was the case with Miss Lilburne and Mr. Eyre, who were engaged for the first Christmas Eve night at their matrimonial residence. The clock chimed at just the right moment, but nothing out of the ordinary was heard by them.\n\nMiss Lilburne had been engaged to Mr. Eyre for some time, and she was very anxious to meet him on this occasion. She had heard many stories about him from her friends, and was eager to put them to the test.\n\nOn this particular Christmas Eve, Miss Lilburne and Mr. Eyre were both in high spirits. They had planned to spend the evening together, and were looking forward to it with great anticipation.\n\nAs the clock struck midnight, they heard a loud noise coming from the next street. It seemed to be a group of people shouting and cheering. Mr. Eyre suggested that they go out and see what was going on. Miss Lilburne agreed, and they decided to investigate.\n\nThey soon found themselves at the scene of a public demonstration. A crowd had gathered outside a local theater, and were cheering wildly for someone. Mr. Eyre recognized the person being cheered, and realized that it was a famous actor named Mr. Harley.\n\nMiss Lilburne was delighted to see Mr. Harley, and was eager to meet him. She approached him and introduced herself, and he responded with a warm smile.\n\nMiss Lilburne and Mr. Harley spent the rest of the evening talking and laughing. They exchanged addresses and made plans to meet up again soon.\n\nAs they walked back home, Miss Lilburne couldn't help but feel grateful for this unexpected turn of events. She had never seen anything like it before, and was sure that it would be memorable.\n\nWhether you believe in ghosts or not, these stories always seem to get our attention and make us wonder. They always seem to have something mysterious about them, even if it's just the setting itself.\n\nBut perhaps these stories are just that — stories. Maybe they're just meant to amuse us and keep us entertained. Who knows? But one thing is for sure: we'll never forget them.\nA PARISIAN MYSTERY.\n\nAn Affair Which Troubled the Paris Police.\n\nThe Singular Circumstances, the Accounting For Which Filled All the Criminal Experts in France—Seeking for Information.\n\n(From London Journal.)\n\nParis, where Edward King from Paris, is still one of my most valued friends, and where I have been engaged in the most intimate business relations with him for many years, has recently been visited by a mysterious and dangerous-looking band of criminals. They came to Paris in the early part of last month, and have been seen frequently about the streets, particularly near the opera house. They are said to be connected with the infamous gang of thieves who have been active in Paris for the past few weeks.\n\nThe police have been unable to trace these criminals, and they have disappeared without a trace. It is feared that they may be involved in some serious crime, and the authorities are anxious to find out more about them.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Prizes and Grand Prize Scheme.\n\nOver $1,000 worth of handsome prizes to be given away.\n\n150 Splendid Prizes.\n\nBalance of 1886 Press. Only $2 to 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nHOW TO MAKE A CUP OF EXCELLENT COFFEE.\n\nAt a Moment's Notice Anywhere.\n\nUSE Lyman's Concentrated Extract of Coffee.\n\nPrepared by a New and Successful Process.\n\nCHOOSE SELECTED COFFEES.\n\nFor Sale by Grocers & Druggists.\n\nTrial Size 6 cents a Bottle.\n\nFull directions with each bottle.\n\nTHE NEW RAYMOND SEWING MACHINE.\n\nFOR FAMILY USE.\n\nTHE FAVORITE SEWING MACHINE.\n\nCRELMAN BROS., CEDARFORD, ONT.\n\nTHE TORONTO WEEKLY MAIL.\n\nTHE MAIL.\n\nToronto, Ontario, Canada.\n\nSPECIAL OFFER.\n\nFor subscribers to THE WEEKLY MAIL, we will furnish THE WEEKLY MAIL for one year for 50 cents, making the price of both papers only 35 cents per week.\n\nWEBSTER'S PRACTICAL DICTIONARY.\n\nSpecial Offer.\n\nThe Nor'West Farmer.\n\nAND MARTHA MILLER.\n\n(Win, Lord, Editor.)\n\nHow to Subscribe.\n\nFree Press, Winnipeg, Man.\nEDGLEY.\n\nThe Edgley farm have reduced the wages of their men to winter rates.\n\nMrs. Frank Goodwin has been offered 65 cents per bushel for her wheat crop delivered at Qu'Appelle.\n\nMr. Wittingham, senior and junior, are preparing to spend the winter in Ontario.\n\nRev. Mr. Williams, of Moose Jaw, will preach in the Methodist Church on Tuesday next.\n\nRev. Messrs. Lawson and Williams, of Moose Jaw, will preach in the Methodist Church on the 29th inst. A public meeting will be held following the evening service, and will be addressed by Rev. Messrs. Lawson and Williams.\n\nINDIAN HEAD.\n\n— Grain is coming in very fast.\n\nThe municipal council meets on Tuesday next.\n\nD. H. McMillan & Co., have purchased a large lot of land near the town hall at Qu'Appelle Station.\n\nTHE MARKETS.\n\nWheat.\n\nReported by D. H. McMillan & Co.\n\n| Lot | Grade | Quantity |\n|-----|-------|----------|\n| 1   | 1st   | 100      |\n| 2   | 2nd   | 50       |\n| 3   | 3rd   | 25       |\n\nWe are authorized to say that any quantity of good wheat will find a market here.\n\nSTRAVED.\n\nStrayed the property of Qu'Appelle Station on an empty lot near the town hall, which was stolen from the yard of Mr. J. Smith, who lives near the station. The owner has been unable to locate his property, and has therefore placed a notice in the local paper. Any information regarding the whereabouts of the property should be sent to the editor of the local paper.\n\nMUNICIPALITY OF SOUTH QU'APPELLE.\n\nNOTICE.\n\nAll taxes in arrear from the year 1884, not paid on or before Dec. 1st, 1885, will be charged to the collector's hands for collection by order.\n\nA. C. PATTERSON\n\nQu'Appelle, Nov. 10, 1885.\n\nBlacksmith,\n\nT. WILSH,\n\nGeneral Blacksmith,\n\nQu'Appelle.\n\nJ. MCEWAN,\n\nGeneral Blacksmith,\n\nQu'Appelle.\n\nJ. B. ROBINSON,\n\nContractor, Builder,\n\nQu'Appelle.\n\nFor Boots & Shoes\n\nS. H. COLLINS\n\nQu'Appelle.\n\nWhere you will always get Prompt and every man's satisfaction.\n\nHandy & Ladies' Boots Made to Order.\n\nOrders from a distance attended to.\n\nOverhoses, Rubbers, Moccasins.\n\nNow on hand.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1885112701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 5052, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6252, 1], [6252, 11158, 2], [11158, 13849, 3], [13849, 16067, 4], [16067, 18100, 5], [18100, 20137, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]