[{"id": "71e2cd39645f4213d6667fc27dae0aee13e6893f", "text": "QU’APPELLE Monthly Cattle Fair\n\nThe undersigned will offer for sale at the above date, the following animals:\n\nSunrise, March 8—In the House of Commons yesterday, the Red question gave rise to a short but sharp discussion. Mr. Connel said the government had appointed a special committee to examine the situation in India and report the findings to him.\n\nMr. Davey replied, the question was not one which should have been raised at this time.\n\nMr. Goshen commented that the government appeared to be taking steps to prevent the spread of the Indian problem.\n\nParliamentary Notes\n\nST. LAURENT, Feb. 23—A huge public meeting was held here yesterday. It was the first such gathering since the rebellion. The meeting was attended by thousands who came from all over the province to claim their rights and demands.\n\nPRINCE ALBERT.\n\nNotice\n\nThe N.W.M. Police have distributed food and clothing to destitute Indians in the vicinity of Baie-Saint-Paul.\n\nSCHOOL DISTRICT OF SUMMERHILL\n\nVol. I No. I7. QU’APPELLE ASSIN, MARCH 1, 1886.—SIX PAGES.\n\nSchool District of Summerhill\n\nSEALABLE TENDERS, accompanied by a deposit thereon, must be received in the Principal Registry Office, before noon, Tuesday, the second day of February, 1886.\n\nNOTICE\n\nPUBLIC NOTICE! It has been officially announced by the Department of Industry that the Harbour Canal Act will come into effect on March 1st. Therefore, all tenders must be submitted in writing no later than midnight, Feb. 28th.\n\nTENDERS\n\nTo Register and obtain the necessary forms, go to the nearest Post Office.\n\nQU’APPELLE\n\nH. Keith\n\nJ. L. Malo\n\nJ. A. Mitchell\n\nJ. H. Murray\n\nJ. W. Macdonald\n\nJ. A. Macintosh\n\nJ. R. Maclean\n\nJ. B. Miller\n\nW. N. McLean\n\nE. H. Morris\n\nJ. W. Moran\n\nJames R. Love\n\nCharles J. Williams\n\nEdward Knowles\n\nWilliam E. Wright\n\nGeorge Smith\n\nH. S. Riggs\n\nG. W. Taylor\n\nJames Haslam\n\nFrank Jackson\n\nGoods and Chattels\n\nThe undersigned will offer for sale the following goods...\n\nBAILIFF’S SALE\n\nBy virtue of a warrant under Chaille v. Spicer, the undersigned will sell the following goods...\n\nIndian Head, Feb. 28, 1886.\n\nNOTICE\n\nPUBLIC NOTICE! It has been officially announced by the Department of Industry that the Harbour Canal Act will come into effect on March 1st. Therefore, all tenders must be submitted in writing no later than midnight, Feb. 28th.\n\nQU’APPELLE Monthly Cattle Fair\n\nThe undersigned will offer for sale at the above date, the following animals:\n\nSunrise, March 8—In the House of Commons yesterday, the Red question gave rise to a short but sharp discussion. Mr. Connel said the government had appointed a special committee to examine the situation...\nTHE CHICKENS WE LIKE\n\nThe Fort Qu'Appelle Vidoette last week quoted from The Progressor of Dec. 18, 1853, to endorse its point that \"the power that be,\" and from our issue of the 16th of February last, to show that we have changed, and that we are not consistent. Our contemporary places extraordinary emphasis on our inconsistencies in the above dates, in column side by side, and palms them off as evidence of its assertion that we have been purchased to change its position. The distinguished members of the Vidoette are not to blame. It is welcome to all the comfort it can extract from the excerpts if has chosen to publish. Its editor must be looking through very distasteful spectacles when he sees any inaccuracy in the publications of others. But let us investigate them. The one taken from our issue of the 16th of February is part of an article in which we discussed the election returns of the Northwest Council, for their action on the Lieutenant-Governor's address, and in which we say that the every correctly represented the almost unanimous views of the people of the Territorial District. Such was the purpose of the extract which the Vidoette says is opposed to \"the powers that be.\" The other excerpt, in which it proposes to see a change of tone, is a criticism of Mr. Jackson, who has attacked the members of the Northwest Council and his subsequent delivery of a speech at a banquet which was commonly described as \"a most unbecoming hostility toward His Honour Lieutenant-Governor Dewdney. In the latter extract we condemn Mr. Jackson for attacking Mr. Dewdney under circumstances that precluded the possibility of a reply. Surely, the Vidoette would ask where is the inconsistency? Is it necessary to remind the editor of the Vidoette that Mr. Jackson does not constitute the whole membership of the Northwest Council, that he is but one man, and even then only a recently acknowledged leader? But while even the extracts which our contemporary quotes will not bear the extravagant interpretation placed upon them, we would ask where is the inconsistency? Is it necessary to remind the editor of the Vidoette that Mr. Jackson does not constitute the whole membership of the Northwest Council, that he is but one man, and even then only a recently acknowledged leader?\n\nFROM THE CAPITAL\n\nIn the election for the Northwest Council in 1853, Mr. Jackson's opponent was Major Bell, one of the Hon. Mr. Justice. The whole campaign stock-in-trade was composed of bitter attacks on His Honour, Lieutenant-Governor Dewdney, and when he went to the very next session of the Council there was no difficulty in the election of Dewdney and nothing but the usual bitterness toward him. At the last session of the Council during the first of yr., Mr. Jackson made a move which was calculated to throw the council toward the chair of the session his bitter hostility was aroused, it was by none powerful personage. Nevertheless, in the course of his remarks he mentioned that he had been unable to attend the session, and in the course of his remarks he mentioned that he had been unable to attend the session, and in the course of his remarks he mentioned that he had been unable to attend the session, and in the course of his remarks he mentioned that he had been unable to attend the session.\n\nHONI SOET QUIMAL Y PENSE\n\nThe Vidoette of last week published a letter from Belle Plain over the name de plume \"Occident,\" in which the Vidoette and its editors are accused of being extremely cowardly, but it affects us more harm than good, as much as pouring water on a duck's back. That geographical enigma contains the epithet the Vidoette makes in reference to Mr. Jackson. The Progressor of Jan. 29th, in its comments on the Vidoette, says that Mr. Jackson did not defend himself against the charges brought against him by the Hon. Mr. Justice, and says that he cannot prove the charges he makes. And not having done so he was extremely extremely cowardly in regard to the charges made against him.\n\nAn Ottawa dispatch says that Judge Travis will either be dismissed or removed. The report is hardly credible, if it comes on the reports of Mr. Jackson, who is now in Ottawa with the object of securing his discharge. The Vidoette says that Judge Travis will be dismissed or removed. The report is hardly credible, if it comes on the reports of Mr. Jackson, who is now in Ottawa with the object of securing his discharge.\n\nAn Ottawa dispatch says that Judge Travis will either be dismissed or removed. The report is hardly credible, if it comes on the reports of Mr. Jackson, who is now in Ottawa with the object of securing his discharge.\n\nAn Ottawa dispatch says that Judge Travis will either be dismissed or removed. The report is hardly credible, if it comes on the reports of Mr. Jackson, who is now in Ottawa with the object of securing his discharge.\n\nAn Ottawa dispatch says that Judge Travis will either be dismissed or removed. The report is hardly credible, if it comes on the reports of Mr. Jackson, who is now in Ottawa with the object of securing his discharge.\nRapid City Ripples.\n\nMr. Woodworth has presented a petition praying that an act may be passed by the Dominion Government that will incorporate a railway company called the Brandon, Bathford & Edmonton Railway Company, the road to run via Rapid City.\n\nTHE DAILY INTEREST\n\nTo THE EDITOR:\n\nSir,—With the development of agriculture in Manitoba, and the increase shown by the farmers of this province in their cattle raising, it becomes quite natural that we should follow the example of other provinces and our Dominion Government, in order to protect our interests as regards dairy farming, and form a dairy association for the purpose of obtaining better prices. I therefore invite correspondence from any brother dairyman on this subject, and would urge that the question be thought desirable, of holding a convention of the dairymen of the province at Winnipeg during the summer season of next year, to take steps as may be necessary to form an association such as I have mentioned, and of other matters of mutual interest.\n\nWILLIAM WARDEN.\n\nCommissioner for Woodlands.\n\nOsborne, June 28th.\n\nThe greatest consolation to one growing up in the prairie surroundings which come with age, experience and wisdom. We are reminded of the recent appearance of the new Seal Annual of Mr. F. E. Ferry & Co., the celebrated stockbreeders of Danvers, Mass. The enjoyer of the enviable reputation of being the widest and best known firm in any business in United States. Many of the most prominent firms for profit and pleasure, have found several interesting publications and delightful in using. It is the annual containing seeds of the highest type and best quality, should secure the Annual. It can save on application.\n\nCONSUMER'S GUIDE.\n\nAn old proverb states that honesty having been placed in hands by an old Indian, insinuates the formula of a simple vessel containing water, and the secret art of constructing, Reinholds, Boots, Sashes, Artists and all kinds and Louis Al Gosselin, Messrs. N. J. Conklin, Messrs. Newton Debil and all Neurons Companys, also, having issued a wonderful series of pictures, which are now in circulation, and which are known to be suffering fellow sufferers. They are now prepared to receive human advice, and will send free of charge, to all who desire it, this recipe, in exchange for the names and addresses of persons for purchasing and using, may be had by addressing with stating, naming the person.\n\nW. A. DAVIS.\n\nRapid City, June 30th.\n\nA well-known man extended a Chatelaine street postoffice and waited to see what would happen. He said he was there for two dollars,\" said the newsboy. \"If I take them,\" said the man, \"I'll pay you another dollar.\" I'll put my end to your nuisance,\" exclaimed the newsboy. \"But show me your money,\" said the man, \"or I shall use my wilderness gun, desperately,\" said the newsboy. \"I shall use my shotgun in the back room,\" said the man. \"I shall use my shotgun in the back room,\" said the man. \"I shall use my shotgun in the back room,\" said the man.\n\nJ. MIMMACK\n\nISSUER OF MARRIAGE LICENSES,\n\nRAPID CITY\n\nIf U want a Sewing Machines Organ or Piano, consult\n\nJAMES WEIDMAN,\n\nAgent.\n\nTHE NEW\n\nRAYMOND\n\nSEWING-MACHINE\n\nFOR FAMILY USE.\n\nHIGH GRAIN HIGH FINISH.\n\nAutomatic Bobbin Winder.\n\nCHAS. RAYMOND,\n\nGuelph, Ontario.\n\nLYMAN'S UNIVERSAL PAIN RELIEVER FOR Frost Bites, Cramps, Rheumatism, Neuralgic Affections, Tic Douloureux.\n\nSafe Mild Strong Pure\n\nEvery description of BOOK AND JOB PRINTING.\n\nThe Qu'Appelle Progress.\n**HOME & GOSSIP**\n\n**QU'APPELLE**\n\nThe hotel registers are crowded out.\n\nThe March monthly fair takes place tomorrow.\n\n**THE PRESBYTYRE**\n\nOffice will be removed to larger and more central premises next Monday.\n\nA large number of lodgers from America have been coming in and going out the last few days.\n\nA well selected stock of stationery will be advertised next week in connection with Thomas Parsons at Messrs. J. P. Beauchamp's old shop.\n\nIf any persons, Johnston & Gregg's carnival did not take place on Sunday evening last. Owing to the appearance of some number appeared to contemplate it was postponed until further notice.\n\nA missionary meeting was held last evening at the Presbyterian Church by Rev. Mr. Urquhart, Mrs. McLean, Rev. Mr. Bevan and Mr. Mrs. Edwards. It was arranged under the leadership of Governor Dowden.\n\nMr. Bennett's letter of resignation as Clerk of the Indian Office at Regina may be seen here May 7th or 8th.\n\n**HOPE**\n\nRev. Mr. J. P. Beauchamp has moved his personal shop business into new larger and commodious premises erected by Messrs. Johnson & Davidson just north of Government House. Beauchamp will now have lots of room to attend to his numerous customers.\n\nThe Education school trustees held their regular meetings last Wednesday, at which the Trustee ten members present, viz. J. H. Fraser, Secretary; Duncan and George Maclean.\n\nJ. H. Fraser was elected chairman of the board, and F. Goudreau was elected secretary.\n\nOn Friday last was opened the newly erected school at Maltese Hall for the purpose of applying for the purpose of raising money for the erection of a new building, Mr. James Macintosh also attended to organize the sale of lots.\n\n**REGINA PRESBYTERRY**\n\nNext Thursday evening, Messrs. G. H. V. Bulyon will give a basket auction in aid of the Presbytery.\n\nThere he was purchased at a heavy loss by the Rev. Mr. J. H. Ferguson who has a very large number of members called upon him there for many years past.\n\n**MOFFAT**\n\nIt had been decided last month by synod to change the name of this district from Moffatville to Moffat, avoid the recurring confusion.\n\nA number of the names are still used along with others.\n\n**WOLSELEY**\n\nThe first setting of stone took place on Tuesday last, and the church was opened for service on the opening day.\n\n**MAKOSKA**\n\nA banquet has been given in celebration of the opening of the Mission.\n\n**PARSONAGE**\n\nThe new parsonage has been completed and occupied by Mr. Wilson.\n\n**MARCH FIELD**\n\nA new field was donated by Mr. Watson, who has since been removed from the field.\n\n**ROSS**\n\nThe first service at Ross was a great success.\n\n**MCALLUM**\n\nThe McAllum Presbyterian Church was opened for worship last Sunday.\n\n**MONTROSE**\n\nA new church has been built at Montrose.\n\n**MALTESE HALL**\n\nThe new hall was opened last week by Mr. McFaul, who presided over the opening ceremony.\n\n**MENNONITE**\n\nThe Mennonite Church was opened for worship last Sunday.\n\n**GEOGRAVAN**\n\nA new school has been built at Geogravan.\n\n**CROWFOOT**\n\nA new school has been built at Crowfoot.\n\n**SHAWANAGON**\n\nThe Shawanagon Presbyterian Church was reopened last Sunday.\n\n**THOMPSON**\n\nThe Thompson Presbyterian Church was reopened last Sunday.\n\n**HAIRY CAVE**\n\nThe Hairy Cave Presbyterian Church was reopened last Sunday.\n\n**HINTON**\n\nThe Hinton Presbyterian Church was reopened last Sunday.\n\n**HANCOCK**\n\nThe Hancock Presbyterian Church was reopened last Sunday.\n\n**LAKE NITCHEZ**\n\nThe Lake Nitchez Presbyterian Church was reopened last Sunday.\n\n**MIDDLEIVER**\n\nThe Middleiver Presbyterian Church was reopened last Sunday.\n\n**STINKY LAKE**\n\nThe Stinky Lake Presbyterian Church was reopened last Sunday.\n\n**MINNIAMINNETA**\n\nThe Minniamintna Presbyterian Church was reopened last Sunday.\n\n**GRAND FORKS**\n\nThe Grand Forks Presbyterian Church was reopened last Sunday.\n\n**ST. PAUL**\n\nThe St. Paul Presbyterian Church was reopened last Sunday.\n\n**RIVERDALE**\n\nThe Riverdale Presbyterian Church was reopened last Sunday.\n\n**TRUMPET**\n\nThe Trumpet Presbyterian Church was reopened last Sunday.\n\n**RESPONSE**\n\nThe Membership Response Policy of the Presbyterian Church of Canada is to assist members in their personal and corporate religious growth and development.\n\n**MEMORIAL**\n\nThe Memorial Presbyterian Church was reopened last Sunday.\n\n**THERCHER**\n\nThe Thercher Presbyterian Church was reopened last Sunday.\n\n**CORRESPONDENCE**\n\nTo the Editor:\n\nSir,—Can you find room in your valuable paper for a brief financial statement with regard to R. Peter's estate, Qu'Appelle? Enclosed is an itemized list of gifts given by kind friends in England and elsewhere, a sum close upon £200 having been paid by friends of Lord Granville, and I think the warmth of interest shown by them in their undertaking, and especially to those whose names appear, with Mr. John Milne's will, which bears a reproduction of Mr. Milne's own handwriting, should be appreciated.\n\nThe subscription list that was sent out included the names of all those who had made up their minds to pay for Mr. Milne's funeral expenses.\n\nEnclosed also is a receipt with the full stamp, so that the late owner's bequest to the Church in honour of his name may be realized, the balance being transferred to the Presbyterian Church in Scotland.\n\nI am heartily obliged,\n\n[Signature]\n\nP. R. Macmillan\n\n**HOUSE OF ADVISERS**\n\nThe Presbyterian Church of Canada is a member of the World Council of Churches.\n\n**ENTERTAINMENTS**\n\nThe following entertainments will be held at the Presbyterian Church at different times during the year:\n\n- **Christmas Dinner**: December 25th.\n- **New Year's Dinner**: January 1st.\n- **Easter Dinner**: April 2nd.\n- **Thanksgiving Dinner**: November 23rd.\n- **Veterans' Dinner**: November 11th.\n\n**CHRISTMAS MESSAGE**\n\nMay your Christmas be filled with joy and peace.\n\n**TEACHER WANTED**\n\nFor Qu'Appelle School District. Apply immediately to Superintendent.\n\n**NICE HOME**\n\nNICE HOME for Sale at Qu'Appelle.\n\n**LOVE LETTERS**\n\nLOVE LETTERS received at the office of Qu'Appelle Town Site.\n\n**AGREEMENT**\n\nAGREEMENT between the Hon. Mr. Justice Mitchell and Mr. Justice Gibson.\n\n**NEW HOUSE**\n\nNEW HOUSE for Sale at Qu'Appelle, Saskatchewan.\n\n**QU'APPELLE**\n\n**Teacher Wanted**\n\nFor Qu'Appelle School District—Apply immediately.\n\n**Leslie Gordon**\n\nAGRICULTURAL OFFICER\n\nCOMMISSIONER FOR MANITOBA\n\nAgent for Canada North West Land Co., and Qu'Appelle Town Site.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886030501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4160, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2635, 1], [2635, 7722, 2], [7722, 11211, 3], [11211, 17612, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]