[{"id": "14c3648fe6d19099e3c98196f2ff0aa12f03c262", "text": "Holy Catholic Church\n\n\"Its Continuity in England.\"\n\nA Lecture delivered by the Bishop of Quilipglo, Jan. 28.\n\nConsider from the point of view of the Church at large, what is the present condition of the Church in England? It seems evident that there is a great deal of confusion and division within the Church. The question arises whether the Church in England is still a true continuation of the primitive Church. The Bishop of Quilipglo addressed a lecture on this topic, emphasizing the importance of maintaining the continuity of the Church.\n\nThe lecture discussed various aspects of the Church's history, including the role of bishops and the importance of preserving the traditions of the Church. The Bishop highlighted the need for unity and cooperation among members of the Church, especially in times of division and confusion.\n\nThroughout the lecture, the Bishop emphasized the importance of maintaining the integrity of the Church's teachings and practices. He encouraged listeners to reflect on their own faith and to strive for greater understanding and communion within the Church.\n\nIn conclusion, the Bishop called upon all members of the Church to work together to maintain its continuity and to preserve its rich traditions. He reminded listeners of the importance of faithfulness to the teachings of Christ and the Apostles, and urged them to remain steadfast in their commitment to the Church.\n\nThis lecture serves as a reminder of the ongoing challenges faced by the Church today, and the importance of maintaining its continuity and integrity in the face of these challenges.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing and securing payment. We can much better afford to publish a paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting accounts at a higher figure. Besides, we will at once be able to secure a larger circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nFabrics,\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingle and Double Stalls for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\nKept Constantly on Hand at the Lowest Prices.\nCoal Field for Rides & Skins QU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\nFor First Class Rigs.\nDaily Mail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public that Qu'Appelle and vicinity that he has new stock of Harnesses and Saddles.\nLargest & Best Assorted Stock West of Brandon\nCONSISTING OF\nHarness, Saddles, Whips\nBELLS, BLANKETS,\nCirclemolds, Combs and Brushes.\nALL KINDS & SIZES OF\nTrunks and Valises.\nAgent for Carriage & Buggy Tops\nREMEMBER THE PLACE\nPioneer Harness Shop\nQU'APPELLE.\nJOHN & MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON\nFORWARDERS.\nAND DEALERS IN\nLumber, Lath, Shingles\nDOORS, SASH\nBuilding Paper, etc.\nOffice West of C.P.R. Station.\nQU'APPELLE.\nBRANCH AT FORT QU'APPELLE\n\nA. S EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\n\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\nSUITES FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\nGENERAL STORE.\n\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\nA large proportion of this Company's Lands is in thickly settled Districts.\nFor information, Plans and Maps, apply at the offices of the Company, 41 Gordon street,\nEdinburgh, Scotland; 75 Leonard street, London, England; 162 King street, Toronto, Canada;\nManhattan, New York.\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway\nBetween Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESLEY GORDON.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\nPROPRIETORS\n\nFURNITURE, FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSIX PAGES, THIRTY COLUMNS.\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing DEPARTMENT\nEXECUTIVE\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nMr. Andrew Patterson, manager of the climatic factory, has written as follows in the Rapid City Examiner, June 19th:\n\n\"A large number of letters and reports concerning the new factory have been received. I am pleased to inform you that the business conducted by the company is in every respect satisfactory. The house is now well furnished with machines and everything necessary for the comfort of the tenants. The climate is agreeable and the air is wholesome.\n\n\"The company is pleased to inform you that they have employed a number of women to assist in the work. The wages are fair and the conditions of employment are favorable.\n\n\"I would like to urge upon you the importance of joining the company and enjoying the benefits of the new factory.\"\n\nSubscription Office\n\nSubscription Office, Rapid City, does not make any claims for the quality or authenticity of Mr. Patterson's letter. They offer their condolences to anyone who may have been affected by the contents of his message.\n**Holy Catholic Church**\n\n\"Its Constitution in England.\"\n\nA Lecture delivered by the Bishop of Chester before the Queen.\n\nConfessedly since ancient ages.\n\n---\n\n**HOME & GOSPEL**\n\n**GUADALUPE**\n\nMoral item first page\n\nThe Regina presbytery meets here Monday next.\n\nRemember the March monthly fires to be held here Saturday March 9th.\n\nMay, Johnson and Garrell's second attempt takes place tomorrow evening.\n\nRev. J. Peck will occupy the Methodist pulpit here next Sunday evening; Mr. H. Lawson will be in Moosejaw.\n\nCapt. Wm. Clark, Government Grain Inspector, has been sent north to inspect the Saskatcheewan settlers.\n\nMr. B. Lamberton, has secured some land from the Indians north of Qu'Appelle river with wheat.\n\nFire prevention means a plenty of firewood must be available; this should receive the attention of the meeting this evening.\n\nFear that fire teams are not on duty, or that the men have abandoned their stations, for the purpose of fighting from this point north.\n\nThe new North of Scotland Loyal Corps, was in town this week. He was one of several bands who played on Monday.\n\nOn Monday Miss Flora Grivie, one of the school children, fell into the well near the church Sunday afternoon for about three minutes; she appeared to be unconscious for a number of seconds after regaining consciousness.\n\nIt has been decided to forward firewood to all the villages of the settlement for the purpose of fighting from this point north.\n\nThe Deputy Inspector of the North of Scotland Loyal Corps, was in town this week. He was one of several bands who played on Monday.\n\nAttention is directed to the ad-\n\nvertised sale this Friday. Wright Sons, in another column,\n\nThis proposal is proper for sale at the present moment, but will be made at no time in the future until a large sum of money is raised by the trust farmers and others in the village who will follow the example set by this firm in endeavoring to make this fair a success.\n\nWe notice a decided improvement in the singing of the English church school last two of the Sundays. This should encourage the parents to give the best portion of their attention in their efforts towards making the service worthy of their beautiful church and in all order with our beloved Bishop. The resultant of this combination only will ensure this.\n\nOn Saturday last a matched skiff race took place between Qu'Appelle lake, between the villages of Indian Head and this place resulted in the victory of this side by a margin of six to seven yards. The races were:\n\nH. B. Everts:\nHenry McPheaden:\nAugustus E. Gibbon:\nE. F. Prather:\nProf. N. D. Smith:\nMr. Stovall:\nG. W. McCann:\nWm. Ryan:\nAlexander Muir:\nH. J. Wilson:\nC. M. Macdonald:\nJames Watson:\nJackson Taylor:\nJ. H. Griffin:\nH. E. Goodwin:\nA. C. Murray:\nAllan Macdonald:\nR. J. Ferguson:\nJ. W. Smith:\nEdward Smith:\nJohn Smith:\nJames Hawkins:\nJames White:\nAlexander Macdonald:\nGeorge Macdonald:\nRobert Macdonald:\nJohn Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\nAndrew Macdonald:\nRobert Macdonald:\nJames Macdonald:\nDavid Macdonald:\n\n---\n\n**SCHOOL DISTRICT OF SUMMERBURY**\n\nProtestant Public School District No. 36 of the N.W. Territory.\n\n**Special Public Meeting**\n\nTo elect directors of the summer district to be held at noon March 8th.\n\nFRIDAY MARCH 12, 1886.\n\nFor the purpose of taking a vote on the question of electing directors of the special summer district to be held at noon March 8th.\n\nThe resolutions adopted at the school board meeting of March 8th.\n\n---\n\n**JAMES H. LOWE**, School Board of Directors.\n\nPrinted at Summerbury, the eighth day of February, 1889.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886022601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9040, "total-output-tokens": 2994, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1597, 2], [1597, 5506, 3], [5506, 5506, 4], [5506, 6493, 5], [6493, 11254, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]