[{"id": "ee20869dcdb444c55d901a80053e386279fb2907", "text": "NOTICE\n\nWanted, A Second Hand wagon.\n\nAddress, W. H., Box 28, Qu'Appelle.\n\nPublic Notice\n\nSPRING COAL SALE\n\nAll parties are hereby notified that the undersigned committee have petitioned the Board of Education to sell the Spring Coal School district which was bought by the Board in 1895 for $1,400. The sale will be held at the schoolhouse on January 16th next, at 10 o'clock A.M. The proceeds will be used to purchase coal for the school.\n\nNotice\n\nNOMINATION!\n\nA SPECIAL MEETING OF THE COUNCIL OF THE MUNICIPALITY OF ST. PETER'S, QU'APPELLE\n\nWill be held at Mr. McKeown's Hotel, Town of Qu'Appelle, on MONDAY, DEC. 28, 1885.\n\nPersons desiring to be nominated for the office of alderman, for the purpose of nominating seven aldermen, are requested to present their names to the undersigned at the office of the Secretary of the Council, Town Hall, Qu'Appelle, Dec. 17th, 1885.\n\nNOTICE\n\nThe undersigned hereby give notice that the North-West Central Rail Road Company, Limited, has been incorporated under the laws of Canada, and is now doing business as the North-West Central Rail Road Company, Limited, and is entitled to receive all the benefits of the Act of Parliament of Canada, passed July 13th, 1885.\n\nToronto, Nov. 20th, 1885.\n\nJAMES BEATTY,\nPresident of the N.W.C.R.C.\n\nAVIS\n\nA VIS is hereby given to all persons who may desire to purchase the land situated in the Township of Qu'Appelle, near the town of Qu'Appelle, which is being sold by the North-West Central Rail Road Company, Limited, at public auction, on December 28th, 1885, at the town hall, Qu'Appelle.\n\nMrs Stone & Murdock\n\nThe Qu'Appelle Skating Rink\n\nThe Largest and Best Ice Rink west of Winnipeg, for skating and hockey.\n\nJOHNSTON & GORRELL,\nQu'Appelle, Dec. 28th, 1885.\nMR. G. B. Laycock has just put in under indictment against him by sending us the Apalachee Pioneer, the hire number of which was published on 1 July last. We are informed that Mr. Laycock is also in the same boat as Mr. Mitchell. We may say that he must have been very much mistaken if he thought that by printing this paper he could escape the law. As Mr. Mitchell can produce the evidence before the court, no doubt Mr. Laycock will be found guilty and punished accordingly.\n\nIn conclusion, we would urge upon all our readers the utmost caution in reading newspapers, especially those from distant places, and to make sure they are authentic before believing anything printed therein.\n\nPublisher's Notice\n\nOUR RATES\n\nSubscription rate, $1.00 per annum, payable in advance.\n\nSubscription price, $1.00 per month, payable in advance.\n\nBusiness card, $25 per month, payable in advance.\n\n\"LEADER\" NOT LEADING\n\nThe regular leader of The Leader previous to December 10th would form the impression that the paper might come to be a champion of the interests of the settlers in the Northwest, but on reading the issue of that paper of the above date, he must have turned it over several times and must feel it is not leading by any means. Having satisfied himself on that point; his preconceived ideas of that paper as the advocate of the people's interests, must have been rudely dispelled. In preparing their address in reply to Lieutenant-Governor's speech, the Northwest Council gave expression to certain sentiments held almost universally by the settlers in the province. While desirous of doing so in an exclusively vigorous manner, they must have realized that such a course must necessarily lead to serious complications growing out of the present uncertain state of affairs. Not only must their words cut deep into the heart of many who do not agree with them, but their actions must also be watched with suspicion. The regular readers of The Leader will notice that in its recent issues there has been a noticeable change in the style of writing. Instead of the usual dull and tame articles, we find now fresh and vigorous expressions which cannot fail to attract attention. The reasons given for these changes are not clear at this juncture, but they seem to indicate a new spirit prevailing among the editors of the paper.\n\nCorrespondence\n\n[For want of time and space the following letter was not held over until this issue.]\n\nMAGISTRATE'S COURT\n\nTo the Editor:\n\nSir: Permit me through the medium of your journal to reply to Mr. Vodina's article of the 26th ultimo, under the signature \"A Voice,\" so far as I am concerned at the last examination. It seems that the witnesses were made to swear before a Justice of the Peace that they had seen me in company with the said Mr. Fisher, and I believe that if I had been there it would have been more proper to have had both of us sworn as witnesses rather than to have sworn separately.\n\nMR. G. B. Laycock has just put in under indictment against him by sending us the Apalachee Pioneer, the hire number of which was published on 1 July last. We are informed that Mr. Laycock is also in the same boat as Mr. Mitchell. We may say that he must have been very much mistaken if he thought that by printing this paper he could escape the law. As Mr. Mitchell can produce the evidence before the court, no doubt Mr. Laycock will be found guilty and punished accordingly.\n\nIn conclusion, we would urge upon all our readers the utmost caution in reading newspapers, especially those from distant places, and to make sure they are authentic before believing anything printed therein.\n\nElectric Killing.\n\nAnother possible application of electrical current by means of bent needles is described in an appearance given by Mr. George L. Fox, of London, to the Australian Electrician. Referring to the subject of animals, he says:\n\n\"It seems to me exceedingly promising. In Australia there are large numbers of cattle, sheep, and horses that are killed annually by electric shocks. At present, however, this method of killing is used only on rare occasions.\"\n\nAs psychologists insist that the human body requires about one millisecond of a second for the brain to react to an electric shock, Mr. Fox believes that the animal is therefore able to perceive the intensity of the shock and consequently avoids the full impact of the current.\n\nAccording to Mr. Fox, the animals have become accustomed to the frequent applications of low-voltage shocks, and are therefore less susceptible to the effects of higher voltages. This discovery has opened up possibilities for the use of electric shocks in various fields, including agriculture and industry.\n\nWhile the method is still in its early stages, Mr. Fox hopes that it will provide a humane alternative to currently used methods of animal handling and slaughter.\n\nProtest.\n\nMr. J. C. Laycock has just put in under indictment against him by sending us the Apalachee Pioneer, the hire number of which was published on 1 July last. We are informed that Mr. Laycock is also in the same boat as Mr. Mitchell. We may say that he must have been very much mistaken if he thought that by printing this paper he could escape the law. As Mr. Mitchell can produce the evidence before the court, no doubt Mr. Laycock will be found guilty and punished accordingly.\n\nIn conclusion, we would urge upon all our readers the utmost caution in reading newspapers, especially those from distant places, and to make sure they are authentic before believing anything printed therein.\n\nRichardson.\n\nRichardson.\n\nRichardson.\n\nRichardson.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every paper which is paid for, than that we risk the chance of collecting accounts at a higher figure. Besides we will thus speedily secure a larger circulation, which will enhance the value of our advertising columns, and will be sure to bring to your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from new till January 1st, 1887.\n\nFabrics.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\n\nQU'APPELLE ST.\n\nSingle and Double Rigs for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\n\nKept Constantly on hand at the Lowest Prices.\n\nCash Paid for Hides & Skins\n\nQU'APPELLE.\n\nL. W. MULHOLLAND\n\nLIVERY,\n\nFeed and Sale Stable\n\nFor First Class Rigs.\n\nDaily Mail Stage to Fort Qu'Appelle,\n\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has now on hand the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bells, Blankets, Circles, Combs and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\n\nAgent for Carriage & Buggy Tops\n\nREMEMBER THE PLACE\n\nPioneer Harness Shop\n\nQU'APPELLE.\n\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON\n\nFORWARDERS.\n\nAND DEALERS IN\n\nLumber, Lath, Shingles\n\nDOORS, SASH\n\nBuilding Paper, etc.\n\nOffice West of C.F.E. Station,\n\nQU'APPELLE.\n\nBRANCH AT PORT QU'APPELLE.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\n\nGents' Furnishings, Boots & Shoes,\n\nFURS OF ALL KINDS\n\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\n\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nOF THE\n\nTOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\n\nPROPRIETORS\n\nFURNITURE, FURNITURE.\n\nHAVING LATELY SECURED\n\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\n\nAT PRICES THAT DEFY COMPETITION.\n\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE\n\nQu'Appelle Progress\n\nIS PUBLISHED\n\nEvery Friday Morning,\n\nAT THE OFFICE, QU'APPELLE STATION.\n\nSIX PAGES. THIRTY COLUMNS.\n\nSubscription $1.00 a Year Invariably in Advance\n\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE\n\nBook & Job Printing\n\nDEPARTMENT\n\nEXECUTES\n\nEvery Description of Printing\n\nNEATLY, CHEAPLY & QUICKLY.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\n\nAND DEALER IN\n\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\n\nSPECIAL PRICES ON WHOLESALE LOTS.\n\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION.\n\nLove & Raymond,\n\nPROPRIETORS.\n\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\n\nSUITES FOR FAMILIES.\n\nTERMS MODERATE.\n\nS. H. CASWELL,\n\nGENERAL STORE,\n\nBANK,\n\nPOST OFFICE,\n\nQU'APPELLE.\n\nThe Canada North-West Land Co.\n\n(LIMITED)\n\nOffer for Sale\n\nSELECTED FARM LANDS\n\nin Manitoba and the North-West Territories,\n\nNear the Canadian Pacific Railway Main Line\n\nA large proportion of this Company's Lands is in thinly settled Districts.\n\nFor Information, Prices and Maps, apply at the Office of the Company, 14 Macdonald, Edmonton, or to Mr. W. B. Scarth, 17 Gordon's Road, London, England; also at Winnipeg, Manitoba.\n\nW. B. SCARTH\n\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\n\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAGENT IN QU'APPELLE FOR LANDS AND OTHER LOTS.\n\nLESLEY GORDON.\nNotice.\n\nPublic Notice\n\nThe Nor-West Farmer\n\nWants Manitoba\n\nAnd the North West\n\nTo Yield up their Return to The Farmers\n\nThe Nor-West Farmer\n\nAnd Manitouville\n\nHelp Along Our Good Work\n\nBy joining in Our Subscription.\n\nOnly $1.00 Per Year\n\nTo everyone who subscribes before February 1st, we will give them a copy of the book \"Our Own,\" from our own publications; and if they subscribe after February 1st, we will give them a book of 32 pages, from our own publications.\n\nWe are doing our best to bring about a new era of prosperity in the North West, and we urge all farmers to join us in this movement.\n\nThe Nor-West Farmer\n\nAnd Manitouville\n\nClaims of Half Breeds and original white settlers of the province of Manitoba.\n\nWHEREAS, since the completion of the survey of the whole of the province of Manitoba, there have been many claims made by half-breeds and original white settlers for land or other benefits.\n\nNOW, be it known that the undersigned, the members of the Board of Directors of the Nor-West Farmer, do hereby declare that the claims made by half-breeds and original white settlers for land or other benefits are invalid and should not be recognized.\n\nThe Nor-West Farmer\n\nAnd Manitouville\n\nHelp Along Our Good Work\n\nBy joining in Our Subscription.\n\nOnly $1.00 Per Year\n\nTo everyone who subscribes before February 1st, we will give them a copy of the book \"Our Own,\" from our own publications; and if they subscribe after February 1st, we will give them a book of 32 pages, from our own publications.\n\nWe are doing our best to bring about a new era of prosperity in the North West, and we urge all farmers to join us in this movement.\n\nThe Nor-West Farmer\n\nAnd Manitouville\nRapid City Ripples.\n\nThe annual meeting of the County Agricultural Society No. 1 was held in Burdick's hall on Monday last.\n\nThe best wheat that is being sold at Burdick comes from north of the Assiniboine River; that of course is the best variety.\n\nMr. J. E. Munro of Rapid City, while unloading machinery at Maxwell & Co.'s warehouse here, was severely injured by a falling pipe and cut the flesh of his face close to the eye. He received an ugly gash.\n\nWould not it be well for our citizens to take one more vote petitioning the Dominion Parliament to grant the same charter to the Northern Central Railroad Co., as it appears to be in a position to go on with the building of the road early in the spring?\n\nFACTS AND FIGURES.\n\nMore than a hundred thousand acres of sugar-beet land is planted in Mani- toba this year, according to reports.\n\nThe average life of a locomotive is thirty years. During its service, it is said, it will travel about 300,000 miles.\n\nLast season in Texas the ex- ploits of a gang of thieves who stole 600,000 acres was disposed of in a lump sum of $25,000.\n\nThe manufacture of carriages and buggies requires a large amount of capital, keen hands, and yield a good profit. The cost is $4,252 per annum.\n\nAgricultural statistics show that the production of wheat and flax exceeds the demand. If poor crops, however, the prices will fall, and the prices of agricultural products will rise.\n\nOne man employs twenty-four stevedores in loading grain from the Mediterranean coast into New York vessels. Twenty-five of these are passenger vessels whose cargoes consist entirely of fruit. The other vessels are loaded with grain, which is composed mostly of rice.\n\nThe 2,000 women mills in the province employ 10,000 women workers, and pay for it $1,000,000 annually. The wages paid are worth $500,000 annually, and the women work from nine to five, and earn a dollar a piece. More than half of the women working in the mills are employed in the weaving department, and the wages paid are considered cheap.\n\nA Father Rebuked.\n\nColonel McClelland, although not a hard man, had a habit of beating his wife in the interview with his family. On returning to his home from his place of business, he found his wife crying. His wife very much excited over the occurrence, and told him that she was being mistreated with the usual force and severity. Colonel McClelland, however, was most outrageous manner, though he had been away but ten years old. When you heard that woman crying, you thought she was crying because she was afraid, or was she crying because she was hurt? You thought she was crying because she was afraid, or was she crying because she was hurt? You thought she was crying because she was afraid, or was she crying because she was hurt?\n\nJohnny unconsciously administered a severe beating to his wife, who never again spoke to his wife as if he were a trained animal.\n\nCorinthian Lodge No. 15\n\nW. J. WELLS, Secretary\n\nAttorneys, Solicitors, Notaries, Conveyancers, etc.\n\nSecond Avenue, Rapid City\n\nMoney to Loan\n\nDavid Butchart,\n\nT A I L O R,\n\nNext Door to Standard Office,\n\nRapid City.\n\nNew Suits Made. Boarding and Cutting done on the premises.\n\nQUEEN'S HOTEL\n\nRAPID CITY\n\nGood Board and Lodging\n\nTHOS. HUDELL Prop.\n\nMRS. D. BUTCHART\n\nWishes to announce that she is prepared to give board and lodging to any person who will give her a chance.\n\nMeals and Lodging\n\nSPECIAL OFFERS\n\nHOW TO SUBSCRIBE.\n\nEnroll Two Dollars in registered letter writing name and postoffice very plainly and address to FREE PRESS, WINNIPEG, MAN.\nHOME & GOSSIP\n\nQU'APPELLE\n\n—Christmas.\n\nOur hotels are getting up special dinners today.\n\n—May wished all merry christmas and a happy new year.\n\nMr. E. Crawford, postmaster, Indian Head was in town Wednesday.\n\nNext Monday is the appointment for the nomination of municipal councillors.\n\nThe time has been changed in the running of the tram going east. It now passes at 12.30 p.m.\n\nChristmas service (half hour) will be celebrated at noon on Christmas day, December 25th, in the English Church (8).\n\nThe skating ring will be open today (Christmas day) from 9 a.m. and run until 8 p.m. All who are learners are requested to be on hand for practice at 6 p.m.\n\nFort Qu'Appelle opens on Christmas day for the morning only, for the convenience of persons wishing to get their letters. Call or send orders for mail to be carried away during the time named.\n\nThe entertainment on Thursday evening last in the immigrant building was very successful, and whilst not the English church, was a decided success. Every part of the programme met with general approval, and great credit on our local talent, and was enjoyed by a large attendance.\n\nThe following are now understood to be amongst the best-known citizens of our municipality:\n\nMessrs. A. M. McLane, T. T. Hos-\n\nson, J. R. Reed, John Grace, A. McCrum, and T. V. Kane were selected last night, and we have been in close touch with them regarding the difficulties connected with that part of the municipality.\n\n——Paul Christian got up an impromptu meeting yesterday afternoon, a portion of which was devoted to proceedings from the Pioneers office to oppose the question of a “Union” sign and flag among other matters, but this was hotly disputed by others present.\n\n——A tea and entertainment will be given by the ladies and friends of the Ferguson family in honour of the eldest son of Mr. and Mrs. Ferguson, on Tuesday, Dec. 24.\n\n——Oyster soup will be served from 7 to 8 p.m., and the dance will be started promptly after it. Everyone is invited to attend.\n\n——The Grade school children went Saturday afternoon to the Government immigrant buildings, where an excellent program was given featuring songs, recitations, etc. Administration costs were charged.\n\n——On Monday next the election of members of the municipality will take place. All who are interested should vote.\n\n——Indian Head has two council meetings a month, and its business is managed by a few honest and well-meaning men.\n\n——Indian Head Town Council.\n\nCOUNCIL MINUTES\n\nQU'APPELLE\n\n——Notice of a municipal election will be issued at a later date.\n\n——Mr. E. Crawford, postmaster, was elected unopposed as councillor for three years.\n\n——Mr. A. M. McLane was elected by unanimous vote as councillor for three years; he was sworn in by Mr. Robertson.\n\n——Mr. T. T. Hosson was elected unanimously as councillor for three years; he was sworn in by Mr. Robertson.\n\n——Mr. T. V. Kane was elected by unanimous vote as councillor for three years; he was sworn in by Mr. Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1885122501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9040, "total-output-tokens": 4850, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1749, 1], [1749, 7348, 2], [7348, 11222, 3], [11222, 12913, 4], [12913, 16469, 5], [16469, 19447, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]