[{"id": "f235f64f4ca99ff30a293df48d75e2feeed759f7", "text": "MUNICIPALITY OF South Qu’Appelle.\n\nNOTICE.\n\nApplications for the office of Assessor for the rate year 1896, will be received till 3 o’clock this afternoon. — Qu’Appelle County Surveyor.\n\nWelland Canal Enlargement.\n\nCALL FOR CONTRACTORS.\n\nSENIOR TENDERS addressed to the Quebec and South West Land Company, Ltd., Welland Canal Company, Ltd., MACKENZIE, ONTARIO, CANADA, January 15, 1896, for the construction of a new lock on the Welland Canal at Mackenzie, Ont. — Quebec and South West Land Co.\n\nPUBLIC NOTICE.\n\nSINTALUTA SCHOOL.\n\nAll parties are hereby notified that the Board of Trustees has received an application from the school committee of the said school for an increase in its present annual appropriation. — Superintendent.\n\nRussell & Davis,\n\nWholesale and Retail Dealers in\n\nBEEF, POULTRY,\n\nMUTTON, SAUSAGE,\n\nHAMS, BACON, ETC.\n\nALWAYS ON HAND.\n\nTerms Strictly Cash\n\nQU’APPELLE STATION.\n\nBRANCH—FT. QU’APPELLE.\n\nCorrespondence.\n\nSir,—If the reports coming from Indian Head are true, the Aborigines on the Reserve may be getting it right, as they say they “want to go back to their old way” and they indicate that they have lost much of their traditional way of life through the influence of European settlers. Would you agree with this assessment?\n\nTHE JACKSON BANQUET.\n\nLast evening, the starvation of the Qu’Appelle District assembled in grand form to honor Sir Herbert Parsons, nephew and son of Sir Edward Parsons. Sir Herbert is well known as one of the greatest of the day, and he presented quite a number from the Council Town, who were there in honor of his visit. He began the evening with a hearty greeting to all present, and proceeded to conduct the festivities in a most pleasant manner. Mr. Jackson, the Chairman of the District, made a few complimentary remarks concerning the evening’s event, and then proceeded to present the evening’s entertainment, which was provided by Messrs. J. L. Pogue and Mr. Kavanagh. The Hon. Mr. Johnson, H. Noble, M.P., addressed the gathering, and then asked Mr. Jackson to make a few words in conclusion. Mr. Jackson then presented a speech, which was received with great enthusiasm. Mr. Jackson then proceeded to sing a song in honor of Sir Herbert, and the evening ended with a hearty toast to Sir Herbert and his family.\n\nQU’APPELLE\n\nQu’Appelle Station.\nTHE NORTHWEST INDIANS.\n\nToronto Mail—The Indian problem, which has been before the people of the United States now three-quarters of a year, has become more acute with the entry of the Northwest into the fold of states. Nathan Richardson never dreamed that he had embarked upon a career from which he could ever escape. The Northwest has not unnerved the aborigine; but, like most of his race, he finds his efforts more than resisted when the railroad penetrates his country and subdivides his tribal domains. Until then the tide of immigration had steadily rolled westward, and the great river separating the faithful Red men from white foes, must find them themselves bequeathed in a common enemy on the eastern side of that boundary line. According to recent developments they have buried their tribal antagonisms as doomed as animals to the bonds which environ the buildings which are being set up in opposition to his beliefs. They are resolved by making him a standard against the encroaching foe. Including the Black Hawk Washing area, there are not fewer than 30 east of the river, and varying on a scale from one-half to six acres in extent. Of this number, there are not fewer than thirty-three which have the characteristic appearance of the former, each having a burial place marked by the devices supposed by the practitioner in obtaining satisfaction of his work, so long as the erections remain. These marks are said to be known only to those familiar with them, although most of these structures stand at different elevations, some being very much distinguished from others.\n\nHUDSON'S BAY RAILWAY.\n\nThe practicality of the Hudson's Bay Railway has been assured. Mr. Jarvis, the engineer of the Company, who visited England, has just returned to Canada with an examination of the route. Accompanying the party was Mr. E. J. Mosley, C. E., assistant to Mr. Sheppard, the well-known English engineer, representing the Company, who are prepared to go on with the construction of the road if found practicable. Both Mr. Jarvis and Mr. Mosley are perfectly satisfied from their personal examinations. The lowest point on land is one mile above Lake Winnipeg, and missing is the mouth of Lake Nelson River. The construction of the line will draw ships from the Nile to the Missouri, and will bring this part of the Dominion upwards of ten thousand miles nearer the markets of Europe, which means an increase in the profits of our trade, and a decrease in the rate of transport costs.\n\nCorrespondence.\n\n(One column open on all paragraphs except initial part of each paragraph.)\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every cent paid out is paid for than if we took the chance of collecting accounts at a higher figure. Besides we will thus speedily secure a larger circulation, which will enhance the value of our advertising columns. You need do nothing but sign your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1857.\n\nLiberties,\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingle and Double Rigs for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\nKept Constantly on Hand at the Lowest Rates.\n\nCash Paid for Horses & Shams\nQU'APPELLE.\n\nL. W. MULHOLLAND\nLIVERY,\nFeed and Sale Stable\nFor First Class Rigs.\nDaily Mail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of the largest and best stock he has ever had the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bells, Blankets, Cricicles, Combs and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\nAgent for Carriage & Buggy Tops.\n\nREMEMBER THE PLACE\nPioneer Harness Shop\nQU'APPELLE.\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON\nFORWARDERS.\nAND DEALERS IN\nLumber, Lath, Shingles\nDOORS, SASH\nBuilding Paper, etc.\nOffice West of C.P.R. Station.\nQU'APPELLE.\nBRANCH AT FORT QU'APPELLE.\n\nA. S. EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\n\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated. Everything New and First-Class Throughout.\nSUITES FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\nA large proportion of this Company's Lands is in highly valued Districts.\nFor Information, Plans and Maps, apply at the office of the Company, 14 Castle street, London, England; 22 Lombard street, London, England; or 306 King street, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESHELIE GORDON.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\nPROPRIETORS\nFURNITURE, FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSix Pages. Thirty Columns.\nSubscription $1.00 a Year Invariably in Advance.\nMore Reading for Less Money than any other Paper in the North-West.\n\nTHE Book & Job Printing\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nBASE-BALL IN CUBA.\n\nSpanish-American Anarchists Which Have to Be Deported for Safety.\n\nThe Spanish-American Anarchists have organized in Havana the Havana, the Almendares, and the Pina. The Havana club has about 15 members, the suburban village supplied with grain, and an agent per day for the purchase of supplies. The Almendares Club, composed of sympathizers, has about 20 members. The Pina Club is a little way out on Roca Street, near the Captains' gate. The Havana Club is the largest, and is a fine one there is an enormous model ship for the collection and also boxes, which are filled with newspapers, books, and other articles of value. The members meet once or twice a week, and have a good time. They are very friendly, and always ready to help each other.\n\nTHE GARIBALDI STATUE.\n\nMr. E. F. H. Smith, the famous sculptor, has been engaged to make a statue of Garibaldi. It is to be placed in the Capitol Square.\n\nWHY DOES THE BOY WHISTLE?\n\nA Question Without Answer.\n\nThere is a question which has puzzled many people, and which has never been answered. The question is: Why does the boy whistle? Some say it is because he is happy, others say it is because he is lonely, but no one knows for sure why he whistles.\n\nGRINNINGS.\n\nMiss Louisa New York Times. — Where do grinnings come from?\n\nThere are two stories about grinnings in the public mind,\" said a doctor in these places, who spoke to me about them. \"One is that they are caused by the consumption of certain foods, and the other is that they are caused by the consumption of certain drinks.\"\n\nGRINNINGS.\n\nMiss Louisa New York Times. — Where do grinnings come from?\n\nThere are two stories about grinnings in the public mind,\" said a doctor in these places, who spoke to me about them. \"One is that they are caused by the consumption of certain foods, and the other is that they are caused by the consumption of certain drinks.\"\nRapid City Ripples.\n\nSome parties have received satisfactory assurances that Mr. Boyd has completed arrangements for the continuation of the M. N. W. H. next season.\n\nThe Saskatchewan council have given in the economy, perhaps to the extent of two-thirds, and the members have been very much reduced. The clerk, who received $200 from the donors, has now been paid only $80. The treasurer from $60 to $40, and the assessor from $50 to $40.\n\nBrandon butchers are awaiting this year's market, and some of them are paying good prices. Though all the pastures there is not likely to be an over-production of stock in this coming season, yet the market will be more active than usual.\n\nCONSUMPTION CURED.\n\nAn old physician, raised from practice, having lived in his house by his own means, has formed a sample which he says will cure consumption. He has been engaged in the manufacture of this article for many years, and has found that it is quite effective. It is made from the bark of the ash tree, and is said to be very wholesome.\n\nLiquor License Act.\n\nThe following application for Liquor license has been approved by the Board of Trustees:\n\nGeorge D. Scott, M.D., Morden, Manitoba.\n\nWm. Thompson, Oak Lake.\n\nE. A. Taylor, Winnipeg.\n\nApplications may be filed at the office of the Board of Trustees, Winnipeg, Dec. 27th, 1883.\n\nGRAND COLONIAL EXHIBITION.\n\nIn London, England, 1883.\n\nForty-four thousand feet reserved for Canada.\n\nFirst Royal Exhibition Commission since 1862.\n\nThe Colonial and Indian Exhibition, now being held in London, England, is intended to be the largest and most important exhibition ever held in Great Britain. It is expected to attract a large number of visitors, and to be attended by representatives of many countries.\n\nThe Canadian Government has sent a large delegation to attend the exhibition, and to take part in the various activities connected with it. The Canadian Government has also sent a large number of exhibits, which are now on display in the Exhibition Hall.\n\nThe exhibition is open to the public daily, from 10 a.m. to 6 p.m., and is free of charge.\n\nCorinthian Lodge, No. 15\n\nA.F. & A.M. G.R.M.\n\nThe Corinthian Communication of the Masonic Order of Manitoba.\n\nMeeting every month.\n\nW. J. Webb, Secretary.\n\nMILLS & MILLER,\n\nAttorneys, Solicitors, Notaries, Commissioners, etc.\n\nMONEY TO LOAN.\n\nDavid Butchart,\n\nTAYLOR,\n\nNext Door to Standard Office,\n\nRapid City.\n\nQUEEN'S HOTEL,\n\nGOOD BOARD AND STYLING.\n\nTHOS. HICKS Prop.\n\nMRS. B. BUTCHART,\n\nMeals and Lodging.\n\nSecond story, Rapid City.\n\nAnd the old Worldly, friendly comfort.\n\nEvery man and woman will find good accommodation.\n\nTHE STANDARD,\n\nWeekly Paper.\n\nHOW TO MAKE A CUP OF COFFEE.\n\nExcellent Coffee.\n\nAt a moment's notice anywhere.\n\nLyman's Concentrated Extract of Coffee.\n\nPrepared by a New Scientific Process.\n\nCHOICE SELECTED COFFEE.\n\nFreshly roasted and ground expressly for you.\n\nQUALITY AND FLAVOR cannot fail to be THE BEST wherever used.\n\nFor Sale by Grocers & Proprietors.\n\nTrial Size 5 cents a Bottle.\n\nFull directions with each bottle.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION.\n\nCAMPAIGN 1883-1884.\n\nMagnificent Premiums and Grand Prize Scheme.\n\nOver $1,400 worth of Handsome Prizes to be given away.\n\n100 Splendid Prizes.\n\nBalance of 1883 FREE. Only $2 to 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nHOW TO SUBSCRIBE.\n\nEnclose Two Dollars in registered letter writing name and postal address very plainly and address to\n\nFREE PRESS, WINNIPEG, MAN.\n**QU'APPHELLE**\n\n_Slight falls of “the beautiful” now nights._\n\nThe Princess association list has been and is growing rapidly.\n\n_Miss Ward, of Pleasant Plains, is visiting Miss Millholland, in this place._\n\n_A Winnipeg paper speaks of the recent cold snap as a cold wave from Ontario._\n\n_In Qu'Appelle to have an Agatha Christie Story with a full show at our next all night session._\n\n_Meets Russell & Davis have purchased in Brandon about 12,000 lbs. of grain._\n\n_Miss M. S. Nelson and Geo. Gilbert started on Wednesday for a trip to Prince Albert._\n\n_Lt.-Col. David Haughton, who was on Tour last year and lately attending a dog race meeting._\n\n_Our old townswoman, Mrs. Hemelen, of the Public Works Department, returned yesterday._\n\n_Who is he? has turned up accounts for his prolonged absence. He will appear next week._\n\n_The School Board appointed Mr. D. F. Voelker, of Elm Valley, Mark., as teacher at a salary of $50 per annum._\n\n_L. and Lola, daughter and wife, Winnipeg, Wm. Gay, Calgary, are registered at the Lehman._\n\n_Mr. T. N. Wissner, has been elected school trustee to fill the vacancy caused by the retirement of Mr. G. S. Davidson._\n\n_We would suggest that steps be taken immediately to provide some place for the sale of all kinds of grain products, especially live stock._\n\n_Inspector White- Fraser, and postman at St. Paul's, was here as he was on the lookout for some of the ardent which they have scouted._\n\n_There is a good opening in this town for a hardware house, if that day is to be held in the vicinity, and there is a demand for the article._\n\n_Mr. James J. Shortest, who dropped off while visiting in Brandon last week, was a brother-in-law of our townswoman, Mrs. Jos. Scott._\n\n_Mr. H. P. Tunney, Ass't. Postmaster, and Mr. C. W. McIntosh, Chief Tram Inspector of the Pacific Division, C. P. R., went west yesterday._\n\n_On the second page will be found a letter from a correspondent in England. The latter writes a reply to one suggesting more demurely his 4th on the question of ritualism._\n\n_Inspector White-Fraser, Secretary State B. K. Slingsby, Sec'y W. M. P. R. Gibson, Messrs. G. T. Conain, J. Wallace; Mr. Smith, G. B. Greer; Winnipeg; W. R. Jackson, Regina, Sec'y No. 13 District School Trustees Committee._\n\n_The tailoring business must be flourishing. Mr. S. H. Cassell, employed after a short vacation and much hard work, is at each end of that he requires an assistant, a good girl can operate sewing machines so as to supply Mr. Cassell tailoring department._\n\n_The Prince Albert Times is the next paper coming news from Tim Fish, editor, who went to the Fort Qu'Appelle. It is necessary to tell the Times that the Valletta, and probably many more miles, from Qu'Appelle at a pace called Ford Qu'Appelle, a sample of this town?_\n\n_On the day before the tenth anniversary of these cheerful incidents which took place in the neighborhood, both places on the same side of College Chapel, where Mr. J. Valletta's name is still in the hands of holy matrimony to Miss Emma McGavin. There have been so many other names being present at this country, it became impossible for the contributor, and the wading parties living players at the conference._\n\n_For want of space we are compelled to hold over till next week the minutes of the last Qu'Appelle council._\n\n_Majors Short and the officers of B Battery entertained Col. Richards at a private dinner at the Hotel Qu'Appelle. Several ladies attended._\n\n_Miss Love & Raymond was most excellent._\n\n_Mr. Holt, Kindom family, of this place, has returned to Ontario from a tour through Texas. It would be easy for anyone to imagine how there should ever come a storm killed cattle as compared with the Canadian North West._\n\n_Those who attended Prof. T. H. Diamond's amusements Monday evening had pronounced it very good. It was a superior exhibition, and we think the Professor was requested to repeat his wonderful performances._\n\n_Mr. Gibbison started on Tuesday evening next in the immigrating building. It was worth seeing._\n\n_His Lordship the Bishop of Qu'Appelle has given notice that the Cathedral Choir will serve at the Church to be delivered in the Government Immigrant Building, the choir to commence their duties January 1st._\n\n_Subject: \"The organization of the church in the time of the Apostles,\" On Thursday the 21st, it will be delivered. Subject: \"The centrality of the church in England,\" On Friday afternoon at two o'clock. The admission is free. It is our intention to report both lectures in full, that others may have an opportunity_\n\n_His Royal Highness, Duke of Kent, presented His Royal Highness the Duke of Kent, Archibald Macdonald, Esq., Chief Justice, Mr. W. E. Jones and Mr. J. B. Murray, Esq., Solicitor General for the District of Qu'Appelle._\n\n_Major Short is pleased to announce that the Band will meet Friday evening, at seven o'clock sharp. The music will be furnished by the Campbell Bros._\n\n_Major Short and the officers of B Battery entertained Col. Richards at a private dinner at the Hotel Qu'Appelle. Several ladies attended._\n\n_Miss Love & Raymond was most excellent._\n\n_Mr. Holt, Kindom family, of this place, has returned to Ontario from a tour through Texas. It would be easy for anyone to imagine how there should ever come a storm killed cattle as compared with the Canadian North West._\n\n_Those who attended Prof. T. H. Diamond's amusements Monday evening had pronounced it very good. It was a superior exhibition, and we think the Professor was requested to repeat his wonderful performances._\n\n_Mr. Gibbison started on Tuesday evening next in the immigrating building. It was worth seeing._\n\n_His Lordship the Bishop of Qu'Appelle has given notice that the Cathedral Choir will serve at the Church to be delivered in the Government Immigrant Building, the choir to commence their duties January 1st._\n\n_Subject: \"The organization of the church in the time of the Apostles,\" On Thursday the 21st, it will be delivered. Subject: \"The centrality of the church in England,\" On Friday afternoon at two o'clock. The admission is free. It is our intention to report both lectures in full, that others may have an opportunity to see._\n\n_His Royal Highness, Duke of Kent, presented His Royal Highness the Duke of Kent, Archibald Macdonald, Esq., Chief Justice, Mr. W. E. Jones and Mr. J. B. Murray, Esq., Solicitor General for the District of Qu'Appelle._\n\n_Major Short is pleased to announce that the Band will meet Friday evening, at seven o'clock sharp. The music will be furnished by the Campbell Bros._\n\n_His Royal Highness, Duke of Kent, presented His Royal Highness the Duke of Kent, Archibald Macdonald, Esq., Chief Justice, Mr. W. E. Jones and Mr. J. B. Murray, Esq., Solicitor General for the District of Qu'Appelle._\n\n_\n\n---\n\n**CARNEVAL OF THE WORLD**\n\nThe masquerade carnival on Saturday evening last, at Messrs. Johnson & Gorley’s, the rain, though heavy, did not prevent the arrival of many people who filled the place to overflowing.\n\nMiss Benson was beautifully costumed as a fairy. Miss Griffin was a queen, and Miss McKinney was a princess.\n\nMiss Selection was presented by the Misses Johnson as a lady who had been chosen by the ladies of the neighborhood as the most beautiful.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886012201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8902, "total-output-tokens": 5403, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2315, 1], [2315, 4901, 2], [4901, 8757, 3], [8757, 10655, 4], [10655, 14161, 5], [14161, 21388, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]